{
    "original": {
        "text": "The next day Shirley expressed to Caroline how delighted she felt that the little party had gone off so well.\n\"I rather like to entertain a circle of gentlemen,\" said she. \"It is amusing to observe how they enjoy a judiciously concocted repast. For ourselves, you see, these choice wines and these scientific dishes are of no importance to us; but gentlemen seem to retain something of the _navet_ of children about food, and one likes to please them--that is, when they show the becoming, decent self-government of our admirable rectors. I watch Moore sometimes, to try and discover how he can be pleased; but he has not that child's simplicity about him. Did you ever find out his accessible point, Caroline? you have seen more of him than I.\"\n\"It is not, at any rate, that of my uncle and Dr. Boultby,\" returned Caroline, smiling. She always felt a sort of shy pleasure in following Miss Keeldar's lead respecting the discussion of her cousin's character. Left to herself, she would never have touched on the subject; but when invited, the temptation of talking about him of whom she was ever thinking was irresistible. \"But,\" she added, \"I really don't know what it is, for I never watched Robert in my life but my scrutiny was presently baffled by finding he was watching me.\"\n\"There it is!\" exclaimed Shirley. \"You can't fix your eyes on him but his presently flash on you. He is never off his guard. He won't give you an advantage. Even when he does not look at you, his thoughts seem to be busy amongst your own thoughts, tracing your words and actions to their source, contemplating your motives at his ease. Oh! I know that sort of character, or something in the same style. It is one that piques me singularly. How does it affect you?\"\nThis question was a specimen of one of Shirley's sharp, sudden turns. Caroline used to be fluttered by them at first, but she had now got into the way of parrying these home-thrusts like a little Quakeress.\n\"Pique you? In what way does it pique you?\" she said.\n\"Here he comes!\" suddenly exclaimed Shirley, breaking off, starting up and running to the window. \"Here comes a diversion. I never told you of a superb conquest I have made lately--made at those parties to which I can never persuade you to accompany me; and the thing has been done without effort or intention on my part--that I aver. There is the bell--and, by all that's delicious! there are two of them. Do they never hunt, then, except in couples? You may have one, Lina, and you may take your choice. I hope I am generous enough. Listen to Tartar!\"\nThe black-muzzled, tawny dog, a glimpse of which was seen in the chapter which first introduced its mistress to the reader, here gave tongue in the hall, amidst whose hollow space the deep bark resounded formidably. A growl more terrible than the bark, menacing as muttered thunder, succeeded.\n\"Listen!\" again cried Shirley, laughing. \"You would think that the prelude to a bloody onslaught. They will be frightened. They don't know old Tartar as I do. They are not aware his uproars are all sound and fury, signifying nothing!\"\nSome bustle was heard. \"Down, sir, down!\" exclaimed a high-toned, imperious voice, and then came a crack of a cane or whip. Immediately there was a yell--a scutter--a run--a positive tumult.\n\"O Malone, Malone!\"\n\"Down! down! down!\" cried the high voice.\n\"He really is worrying them!\" exclaimed Shirley. \"They have struck him. A blow is what he is not used to, and will not take.\"\nOut she ran. A gentleman was fleeing up the oak staircase, making for refuge in the gallery or chambers in hot haste; another was backing fast to the stairfoot, wildly flourishing a knotty stick, at the same time reiterating, \"Down! down! down!\" while the tawny dog bayed, bellowed, howled at him, and a group of servants came bundling from the kitchen. The dog made a spring; the second gentleman turned tail and rushed after his comrade. The first was already safe in a bedroom; he held the door against his fellow--nothing so merciless as terror. But the other fugitive struggled hard; the door was about to yield to his strength.\n\"Gentlemen,\" was uttered in Miss Keeldar's silvery but vibrating tones, \"spare my locks, if you please. Calm yourselves! Come down! Look at Tartar; he won't harm a cat.\"\nShe was caressing the said Tartar. He lay crouched at her feet, his fore paws stretched out, his tail still in threatening agitation, his nostrils snorting, his bulldog eyes conscious of a dull fire. He was an honest, phlegmatic, stupid, but stubborn canine character. He loved his mistress and John--the man who fed him--but was mostly indifferent to the rest of the world. Quiet enough he was, unless struck or threatened with a stick, and that put a demon into him at once.\n\"Mr. Malone, how do you do?\" continued Shirley, lifting up her mirth-lit face to the gallery. \"That is not the way to the oak parlour; that is Mrs. Pryor's apartment. Request your friend Mr. Donne to evacuate. I shall have the greatest pleasure in receiving him in a lower room.\"\n\"Ha! ha!\" cried Malone, in hollow laughter, quitting the door, and leaning over the massive balustrade. \"Really that animal alarmed Donne. He is a little timid,\" he proceeded, stiffening himself, and walking trimly to the stairhead. \"I thought it better to follow, in order to reassure him.\"\n\"It appears you did. Well, come down, if you please.--John\" (turning to her manservant), \"go upstairs and liberate Mr. Donne.--Take care, Mr. Malone; the stairs are slippery.\"\nIn truth they were, being of polished oak. The caution came a little late for Malone. He had slipped already in his stately descent, and was only saved from falling by a clutch at the banisters, which made the whole structure creak again.\nTartar seemed to think the visitor's descent effected with unwarranted _clat_, and accordingly he growled once more. Malone, however, was no coward. The spring of the dog had taken him by surprise, but he passed him now in suppressed fury rather than fear. If a look could have strangled Tartar, he would have breathed no more. Forgetting politeness in his sullen rage, Malone pushed into the parlour before Miss Keeldar. He glanced at Miss Helstone; he could scarcely bring himself to bend to her. He glared on both the ladies. He looked as if, had either of them been his wife, he would have made a glorious husband at the moment. In each hand he seemed as if he would have liked to clutch one and gripe her to death.\nHowever, Shirley took pity. She ceased to laugh; and Caroline was too true a lady to smile even at any one under mortification. Tartar was dismissed; Peter Augustus was soothed--for Shirley had looks and tones that might soothe a very bull. He had sense to feel that, since he could not challenge the owner of the dog, he had better be civil. And civil he tried to be; and his attempts being well received, he grew presently _very_ civil and quite himself again. He had come, indeed, for the express purpose of making himself charming and fascinating. Rough portents had met him on his first admission to Fieldhead; but that passage got over, charming and fascinating he resolved to be. Like March, having come in like a lion, he purposed to go out like a lamb.\nFor the sake of air, as it appeared, or perhaps for that of ready exit in case of some new emergency arising, he took his seat,--not on the sofa, where Miss Keeldar offered him enthronization, nor yet near the fireside, to which Caroline, by a friendly sign, gently invited him, but on a chair close to the door. Being no longer sullen or furious, he grew, after his fashion, constrained and embarrassed. He talked to the ladies by fits and starts, choosing for topics whatever was most intensely commonplace. He sighed deeply, significantly, at the close of every sentence; he sighed in each pause; he sighed ere he opened his mouth. At last, finding it desirable to add ease to his other charms, he drew forth to aid him an ample silk pocket-handkerchief. This was to be the graceful toy with which his unoccupied hands were to trifle. He went to work with a certain energy. He folded the red-and-yellow square cornerwise; he whipped it open with a waft; again he folded it in narrower compass; he made of it a handsome band. To what purpose would he proceed to apply the ligature? Would he wrap it about his throat--his head? Should it be a comforter or a turban? Neither. Peter Augustus had an inventive, an original genius. He was about to show the ladies graces of action possessing at least the charm of novelty. He sat on the chair with his athletic Irish legs crossed, and these legs, in that attitude, he circled with the bandana and bound firmly together. It was evident he felt this device to be worth an encore; he repeated it more than once. The second performance sent Shirley to the window, to laugh her silent but irrepressible laugh unseen; it turned Caroline's head aside, that her long curls might screen the smile mantling on her features. Miss Helstone, indeed, was amused by more than one point in Peter's demeanour. She was edified at the complete though abrupt diversion of his homage from herself to the heiress. The 5,000 he supposed her likely one day to inherit were not to be weighed in the balance against Miss Keeldar's estate and hall. He took no pains to conceal his calculations and tactics. He pretended to no gradual change of views; he wheeled about at once. The pursuit of the lesser fortune was openly relinquished for that of the greater. On what grounds he expected to succeed in his chase himself best knew; certainly not by skilful management.\nFrom the length of time that elapsed, it appeared that John had some difficulty in persuading Mr. Donne to descend. At length, however, that gentleman appeared; nor, as he presented himself at the oak-parlour door, did he seem in the slightest degree ashamed or confused--not a whit. Donne, indeed, was of that coldly phlegmatic, immovably complacent, densely self-satisfied nature which is insensible to shame. He had never blushed in his life; no humiliation could abash him; his nerves were not capable of sensation enough to stir his life and make colour mount to his cheek; he had no fire in his blood and no modesty in his soul; he was a frontless, arrogant, decorous slip of the commonplace--conceited, inane, insipid; and this gentleman had a notion of wooing Miss Keeldar! He knew no more, however, how to set about the business than if he had been an image carved in wood. He had no idea of a taste to be pleased, a heart to be reached in courtship. His notion was, when he should have formally visited her a few times, to write a letter proposing marriage. Then he calculated she would accept him for love of his office; then they would be married; then he should be master of Fieldhead; and he should live very comfortably, have servants at his command, eat and drink of the best, and be a great man. You would not have suspected his intentions when he addressed his intended bride in an impertinent, injured tone--\"A very dangerous dog that, Miss Keeldar. I wonder you should keep such an animal.\"\n\"Do you, Mr. Donne? Perhaps you will wonder more when I tell you I am very fond of him.\"\n\"I should say you are not serious in the assertion. Can't fancy a lady fond of that brute--'tis so ugly--a mere carter's dog. Pray hang him.\"\n\"Hang what I am fond of!\"\n\"And purchase in his stead some sweetly pooty pug or poodle--something appropriate to the fair sex. Ladies generally like lap-dogs.\"\n\"Perhaps I am an exception.\"\n\"Oh, you can't be, you know. All ladies are alike in those matters. That is universally allowed.\"\n\"Tartar frightened you terribly, Mr. Donne. I hope you won't take any harm.\"\n\"That I shall, no doubt. He gave me a turn I shall not soon forget. When I _sor_ him\" (such was Mr. Donne's pronunciation) \"about to spring, I thought I should have fainted.\"\n\"Perhaps you did faint in the bedroom; you were a long time there.\"\n\"No; I bore up that I might hold the door fast. I was determined not to let any one enter. I thought I would keep a barrier between me and the enemy.\"\n\"But what if your friend Mr. Malone had been worried?\"\n\"Malone must take care of himself. Your man persuaded me to come out at last by saying the dog was chained up in his kennel. If I had not been assured of this, I would have remained all day in the chamber. But what is that? I declare the man has told a falsehood! The dog is there!\"\nAnd indeed Tartar walked past the glass door opening to the garden, stiff, tawny, and black-muzzled as ever. He still seemed in bad humour. He was growling again, and whistling a half-strangled whistle, being an inheritance from the bulldog side of his ancestry.\n\"There are other visitors coming,\" observed Shirley, with that provoking coolness which the owners of formidable-looking dogs are apt to show while their animals are all bristle and bay. Tartar sprang down the pavement towards the gate, bellowing _avec explosion_. His mistress quietly opened the glass door, and stepped out chirruping to him. His bellow was already silenced, and he was lifting up his huge, blunt, stupid head to the new callers to be patted.\n\"What! Tartar, Tartar!\" said a cheery, rather boyish voice, \"don't you know us? Good-morning, old boy!\"\nAnd little Mr. Sweeting, whose conscious good nature made him comparatively fearless of man, woman, child, or brute, came through the gate, caressing the guardian. His vicar, Mr. Hall, followed. He had no fear of Tartar either, and Tartar had no ill-will to him. He snuffed both the gentlemen round, and then, as if concluding that they were harmless, and might be allowed to pass, he withdrew to the sunny front of the hall, leaving the archway free. Mr. Sweeting followed, and would have played with him; but Tartar took no notice of his caresses. It was only his mistress's hand whose touch gave him pleasure; to all others he showed himself obstinately insensible.\nShirley advanced to meet Messrs. Hall and Sweeting, shaking hands with them cordially. They were come to tell her of certain successes they had achieved that morning in applications for subscriptions to the fund. Mr. Hall's eyes beamed benignantly through his spectacles, his plain face looked positively handsome with goodness; and when Caroline, seeing who was come, ran out to meet him, and put both her hands into his, he gazed down on her with a gentle, serene, affectionate expression that gave him the aspect of a smiling Melanchthon.\nInstead of re-entering the house, they strayed through the garden, the ladies walking one on each side of Mr. Hall. It was a breezy sunny day; the air freshened the girls' cheeks and gracefully dishevelled their ringlets. Both of them looked pretty--one gay. Mr. Hall spoke oftenest to his brilliant companion, looked most frequently at the quiet one. Miss Keeldar gathered handfuls of the profusely blooming flowers whose perfume filled the enclosure. She gave some to Caroline, telling her to choose a nosegay for Mr. Hall; and with her lap filled with delicate and splendid blossoms, Caroline sat down on the steps of a summer-house. The vicar stood near her, leaning on his cane.\nShirley, who could not be inhospitable, now called out the neglected pair in the oak parlour. She convoyed Donne past his dread enemy Tartar, who, with his nose on his fore paws, lay snoring under the meridian sun. Donne was not grateful--he never _was_ grateful for kindness and attention--but he was glad of the safeguard. Miss Keeldar, desirous of being impartial, offered the curates flowers. They accepted them with native awkwardness. Malone seemed specially at a loss, when a bouquet filled one hand, while his shillelah occupied the other. Donne's \"Thank you!\" was rich to hear. It was the most fatuous and arrogant of sounds, implying that he considered this offering a homage to his merits, and an attempt on the part of the heiress to ingratiate herself into his priceless affections. Sweeting alone received the posy like a smart, sensible little man, as he was, putting it gallantly and nattily into his buttonhole.\nAs a reward for his good manners, Miss Keeldar, beckoning him apart, gave him some commission, which made his eyes sparkle with glee. Away he flew, round by the courtyard to the kitchen. No need to give him directions; he was always at home everywhere. Ere long he reappeared, carrying a round table, which he placed under the cedar; then he collected six garden-chairs from various nooks and bowers in the grounds, and placed them in a circle. The parlour-maid--Miss Keeldar kept no footman--came out, bearing a napkin-covered tray. Sweeting's nimble fingers aided in disposing glasses, plates, knives, and forks; he assisted her too in setting forth a neat luncheon, consisting of cold chicken, ham, and tarts.\nThis sort of impromptu regale it was Shirley's delight to offer any chance guests; and nothing pleased her better than to have an alert, obliging little friend, like Sweeting, to run about her hand, cheerily receive and briskly execute her hospitable hints. David and she were on the best terms in the world; and his devotion to the heiress was quite disinterested, since it prejudiced in nothing his faithful allegiance to the magnificent Dora Sykes.\nThe repast turned out a very merry one. Donne and Malone, indeed, contributed but little to its vivacity, the chief part they played in it being what concerned the knife, fork, and wine-glass; but where four such natures as Mr. Hall, David Sweeting, Shirley, and Caroline were assembled in health and amity, on a green lawn, under a sunny sky, amidst a wilderness of flowers, there could not be ungenial dullness.\nIn the course of conversation Mr. Hall reminded the ladies that Whitsuntide was approaching, when the grand united Sunday-school tea-drinking and procession of the three parishes of Briarfield, Whinbury, and Nunnely were to take place. Caroline, he knew, would be at her post as teacher, he said, and he hoped Miss Keeldar would not be wanting. He hoped she would make her first public appearance amongst them at that time. Shirley was not the person to miss an occasion of this sort. She liked festive excitement, a gathering of happiness, a concentration and combination of pleasant details, a throng of glad faces, a muster of elated hearts. She told Mr. Hall they might count on her with security. She did not know what she would have to do, but they might dispose of her as they pleased.\n\"And,\" said Caroline, \"you will promise to come to my table, and to sit near me, Mr. Hall?\"\n\"I shall not fail, _Deo volente_,\" said he.--\"I have occupied the place on her right hand at these monster tea-drinkings for the last six years,\" he proceeded, turning to Miss Keeldar. \"They made her a Sunday-school teacher when she was a little girl of twelve. She is not particularly self-confident by nature, as you may have observed; and the first time she had to 'take a tray,' as the phrase is, and make tea in public, there was some piteous trembling and flushing. I observed the speechless panic, the cups shaking in the little hand, and the overflowing teapot filled too full from the urn. I came to her aid, took a seat near her, managed the urn and the slop-basin, and in fact made the tea for her like any old woman.\"\n\"I was very grateful to you,\" interposed Caroline.\n\"You were. You told me so with an earnest sincerity that repaid me well, inasmuch as it was not like the majority of little ladies of twelve, whom you may help and caress for ever without their evincing any quicker sense of the kindness done and meant than if they were made of wax and wood instead of flesh and nerves.--She kept close to me, Miss Keeldar, the rest of the evening, walking with me over the grounds where the children were playing; she followed me into the vestry when all were summoned into church; she would, I believe, have mounted with me to the pulpit, had I not taken the previous precaution of conducting her to the rectory pew.\"\n\"And he has been my friend ever since,\" said Caroline.\n\"And always sat at her table, near her tray, and handed the cups--that is the extent of my services. The next thing I do for her will be to marry her some day to some curate or mill-owner.--But mind, Caroline, I shall inquire about the bridegroom's character; and if he is not a gentleman likely to render happy the little girl who walked with me hand in hand over Nunnely Common, I will not officiate. So take care.\"\n\"The caution is useless. I am not going to be married. I shall live single, like your sister Margaret, Mr. Hall.\"\n\"Very well. You might do worse. Margaret is not unhappy. She has her books for a pleasure, and her brother for a care, and is content. If ever you want a home, if the day should come when Briarfield rectory is yours no longer, come to Nunnely vicarage. Should the old maid and bachelor be still living, they will make you tenderly welcome.\"\n\"There are your flowers. Now,\" said Caroline, who had kept the nosegay she had selected for him till this moment, \"_you_ don't care for a bouquet, but you must give it to Margaret; only--to be sentimental for once--keep that little forget-me-not, which is a wild flower I gathered from the grass; and--to be still more sentimental--let me take two or three of the blue blossoms and put them in my souvenir.\"\nAnd she took out a small book with enamelled cover and silver clasp, wherein, having opened it, she inserted the flowers, writing round them in pencil, \"To be kept for the sake of the Rev. Cyril Hall, my friend. May --, 18--.\"\nThe Rev. Cyril Hall, on his part, also placed a sprig in safety between the leaves of a pocket Testament. He only wrote on the margin, \"Caroline.\"\n\"Now,\" said he, smiling, \"I trust we are romantic enough. Miss Keeldar,\" he continued (the curates, by-the-bye, during this conversation, were too much occupied with their own jokes to notice what passed at the other end of the table), \"I hope you are laughing at this trait of '_exaltation_' in the old gray-headed vicar; but the fact is, I am so used to comply with the requests of this young friend of yours, I don't know how to refuse her when she tells me to do anything. You would say it is not much in my way to traffic with flowers and forget-me-nots; but, you see, when requested to be sentimental, I am obedient.\"\n\"He is naturally rather sentimental,\" remarked Caroline. \"Margaret told me so, and I know what pleases him.\"\n\"That you should be good and happy? Yes; that is one of my greatest pleasures. May God long preserve to you the blessings of peace and innocence! By which phrase I mean _comparative_ innocence; for in His sight, I am well aware, _none_ are pure. What to our human perceptions looks spotless as we fancy angels, is to Him but frailty, needing the blood of His Son to cleanse, and the strength of His Spirit to sustain. Let us each and all cherish humility--I, as you, my young friends; and we may well do it when we look into our own hearts, and see there temptations, inconsistencies, propensities, even we blush to recognize. And it is not youth, nor good looks, nor grace, nor any gentle outside charm which makes either beauty or goodness in God's eyes.--Young ladies, when your mirror or men's tongues flatter you, remember that, in the sight of her Maker, Mary Ann Ainley--a woman whom neither glass nor lips have ever panegyrized--is fairer and better than either of you. She is indeed,\" he added, after a pause--\"she is indeed. You young things, wrapt up in yourselves and in earthly hopes, scarcely live as Christ lived. Perhaps you cannot do it yet, while existence is so sweet and earth so smiling to you; it would be too much to expect. She, with meek heart and due reverence, treads close in her Redeemer's steps.\"\nHere the harsh voice of Donne broke in on the mild tones of Mr. Hall. \"Ahem!\" he began, clearing his throat evidently for a speech of some importance--\"ahem! Miss Keeldar, your attention an instant, if you please.\"\n\"Well,\" said Shirley nonchalantly, \"what is it? I listen. All of me is ear that is not eye.\"\n\"I hope part of you is hand also,\" returned Donne, in his vulgarly presumptuous and familiar style, \"and part purse. It is to the hand and purse I propose to appeal. I came here this morning with a view to beg of you----\"\n\"You should have gone to Mrs. Gill; she is my almoner.\"\n\"To beg of you a subscription to a school. I and Dr. Boultby intend to erect one in the hamlet of Ecclefigg, which is under our vicarage of Whinbury. The Baptists have got possession of it. They have a chapel there, and we want to dispute the ground.\"\n\"But I have nothing to do with Ecclefigg. I possess no property there.\"\n\"What does that signify? You're a churchwoman, ain't you?\"\n\"Admirable creature!\" muttered Shirley, under her breath. \"Exquisite address! Fine style! What raptures he excites in me!\" Then aloud, \"I am a churchwoman, certainly.\"\n\"Then you can't refuse to contribute in this case. The population of Ecclefigg are a parcel of brutes; we want to civilize them.\"\n\"Who is to be the missionary?\"\n\"Myself, probably.\"\n\"You won't fail through lack of sympathy with your flock.\"\n\"I hope not--I expect success; but we must have money. There is the paper. Pray give a handsome sum.\"\nWhen asked for money, Shirley rarely held back. She put down her name for 5. After the 300 she had lately given, and the many smaller sums she was giving constantly, it was as much as she could at present afford. Donne looked at it, declared the subscription \"shabby,\" and clamorously demanded more. Miss Keeldar flushed up with some indignation and more astonishment.\n\"At present I shall give no more,\" said she.\n\"Not give more! Why, I expected you to head the list with a cool hundred. With your property, you should never put down a signature for less.\"\nShe was silent.\n\"In the south,\" went on Donne, \"a lady with a thousand a year would be ashamed to give five pounds for a public object.\"\nShirley, so rarely haughty, looked so now. Her slight frame became nerved; her distinguished face quickened with scorn.\n\"Strange remarks?\" said she--\"most inconsiderate! Reproach in return for bounty is misplaced.\"\n\"Bounty! Do you call five pounds bounty?\"\n\"I do; and bounty which, had I not given it to Dr. Boultby's intended school, of the erection of which I approve, and in no sort to his curate, who seems ill-advised in his manner of applying for, or rather extorting, subscriptions--bounty, I repeat, which, but for this consideration, I should instantly reclaim.\"\nDonne was thick-skinned. He did not feel all or half that the tone, air, glance of the speaker expressed. He knew not on what ground he stood.\n\"Wretched place this Yorkshire,\" he went on. \"I could never have formed an idea_r_ of the country had I not seen it. And the people--rich and poor--what a set! How _corse_ and uncultivated! They would be scouted in the south.\"\nShirley leaned forwards on the table, her nostrils dilating a little, her taper fingers interlaced and compressing each other hard.\n\"The rich,\" pursued the infatuated and unconscious Donne, \"are a parcel of misers, never living as persons with their incomes ought to live. You scarsley\"--(you must excuse Mr. Donne's pronunciation, reader; it was very choice; he considered it genteel, and prided himself on his southern accent; northern ears received with singular sensations his utterance of certain words)--\"you scarsley ever see a fam'ly where a propa carriage or a reg'la butla is kep; and as to the poor--just look at them when they come crowding about the church doors on the occasion of a marriage or a funeral, clattering in clogs; the men in their shirt-sleeves and wool-combers' aprons, the women in mob-caps and bed-gowns. They positively deserve that one should turn a mad cow in amongst them to rout their rabble-ranks. He-he! what fun it would be!\"\n\"There! you have reached the climax,\" said Shirley quietly. \"You have reached the climax,\" she repeated, turning her glowing glance towards him. \"You cannot go beyond it, and,\" she added with emphasis, \"you _shall_ not, in my house.\"\nUp she rose--nobody could control her now, for she was exasperated--straight she walked to her garden gates, wide she flung them open.\n\"Walk through,\" she said austerely, \"and pretty quickly, and set foot on this pavement no more.\"\nDonne was astounded. He had thought all the time he was showing himself off to high advantage, as a lofty-souled person of the first \"ton;\" he imagined he was producing a crushing impression. Had he not expressed disdain of everything in Yorkshire? What more conclusive proof could be given that he was better than anything there? And yet here was he about to be turned like a dog out of a Yorkshire garden! Where, under such circumstances, was the \"concatenation accordingly\"?\n\"Rid me of you instantly--instantly!\" reiterated Shirley, as he lingered.\n\"Madam--a clergyman! turn out a clergyman!\"\n\"Off! Were you an archbishop you have proved yourself no gentleman, and must go. Quick!\"\nShe was quite resolved. There was no trifling with her. Besides, Tartar was again rising; he perceived symptoms of a commotion; he manifested a disposition to join in. There was evidently nothing for it but to go, and Donne made his exodus, the heiress sweeping him a deep curtsy as she closed the gates on him.\n\"How dare the pompous priest abuse his flock! How dare the lisping cockney revile Yorkshire!\" was her sole observation on the circumstance, as she returned to the table.\nEre long the little party broke up; Miss Keeldar's ruffled and darkened brow, curled lip, and incensed eye gave no invitation to further social enjoyment.",
        "paragraph_chars": [
            [
                0,
                110
            ],
            [
                110,
                746
            ],
            [
                746,
                1282
            ],
            [
                1282,
                1747
            ],
            [
                1747,
                1954
            ],
            [
                1954,
                2008
            ],
            [
                2008,
                2562
            ],
            [
                2562,
                2856
            ],
            [
                2856,
                3091
            ],
            [
                3091,
                3282
            ],
            [
                3282,
                3302
            ],
            [
                3302,
                3344
            ],
            [
                3344,
                3470
            ],
            [
                3470,
                4104
            ],
            [
                4104,
                4274
            ],
            [
                4274,
                4751
            ],
            [
                4751,
                5031
            ],
            [
                5031,
                5323
            ],
            [
                5323,
                5499
            ],
            [
                5499,
                5738
            ],
            [
                5738,
                6458
            ],
            [
                6458,
                7220
            ],
            [
                7220,
                9608
            ],
            [
                9608,
                11119
            ],
            [
                11119,
                11208
            ],
            [
                11208,
                11350
            ],
            [
                11350,
                11376
            ],
            [
                11376,
                11509
            ],
            [
                11509,
                11538
            ],
            [
                11538,
                11636
            ],
            [
                11636,
                11713
            ],
            [
                11713,
                11888
            ],
            [
                11888,
                11956
            ],
            [
                11956,
                12107
            ],
            [
                12107,
                12162
            ],
            [
                12162,
                12445
            ],
            [
                12445,
                12708
            ],
            [
                12708,
                13169
            ],
            [
                13169,
                13273
            ],
            [
                13273,
                13942
            ],
            [
                13942,
                14484
            ],
            [
                14484,
                15168
            ],
            [
                15168,
                16097
            ],
            [
                16097,
                16810
            ],
            [
                16810,
                17262
            ],
            [
                17262,
                17676
            ],
            [
                17676,
                18469
            ],
            [
                18469,
                18561
            ],
            [
                18561,
                19291
            ],
            [
                19291,
                19342
            ],
            [
                19342,
                19995
            ],
            [
                19995,
                20050
            ],
            [
                20050,
                20468
            ],
            [
                20468,
                20582
            ],
            [
                20582,
                20923
            ],
            [
                20923,
                21331
            ],
            [
                21331,
                21558
            ],
            [
                21558,
                21705
            ],
            [
                21705,
                22329
            ],
            [
                22329,
                22438
            ],
            [
                22438,
                23765
            ],
            [
                23765,
                23980
            ],
            [
                23980,
                24073
            ],
            [
                24073,
                24295
            ],
            [
                24295,
                24351
            ],
            [
                24351,
                24603
            ],
            [
                24603,
                24675
            ],
            [
                24675,
                24734
            ],
            [
                24734,
                24902
            ],
            [
                24902,
                25032
            ],
            [
                25032,
                25063
            ],
            [
                25063,
                25083
            ],
            [
                25083,
                25142
            ],
            [
                25142,
                25244
            ],
            [
                25244,
                25613
            ],
            [
                25613,
                25658
            ],
            [
                25658,
                25801
            ],
            [
                25801,
                25817
            ],
            [
                25817,
                25938
            ],
            [
                25938,
                26058
            ],
            [
                26058,
                26153
            ],
            [
                26153,
                26195
            ],
            [
                26195,
                26510
            ],
            [
                26510,
                26653
            ],
            [
                26653,
                26880
            ],
            [
                26880,
                27012
            ],
            [
                27012,
                27844
            ],
            [
                27844,
                28078
            ],
            [
                28078,
                28213
            ],
            [
                28213,
                28310
            ],
            [
                28310,
                28788
            ],
            [
                28788,
                28862
            ],
            [
                28862,
                28906
            ],
            [
                28906,
                28995
            ],
            [
                28995,
                29307
            ],
            [
                29307,
                29477
            ],
            [
                29477,
                29631
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                172
            ],
            [
                172,
                245
            ],
            [
                245,
                539
            ],
            [
                539,
                657
            ],
            [
                657,
                711
            ],
            [
                711,
                746
            ],
            [
                746,
                834
            ],
            [
                834,
                959
            ],
            [
                959,
                1123
            ],
            [
                1123,
                1282
            ],
            [
                1282,
                1297
            ],
            [
                1297,
                1316
            ],
            [
                1316,
                1380
            ],
            [
                1380,
                1407
            ],
            [
                1407,
                1439
            ],
            [
                1439,
                1618
            ],
            [
                1618,
                1622
            ],
            [
                1622,
                1685
            ],
            [
                1685,
                1722
            ],
            [
                1722,
                1747
            ],
            [
                1747,
                1817
            ],
            [
                1817,
                1954
            ],
            [
                1954,
                1966
            ],
            [
                1966,
                1998
            ],
            [
                1998,
                2008
            ],
            [
                2008,
                2025
            ],
            [
                2025,
                2106
            ],
            [
                2106,
                2131
            ],
            [
                2131,
                2343
            ],
            [
                2343,
                2392
            ],
            [
                2392,
                2415
            ],
            [
                2415,
                2460
            ],
            [
                2460,
                2514
            ],
            [
                2514,
                2543
            ],
            [
                2543,
                2562
            ],
            [
                2562,
                2778
            ],
            [
                2778,
                2856
            ],
            [
                2856,
                2866
            ],
            [
                2866,
                2897
            ],
            [
                2897,
                2954
            ],
            [
                2954,
                2979
            ],
            [
                2979,
                3015
            ],
            [
                3015,
                3091
            ],
            [
                3091,
                3114
            ],
            [
                3114,
                3133
            ],
            [
                3133,
                3215
            ],
            [
                3215,
                3282
            ],
            [
                3282,
                3302
            ],
            [
                3302,
                3309
            ],
            [
                3309,
                3315
            ],
            [
                3315,
                3322
            ],
            [
                3322,
                3344
            ],
            [
                3344,
                3374
            ],
            [
                3374,
                3393
            ],
            [
                3393,
                3416
            ],
            [
                3416,
                3470
            ],
            [
                3470,
                3483
            ],
            [
                3483,
                3703
            ],
            [
                3703,
                3709
            ],
            [
                3709,
                3716
            ],
            [
                3716,
                3824
            ],
            [
                3824,
                3910
            ],
            [
                3910,
                4020
            ],
            [
                4020,
                4104
            ],
            [
                4104,
                4208
            ],
            [
                4208,
                4225
            ],
            [
                4225,
                4236
            ],
            [
                4236,
                4274
            ],
            [
                4274,
                4309
            ],
            [
                4309,
                4474
            ],
            [
                4474,
                4543
            ],
            [
                4543,
                4649
            ],
            [
                4649,
                4751
            ],
            [
                4751,
                4780
            ],
            [
                4780,
                4845
            ],
            [
                4845,
                4918
            ],
            [
                4918,
                4961
            ],
            [
                4961,
                5031
            ],
            [
                5031,
                5036
            ],
            [
                5036,
                5041
            ],
            [
                5041,
                5135
            ],
            [
                5135,
                5170
            ],
            [
                5170,
                5264
            ],
            [
                5264,
                5323
            ],
            [
                5323,
                5344
            ],
            [
                5344,
                5499
            ],
            [
                5499,
                5542
            ],
            [
                5542,
                5585
            ],
            [
                5585,
                5738
            ],
            [
                5738,
                5855
            ],
            [
                5855,
                5887
            ],
            [
                5887,
                5995
            ],
            [
                5995,
                6066
            ],
            [
                6066,
                6160
            ],
            [
                6160,
                6237
            ],
            [
                6237,
                6267
            ],
            [
                6267,
                6371
            ],
            [
                6371,
                6458
            ],
            [
                6458,
                6486
            ],
            [
                6486,
                6586
            ],
            [
                6586,
                6699
            ],
            [
                6699,
                6801
            ],
            [
                6801,
                6921
            ],
            [
                6921,
                7010
            ],
            [
                7010,
                7145
            ],
            [
                7145,
                7220
            ],
            [
                7220,
                7533
            ],
            [
                7533,
                7625
            ],
            [
                7625,
                7730
            ],
            [
                7730,
                7855
            ],
            [
                7855,
                7978
            ],
            [
                7978,
                8058
            ],
            [
                8058,
                8097
            ],
            [
                8097,
                8248
            ],
            [
                8248,
                8304
            ],
            [
                8304,
                8349
            ],
            [
                8349,
                8387
            ],
            [
                8387,
                8396
            ],
            [
                8396,
                8449
            ],
            [
                8449,
                8540
            ],
            [
                8540,
                8687
            ],
            [
                8687,
                8776
            ],
            [
                8776,
                8981
            ],
            [
                8981,
                9060
            ],
            [
                9060,
                9159
            ],
            [
                9159,
                9289
            ],
            [
                9289,
                9347
            ],
            [
                9347,
                9417
            ],
            [
                9417,
                9500
            ],
            [
                9500,
                9608
            ],
            [
                9608,
                9724
            ],
            [
                9724,
                9892
            ],
            [
                9892,
                10020
            ],
            [
                10020,
                10390
            ],
            [
                10390,
                10491
            ],
            [
                10491,
                10568
            ],
            [
                10568,
                10676
            ],
            [
                10676,
                10921
            ],
            [
                10921,
                11077
            ],
            [
                11077,
                11119
            ],
            [
                11119,
                11139
            ],
            [
                11139,
                11208
            ],
            [
                11208,
                11260
            ],
            [
                11260,
                11334
            ],
            [
                11334,
                11350
            ],
            [
                11350,
                11376
            ],
            [
                11376,
                11476
            ],
            [
                11476,
                11509
            ],
            [
                11509,
                11538
            ],
            [
                11538,
                11567
            ],
            [
                11567,
                11606
            ],
            [
                11606,
                11636
            ],
            [
                11636,
                11680
            ],
            [
                11680,
                11713
            ],
            [
                11713,
                11738
            ],
            [
                11738,
                11781
            ],
            [
                11781,
                11888
            ],
            [
                11888,
                11956
            ],
            [
                11956,
                12004
            ],
            [
                12004,
                12047
            ],
            [
                12047,
                12107
            ],
            [
                12107,
                12162
            ],
            [
                12162,
                12197
            ],
            [
                12197,
                12287
            ],
            [
                12287,
                12368
            ],
            [
                12368,
                12386
            ],
            [
                12386,
                12426
            ],
            [
                12426,
                12445
            ],
            [
                12445,
                12554
            ],
            [
                12554,
                12585
            ],
            [
                12585,
                12708
            ],
            [
                12708,
                12895
            ],
            [
                12895,
                12973
            ],
            [
                12973,
                13052
            ],
            [
                13052,
                13169
            ],
            [
                13169,
                13176
            ],
            [
                13176,
                13193
            ],
            [
                13193,
                13249
            ],
            [
                13249,
                13273
            ],
            [
                13273,
                13437
            ],
            [
                13437,
                13468
            ],
            [
                13468,
                13536
            ],
            [
                13536,
                13725
            ],
            [
                13725,
                13823
            ],
            [
                13823,
                13942
            ],
            [
                13942,
                14029
            ],
            [
                14029,
                14155
            ],
            [
                14155,
                14484
            ],
            [
                14484,
                14600
            ],
            [
                14600,
                14706
            ],
            [
                14706,
                14743
            ],
            [
                14743,
                14836
            ],
            [
                14836,
                14937
            ],
            [
                14937,
                15121
            ],
            [
                15121,
                15168
            ],
            [
                15168,
                15262
            ],
            [
                15262,
                15383
            ],
            [
                15383,
                15493
            ],
            [
                15493,
                15565
            ],
            [
                15565,
                15609
            ],
            [
                15609,
                15716
            ],
            [
                15716,
                15737
            ],
            [
                15737,
                15755
            ],
            [
                15755,
                15964
            ],
            [
                15964,
                16097
            ],
            [
                16097,
                16231
            ],
            [
                16231,
                16284
            ],
            [
                16284,
                16350
            ],
            [
                16350,
                16542
            ],
            [
                16542,
                16631
            ],
            [
                16631,
                16810
            ],
            [
                16810,
                17068
            ],
            [
                17068,
                17262
            ],
            [
                17262,
                17302
            ],
            [
                17302,
                17676
            ],
            [
                17676,
                17912
            ],
            [
                17912,
                18021
            ],
            [
                18021,
                18100
            ],
            [
                18100,
                18161
            ],
            [
                18161,
                18321
            ],
            [
                18321,
                18378
            ],
            [
                18378,
                18469
            ],
            [
                18469,
                18561
            ],
            [
                18561,
                18746
            ],
            [
                18746,
                18823
            ],
            [
                18823,
                19033
            ],
            [
                19033,
                19160
            ],
            [
                19160,
                19291
            ],
            [
                19291,
                19342
            ],
            [
                19342,
                19353
            ],
            [
                19353,
                19995
            ],
            [
                19995,
                20050
            ],
            [
                20050,
                20151
            ],
            [
                20151,
                20453
            ],
            [
                20453,
                20468
            ],
            [
                20468,
                20493
            ],
            [
                20493,
                20523
            ],
            [
                20523,
                20582
            ],
            [
                20582,
                20594
            ],
            [
                20594,
                20614
            ],
            [
                20614,
                20639
            ],
            [
                20639,
                20717
            ],
            [
                20717,
                20835
            ],
            [
                20835,
                20923
            ],
            [
                20923,
                20948
            ],
            [
                20948,
                21331
            ],
            [
                21331,
                21543
            ],
            [
                21543,
                21558
            ],
            [
                21558,
                21664
            ],
            [
                21664,
                21705
            ],
            [
                21705,
                21763
            ],
            [
                21763,
                22182
            ],
            [
                22182,
                22329
            ],
            [
                22329,
                22386
            ],
            [
                22386,
                22438
            ],
            [
                22438,
                22474
            ],
            [
                22474,
                22517
            ],
            [
                22517,
                22584
            ],
            [
                22584,
                22684
            ],
            [
                22684,
                22856
            ],
            [
                22856,
                23065
            ],
            [
                23065,
                23416
            ],
            [
                23416,
                23473
            ],
            [
                23473,
                23567
            ],
            [
                23567,
                23686
            ],
            [
                23686,
                23765
            ],
            [
                23765,
                23835
            ],
            [
                23835,
                23843
            ],
            [
                23843,
                23923
            ],
            [
                23923,
                23980
            ],
            [
                23980,
                24028
            ],
            [
                24028,
                24038
            ],
            [
                24038,
                24073
            ],
            [
                24073,
                24190
            ],
            [
                24190,
                24239
            ],
            [
                24239,
                24295
            ],
            [
                24295,
                24351
            ],
            [
                24351,
                24394
            ],
            [
                24394,
                24501
            ],
            [
                24501,
                24541
            ],
            [
                24541,
                24603
            ],
            [
                24603,
                24645
            ],
            [
                24645,
                24675
            ],
            [
                24675,
                24700
            ],
            [
                24700,
                24734
            ],
            [
                24734,
                24756
            ],
            [
                24756,
                24792
            ],
            [
                24792,
                24812
            ],
            [
                24812,
                24824
            ],
            [
                24824,
                24857
            ],
            [
                24857,
                24902
            ],
            [
                24902,
                24953
            ],
            [
                24953,
                25032
            ],
            [
                25032,
                25063
            ],
            [
                25063,
                25083
            ],
            [
                25083,
                25142
            ],
            [
                25142,
                25197
            ],
            [
                25197,
                25217
            ],
            [
                25217,
                25244
            ],
            [
                25244,
                25292
            ],
            [
                25292,
                25321
            ],
            [
                25321,
                25457
            ],
            [
                25457,
                25544
            ],
            [
                25544,
                25613
            ],
            [
                25613,
                25658
            ],
            [
                25658,
                25674
            ],
            [
                25674,
                25732
            ],
            [
                25732,
                25801
            ],
            [
                25801,
                25817
            ],
            [
                25817,
                25938
            ],
            [
                25938,
                25981
            ],
            [
                25981,
                26058
            ],
            [
                26058,
                26077
            ],
            [
                26077,
                26108
            ],
            [
                26108,
                26153
            ],
            [
                26153,
                26162
            ],
            [
                26162,
                26195
            ],
            [
                26195,
                26510
            ],
            [
                26510,
                26535
            ],
            [
                26535,
                26616
            ],
            [
                26616,
                26653
            ],
            [
                26653,
                26698
            ],
            [
                26698,
                26770
            ],
            [
                26770,
                26813
            ],
            [
                26813,
                26843
            ],
            [
                26843,
                26880
            ],
            [
                26880,
                27012
            ],
            [
                27012,
                27153
            ],
            [
                27153,
                27715
            ],
            [
                27715,
                27814
            ],
            [
                27814,
                27821
            ],
            [
                27821,
                27844
            ],
            [
                27844,
                27852
            ],
            [
                27852,
                27904
            ],
            [
                27904,
                27989
            ],
            [
                27989,
                28078
            ],
            [
                28078,
                28213
            ],
            [
                28213,
                28310
            ],
            [
                28310,
                28331
            ],
            [
                28331,
                28502
            ],
            [
                28502,
                28559
            ],
            [
                28559,
                28641
            ],
            [
                28641,
                28718
            ],
            [
                28718,
                28788
            ],
            [
                28788,
                28826
            ],
            [
                28826,
                28862
            ],
            [
                28862,
                28883
            ],
            [
                28883,
                28906
            ],
            [
                28906,
                28912
            ],
            [
                28912,
                28987
            ],
            [
                28987,
                28995
            ],
            [
                28995,
                29019
            ],
            [
                29019,
                29051
            ],
            [
                29051,
                29163
            ],
            [
                29163,
                29307
            ],
            [
                29307,
                29353
            ],
            [
                29353,
                29401
            ],
            [
                29401,
                29477
            ],
            [
                29477,
                29631
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                34,
                110
            ],
            [
                110,
                172
            ],
            [
                172,
                212
            ],
            [
                243,
                245
            ],
            [
                366,
                389
            ],
            [
                391,
                396
            ],
            [
                398,
                450
            ],
            [
                501,
                502
            ],
            [
                452,
                479
            ],
            [
                490,
                496
            ],
            [
                513,
                539
            ],
            [
                547,
                552
            ],
            [
                614,
                645
            ],
            [
                655,
                657
            ],
            [
                657,
                711
            ],
            [
                711,
                746
            ],
            [
                746,
                756
            ],
            [
                756,
                769
            ],
            [
                803,
                834
            ],
            [
                834,
                851
            ],
            [
                860,
                875
            ],
            [
                935,
                959
            ],
            [
                959,
                1074
            ],
            [
                1105,
                1123
            ],
            [
                1123,
                1177
            ],
            [
                1178,
                1179
            ],
            [
                1186,
                1200
            ],
            [
                1216,
                1231
            ],
            [
                1242,
                1282
            ],
            [
                1282,
                1297
            ],
            [
                1297,
                1316
            ],
            [
                1380,
                1407
            ],
            [
                1407,
                1439
            ],
            [
                1439,
                1473
            ],
            [
                1492,
                1502
            ],
            [
                1530,
                1548
            ],
            [
                1561,
                1604
            ],
            [
                1616,
                1618
            ],
            [
                1618,
                1622
            ],
            [
                1622,
                1651
            ],
            [
                1683,
                1685
            ],
            [
                1685,
                1687
            ],
            [
                1700,
                1722
            ],
            [
                1722,
                1747
            ],
            [
                1747,
                1817
            ],
            [
                1817,
                1839
            ],
            [
                1847,
                1884
            ],
            [
                1901,
                1909
            ],
            [
                1952,
                1954
            ],
            [
                1954,
                1966
            ],
            [
                1966,
                1977
            ],
            [
                1995,
                1998
            ],
            [
                1998,
                2008
            ],
            [
                2008,
                2013
            ],
            [
                2017,
                2022
            ],
            [
                2022,
                2025
            ],
            [
                2044,
                2065
            ],
            [
                2079,
                2106
            ],
            [
                2131,
                2187
            ],
            [
                2290,
                2297
            ],
            [
                2298,
                2328
            ],
            [
                2341,
                2343
            ],
            [
                2367,
                2392
            ],
            [
                2392,
                2415
            ],
            [
                2415,
                2422
            ],
            [
                2429,
                2433
            ],
            [
                2448,
                2460
            ],
            [
                2460,
                2482
            ],
            [
                2496,
                2514
            ],
            [
                2543,
                2562
            ],
            [
                2566,
                2579
            ],
            [
                2587,
                2590
            ],
            [
                2686,
                2715
            ],
            [
                2658,
                2661
            ],
            [
                2746,
                2755
            ],
            [
                2766,
                2778
            ],
            [
                2778,
                2785
            ],
            [
                2815,
                2843
            ],
            [
                2854,
                2856
            ],
            [
                2856,
                2866
            ],
            [
                2878,
                2897
            ],
            [
                2954,
                2979
            ],
            [
                2979,
                3015
            ],
            [
                3034,
                3091
            ],
            [
                3091,
                3114
            ],
            [
                3114,
                3133
            ],
            [
                3133,
                3205
            ],
            [
                3213,
                3215
            ],
            [
                3215,
                3243
            ],
            [
                3245,
                3254
            ],
            [
                3256,
                3261
            ],
            [
                3263,
                3282
            ],
            [
                3282,
                3302
            ],
            [
                3302,
                3309
            ],
            [
                3309,
                3313
            ],
            [
                3322,
                3344
            ],
            [
                3344,
                3374
            ],
            [
                3374,
                3393
            ],
            [
                3393,
                3416
            ],
            [
                3431,
                3448
            ],
            [
                3467,
                3470
            ],
            [
                3470,
                3483
            ],
            [
                3483,
                3546
            ],
            [
                3586,
                3607
            ],
            [
                3613,
                3665
            ],
            [
                3694,
                3703
            ],
            [
                3703,
                3707
            ],
            [
                3716,
                3725
            ],
            [
                3732,
                3741
            ],
            [
                3753,
                3824
            ],
            [
                3824,
                3910
            ],
            [
                3910,
                3967
            ],
            [
                3968,
                3986
            ],
            [
                3988,
                4019
            ],
            [
                4104,
                4116
            ],
            [
                4132,
                4177
            ],
            [
                4213,
                4225
            ],
            [
                4225,
                4236
            ],
            [
                4236,
                4274
            ],
            [
                4274,
                4291
            ],
            [
                4301,
                4309
            ],
            [
                4309,
                4366
            ],
            [
                4421,
                4447
            ],
            [
                4461,
                4474
            ],
            [
                4477,
                4503
            ],
            [
                4516,
                4543
            ],
            [
                4543,
                4573
            ],
            [
                4575,
                4594
            ],
            [
                4596,
                4603
            ],
            [
                4611,
                4649
            ],
            [
                4662,
                4668
            ],
            [
                4649,
                4661
            ],
            [
                4668,
                4697
            ],
            [
                4710,
                4741
            ],
            [
                4749,
                4751
            ],
            [
                4751,
                4780
            ],
            [
                4780,
                4798
            ],
            [
                4843,
                4845
            ],
            [
                4845,
                4846
            ],
            [
                4886,
                4918
            ],
            [
                4918,
                4950
            ],
            [
                4959,
                4961
            ],
            [
                4961,
                5031
            ],
            [
                5031,
                5036
            ],
            [
                5036,
                5041
            ],
            [
                5041,
                5054
            ],
            [
                5098,
                5114
            ],
            [
                5123,
                5135
            ],
            [
                5135,
                5142
            ],
            [
                5143,
                5170
            ],
            [
                5170,
                5190
            ],
            [
                5262,
                5264
            ],
            [
                5265,
                5323
            ],
            [
                5344,
                5374
            ],
            [
                5377,
                5447
            ],
            [
                5450,
                5499
            ],
            [
                5542,
                5585
            ],
            [
                5585,
                5730
            ],
            [
                5736,
                5738
            ],
            [
                5738,
                5744
            ],
            [
                5836,
                5855
            ],
            [
                5855,
                5887
            ],
            [
                5901,
                5995
            ],
            [
                5995,
                6066
            ],
            [
                6066,
                6087
            ],
            [
                6106,
                6160
            ],
            [
                6160,
                6223
            ],
            [
                6229,
                6237
            ],
            [
                6237,
                6246
            ],
            [
                6356,
                6358
            ],
            [
                6250,
                6265
            ],
            [
                6394,
                6433
            ],
            [
                6371,
                6383
            ],
            [
                6434,
                6437
            ],
            [
                6298,
                6302
            ],
            [
                6456,
                6458
            ],
            [
                6458,
                6484
            ],
            [
                6490,
                6548
            ],
            [
                6584,
                6586
            ],
            [
                6586,
                6634
            ],
            [
                6640,
                6647
            ],
            [
                6662,
                6667
            ],
            [
                6697,
                6699
            ],
            [
                6699,
                6705
            ],
            [
                6755,
                6758
            ],
            [
                6706,
                6724
            ],
            [
                6777,
                6799
            ],
            [
                6724,
                6725
            ],
            [
                6801,
                6804
            ],
            [
                6873,
                6882
            ],
            [
                6868,
                6872
            ],
            [
                6900,
                6921
            ],
            [
                6921,
                6983
            ],
            [
                6997,
                7009
            ],
            [
                7260,
                7267
            ],
            [
                7440,
                7442
            ],
            [
                7286,
                7290
            ],
            [
                7328,
                7346
            ],
            [
                7503,
                7533
            ],
            [
                7539,
                7575
            ],
            [
                7596,
                7625
            ],
            [
                7625,
                7668
            ],
            [
                7702,
                7706
            ],
            [
                7717,
                7728
            ],
            [
                7682,
                7688
            ],
            [
                7728,
                7730
            ],
            [
                7730,
                7762
            ],
            [
                7779,
                7829
            ],
            [
                7834,
                7836
            ],
            [
                7853,
                7854
            ],
            [
                7855,
                7863
            ],
            [
                7885,
                7931
            ],
            [
                7943,
                7978
            ],
            [
                7978,
                8058
            ],
            [
                8058,
                8078
            ],
            [
                8089,
                8097
            ],
            [
                8097,
                8163
            ],
            [
                8175,
                8195
            ],
            [
                8215,
                8248
            ],
            [
                8248,
                8255
            ],
            [
                8264,
                8272
            ],
            [
                8284,
                8289
            ],
            [
                8302,
                8304
            ],
            [
                8304,
                8337
            ],
            [
                8339,
                8348
            ],
            [
                8387,
                8396
            ],
            [
                8396,
                8417
            ],
            [
                8432,
                8449
            ],
            [
                8540,
                8612
            ],
            [
                8632,
                8687
            ],
            [
                8687,
                8775
            ],
            [
                8776,
                8835
            ],
            [
                8871,
                8944
            ],
            [
                8836,
                8839
            ],
            [
                8949,
                8954
            ],
            [
                8979,
                8981
            ],
            [
                8981,
                9017
            ],
            [
                9041,
                9048
            ],
            [
                9099,
                9159
            ],
            [
                9159,
                9210
            ],
            [
                9249,
                9289
            ],
            [
                9289,
                9320
            ],
            [
                9338,
                9347
            ],
            [
                9347,
                9415
            ],
            [
                9487,
                9498
            ],
            [
                9443,
                9450
            ],
            [
                9429,
                9435
            ],
            [
                9498,
                9500
            ],
            [
                9500,
                9551
            ],
            [
                9565,
                9569
            ],
            [
                9606,
                9608
            ],
            [
                9646,
                9657
            ],
            [
                9672,
                9676
            ],
            [
                9627,
                9631
            ],
            [
                9702,
                9711
            ],
            [
                9712,
                9722
            ],
            [
                9613,
                9616
            ],
            [
                9722,
                9724
            ],
            [
                9724,
                9743
            ],
            [
                9777,
                9779
            ],
            [
                9759,
                9767
            ],
            [
                9772,
                9773
            ],
            [
                9880,
                9883
            ],
            [
                9798,
                9800
            ],
            [
                9859,
                9866
            ],
            [
                9890,
                9892
            ],
            [
                9892,
                9918
            ],
            [
                9938,
                9995
            ],
            [
                10013,
                10020
            ],
            [
                10020,
                10085
            ],
            [
                10187,
                10196
            ],
            [
                10222,
                10229
            ],
            [
                10241,
                10249
            ],
            [
                10263,
                10272
            ],
            [
                10312,
                10316
            ],
            [
                10151,
                10154
            ],
            [
                10318,
                10323
            ],
            [
                10332,
                10390
            ],
            [
                10390,
                10432
            ],
            [
                10446,
                10491
            ],
            [
                10568,
                10583
            ],
            [
                10621,
                10676
            ],
            [
                10695,
                10731
            ],
            [
                10738,
                10739
            ],
            [
                10745,
                10766
            ],
            [
                10807,
                10810
            ],
            [
                10773,
                10806
            ],
            [
                10811,
                10920
            ],
            [
                10921,
                11007
            ],
            [
                11021,
                11033
            ],
            [
                11035,
                11077
            ],
            [
                11077,
                11119
            ],
            [
                11119,
                11139
            ],
            [
                11184,
                11208
            ],
            [
                11208,
                11209
            ],
            [
                11222,
                11225
            ],
            [
                11234,
                11241
            ],
            [
                11258,
                11260
            ],
            [
                11272,
                11291
            ],
            [
                11307,
                11311
            ],
            [
                11292,
                11297
            ],
            [
                11313,
                11332
            ],
            [
                11334,
                11350
            ],
            [
                11350,
                11355
            ],
            [
                11373,
                11376
            ],
            [
                11376,
                11389
            ],
            [
                11403,
                11407
            ],
            [
                11422,
                11435
            ],
            [
                11474,
                11476
            ],
            [
                11476,
                11509
            ],
            [
                11509,
                11538
            ],
            [
                11538,
                11567
            ],
            [
                11567,
                11604
            ],
            [
                11636,
                11680
            ],
            [
                11680,
                11713
            ],
            [
                11713,
                11738
            ],
            [
                11738,
                11781
            ],
            [
                11781,
                11787
            ],
            [
                11794,
                11797
            ],
            [
                11837,
                11888
            ],
            [
                11888,
                11956
            ],
            [
                11956,
                11962
            ],
            [
                11989,
                12004
            ],
            [
                12197,
                12287
            ],
            [
                12368,
                12386
            ],
            [
                12386,
                12395
            ],
            [
                12408,
                12426
            ],
            [
                12426,
                12445
            ],
            [
                12445,
                12478
            ],
            [
                12505,
                12511
            ],
            [
                12485,
                12489
            ],
            [
                12552,
                12554
            ],
            [
                12554,
                12583
            ],
            [
                12585,
                12611
            ],
            [
                12706,
                12708
            ],
            [
                12708,
                12765
            ],
            [
                12771,
                12833
            ],
            [
                12842,
                12895
            ],
            [
                12895,
                12908
            ],
            [
                12927,
                12954
            ],
            [
                12973,
                13032
            ],
            [
                13044,
                13052
            ],
            [
                13052,
                13122
            ],
            [
                13131,
                13169
            ],
            [
                13169,
                13176
            ],
            [
                13176,
                13182
            ],
            [
                13190,
                13193
            ],
            [
                13193,
                13230
            ],
            [
                13249,
                13273
            ],
            [
                13273,
                13297
            ],
            [
                13349,
                13371
            ],
            [
                13380,
                13426
            ],
            [
                13435,
                13437
            ],
            [
                13437,
                13468
            ],
            [
                13468,
                13499
            ],
            [
                13534,
                13536
            ],
            [
                13539,
                13565
            ],
            [
                13571,
                13624
            ],
            [
                13655,
                13697
            ],
            [
                13723,
                13724
            ],
            [
                13942,
                13961
            ],
            [
                13967,
                13992
            ],
            [
                14018,
                14029
            ],
            [
                14029,
                14058
            ],
            [
                14067,
                14110
            ],
            [
                14124,
                14155
            ],
            [
                14155,
                14177
            ],
            [
                14212,
                14228
            ],
            [
                14236,
                14288
            ],
            [
                14311,
                14373
            ],
            [
                14379,
                14390
            ],
            [
                14393,
                14399
            ],
            [
                14409,
                14418
            ],
            [
                14482,
                14484
            ],
            [
                14484,
                14600
            ],
            [
                14600,
                14615
            ],
            [
                14616,
                14706
            ],
            [
                14743,
                14794
            ],
            [
                14795,
                14836
            ],
            [
                14836,
                14869
            ],
            [
                14893,
                14900
            ],
            [
                15048,
                15051
            ],
            [
                14941,
                15047
            ],
            [
                15061,
                15104
            ],
            [
                14870,
                14873
            ],
            [
                15107,
                15121
            ],
            [
                15121,
                15168
            ],
            [
                15168,
                15175
            ],
            [
                15208,
                15262
            ],
            [
                15262,
                15265
            ],
            [
                15275,
                15335
            ],
            [
                15341,
                15368
            ],
            [
                15378,
                15383
            ],
            [
                15383,
                15405
            ],
            [
                15459,
                15493
            ],
            [
                15493,
                15506
            ],
            [
                15525,
                15565
            ],
            [
                15565,
                15583
            ],
            [
                15609,
                15643
            ],
            [
                15584,
                15588
            ],
            [
                15649,
                15658
            ],
            [
                15666,
                15675
            ],
            [
                15682,
                15692
            ],
            [
                15705,
                15716
            ],
            [
                15716,
                15723
            ],
            [
                15724,
                15737
            ],
            [
                15812,
                15883
            ],
            [
                15899,
                15964
            ],
            [
                15964,
                16001
            ],
            [
                16011,
                16030
            ],
            [
                16035,
                16063
            ],
            [
                16076,
                16097
            ],
            [
                16097,
                16108
            ],
            [
                16129,
                16143
            ],
            [
                16166,
                16174
            ],
            [
                16192,
                16231
            ],
            [
                16231,
                16243
            ],
            [
                16268,
                16284
            ],
            [
                16350,
                16485
            ],
            [
                16511,
                16542
            ],
            [
                16542,
                16558
            ],
            [
                16595,
                16598
            ],
            [
                16608,
                16609
            ],
            [
                16625,
                16629
            ],
            [
                16598,
                16599
            ],
            [
                16631,
                16639
            ],
            [
                16657,
                16662
            ],
            [
                16724,
                16727
            ],
            [
                16732,
                16742
            ],
            [
                16685,
                16710
            ],
            [
                16683,
                16684
            ],
            [
                16749,
                16764
            ],
            [
                16777,
                16810
            ],
            [
                16976,
                16984
            ],
            [
                16893,
                16896
            ],
            [
                16847,
                16854
            ],
            [
                17082,
                17175
            ],
            [
                16840,
                16842
            ],
            [
                17207,
                17262
            ],
            [
                17262,
                17302
            ],
            [
                17302,
                17318
            ],
            [
                17328,
                17339
            ],
            [
                17344,
                17367
            ],
            [
                17401,
                17406
            ],
            [
                17433,
                17437
            ],
            [
                17439,
                17458
            ],
            [
                17465,
                17519
            ],
            [
                17521,
                17533
            ],
            [
                17539,
                17548
            ],
            [
                17570,
                17656
            ],
            [
                17666,
                17676
            ],
            [
                17708,
                17912
            ],
            [
                17912,
                17963
            ],
            [
                17973,
                17998
            ],
            [
                18034,
                18099
            ],
            [
                18100,
                18161
            ],
            [
                18161,
                18178
            ],
            [
                18268,
                18293
            ],
            [
                18233,
                18236
            ],
            [
                18325,
                18362
            ],
            [
                18376,
                18378
            ],
            [
                18378,
                18436
            ],
            [
                18448,
                18469
            ],
            [
                18469,
                18511
            ],
            [
                18537,
                18540
            ],
            [
                18520,
                18528
            ],
            [
                18548,
                18561
            ],
            [
                18561,
                18579
            ],
            [
                18596,
                18603
            ],
            [
                18606,
                18613
            ],
            [
                18636,
                18709
            ],
            [
                18719,
                18746
            ],
            [
                18746,
                18823
            ],
            [
                18903,
                18928
            ],
            [
                18966,
                19033
            ],
            [
                19033,
                19129
            ],
            [
                19158,
                19160
            ],
            [
                19160,
                19178
            ],
            [
                19201,
                19216
            ],
            [
                19235,
                19291
            ],
            [
                19291,
                19342
            ],
            [
                19353,
                19414
            ],
            [
                19513,
                19516
            ],
            [
                19427,
                19446
            ],
            [
                19456,
                19458
            ],
            [
                19459,
                19482
            ],
            [
                19663,
                19935
            ],
            [
                19945,
                19976
            ],
            [
                19989,
                19995
            ],
            [
                19995,
                20050
            ],
            [
                20050,
                20079
            ],
            [
                20095,
                20114
            ],
            [
                20149,
                20151
            ],
            [
                20151,
                20199
            ],
            [
                20205,
                20237
            ],
            [
                20240,
                20348
            ],
            [
                20356,
                20361
            ],
            [
                20429,
                20453
            ],
            [
                20453,
                20468
            ],
            [
                20468,
                20472
            ],
            [
                20481,
                20493
            ],
            [
                20493,
                20523
            ],
            [
                20523,
                20582
            ],
            [
                20582,
                20594
            ],
            [
                20594,
                20614
            ],
            [
                20614,
                20639
            ],
            [
                20639,
                20717
            ],
            [
                20717,
                20835
            ],
            [
                20890,
                20923
            ],
            [
                20923,
                20948
            ],
            [
                20948,
                20968
            ],
            [
                21039,
                21042
            ],
            [
                21044,
                21108
            ],
            [
                21110,
                21131
            ],
            [
                21179,
                21180
            ],
            [
                21029,
                21036
            ],
            [
                21138,
                21154
            ],
            [
                21181,
                21185
            ],
            [
                21155,
                21169
            ],
            [
                21220,
                21223
            ],
            [
                21225,
                21253
            ],
            [
                21255,
                21328
            ],
            [
                21328,
                21331
            ],
            [
                21331,
                21365
            ],
            [
                21386,
                21407
            ],
            [
                21427,
                21543
            ],
            [
                21543,
                21546
            ],
            [
                21549,
                21553
            ],
            [
                21555,
                21558
            ],
            [
                21558,
                21591
            ],
            [
                21597,
                21664
            ],
            [
                21664,
                21705
            ],
            [
                21705,
                21763
            ],
            [
                21763,
                21775
            ],
            [
                21803,
                21804
            ],
            [
                21942,
                21973
            ],
            [
                22026,
                22106
            ],
            [
                22115,
                22147
            ],
            [
                22180,
                22182
            ],
            [
                22279,
                22314
            ],
            [
                22326,
                22329
            ],
            [
                22386,
                22403
            ],
            [
                22330,
                22345
            ],
            [
                22353,
                22384
            ],
            [
                22406,
                22407
            ],
            [
                22329,
                22330
            ],
            [
                22408,
                22438
            ],
            [
                22438,
                22474
            ],
            [
                22474,
                22517
            ],
            [
                22517,
                22584
            ],
            [
                22600,
                22606
            ],
            [
                22621,
                22666
            ],
            [
                22668,
                22672
            ],
            [
                22674,
                22684
            ],
            [
                22813,
                22816
            ],
            [
                22763,
                22783
            ],
            [
                22821,
                22843
            ],
            [
                22854,
                22856
            ],
            [
                22856,
                22862
            ],
            [
                22872,
                22892
            ],
            [
                22895,
                22896
            ],
            [
                22945,
                23004
            ],
            [
                23042,
                23065
            ],
            [
                23069,
                23105
            ],
            [
                23117,
                23120
            ],
            [
                23136,
                23153
            ],
            [
                23161,
                23193
            ],
            [
                23414,
                23415
            ],
            [
                23272,
                23314
            ],
            [
                23375,
                23410
            ],
            [
                23473,
                23534
            ],
            [
                23565,
                23567
            ],
            [
                23686,
                23700
            ],
            [
                23707,
                23710
            ],
            [
                23715,
                23765
            ],
            [
                23765,
                23803
            ],
            [
                23833,
                23835
            ],
            [
                23835,
                23843
            ],
            [
                23843,
                23872
            ],
            [
                23916,
                23923
            ],
            [
                23923,
                23980
            ],
            [
                23980,
                24028
            ],
            [
                24028,
                24029
            ],
            [
                24038,
                24041
            ],
            [
                24070,
                24073
            ],
            [
                24073,
                24123
            ],
            [
                24173,
                24190
            ],
            [
                24190,
                24219
            ],
            [
                24231,
                24239
            ],
            [
                24239,
                24263
            ],
            [
                24352,
                24394
            ],
            [
                24394,
                24458
            ],
            [
                24499,
                24501
            ],
            [
                24501,
                24513
            ],
            [
                24546,
                24603
            ],
            [
                24603,
                24645
            ],
            [
                24645,
                24675
            ],
            [
                24675,
                24700
            ],
            [
                24700,
                24734
            ],
            [
                24734,
                24756
            ],
            [
                24756,
                24792
            ],
            [
                24812,
                24822
            ],
            [
                24857,
                24902
            ],
            [
                24902,
                24938
            ],
            [
                24951,
                24953
            ],
            [
                24953,
                25032
            ],
            [
                25032,
                25063
            ],
            [
                25063,
                25083
            ],
            [
                25083,
                25142
            ],
            [
                25142,
                25143
            ],
            [
                25155,
                25197
            ],
            [
                25197,
                25217
            ],
            [
                25217,
                25244
            ],
            [
                25244,
                25292
            ],
            [
                25292,
                25321
            ],
            [
                25321,
                25456
            ],
            [
                25457,
                25489
            ],
            [
                25503,
                25516
            ],
            [
                25529,
                25544
            ],
            [
                25544,
                25572
            ],
            [
                25578,
                25593
            ],
            [
                25599,
                25613
            ],
            [
                25613,
                25658
            ],
            [
                25658,
                25674
            ],
            [
                25674,
                25677
            ],
            [
                25750,
                25751
            ],
            [
                25732,
                25750
            ],
            [
                25677,
                25731
            ],
            [
                25818,
                25938
            ],
            [
                25938,
                25946
            ],
            [
                25950,
                25981
            ],
            [
                25981,
                25997
            ],
            [
                26011,
                26016
            ],
            [
                26031,
                26058
            ],
            [
                26058,
                26074
            ],
            [
                26077,
                26085
            ],
            [
                26108,
                26153
            ],
            [
                26153,
                26162
            ],
            [
                26162,
                26195
            ],
            [
                26195,
                26200
            ],
            [
                26224,
                26225
            ],
            [
                26220,
                26223
            ],
            [
                26226,
                26272
            ],
            [
                26276,
                26279
            ],
            [
                26289,
                26318
            ],
            [
                26324,
                26330
            ],
            [
                26349,
                26353
            ],
            [
                26331,
                26337
            ],
            [
                26453,
                26465
            ],
            [
                26479,
                26507
            ],
            [
                26507,
                26510
            ],
            [
                26510,
                26535
            ],
            [
                26653,
                26668
            ],
            [
                26669,
                26698
            ],
            [
                26774,
                26784
            ],
            [
                26801,
                26813
            ],
            [
                26813,
                26816
            ],
            [
                26825,
                26843
            ],
            [
                26843,
                26880
            ],
            [
                26880,
                26921
            ],
            [
                26960,
                27012
            ],
            [
                27012,
                27035
            ],
            [
                27051,
                27093
            ],
            [
                27151,
                27153
            ],
            [
                27153,
                27156
            ],
            [
                27404,
                27414
            ],
            [
                27422,
                27429
            ],
            [
                27436,
                27447
            ],
            [
                27457,
                27460
            ],
            [
                27463,
                27465
            ],
            [
                27469,
                27489
            ],
            [
                27660,
                27661
            ],
            [
                27600,
                27651
            ],
            [
                27676,
                27715
            ],
            [
                27715,
                27769
            ],
            [
                27773,
                27793
            ],
            [
                27812,
                27814
            ],
            [
                27814,
                27821
            ],
            [
                27821,
                27844
            ],
            [
                27844,
                27852
            ],
            [
                27852,
                27902
            ],
            [
                27947,
                27989
            ],
            [
                27989,
                28050
            ],
            [
                28052,
                28057
            ],
            [
                28059,
                28078
            ],
            [
                28078,
                28089
            ],
            [
                28119,
                28120
            ],
            [
                28159,
                28186
            ],
            [
                28196,
                28206
            ],
            [
                28187,
                28191
            ],
            [
                28207,
                28213
            ],
            [
                28213,
                28226
            ],
            [
                28261,
                28268
            ],
            [
                28226,
                28250
            ],
            [
                28270,
                28310
            ],
            [
                28310,
                28331
            ],
            [
                28331,
                28345
            ],
            [
                28359,
                28447
            ],
            [
                28450,
                28502
            ],
            [
                28502,
                28559
            ],
            [
                28559,
                28641
            ],
            [
                28641,
                28679
            ],
            [
                28680,
                28699
            ],
            [
                28710,
                28717
            ],
            [
                28862,
                28868
            ],
            [
                28881,
                28883
            ],
            [
                28883,
                28906
            ],
            [
                28906,
                28912
            ],
            [
                28912,
                28977
            ],
            [
                28978,
                28987
            ],
            [
                28987,
                28995
            ],
            [
                29019,
                29051
            ],
            [
                29051,
                29121
            ],
            [
                29161,
                29163
            ],
            [
                29163,
                29172
            ],
            [
                29183,
                29227
            ],
            [
                29234,
                29307
            ],
            [
                29307,
                29353
            ],
            [
                29353,
                29365
            ],
            [
                29374,
                29401
            ],
            [
                29401,
                29425
            ],
            [
                29445,
                29477
            ],
            [
                29481,
                29631
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                172
            ],
            [
                172,
                245
            ],
            [
                245,
                539
            ],
            [
                539,
                657
            ],
            [
                657,
                711
            ],
            [
                711,
                746
            ],
            [
                746,
                834
            ],
            [
                834,
                959
            ],
            [
                959,
                1123
            ],
            [
                1123,
                1282
            ],
            [
                1282,
                1297
            ],
            [
                1297,
                1316
            ],
            [
                1316,
                1380
            ],
            [
                1380,
                1407
            ],
            [
                1407,
                1439
            ],
            [
                1439,
                1618
            ],
            [
                1618,
                1622
            ],
            [
                1622,
                1685
            ],
            [
                1685,
                1722
            ],
            [
                1722,
                1747
            ],
            [
                1747,
                1817
            ],
            [
                1817,
                1954
            ],
            [
                1954,
                1966
            ],
            [
                1966,
                1998
            ],
            [
                1998,
                2008
            ],
            [
                2008,
                2025
            ],
            [
                2025,
                2106
            ],
            [
                2106,
                2131
            ],
            [
                2131,
                2343
            ],
            [
                2343,
                2392
            ],
            [
                2392,
                2415
            ],
            [
                2415,
                2460
            ],
            [
                2460,
                2514
            ],
            [
                2514,
                2543
            ],
            [
                2543,
                2562
            ],
            [
                2562,
                2778
            ],
            [
                2778,
                2856
            ],
            [
                2856,
                2866
            ],
            [
                2866,
                2897
            ],
            [
                2897,
                2954
            ],
            [
                2954,
                2979
            ],
            [
                2979,
                3015
            ],
            [
                3015,
                3091
            ],
            [
                3091,
                3114
            ],
            [
                3114,
                3133
            ],
            [
                3133,
                3215
            ],
            [
                3215,
                3282
            ],
            [
                3282,
                3302
            ],
            [
                3302,
                3309
            ],
            [
                3309,
                3315
            ],
            [
                3315,
                3322
            ],
            [
                3322,
                3344
            ],
            [
                3344,
                3374
            ],
            [
                3374,
                3393
            ],
            [
                3393,
                3416
            ],
            [
                3416,
                3470
            ],
            [
                3470,
                3483
            ],
            [
                3483,
                3703
            ],
            [
                3703,
                3709
            ],
            [
                3709,
                3716
            ],
            [
                3716,
                3824
            ],
            [
                3824,
                3910
            ],
            [
                3910,
                4020
            ],
            [
                4020,
                4104
            ],
            [
                4104,
                4225
            ],
            [
                4225,
                4236
            ],
            [
                4236,
                4274
            ],
            [
                4274,
                4309
            ],
            [
                4309,
                4474
            ],
            [
                4474,
                4543
            ],
            [
                4543,
                4649
            ],
            [
                4649,
                4751
            ],
            [
                4751,
                4780
            ],
            [
                4780,
                4845
            ],
            [
                4845,
                4918
            ],
            [
                4918,
                4961
            ],
            [
                4961,
                5031
            ],
            [
                5031,
                5036
            ],
            [
                5036,
                5041
            ],
            [
                5041,
                5135
            ],
            [
                5135,
                5170
            ],
            [
                5170,
                5264
            ],
            [
                5264,
                5323
            ],
            [
                5323,
                5344
            ],
            [
                5344,
                5499
            ],
            [
                5499,
                5542
            ],
            [
                5542,
                5585
            ],
            [
                5585,
                5738
            ],
            [
                5738,
                5855
            ],
            [
                5855,
                5887
            ],
            [
                5887,
                5995
            ],
            [
                5995,
                6066
            ],
            [
                6066,
                6160
            ],
            [
                6160,
                6237
            ],
            [
                6237,
                6458
            ],
            [
                6458,
                6586
            ],
            [
                6586,
                6699
            ],
            [
                6699,
                6921
            ],
            [
                6921,
                7010
            ],
            [
                7010,
                7145
            ],
            [
                7145,
                7220
            ],
            [
                7220,
                7533
            ],
            [
                7533,
                7625
            ],
            [
                7625,
                7730
            ],
            [
                7730,
                7855
            ],
            [
                7855,
                7978
            ],
            [
                7978,
                8058
            ],
            [
                8058,
                8097
            ],
            [
                8097,
                8248
            ],
            [
                8248,
                8304
            ],
            [
                8304,
                8349
            ],
            [
                8349,
                8387
            ],
            [
                8387,
                8396
            ],
            [
                8396,
                8449
            ],
            [
                8449,
                8540
            ],
            [
                8540,
                8687
            ],
            [
                8687,
                8776
            ],
            [
                8776,
                8981
            ],
            [
                8981,
                9159
            ],
            [
                9159,
                9289
            ],
            [
                9289,
                9347
            ],
            [
                9347,
                9500
            ],
            [
                9500,
                9608
            ],
            [
                9608,
                9724
            ],
            [
                9724,
                9892
            ],
            [
                9892,
                10020
            ],
            [
                10020,
                10390
            ],
            [
                10390,
                10491
            ],
            [
                10491,
                10568
            ],
            [
                10568,
                10676
            ],
            [
                10676,
                10921
            ],
            [
                10921,
                11077
            ],
            [
                11077,
                11119
            ],
            [
                11119,
                11139
            ],
            [
                11139,
                11208
            ],
            [
                11208,
                11260
            ],
            [
                11260,
                11334
            ],
            [
                11334,
                11350
            ],
            [
                11350,
                11376
            ],
            [
                11376,
                11476
            ],
            [
                11476,
                11509
            ],
            [
                11509,
                11538
            ],
            [
                11538,
                11567
            ],
            [
                11567,
                11606
            ],
            [
                11606,
                11636
            ],
            [
                11636,
                11680
            ],
            [
                11680,
                11713
            ],
            [
                11713,
                11738
            ],
            [
                11738,
                11781
            ],
            [
                11781,
                11888
            ],
            [
                11888,
                11956
            ],
            [
                11956,
                12004
            ],
            [
                12004,
                12047
            ],
            [
                12047,
                12107
            ],
            [
                12107,
                12162
            ],
            [
                12162,
                12197
            ],
            [
                12197,
                12287
            ],
            [
                12287,
                12368
            ],
            [
                12368,
                12386
            ],
            [
                12386,
                12426
            ],
            [
                12426,
                12445
            ],
            [
                12445,
                12554
            ],
            [
                12554,
                12708
            ],
            [
                12708,
                12895
            ],
            [
                12895,
                12973
            ],
            [
                12973,
                13052
            ],
            [
                13052,
                13169
            ],
            [
                13169,
                13176
            ],
            [
                13176,
                13193
            ],
            [
                13193,
                13273
            ],
            [
                13273,
                13437
            ],
            [
                13437,
                13468
            ],
            [
                13468,
                13536
            ],
            [
                13536,
                13725
            ],
            [
                13725,
                13823
            ],
            [
                13823,
                13942
            ],
            [
                13942,
                14029
            ],
            [
                14029,
                14155
            ],
            [
                14155,
                14484
            ],
            [
                14484,
                14600
            ],
            [
                14600,
                14706
            ],
            [
                14706,
                14743
            ],
            [
                14743,
                14836
            ],
            [
                14836,
                15121
            ],
            [
                15121,
                15168
            ],
            [
                15168,
                15262
            ],
            [
                15262,
                15383
            ],
            [
                15383,
                15493
            ],
            [
                15493,
                15565
            ],
            [
                15565,
                15716
            ],
            [
                15716,
                15737
            ],
            [
                15737,
                15755
            ],
            [
                15755,
                15964
            ],
            [
                15964,
                16097
            ],
            [
                16097,
                16231
            ],
            [
                16231,
                16284
            ],
            [
                16284,
                16350
            ],
            [
                16350,
                16542
            ],
            [
                16542,
                16810
            ],
            [
                16810,
                17262
            ],
            [
                17262,
                17302
            ],
            [
                17302,
                17676
            ],
            [
                17676,
                17912
            ],
            [
                17912,
                18100
            ],
            [
                18100,
                18161
            ],
            [
                18161,
                18378
            ],
            [
                18378,
                18469
            ],
            [
                18469,
                18561
            ],
            [
                18561,
                18746
            ],
            [
                18746,
                18823
            ],
            [
                18823,
                19033
            ],
            [
                19033,
                19160
            ],
            [
                19160,
                19291
            ],
            [
                19291,
                19342
            ],
            [
                19342,
                19353
            ],
            [
                19353,
                19995
            ],
            [
                19995,
                20050
            ],
            [
                20050,
                20151
            ],
            [
                20151,
                20453
            ],
            [
                20453,
                20468
            ],
            [
                20468,
                20493
            ],
            [
                20493,
                20523
            ],
            [
                20523,
                20582
            ],
            [
                20582,
                20594
            ],
            [
                20594,
                20614
            ],
            [
                20614,
                20639
            ],
            [
                20639,
                20717
            ],
            [
                20717,
                20835
            ],
            [
                20835,
                20923
            ],
            [
                20923,
                20948
            ],
            [
                20948,
                21331
            ],
            [
                21331,
                21543
            ],
            [
                21543,
                21558
            ],
            [
                21558,
                21664
            ],
            [
                21664,
                21705
            ],
            [
                21705,
                21763
            ],
            [
                21763,
                22182
            ],
            [
                22182,
                22329
            ],
            [
                22329,
                22438
            ],
            [
                22438,
                22474
            ],
            [
                22474,
                22517
            ],
            [
                22517,
                22584
            ],
            [
                22584,
                22684
            ],
            [
                22684,
                22856
            ],
            [
                22856,
                23065
            ],
            [
                23065,
                23567
            ],
            [
                23567,
                23686
            ],
            [
                23686,
                23765
            ],
            [
                23765,
                23835
            ],
            [
                23835,
                23843
            ],
            [
                23843,
                23923
            ],
            [
                23923,
                23980
            ],
            [
                23980,
                24028
            ],
            [
                24028,
                24073
            ],
            [
                24073,
                24190
            ],
            [
                24190,
                24239
            ],
            [
                24239,
                24394
            ],
            [
                24394,
                24501
            ],
            [
                24501,
                24603
            ],
            [
                24603,
                24645
            ],
            [
                24645,
                24675
            ],
            [
                24675,
                24700
            ],
            [
                24700,
                24734
            ],
            [
                24734,
                24756
            ],
            [
                24756,
                24792
            ],
            [
                24792,
                24812
            ],
            [
                24812,
                24824
            ],
            [
                24824,
                24857
            ],
            [
                24857,
                24902
            ],
            [
                24902,
                24953
            ],
            [
                24953,
                25032
            ],
            [
                25032,
                25063
            ],
            [
                25063,
                25083
            ],
            [
                25083,
                25142
            ],
            [
                25142,
                25197
            ],
            [
                25197,
                25217
            ],
            [
                25217,
                25244
            ],
            [
                25244,
                25292
            ],
            [
                25292,
                25321
            ],
            [
                25321,
                25457
            ],
            [
                25457,
                25544
            ],
            [
                25544,
                25613
            ],
            [
                25613,
                25658
            ],
            [
                25658,
                25674
            ],
            [
                25674,
                25801
            ],
            [
                25801,
                25817
            ],
            [
                25817,
                25938
            ],
            [
                25938,
                25981
            ],
            [
                25981,
                26058
            ],
            [
                26058,
                26108
            ],
            [
                26108,
                26153
            ],
            [
                26153,
                26162
            ],
            [
                26162,
                26195
            ],
            [
                26195,
                26510
            ],
            [
                26510,
                26535
            ],
            [
                26535,
                26616
            ],
            [
                26616,
                26653
            ],
            [
                26653,
                26698
            ],
            [
                26698,
                26770
            ],
            [
                26770,
                26813
            ],
            [
                26813,
                26843
            ],
            [
                26843,
                26880
            ],
            [
                26880,
                27012
            ],
            [
                27012,
                27153
            ],
            [
                27153,
                27715
            ],
            [
                27715,
                27814
            ],
            [
                27814,
                27821
            ],
            [
                27821,
                27844
            ],
            [
                27844,
                27852
            ],
            [
                27852,
                27989
            ],
            [
                27989,
                28078
            ],
            [
                28078,
                28213
            ],
            [
                28213,
                28310
            ],
            [
                28310,
                28331
            ],
            [
                28331,
                28502
            ],
            [
                28502,
                28559
            ],
            [
                28559,
                28641
            ],
            [
                28641,
                28718
            ],
            [
                28718,
                28788
            ],
            [
                28788,
                28826
            ],
            [
                28826,
                28862
            ],
            [
                28862,
                28883
            ],
            [
                28883,
                28906
            ],
            [
                28906,
                28912
            ],
            [
                28912,
                28987
            ],
            [
                28987,
                28995
            ],
            [
                28995,
                29019
            ],
            [
                29019,
                29051
            ],
            [
                29051,
                29163
            ],
            [
                29163,
                29307
            ],
            [
                29307,
                29353
            ],
            [
                29353,
                29401
            ],
            [
                29401,
                29477
            ],
            [
                29477,
                29631
            ]
        ]
    },
    "abridged": {
        "text": "The next day Shirley told Caroline how delighted she felt that the little party had gone off so well.\n\"I rather like to entertain a circle of gentlemen,\" said she. \"It is amusing to observe how they enjoy their meal. They retain something of the navet of children about food, and one likes to please them - that is, when they show the decent restraint of our admirable rectors. Moore has not that child's simplicity. Did you ever find out his accessible point, Caroline? you have seen more of him than I.\"\n\"It is not food, at any rate,\" returned Caroline, smiling. She always felt a shy pleasure in discussing her cousin's character. Left to herself, she would never have touched on the subject; but when invited, the temptation of talking about him was irresistible. \"But,\" she added, \"I really don't know what it is, for whenever I watched Robert, my scrutiny was baffled by finding he was watching me.\"\n\"There it is!\" exclaimed Shirley. \"He is never off his guard. He won't give you an advantage. Even when he does not look at you, he seems to be busy tracing your words to their source, contemplating your motives. Oh! I know that sort of character. It piques me singularly. How does it affect you?\"\nThis question was a specimen of one of Shirley's sharp, sudden turns. Caroline used to be flustered by them at first, but she had now got used to parrying them.\n\"Pique you? In what way?\" she said.\n\"Here comes a diversion!\" exclaimed Shirley, breaking off and running to the window. \"I never told you of a superb conquest I have made lately, without any effort or intention on my part. By all that's delicious! there are two of them. Do they only hunt in couples? You may have one, Lina; take your choice. Listen to Tartar!\"\nHer black-muzzled dog here gave tongue in the hall, where its deep bark echoed formidably. A growl as menacing as muttered thunder followed.\n\"Listen!\" cried Shirley, laughing. \"They will be frightened. They don't know old Tartar as I do. His uproars are all sound and fury, signifying nothing!\"\nSome bustle was heard. \"Down, sir, down!\" exclaimed a high-toned, imperious voice, and then came a crack of a cane. Immediately there was a yell - a scutter - a run - a positive tumult.\n\"O Malone, Malone!\"\n\"Down! down!\" cried the high voice.\n\"He really is worrying them!\" exclaimed Shirley. \"They have struck him. He is not used to being hit.\"\nOut she ran. A gentleman was fleeing up the oak staircase, making for refuge upstairs; another was backing to the stairfoot, wildly flourishing a knotty stick, crying, \"Down! down!\" while the dog bayed and howled at him, and a group of servants came bundling from the kitchen. The dog made a spring; the second gentleman turned tail and rushed after his comrade. The first was already safe in a bedroom; he held the door closed against his fellow - nothing so merciless as terror.\n\"Gentlemen,\" said Miss Keeldar's silvery but vibrating tones, \"Calm yourselves! Come down! Look at Tartar; he won't harm a cat.\"\nShe was caressing Tartar. He lay crouched at her feet, his fore paws stretched out, snorting, his bulldog eyes holding a dull fire. His was an honest, phlegmatic, stubborn canine character. He loved his mistress and John - the man who fed him - but was indifferent to the rest of the world. He was quiet enough, unless struck or threatened, and that put a demon into him.\n\"Mr. Malone, how do you do?\" continued Shirley, smiling. \"That is Mrs. Pryor's apartment. Request your friend Mr. Donne to come out. I shall have the greatest pleasure in receiving him in a lower room.\"\n\"Ha! ha!\" cried Malone, leaning over the balustrade. \"Really, that animal alarmed Donne. He is a little timid. I thought it better to follow, in order to reassure him.\"\n\"Well, come down, if you please. John\" (turning to her manservant), \"go upstairs and liberate Mr. Donne. Take care, Mr. Malone; the stairs are slippery.\"\nThe caution came a little late for Malone. He had slipped already in his stately descent, and was only saved from falling by a clutch at the banisters, which made the whole structure creak.\nTartar growled once more. Malone, however, was no coward. The dog had taken him by surprise, but he passed him now in suppressed fury rather than fear. If a look could have strangled Tartar, he would have breathed no more. Forgetting politeness, Malone pushed into the parlour before Miss Keeldar. He glanced at Miss Helstone; he could scarcely bring himself to bow to her. He glared at both the ladies as if he would have liked to clutch one in each hand and throttle them.\nHowever, Shirley took pity and ceased to laugh; and Caroline was too true a lady to smile. Tartar was dismissed; Peter Augustus was soothed by Shirley's tones. He had the sense to feel that he had better be civil, and presently grew quite himself again. He had come, indeed, for the express purpose of making himself fascinating.\nPerhaps to allow an easy exit, he took his seat on a chair close to the door. No longer sullen or furious, he grew constrained and embarrassed. He talked to the ladies by fits and starts, on the most commonplace topics. He sighed deeply, significantly, after every sentence; he sighed in each pause; he sighed before he spoke.\nAt last, aiming to add ease to his other charms, he drew forth an ample silk pocket-handkerchief. This was to be the graceful toy with which his unoccupied hands were to trifle. He went to work with energy. He folded the red-and-yellow square cornerwise; he whipped it open; again he folded it more narrowly; he made of it a handsome band. To what would he apply it? Would he wrap it about his throat - his head?\nNeither. Peter Augustus had an original genius. He sat on the chair with his athletic Irish legs crossed, and these legs he circled with the bandana and bound firmly together. It was evident he felt this device to be worth an encore; he repeated it more than once.\nThe second performance sent Shirley to the window, to laugh silently and unseen; it turned Caroline's head aside, that her long curls might screen her smile. Miss Helstone, indeed, was amused by Peter's abrupt diversion of his homage from herself to the heiress. The 5,000 he supposed her likely one day to inherit had no weight against Miss Keeldar's estate and hall. He took no pains to conceal his tactics. He pretended to no gradual change of views; he wheeled about at once, to pursue the greater fortune of the two. On what grounds he expected to succeed in his chase, only he knew.\nIt appeared to be some time before Mr. Donne could be persuaded to descend the stairs. At length, however, he appeared, seeming not at all ashamed. Donne, indeed, was of that immovably complacent, densely self-satisfied nature which feels no shame. He had never blushed in his life; no humiliation could abash him; he had no modesty; he was arrogant, conceited and inane; and this gentleman had a notion of wooing Miss Keeldar! He knew no more, however, how to set about it than if he had been an image carved in wood. His notion was, after visiting her a few times, to write a letter proposing marriage. She would accept him for love of his position; they would be married, and he should be master of Fieldhead; he should live very comfortably, have servants at his command, eat and drink of the best, and be a great man.\nYou would not have suspected his intentions when he addressed his intended bride in an injured tone: \"A very dangerous dog that, Miss Keeldar. I wonder you should keep such an animal.\"\n\"Do you, Mr. Donne? I am very fond of him.\"\n\"You cannot be serious. A lady fond of that ugly brute - a mere carter's dog! Pray hang him.\"\n\"Hang him!\"\n\"And purchase instead some pug or poodle. Ladies generally like lap-dogs.\"\n\"Perhaps I am an exception.\"\n\"Oh, you can't be, you know. All ladies are alike in those matters.\"\n\"Tartar frightened you terribly, Mr. Donne. I hope you won't take any harm.\"\n\"That I shall, no doubt. He gave me a turn I shall not soon forget. When I saw him about to spring, I thought I should have fainted.\"\n\"Perhaps you did faint in the bedroom; you were a long time there.\"\n\"No; I was holding the door fast. Your man persuaded me to come out at last by saying the dog was chained up in his kennel. But what is that? I declare he told a falsehood! The dog is there!\"\nAnd indeed Tartar walked past the garden door. He still seemed in bad humour: he was growling again, and wheezing.\n\"There are other visitors coming,\" observed Shirley, with the provoking coolness which the owners of formidable-looking dogs tend to show while their animals are all bristle and bay. Tartar sprang towards the gate, bellowing. His mistress quietly opened the glass door, and stepped out to him. His bellow was already silenced, and he was lifting up his huge, blunt head to the new callers to be patted.\n\"What! Tartar!\" said a cheery, rather boyish voice, \"Good-morning, old boy!\"\nAnd little Mr. Sweeting, who was fearless of man, woman or brute, came through the gate, caressing the dog. His vicar, Mr. Hall, followed. He had no fear of Tartar either. Tartar snuffed both the gentlemen, and then, as if concluding that they were harmless, he withdrew to the sunny front of the hall.\nShirley advanced to greet Messrs. Hall and Sweeting cordially. They were come to tell her of successes they had achieved that morning in asking for subscriptions to the fund. Mr. Hall's eyes beamed, his plain face positively handsome with goodness; and when Caroline ran out to meet him, and put both her hands into his, he gazed on her with gentle affection.\nInstead of re-entering the house, they strayed through the garden, the ladies walking one on each side of Mr. Hall. It was a breezy, sunny day; the air freshened the girls' cheeks and gracefully dishevelled their ringlets. Mr. Hall spoke oftenest to his brilliant companion, and looked most frequently at the quiet one. Miss Keeldar gathered handfuls of flowers and gave some to Caroline, telling her to choose a nosegay for Mr. Hall; and with her lap filled with delicate blossoms, Caroline sat down on the steps of the summer-house. The vicar stood near her, leaning on his cane.\nShirley now called out the neglected pair in the oak parlour. She led Donne past his dread enemy Tartar, who, with his nose on his paws, lay snoring under the noon sun. Donne was not grateful, but he was glad of the safeguard. Miss Keeldar, wishing to be impartial, offered the curates flowers. They accepted them awkwardly; Malone seemed specially at a loss, with a bouquet filling one hand, and his shillelagh in the other. Donne's fatuous \"Thank you!\" implied that he considered this offering a homage to his merits, and an attempt by the heiress to ingratiate herself into his priceless affections. Sweeting alone received the posy like the sensible little man he was, putting it gallantly into his buttonhole.\nAs a reward, Miss Keeldar gave him an errand which made his eyes sparkle with glee. Away he flew to the kitchen. Ere long he reappeared, carrying a round table, which he placed under the cedar; then he collected six garden-chairs from various nooks, and placed them in a circle. The parlour-maid came out with a tray, and Sweeting aided her in setting out plates, knives, and forks, and a neat luncheon of cold chicken, ham, and tarts.\nDavid Sweeting and Shirley were on the best terms in the world; and his devotion to the heiress was quite disinterested, for it did not affect his faithful allegiance to the magnificent Dora Sykes.\nThe repast turned out a very merry one. Donne and Malone contributed little to its vivacity, being busy with fork and wine-glass; but with four such natures as Mr. Hall, David Sweeting, Shirley and Caroline assembled on a green lawn, under a sunny sky, amidst a wilderness of flowers, there could not be dullness.\nMr. Hall reminded the ladies that Whitsuntide was approaching, when the grand united Sunday-school tea-drinking and procession of the three parishes of Briarfield, Whinbury, and Nunnely were to take place. Caroline, he knew, would be at her post as teacher, and he hoped Miss Keeldar would make her first public appearance amongst them at that time.\nShirley was not the person to miss an occasion of this sort. She liked festive gatherings, a throng of glad faces, and told Mr. Hall they might count on her. She did not know what she would have to do, but they might order her as they pleased.\n\"And,\" said Caroline, \"you will promise to sit at my table, Mr. Hall?\"\n\"I shall not fail, \" said he. \"I have sat at her right hand at these monster tea-drinkings for the last six years,\" he continued, turning to Miss Keeldar. \"They made her a Sunday-school teacher when she was a little girl of twelve. The first time she had to make tea in public, there was some piteous trembling and flushing. I observed the speechless panic, the cups shaking in the little hand, and the overflowing teapot. I came to her aid, managed the urn, and in fact made the tea for her like any old woman.\"\n\"I was very grateful to you,\" interposed Caroline.\n\"You told me so with an earnest sincerity that repaid me well, for it was not like the manner of most little ladies of twelve. She kept close to me, Miss Keeldar, the rest of the evening, walking with me over the grounds where the children were playing; she followed me into the vestry when all were summoned into church; she would, I believe, have mounted with me to the pulpit, had I not taken the precaution of conducting her to her pew.\"\n\"And he has been my friend ever since,\" said Caroline.\n\"And always sat at her table, and handed the cups. The next thing I do for her will be to marry her one day to some curate or mill-owner. - But mind, Caroline, I shall inquire about the bridegroom's character; and if he is not a gentleman likely to make you happy, I will not officiate. So take care.\"\n\"The warning is useless. I am not going to be married. I shall live single, like your sister Margaret, Mr. Hall.\"\n\"Very well. You might do worse. Margaret is not unhappy. She has her books for a pleasure, and her brother for a care, and is content. If ever you want a home, if the day should come when Briarfield rectory is yours no longer, come to Nunnely vicarage. We will make you tenderly welcome.\"\n\"There are your flowers. Now,\" said Caroline, \"you don't care for a bouquet, but you must give it to Margaret; only, to be sentimental for a moment, keep that little wild forget-me-not, and to be still more sentimental - let me take two or three of the blue blossoms and put them in my souvenir book.\"\nAnd she took out a small book with a silver clasp, wherein she inserted the flowers, writing round them in pencil, \"To be kept for the sake of the Rev. Cyril Hall, my friend. May -, 18-.\"\nThe Rev. Cyril Hall, on his part, placed a sprig in safety between the leaves of a pocket Testament. He only wrote on the margin, \"Caroline.\"\n\"Now,\" said he, smiling, \"I trust we are romantic enough. Miss Keeldar, I hope you are laughing at this; but the fact is, I am so used to comply with the requests of this young friend, I don't know how to refuse her. When requested to be sentimental, I obey.\"\n\"Margaret told me he is naturally sentimental,\" remarked Caroline, \"and I know what pleases him.\"\n\"That you should be good and happy? Yes; that is one of my greatest pleasures. May God long preserve to you the blessings of peace and innocence! I mean comparative innocence; for in His sight, I am well aware, none are pure. All have faults and frailty, needing the strength of His Spirit. Let us all cherish humility, when we look into our own hearts, and see there temptations which we blush to recognize. It is not youth, nor good looks, nor any outer charm which makes beauty or goodness in God's eyes. In the sight of her Maker, Mary Ann Ainley is fairer and better than either of you young things, wrapt up in yourselves and in earthly hopes. She, with meekness and reverence, treads close in her Redeemer's steps.\"\nHere the harsh voice of Donne broke in. \"Ahem!\" he began, clearing his throat importantly. \"Ahem! Miss Keeldar, your attention an instant, if you please.\"\n\"Well,\" said Shirley nonchalantly, \"what is it? I am all ears.\"\n\"I hope part of you is hand also,\" returned Donne, \"and part purse. It is to the hand and purse I appeal. I came here this morning to beg of you a subscription to a school. I and Dr. Boultby intend to erect one in the hamlet of Ecclefigg. The Baptists have a chapel there, and we want to dispute the ground.\"\n\"But I have nothing to do with Ecclefigg. I possess no property there.\"\n\"What does that signify? You're a churchwoman, ain't you?\"\n\"Admirable creature!\" muttered Shirley, under her breath. \"Fine style!\" Then aloud, \"I am a churchwoman, certainly.\"\n\"Then you can't refuse to contribute. The population of Ecclefigg are a parcel of brutes; we want to civilize them.\"\n\"Who is to be the missionary?\"\n\"Myself, probably.\"\n\"You won't fail through lack of sympathy with your flock.\"\n\"I expect success; but we must have money. There is the paper. Pray give a handsome sum.\"\nWhen asked for money, Shirley rarely held back. She put down her name for 5. After the 300 she had lately given, and the many smaller sums she was giving constantly, it was as much as she could at present afford.\nDonne looked at it, declared the amount \"shabby,\" and loudly demanded more. Miss Keeldar flushed up with indignation and astonishment.\n\"At present I shall give no more,\" said she.\n\"Not give more! Why, with your property, I expected you to head the list with a cool hundred. In the south,\" went on Donne, \"a lady with a thousand a year would be ashamed to give five pounds for a public object.\"\nShirley, rarely haughty, looked so now. Her slight frame tensed; her face quickened with scorn.\n\"Strange remarks,\" said she. \"Reproach in return for bounty is misplaced.\"\n\"Bounty! Do you call five pounds bounty?\"\n\"I do. If I had not given it to Dr. Boultby's intended school, the building of which I approve, and in no way to his ill-mannered curate - but for this, I should instantly reclaim it.\"\nDonne was thick-skinned. \"Wretched place, this Yorkshire,\" he went on. \"The people - what a set! How coarse and uncultivated! They would be scouted in the south.\"\nShirley leaned forwards on the table, her fingers interlaced and compressing each other hard.\n\"The rich,\" pursued the unconscious Donne, \"are a parcel of misers. You scarcely ever see a family where a proper carriage or butler is kept; and as to the poor - clattering in clogs; the men in their shirt-sleeves, the women in mob-caps and bed-gowns. They positively deserve that one should turn a mad cow amongst them to rout them. He-he! what fun it would be!\"\n\"There! you have reached the climax,\" said Shirley quietly, turning her glowing glance towards him. \"You cannot go beyond it, and,\" she added with emphasis, \"you shall not, in my house.\"\nUp she rose, walked to her garden gates, and flung them wide open.\n\"Walk through quickly,\" she said austerely, \"and set foot on this pavement no more.\"\nDonne was astounded. He had thought he was showing himself off to high advantage, as a lofty-souled person of the first \"ton\"; he imagined he was producing a crushing impression. Had he not expressed disdain of everything in Yorkshire? What more conclusive proof could be given that he was better than anything there? And yet here was he about to be turned out like a dog out of a garden!\n\"Madam! turn out a clergyman!\"\n\"Off! Were you an archbishop you have proved yourself no gentleman, and you must go. Quick!\"\nThere was no trifling with her. Besides, Tartar was again rising; he perceived symptoms of a commotion. There was nothing for it but to go, and Donne made his exit, the heiress sweeping him a deep curtsy as she closed the gates on him.\n\"How dare the pompous priest abuse his flock! How dare the cockney revile Yorkshire!\" was her sole observation, as she returned to the table.\nBefore long the little party broke up; Miss Keeldar's ruffled and darkened brow, curled lip, and incensed eye gave no invitation to further social enjoyment.",
        "paragraph_chars": [
            [
                0,
                102
            ],
            [
                102,
                506
            ],
            [
                506,
                906
            ],
            [
                906,
                1204
            ],
            [
                1204,
                1365
            ],
            [
                1365,
                1401
            ],
            [
                1401,
                1728
            ],
            [
                1728,
                1869
            ],
            [
                1869,
                2023
            ],
            [
                2023,
                2209
            ],
            [
                2209,
                2229
            ],
            [
                2229,
                2265
            ],
            [
                2265,
                2367
            ],
            [
                2367,
                2848
            ],
            [
                2848,
                2977
            ],
            [
                2977,
                3349
            ],
            [
                3349,
                3552
            ],
            [
                3552,
                3721
            ],
            [
                3721,
                3875
            ],
            [
                3875,
                4065
            ],
            [
                4065,
                4540
            ],
            [
                4540,
                4870
            ],
            [
                4870,
                5197
            ],
            [
                5197,
                5610
            ],
            [
                5610,
                5875
            ],
            [
                5875,
                6464
            ],
            [
                6464,
                7287
            ],
            [
                7287,
                7472
            ],
            [
                7472,
                7516
            ],
            [
                7516,
                7610
            ],
            [
                7610,
                7622
            ],
            [
                7622,
                7697
            ],
            [
                7697,
                7726
            ],
            [
                7726,
                7795
            ],
            [
                7795,
                7872
            ],
            [
                7872,
                8006
            ],
            [
                8006,
                8074
            ],
            [
                8074,
                8266
            ],
            [
                8266,
                8381
            ],
            [
                8381,
                8784
            ],
            [
                8784,
                8861
            ],
            [
                8861,
                9164
            ],
            [
                9164,
                9524
            ],
            [
                9524,
                10106
            ],
            [
                10106,
                10821
            ],
            [
                10821,
                11257
            ],
            [
                11257,
                11455
            ],
            [
                11455,
                11769
            ],
            [
                11769,
                12119
            ],
            [
                12119,
                12363
            ],
            [
                12363,
                12434
            ],
            [
                12434,
                12947
            ],
            [
                12947,
                12998
            ],
            [
                12998,
                13440
            ],
            [
                13440,
                13495
            ],
            [
                13495,
                13797
            ],
            [
                13797,
                13911
            ],
            [
                13911,
                14200
            ],
            [
                14200,
                14502
            ],
            [
                14502,
                14690
            ],
            [
                14690,
                14832
            ],
            [
                14832,
                15092
            ],
            [
                15092,
                15190
            ],
            [
                15190,
                15913
            ],
            [
                15913,
                16068
            ],
            [
                16068,
                16132
            ],
            [
                16132,
                16441
            ],
            [
                16441,
                16513
            ],
            [
                16513,
                16572
            ],
            [
                16572,
                16689
            ],
            [
                16689,
                16806
            ],
            [
                16806,
                16837
            ],
            [
                16837,
                16857
            ],
            [
                16857,
                16916
            ],
            [
                16916,
                17006
            ],
            [
                17006,
                17219
            ],
            [
                17219,
                17354
            ],
            [
                17354,
                17399
            ],
            [
                17399,
                17613
            ],
            [
                17613,
                17709
            ],
            [
                17709,
                17784
            ],
            [
                17784,
                17826
            ],
            [
                17826,
                18011
            ],
            [
                18011,
                18174
            ],
            [
                18174,
                18268
            ],
            [
                18268,
                18633
            ],
            [
                18633,
                18820
            ],
            [
                18820,
                18887
            ],
            [
                18887,
                18972
            ],
            [
                18972,
                19361
            ],
            [
                19361,
                19392
            ],
            [
                19392,
                19485
            ],
            [
                19485,
                19721
            ],
            [
                19721,
                19863
            ],
            [
                19863,
                20020
            ]
        ],
        "segment_chars": [
            [
                0,
                102
            ],
            [
                102,
                164
            ],
            [
                164,
                217
            ],
            [
                217,
                378
            ],
            [
                378,
                417
            ],
            [
                417,
                471
            ],
            [
                471,
                506
            ],
            [
                506,
                565
            ],
            [
                565,
                634
            ],
            [
                634,
                768
            ],
            [
                768,
                906
            ],
            [
                906,
                921
            ],
            [
                921,
                940
            ],
            [
                940,
                968
            ],
            [
                968,
                1000
            ],
            [
                1000,
                1119
            ],
            [
                1119,
                1123
            ],
            [
                1123,
                1154
            ],
            [
                1154,
                1179
            ],
            [
                1179,
                1204
            ],
            [
                1204,
                1274
            ],
            [
                1274,
                1365
            ],
            [
                1365,
                1377
            ],
            [
                1377,
                1391
            ],
            [
                1391,
                1401
            ],
            [
                1401,
                1427
            ],
            [
                1427,
                1486
            ],
            [
                1486,
                1589
            ],
            [
                1589,
                1614
            ],
            [
                1614,
                1637
            ],
            [
                1637,
                1667
            ],
            [
                1667,
                1709
            ],
            [
                1709,
                1728
            ],
            [
                1728,
                1819
            ],
            [
                1819,
                1869
            ],
            [
                1869,
                1879
            ],
            [
                1879,
                1904
            ],
            [
                1904,
                1930
            ],
            [
                1930,
                1966
            ],
            [
                1966,
                2023
            ],
            [
                2023,
                2046
            ],
            [
                2046,
                2065
            ],
            [
                2065,
                2139
            ],
            [
                2139,
                2209
            ],
            [
                2209,
                2229
            ],
            [
                2229,
                2236
            ],
            [
                2236,
                2243
            ],
            [
                2243,
                2265
            ],
            [
                2265,
                2295
            ],
            [
                2295,
                2314
            ],
            [
                2314,
                2337
            ],
            [
                2337,
                2367
            ],
            [
                2367,
                2380
            ],
            [
                2380,
                2542
            ],
            [
                2542,
                2549
            ],
            [
                2549,
                2644
            ],
            [
                2644,
                2730
            ],
            [
                2730,
                2848
            ],
            [
                2848,
                2928
            ],
            [
                2928,
                2939
            ],
            [
                2939,
                2977
            ],
            [
                2977,
                3003
            ],
            [
                3003,
                3109
            ],
            [
                3109,
                3167
            ],
            [
                3167,
                3268
            ],
            [
                3268,
                3349
            ],
            [
                3349,
                3378
            ],
            [
                3378,
                3406
            ],
            [
                3406,
                3439
            ],
            [
                3439,
                3482
            ],
            [
                3482,
                3552
            ],
            [
                3552,
                3557
            ],
            [
                3557,
                3562
            ],
            [
                3562,
                3605
            ],
            [
                3605,
                3641
            ],
            [
                3641,
                3663
            ],
            [
                3663,
                3721
            ],
            [
                3721,
                3754
            ],
            [
                3754,
                3826
            ],
            [
                3826,
                3875
            ],
            [
                3875,
                3918
            ],
            [
                3918,
                4065
            ],
            [
                4065,
                4091
            ],
            [
                4091,
                4123
            ],
            [
                4123,
                4217
            ],
            [
                4217,
                4288
            ],
            [
                4288,
                4363
            ],
            [
                4363,
                4439
            ],
            [
                4439,
                4540
            ],
            [
                4540,
                4631
            ],
            [
                4631,
                4700
            ],
            [
                4700,
                4794
            ],
            [
                4794,
                4870
            ],
            [
                4870,
                4948
            ],
            [
                4948,
                5014
            ],
            [
                5014,
                5090
            ],
            [
                5090,
                5197
            ],
            [
                5197,
                5295
            ],
            [
                5295,
                5375
            ],
            [
                5375,
                5404
            ],
            [
                5404,
                5537
            ],
            [
                5537,
                5564
            ],
            [
                5564,
                5610
            ],
            [
                5610,
                5619
            ],
            [
                5619,
                5658
            ],
            [
                5658,
                5786
            ],
            [
                5786,
                5875
            ],
            [
                5875,
                6033
            ],
            [
                6033,
                6138
            ],
            [
                6138,
                6244
            ],
            [
                6244,
                6285
            ],
            [
                6285,
                6397
            ],
            [
                6397,
                6464
            ],
            [
                6464,
                6551
            ],
            [
                6551,
                6612
            ],
            [
                6612,
                6713
            ],
            [
                6713,
                6892
            ],
            [
                6892,
                6983
            ],
            [
                6983,
                7069
            ],
            [
                7069,
                7287
            ],
            [
                7287,
                7430
            ],
            [
                7430,
                7472
            ],
            [
                7472,
                7492
            ],
            [
                7492,
                7516
            ],
            [
                7516,
                7540
            ],
            [
                7540,
                7594
            ],
            [
                7594,
                7610
            ],
            [
                7610,
                7622
            ],
            [
                7622,
                7664
            ],
            [
                7664,
                7697
            ],
            [
                7697,
                7726
            ],
            [
                7726,
                7755
            ],
            [
                7755,
                7795
            ],
            [
                7795,
                7839
            ],
            [
                7839,
                7872
            ],
            [
                7872,
                7897
            ],
            [
                7897,
                7940
            ],
            [
                7940,
                8006
            ],
            [
                8006,
                8074
            ],
            [
                8074,
                8108
            ],
            [
                8108,
                8198
            ],
            [
                8198,
                8216
            ],
            [
                8216,
                8247
            ],
            [
                8247,
                8266
            ],
            [
                8266,
                8313
            ],
            [
                8313,
                8381
            ],
            [
                8381,
                8564
            ],
            [
                8564,
                8607
            ],
            [
                8607,
                8675
            ],
            [
                8675,
                8784
            ],
            [
                8784,
                8791
            ],
            [
                8791,
                8800
            ],
            [
                8800,
                8861
            ],
            [
                8861,
                8969
            ],
            [
                8969,
                9000
            ],
            [
                9000,
                9033
            ],
            [
                9033,
                9164
            ],
            [
                9164,
                9227
            ],
            [
                9227,
                9339
            ],
            [
                9339,
                9524
            ],
            [
                9524,
                9640
            ],
            [
                9640,
                9747
            ],
            [
                9747,
                9844
            ],
            [
                9844,
                10059
            ],
            [
                10059,
                10106
            ],
            [
                10106,
                10168
            ],
            [
                10168,
                10275
            ],
            [
                10275,
                10333
            ],
            [
                10333,
                10401
            ],
            [
                10401,
                10532
            ],
            [
                10532,
                10561
            ],
            [
                10561,
                10709
            ],
            [
                10709,
                10821
            ],
            [
                10821,
                10905
            ],
            [
                10905,
                10934
            ],
            [
                10934,
                11100
            ],
            [
                11100,
                11257
            ],
            [
                11257,
                11455
            ],
            [
                11455,
                11495
            ],
            [
                11495,
                11769
            ],
            [
                11769,
                11975
            ],
            [
                11975,
                12119
            ],
            [
                12119,
                12180
            ],
            [
                12180,
                12277
            ],
            [
                12277,
                12363
            ],
            [
                12363,
                12434
            ],
            [
                12434,
                12464
            ],
            [
                12464,
                12589
            ],
            [
                12589,
                12666
            ],
            [
                12666,
                12759
            ],
            [
                12759,
                12857
            ],
            [
                12857,
                12947
            ],
            [
                12947,
                12998
            ],
            [
                12998,
                13125
            ],
            [
                13125,
                13440
            ],
            [
                13440,
                13495
            ],
            [
                13495,
                13546
            ],
            [
                13546,
                13633
            ],
            [
                13633,
                13782
            ],
            [
                13782,
                13797
            ],
            [
                13797,
                13822
            ],
            [
                13822,
                13852
            ],
            [
                13852,
                13911
            ],
            [
                13911,
                13923
            ],
            [
                13923,
                13943
            ],
            [
                13943,
                13968
            ],
            [
                13968,
                14046
            ],
            [
                14046,
                14164
            ],
            [
                14164,
                14200
            ],
            [
                14200,
                14225
            ],
            [
                14225,
                14502
            ],
            [
                14502,
                14677
            ],
            [
                14677,
                14690
            ],
            [
                14690,
                14791
            ],
            [
                14791,
                14832
            ],
            [
                14832,
                14890
            ],
            [
                14890,
                15049
            ],
            [
                15049,
                15092
            ],
            [
                15092,
                15190
            ],
            [
                15190,
                15226
            ],
            [
                15226,
                15269
            ],
            [
                15269,
                15336
            ],
            [
                15336,
                15416
            ],
            [
                15416,
                15481
            ],
            [
                15481,
                15599
            ],
            [
                15599,
                15698
            ],
            [
                15698,
                15840
            ],
            [
                15840,
                15913
            ],
            [
                15913,
                15953
            ],
            [
                15953,
                15961
            ],
            [
                15961,
                16004
            ],
            [
                16004,
                16011
            ],
            [
                16011,
                16068
            ],
            [
                16068,
                16116
            ],
            [
                16116,
                16132
            ],
            [
                16132,
                16200
            ],
            [
                16200,
                16238
            ],
            [
                16238,
                16305
            ],
            [
                16305,
                16371
            ],
            [
                16371,
                16441
            ],
            [
                16441,
                16483
            ],
            [
                16483,
                16513
            ],
            [
                16513,
                16538
            ],
            [
                16538,
                16572
            ],
            [
                16572,
                16594
            ],
            [
                16594,
                16630
            ],
            [
                16630,
                16644
            ],
            [
                16644,
                16689
            ],
            [
                16689,
                16727
            ],
            [
                16727,
                16806
            ],
            [
                16806,
                16837
            ],
            [
                16837,
                16857
            ],
            [
                16857,
                16916
            ],
            [
                16916,
                16959
            ],
            [
                16959,
                16979
            ],
            [
                16979,
                17006
            ],
            [
                17006,
                17054
            ],
            [
                17054,
                17083
            ],
            [
                17083,
                17219
            ],
            [
                17219,
                17295
            ],
            [
                17295,
                17354
            ],
            [
                17354,
                17399
            ],
            [
                17399,
                17415
            ],
            [
                17415,
                17493
            ],
            [
                17493,
                17613
            ],
            [
                17613,
                17653
            ],
            [
                17653,
                17709
            ],
            [
                17709,
                17738
            ],
            [
                17738,
                17784
            ],
            [
                17784,
                17793
            ],
            [
                17793,
                17826
            ],
            [
                17826,
                17833
            ],
            [
                17833,
                18011
            ],
            [
                18011,
                18036
            ],
            [
                18036,
                18082
            ],
            [
                18082,
                18108
            ],
            [
                18108,
                18137
            ],
            [
                18137,
                18174
            ],
            [
                18174,
                18268
            ],
            [
                18268,
                18336
            ],
            [
                18336,
                18521
            ],
            [
                18521,
                18603
            ],
            [
                18603,
                18610
            ],
            [
                18610,
                18633
            ],
            [
                18633,
                18641
            ],
            [
                18641,
                18733
            ],
            [
                18733,
                18820
            ],
            [
                18820,
                18887
            ],
            [
                18887,
                18972
            ],
            [
                18972,
                18993
            ],
            [
                18993,
                19151
            ],
            [
                19151,
                19208
            ],
            [
                19208,
                19290
            ],
            [
                19290,
                19361
            ],
            [
                19361,
                19369
            ],
            [
                19369,
                19392
            ],
            [
                19392,
                19398
            ],
            [
                19398,
                19477
            ],
            [
                19477,
                19485
            ],
            [
                19485,
                19517
            ],
            [
                19517,
                19589
            ],
            [
                19589,
                19721
            ],
            [
                19721,
                19767
            ],
            [
                19767,
                19807
            ],
            [
                19807,
                19863
            ],
            [
                19863,
                20020
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                26,
                102
            ],
            [
                102,
                164
            ],
            [
                164,
                204
            ],
            [
                215,
                217
            ],
            [
                222,
                245
            ],
            [
                246,
                251
            ],
            [
                252,
                304
            ],
            [
                305,
                306
            ],
            [
                307,
                334
            ],
            [
                335,
                341
            ],
            [
                352,
                378
            ],
            [
                378,
                383
            ],
            [
                384,
                415
            ],
            [
                415,
                417
            ],
            [
                417,
                471
            ],
            [
                471,
                506
            ],
            [
                506,
                516
            ],
            [
                521,
                534
            ],
            [
                534,
                565
            ],
            [
                565,
                582
            ],
            [
                583,
                598
            ],
            [
                610,
                634
            ],
            [
                634,
                749
            ],
            [
                750,
                768
            ],
            [
                768,
                822
            ],
            [
                832,
                833
            ],
            [
                834,
                848
            ],
            [
                850,
                865
            ],
            [
                866,
                906
            ],
            [
                906,
                921
            ],
            [
                921,
                940
            ],
            [
                941,
                968
            ],
            [
                968,
                1000
            ],
            [
                1000,
                1034
            ],
            [
                1044,
                1054
            ],
            [
                1055,
                1073
            ],
            [
                1074,
                1117
            ],
            [
                1117,
                1119
            ],
            [
                1119,
                1123
            ],
            [
                1123,
                1152
            ],
            [
                1152,
                1154
            ],
            [
                1154,
                1156
            ],
            [
                1157,
                1179
            ],
            [
                1179,
                1204
            ],
            [
                1204,
                1274
            ],
            [
                1274,
                1296
            ],
            [
                1304,
                1341
            ],
            [
                1350,
                1358
            ],
            [
                1363,
                1365
            ],
            [
                1365,
                1377
            ],
            [
                1377,
                1388
            ],
            [
                1388,
                1391
            ],
            [
                1391,
                1401
            ],
            [
                1401,
                1406
            ],
            [
                1407,
                1412
            ],
            [
                1424,
                1427
            ],
            [
                1437,
                1458
            ],
            [
                1459,
                1486
            ],
            [
                1487,
                1543
            ],
            [
                1545,
                1552
            ],
            [
                1557,
                1587
            ],
            [
                1587,
                1589
            ],
            [
                1589,
                1614
            ],
            [
                1614,
                1637
            ],
            [
                1637,
                1644
            ],
            [
                1650,
                1654
            ],
            [
                1655,
                1667
            ],
            [
                1667,
                1689
            ],
            [
                1691,
                1709
            ],
            [
                1709,
                1728
            ],
            [
                1732,
                1745
            ],
            [
                1746,
                1749
            ],
            [
                1750,
                1779
            ],
            [
                1786,
                1789
            ],
            [
                1790,
                1799
            ],
            [
                1807,
                1819
            ],
            [
                1819,
                1826
            ],
            [
                1830,
                1858
            ],
            [
                1867,
                1869
            ],
            [
                1869,
                1879
            ],
            [
                1885,
                1904
            ],
            [
                1905,
                1930
            ],
            [
                1930,
                1966
            ],
            [
                1966,
                2023
            ],
            [
                2023,
                2046
            ],
            [
                2046,
                2065
            ],
            [
                2065,
                2137
            ],
            [
                2137,
                2139
            ],
            [
                2139,
                2167
            ],
            [
                2170,
                2179
            ],
            [
                2182,
                2187
            ],
            [
                2190,
                2209
            ],
            [
                2209,
                2229
            ],
            [
                2229,
                2236
            ],
            [
                2236,
                2240
            ],
            [
                2243,
                2265
            ],
            [
                2265,
                2295
            ],
            [
                2295,
                2314
            ],
            [
                2314,
                2337
            ],
            [
                2337,
                2354
            ],
            [
                2364,
                2367
            ],
            [
                2367,
                2380
            ],
            [
                2380,
                2443
            ],
            [
                2452,
                2473
            ],
            [
                2474,
                2526
            ],
            [
                2533,
                2542
            ],
            [
                2542,
                2546
            ],
            [
                2549,
                2558
            ],
            [
                2559,
                2568
            ],
            [
                2573,
                2644
            ],
            [
                2644,
                2730
            ],
            [
                2730,
                2787
            ],
            [
                2795,
                2813
            ],
            [
                2816,
                2847
            ],
            [
                2848,
                2860
            ],
            [
                2866,
                2911
            ],
            [
                2916,
                2928
            ],
            [
                2928,
                2939
            ],
            [
                2939,
                2977
            ],
            [
                2977,
                2994
            ],
            [
                2995,
                3003
            ],
            [
                3003,
                3060
            ],
            [
                3061,
                3087
            ],
            [
                3096,
                3109
            ],
            [
                3113,
                3139
            ],
            [
                3140,
                3167
            ],
            [
                3167,
                3197
            ],
            [
                3200,
                3219
            ],
            [
                3222,
                3229
            ],
            [
                3230,
                3268
            ],
            [
                3268,
                3274
            ],
            [
                3275,
                3287
            ],
            [
                3287,
                3316
            ],
            [
                3316,
                3347
            ],
            [
                3347,
                3349
            ],
            [
                3349,
                3378
            ],
            [
                3378,
                3396
            ],
            [
                3404,
                3406
            ],
            [
                3406,
                3407
            ],
            [
                3407,
                3439
            ],
            [
                3439,
                3471
            ],
            [
                3480,
                3482
            ],
            [
                3482,
                3552
            ],
            [
                3552,
                3557
            ],
            [
                3557,
                3562
            ],
            [
                3562,
                3575
            ],
            [
                3576,
                3592
            ],
            [
                3593,
                3605
            ],
            [
                3605,
                3612
            ],
            [
                3614,
                3641
            ],
            [
                3641,
                3661
            ],
            [
                3661,
                3663
            ],
            [
                3663,
                3721
            ],
            [
                3722,
                3752
            ],
            [
                3754,
                3824
            ],
            [
                3826,
                3875
            ],
            [
                3875,
                3918
            ],
            [
                3918,
                4063
            ],
            [
                4063,
                4065
            ],
            [
                4065,
                4071
            ],
            [
                4072,
                4091
            ],
            [
                4091,
                4123
            ],
            [
                4123,
                4217
            ],
            [
                4217,
                4288
            ],
            [
                4288,
                4309
            ],
            [
                4309,
                4363
            ],
            [
                4363,
                4426
            ],
            [
                4431,
                4439
            ],
            [
                4439,
                4448
            ],
            [
                4449,
                4451
            ],
            [
                4452,
                4467
            ],
            [
                4468,
                4507
            ],
            [
                4508,
                4520
            ],
            [
                4521,
                4524
            ],
            [
                4534,
                4538
            ],
            [
                4538,
                4540
            ],
            [
                4540,
                4566
            ],
            [
                4571,
                4629
            ],
            [
                4629,
                4631
            ],
            [
                4631,
                4679
            ],
            [
                4683,
                4690
            ],
            [
                4693,
                4698
            ],
            [
                4698,
                4700
            ],
            [
                4700,
                4706
            ],
            [
                4707,
                4710
            ],
            [
                4711,
                4729
            ],
            [
                4730,
                4752
            ],
            [
                4752,
                4753
            ],
            [
                4754,
                4757
            ],
            [
                4758,
                4767
            ],
            [
                4768,
                4772
            ],
            [
                4773,
                4794
            ],
            [
                4794,
                4856
            ],
            [
                4857,
                4869
            ],
            [
                4870,
                4877
            ],
            [
                4878,
                4880
            ],
            [
                4895,
                4899
            ],
            [
                4899,
                4917
            ],
            [
                4918,
                4948
            ],
            [
                4948,
                4984
            ],
            [
                4985,
                5014
            ],
            [
                5014,
                5057
            ],
            [
                5065,
                5069
            ],
            [
                5070,
                5081
            ],
            [
                5082,
                5088
            ],
            [
                5088,
                5090
            ],
            [
                5090,
                5122
            ],
            [
                5129,
                5179
            ],
            [
                5187,
                5189
            ],
            [
                5195,
                5196
            ],
            [
                5197,
                5205
            ],
            [
                5213,
                5259
            ],
            [
                5260,
                5295
            ],
            [
                5295,
                5375
            ],
            [
                5375,
                5395
            ],
            [
                5396,
                5404
            ],
            [
                5404,
                5470
            ],
            [
                5470,
                5490
            ],
            [
                5504,
                5537
            ],
            [
                5537,
                5544
            ],
            [
                5545,
                5553
            ],
            [
                5554,
                5559
            ],
            [
                5562,
                5564
            ],
            [
                5564,
                5597
            ],
            [
                5600,
                5609
            ],
            [
                5610,
                5619
            ],
            [
                5619,
                5640
            ],
            [
                5641,
                5658
            ],
            [
                5658,
                5730
            ],
            [
                5731,
                5786
            ],
            [
                5786,
                5874
            ],
            [
                5875,
                5934
            ],
            [
                5948,
                6021
            ],
            [
                6022,
                6025
            ],
            [
                6026,
                6031
            ],
            [
                6031,
                6033
            ],
            [
                6033,
                6069
            ],
            [
                6070,
                6077
            ],
            [
                6078,
                6138
            ],
            [
                6138,
                6189
            ],
            [
                6204,
                6244
            ],
            [
                6244,
                6275
            ],
            [
                6276,
                6285
            ],
            [
                6285,
                6353
            ],
            [
                6365,
                6376
            ],
            [
                6377,
                6384
            ],
            [
                6385,
                6391
            ],
            [
                6395,
                6397
            ],
            [
                6397,
                6448
            ],
            [
                6458,
                6462
            ],
            [
                6462,
                6464
            ],
            [
                6464,
                6475
            ],
            [
                6482,
                6486
            ],
            [
                6487,
                6491
            ],
            [
                6499,
                6508
            ],
            [
                6528,
                6538
            ],
            [
                6539,
                6542
            ],
            [
                6549,
                6551
            ],
            [
                6551,
                6570
            ],
            [
                6571,
                6573
            ],
            [
                6574,
                6582
            ],
            [
                6582,
                6583
            ],
            [
                6592,
                6595
            ],
            [
                6596,
                6598
            ],
            [
                6603,
                6610
            ],
            [
                6610,
                6612
            ],
            [
                6612,
                6638
            ],
            [
                6639,
                6696
            ],
            [
                6706,
                6713
            ],
            [
                6713,
                6778
            ],
            [
                6779,
                6788
            ],
            [
                6789,
                6796
            ],
            [
                6796,
                6804
            ],
            [
                6805,
                6814
            ],
            [
                6820,
                6824
            ],
            [
                6825,
                6828
            ],
            [
                6829,
                6834
            ],
            [
                6834,
                6892
            ],
            [
                6892,
                6934
            ],
            [
                6938,
                6983
            ],
            [
                6983,
                6998
            ],
            [
                7014,
                7069
            ],
            [
                7069,
                7105
            ],
            [
                7114,
                7115
            ],
            [
                7116,
                7137
            ],
            [
                7139,
                7142
            ],
            [
                7143,
                7176
            ],
            [
                7177,
                7286
            ],
            [
                7287,
                7373
            ],
            [
                7374,
                7386
            ],
            [
                7388,
                7430
            ],
            [
                7430,
                7472
            ],
            [
                7472,
                7492
            ],
            [
                7492,
                7516
            ],
            [
                7516,
                7517
            ],
            [
                7517,
                7520
            ],
            [
                7531,
                7538
            ],
            [
                7538,
                7540
            ],
            [
                7540,
                7559
            ],
            [
                7560,
                7564
            ],
            [
                7565,
                7570
            ],
            [
                7573,
                7592
            ],
            [
                7594,
                7610
            ],
            [
                7610,
                7615
            ],
            [
                7619,
                7622
            ],
            [
                7622,
                7635
            ],
            [
                7644,
                7648
            ],
            [
                7649,
                7662
            ],
            [
                7662,
                7664
            ],
            [
                7664,
                7697
            ],
            [
                7697,
                7726
            ],
            [
                7726,
                7755
            ],
            [
                7755,
                7792
            ],
            [
                7795,
                7839
            ],
            [
                7839,
                7872
            ],
            [
                7872,
                7897
            ],
            [
                7897,
                7940
            ],
            [
                7940,
                7946
            ],
            [
                7951,
                7954
            ],
            [
                7955,
                8006
            ],
            [
                8006,
                8074
            ],
            [
                8074,
                8080
            ],
            [
                8093,
                8108
            ],
            [
                8108,
                8198
            ],
            [
                8198,
                8216
            ],
            [
                8216,
                8225
            ],
            [
                8229,
                8247
            ],
            [
                8247,
                8266
            ],
            [
                8266,
                8299
            ],
            [
                8300,
                8306
            ],
            [
                8307,
                8311
            ],
            [
                8311,
                8313
            ],
            [
                8313,
                8342
            ],
            [
                8344,
                8370
            ],
            [
                8379,
                8381
            ],
            [
                8381,
                8438
            ],
            [
                8443,
                8505
            ],
            [
                8511,
                8564
            ],
            [
                8564,
                8577
            ],
            [
                8578,
                8605
            ],
            [
                8607,
                8666
            ],
            [
                8667,
                8675
            ],
            [
                8675,
                8745
            ],
            [
                8746,
                8784
            ],
            [
                8784,
                8791
            ],
            [
                8791,
                8797
            ],
            [
                8797,
                8800
            ],
            [
                8800,
                8837
            ],
            [
                8837,
                8861
            ],
            [
                8861,
                8885
            ],
            [
                8894,
                8916
            ],
            [
                8917,
                8963
            ],
            [
                8967,
                8969
            ],
            [
                8969,
                9000
            ],
            [
                9000,
                9031
            ],
            [
                9031,
                9033
            ],
            [
                9040,
                9066
            ],
            [
                9066,
                9119
            ],
            [
                9120,
                9162
            ],
            [
                9162,
                9163
            ],
            [
                9164,
                9183
            ],
            [
                9190,
                9215
            ],
            [
                9216,
                9227
            ],
            [
                9227,
                9256
            ],
            [
                9257,
                9300
            ],
            [
                9308,
                9339
            ],
            [
                9339,
                9361
            ],
            [
                9361,
                9377
            ],
            [
                9378,
                9430
            ],
            [
                9431,
                9493
            ],
            [
                9494,
                9505
            ],
            [
                9506,
                9512
            ],
            [
                9513,
                9522
            ],
            [
                9522,
                9524
            ],
            [
                9524,
                9640
            ],
            [
                9640,
                9655
            ],
            [
                9657,
                9747
            ],
            [
                9747,
                9798
            ],
            [
                9803,
                9844
            ],
            [
                9844,
                9877
            ],
            [
                9878,
                9885
            ],
            [
                9886,
                9889
            ],
            [
                9890,
                9996
            ],
            [
                9997,
                10040
            ],
            [
                10041,
                10044
            ],
            [
                10045,
                10059
            ],
            [
                10059,
                10106
            ],
            [
                10106,
                10113
            ],
            [
                10114,
                10168
            ],
            [
                10168,
                10171
            ],
            [
                10176,
                10236
            ],
            [
                10237,
                10264
            ],
            [
                10270,
                10275
            ],
            [
                10275,
                10297
            ],
            [
                10299,
                10333
            ],
            [
                10333,
                10346
            ],
            [
                10361,
                10401
            ],
            [
                10401,
                10419
            ],
            [
                10431,
                10465
            ],
            [
                10466,
                10470
            ],
            [
                10471,
                10480
            ],
            [
                10489,
                10498
            ],
            [
                10503,
                10513
            ],
            [
                10521,
                10532
            ],
            [
                10532,
                10539
            ],
            [
                10548,
                10561
            ],
            [
                10569,
                10640
            ],
            [
                10644,
                10709
            ],
            [
                10709,
                10746
            ],
            [
                10751,
                10770
            ],
            [
                10771,
                10799
            ],
            [
                10800,
                10821
            ],
            [
                10821,
                10832
            ],
            [
                10832,
                10846
            ],
            [
                10847,
                10855
            ],
            [
                10866,
                10905
            ],
            [
                10905,
                10917
            ],
            [
                10918,
                10934
            ],
            [
                10934,
                11069
            ],
            [
                11069,
                11100
            ],
            [
                11100,
                11116
            ],
            [
                11122,
                11125
            ],
            [
                11131,
                11132
            ],
            [
                11133,
                11137
            ],
            [
                11137,
                11138
            ],
            [
                11143,
                11151
            ],
            [
                11152,
                11157
            ],
            [
                11158,
                11161
            ],
            [
                11162,
                11172
            ],
            [
                11177,
                11202
            ],
            [
                11202,
                11203
            ],
            [
                11208,
                11223
            ],
            [
                11224,
                11257
            ],
            [
                11263,
                11271
            ],
            [
                11272,
                11275
            ],
            [
                11276,
                11283
            ],
            [
                11284,
                11377
            ],
            [
                11382,
                11384
            ],
            [
                11400,
                11455
            ],
            [
                11455,
                11495
            ],
            [
                11495,
                11511
            ],
            [
                11512,
                11523
            ],
            [
                11524,
                11547
            ],
            [
                11548,
                11553
            ],
            [
                11564,
                11568
            ],
            [
                11569,
                11588
            ],
            [
                11594,
                11648
            ],
            [
                11649,
                11661
            ],
            [
                11662,
                11671
            ],
            [
                11672,
                11758
            ],
            [
                11759,
                11769
            ],
            [
                11771,
                11975
            ],
            [
                11975,
                12026
            ],
            [
                12027,
                12052
            ],
            [
                12053,
                12118
            ],
            [
                12119,
                12180
            ],
            [
                12180,
                12197
            ],
            [
                12208,
                12233
            ],
            [
                12234,
                12237
            ],
            [
                12238,
                12275
            ],
            [
                12275,
                12277
            ],
            [
                12277,
                12335
            ],
            [
                12342,
                12363
            ],
            [
                12363,
                12405
            ],
            [
                12406,
                12409
            ],
            [
                12413,
                12421
            ],
            [
                12421,
                12434
            ],
            [
                12434,
                12452
            ],
            [
                12455,
                12462
            ],
            [
                12464,
                12471
            ],
            [
                12479,
                12552
            ],
            [
                12562,
                12589
            ],
            [
                12589,
                12666
            ],
            [
                12666,
                12691
            ],
            [
                12692,
                12759
            ],
            [
                12759,
                12855
            ],
            [
                12855,
                12857
            ],
            [
                12857,
                12875
            ],
            [
                12876,
                12891
            ],
            [
                12891,
                12947
            ],
            [
                12947,
                12998
            ],
            [
                12999,
                13060
            ],
            [
                13061,
                13064
            ],
            [
                13065,
                13084
            ],
            [
                13092,
                13094
            ],
            [
                13100,
                13123
            ],
            [
                13125,
                13397
            ],
            [
                13398,
                13429
            ],
            [
                13434,
                13440
            ],
            [
                13440,
                13495
            ],
            [
                13495,
                13524
            ],
            [
                13525,
                13544
            ],
            [
                13544,
                13546
            ],
            [
                13546,
                13594
            ],
            [
                13599,
                13631
            ],
            [
                13635,
                13743
            ],
            [
                13753,
                13758
            ],
            [
                13758,
                13782
            ],
            [
                13782,
                13797
            ],
            [
                13797,
                13801
            ],
            [
                13810,
                13822
            ],
            [
                13822,
                13852
            ],
            [
                13852,
                13911
            ],
            [
                13911,
                13923
            ],
            [
                13923,
                13943
            ],
            [
                13943,
                13968
            ],
            [
                13968,
                14046
            ],
            [
                14046,
                14164
            ],
            [
                14167,
                14200
            ],
            [
                14200,
                14225
            ],
            [
                14225,
                14245
            ],
            [
                14247,
                14250
            ],
            [
                14251,
                14315
            ],
            [
                14317,
                14338
            ],
            [
                14339,
                14340
            ],
            [
                14341,
                14348
            ],
            [
                14349,
                14365
            ],
            [
                14366,
                14370
            ],
            [
                14371,
                14385
            ],
            [
                14386,
                14389
            ],
            [
                14390,
                14418
            ],
            [
                14421,
                14494
            ],
            [
                14499,
                14502
            ],
            [
                14502,
                14536
            ],
            [
                14539,
                14560
            ],
            [
                14561,
                14677
            ],
            [
                14677,
                14680
            ],
            [
                14682,
                14686
            ],
            [
                14687,
                14690
            ],
            [
                14690,
                14723
            ],
            [
                14724,
                14791
            ],
            [
                14791,
                14832
            ],
            [
                14832,
                14890
            ],
            [
                14890,
                14902
            ],
            [
                14902,
                14903
            ],
            [
                14904,
                14935
            ],
            [
                14935,
                15015
            ],
            [
                15015,
                15047
            ],
            [
                15047,
                15049
            ],
            [
                15049,
                15084
            ],
            [
                15089,
                15092
            ],
            [
                15092,
                15109
            ],
            [
                15110,
                15125
            ],
            [
                15126,
                15157
            ],
            [
                15157,
                15158
            ],
            [
                15159,
                15160
            ],
            [
                15160,
                15190
            ],
            [
                15190,
                15226
            ],
            [
                15226,
                15269
            ],
            [
                15269,
                15336
            ],
            [
                15336,
                15342
            ],
            [
                15355,
                15400
            ],
            [
                15401,
                15405
            ],
            [
                15406,
                15416
            ],
            [
                15432,
                15435
            ],
            [
                15436,
                15456
            ],
            [
                15457,
                15479
            ],
            [
                15479,
                15481
            ],
            [
                15481,
                15487
            ],
            [
                15488,
                15508
            ],
            [
                15508,
                15509
            ],
            [
                15510,
                15569
            ],
            [
                15576,
                15599
            ],
            [
                15599,
                15635
            ],
            [
                15636,
                15639
            ],
            [
                15646,
                15663
            ],
            [
                15664,
                15696
            ],
            [
                15696,
                15697
            ],
            [
                15698,
                15740
            ],
            [
                15741,
                15776
            ],
            [
                15777,
                15838
            ],
            [
                15838,
                15840
            ],
            [
                15840,
                15854
            ],
            [
                15859,
                15862
            ],
            [
                15863,
                15913
            ],
            [
                15913,
                15951
            ],
            [
                15951,
                15953
            ],
            [
                15953,
                15961
            ],
            [
                15961,
                15990
            ],
            [
                16004,
                16011
            ],
            [
                16011,
                16068
            ],
            [
                16068,
                16116
            ],
            [
                16116,
                16117
            ],
            [
                16121,
                16124
            ],
            [
                16129,
                16132
            ],
            [
                16132,
                16182
            ],
            [
                16183,
                16200
            ],
            [
                16200,
                16229
            ],
            [
                16230,
                16238
            ],
            [
                16238,
                16262
            ],
            [
                16263,
                16305
            ],
            [
                16305,
                16369
            ],
            [
                16369,
                16371
            ],
            [
                16371,
                16383
            ],
            [
                16384,
                16441
            ],
            [
                16441,
                16483
            ],
            [
                16483,
                16513
            ],
            [
                16513,
                16538
            ],
            [
                16538,
                16572
            ],
            [
                16572,
                16594
            ],
            [
                16594,
                16630
            ],
            [
                16631,
                16641
            ],
            [
                16644,
                16689
            ],
            [
                16689,
                16725
            ],
            [
                16725,
                16727
            ],
            [
                16727,
                16806
            ],
            [
                16806,
                16837
            ],
            [
                16837,
                16857
            ],
            [
                16857,
                16916
            ],
            [
                16916,
                16917
            ],
            [
                16917,
                16959
            ],
            [
                16959,
                16979
            ],
            [
                16979,
                17006
            ],
            [
                17006,
                17054
            ],
            [
                17054,
                17083
            ],
            [
                17083,
                17218
            ],
            [
                17219,
                17251
            ],
            [
                17259,
                17272
            ],
            [
                17280,
                17295
            ],
            [
                17295,
                17323
            ],
            [
                17324,
                17339
            ],
            [
                17340,
                17354
            ],
            [
                17354,
                17399
            ],
            [
                17399,
                17415
            ],
            [
                17415,
                17418
            ],
            [
                17418,
                17419
            ],
            [
                17420,
                17438
            ],
            [
                17438,
                17492
            ],
            [
                17493,
                17613
            ],
            [
                17613,
                17621
            ],
            [
                17622,
                17653
            ],
            [
                17653,
                17669
            ],
            [
                17676,
                17681
            ],
            [
                17682,
                17709
            ],
            [
                17709,
                17725
            ],
            [
                17728,
                17736
            ],
            [
                17739,
                17784
            ],
            [
                17784,
                17793
            ],
            [
                17793,
                17826
            ],
            [
                17826,
                17831
            ],
            [
                17836,
                17837
            ],
            [
                17838,
                17841
            ],
            [
                17842,
                17888
            ],
            [
                17889,
                17892
            ],
            [
                17902,
                17931
            ],
            [
                17936,
                17942
            ],
            [
                17943,
                17947
            ],
            [
                17956,
                17962
            ],
            [
                17965,
                17977
            ],
            [
                17977,
                18005
            ],
            [
                18008,
                18011
            ],
            [
                18011,
                18036
            ],
            [
                18036,
                18051
            ],
            [
                18053,
                18082
            ],
            [
                18083,
                18093
            ],
            [
                18096,
                18108
            ],
            [
                18108,
                18111
            ],
            [
                18119,
                18137
            ],
            [
                18137,
                18174
            ],
            [
                18174,
                18215
            ],
            [
                18216,
                18268
            ],
            [
                18268,
                18291
            ],
            [
                18292,
                18334
            ],
            [
                18334,
                18336
            ],
            [
                18336,
                18339
            ],
            [
                18349,
                18359
            ],
            [
                18367,
                18374
            ],
            [
                18382,
                18393
            ],
            [
                18394,
                18397
            ],
            [
                18401,
                18403
            ],
            [
                18408,
                18428
            ],
            [
                18429,
                18430
            ],
            [
                18431,
                18482
            ],
            [
                18482,
                18521
            ],
            [
                18521,
                18575
            ],
            [
                18576,
                18596
            ],
            [
                18601,
                18603
            ],
            [
                18603,
                18610
            ],
            [
                18610,
                18633
            ],
            [
                18633,
                18641
            ],
            [
                18641,
                18691
            ],
            [
                18691,
                18733
            ],
            [
                18733,
                18794
            ],
            [
                18795,
                18800
            ],
            [
                18801,
                18820
            ],
            [
                18820,
                18831
            ],
            [
                18831,
                18832
            ],
            [
                18833,
                18860
            ],
            [
                18865,
                18875
            ],
            [
                18876,
                18880
            ],
            [
                18881,
                18887
            ],
            [
                18887,
                18900
            ],
            [
                18901,
                18908
            ],
            [
                18908,
                18932
            ],
            [
                18932,
                18972
            ],
            [
                18972,
                18993
            ],
            [
                18993,
                19007
            ],
            [
                19008,
                19096
            ],
            [
                19099,
                19151
            ],
            [
                19151,
                19208
            ],
            [
                19208,
                19290
            ],
            [
                19290,
                19328
            ],
            [
                19333,
                19352
            ],
            [
                19353,
                19360
            ],
            [
                19361,
                19367
            ],
            [
                19367,
                19369
            ],
            [
                19369,
                19392
            ],
            [
                19392,
                19398
            ],
            [
                19398,
                19463
            ],
            [
                19468,
                19477
            ],
            [
                19477,
                19485
            ],
            [
                19485,
                19517
            ],
            [
                19517,
                19587
            ],
            [
                19587,
                19589
            ],
            [
                19589,
                19598
            ],
            [
                19599,
                19643
            ],
            [
                19648,
                19721
            ],
            [
                19721,
                19767
            ],
            [
                19767,
                19779
            ],
            [
                19780,
                19807
            ],
            [
                19807,
                19831
            ],
            [
                19831,
                19863
            ],
            [
                19870,
                20020
            ]
        ],
        "row_chars": [
            [
                0,
                102
            ],
            [
                102,
                164
            ],
            [
                164,
                217
            ],
            [
                217,
                378
            ],
            [
                378,
                417
            ],
            [
                417,
                471
            ],
            [
                471,
                506
            ],
            [
                506,
                565
            ],
            [
                565,
                634
            ],
            [
                634,
                768
            ],
            [
                768,
                906
            ],
            [
                906,
                921
            ],
            [
                921,
                940
            ],
            [
                940,
                940
            ],
            [
                940,
                968
            ],
            [
                968,
                1000
            ],
            [
                1000,
                1119
            ],
            [
                1119,
                1123
            ],
            [
                1123,
                1154
            ],
            [
                1154,
                1179
            ],
            [
                1179,
                1204
            ],
            [
                1204,
                1274
            ],
            [
                1274,
                1365
            ],
            [
                1365,
                1377
            ],
            [
                1377,
                1391
            ],
            [
                1391,
                1401
            ],
            [
                1401,
                1427
            ],
            [
                1427,
                1486
            ],
            [
                1486,
                1486
            ],
            [
                1486,
                1589
            ],
            [
                1589,
                1614
            ],
            [
                1614,
                1637
            ],
            [
                1637,
                1667
            ],
            [
                1667,
                1709
            ],
            [
                1709,
                1709
            ],
            [
                1709,
                1728
            ],
            [
                1728,
                1819
            ],
            [
                1819,
                1869
            ],
            [
                1869,
                1879
            ],
            [
                1879,
                1904
            ],
            [
                1904,
                1904
            ],
            [
                1904,
                1930
            ],
            [
                1930,
                1966
            ],
            [
                1966,
                2023
            ],
            [
                2023,
                2046
            ],
            [
                2046,
                2065
            ],
            [
                2065,
                2139
            ],
            [
                2139,
                2209
            ],
            [
                2209,
                2229
            ],
            [
                2229,
                2236
            ],
            [
                2236,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2265
            ],
            [
                2265,
                2295
            ],
            [
                2295,
                2314
            ],
            [
                2314,
                2337
            ],
            [
                2337,
                2367
            ],
            [
                2367,
                2380
            ],
            [
                2380,
                2542
            ],
            [
                2542,
                2549
            ],
            [
                2549,
                2549
            ],
            [
                2549,
                2644
            ],
            [
                2644,
                2730
            ],
            [
                2730,
                2848
            ],
            [
                2848,
                2848
            ],
            [
                2848,
                2928
            ],
            [
                2928,
                2939
            ],
            [
                2939,
                2977
            ],
            [
                2977,
                3003
            ],
            [
                3003,
                3109
            ],
            [
                3109,
                3167
            ],
            [
                3167,
                3268
            ],
            [
                3268,
                3349
            ],
            [
                3349,
                3378
            ],
            [
                3378,
                3406
            ],
            [
                3406,
                3439
            ],
            [
                3439,
                3482
            ],
            [
                3482,
                3552
            ],
            [
                3552,
                3557
            ],
            [
                3557,
                3562
            ],
            [
                3562,
                3605
            ],
            [
                3605,
                3641
            ],
            [
                3641,
                3663
            ],
            [
                3663,
                3721
            ],
            [
                3721,
                3721
            ],
            [
                3721,
                3875
            ],
            [
                3875,
                3875
            ],
            [
                3875,
                3918
            ],
            [
                3918,
                4065
            ],
            [
                4065,
                4091
            ],
            [
                4091,
                4123
            ],
            [
                4123,
                4217
            ],
            [
                4217,
                4288
            ],
            [
                4288,
                4363
            ],
            [
                4363,
                4439
            ],
            [
                4439,
                4540
            ],
            [
                4540,
                4631
            ],
            [
                4631,
                4700
            ],
            [
                4700,
                4794
            ],
            [
                4794,
                4870
            ],
            [
                4870,
                4870
            ],
            [
                4870,
                4870
            ],
            [
                4870,
                4948
            ],
            [
                4948,
                5014
            ],
            [
                5014,
                5090
            ],
            [
                5090,
                5197
            ],
            [
                5197,
                5295
            ],
            [
                5295,
                5375
            ],
            [
                5375,
                5404
            ],
            [
                5404,
                5537
            ],
            [
                5537,
                5564
            ],
            [
                5564,
                5610
            ],
            [
                5610,
                5610
            ],
            [
                5610,
                5619
            ],
            [
                5619,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5786
            ],
            [
                5786,
                5875
            ],
            [
                5875,
                6033
            ],
            [
                6033,
                6138
            ],
            [
                6138,
                6244
            ],
            [
                6244,
                6285
            ],
            [
                6285,
                6397
            ],
            [
                6397,
                6464
            ],
            [
                6464,
                6551
            ],
            [
                6551,
                6612
            ],
            [
                6612,
                6713
            ],
            [
                6713,
                6892
            ],
            [
                6892,
                6983
            ],
            [
                6983,
                6983
            ],
            [
                6983,
                7069
            ],
            [
                7069,
                7287
            ],
            [
                7287,
                7430
            ],
            [
                7430,
                7472
            ],
            [
                7472,
                7492
            ],
            [
                7492,
                7516
            ],
            [
                7516,
                7540
            ],
            [
                7540,
                7594
            ],
            [
                7594,
                7610
            ],
            [
                7610,
                7622
            ],
            [
                7622,
                7664
            ],
            [
                7664,
                7697
            ],
            [
                7697,
                7726
            ],
            [
                7726,
                7755
            ],
            [
                7755,
                7795
            ],
            [
                7795,
                7795
            ],
            [
                7795,
                7839
            ],
            [
                7839,
                7872
            ],
            [
                7872,
                7897
            ],
            [
                7897,
                7940
            ],
            [
                7940,
                8006
            ],
            [
                8006,
                8074
            ],
            [
                8074,
                8108
            ],
            [
                8108,
                8108
            ],
            [
                8108,
                8108
            ],
            [
                8108,
                8108
            ],
            [
                8108,
                8108
            ],
            [
                8108,
                8198
            ],
            [
                8198,
                8198
            ],
            [
                8198,
                8216
            ],
            [
                8216,
                8247
            ],
            [
                8247,
                8266
            ],
            [
                8266,
                8313
            ],
            [
                8313,
                8381
            ],
            [
                8381,
                8564
            ],
            [
                8564,
                8607
            ],
            [
                8607,
                8675
            ],
            [
                8675,
                8784
            ],
            [
                8784,
                8791
            ],
            [
                8791,
                8800
            ],
            [
                8800,
                8861
            ],
            [
                8861,
                8969
            ],
            [
                8969,
                9000
            ],
            [
                9000,
                9033
            ],
            [
                9033,
                9164
            ],
            [
                9164,
                9164
            ],
            [
                9164,
                9164
            ],
            [
                9164,
                9227
            ],
            [
                9227,
                9339
            ],
            [
                9339,
                9524
            ],
            [
                9524,
                9640
            ],
            [
                9640,
                9747
            ],
            [
                9747,
                9747
            ],
            [
                9747,
                9844
            ],
            [
                9844,
                10059
            ],
            [
                10059,
                10106
            ],
            [
                10106,
                10168
            ],
            [
                10168,
                10275
            ],
            [
                10275,
                10333
            ],
            [
                10333,
                10401
            ],
            [
                10401,
                10532
            ],
            [
                10532,
                10561
            ],
            [
                10561,
                10561
            ],
            [
                10561,
                10709
            ],
            [
                10709,
                10821
            ],
            [
                10821,
                10905
            ],
            [
                10905,
                10934
            ],
            [
                10934,
                10934
            ],
            [
                10934,
                11100
            ],
            [
                11100,
                11257
            ],
            [
                11257,
                11455
            ],
            [
                11455,
                11495
            ],
            [
                11495,
                11769
            ],
            [
                11769,
                11975
            ],
            [
                11975,
                12119
            ],
            [
                12119,
                12180
            ],
            [
                12180,
                12277
            ],
            [
                12277,
                12363
            ],
            [
                12363,
                12434
            ],
            [
                12434,
                12589
            ],
            [
                12589,
                12666
            ],
            [
                12666,
                12759
            ],
            [
                12759,
                12857
            ],
            [
                12857,
                12947
            ],
            [
                12947,
                12998
            ],
            [
                12998,
                12998
            ],
            [
                12998,
                13440
            ],
            [
                13440,
                13495
            ],
            [
                13495,
                13546
            ],
            [
                13546,
                13782
            ],
            [
                13782,
                13797
            ],
            [
                13797,
                13822
            ],
            [
                13822,
                13852
            ],
            [
                13852,
                13911
            ],
            [
                13911,
                13923
            ],
            [
                13923,
                13943
            ],
            [
                13943,
                13968
            ],
            [
                13968,
                14046
            ],
            [
                14046,
                14164
            ],
            [
                14164,
                14200
            ],
            [
                14200,
                14225
            ],
            [
                14225,
                14502
            ],
            [
                14502,
                14677
            ],
            [
                14677,
                14690
            ],
            [
                14690,
                14791
            ],
            [
                14791,
                14832
            ],
            [
                14832,
                14890
            ],
            [
                14890,
                15049
            ],
            [
                15049,
                15092
            ],
            [
                15092,
                15190
            ],
            [
                15190,
                15226
            ],
            [
                15226,
                15269
            ],
            [
                15269,
                15336
            ],
            [
                15336,
                15416
            ],
            [
                15416,
                15481
            ],
            [
                15481,
                15599
            ],
            [
                15599,
                15840
            ],
            [
                15840,
                15840
            ],
            [
                15840,
                15913
            ],
            [
                15913,
                15953
            ],
            [
                15953,
                15961
            ],
            [
                15961,
                16011
            ],
            [
                16011,
                16068
            ],
            [
                16068,
                16116
            ],
            [
                16116,
                16132
            ],
            [
                16132,
                16200
            ],
            [
                16200,
                16238
            ],
            [
                16238,
                16305
            ],
            [
                16305,
                16371
            ],
            [
                16371,
                16441
            ],
            [
                16441,
                16483
            ],
            [
                16483,
                16513
            ],
            [
                16513,
                16538
            ],
            [
                16538,
                16572
            ],
            [
                16572,
                16594
            ],
            [
                16594,
                16630
            ],
            [
                16630,
                16630
            ],
            [
                16630,
                16644
            ],
            [
                16644,
                16644
            ],
            [
                16644,
                16689
            ],
            [
                16689,
                16727
            ],
            [
                16727,
                16806
            ],
            [
                16806,
                16837
            ],
            [
                16837,
                16857
            ],
            [
                16857,
                16916
            ],
            [
                16916,
                16959
            ],
            [
                16959,
                16979
            ],
            [
                16979,
                17006
            ],
            [
                17006,
                17054
            ],
            [
                17054,
                17083
            ],
            [
                17083,
                17219
            ],
            [
                17219,
                17295
            ],
            [
                17295,
                17354
            ],
            [
                17354,
                17399
            ],
            [
                17399,
                17415
            ],
            [
                17415,
                17493
            ],
            [
                17493,
                17493
            ],
            [
                17493,
                17613
            ],
            [
                17613,
                17653
            ],
            [
                17653,
                17709
            ],
            [
                17709,
                17738
            ],
            [
                17738,
                17784
            ],
            [
                17784,
                17793
            ],
            [
                17793,
                17826
            ],
            [
                17826,
                18011
            ],
            [
                18011,
                18036
            ],
            [
                18036,
                18036
            ],
            [
                18036,
                18036
            ],
            [
                18036,
                18082
            ],
            [
                18082,
                18082
            ],
            [
                18082,
                18108
            ],
            [
                18108,
                18137
            ],
            [
                18137,
                18174
            ],
            [
                18174,
                18268
            ],
            [
                18268,
                18336
            ],
            [
                18336,
                18521
            ],
            [
                18521,
                18603
            ],
            [
                18603,
                18610
            ],
            [
                18610,
                18633
            ],
            [
                18633,
                18641
            ],
            [
                18641,
                18733
            ],
            [
                18733,
                18820
            ],
            [
                18820,
                18887
            ],
            [
                18887,
                18972
            ],
            [
                18972,
                18993
            ],
            [
                18993,
                19151
            ],
            [
                19151,
                19208
            ],
            [
                19208,
                19290
            ],
            [
                19290,
                19361
            ],
            [
                19361,
                19361
            ],
            [
                19361,
                19361
            ],
            [
                19361,
                19361
            ],
            [
                19361,
                19369
            ],
            [
                19369,
                19392
            ],
            [
                19392,
                19398
            ],
            [
                19398,
                19477
            ],
            [
                19477,
                19485
            ],
            [
                19485,
                19485
            ],
            [
                19485,
                19517
            ],
            [
                19517,
                19589
            ],
            [
                19589,
                19721
            ],
            [
                19721,
                19767
            ],
            [
                19767,
                19807
            ],
            [
                19807,
                19863
            ],
            [
                19863,
                20020
            ]
        ]
    }
}