{
    "original": {
        "text": "The fund prospered. By dint of Miss Keeldar's example, the three rectors' vigorous exertions, and the efficient though quiet aid of their spinster and spectacled lieutenants, Mary Ann Ainley and Margaret Hall, a handsome sum was raised; and this being judiciously managed, served for the present greatly to alleviate the distress of the unemployed poor. The neighbourhood seemed to grow calmer. For a fortnight past no cloth had been destroyed; no outrage on mill or mansion had been committed in the three parishes. Shirley was sanguine that the evil she wished to avert was almost escaped, that the threatened storm was passing over. With the approach of summer she felt certain that trade would improve--it always did; and then this weary war could not last for ever; peace must return one day. With peace, what an impulse would be given to commerce!\nSuch was the usual tenor of her observations to her tenant, Grard Moore, whenever she met him where they could converse; and Moore would listen very quietly--too quietly to satisfy her. She would then by her impatient glance demand something more from him--some explanation, or at least some additional remark. Smiling in his way, with that expression which gave a remarkable cast of sweetness to his mouth, while his brow remained grave, he would answer to the effect that himself too trusted in the finite nature of the war; that it was indeed on that ground the anchor of his hopes was fixed; thereon his speculations depended. \"For you are aware,\" he would continue, \"that I now work Hollow's Mill entirely on speculation. I sell nothing; there is no market for my goods. I manufacture for a future day. I make myself ready to take advantage of the first opening that shall occur. Three months ago this was impossible to me; I had exhausted both credit and capital. You well know who came to my rescue, from what hand I received the loan which saved me. It is on the strength of that loan I am enabled to continue the bold game which, a while since, I feared I should never play more. Total ruin I know will follow loss, and I am aware that gain is doubtful; but I am quite cheerful. So long as I can be active, so long as I can strive, so long, in short, as my hands are not tied, it is impossible for me to be depressed. One year--nay, but six months--of the reign of the olive, and I am safe; for, as you say, peace will give an impulse to commerce. In this you are right; but as to the restored tranquillity of the neighbourhood, as to the permanent good effect of your charitable fund, I doubt. Eleemosynary relief never yet tranquillized the working-classes--it never made them grateful; it is not in human nature that it should. I suppose, were all things ordered aright, they ought not to be in a position to need that humiliating relief; and this they feel. We should feel it were we so placed. Besides, to whom should they be grateful? To you, to the clergy perhaps, but not to us mill-owners. They hate us worse than ever. Then the disaffected here are in correspondence with the disaffected elsewhere. Nottingham is one of their headquarters, Manchester another, Birmingham a third. The subalterns receive orders from their chiefs; they are in a good state of discipline; no blow is struck without mature deliberation. In sultry weather you have seen the sky threaten thunder day by day, and yet night after night the clouds have cleared, and the sun has set quietly; but the danger was not gone--it was only delayed. The long-threatening storm is sure to break at last. There is analogy between the moral and physical atmosphere.\"\n\"Well, Mr. Moore\" (so these conferences always ended), \"take care of yourself. If you think that I have ever done you any good, reward me by promising to take care of yourself.\"\n\"I do; I will take close and watchful care. I wish to live, not to die. The future opens like Eden before me; and still, when I look deep into the shades of my paradise, I see a vision that I like better than seraph or cherub glide across remote vistas.\"\n\"Do you? Pray, what vision?\"\n\"I see----\"\nThe maid came bustling in with the tea-things.\nThe early part of that May, as we have seen, was fine; the middle was wet; but in the last week, at change of moon, it cleared again. A fresh wind swept off the silver-white, deep-piled rain-clouds, bearing them, mass on mass, to the eastern horizon, on whose verge they dwindled, and behind whose rim they disappeared, leaving the vault behind all pure blue space, ready for the reign of the summer sun. That sun rose broad on Whitsuntide. The gathering of the schools was signalized by splendid weather.\nWhit-Tuesday was the great day, in preparation for which the two large schoolrooms of Briarfield, built by the present rector, chiefly at his own expense, were cleaned out, whitewashed, repainted, and decorated with flowers and evergreens--some from the rectory garden, two cartloads from Fieldhead, and a wheel-barrowful from the more stingy domain of De Walden, the residence of Mr. Wynne. In these schoolrooms twenty tables, each calculated to accommodate twenty guests, were laid out, surrounded with benches, and covered with white cloths. Above them were suspended at least some twenty cages, containing as many canaries, according to a fancy of the district, specially cherished by Mr. Helstone's clerk, who delighted in the piercing song of these birds, and knew that amidst confusion of tongues they always carolled loudest. These tables, be it understood, were not spread for the twelve hundred scholars to be assembled from the three parishes, but only for the patrons and teachers of the schools. The children's feast was to be spread in the open air. At one o'clock the troops were to come in; at two they were to be marshalled; till four they were to parade the parish; then came the feast, and afterwards the meeting, with music and speechifying in the church.\nWhy Briarfield was chosen for the point of rendezvous--the scene of the _fte_--should be explained. It was not because it was the largest or most populous parish--Whinbury far outdid it in that respect; nor because it was the oldest, antique as were the hoary church and rectory--Nunnely's low-roofed temple and mossy parsonage, buried both in coeval oaks, outstanding sentinels of Nunnwood, were older still. It was simply because Mr. Helstone willed it so, and Mr. Helstone's will was stronger than that of Boultby or Hall; the former _could_ not, the latter _would_ not, dispute a point of precedence with their resolute and imperious brother. They let him lead and rule.\nThis notable anniversary had always hitherto been a trying day to Caroline Helstone, because it dragged her perforce into public, compelling her to face all that was wealthy, respectable, influential in the neighbourhood; in whose presence, but for the kind countenance of Mr. Hall, she would have appeared unsupported. Obliged to be conspicuous; obliged to walk at the head of her regiment as the rector's niece, and first teacher of the first class; obliged to make tea at the first table for a mixed multitude of ladies and gentlemen, and to do all this without the countenance of mother, aunt, or other chaperon--she, meantime, being a nervous person, who mortally feared publicity--it will be comprehended that, under these circumstances, she trembled at the approach of Whitsuntide.\nBut this year Shirley was to be with her, and that changed the aspect of the trial singularly--it changed it utterly. It was a trial no longer--it was almost an enjoyment. Miss Keeldar was better in her single self than a host of ordinary friends. Quite self-possessed, and always spirited and easy; conscious of her social importance, yet never presuming upon it--it would be enough to give one courage only to look at her. The only fear was lest the heiress should not be punctual to tryst. She often had a careless way of lingering behind time, and Caroline knew her uncle would not wait a second for any one. At the moment of the church clock tolling two, the bells would clash out and the march begin. She must look after Shirley, then, in this matter, or her expected companion would fail her.\nWhit-Tuesday saw her rise almost with the sun. She, Fanny, and Eliza were busy the whole morning arranging the rectory parlours in first-rate company order, and setting out a collation of cooling refreshments--wine, fruit, cakes--on the dining-room sideboard. Then she had to dress in her freshest and fairest attire of white muslin: the perfect fineness of the day and the solemnity of the occasion warranted, and even exacted, such costume. Her new sash--a birthday present from Margaret Hall, which she had reason to believe Cyril himself had bought, and in return for which she had indeed given him a set of cambric bands in a handsome case--was tied by the dexterous fingers of Fanny, who took no little pleasure in arraying her fair young mistress for the occasion. Her simple bonnet had been trimmed to correspond with her sash; her pretty but inexpensive scarf of white crape suited her dress. When ready she formed a picture, not bright enough to dazzle, but fair enough to interest; not brilliantly striking, but very delicately pleasing--a picture in which sweetness of tint, purity of air, and grace of mien atoned for the absence of rich colouring and magnificent contour. What her brown eye and clear forehead showed of her mind was in keeping with her dress and face--modest, gentle, and, though pensive, harmonious. It appeared that neither lamb nor dove need fear her, but would welcome rather, in her look of simplicity and softness, a sympathy with their own natures, or with the natures we ascribe to them.\nAfter all, she was an imperfect, faulty human being, fair enough of form, hue, and array, but, as Cyril Hall said, neither so good nor so great as the withered Miss Ainley, now putting on her best black gown and Quaker drab shawl and bonnet in her own narrow cottage chamber.\nAway Caroline went, across some very sequestered fields and through some quite hidden lanes, to Fieldhead. She glided quickly under the green hedges and across the greener leas. There was no dust, no moisture, to soil the hem of her stainless garment, or to damp her slender sandal. After the late rains all was clean, and under the present glowing sun all was dry. She walked fearlessly, then, on daisy and turf, and through thick plantations; she reached Fieldhead, and penetrated to Miss Keeldar's dressing-room.\nIt was well she had come, or Shirley would have been too late. Instead of making ready with all speed, she lay stretched on a couch, absorbed in reading. Mrs. Pryor stood near, vainly urging her to rise and dress. Caroline wasted no words. She immediately took the book from her, and with her own hands commenced the business of disrobing and rerobing her. Shirley, indolent with the heat, and gay with her youth and pleasurable nature, wanted to talk, laugh, and linger; but Caroline, intent on being in time, persevered in dressing her as fast as fingers could fasten strings or insert pins. At length, as she united a final row of hooks and eyes, she found leisure to chide her, saying she was very naughty to be so unpunctual, that she looked even now the picture of incorrigible carelessness; and so Shirley did, but a very lovely picture of that tiresome quality.\nShe presented quite a contrast to Caroline. There was style in every fold of her dress and every line of her figure. The rich silk suited her better than a simpler costume; the deep embroidered scarf became her. She wore it negligently but gracefully. The wreath on her bonnet crowned her well. The attention to fashion, the tasteful appliance of ornament in each portion of her dress, were quite in place with her. All this suited her, like the frank light in her eyes, the rallying smile about her lips, like her shaft-straight carriage and lightsome step. Caroline took her hand when she was dressed, hurried her downstairs, out of doors; and thus they sped through the fields, laughing as they went, and looking very much like a snow-white dove and gem-tinted bird of paradise joined in social flight.\nThanks to Miss Helstone's promptitude, they arrived in good time. While yet trees hid the church, they heard the bell tolling a measured but urgent summons for all to assemble. The trooping in of numbers, the trampling of many steps and murmuring of many voices, were likewise audible. From a rising ground, they presently saw, on the Whinbury road, the Whinbury school approaching. It numbered five hundred souls. The rector and curate, Boultby and Donne, headed it--the former looming large in full canonicals, walking as became a beneficed priest, under the canopy of a shovel-hat, with the dignity of an ample corporation, the embellishment of the squarest and vastest of black coats, and the support of the stoutest of gold-headed canes. As the doctor walked, he now and then slightly flourished his cane, and inclined his shovel-hat with a dogmatical wag towards his aide-de-camp. That aide-de-camp--Donne, to wit--narrow as the line of his shape was, compared to the broad bulk of his principal, contrived, notwithstanding, to look every inch a curate. All about him was pragmatical and self-complacent, from his turned-up nose and elevated chin to his clerical black gaiters, his somewhat short, strapless trousers, and his square-toed shoes.\nWalk on, Mr. Donne! You have undergone scrutiny. You think you look well. Whether the white and purple figures watching you from yonder hill think so is another question.\nThese figures come running down when the regiment has marched by. The churchyard is full of children and teachers, all in their very best holiday attire; and, distressed as is the district, bad as are the times, it is wonderful to see how respectably, how handsomely even, they have contrived to clothe themselves. That British love of decency will work miracles. The poverty which reduces an Irish girl to rags is impotent to rob the English girl of the neat wardrobe she knows necessary to her self-respect. Besides, the lady of the manor--that Shirley, now gazing with pleasure on this well-dressed and happy-looking crowd--has really done them good. Her seasonable bounty consoled many a poor family against the coming holiday, and supplied many a child with a new frock or bonnet for the occasion. She knows it, and is elate with the consciousness--glad that her money, example, and influence have really, substantially, benefited those around her. She cannot be charitable like Miss Ainley: it is not in her nature. It relieves her to feel that there is another way of being charitable, practicable for other characters, and under other circumstances.\nCaroline, too, is pleased, for she also has done good in her small way--robbed herself of more than one dress, ribbon, or collar she could ill spare, to aid in fitting out the scholars of her class; and as she could not give money, she has followed Miss Ainley's example in giving her time and her industry to sew for the children.\nNot only is the churchyard full, but the rectory garden is also thronged. Pairs and parties of ladies and gentlemen are seen walking amongst the waving lilacs and laburnums. The house also is occupied: at the wide-open parlour windows gay groups are standing. These are the patrons and teachers, who are to swell the procession. In the parson's croft, behind the rectory, are the musicians of the three parish bands, with their instruments. Fanny and Eliza, in the smartest of caps and gowns, and the whitest of aprons, move amongst them, serving out quarts of ale, whereof a stock was brewed very sound and strong some weeks since by the rector's orders, and under his special superintendence. Whatever he had a hand in must be managed handsomely. \"Shabby doings\" of any description were not endured under his sanction. From the erection of a public building, a church, school, or court-house, to the cooking of a dinner, he still advocated the lordly, liberal, and effective. Miss Keeldar was like him in this respect, and they mutually approved each other's arrangements.\nCaroline and Shirley were soon in the midst of the company. The former met them very easily for her. Instead of sitting down in a retired corner, or stealing away to her own room till the procession should be marshalled, according to her wont, she moved through the three parlours, conversed and smiled, absolutely spoke once or twice ere she was spoken to, and, in short, seemed a new creature. It was Shirley's presence which thus transformed her; the view of Miss Keeldar's air and manner did her a world of good. Shirley had no fear of her kind, no tendency to shrink from, to avoid it. All human beings--men, women, or children--whom low breeding or coarse presumption did not render positively offensive, were welcome enough to her--some much more so than others, of course; but, generally speaking, till a man had indisputably proved himself bad and a nuisance, Shirley was willing to think him good and an acquisition, and to treat him accordingly. This disposition made her a general favourite, for it robbed her very raillery of its sting, and gave her serious or smiling conversation a happy charm; nor did it diminish the value of her intimate friendship, which was a distinct thing from this social benevolence--depending, indeed, on quite a different part of her character. Miss Helstone was the choice of her affection and intellect; the Misses Pearson, Sykes, Wynne, etc., etc., only the profiteers by her good-nature and vivacity.\nDonne happened to come into the drawing-room while Shirley, sitting on the sofa, formed the centre of a tolerably wide circle. She had already forgotten her exasperation against him, and she bowed and smiled good-humouredly. The disposition of the man was then seen. He knew neither how to decline the advance with dignity, as one whose just pride has been wounded, nor how to meet it with frankness, as one who is glad to forget and forgive. His punishment had impressed him with no sense of shame, and he did not experience that feeling on encountering his chastiser. He was not vigorous enough in evil to be actively malignant--he merely passed by sheepishly with a rated, scowling look. Nothing could ever again reconcile him to his enemy; while no passion of resentment, for even sharper and more ignominious inflictions, could his lymphatic nature know.\n\"He was not worth a scene!\" said Shirley to Caroline. \"What a fool I was! To revenge on poor Donne his silly spite at Yorkshire is something like crushing a gnat for attacking the hide of a rhinoceros. Had I been a gentleman, I believe I should have helped him off the premises by dint of physical force. I am glad now I only employed the moral weapon. But he must come near me no more. I don't like him. He irritates me. There is not even amusement to be had out of him. Malone is better sport.\"\nIt seemed as if Malone wished to justify the preference, for the words were scarcely out of the speaker's mouth when Peter Augustus came up, all in _grande tenue_, gloved and scented, with his hair oiled and brushed to perfection, and bearing in one hand a huge bunch of cabbage-roses, five or six in full blow. These he presented to the heiress with a grace to which the most cunning pencil could do but defective justice. And who, after this, could dare to say that Peter was not a lady's man? He had gathered and he had given flowers; he had offered a sentimental, a poetic tribute at the shrine of Love or Mammon. Hercules holding the distaff was but a faint type of Peter bearing the roses. He must have thought this himself, for he seemed amazed at what he had done. He backed without a word; he was going away with a husky chuckle of self-satisfaction; then he bethought himself to stop and turn, to ascertain by ocular testimony that he really had presented a bouquet. Yes, there were the six red cabbages on the purple satin lap, a very white hand, with some gold rings on the fingers, slightly holding them together, and streaming ringlets, half hiding a laughing face, drooped over them. Only _half_ hiding! Peter saw the laugh; it was unmistakable. He was made a joke of; his gallantry, his chivalry, were the subject of a jest for a petticoat--for two petticoats: Miss Helstone too was smiling. Moreover, he felt he was seen through, and Peter grew black as a thunder-cloud. When Shirley looked up, a fell eye was fastened on her. Malone, at least, had energy enough in hate. She saw it in his glance.\n\"Peter _is_ worth a scene, and shall have it, if he likes, one day,\" she whispered to her friend.\nAnd now--solemn and sombre as to their colour, though bland enough as to their faces--appeared at the dining-room door the three rectors. They had hitherto been busy in the church, and were now coming to take some little refreshment for the body, ere the march commenced. The large morocco-covered easy-chair had been left vacant for Dr. Boultby. He was put into it, and Caroline, obeying the instigations of Shirley, who told her now was the time to play the hostess, hastened to hand to her uncle's vast, revered, and, on the whole, worthy friend, a glass of wine and a plate of macaroons. Boultby's churchwardens, patrons of the Sunday school both, as he insisted on their being, were already beside him; Mrs. Sykes and the other ladies of his congregation were on his right hand and on his left, expressing their hopes that he was not fatigued, their fears that the day would be too warm for him. Mrs. Boultby, who held an opinion that when her lord dropped asleep after a good dinner his face became as the face of an angel, was bending over him, tenderly wiping some perspiration, real or imaginary, from his brow. Boultby, in short, was in his glory, and in a round, sound _voix de poitrine_ he rumbled out thanks for attentions and assurances of his tolerable health. Of Caroline he took no manner of notice as she came near, save to accept what she offered. He did not see her--he never did see her; he hardly knew that such a person existed. He saw the macaroons, however, and being fond of sweets, possessed himself of a small handful thereof. The wine Mrs. Boultby insisted on mingling with hot water, and qualifying with sugar and nutmeg.\nMr. Hall stood near an open window, breathing the fresh air and scent of flowers, and talking like a brother to Miss Ainley. To him Caroline turned her attention with pleasure. \"What should she bring him? He must not help himself--he must be served by her.\" And she provided herself with a little salver, that she might offer him variety. Margaret Hall joined them; so did Miss Keeldar. The four ladies stood round their favourite pastor. They also had an idea that they looked on the face of an earthly angel. Cyril Hall was their pope, infallible to them as Dr. Thomas Boultby to his admirers. A throng, too, enclosed the rector of Briarfield--twenty or more pressed round him; and no parson was ever more potent in a circle than old Helstone. The curates, herding together after their manner, made a constellation of three lesser planets. Divers young ladies watched them afar off, but ventured not nigh.\nMr. Helstone produced his watch. \"Ten minutes to two,\" he announced aloud. \"Time for all to fall into line. Come.\" He seized his shovel-hat and marched away. All rose and followed _en masse_.\nThe twelve hundred children were drawn up in three bodies of four hundred souls each; in the rear of each regiment was stationed a band; between every twenty there was an interval, wherein Helstone posted the teachers in pairs. To the van of the armies he summoned,--\n\"Grace Boultby and Mary Sykes lead out Whinbury.\n\"Margaret Hall and Mary Ann Ainley conduct Nunnely.\n\"Caroline Helstone and Shirley Keeldar head Briarfield.\"\nThen again he gave command,--\n\"Mr. Donne to Whinbury; Mr. Sweeting to Nunnely; Mr. Malone to Briarfield.\"\nAnd these gentlemen stepped up before the lady-generals.\nThe rectors passed to the full front; the parish clerks fell to the extreme rear. Helstone lifted his shovel-hat. In an instant out clashed the eight bells in the tower, loud swelled the sounding bands, flute spoke and clarion answered, deep rolled the drums, and away they marched.\nThe broad white road unrolled before the long procession, the sun and sky surveyed it cloudless, the wind tossed the tree boughs above it, and the twelve hundred children and one hundred and forty adults of which it was composed trod on in time and tune, with gay faces and glad hearts. It was a joyous scene, and a scene to do good. It was a day of happiness for rich and poor--the work, first of God, and then of the clergy. Let England's priests have their due. They are a faulty set in some respects, being only of common flesh and blood like us all; but the land would be badly off without them. Britain would miss her church, if that church fell. God save it! God also reform it!",
        "paragraph_chars": [
            [
                0,
                854
            ],
            [
                854,
                3602
            ],
            [
                3602,
                3780
            ],
            [
                3780,
                4035
            ],
            [
                4035,
                4064
            ],
            [
                4064,
                4076
            ],
            [
                4076,
                4123
            ],
            [
                4123,
                4629
            ],
            [
                4629,
                5905
            ],
            [
                5905,
                6580
            ],
            [
                6580,
                7369
            ],
            [
                7369,
                8169
            ],
            [
                8169,
                9696
            ],
            [
                9696,
                9972
            ],
            [
                9972,
                10488
            ],
            [
                10488,
                11358
            ],
            [
                11358,
                12164
            ],
            [
                12164,
                13415
            ],
            [
                13415,
                13586
            ],
            [
                13586,
                14744
            ],
            [
                14744,
                15076
            ],
            [
                15076,
                16151
            ],
            [
                16151,
                17599
            ],
            [
                17599,
                18459
            ],
            [
                18459,
                18956
            ],
            [
                18956,
                20571
            ],
            [
                20571,
                20669
            ],
            [
                20669,
                22321
            ],
            [
                22321,
                23229
            ],
            [
                23229,
                23421
            ],
            [
                23421,
                23689
            ],
            [
                23689,
                23738
            ],
            [
                23738,
                23790
            ],
            [
                23790,
                23847
            ],
            [
                23847,
                23877
            ],
            [
                23877,
                23953
            ],
            [
                23953,
                24010
            ],
            [
                24010,
                24293
            ],
            [
                24293,
                24978
            ]
        ],
        "segment_chars": [
            [
                0,
                20
            ],
            [
                20,
                354
            ],
            [
                354,
                395
            ],
            [
                395,
                517
            ],
            [
                517,
                636
            ],
            [
                636,
                798
            ],
            [
                798,
                854
            ],
            [
                854,
                1040
            ],
            [
                1040,
                1165
            ],
            [
                1165,
                1485
            ],
            [
                1485,
                1581
            ],
            [
                1581,
                1630
            ],
            [
                1630,
                1662
            ],
            [
                1662,
                1739
            ],
            [
                1739,
                1824
            ],
            [
                1824,
                1912
            ],
            [
                1912,
                2043
            ],
            [
                2043,
                2142
            ],
            [
                2142,
                2281
            ],
            [
                2281,
                2411
            ],
            [
                2411,
                2558
            ],
            [
                2558,
                2694
            ],
            [
                2694,
                2825
            ],
            [
                2825,
                2862
            ],
            [
                2862,
                2904
            ],
            [
                2904,
                2962
            ],
            [
                2962,
                2992
            ],
            [
                2992,
                3072
            ],
            [
                3072,
                3153
            ],
            [
                3153,
                3289
            ],
            [
                3289,
                3488
            ],
            [
                3488,
                3541
            ],
            [
                3541,
                3602
            ],
            [
                3602,
                3681
            ],
            [
                3681,
                3780
            ],
            [
                3780,
                3824
            ],
            [
                3824,
                3852
            ],
            [
                3852,
                4035
            ],
            [
                4035,
                4044
            ],
            [
                4044,
                4064
            ],
            [
                4064,
                4076
            ],
            [
                4076,
                4123
            ],
            [
                4123,
                4257
            ],
            [
                4257,
                4528
            ],
            [
                4528,
                4564
            ],
            [
                4564,
                4629
            ],
            [
                4629,
                5021
            ],
            [
                5021,
                5174
            ],
            [
                5174,
                5463
            ],
            [
                5463,
                5638
            ],
            [
                5638,
                5693
            ],
            [
                5693,
                5905
            ],
            [
                5905,
                6005
            ],
            [
                6005,
                6315
            ],
            [
                6315,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                6900
            ],
            [
                6900,
                7369
            ],
            [
                7369,
                7487
            ],
            [
                7487,
                7541
            ],
            [
                7541,
                7617
            ],
            [
                7617,
                7794
            ],
            [
                7794,
                7862
            ],
            [
                7862,
                7982
            ],
            [
                7982,
                8076
            ],
            [
                8076,
                8169
            ],
            [
                8169,
                8216
            ],
            [
                8216,
                8429
            ],
            [
                8429,
                8612
            ],
            [
                8612,
                8941
            ],
            [
                8941,
                9071
            ],
            [
                9071,
                9355
            ],
            [
                9355,
                9501
            ],
            [
                9501,
                9696
            ],
            [
                9696,
                9972
            ],
            [
                9972,
                10079
            ],
            [
                10079,
                10150
            ],
            [
                10150,
                10255
            ],
            [
                10255,
                10338
            ],
            [
                10338,
                10488
            ],
            [
                10488,
                10551
            ],
            [
                10551,
                10642
            ],
            [
                10642,
                10702
            ],
            [
                10702,
                10728
            ],
            [
                10728,
                10845
            ],
            [
                10845,
                11082
            ],
            [
                11082,
                11358
            ],
            [
                11358,
                11402
            ],
            [
                11402,
                11475
            ],
            [
                11475,
                11570
            ],
            [
                11570,
                11610
            ],
            [
                11610,
                11653
            ],
            [
                11653,
                11774
            ],
            [
                11774,
                11917
            ],
            [
                11917,
                12164
            ],
            [
                12164,
                12230
            ],
            [
                12230,
                12341
            ],
            [
                12341,
                12450
            ],
            [
                12450,
                12547
            ],
            [
                12547,
                12579
            ],
            [
                12579,
                12907
            ],
            [
                12907,
                13051
            ],
            [
                13051,
                13224
            ],
            [
                13224,
                13415
            ],
            [
                13415,
                13435
            ],
            [
                13435,
                13464
            ],
            [
                13464,
                13489
            ],
            [
                13489,
                13586
            ],
            [
                13586,
                13652
            ],
            [
                13652,
                13901
            ],
            [
                13901,
                13950
            ],
            [
                13950,
                14096
            ],
            [
                14096,
                14240
            ],
            [
                14240,
                14389
            ],
            [
                14389,
                14540
            ],
            [
                14540,
                14608
            ],
            [
                14608,
                14744
            ],
            [
                14744,
                15076
            ],
            [
                15076,
                15150
            ],
            [
                15150,
                15250
            ],
            [
                15250,
                15336
            ],
            [
                15336,
                15405
            ],
            [
                15405,
                15517
            ],
            [
                15517,
                15771
            ],
            [
                15771,
                15825
            ],
            [
                15825,
                15897
            ],
            [
                15897,
                16054
            ],
            [
                16054,
                16151
            ],
            [
                16151,
                16211
            ],
            [
                16211,
                16252
            ],
            [
                16252,
                16547
            ],
            [
                16547,
                16668
            ],
            [
                16668,
                16742
            ],
            [
                16742,
                17108
            ],
            [
                17108,
                17439
            ],
            [
                17439,
                17599
            ],
            [
                17599,
                17726
            ],
            [
                17726,
                17824
            ],
            [
                17824,
                17866
            ],
            [
                17866,
                18042
            ],
            [
                18042,
                18169
            ],
            [
                18169,
                18290
            ],
            [
                18290,
                18459
            ],
            [
                18459,
                18487
            ],
            [
                18487,
                18513
            ],
            [
                18513,
                18533
            ],
            [
                18533,
                18661
            ],
            [
                18661,
                18764
            ],
            [
                18764,
                18812
            ],
            [
                18812,
                18846
            ],
            [
                18846,
                18864
            ],
            [
                18864,
                18881
            ],
            [
                18881,
                18931
            ],
            [
                18931,
                18956
            ],
            [
                18956,
                19268
            ],
            [
                19268,
                19380
            ],
            [
                19380,
                19452
            ],
            [
                19452,
                19574
            ],
            [
                19574,
                19652
            ],
            [
                19652,
                19729
            ],
            [
                19729,
                19933
            ],
            [
                19933,
                20155
            ],
            [
                20155,
                20175
            ],
            [
                20175,
                20217
            ],
            [
                20217,
                20364
            ],
            [
                20364,
                20444
            ],
            [
                20444,
                20500
            ],
            [
                20500,
                20545
            ],
            [
                20545,
                20571
            ],
            [
                20571,
                20669
            ],
            [
                20669,
                20807
            ],
            [
                20807,
                20941
            ],
            [
                20941,
                21016
            ],
            [
                21016,
                21261
            ],
            [
                21261,
                21570
            ],
            [
                21570,
                21790
            ],
            [
                21790,
                21945
            ],
            [
                21945,
                22036
            ],
            [
                22036,
                22121
            ],
            [
                22121,
                22224
            ],
            [
                22224,
                22321
            ],
            [
                22321,
                22446
            ],
            [
                22446,
                22498
            ],
            [
                22498,
                22526
            ],
            [
                22526,
                22579
            ],
            [
                22579,
                22660
            ],
            [
                22660,
                22708
            ],
            [
                22708,
                22760
            ],
            [
                22760,
                22832
            ],
            [
                22832,
                22917
            ],
            [
                22917,
                23067
            ],
            [
                23067,
                23163
            ],
            [
                23163,
                23229
            ],
            [
                23229,
                23262
            ],
            [
                23262,
                23304
            ],
            [
                23304,
                23337
            ],
            [
                23337,
                23344
            ],
            [
                23344,
                23387
            ],
            [
                23387,
                23421
            ],
            [
                23421,
                23649
            ],
            [
                23649,
                23689
            ],
            [
                23689,
                23738
            ],
            [
                23738,
                23790
            ],
            [
                23790,
                23847
            ],
            [
                23847,
                23877
            ],
            [
                23877,
                23953
            ],
            [
                23953,
                24010
            ],
            [
                24010,
                24092
            ],
            [
                24092,
                24124
            ],
            [
                24124,
                24293
            ],
            [
                24293,
                24580
            ],
            [
                24580,
                24627
            ],
            [
                24627,
                24720
            ],
            [
                24720,
                24758
            ],
            [
                24758,
                24894
            ],
            [
                24894,
                24946
            ],
            [
                24946,
                24959
            ],
            [
                24959,
                24978
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                20,
                73
            ],
            [
                83,
                131
            ],
            [
                175,
                235
            ],
            [
                173,
                174
            ],
            [
                296,
                303
            ],
            [
                317,
                354
            ],
            [
                354,
                395
            ],
            [
                395,
                517
            ],
            [
                517,
                524
            ],
            [
                538,
                600
            ],
            [
                612,
                636
            ],
            [
                636,
                663
            ],
            [
                686,
                705
            ],
            [
                707,
                725
            ],
            [
                731,
                769
            ],
            [
                796,
                798
            ],
            [
                798,
                854
            ],
            [
                854,
                926
            ],
            [
                954,
                958
            ],
            [
                940,
                943
            ],
            [
                973,
                1010
            ],
            [
                1012,
                1040
            ],
            [
                1040,
                1049
            ],
            [
                1062,
                1071
            ],
            [
                1079,
                1085
            ],
            [
                1163,
                1165
            ],
            [
                1165,
                1172
            ],
            [
                1185,
                1229
            ],
            [
                1238,
                1308
            ],
            [
                1323,
                1327
            ],
            [
                1336,
                1347
            ],
            [
                1381,
                1385
            ],
            [
                1372,
                1379
            ],
            [
                1379,
                1380
            ],
            [
                1400,
                1414
            ],
            [
                1429,
                1438
            ],
            [
                1443,
                1448
            ],
            [
                1483,
                1484
            ],
            [
                1485,
                1581
            ],
            [
                1581,
                1630
            ],
            [
                1630,
                1647
            ],
            [
                1650,
                1656
            ],
            [
                1676,
                1739
            ],
            [
                1739,
                1788
            ],
            [
                1822,
                1824
            ],
            [
                1824,
                1865
            ],
            [
                1876,
                1912
            ],
            [
                2083,
                2142
            ],
            [
                2142,
                2168
            ],
            [
                2238,
                2281
            ],
            [
                2359,
                2409
            ],
            [
                2432,
                2437
            ],
            [
                2492,
                2558
            ],
            [
                2578,
                2587
            ],
            [
                2632,
                2636
            ],
            [
                2602,
                2621
            ],
            [
                2642,
                2694
            ],
            [
                2737,
                2825
            ],
            [
                2962,
                2971
            ],
            [
                2946,
                2960
            ],
            [
                2975,
                2992
            ],
            [
                2997,
                3012
            ],
            [
                3022,
                3024
            ],
            [
                3072,
                3082
            ],
            [
                3113,
                3123
            ],
            [
                3061,
                3071
            ],
            [
                3202,
                3206
            ],
            [
                3168,
                3200
            ],
            [
                3287,
                3289
            ],
            [
                3442,
                3452
            ],
            [
                3457,
                3465
            ],
            [
                3467,
                3469
            ],
            [
                3474,
                3488
            ],
            [
                3488,
                3539
            ],
            [
                3602,
                3679
            ],
            [
                3780,
                3785
            ],
            [
                3822,
                3824
            ],
            [
                3824,
                3838
            ],
            [
                3850,
                3852
            ],
            [
                3852,
                3964
            ],
            [
                4006,
                4035
            ],
            [
                4035,
                4044
            ],
            [
                4044,
                4064
            ],
            [
                4064,
                4070
            ],
            [
                4076,
                4123
            ],
            [
                4202,
                4218
            ],
            [
                4138,
                4140
            ],
            [
                4146,
                4150
            ],
            [
                4123,
                4126
            ],
            [
                4242,
                4249
            ],
            [
                4255,
                4257
            ],
            [
                4257,
                4283
            ],
            [
                4298,
                4373
            ],
            [
                4443,
                4528
            ],
            [
                4528,
                4563
            ],
            [
                4593,
                4596
            ],
            [
                4564,
                4592
            ],
            [
                4627,
                4628
            ],
            [
                4661,
                4675
            ],
            [
                4659,
                4660
            ],
            [
                4686,
                4725
            ],
            [
                4784,
                4796
            ],
            [
                4800,
                4813
            ],
            [
                4824,
                4867
            ],
            [
                4633,
                4634
            ],
            [
                4869,
                4898
            ],
            [
                4929,
                4932
            ],
            [
                4899,
                4927
            ],
            [
                5012,
                5013
            ],
            [
                5021,
                5075
            ],
            [
                5088,
                5174
            ],
            [
                5174,
                5199
            ],
            [
                5209,
                5226
            ],
            [
                5228,
                5238
            ],
            [
                5247,
                5293
            ],
            [
                5461,
                5463
            ],
            [
                5463,
                5475
            ],
            [
                5495,
                5542
            ],
            [
                5622,
                5624
            ],
            [
                5564,
                5621
            ],
            [
                5636,
                5638
            ],
            [
                5638,
                5693
            ],
            [
                5693,
                5800
            ],
            [
                5801,
                5860
            ],
            [
                5862,
                5876
            ],
            [
                5890,
                5905
            ],
            [
                5912,
                5938
            ],
            [
                5948,
                5958
            ],
            [
                6137,
                6138
            ],
            [
                6012,
                6045
            ],
            [
                6131,
                6137
            ],
            [
                6060,
                6066
            ],
            [
                6232,
                6233
            ],
            [
                6322,
                6359
            ],
            [
                6362,
                6429
            ],
            [
                6550,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                6584
            ],
            [
                6605,
                6615
            ],
            [
                6625,
                6654
            ],
            [
                6663,
                6687
            ],
            [
                6697,
                6732
            ],
            [
                6829,
                6832
            ],
            [
                6746,
                6766
            ],
            [
                6850,
                6852
            ],
            [
                6783,
                6800
            ],
            [
                6898,
                6900
            ],
            [
                6900,
                6954
            ],
            [
                7012,
                7148
            ],
            [
                7161,
                7195
            ],
            [
                7197,
                7200
            ],
            [
                7212,
                7265
            ],
            [
                7267,
                7295
            ],
            [
                7324,
                7369
            ],
            [
                7369,
                7419
            ],
            [
                7478,
                7485
            ],
            [
                7420,
                7451
            ],
            [
                7485,
                7487
            ],
            [
                7487,
                7511
            ],
            [
                7513,
                7541
            ],
            [
                7541,
                7564
            ],
            [
                7584,
                7617
            ],
            [
                7623,
                7638
            ],
            [
                7643,
                7732
            ],
            [
                7734,
                7736
            ],
            [
                7765,
                7772
            ],
            [
                7778,
                7794
            ],
            [
                7794,
                7851
            ],
            [
                7860,
                7862
            ],
            [
                7921,
                7972
            ],
            [
                7980,
                7982
            ],
            [
                7985,
                7995
            ],
            [
                7999,
                8018
            ],
            [
                8024,
                8032
            ],
            [
                8063,
                8068
            ],
            [
                8039,
                8044
            ],
            [
                8069,
                8075
            ],
            [
                8169,
                8185
            ],
            [
                8190,
                8216
            ],
            [
                8216,
                8296
            ],
            [
                8324,
                8341
            ],
            [
                8365,
                8377
            ],
            [
                8305,
                8306
            ],
            [
                8379,
                8397
            ],
            [
                8399,
                8429
            ],
            [
                8429,
                8466
            ],
            [
                8489,
                8501
            ],
            [
                8578,
                8579
            ],
            [
                8539,
                8549
            ],
            [
                8560,
                8568
            ],
            [
                8610,
                8612
            ],
            [
                8612,
                8624
            ],
            [
                8626,
                8721
            ],
            [
                8815,
                8826
            ],
            [
                8852,
                8867
            ],
            [
                8878,
                8941
            ],
            [
                8945,
                8978
            ],
            [
                8995,
                9003
            ],
            [
                9069,
                9070
            ],
            [
                9071,
                9107
            ],
            [
                9131,
                9136
            ],
            [
                9197,
                9216
            ],
            [
                9353,
                9355
            ],
            [
                9360,
                9363
            ],
            [
                9432,
                9441
            ],
            [
                9412,
                9415
            ],
            [
                9458,
                9501
            ],
            [
                9696,
                9768
            ],
            [
                9784,
                9907
            ],
            [
                9915,
                9962
            ],
            [
                9970,
                9972
            ],
            [
                9972,
                9998
            ],
            [
                10021,
                10039
            ],
            [
                10051,
                10079
            ],
            [
                10289,
                10290
            ],
            [
                10276,
                10289
            ],
            [
                10291,
                10294
            ],
            [
                10333,
                10336
            ],
            [
                10295,
                10304
            ],
            [
                10313,
                10324
            ],
            [
                10336,
                10338
            ],
            [
                10338,
                10348
            ],
            [
                10367,
                10384
            ],
            [
                10429,
                10443
            ],
            [
                10455,
                10488
            ],
            [
                10488,
                10540
            ],
            [
                10545,
                10551
            ],
            [
                10551,
                10574
            ],
            [
                10589,
                10642
            ],
            [
                10642,
                10701
            ],
            [
                10702,
                10728
            ],
            [
                10728,
                10762
            ],
            [
                10766,
                10800
            ],
            [
                10817,
                10820
            ],
            [
                10827,
                10833
            ],
            [
                10840,
                10845
            ],
            [
                10845,
                10904
            ],
            [
                10917,
                10972
            ],
            [
                10999,
                11050
            ],
            [
                11080,
                11082
            ],
            [
                11082,
                11141
            ],
            [
                11159,
                11161
            ],
            [
                11165,
                11234
            ],
            [
                11244,
                11258
            ],
            [
                11272,
                11358
            ],
            [
                11358,
                11402
            ],
            [
                11402,
                11475
            ],
            [
                11475,
                11534
            ],
            [
                11540,
                11570
            ],
            [
                11570,
                11610
            ],
            [
                11949,
                11952
            ],
            [
                11804,
                11828
            ],
            [
                11833,
                11863
            ],
            [
                11917,
                11939
            ],
            [
                11897,
                11900
            ],
            [
                11962,
                11973
            ],
            [
                11986,
                12148
            ],
            [
                12156,
                12164
            ],
            [
                12164,
                12187
            ],
            [
                12201,
                12230
            ],
            [
                12262,
                12291
            ],
            [
                12312,
                12341
            ],
            [
                12369,
                12425
            ],
            [
                12427,
                12431
            ],
            [
                12441,
                12450
            ],
            [
                12472,
                12476
            ],
            [
                12487,
                12490
            ],
            [
                12514,
                12545
            ],
            [
                12470,
                12471
            ],
            [
                12559,
                12579
            ],
            [
                12602,
                12619
            ],
            [
                12621,
                12630
            ],
            [
                12632,
                12642
            ],
            [
                12677,
                12684
            ],
            [
                12715,
                12753
            ],
            [
                12812,
                12860
            ],
            [
                12876,
                12907
            ],
            [
                13070,
                13075
            ],
            [
                13203,
                13222
            ],
            [
                13273,
                13302
            ],
            [
                13263,
                13273
            ],
            [
                13075,
                13076
            ],
            [
                13312,
                13366
            ],
            [
                13378,
                13415
            ],
            [
                13415,
                13435
            ],
            [
                13435,
                13464
            ],
            [
                13464,
                13489
            ],
            [
                13489,
                13586
            ],
            [
                13586,
                13652
            ],
            [
                13652,
                13713
            ],
            [
                13719,
                13743
            ],
            [
                13774,
                13836
            ],
            [
                13859,
                13868
            ],
            [
                13879,
                13901
            ],
            [
                14105,
                14126
            ],
            [
                14179,
                14180
            ],
            [
                14133,
                14141
            ],
            [
                14146,
                14174
            ],
            [
                14192,
                14211
            ],
            [
                14213,
                14240
            ],
            [
                14240,
                14243
            ],
            [
                14255,
                14261
            ],
            [
                14322,
                14370
            ],
            [
                14387,
                14389
            ],
            [
                14389,
                14409
            ],
            [
                14445,
                14459
            ],
            [
                14512,
                14539
            ],
            [
                14744,
                14814
            ],
            [
                14823,
                14853
            ],
            [
                14863,
                14865
            ],
            [
                14855,
                14861
            ],
            [
                14873,
                15033
            ],
            [
                15051,
                15076
            ],
            [
                15076,
                15134
            ],
            [
                15140,
                15150
            ],
            [
                15168,
                15195
            ],
            [
                15201,
                15220
            ],
            [
                15228,
                15250
            ],
            [
                15250,
                15310
            ],
            [
                15346,
                15370
            ],
            [
                15403,
                15405
            ],
            [
                15405,
                15517
            ],
            [
                15517,
                15536
            ],
            [
                15541,
                15549
            ],
            [
                15553,
                15567
            ],
            [
                15594,
                15641
            ],
            [
                15662,
                15668
            ],
            [
                15708,
                15730
            ],
            [
                15769,
                15771
            ],
            [
                15865,
                15868
            ],
            [
                15825,
                15839
            ],
            [
                16054,
                16151
            ],
            [
                16151,
                16211
            ],
            [
                16231,
                16252
            ],
            [
                16252,
                16329
            ],
            [
                16393,
                16454
            ],
            [
                16466,
                16485
            ],
            [
                16490,
                16547
            ],
            [
                16547,
                16599
            ],
            [
                16666,
                16668
            ],
            [
                16668,
                16690
            ],
            [
                16699,
                16727
            ],
            [
                16738,
                16740
            ],
            [
                17076,
                17081
            ],
            [
                16921,
                16923
            ],
            [
                16742,
                16745
            ],
            [
                16727,
                16728
            ],
            [
                17028,
                17031
            ],
            [
                17134,
                17153
            ],
            [
                16740,
                16741
            ],
            [
                17599,
                17702
            ],
            [
                17713,
                17726
            ],
            [
                17726,
                17824
            ],
            [
                17843,
                17850
            ],
            [
                17828,
                17839
            ],
            [
                17851,
                17866
            ],
            [
                17866,
                17896
            ],
            [
                17909,
                18042
            ],
            [
                18230,
                18267
            ],
            [
                18275,
                18277
            ],
            [
                18288,
                18289
            ],
            [
                18459,
                18487
            ],
            [
                18487,
                18513
            ],
            [
                18513,
                18533
            ],
            [
                18533,
                18535
            ],
            [
                18536,
                18557
            ],
            [
                18562,
                18573
            ],
            [
                18577,
                18589
            ],
            [
                18600,
                18661
            ],
            [
                18661,
                18708
            ],
            [
                18709,
                18736
            ],
            [
                18762,
                18764
            ],
            [
                18812,
                18846
            ],
            [
                18864,
                18881
            ],
            [
                18887,
                18898
            ],
            [
                18929,
                18931
            ],
            [
                18931,
                18956
            ],
            [
                19017,
                19047
            ],
            [
                19062,
                19087
            ],
            [
                18972,
                18978
            ],
            [
                19088,
                19095
            ],
            [
                19118,
                19159
            ],
            [
                19185,
                19240
            ],
            [
                19266,
                19268
            ],
            [
                19268,
                19301
            ],
            [
                19378,
                19380
            ],
            [
                19384,
                19452
            ],
            [
                19472,
                19522
            ],
            [
                19533,
                19562
            ],
            [
                19572,
                19574
            ],
            [
                19652,
                19729
            ],
            [
                19739,
                19753
            ],
            [
                19858,
                19859
            ],
            [
                19755,
                19853
            ],
            [
                19931,
                19933
            ],
            [
                19938,
                19996
            ],
            [
                20002,
                20012
            ],
            [
                20060,
                20072
            ],
            [
                20083,
                20086
            ],
            [
                20144,
                20153
            ],
            [
                19936,
                19937
            ],
            [
                20097,
                20134
            ],
            [
                20153,
                20154
            ],
            [
                20155,
                20159
            ],
            [
                20161,
                20165
            ],
            [
                20167,
                20175
            ],
            [
                20175,
                20217
            ],
            [
                20217,
                20243
            ],
            [
                20259,
                20267
            ],
            [
                20274,
                20311
            ],
            [
                20313,
                20364
            ],
            [
                20407,
                20444
            ],
            [
                20444,
                20500
            ],
            [
                20500,
                20544
            ],
            [
                20571,
                20577
            ],
            [
                20579,
                20581
            ],
            [
                20583,
                20669
            ],
            [
                20669,
                20676
            ],
            [
                20788,
                20805
            ],
            [
                20764,
                20787
            ],
            [
                20805,
                20807
            ],
            [
                20807,
                20815
            ],
            [
                20825,
                20858
            ],
            [
                20863,
                20882
            ],
            [
                20890,
                20901
            ],
            [
                20920,
                20929
            ],
            [
                20939,
                20941
            ],
            [
                20941,
                20950
            ],
            [
                20967,
                21016
            ],
            [
                21016,
                21048
            ],
            [
                21138,
                21154
            ],
            [
                21219,
                21261
            ],
            [
                21261,
                21284
            ],
            [
                21352,
                21375
            ],
            [
                21319,
                21323
            ],
            [
                21429,
                21433
            ],
            [
                21377,
                21428
            ],
            [
                21467,
                21516
            ],
            [
                21568,
                21570
            ],
            [
                21570,
                21582
            ],
            [
                21699,
                21790
            ],
            [
                21790,
                21825
            ],
            [
                21943,
                21945
            ],
            [
                21945,
                21967
            ],
            [
                21978,
                21984
            ],
            [
                22001,
                22036
            ],
            [
                22036,
                22054
            ],
            [
                22056,
                22121
            ],
            [
                22121,
                22150
            ],
            [
                22222,
                22223
            ],
            [
                22321,
                22356
            ],
            [
                22407,
                22446
            ],
            [
                22446,
                22468
            ],
            [
                22483,
                22498
            ],
            [
                22498,
                22524
            ],
            [
                22583,
                22617
            ],
            [
                22624,
                22625
            ],
            [
                22626,
                22660
            ],
            [
                22660,
                22708
            ],
            [
                22708,
                22760
            ],
            [
                22917,
                22931
            ],
            [
                22952,
                22954
            ],
            [
                22974,
                22981
            ],
            [
                22932,
                22940
            ],
            [
                23053,
                23067
            ],
            [
                23067,
                23096
            ],
            [
                23115,
                23163
            ],
            [
                23170,
                23229
            ],
            [
                23229,
                23262
            ],
            [
                23262,
                23296
            ],
            [
                23302,
                23304
            ],
            [
                23304,
                23309
            ],
            [
                23318,
                23337
            ],
            [
                23337,
                23344
            ],
            [
                23344,
                23387
            ],
            [
                23387,
                23408
            ],
            [
                23410,
                23418
            ],
            [
                23421,
                23539
            ],
            [
                23550,
                23588
            ],
            [
                23630,
                23638
            ],
            [
                23647,
                23649
            ],
            [
                23649,
                23655
            ],
            [
                23660,
                23673
            ],
            [
                23677,
                23685
            ],
            [
                23689,
                23738
            ],
            [
                23738,
                23790
            ],
            [
                23790,
                23847
            ],
            [
                23847,
                23873
            ],
            [
                23877,
                23953
            ],
            [
                23953,
                23983
            ],
            [
                24008,
                24009
            ],
            [
                24010,
                24021
            ],
            [
                24029,
                24035
            ],
            [
                24041,
                24047
            ],
            [
                24092,
                24124
            ],
            [
                24138,
                24153
            ],
            [
                24160,
                24196
            ],
            [
                24206,
                24211
            ],
            [
                24245,
                24293
            ],
            [
                24293,
                24349
            ],
            [
                24436,
                24496
            ],
            [
                24522,
                24529
            ],
            [
                24546,
                24580
            ],
            [
                24580,
                24602
            ],
            [
                24634,
                24670
            ],
            [
                24718,
                24720
            ],
            [
                24720,
                24758
            ],
            [
                24758,
                24808
            ],
            [
                24819,
                24894
            ],
            [
                24894,
                24946
            ],
            [
                24946,
                24959
            ],
            [
                24959,
                24978
            ]
        ],
        "row_chars": [
            [
                0,
                20
            ],
            [
                20,
                354
            ],
            [
                354,
                395
            ],
            [
                395,
                517
            ],
            [
                517,
                636
            ],
            [
                636,
                798
            ],
            [
                798,
                854
            ],
            [
                854,
                1040
            ],
            [
                1040,
                1165
            ],
            [
                1165,
                1485
            ],
            [
                1485,
                1581
            ],
            [
                1581,
                1630
            ],
            [
                1630,
                1739
            ],
            [
                1739,
                1824
            ],
            [
                1824,
                1912
            ],
            [
                1912,
                2043
            ],
            [
                2043,
                2142
            ],
            [
                2142,
                2281
            ],
            [
                2281,
                2558
            ],
            [
                2558,
                2694
            ],
            [
                2694,
                2825
            ],
            [
                2825,
                2862
            ],
            [
                2862,
                2904
            ],
            [
                2904,
                2992
            ],
            [
                2992,
                3153
            ],
            [
                3153,
                3289
            ],
            [
                3289,
                3488
            ],
            [
                3488,
                3541
            ],
            [
                3541,
                3602
            ],
            [
                3602,
                3681
            ],
            [
                3681,
                3780
            ],
            [
                3780,
                3824
            ],
            [
                3824,
                3852
            ],
            [
                3852,
                4035
            ],
            [
                4035,
                4044
            ],
            [
                4044,
                4064
            ],
            [
                4064,
                4076
            ],
            [
                4076,
                4123
            ],
            [
                4123,
                4257
            ],
            [
                4257,
                4528
            ],
            [
                4528,
                4564
            ],
            [
                4564,
                4629
            ],
            [
                4629,
                5021
            ],
            [
                5021,
                5174
            ],
            [
                5174,
                5463
            ],
            [
                5463,
                5638
            ],
            [
                5638,
                5693
            ],
            [
                5693,
                5905
            ],
            [
                5905,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                6900
            ],
            [
                6900,
                7369
            ],
            [
                7369,
                7487
            ],
            [
                7487,
                7541
            ],
            [
                7541,
                7617
            ],
            [
                7617,
                7794
            ],
            [
                7794,
                7862
            ],
            [
                7862,
                7982
            ],
            [
                7982,
                8076
            ],
            [
                8076,
                8216
            ],
            [
                8216,
                8429
            ],
            [
                8429,
                8612
            ],
            [
                8612,
                8941
            ],
            [
                8941,
                9071
            ],
            [
                9071,
                9355
            ],
            [
                9355,
                9501
            ],
            [
                9501,
                9696
            ],
            [
                9696,
                9972
            ],
            [
                9972,
                10079
            ],
            [
                10079,
                10150
            ],
            [
                10150,
                10255
            ],
            [
                10255,
                10338
            ],
            [
                10338,
                10488
            ],
            [
                10488,
                10551
            ],
            [
                10551,
                10642
            ],
            [
                10642,
                10702
            ],
            [
                10702,
                10728
            ],
            [
                10728,
                10845
            ],
            [
                10845,
                11082
            ],
            [
                11082,
                11358
            ],
            [
                11358,
                11402
            ],
            [
                11402,
                11475
            ],
            [
                11475,
                11570
            ],
            [
                11570,
                11610
            ],
            [
                11610,
                11653
            ],
            [
                11653,
                11774
            ],
            [
                11774,
                12164
            ],
            [
                12164,
                12230
            ],
            [
                12230,
                12341
            ],
            [
                12341,
                12450
            ],
            [
                12450,
                12579
            ],
            [
                12579,
                12907
            ],
            [
                12907,
                13051
            ],
            [
                13051,
                13415
            ],
            [
                13415,
                13435
            ],
            [
                13435,
                13464
            ],
            [
                13464,
                13489
            ],
            [
                13489,
                13586
            ],
            [
                13586,
                13652
            ],
            [
                13652,
                13901
            ],
            [
                13901,
                13950
            ],
            [
                13950,
                14096
            ],
            [
                14096,
                14240
            ],
            [
                14240,
                14389
            ],
            [
                14389,
                14540
            ],
            [
                14540,
                14608
            ],
            [
                14608,
                14744
            ],
            [
                14744,
                15076
            ],
            [
                15076,
                15150
            ],
            [
                15150,
                15250
            ],
            [
                15250,
                15405
            ],
            [
                15405,
                15517
            ],
            [
                15517,
                15771
            ],
            [
                15771,
                15825
            ],
            [
                15825,
                15897
            ],
            [
                15897,
                16054
            ],
            [
                16054,
                16151
            ],
            [
                16151,
                16211
            ],
            [
                16211,
                16252
            ],
            [
                16252,
                16547
            ],
            [
                16547,
                16668
            ],
            [
                16668,
                17439
            ],
            [
                17439,
                17599
            ],
            [
                17599,
                17726
            ],
            [
                17726,
                17824
            ],
            [
                17824,
                17866
            ],
            [
                17866,
                18042
            ],
            [
                18042,
                18169
            ],
            [
                18169,
                18290
            ],
            [
                18290,
                18459
            ],
            [
                18459,
                18487
            ],
            [
                18487,
                18513
            ],
            [
                18513,
                18533
            ],
            [
                18533,
                18661
            ],
            [
                18661,
                18764
            ],
            [
                18764,
                18812
            ],
            [
                18812,
                18846
            ],
            [
                18846,
                18864
            ],
            [
                18864,
                18881
            ],
            [
                18881,
                18931
            ],
            [
                18931,
                18956
            ],
            [
                18956,
                19268
            ],
            [
                19268,
                19380
            ],
            [
                19380,
                19452
            ],
            [
                19452,
                19574
            ],
            [
                19574,
                19652
            ],
            [
                19652,
                19729
            ],
            [
                19729,
                19933
            ],
            [
                19933,
                20155
            ],
            [
                20155,
                20175
            ],
            [
                20175,
                20217
            ],
            [
                20217,
                20364
            ],
            [
                20364,
                20444
            ],
            [
                20444,
                20500
            ],
            [
                20500,
                20545
            ],
            [
                20545,
                20571
            ],
            [
                20571,
                20669
            ],
            [
                20669,
                20807
            ],
            [
                20807,
                20941
            ],
            [
                20941,
                21016
            ],
            [
                21016,
                21261
            ],
            [
                21261,
                21570
            ],
            [
                21570,
                21790
            ],
            [
                21790,
                21945
            ],
            [
                21945,
                22036
            ],
            [
                22036,
                22121
            ],
            [
                22121,
                22224
            ],
            [
                22224,
                22321
            ],
            [
                22321,
                22446
            ],
            [
                22446,
                22498
            ],
            [
                22498,
                22526
            ],
            [
                22526,
                22579
            ],
            [
                22579,
                22660
            ],
            [
                22660,
                22708
            ],
            [
                22708,
                22760
            ],
            [
                22760,
                22832
            ],
            [
                22832,
                22917
            ],
            [
                22917,
                23067
            ],
            [
                23067,
                23163
            ],
            [
                23163,
                23229
            ],
            [
                23229,
                23262
            ],
            [
                23262,
                23304
            ],
            [
                23304,
                23337
            ],
            [
                23337,
                23344
            ],
            [
                23344,
                23387
            ],
            [
                23387,
                23421
            ],
            [
                23421,
                23649
            ],
            [
                23649,
                23689
            ],
            [
                23689,
                23738
            ],
            [
                23738,
                23790
            ],
            [
                23790,
                23847
            ],
            [
                23847,
                23877
            ],
            [
                23877,
                23953
            ],
            [
                23953,
                24010
            ],
            [
                24010,
                24124
            ],
            [
                24124,
                24293
            ],
            [
                24293,
                24580
            ],
            [
                24580,
                24720
            ],
            [
                24720,
                24758
            ],
            [
                24758,
                24894
            ],
            [
                24894,
                24946
            ],
            [
                24946,
                24959
            ],
            [
                24959,
                24978
            ]
        ]
    },
    "abridged": {
        "text": "The fund prospered. By dint of Miss Keeldar's example, the three rectors' exertions, and the efficient though quiet aid of Mary Ann Ainley and Margaret Hall, a handsome sum was raised, which greatly alleviated the distress of the unemployed poor. The neighbourhood seemed to grow calmer. For a fortnight past no cloth had been destroyed; no outrage on mill or mansion had been committed in the three parishes. Shirley believed that the evil she wished to avert was almost escaped, that the storm was passing over. With the approach of summer, trade would improve - it always did; and this weary war could not last for ever. With peace, what an impulse would be given to commerce!\nSuch was the usual tenor of her observations to her tenant, Grard Moore, when they met; and Moore would listen very quietly - too quietly to satisfy her. She would impatiently demand his opinion. Smiling with that expression which gave a remarkable sweetness to his mouth, while his brow remained grave, he would answer that he too trusted that the war would end; on that ground his hopes were fixed.\n\"For you are aware,\" he would continue, \"that I now work Hollow's Mill entirely on speculation. I sell nothing; there is no market for my goods. I manufacture for the future, and am ready to take advantage of the first opening that shall occur. Three months ago this was impossible to me; I had no money. You well know who came to my rescue, from whom I received the loan which saved me. I am aware that gain is doubtful; but I am quite cheerful. So long as I can be active, it is impossible for me to be depressed. As you say, peace will give an impulse to commerce; but as to the permanent good effect of your charitable fund, I doubt. Relief never yet made the working-classes grateful; it is not in human nature that it should. They ought not to be in a position to need that humiliating relief; and this they feel. They hate us mill-owners worse than ever. They hear from the disaffected in Nottingham and Manchester and elsewhere. They receive orders from their chiefs. The danger is not gone - it is only delayed. The long-threatening storm is sure to break at last.\"\n\"Well, Mr. Moore\" (so these conferences always ended), \"take care of yourself.\"\n\"I do. I wish to live. The future opens like Eden before me; and still, when I look deep into the shades of my paradise, I see a vision glide across remote vistas.\"\n\"Do you? Pray, what vision?\"\n\"I see-\"\nThe maid came bustling in with the tea-things.\nIn the last week of May, the weather cleared. A fresh wind swept off the deep-piled rain-clouds, bearing them, mass on mass, to the eastern horizon, leaving the vault behind all pure blue space, ready for the reign of the summer sun. That sun rose broad on Whitsuntide.\nWhit-Tuesday was the great day of the gathering of the schools. In preparation, the two large schoolrooms of Briarfield were cleaned, whitewashed, and decorated with flowers and evergreens - some from the rectory garden, and two cartloads from Fieldhead.\nIn these schoolrooms twenty tables, each calculated to seat twenty guests, were laid out, surrounded with benches, and covered with white cloths. Above them were suspended some twenty cages containing canaries, according to a fancy of the district. These tables were not spread for the twelve hundred scholars of the three parishes, but only for the patrons and teachers. The children's feast was to be spread in the open air. At one o'clock the troops were to come in; at two they were to be marshalled; till four they were to parade through the parish; then came the feast, and afterwards the meeting with music and speeches in the church.\nBriarfield was chosen for the rendezvous, not because it was the largest or oldest parish, but simply because Mr. Helstone willed it, and Mr. Helstone's will was stronger than that of Boultby or Hall. They let him lead and rule.\nThis occasion had always been a trying day to Caroline, because it dragged her into public, compelling her to face the wealthy, respectable society of the neighbourhood. Obliged to be conspicuous; obliged to walk at the head of the first class; obliged to make tea at the first table for a mixed multitude of ladies and gentlemen, and to do all this without the presence of mother, aunt, or other chaperon - she being a nervous person, who mortally feared publicity - it will be comprehended that she trembled at the approach of Whitsuntide.\nBut this year Shirley was to be with her, and that utterly changed the aspect of the trial. It was a trial no longer - it was almost an enjoyment. Miss Keeldar was better than a host of ordinary friends. Self-possessed, always spirited and easy; conscious of her social importance, yet never presuming upon it - it gave Caroline courage to look at her. The only fear was lest the heiress should not be punctual. Caroline knew her uncle would not wait a second for anyone. The moment the church clock tolled two, the march would begin.\nWhit-Tuesday saw Caroline rise almost with the sun. She, Fanny, and Eliza were busy the whole morning arranging the rectory parlours, and setting out refreshments - wine, fruit, cakes - on the dining-room sideboard. Then she had to dress in her freshest white muslin, as befitted the solemn occasion. Her new sash - a birthday present from Margaret Hall, which she had reason to believe Cyril himself had bought - was tied by Fanny, who took pleasure in arraying her fair young mistress for the occasion. Caroline's simple bonnet had been trimmed to match her sash.\nWhen ready she formed a picture, not dazzling, but delicately pleasing. Her expression, like her dress, was modest, gentle, and, though pensive, harmonious. After all, she was an imperfect, faulty human being, fair enough of form, but, as Cyril Hall said, neither so good nor so great as the withered Miss Ainley, now putting on her best black gown and drab shawl and bonnet in her own narrow cottage.\nAway Caroline went, across quiet fields and through hidden lanes, to Fieldhead. Underfoot, all was clean and dry under the glowing sun. She walked on daisy and turf to Fieldhead, and went to Miss Keeldar's dressing-room.\nIt was well she had come, or Shirley would have been late. Instead of making ready, she lay stretched on a couch, absorbed in reading. Mrs. Pryor stood near, vainly urging her to rise and dress.\nCaroline wasted no words. She immediately took the book from Shirley, and with her own hands commenced to disrobe and rerobe her. Shirley, indolent with the heat, and gay with her youth and nature, wanted to talk, laugh, and linger; but Caroline persevered in dressing her as fast as fingers could manage. At length, as she united a final row of hooks and eyes, she chided her, saying she was very naughty to be so unpunctual, that she looked the picture of carelessness; and so Shirley did, but a very lovely picture of that tiresome quality.\nShe presented quite a contrast to Caroline. There was style in every fold of her dress and every line of her figure. The rich silk suited her better than a simpler costume; the embroidered scarf became her. She wore it negligently but gracefully. There was a frank light in her eyes, a rallying smile about her lips, as Caroline took her hand and hurried her out of doors; and thus they sped through the fields, laughing as they went, and looking very much like a snow-white dove and gem-tinted bird of paradise joined in flight.\nThanks to Miss Helstone, they arrived in good time. They heard the bell tolling a summons for all to assemble. The trampling of many steps and murmuring of many voices were audible. Soon they saw the Whinbury school approaching, numbering five hundred souls. Boultby and Donne headed it - the former walking under the canopy of a shovel-hat, with the squarest and vastest of black coats, and the stoutest of gold-headed canes. Donne looked every inch a curate, from his turned-up nose and complacent, lifted chin to his clerical black gaiters, his somewhat short trousers, and his square-toed shoes.\nWalk on, Mr. Donne! You have undergone scrutiny. You think you look well. Whether the white and purple figures watching you from yonder hill think so is another question.\nThese figures come running down when the regiment has marched by. The churchyard is full of children and teachers, all in their best holiday attire; and, bad as are the times, it is wonderful to see how respectably they have managed to clothe themselves. The lady of the manor - Shirley, gazing with pleasure on this happy-looking crowd - has really done them good. Her timely bounty has supplied many a child with a new frock or bonnet. She knows it, and is glad that her money has benefited those around her.\nCaroline, too, is pleased, for she also has done good in her small way - robbed herself of more than one dress or ribbon she could ill spare, to aid in fitting out the scholars of her class; and as she could not give money, she has followed Miss Ainley's example in giving her time to sew for the children.\nNot only is the churchyard full, but the rectory garden is thronged. Groups of ladies and gentlemen are walking amongst the lilacs and laburnums. The house also is occupied: at the wide-open parlour windows stand the patrons and teachers. In the parson's croft, behind the rectory, are the musicians of the three parish bands, with their instruments. Fanny and Eliza, in their smartest caps and gowns, move amongst them, serving out quarts of ale, specially brewed by the rector's orders. He could not endure \"shabby doings\". Miss Keeldar was like him in this respect, and they mutually approved each other's arrangements.\nCaroline and Shirley were soon in the midst of the company. Caroline coped very easily for her. Instead of sitting down in a retired corner, or stealing away to her own room, she moved through the three parlours, conversed and smiled, even spoke once or twice before she was spoken to, and, in short, seemed a new creature. It was Shirley's presence which thus transformed her. Shirley had no fear of humanity, no tendency to shrink from it, and since she thought well of all people until they might prove otherwise, she was a general favourite.\nDonne happened to come into the drawing-room while Shirley, sitting on the sofa, formed the centre of a wide circle. She had already forgotten her exasperation against him, and she bowed and smiled good-humouredly. The man's disposition was then seen. He knew neither how to decline her greeting with dignity, as one whose just pride has been wounded, nor how to meet it with frankness, as one who is glad to forget and forgive. So he merely passed by sheepishly with a scowl.\n\"He was not worth a scene!\" said Shirley to Caroline. \"What a fool I was! To take revenge on poor Donne's silly spite about Yorkshire is like crushing a gnat for attacking the hide of a rhinoceros. Had I been a gentleman, I believe I should have forcibly helped him off the premises. But he must come near me no more. He irritates me. He is not even amusing. Malone is better sport.\"\nThe words were scarcely out of her mouth when Peter Augustus Malone came up, gloved and scented, with his hair oiled, and bearing in one hand a huge bunch of cabbage-roses. These he presented to the heiress. Who, after this, could dare to say that Peter was not a lady's man? He had given flowers; he had offered a sentimental tribute at the shrine of Love. He must have thought this himself, for he seemed amazed at what he had done. Backing off without a word, he was going away with a husky chuckle of self-satisfaction; then he bethought himself to stop and look back. There were the six red cabbages on the purple satin lap, a white hand holding them; and over them, ringlets, half hiding a laughing face.\nOnly half hiding! Peter saw the laugh; it was unmistakable. He was made a joke of; his chivalry was the subject of a jest for a petticoat - for two petticoats: Miss Helstone too was smiling. Peter grew black as a thunder-cloud. When Shirley looked up, a fell eye was fastened on her. Malone, at least, had energy enough in hate.\n\"Peter is worth a scene, and shall have it, if he likes, one day,\" she whispered to her friend.\nAnd now the three rectors appeared at the dining-room door. They had been busy in the church, and were coming to take some refreshment before the march began. The large easy-chair had been left vacant for Dr. Boultby. He was put into it, and Caroline hastened to hand him a glass of wine and a plate of macaroons. Boultby's churchwardens were already beside him, as were Mrs. Sykes and the other ladies of his congregation, expressing their hopes that he was not fatigued. Mrs. Boultby was bending over him, tenderly wiping some perspiration, real or imaginary, from his brow. Boultby, in short, was in his glory. Of Caroline he took no notice, save to accept what she offered. He did not see her - he never did see her; he hardly knew that such a person existed. He saw the macaroons, however.\nMr. Hall stood near an open window, talking like a brother to Miss Ainley. To him Caroline turned with pleasure. \"What should she bring him?\" She provided herself with a little plate, so that she might offer him variety. Margaret Hall joined them; so did Miss Keeldar. The four ladies stood round their favourite pastor. A throng, too, of twenty or more enclosed old Helstone. The curates, herding together, made a constellation of three lesser planets. Various young ladies watched them afar off, but ventured not nigh.\nMr. Helstone produced his watch. \"Ten minutes to two,\" he announced. \"Time to fall into line. Come.\" He seized his shovel-hat and marched away. All rose and followed en masse.\nThe twelve hundred children were drawn up in three bodies of four hundred souls each; in the rear of each regiment was a band; between every twenty there was a pair of teachers. To the front of the armies Mr. Helstone summoned-\n\"Grace Boultby and Mary Sykes lead out Whinbury.\n\"Margaret Hall and Mary Ann Ainley conduct Nunnely.\n\"Caroline Helstone and Shirley Keeldar head Briarfield.\"\nThen again he gave command:\n\"Mr. Donne to Whinbury; Mr. Sweeting to Nunnely; Mr. Malone to Briarfield.\"\nAnd these gentlemen stepped up. The rectors advanced to the very front; Helstone lifted his shovel-hat. Out clashed the bells in the tower, loud swelled the bands, deep rolled the drums, and away they marched.\nThe broad white road unrolled before the long procession; the twelve hundred children and one hundred and forty adults trod on, with gay faces and glad hearts. It was a joyous scene, a day of happiness for rich and poor. Let England's priests have their due. They are a faulty set in some respects, being only flesh and blood like us all; but the land would be badly off without them. Britain would miss her church, if that church fell. God save it! God also reform it!",
        "paragraph_chars": [
            [
                0,
                680
            ],
            [
                680,
                1081
            ],
            [
                1081,
                2156
            ],
            [
                2156,
                2236
            ],
            [
                2236,
                2401
            ],
            [
                2401,
                2430
            ],
            [
                2430,
                2439
            ],
            [
                2439,
                2486
            ],
            [
                2486,
                2756
            ],
            [
                2756,
                3011
            ],
            [
                3011,
                3653
            ],
            [
                3653,
                3882
            ],
            [
                3882,
                4424
            ],
            [
                4424,
                4959
            ],
            [
                4959,
                5525
            ],
            [
                5525,
                5927
            ],
            [
                5927,
                6148
            ],
            [
                6148,
                6343
            ],
            [
                6343,
                6887
            ],
            [
                6887,
                7417
            ],
            [
                7417,
                8017
            ],
            [
                8017,
                8188
            ],
            [
                8188,
                8699
            ],
            [
                8699,
                9006
            ],
            [
                9006,
                9629
            ],
            [
                9629,
                10175
            ],
            [
                10175,
                10652
            ],
            [
                10652,
                11036
            ],
            [
                11036,
                11747
            ],
            [
                11747,
                12076
            ],
            [
                12076,
                12172
            ],
            [
                12172,
                12967
            ],
            [
                12967,
                13488
            ],
            [
                13488,
                13664
            ],
            [
                13664,
                13892
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                13993
            ],
            [
                13993,
                14050
            ],
            [
                14050,
                14078
            ],
            [
                14078,
                14154
            ],
            [
                14154,
                14364
            ],
            [
                14364,
                14833
            ]
        ],
        "segment_chars": [
            [
                0,
                20
            ],
            [
                20,
                247
            ],
            [
                247,
                288
            ],
            [
                288,
                410
            ],
            [
                410,
                514
            ],
            [
                514,
                624
            ],
            [
                624,
                680
            ],
            [
                680,
                834
            ],
            [
                834,
                876
            ],
            [
                876,
                1081
            ],
            [
                1081,
                1177
            ],
            [
                1177,
                1226
            ],
            [
                1226,
                1326
            ],
            [
                1326,
                1386
            ],
            [
                1386,
                1469
            ],
            [
                1469,
                1528
            ],
            [
                1528,
                1597
            ],
            [
                1597,
                1719
            ],
            [
                1719,
                1813
            ],
            [
                1813,
                1901
            ],
            [
                1901,
                1943
            ],
            [
                1943,
                2018
            ],
            [
                2018,
                2057
            ],
            [
                2057,
                2102
            ],
            [
                2102,
                2156
            ],
            [
                2156,
                2236
            ],
            [
                2236,
                2243
            ],
            [
                2243,
                2259
            ],
            [
                2259,
                2401
            ],
            [
                2401,
                2410
            ],
            [
                2410,
                2430
            ],
            [
                2430,
                2439
            ],
            [
                2439,
                2486
            ],
            [
                2486,
                2532
            ],
            [
                2532,
                2720
            ],
            [
                2720,
                2756
            ],
            [
                2756,
                2820
            ],
            [
                2820,
                3011
            ],
            [
                3011,
                3157
            ],
            [
                3157,
                3260
            ],
            [
                3260,
                3383
            ],
            [
                3383,
                3438
            ],
            [
                3438,
                3653
            ],
            [
                3653,
                3854
            ],
            [
                3854,
                3882
            ],
            [
                3882,
                4052
            ],
            [
                4052,
                4424
            ],
            [
                4424,
                4516
            ],
            [
                4516,
                4571
            ],
            [
                4571,
                4628
            ],
            [
                4628,
                4777
            ],
            [
                4777,
                4836
            ],
            [
                4836,
                4896
            ],
            [
                4896,
                4959
            ],
            [
                4959,
                5011
            ],
            [
                5011,
                5175
            ],
            [
                5175,
                5260
            ],
            [
                5260,
                5464
            ],
            [
                5464,
                5525
            ],
            [
                5525,
                5597
            ],
            [
                5597,
                5682
            ],
            [
                5682,
                5927
            ],
            [
                5927,
                6007
            ],
            [
                6007,
                6063
            ],
            [
                6063,
                6148
            ],
            [
                6148,
                6207
            ],
            [
                6207,
                6283
            ],
            [
                6283,
                6343
            ],
            [
                6343,
                6369
            ],
            [
                6369,
                6473
            ],
            [
                6473,
                6649
            ],
            [
                6649,
                6887
            ],
            [
                6887,
                6931
            ],
            [
                6931,
                7004
            ],
            [
                7004,
                7094
            ],
            [
                7094,
                7134
            ],
            [
                7134,
                7417
            ],
            [
                7417,
                7469
            ],
            [
                7469,
                7528
            ],
            [
                7528,
                7599
            ],
            [
                7599,
                7676
            ],
            [
                7676,
                7844
            ],
            [
                7844,
                8017
            ],
            [
                8017,
                8037
            ],
            [
                8037,
                8066
            ],
            [
                8066,
                8091
            ],
            [
                8091,
                8188
            ],
            [
                8188,
                8254
            ],
            [
                8254,
                8443
            ],
            [
                8443,
                8554
            ],
            [
                8554,
                8626
            ],
            [
                8626,
                8699
            ],
            [
                8699,
                9006
            ],
            [
                9006,
                9075
            ],
            [
                9075,
                9152
            ],
            [
                9152,
                9245
            ],
            [
                9245,
                9357
            ],
            [
                9357,
                9495
            ],
            [
                9495,
                9532
            ],
            [
                9532,
                9629
            ],
            [
                9629,
                9689
            ],
            [
                9689,
                9725
            ],
            [
                9725,
                9953
            ],
            [
                9953,
                10007
            ],
            [
                10007,
                10175
            ],
            [
                10175,
                10292
            ],
            [
                10292,
                10390
            ],
            [
                10390,
                10427
            ],
            [
                10427,
                10604
            ],
            [
                10604,
                10652
            ],
            [
                10652,
                10680
            ],
            [
                10680,
                10706
            ],
            [
                10706,
                10726
            ],
            [
                10726,
                10850
            ],
            [
                10850,
                10936
            ],
            [
                10936,
                10970
            ],
            [
                10970,
                10987
            ],
            [
                10987,
                11011
            ],
            [
                11011,
                11036
            ],
            [
                11036,
                11209
            ],
            [
                11209,
                11244
            ],
            [
                11244,
                11312
            ],
            [
                11312,
                11394
            ],
            [
                11394,
                11471
            ],
            [
                11471,
                11609
            ],
            [
                11609,
                11747
            ],
            [
                11747,
                11765
            ],
            [
                11765,
                11807
            ],
            [
                11807,
                11938
            ],
            [
                11938,
                11975
            ],
            [
                11975,
                12031
            ],
            [
                12031,
                12076
            ],
            [
                12076,
                12172
            ],
            [
                12172,
                12232
            ],
            [
                12232,
                12331
            ],
            [
                12331,
                12390
            ],
            [
                12390,
                12486
            ],
            [
                12486,
                12645
            ],
            [
                12645,
                12749
            ],
            [
                12749,
                12786
            ],
            [
                12786,
                12850
            ],
            [
                12850,
                12936
            ],
            [
                12936,
                12967
            ],
            [
                12967,
                13042
            ],
            [
                13042,
                13080
            ],
            [
                13080,
                13109
            ],
            [
                13109,
                13188
            ],
            [
                13188,
                13236
            ],
            [
                13236,
                13288
            ],
            [
                13288,
                13344
            ],
            [
                13344,
                13421
            ],
            [
                13421,
                13488
            ],
            [
                13488,
                13521
            ],
            [
                13521,
                13557
            ],
            [
                13557,
                13582
            ],
            [
                13582,
                13589
            ],
            [
                13589,
                13632
            ],
            [
                13632,
                13664
            ],
            [
                13664,
                13842
            ],
            [
                13842,
                13892
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                13993
            ],
            [
                13993,
                14050
            ],
            [
                14050,
                14078
            ],
            [
                14078,
                14154
            ],
            [
                14154,
                14186
            ],
            [
                14186,
                14258
            ],
            [
                14258,
                14364
            ],
            [
                14364,
                14524
            ],
            [
                14524,
                14585
            ],
            [
                14585,
                14623
            ],
            [
                14623,
                14749
            ],
            [
                14749,
                14801
            ],
            [
                14801,
                14814
            ],
            [
                14814,
                14833
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                20,
                73
            ],
            [
                74,
                122
            ],
            [
                123,
                183
            ],
            [
                183,
                184
            ],
            [
                191,
                198
            ],
            [
                210,
                247
            ],
            [
                247,
                288
            ],
            [
                288,
                410
            ],
            [
                410,
                417
            ],
            [
                427,
                489
            ],
            [
                490,
                514
            ],
            [
                514,
                541
            ],
            [
                543,
                562
            ],
            [
                565,
                583
            ],
            [
                584,
                622
            ],
            [
                622,
                624
            ],
            [
                624,
                680
            ],
            [
                680,
                752
            ],
            [
                758,
                762
            ],
            [
                763,
                766
            ],
            [
                766,
                803
            ],
            [
                806,
                834
            ],
            [
                834,
                843
            ],
            [
                844,
                853
            ],
            [
                856,
                862
            ],
            [
                874,
                876
            ],
            [
                876,
                883
            ],
            [
                884,
                928
            ],
            [
                929,
                999
            ],
            [
                1000,
                1004
            ],
            [
                1008,
                1019
            ],
            [
                1020,
                1024
            ],
            [
                1025,
                1032
            ],
            [
                1042,
                1043
            ],
            [
                1044,
                1058
            ],
            [
                1059,
                1068
            ],
            [
                1074,
                1079
            ],
            [
                1079,
                1080
            ],
            [
                1081,
                1177
            ],
            [
                1177,
                1226
            ],
            [
                1226,
                1243
            ],
            [
                1248,
                1254
            ],
            [
                1263,
                1326
            ],
            [
                1326,
                1375
            ],
            [
                1384,
                1386
            ],
            [
                1386,
                1427
            ],
            [
                1433,
                1469
            ],
            [
                1469,
                1528
            ],
            [
                1528,
                1554
            ],
            [
                1554,
                1597
            ],
            [
                1597,
                1647
            ],
            [
                1647,
                1652
            ],
            [
                1653,
                1719
            ],
            [
                1726,
                1735
            ],
            [
                1736,
                1740
            ],
            [
                1741,
                1760
            ],
            [
                1761,
                1813
            ],
            [
                1813,
                1901
            ],
            [
                1901,
                1910
            ],
            [
                1911,
                1925
            ],
            [
                1926,
                1943
            ],
            [
                1958,
                1973
            ],
            [
                1974,
                1976
            ],
            [
                1977,
                1987
            ],
            [
                1992,
                2002
            ],
            [
                2007,
                2017
            ],
            [
                2018,
                2022
            ],
            [
                2023,
                2055
            ],
            [
                2055,
                2057
            ],
            [
                2057,
                2067
            ],
            [
                2071,
                2079
            ],
            [
                2082,
                2084
            ],
            [
                2088,
                2102
            ],
            [
                2102,
                2153
            ],
            [
                2156,
                2233
            ],
            [
                2236,
                2241
            ],
            [
                2241,
                2243
            ],
            [
                2243,
                2257
            ],
            [
                2257,
                2259
            ],
            [
                2259,
                2371
            ],
            [
                2372,
                2401
            ],
            [
                2401,
                2410
            ],
            [
                2410,
                2430
            ],
            [
                2430,
                2436
            ],
            [
                2439,
                2486
            ],
            [
                2486,
                2502
            ],
            [
                2503,
                2505
            ],
            [
                2506,
                2510
            ],
            [
                2511,
                2514
            ],
            [
                2523,
                2530
            ],
            [
                2530,
                2532
            ],
            [
                2532,
                2558
            ],
            [
                2559,
                2634
            ],
            [
                2635,
                2720
            ],
            [
                2720,
                2755
            ],
            [
                2769,
                2772
            ],
            [
                2790,
                2818
            ],
            [
                2818,
                2819
            ],
            [
                2820,
                2834
            ],
            [
                2834,
                2835
            ],
            [
                2836,
                2875
            ],
            [
                2876,
                2888
            ],
            [
                2888,
                2901
            ],
            [
                2901,
                2944
            ],
            [
                2945,
                2946
            ],
            [
                2947,
                2976
            ],
            [
                2977,
                2980
            ],
            [
                2981,
                3009
            ],
            [
                3009,
                3010
            ],
            [
                3011,
                3065
            ],
            [
                3071,
                3157
            ],
            [
                3157,
                3182
            ],
            [
                3183,
                3200
            ],
            [
                3201,
                3211
            ],
            [
                3212,
                3258
            ],
            [
                3258,
                3260
            ],
            [
                3260,
                3272
            ],
            [
                3273,
                3320
            ],
            [
                3321,
                3323
            ],
            [
                3324,
                3381
            ],
            [
                3381,
                3383
            ],
            [
                3383,
                3438
            ],
            [
                3438,
                3545
            ],
            [
                3554,
                3613
            ],
            [
                3614,
                3628
            ],
            [
                3638,
                3653
            ],
            [
                3656,
                3682
            ],
            [
                3683,
                3693
            ],
            [
                3693,
                3694
            ],
            [
                3695,
                3728
            ],
            [
                3729,
                3735
            ],
            [
                3736,
                3742
            ],
            [
                3742,
                3743
            ],
            [
                3748,
                3785
            ],
            [
                3785,
                3852
            ],
            [
                3852,
                3854
            ],
            [
                3854,
                3882
            ],
            [
                3882,
                3886
            ],
            [
                3896,
                3906
            ],
            [
                3907,
                3936
            ],
            [
                3936,
                3960
            ],
            [
                3961,
                3996
            ],
            [
                3997,
                4000
            ],
            [
                4001,
                4021
            ],
            [
                4030,
                4032
            ],
            [
                4033,
                4050
            ],
            [
                4050,
                4052
            ],
            [
                4052,
                4106
            ],
            [
                4107,
                4243
            ],
            [
                4253,
                4287
            ],
            [
                4290,
                4293
            ],
            [
                4294,
                4347
            ],
            [
                4350,
                4378
            ],
            [
                4379,
                4424
            ],
            [
                4424,
                4474
            ],
            [
                4475,
                4482
            ],
            [
                4483,
                4514
            ],
            [
                4514,
                4516
            ],
            [
                4516,
                4540
            ],
            [
                4543,
                4571
            ],
            [
                4571,
                4594
            ],
            [
                4595,
                4628
            ],
            [
                4628,
                4643
            ],
            [
                4644,
                4733
            ],
            [
                4736,
                4738
            ],
            [
                4753,
                4760
            ],
            [
                4761,
                4777
            ],
            [
                4777,
                4834
            ],
            [
                4834,
                4836
            ],
            [
                4836,
                4887
            ],
            [
                4894,
                4896
            ],
            [
                4896,
                4906
            ],
            [
                4907,
                4926
            ],
            [
                4931,
                4939
            ],
            [
                4940,
                4945
            ],
            [
                4946,
                4951
            ],
            [
                4952,
                4958
            ],
            [
                4959,
                4975
            ],
            [
                4985,
                5011
            ],
            [
                5011,
                5091
            ],
            [
                5091,
                5108
            ],
            [
                5109,
                5121
            ],
            [
                5122,
                5123
            ],
            [
                5124,
                5142
            ],
            [
                5145,
                5175
            ],
            [
                5175,
                5212
            ],
            [
                5213,
                5225
            ],
            [
                5225,
                5226
            ],
            [
                5239,
                5249
            ],
            [
                5250,
                5258
            ],
            [
                5258,
                5260
            ],
            [
                5260,
                5272
            ],
            [
                5275,
                5370
            ],
            [
                5373,
                5384
            ],
            [
                5385,
                5400
            ],
            [
                5401,
                5464
            ],
            [
                5475,
                5508
            ],
            [
                5515,
                5523
            ],
            [
                5523,
                5524
            ],
            [
                5525,
                5561
            ],
            [
                5570,
                5575
            ],
            [
                5576,
                5595
            ],
            [
                5595,
                5597
            ],
            [
                5597,
                5600
            ],
            [
                5618,
                5627
            ],
            [
                5629,
                5632
            ],
            [
                5639,
                5682
            ],
            [
                5682,
                5754
            ],
            [
                5754,
                5877
            ],
            [
                5878,
                5925
            ],
            [
                5925,
                5927
            ],
            [
                5927,
                5953
            ],
            [
                5960,
                5978
            ],
            [
                5979,
                6007
            ],
            [
                6016,
                6017
            ],
            [
                6018,
                6031
            ],
            [
                6032,
                6035
            ],
            [
                6036,
                6039
            ],
            [
                6040,
                6049
            ],
            [
                6050,
                6061
            ],
            [
                6061,
                6063
            ],
            [
                6063,
                6073
            ],
            [
                6074,
                6091
            ],
            [
                6095,
                6109
            ],
            [
                6115,
                6148
            ],
            [
                6148,
                6200
            ],
            [
                6201,
                6207
            ],
            [
                6207,
                6230
            ],
            [
                6230,
                6283
            ],
            [
                6283,
                6342
            ],
            [
                6343,
                6369
            ],
            [
                6369,
                6403
            ],
            [
                6411,
                6445
            ],
            [
                6449,
                6452
            ],
            [
                6457,
                6463
            ],
            [
                6468,
                6473
            ],
            [
                6473,
                6532
            ],
            [
                6533,
                6588
            ],
            [
                6589,
                6640
            ],
            [
                6647,
                6649
            ],
            [
                6649,
                6708
            ],
            [
                6709,
                6711
            ],
            [
                6716,
                6785
            ],
            [
                6786,
                6800
            ],
            [
                6801,
                6887
            ],
            [
                6887,
                6931
            ],
            [
                6931,
                7004
            ],
            [
                7004,
                7063
            ],
            [
                7064,
                7094
            ],
            [
                7094,
                7134
            ],
            [
                7140,
                7143
            ],
            [
                7146,
                7170
            ],
            [
                7173,
                7203
            ],
            [
                7207,
                7229
            ],
            [
                7230,
                7233
            ],
            [
                7234,
                7245
            ],
            [
                7246,
                7408
            ],
            [
                7409,
                7417
            ],
            [
                7417,
                7440
            ],
            [
                7440,
                7469
            ],
            [
                7469,
                7498
            ],
            [
                7499,
                7528
            ],
            [
                7528,
                7584
            ],
            [
                7585,
                7589
            ],
            [
                7590,
                7599
            ],
            [
                7604,
                7608
            ],
            [
                7609,
                7612
            ],
            [
                7613,
                7644
            ],
            [
                7644,
                7645
            ],
            [
                7656,
                7676
            ],
            [
                7676,
                7693
            ],
            [
                7694,
                7703
            ],
            [
                7706,
                7716
            ],
            [
                7717,
                7724
            ],
            [
                7725,
                7763
            ],
            [
                7764,
                7812
            ],
            [
                7813,
                7844
            ],
            [
                7844,
                7849
            ],
            [
                7857,
                7876
            ],
            [
                7876,
                7905
            ],
            [
                7906,
                7916
            ],
            [
                7916,
                7917
            ],
            [
                7925,
                7979
            ],
            [
                7980,
                8017
            ],
            [
                8017,
                8037
            ],
            [
                8037,
                8066
            ],
            [
                8066,
                8091
            ],
            [
                8091,
                8188
            ],
            [
                8188,
                8254
            ],
            [
                8254,
                8315
            ],
            [
                8316,
                8340
            ],
            [
                8340,
                8402
            ],
            [
                8403,
                8412
            ],
            [
                8421,
                8443
            ],
            [
                8443,
                8464
            ],
            [
                8465,
                8466
            ],
            [
                8467,
                8475
            ],
            [
                8476,
                8504
            ],
            [
                8505,
                8524
            ],
            [
                8527,
                8554
            ],
            [
                8554,
                8557
            ],
            [
                8565,
                8571
            ],
            [
                8576,
                8624
            ],
            [
                8624,
                8626
            ],
            [
                8626,
                8646
            ],
            [
                8652,
                8666
            ],
            [
                8671,
                8698
            ],
            [
                8699,
                8769
            ],
            [
                8779,
                8809
            ],
            [
                8810,
                8812
            ],
            [
                8813,
                8819
            ],
            [
                8820,
                8980
            ],
            [
                8981,
                9006
            ],
            [
                9006,
                9064
            ],
            [
                9065,
                9075
            ],
            [
                9082,
                9109
            ],
            [
                9110,
                9129
            ],
            [
                9130,
                9152
            ],
            [
                9152,
                9212
            ],
            [
                9219,
                9243
            ],
            [
                9243,
                9245
            ],
            [
                9245,
                9357
            ],
            [
                9357,
                9376
            ],
            [
                9383,
                9391
            ],
            [
                9392,
                9406
            ],
            [
                9406,
                9453
            ],
            [
                9464,
                9470
            ],
            [
                9471,
                9493
            ],
            [
                9493,
                9495
            ],
            [
                9504,
                9507
            ],
            [
                9515,
                9529
            ],
            [
                9532,
                9629
            ],
            [
                9629,
                9689
            ],
            [
                9704,
                9725
            ],
            [
                9725,
                9802
            ],
            [
                9802,
                9863
            ],
            [
                9869,
                9888
            ],
            [
                9896,
                9953
            ],
            [
                9953,
                10005
            ],
            [
                10005,
                10007
            ],
            [
                10007,
                10029
            ],
            [
                10038,
                10066
            ],
            [
                10067,
                10069
            ],
            [
                10069,
                10074
            ],
            [
                10098,
                10100
            ],
            [
                10101,
                10104
            ],
            [
                10144,
                10145
            ],
            [
                10150,
                10153
            ],
            [
                10154,
                10173
            ],
            [
                10173,
                10174
            ],
            [
                10175,
                10278
            ],
            [
                10279,
                10292
            ],
            [
                10292,
                10390
            ],
            [
                10390,
                10397
            ],
            [
                10400,
                10411
            ],
            [
                10412,
                10427
            ],
            [
                10427,
                10457
            ],
            [
                10471,
                10604
            ],
            [
                10607,
                10644
            ],
            [
                10645,
                10647
            ],
            [
                10650,
                10651
            ],
            [
                10652,
                10680
            ],
            [
                10680,
                10706
            ],
            [
                10706,
                10726
            ],
            [
                10726,
                10728
            ],
            [
                10734,
                10755
            ],
            [
                10758,
                10769
            ],
            [
                10776,
                10788
            ],
            [
                10789,
                10850
            ],
            [
                10850,
                10897
            ],
            [
                10907,
                10934
            ],
            [
                10934,
                10936
            ],
            [
                10936,
                10970
            ],
            [
                10970,
                10987
            ],
            [
                10990,
                11001
            ],
            [
                11009,
                11011
            ],
            [
                11011,
                11036
            ],
            [
                11036,
                11066
            ],
            [
                11071,
                11096
            ],
            [
                11097,
                11103
            ],
            [
                11104,
                11111
            ],
            [
                11111,
                11152
            ],
            [
                11152,
                11207
            ],
            [
                11207,
                11209
            ],
            [
                11209,
                11242
            ],
            [
                11242,
                11244
            ],
            [
                11244,
                11312
            ],
            [
                11312,
                11362
            ],
            [
                11363,
                11392
            ],
            [
                11392,
                11394
            ],
            [
                11394,
                11471
            ],
            [
                11483,
                11497
            ],
            [
                11497,
                11498
            ],
            [
                11499,
                11597
            ],
            [
                11607,
                11609
            ],
            [
                11609,
                11667
            ],
            [
                11668,
                11678
            ],
            [
                11679,
                11691
            ],
            [
                11693,
                11696
            ],
            [
                11697,
                11706
            ],
            [
                11706,
                11707
            ],
            [
                11708,
                11745
            ],
            [
                11745,
                11746
            ],
            [
                11747,
                11751
            ],
            [
                11752,
                11756
            ],
            [
                11757,
                11765
            ],
            [
                11765,
                11807
            ],
            [
                11807,
                11833
            ],
            [
                11834,
                11842
            ],
            [
                11847,
                11884
            ],
            [
                11887,
                11938
            ],
            [
                11938,
                11975
            ],
            [
                11975,
                12031
            ],
            [
                12031,
                12075
            ],
            [
                12076,
                12082
            ],
            [
                12083,
                12085
            ],
            [
                12086,
                12172
            ],
            [
                12172,
                12179
            ],
            [
                12180,
                12197
            ],
            [
                12207,
                12230
            ],
            [
                12230,
                12232
            ],
            [
                12232,
                12240
            ],
            [
                12241,
                12274
            ],
            [
                12275,
                12294
            ],
            [
                12295,
                12306
            ],
            [
                12314,
                12323
            ],
            [
                12329,
                12331
            ],
            [
                12331,
                12340
            ],
            [
                12341,
                12390
            ],
            [
                12390,
                12422
            ],
            [
                12423,
                12439
            ],
            [
                12444,
                12486
            ],
            [
                12486,
                12509
            ],
            [
                12510,
                12533
            ],
            [
                12533,
                12537
            ],
            [
                12538,
                12542
            ],
            [
                12543,
                12594
            ],
            [
                12594,
                12643
            ],
            [
                12643,
                12645
            ],
            [
                12645,
                12657
            ],
            [
                12658,
                12749
            ],
            [
                12749,
                12784
            ],
            [
                12784,
                12786
            ],
            [
                12786,
                12808
            ],
            [
                12809,
                12815
            ],
            [
                12815,
                12850
            ],
            [
                12850,
                12868
            ],
            [
                12871,
                12936
            ],
            [
                12936,
                12965
            ],
            [
                12965,
                12966
            ],
            [
                12967,
                13002
            ],
            [
                13003,
                13042
            ],
            [
                13042,
                13064
            ],
            [
                13065,
                13080
            ],
            [
                13080,
                13106
            ],
            [
                13109,
                13143
            ],
            [
                13149,
                13150
            ],
            [
                13154,
                13188
            ],
            [
                13188,
                13236
            ],
            [
                13236,
                13288
            ],
            [
                13288,
                13302
            ],
            [
                13303,
                13305
            ],
            [
                13313,
                13320
            ],
            [
                13321,
                13329
            ],
            [
                13330,
                13344
            ],
            [
                13344,
                13373
            ],
            [
                13373,
                13421
            ],
            [
                13429,
                13488
            ],
            [
                13488,
                13521
            ],
            [
                13521,
                13555
            ],
            [
                13555,
                13557
            ],
            [
                13557,
                13562
            ],
            [
                13563,
                13582
            ],
            [
                13582,
                13589
            ],
            [
                13589,
                13632
            ],
            [
                13632,
                13653
            ],
            [
                13654,
                13662
            ],
            [
                13664,
                13782
            ],
            [
                13783,
                13821
            ],
            [
                13832,
                13840
            ],
            [
                13840,
                13842
            ],
            [
                13842,
                13848
            ],
            [
                13855,
                13868
            ],
            [
                13882,
                13890
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                13993
            ],
            [
                13993,
                14050
            ],
            [
                14050,
                14076
            ],
            [
                14078,
                14154
            ],
            [
                14154,
                14184
            ],
            [
                14184,
                14185
            ],
            [
                14186,
                14197
            ],
            [
                14207,
                14213
            ],
            [
                14219,
                14225
            ],
            [
                14226,
                14258
            ],
            [
                14258,
                14273
            ],
            [
                14274,
                14310
            ],
            [
                14311,
                14316
            ],
            [
                14316,
                14364
            ],
            [
                14364,
                14420
            ],
            [
                14422,
                14482
            ],
            [
                14483,
                14490
            ],
            [
                14490,
                14524
            ],
            [
                14524,
                14546
            ],
            [
                14547,
                14583
            ],
            [
                14583,
                14585
            ],
            [
                14585,
                14623
            ],
            [
                14623,
                14673
            ],
            [
                14674,
                14749
            ],
            [
                14749,
                14801
            ],
            [
                14801,
                14814
            ],
            [
                14814,
                14833
            ]
        ],
        "row_chars": [
            [
                0,
                20
            ],
            [
                20,
                247
            ],
            [
                247,
                288
            ],
            [
                288,
                410
            ],
            [
                410,
                514
            ],
            [
                514,
                624
            ],
            [
                624,
                680
            ],
            [
                680,
                834
            ],
            [
                834,
                876
            ],
            [
                876,
                1081
            ],
            [
                1081,
                1177
            ],
            [
                1177,
                1226
            ],
            [
                1226,
                1326
            ],
            [
                1326,
                1386
            ],
            [
                1386,
                1469
            ],
            [
                1469,
                1469
            ],
            [
                1469,
                1528
            ],
            [
                1528,
                1597
            ],
            [
                1597,
                1719
            ],
            [
                1719,
                1813
            ],
            [
                1813,
                1901
            ],
            [
                1901,
                1901
            ],
            [
                1901,
                1901
            ],
            [
                1901,
                1943
            ],
            [
                1943,
                2018
            ],
            [
                2018,
                2057
            ],
            [
                2057,
                2102
            ],
            [
                2102,
                2156
            ],
            [
                2156,
                2156
            ],
            [
                2156,
                2236
            ],
            [
                2236,
                2236
            ],
            [
                2236,
                2243
            ],
            [
                2243,
                2259
            ],
            [
                2259,
                2401
            ],
            [
                2401,
                2410
            ],
            [
                2410,
                2430
            ],
            [
                2430,
                2439
            ],
            [
                2439,
                2486
            ],
            [
                2486,
                2532
            ],
            [
                2532,
                2720
            ],
            [
                2720,
                2756
            ],
            [
                2756,
                2820
            ],
            [
                2820,
                3011
            ],
            [
                3011,
                3157
            ],
            [
                3157,
                3260
            ],
            [
                3260,
                3383
            ],
            [
                3383,
                3438
            ],
            [
                3438,
                3653
            ],
            [
                3653,
                3854
            ],
            [
                3854,
                3882
            ],
            [
                3882,
                4052
            ],
            [
                4052,
                4424
            ],
            [
                4424,
                4516
            ],
            [
                4516,
                4571
            ],
            [
                4571,
                4628
            ],
            [
                4628,
                4777
            ],
            [
                4777,
                4836
            ],
            [
                4836,
                4896
            ],
            [
                4896,
                4959
            ],
            [
                4959,
                5011
            ],
            [
                5011,
                5175
            ],
            [
                5175,
                5260
            ],
            [
                5260,
                5464
            ],
            [
                5464,
                5525
            ],
            [
                5525,
                5597
            ],
            [
                5597,
                5682
            ],
            [
                5682,
                5682
            ],
            [
                5682,
                5927
            ],
            [
                5927,
                6007
            ],
            [
                6007,
                6007
            ],
            [
                6007,
                6007
            ],
            [
                6007,
                6063
            ],
            [
                6063,
                6148
            ],
            [
                6148,
                6207
            ],
            [
                6207,
                6283
            ],
            [
                6283,
                6343
            ],
            [
                6343,
                6369
            ],
            [
                6369,
                6473
            ],
            [
                6473,
                6649
            ],
            [
                6649,
                6887
            ],
            [
                6887,
                6931
            ],
            [
                6931,
                7004
            ],
            [
                7004,
                7094
            ],
            [
                7094,
                7134
            ],
            [
                7134,
                7134
            ],
            [
                7134,
                7134
            ],
            [
                7134,
                7417
            ],
            [
                7417,
                7469
            ],
            [
                7469,
                7528
            ],
            [
                7528,
                7599
            ],
            [
                7599,
                7676
            ],
            [
                7676,
                7844
            ],
            [
                7844,
                7844
            ],
            [
                7844,
                8017
            ],
            [
                8017,
                8037
            ],
            [
                8037,
                8066
            ],
            [
                8066,
                8091
            ],
            [
                8091,
                8188
            ],
            [
                8188,
                8254
            ],
            [
                8254,
                8443
            ],
            [
                8443,
                8443
            ],
            [
                8443,
                8443
            ],
            [
                8443,
                8554
            ],
            [
                8554,
                8626
            ],
            [
                8626,
                8699
            ],
            [
                8699,
                8699
            ],
            [
                8699,
                8699
            ],
            [
                8699,
                9006
            ],
            [
                9006,
                9075
            ],
            [
                9075,
                9152
            ],
            [
                9152,
                9245
            ],
            [
                9245,
                9357
            ],
            [
                9357,
                9495
            ],
            [
                9495,
                9495
            ],
            [
                9495,
                9532
            ],
            [
                9532,
                9532
            ],
            [
                9532,
                9629
            ],
            [
                9629,
                9689
            ],
            [
                9689,
                9725
            ],
            [
                9725,
                9953
            ],
            [
                9953,
                10007
            ],
            [
                10007,
                10175
            ],
            [
                10175,
                10175
            ],
            [
                10175,
                10292
            ],
            [
                10292,
                10390
            ],
            [
                10390,
                10427
            ],
            [
                10427,
                10604
            ],
            [
                10604,
                10604
            ],
            [
                10604,
                10652
            ],
            [
                10652,
                10652
            ],
            [
                10652,
                10680
            ],
            [
                10680,
                10706
            ],
            [
                10706,
                10726
            ],
            [
                10726,
                10850
            ],
            [
                10850,
                10936
            ],
            [
                10936,
                10936
            ],
            [
                10936,
                10970
            ],
            [
                10970,
                10970
            ],
            [
                10970,
                10987
            ],
            [
                10987,
                11011
            ],
            [
                11011,
                11036
            ],
            [
                11036,
                11209
            ],
            [
                11209,
                11244
            ],
            [
                11244,
                11312
            ],
            [
                11312,
                11394
            ],
            [
                11394,
                11394
            ],
            [
                11394,
                11471
            ],
            [
                11471,
                11609
            ],
            [
                11609,
                11747
            ],
            [
                11747,
                11765
            ],
            [
                11765,
                11807
            ],
            [
                11807,
                11938
            ],
            [
                11938,
                11975
            ],
            [
                11975,
                12031
            ],
            [
                12031,
                12076
            ],
            [
                12076,
                12076
            ],
            [
                12076,
                12172
            ],
            [
                12172,
                12232
            ],
            [
                12232,
                12331
            ],
            [
                12331,
                12390
            ],
            [
                12390,
                12486
            ],
            [
                12486,
                12645
            ],
            [
                12645,
                12749
            ],
            [
                12749,
                12786
            ],
            [
                12786,
                12850
            ],
            [
                12850,
                12936
            ],
            [
                12936,
                12967
            ],
            [
                12967,
                12967
            ],
            [
                12967,
                13042
            ],
            [
                13042,
                13080
            ],
            [
                13080,
                13109
            ],
            [
                13109,
                13109
            ],
            [
                13109,
                13188
            ],
            [
                13188,
                13236
            ],
            [
                13236,
                13288
            ],
            [
                13288,
                13288
            ],
            [
                13288,
                13288
            ],
            [
                13288,
                13344
            ],
            [
                13344,
                13421
            ],
            [
                13421,
                13488
            ],
            [
                13488,
                13521
            ],
            [
                13521,
                13557
            ],
            [
                13557,
                13582
            ],
            [
                13582,
                13589
            ],
            [
                13589,
                13632
            ],
            [
                13632,
                13664
            ],
            [
                13664,
                13842
            ],
            [
                13842,
                13892
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                13993
            ],
            [
                13993,
                14050
            ],
            [
                14050,
                14078
            ],
            [
                14078,
                14154
            ],
            [
                14154,
                14186
            ],
            [
                14186,
                14258
            ],
            [
                14258,
                14364
            ],
            [
                14364,
                14524
            ],
            [
                14524,
                14585
            ],
            [
                14585,
                14623
            ],
            [
                14623,
                14749
            ],
            [
                14749,
                14801
            ],
            [
                14801,
                14814
            ],
            [
                14814,
                14833
            ]
        ]
    }
}