{
    "original": {
        "text": "The evening was still and warm; close and sultry it even promised to become. Round the descending sun the clouds glowed purple; summer tints, rather Indian than English, suffused the horizon, and cast rosy reflections on hillside, house-front, tree-bole, on winding road and undulating pasture-ground. The two girls came down from the fields slowly. By the time they reached the churchyard the bells were hushed; the multitudes were gathered into the church. The whole scene was solitary.\n\"How pleasant and calm it is!\" said Caroline.\n\"And how hot it will be in the church!\" responded Shirley. \"And what a dreary long speech Dr. Boultby will make! And how the curates will hammer over their prepared orations! For my part, I would rather not enter.\"\n\"But my uncle will be angry if he observes our absence.\"\n\"I will bear the brunt of his wrath; he will not devour me. I shall be sorry to miss his pungent speech. I know it will be all sense for the church, and all causticity for schism. He'll not forget the battle of Royd Lane. I shall be sorry also to deprive you of Mr. Hall's sincere friendly homily, with all its racy Yorkshireisms; but here I must stay. The gray church and grayer tombs look divine with this crimson gleam on them. Nature is now at her evening prayers; she is kneeling before those red hills. I see her prostrate on the great steps of her altar, praying for a fair night for mariners at sea, for travellers in deserts, for lambs on moors, and unfledged birds in woods. Caroline, I see her, and I will tell you what she is like. She is like what Eve was when she and Adam stood alone on earth.\"\n\"And that is not Milton's Eve, Shirley.\"\n\"Milton's Eve! Milton's Eve! I repeat. No, by the pure Mother of God, she is not! Cary, we are alone; we may speak what we think. Milton was great; but was he good? His brain was right; how was his heart? He saw heaven; he looked down on hell. He saw Satan, and Sin his daughter, and Death their horrible offspring. Angels serried before him their battalions; the long lines of adamantine shields flashed back on his blind eyeballs the unutterable splendour of heaven. Devils gathered their legions in his sight; their dim, discrowned, and tarnished armies passed rank and file before him. Milton tried to see the first woman; but, Cary, he saw her not.\"\n\"You are bold to say so, Shirley.\"\n\"Not more bold than faithful. It was his cook that he saw; or it was Mrs. Gill, as I have seen her, making custards, in the heat of summer, in the cool dairy, with rose-trees and nasturtiums about the latticed window, preparing a cold collation for the rectors--preserves and 'dulcet creams;' puzzled 'what choice to choose for delicacy best; what order so contrived as not to mix tastes, not well-joined, inelegant, but bring taste after taste, upheld with kindliest change.'\"\n\"All very well too, Shirley.\"\n\"I would beg to remind him that the first men of the earth were Titans, and that Eve was their mother; from her sprang Saturn, Hyperion, Oceanus; she bore Prometheus----\"\n\"Pagan that you are! what does that signify?\"\n\"I say, there were giants on the earth in those days--giants that strove to scale heaven. The first woman's breast that heaved with life on this world yielded the daring which could contend with Omnipotence, the strength which could bear a thousand years of bondage, the vitality which could feed that vulture death through uncounted ages, the unexhausted life and uncorrupted excellence, sisters to immortality, which, after millenniums of crimes, struggles, and woes, could conceive and bring forth a Messiah. The first woman was heaven-born. Vast was the heart whence gushed the well-spring of the blood of nations, and grand the undegenerate head where rested the consort-crown of creation.\"\n\"She coveted an apple, and was cheated by a snake; but you have got such a hash of Scripture and mythology into your head that there is no making any sense of you. You have not yet told me what you saw kneeling on those hills.\"\n\"I saw--I now see--a woman-Titan. Her robe of blue air spreads to the outskirts of the heath, where yonder flock is grazing; a veil white as an avalanche sweeps from her head to her feet, and arabesques of lightning flame on its borders. Under her breast I see her zone, purple like that horizon; through its blush shines the star of evening. Her steady eyes I cannot picture. They are clear, they are deep as lakes, they are lifted and full of worship, they tremble with the softness of love and the lustre of prayer. Her forehead has the expanse of a cloud, and is paler than the early moon, risen long before dark gathers. She reclines her bosom on the ridge of Stilbro' Moor; her mighty hands are joined beneath it. So kneeling, face to face she speaks with God. That Eve is Jehovah's daughter, as Adam was His son.\"\n\"She is very vague and visionary. Come, Shirley, we ought to go into church.\"\n\"Caroline, I will not; I will stay out here with my mother Eve, in these days called Nature. I love her--undying, mighty being! Heaven may have faded from her brow when she fell in paradise, but all that is glorious on earth shines there still. She is taking me to her bosom, and showing me her heart. Hush, Caroline! You will see her and feel as I do, if we are both silent.\"\n\"I will humour your whim; but you will begin talking again ere ten minutes are over.\"\nMiss Keeldar, on whom the soft excitement of the warm summer evening seemed working with unwonted power, leaned against an upright headstone; she fixed her eyes on the deep-burning west, and sank into a pleasurable trance. Caroline, going a little apart, paced to and fro beneath the rectory garden wall, dreaming too in her way. Shirley had mentioned the word \"mother.\" That word suggested to Caroline's imagination not the mighty and mystical parent of Shirley's visions, but a gentle human form--the form she ascribed to her own mother, unknown, unloved, but not unlonged for.\n\"Oh that the day would come when she would remember her child! Oh that I might know her, and knowing, love her!\"\nSuch was her aspiration.\nThe longing of her childhood filled her soul again. The desire which many a night had kept her awake in her crib, and which fear of its fallacy had of late years almost extinguished, relit suddenly, and glowed warm in her heart, that her mother might come some happy day, and send for her to her presence, look upon her fondly with loving eyes, and say to her tenderly, in a sweet voice, \"Caroline, my child, I have a home for you; you shall live with me. All the love you have needed, and not tasted, from infancy, I have saved for you carefully. Come; it shall cherish you now.\"\nA noise on the road roused Caroline from her filial hopes, and Shirley from her Titan visions. They listened, and heard the tramp of horses. They looked, and saw a glitter through the trees. They caught through the foliage glimpses of martial scarlet; helm shone, plume waved. Silent and orderly, six soldiers rode softly by.\n\"The same we saw this afternoon,\" whispered Shirley. \"They have been halting somewhere till now. They wish to be as little noticed as possible, and are seeking their rendezvous at this quiet hour, while the people are at church. Did I not say we should see unusual things ere long?\"\nScarcely were sight and sound of the soldiers lost, when another and somewhat different disturbance broke the night-hush--a child's impatient scream. They looked. A man issued from the church, carrying in his arms an infant--a robust, ruddy little boy of some two years old--roaring with all the power of his lungs. He had probably just awaked from a church-sleep. Two little girls, of nine and ten, followed. The influence of the fresh air, and the attraction of some flowers gathered from a grave, soon quieted the child. The man sat down with him, dandling him on his knee as tenderly as any woman; the two little girls took their places one on each side.\n\"Good-evening, William,\" said Shirley, after due scrutiny of the man. He had seen her before, and apparently was waiting to be recognized. He now took off his hat, and grinned a smile of pleasure. He was a rough-headed, hard-featured personage, not old, but very weather-beaten. His attire was decent and clean; that of his children singularly neat. It was our old friend Farren. The young ladies approached him.\n\"You are not going into the church?\" he inquired, gazing at them complacently, yet with a mixture of bashfulness in his look--a sentiment not by any means the result of awe of their station, but only of appreciation of their elegance and youth. Before gentlemen--such as Moore or Helstone, for instance--William was often a little dogged; with proud or insolent ladies, too, he was quite unmanageable, sometimes very resentful; but he was most sensible of, most tractable to, good-humour and civility. His nature--a stubborn one--was repelled by inflexibility in other natures; for which reason he had never been able to like his former master, Moore; and unconscious of that gentleman's good opinion of himself, and of the service he had secretly rendered him in recommending him as gardener to Mr. Yorke, and by this means to other families in the neighbourhood, he continued to harbour a grudge against his austerity. Latterly he had often worked at Fieldhead. Miss Keeldar's frank, hospitable manners were perfectly charming to him. Caroline he had known from her childhood; unconsciously she was his ideal of a lady. Her gentle mien, step, gestures, her grace of person and attire, moved some artist-fibres about his peasant heart. He had a pleasure in looking at her, as he had in examining rare flowers or in seeing pleasant landscapes. Both the ladies liked William; it was their delight to lend him books, to give him plants; and they preferred his conversation far before that of many coarse, hard, pretentious people immeasurably higher in station.\n\"Who was speaking, William, when you came out?\" asked Shirley.\n\"A gentleman ye set a deal of store on, Miss Shirley--Mr. Donne.\"\n\"You look knowing, William. How did you find out my regard for Mr. Donne?\"\n\"Ay, Miss Shirley, there's a gleg light i' your een sometimes which betrays you. You look raight down scornful sometimes when Mr. Donne is by.\"\n\"Do you like him yourself, William?\"\n\"Me? I'm stalled o' t' curates, and so is t' wife. They've no manners. They talk to poor folk fair as if they thought they were beneath them. They're allus magnifying their office. It is a pity but their office could magnify them; but it does nought o' t' soart. I fair hate pride.\"\n\"But you are proud in your own way yourself,\" interposed Caroline. \"You are what you call house-proud: you like to have everything handsome about you. Sometimes you look as if you were almost too proud to take your wages. When you were out of work, you were too proud to get anything on credit. But for your children, I believe you would rather have starved than gone to the shops without money; and when I wanted to give you something, what a difficulty I had in making you take it!\"\n\"It is partly true, Miss Caroline. Ony day I'd rather give than take, especially from sich as ye. Look at t' difference between us. Ye're a little, young, slender lass, and I'm a great strong man; I'm rather more nor twice your age. It is not _my_ part, then, I think, to tak fro' _ye_--to be under obligations (as they say) to _ye_. And that day ye came to our house, and called me to t' door, and offered me five shillings, which I doubt ye could ill spare--for ye've no fortin', I know--that day I war fair a rebel, a radical, an insurrectionist; and _ye_ made me so. I thought it shameful that, willing and able as I was to work, I suld be i' such a condition that a young cratur about the age o' my own eldest lass suld think it needful to come and offer me her bit o' brass.\"\n\"I suppose you were angry with me, William?\"\n\"I almost was, in a way. But I forgave ye varry soon. Ye meant well. Ay, _I am_ proud, and so are _ye_; but your pride and mine is t' raight mak--what we call i' Yorkshire clean pride--such as Mr. Malone and Mr. Donne knows nought about. Theirs is mucky pride. Now, I shall teach my lasses to be as proud as Miss Shirley there, and my lads to be as proud as myseln; but I dare ony o' 'em to be like t' curates. I'd lick little Michael if I seed him show any signs o' that feeling.\"\n\"What is the difference, William?\"\n\"Ye know t' difference weel enow, but ye want me to get a gate o' talking. Mr. Malone and Mr. Donne is almost too proud to do aught for theirseln; _we_ are almost too proud to let anybody do aught for us. T' curates can hardly bide to speak a civil word to them they think beneath them; _we_ can hardly bide to tak an uncivil word fro' them that thinks themseln aboon us.\"\n\"Now, William, be humble enough to tell me truly how you are getting on in the world. Are you well off?\"\n\"Miss Shirley, I am varry well off. Since I got into t' gardening line, wi' Mr. Yorke's help, and since Mr. Hall (another o' t' raight sort) helped my wife to set up a bit of a shop, I've nought to complain of. My family has plenty to eat and plenty to wear. My pride makes me find means to have an odd pound now and then against rainy days; for I think I'd die afore I'd come to t' parish; and me and mine is content. But t' neighbours is poor yet. I see a great deal of distress.\"\n\"And, consequently, there is still discontent, I suppose?\" inquired Miss Keeldar.\n\"_Consequently_--ye say right--_consequently_. In course, starving folk cannot be satisfied or settled folk. The country's not in a safe condition--I'll say so mich!\"\n\"But what can be done? What more can I do, for instance?\"\n\"Do? Ye can do not mich, poor young lass! Ye've gi'en your brass; ye've done well. If ye could transport your tenant, Mr. Moore, to Botany Bay, ye'd happen do better. Folks hate him.\"\n\"William, for shame!\" exclaimed Caroline warmly. \"If folks _do_ hate him, it is to their disgrace, not his. Mr. Moore himself hates nobody. He only wants to do his duty, and maintain his rights. You are wrong to talk so.\"\n\"I talk as I think. He has a cold, unfeeling heart, yond' Moore.\"\n\"But,\" interposed Shirley, \"supposing Moore was driven from the country, and his mill razed to the ground, would people have more work?\"\n\"They'd have less. I know that, and they know that; and there is many an honest lad driven desperate by the certainty that whichever way he turns he cannot better himself; and there is dishonest men plenty to guide them to the devil, scoundrels that reckons to be the 'people's friends,' and that knows nought about the people, and is as insincere as Lucifer. I've lived aboon forty year in the world, and I believe that 'the people' will never have any true friends but theirseln and them two or three good folk i' different stations that is friends to all the world. Human natur', taking it i' th' lump, is nought but selfishness. It is but excessive few, it is but just an exception here and there, now and then, sich as ye two young uns and me, that, being in a different sphere, can understand t' one t' other, and be friends wi'out slavishness o' one hand or pride o' t' other. Them that reckons to be friends to a lower class than their own fro' political motives is never to be trusted; they always try to make their inferiors tools. For my own part, I will neither be patronized nor misled for no man's pleasure. I've had overtures made to me lately that I saw were treacherous, and I flung 'em back i' the faces o' them that offered 'em.\"\n\"You won't tell us what overtures?\"\n\"I will not. It would do no good. It would mak no difference. Them they concerned can look after theirseln.\"\n\"Ay, we'se look after werseln,\" said another voice. Joe Scott had sauntered forth from the church to get a breath of fresh air, and there he stood.\n\"I'll warrant _ye_, Joe,\" observed William, smiling.\n\"And I'll warrant my maister,\" was the answer.--\"Young ladies,\" continued Joe, assuming a lordly air, \"ye'd better go into th' house.\"\n\"I wonder what for?\" inquired Shirley, to whom the overlooker's somewhat pragmatical manners were familiar, and who was often at war with him; for Joe, holding supercilious theories about women in general, resented greatly, in his secret soul, the fact of his master and his master's mill being, in a manner, under petticoat government, and had felt as wormwood and gall certain business visits of the heiress to the Hollow's counting-house.\n\"Because there is nought agate that fits women to be consarned in.\"\n\"Indeed! There is prayer and preaching agate in that church. Are we not concerned in that?\"\n\"Ye have been present neither at the prayer nor preaching, ma'am, if I have observed aright. What I alluded to was politics. William Farren here was touching on that subject, if I'm not mista'en.\"\n\"Well, what then? Politics are our habitual study, Joe. Do you know I see a newspaper every day, and two of a Sunday?\"\n\"I should think you'll read the marriages, probably, miss, and the murders, and the accidents, and sich like?\"\n\"I read the leading articles, Joe, and the foreign intelligence, and I look over the market prices. In short, I read just what gentlemen read.\"\nJoe looked as if he thought this talk was like the chattering of a pie. He replied to it by a disdainful silence.\n\"Joe,\" continued Miss Keeldar, \"I never yet could ascertain properly whether you are a Whig or a Tory. Pray, which party has the honour of your alliance?\"\n\"It is rayther difficult to explain where you are sure not to be understood,\" was Joe's haughty response; \"but as to being a Tory, I'd as soon be an old woman, or a young one, which is a more flimsier article still. It is the Tories that carries on the war and ruins trade; and if I be of any party--though political parties is all nonsense--I'm of that which is most favourable to peace, and, by consequence, to the mercantile interests of this here land.\"\n\"So am I, Joe,\" replied Shirley, who had rather a pleasure in teasing the overlooker, by persisting in talking on subjects with which he opined she, as a woman, had no right to meddle--\"partly, at least. I have rather a leaning to the agricultural interest, too; as good reason is, seeing that I don't desire England to be under the feet of France, and that if a share of my income comes from Hollow's Mill, a larger share comes from the landed estate around it. It would not do to take any measures injurious to the farmers, Joe, I think?\"\n\"The dews at this hour is unwholesome for females,\" observed Joe.\n\"If you make that remark out of interest in me, I have merely to assure you that I am impervious to cold. I should not mind taking my turn to watch the mill one of these summer nights, armed with your musket, Joe.\"\nJoe Scott's chin was always rather prominent. He poked it out, at this speech, some inches farther than usual.\n\"But--to go back to my sheep,\" she proceeded--\"clothier and mill-owner as I am, besides farmer, I cannot get out of my head a certain idea that we manufacturers and persons of business are sometimes a little--a _very little_--selfish and short-sighted in our views, and rather _too_ regardless of human suffering, rather heartless in our pursuit of gain. Don't you agree with me, Joe?\"\n\"I cannot argue where I cannot be comprehended,\" was again the answer.\n\"Man of mystery! Your master will argue with me sometimes, Joe. He is not so stiff as you are.\"\n\"Maybe not. We've all our own ways.\"\n\"Joe, do you seriously think all the wisdom in the world is lodged in male skulls?\"\n\"I think that women are a kittle and a froward generation; and I've a great respect for the doctrines delivered in the second chapter of St. Paul's first Epistle to Timothy.\"\n\"What doctrines, Joe?\"\n\"'Let the woman learn in silence, with all subjection. I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. For Adam was first formed, then Eve.'\"\n\"What has that to do with the business?\" interjected Shirley. \"That smacks of rights of primogeniture. I'll bring it up to Mr. Yorke the first time he inveighs against those rights.\"\n\"And,\" continued Joe Scott, \"Adam was not deceived, but the woman being deceived was in the transgression.\"\n\"More shame to Adam to sin with his eyes open!\" cried Miss Keeldar. \"To confess the honest truth, Joe, I never was easy in my mind concerning that chapter. It puzzles me.\"\n\"It is very plain, miss. He that runs may read.\"\n\"He may read it in his own fashion,\" remarked Caroline, now joining in the dialogue for the first time. \"You allow the right of private judgment, I suppose, Joe?\"\n\"My certy, that I do! I allow and claim it for every line of the holy Book.\"\n\"Women may exercise it as well as men?\"\n\"Nay. Women is to take their husbands' opinion, both in politics and religion. It's wholesomest for them.\"\n\"Oh! oh!\" exclaimed both Shirley and Caroline.\n\"To be sure; no doubt on't,\" persisted the stubborn overlooker.\n\"Consider yourself groaned down, and cried shame over, for such a stupid observation,\" said Miss Keeldar. \"You might as well say men are to take the opinions of their priests without examination. Of what value would a religion so adopted be? It would be mere blind, besotted superstition.\"\n\"And what is _your_ reading, Miss Helstone, o' these words o' St. Paul's?\"\n\"Hem! I--I account for them in this way. He wrote that chapter for a particular congregation of Christians, under peculiar circumstances; and besides, I dare say, if I could read the original Greek, I should find that many of the words have been wrongly translated, perhaps misapprehended altogether. It would be possible, I doubt not, with a little ingenuity, to give the passage quite a contrary turn--to make it say, 'Let the woman speak out whenever she sees fit to make an objection.' 'It is permitted to a woman to teach and to exercise authority as much as may be. Man, meantime, cannot do better than hold his peace;' and so on.\"\n\"That willn't wash, miss.\"\n\"I dare say it will. My notions are dyed in faster colours than yours, Joe. Mr. Scott, you are a thoroughly dogmatical person, and always were. I like William better than you.\"\n\"Joe is well enough in his own house,\" said Shirley. \"I have seen him as quiet as a lamb at home. There is not a better nor a kinder husband in Briarfield. He does not dogmatize to his wife.\"\n\"My wife is a hard-working, plain woman; time and trouble has ta'en all the conceit out of her. But that is not the case with you, young misses. And then you reckon to have so much knowledge; and i' my thoughts it's only superficial sort o' vanities you're acquainted with. I can tell--happen a year sin'--one day Miss Caroline coming into our counting-house when I war packing up summat behind t' great desk, and she didn't see me, and she brought a slate wi' a sum on it to t' maister. It war only a bit of a sum in practice, that our Harry would have settled i' two minutes. She couldn't do it. Mr. Moore had to show her how. And when he did show her, she couldn't understand him.\"\n\"Nonsense, Joe!\"\n\"Nay, it's no nonsense. And Miss Shirley there reckons to hearken to t' maister when he's talking ower trade, so attentive like, as if she followed him word for word, and all war as clear as a lady's looking-glass to her een; and all t' while she's peeping and peeping out o' t' window to see if t' mare stands quiet; and then looking at a bit of a splash on her riding-skirt; and then glancing glegly round at wer counting-house cobwebs and dust, and thinking what mucky folk we are, and what a grand ride she'll have just i' now ower Nunnely Common. She hears no more o' Mr. Moore's talk nor if he spake Hebrew.\"\n\"Joe, you are a real slanderer. I would give you your answer, only the people are coming out of church. We must leave you. Man of prejudice, good-bye.--William, good-bye.--Children, come up to Fieldhead to-morrow, and you shall choose what you like best out of Mrs. Gill's store-room.\"",
        "paragraph_chars": [
            [
                0,
                489
            ],
            [
                489,
                535
            ],
            [
                535,
                750
            ],
            [
                750,
                807
            ],
            [
                807,
                1617
            ],
            [
                1617,
                1658
            ],
            [
                1658,
                2313
            ],
            [
                2313,
                2348
            ],
            [
                2348,
                2826
            ],
            [
                2826,
                2856
            ],
            [
                2856,
                3027
            ],
            [
                3027,
                3073
            ],
            [
                3073,
                3769
            ],
            [
                3769,
                3997
            ],
            [
                3997,
                4818
            ],
            [
                4818,
                4896
            ],
            [
                4896,
                5273
            ],
            [
                5273,
                5359
            ],
            [
                5359,
                5939
            ],
            [
                5939,
                6052
            ],
            [
                6052,
                6077
            ],
            [
                6077,
                6658
            ],
            [
                6658,
                6984
            ],
            [
                6984,
                7267
            ],
            [
                7267,
                7926
            ],
            [
                7926,
                8339
            ],
            [
                8339,
                9899
            ],
            [
                9899,
                9962
            ],
            [
                9962,
                10028
            ],
            [
                10028,
                10103
            ],
            [
                10103,
                10247
            ],
            [
                10247,
                10284
            ],
            [
                10284,
                10567
            ],
            [
                10567,
                11052
            ],
            [
                11052,
                11834
            ],
            [
                11834,
                11879
            ],
            [
                11879,
                12361
            ],
            [
                12361,
                12396
            ],
            [
                12396,
                12769
            ],
            [
                12769,
                12874
            ],
            [
                12874,
                13357
            ],
            [
                13357,
                13439
            ],
            [
                13439,
                13606
            ],
            [
                13606,
                13664
            ],
            [
                13664,
                13848
            ],
            [
                13848,
                14070
            ],
            [
                14070,
                14136
            ],
            [
                14136,
                14273
            ],
            [
                14273,
                15522
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15667
            ],
            [
                15667,
                15815
            ],
            [
                15815,
                15868
            ],
            [
                15868,
                16003
            ],
            [
                16003,
                16445
            ],
            [
                16445,
                16513
            ],
            [
                16513,
                16605
            ],
            [
                16605,
                16802
            ],
            [
                16802,
                16921
            ],
            [
                16921,
                17032
            ],
            [
                17032,
                17176
            ],
            [
                17176,
                17290
            ],
            [
                17290,
                17445
            ],
            [
                17445,
                17903
            ],
            [
                17903,
                18444
            ],
            [
                18444,
                18510
            ],
            [
                18510,
                18725
            ],
            [
                18725,
                18836
            ],
            [
                18836,
                19222
            ],
            [
                19222,
                19293
            ],
            [
                19293,
                19389
            ],
            [
                19389,
                19426
            ],
            [
                19426,
                19510
            ],
            [
                19510,
                19685
            ],
            [
                19685,
                19708
            ],
            [
                19708,
                19892
            ],
            [
                19892,
                20075
            ],
            [
                20075,
                20183
            ],
            [
                20183,
                20355
            ],
            [
                20355,
                20404
            ],
            [
                20404,
                20567
            ],
            [
                20567,
                20644
            ],
            [
                20644,
                20684
            ],
            [
                20684,
                20791
            ],
            [
                20791,
                20838
            ],
            [
                20838,
                20902
            ],
            [
                20902,
                21192
            ],
            [
                21192,
                21267
            ],
            [
                21267,
                21905
            ],
            [
                21905,
                21932
            ],
            [
                21932,
                22109
            ],
            [
                22109,
                22301
            ],
            [
                22301,
                22986
            ],
            [
                22986,
                23003
            ],
            [
                23003,
                23618
            ],
            [
                23618,
                23903
            ]
        ],
        "segment_chars": [
            [
                0,
                77
            ],
            [
                77,
                302
            ],
            [
                302,
                350
            ],
            [
                350,
                459
            ],
            [
                459,
                489
            ],
            [
                489,
                520
            ],
            [
                520,
                535
            ],
            [
                535,
                575
            ],
            [
                575,
                594
            ],
            [
                594,
                648
            ],
            [
                648,
                710
            ],
            [
                710,
                750
            ],
            [
                750,
                807
            ],
            [
                807,
                867
            ],
            [
                867,
                912
            ],
            [
                912,
                987
            ],
            [
                987,
                1029
            ],
            [
                1029,
                1160
            ],
            [
                1160,
                1238
            ],
            [
                1238,
                1316
            ],
            [
                1316,
                1492
            ],
            [
                1492,
                1551
            ],
            [
                1551,
                1617
            ],
            [
                1617,
                1658
            ],
            [
                1658,
                1673
            ],
            [
                1673,
                1687
            ],
            [
                1687,
                1697
            ],
            [
                1697,
                1740
            ],
            [
                1740,
                1788
            ],
            [
                1788,
                1823
            ],
            [
                1823,
                1863
            ],
            [
                1863,
                1902
            ],
            [
                1902,
                1974
            ],
            [
                1974,
                2127
            ],
            [
                2127,
                2248
            ],
            [
                2248,
                2313
            ],
            [
                2313,
                2348
            ],
            [
                2348,
                2378
            ],
            [
                2378,
                2826
            ],
            [
                2826,
                2856
            ],
            [
                2856,
                3027
            ],
            [
                3027,
                3048
            ],
            [
                3048,
                3073
            ],
            [
                3073,
                3163
            ],
            [
                3163,
                3585
            ],
            [
                3585,
                3618
            ],
            [
                3618,
                3769
            ],
            [
                3769,
                3933
            ],
            [
                3933,
                3997
            ],
            [
                3997,
                4031
            ],
            [
                4031,
                4235
            ],
            [
                4235,
                4340
            ],
            [
                4340,
                4374
            ],
            [
                4374,
                4516
            ],
            [
                4516,
                4623
            ],
            [
                4623,
                4717
            ],
            [
                4717,
                4764
            ],
            [
                4764,
                4818
            ],
            [
                4818,
                4852
            ],
            [
                4852,
                4896
            ],
            [
                4896,
                4989
            ],
            [
                4989,
                5024
            ],
            [
                5024,
                5141
            ],
            [
                5141,
                5198
            ],
            [
                5198,
                5214
            ],
            [
                5214,
                5273
            ],
            [
                5273,
                5359
            ],
            [
                5359,
                5582
            ],
            [
                5582,
                5689
            ],
            [
                5689,
                5730
            ],
            [
                5730,
                5939
            ],
            [
                5939,
                6002
            ],
            [
                6002,
                6052
            ],
            [
                6052,
                6077
            ],
            [
                6077,
                6129
            ],
            [
                6129,
                6533
            ],
            [
                6533,
                6625
            ],
            [
                6625,
                6658
            ],
            [
                6658,
                6753
            ],
            [
                6753,
                6799
            ],
            [
                6799,
                6849
            ],
            [
                6849,
                6935
            ],
            [
                6935,
                6984
            ],
            [
                6984,
                7037
            ],
            [
                7037,
                7081
            ],
            [
                7081,
                7213
            ],
            [
                7213,
                7267
            ],
            [
                7267,
                7417
            ],
            [
                7417,
                7430
            ],
            [
                7430,
                7583
            ],
            [
                7583,
                7632
            ],
            [
                7632,
                7677
            ],
            [
                7677,
                7791
            ],
            [
                7791,
                7926
            ],
            [
                7926,
                7996
            ],
            [
                7996,
                8065
            ],
            [
                8065,
                8123
            ],
            [
                8123,
                8205
            ],
            [
                8205,
                8276
            ],
            [
                8276,
                8306
            ],
            [
                8306,
                8339
            ],
            [
                8339,
                8376
            ],
            [
                8376,
                8584
            ],
            [
                8584,
                8841
            ],
            [
                8841,
                9260
            ],
            [
                9260,
                9303
            ],
            [
                9303,
                9376
            ],
            [
                9376,
                9461
            ],
            [
                9461,
                9576
            ],
            [
                9576,
                9683
            ],
            [
                9683,
                9899
            ],
            [
                9899,
                9947
            ],
            [
                9947,
                9962
            ],
            [
                9962,
                10028
            ],
            [
                10028,
                10056
            ],
            [
                10056,
                10103
            ],
            [
                10103,
                10184
            ],
            [
                10184,
                10247
            ],
            [
                10247,
                10284
            ],
            [
                10284,
                10289
            ],
            [
                10289,
                10335
            ],
            [
                10335,
                10355
            ],
            [
                10355,
                10426
            ],
            [
                10426,
                10465
            ],
            [
                10465,
                10547
            ],
            [
                10547,
                10567
            ],
            [
                10567,
                10634
            ],
            [
                10634,
                10718
            ],
            [
                10718,
                10789
            ],
            [
                10789,
                10862
            ],
            [
                10862,
                11052
            ],
            [
                11052,
                11087
            ],
            [
                11087,
                11150
            ],
            [
                11150,
                11184
            ],
            [
                11184,
                11285
            ],
            [
                11285,
                11386
            ],
            [
                11386,
                11623
            ],
            [
                11623,
                11834
            ],
            [
                11834,
                11879
            ],
            [
                11879,
                11904
            ],
            [
                11904,
                11933
            ],
            [
                11933,
                11948
            ],
            [
                11948,
                12117
            ],
            [
                12117,
                12140
            ],
            [
                12140,
                12290
            ],
            [
                12290,
                12361
            ],
            [
                12361,
                12396
            ],
            [
                12396,
                12471
            ],
            [
                12471,
                12601
            ],
            [
                12601,
                12769
            ],
            [
                12769,
                12855
            ],
            [
                12855,
                12874
            ],
            [
                12874,
                12910
            ],
            [
                12910,
                13085
            ],
            [
                13085,
                13133
            ],
            [
                13133,
                13293
            ],
            [
                13293,
                13324
            ],
            [
                13324,
                13357
            ],
            [
                13357,
                13416
            ],
            [
                13416,
                13439
            ],
            [
                13439,
                13486
            ],
            [
                13486,
                13548
            ],
            [
                13548,
                13606
            ],
            [
                13606,
                13629
            ],
            [
                13629,
                13664
            ],
            [
                13664,
                13669
            ],
            [
                13669,
                13706
            ],
            [
                13706,
                13747
            ],
            [
                13747,
                13831
            ],
            [
                13831,
                13848
            ],
            [
                13848,
                13870
            ],
            [
                13870,
                13897
            ],
            [
                13897,
                13956
            ],
            [
                13956,
                13988
            ],
            [
                13988,
                14043
            ],
            [
                14043,
                14070
            ],
            [
                14070,
                14090
            ],
            [
                14090,
                14136
            ],
            [
                14136,
                14273
            ],
            [
                14273,
                14292
            ],
            [
                14292,
                14633
            ],
            [
                14633,
                14842
            ],
            [
                14842,
                14906
            ],
            [
                14906,
                15157
            ],
            [
                15157,
                15315
            ],
            [
                15315,
                15395
            ],
            [
                15395,
                15522
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15571
            ],
            [
                15571,
                15592
            ],
            [
                15592,
                15620
            ],
            [
                15620,
                15667
            ],
            [
                15667,
                15719
            ],
            [
                15719,
                15815
            ],
            [
                15815,
                15868
            ],
            [
                15868,
                16003
            ],
            [
                16003,
                16024
            ],
            [
                16024,
                16445
            ],
            [
                16445,
                16513
            ],
            [
                16513,
                16522
            ],
            [
                16522,
                16574
            ],
            [
                16574,
                16605
            ],
            [
                16605,
                16698
            ],
            [
                16698,
                16730
            ],
            [
                16730,
                16802
            ],
            [
                16802,
                16820
            ],
            [
                16820,
                16858
            ],
            [
                16858,
                16921
            ],
            [
                16921,
                17032
            ],
            [
                17032,
                17132
            ],
            [
                17132,
                17176
            ],
            [
                17176,
                17248
            ],
            [
                17248,
                17290
            ],
            [
                17290,
                17393
            ],
            [
                17393,
                17445
            ],
            [
                17445,
                17661
            ],
            [
                17661,
                17903
            ],
            [
                17903,
                18107
            ],
            [
                18107,
                18366
            ],
            [
                18366,
                18444
            ],
            [
                18444,
                18510
            ],
            [
                18510,
                18616
            ],
            [
                18616,
                18725
            ],
            [
                18725,
                18771
            ],
            [
                18771,
                18836
            ],
            [
                18836,
                19191
            ],
            [
                19191,
                19222
            ],
            [
                19222,
                19293
            ],
            [
                19293,
                19310
            ],
            [
                19310,
                19357
            ],
            [
                19357,
                19389
            ],
            [
                19389,
                19401
            ],
            [
                19401,
                19426
            ],
            [
                19426,
                19510
            ],
            [
                19510,
                19685
            ],
            [
                19685,
                19708
            ],
            [
                19708,
                19763
            ],
            [
                19763,
                19853
            ],
            [
                19853,
                19892
            ],
            [
                19892,
                19933
            ],
            [
                19933,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20075
            ],
            [
                20075,
                20183
            ],
            [
                20183,
                20231
            ],
            [
                20231,
                20251
            ],
            [
                20251,
                20339
            ],
            [
                20339,
                20355
            ],
            [
                20355,
                20380
            ],
            [
                20380,
                20404
            ],
            [
                20404,
                20508
            ],
            [
                20508,
                20567
            ],
            [
                20567,
                20589
            ],
            [
                20589,
                20644
            ],
            [
                20644,
                20684
            ],
            [
                20684,
                20690
            ],
            [
                20690,
                20763
            ],
            [
                20763,
                20791
            ],
            [
                20791,
                20796
            ],
            [
                20796,
                20801
            ],
            [
                20801,
                20838
            ],
            [
                20838,
                20902
            ],
            [
                20902,
                21008
            ],
            [
                21008,
                21098
            ],
            [
                21098,
                21144
            ],
            [
                21144,
                21192
            ],
            [
                21192,
                21267
            ],
            [
                21267,
                21273
            ],
            [
                21273,
                21308
            ],
            [
                21308,
                21568
            ],
            [
                21568,
                21757
            ],
            [
                21757,
                21839
            ],
            [
                21839,
                21905
            ],
            [
                21905,
                21932
            ],
            [
                21932,
                21953
            ],
            [
                21953,
                22008
            ],
            [
                22008,
                22076
            ],
            [
                22076,
                22109
            ],
            [
                22109,
                22162
            ],
            [
                22162,
                22207
            ],
            [
                22207,
                22265
            ],
            [
                22265,
                22301
            ],
            [
                22301,
                22397
            ],
            [
                22397,
                22446
            ],
            [
                22446,
                22575
            ],
            [
                22575,
                22789
            ],
            [
                22789,
                22879
            ],
            [
                22879,
                22899
            ],
            [
                22899,
                22930
            ],
            [
                22930,
                22986
            ],
            [
                22986,
                23003
            ],
            [
                23003,
                23027
            ],
            [
                23027,
                23555
            ],
            [
                23555,
                23618
            ],
            [
                23618,
                23650
            ],
            [
                23650,
                23722
            ],
            [
                23722,
                23741
            ],
            [
                23741,
                23903
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                49,
                51
            ],
            [
                57,
                75
            ],
            [
                42,
                48
            ],
            [
                75,
                77
            ],
            [
                77,
                140
            ],
            [
                170,
                220
            ],
            [
                231,
                236
            ],
            [
                271,
                274
            ],
            [
                244,
                248
            ],
            [
                300,
                302
            ],
            [
                302,
                350
            ],
            [
                350,
                458
            ],
            [
                489,
                520
            ],
            [
                520,
                535
            ],
            [
                535,
                575
            ],
            [
                575,
                594
            ],
            [
                594,
                648
            ],
            [
                648,
                710
            ],
            [
                710,
                750
            ],
            [
                750,
                780
            ],
            [
                804,
                807
            ],
            [
                807,
                809
            ],
            [
                815,
                819
            ],
            [
                833,
                867
            ],
            [
                867,
                912
            ],
            [
                1029,
                1079
            ],
            [
                1088,
                1103
            ],
            [
                1136,
                1160
            ],
            [
                1238,
                1316
            ],
            [
                1316,
                1492
            ],
            [
                1492,
                1501
            ],
            [
                1551,
                1617
            ],
            [
                1617,
                1618
            ],
            [
                1622,
                1658
            ],
            [
                1658,
                1673
            ],
            [
                1697,
                1699
            ],
            [
                1788,
                1823
            ],
            [
                1863,
                1902
            ],
            [
                1902,
                1974
            ],
            [
                2198,
                2214
            ],
            [
                2246,
                2248
            ],
            [
                2248,
                2313
            ],
            [
                2313,
                2348
            ],
            [
                2856,
                2864
            ],
            [
                2872,
                3021
            ],
            [
                3027,
                3033
            ],
            [
                3073,
                3125
            ],
            [
                3134,
                3161
            ],
            [
                3279,
                3280
            ],
            [
                3200,
                3204
            ],
            [
                3281,
                3352
            ],
            [
                3434,
                3460
            ],
            [
                3486,
                3498
            ],
            [
                3511,
                3513
            ],
            [
                3522,
                3531
            ],
            [
                3541,
                3585
            ],
            [
                3585,
                3618
            ],
            [
                3618,
                3643
            ],
            [
                3670,
                3705
            ],
            [
                3719,
                3740
            ],
            [
                3755,
                3769
            ],
            [
                3769,
                3931
            ],
            [
                3997,
                3998
            ],
            [
                3980,
                3994
            ],
            [
                3998,
                3999
            ],
            [
                4011,
                4014
            ],
            [
                4016,
                4029
            ],
            [
                4029,
                4031
            ],
            [
                4031,
                4089
            ],
            [
                4120,
                4235
            ],
            [
                4340,
                4355
            ],
            [
                4379,
                4389
            ],
            [
                4399,
                4412
            ],
            [
                4414,
                4493
            ],
            [
                4508,
                4516
            ],
            [
                4516,
                4578
            ],
            [
                4585,
                4589
            ],
            [
                4621,
                4623
            ],
            [
                4623,
                4717
            ],
            [
                4717,
                4764
            ],
            [
                4764,
                4818
            ],
            [
                4818,
                4852
            ],
            [
                4852,
                4896
            ],
            [
                4896,
                4958
            ],
            [
                4987,
                4989
            ],
            [
                4989,
                4999
            ],
            [
                5001,
                5024
            ],
            [
                5024,
                5141
            ],
            [
                5141,
                5147
            ],
            [
                5176,
                5198
            ],
            [
                5198,
                5214
            ],
            [
                5214,
                5273
            ],
            [
                5273,
                5331
            ],
            [
                5336,
                5347
            ],
            [
                5356,
                5359
            ],
            [
                5359,
                5371
            ],
            [
                5464,
                5478
            ],
            [
                5490,
                5582
            ],
            [
                5582,
                5590
            ],
            [
                5614,
                5650
            ],
            [
                5658,
                5688
            ],
            [
                5689,
                5730
            ],
            [
                5730,
                5856
            ],
            [
                5883,
                5920
            ],
            [
                5927,
                5939
            ],
            [
                5939,
                5942
            ],
            [
                5943,
                6002
            ],
            [
                6002,
                6031
            ],
            [
                6041,
                6052
            ],
            [
                6077,
                6129
            ],
            [
                6129,
                6190
            ],
            [
                6260,
                6286
            ],
            [
                6292,
                6304
            ],
            [
                6306,
                6352
            ],
            [
                6383,
                6396
            ],
            [
                6404,
                6445
            ],
            [
                6463,
                6507
            ],
            [
                6531,
                6533
            ],
            [
                6533,
                6625
            ],
            [
                6625,
                6658
            ],
            [
                6658,
                6693
            ],
            [
                6717,
                6733
            ],
            [
                6744,
                6753
            ],
            [
                6753,
                6757
            ],
            [
                6772,
                6797
            ],
            [
                6810,
                6847
            ],
            [
                6766,
                6767
            ],
            [
                6881,
                6908
            ],
            [
                6933,
                6935
            ],
            [
                6935,
                6972
            ],
            [
                6980,
                6984
            ],
            [
                6984,
                7037
            ],
            [
                7081,
                7135
            ],
            [
                7181,
                7211
            ],
            [
                7267,
                7280
            ],
            [
                7300,
                7312
            ],
            [
                7297,
                7299
            ],
            [
                7281,
                7286
            ],
            [
                7317,
                7323
            ],
            [
                7345,
                7387
            ],
            [
                7389,
                7417
            ],
            [
                7430,
                7435
            ],
            [
                7448,
                7480
            ],
            [
                7492,
                7500
            ],
            [
                7508,
                7540
            ],
            [
                7624,
                7625
            ],
            [
                7550,
                7581
            ],
            [
                7583,
                7603
            ],
            [
                7630,
                7632
            ],
            [
                7632,
                7635
            ],
            [
                7643,
                7648
            ],
            [
                7667,
                7677
            ],
            [
                7694,
                7707
            ],
            [
                7767,
                7791
            ],
            [
                7791,
                7807
            ],
            [
                7816,
                7830
            ],
            [
                7846,
                7854
            ],
            [
                7831,
                7842
            ],
            [
                7867,
                7872
            ],
            [
                7877,
                7889
            ],
            [
                7912,
                7914
            ],
            [
                7920,
                7926
            ],
            [
                7926,
                7963
            ],
            [
                7994,
                7996
            ],
            [
                8065,
                8067
            ],
            [
                8072,
                8101
            ],
            [
                8113,
                8123
            ],
            [
                8123,
                8205
            ],
            [
                8205,
                8276
            ],
            [
                8276,
                8305
            ],
            [
                8339,
                8376
            ],
            [
                8376,
                8388
            ],
            [
                8427,
                8428
            ],
            [
                8440,
                8444
            ],
            [
                8582,
                8584
            ],
            [
                8584,
                8600
            ],
            [
                8627,
                8628
            ],
            [
                8643,
                8660
            ],
            [
                8670,
                8707
            ],
            [
                8712,
                8773
            ],
            [
                8811,
                8813
            ],
            [
                8815,
                8841
            ],
            [
                8841,
                8844
            ],
            [
                8855,
                8863
            ],
            [
                8845,
                8851
            ],
            [
                8869,
                8916
            ],
            [
                8934,
                8946
            ],
            [
                8965,
                8989
            ],
            [
                9258,
                9259
            ],
            [
                9010,
                9014
            ],
            [
                9074,
                9077
            ],
            [
                9116,
                9145
            ],
            [
                9204,
                9244
            ],
            [
                9096,
                9099
            ],
            [
                9260,
                9303
            ],
            [
                9303,
                9323
            ],
            [
                9336,
                9343
            ],
            [
                9371,
                9376
            ],
            [
                9376,
                9461
            ],
            [
                9461,
                9471
            ],
            [
                9514,
                9517
            ],
            [
                9498,
                9503
            ],
            [
                9526,
                9531
            ],
            [
                9557,
                9560
            ],
            [
                9569,
                9576
            ],
            [
                9683,
                9713
            ],
            [
                9735,
                9752
            ],
            [
                9757,
                9772
            ],
            [
                9752,
                9753
            ],
            [
                9774,
                9809
            ],
            [
                9821,
                9841
            ],
            [
                9848,
                9866
            ],
            [
                9880,
                9899
            ],
            [
                9899,
                9947
            ],
            [
                9947,
                9962
            ],
            [
                9962,
                9981
            ],
            [
                9992,
                10014
            ],
            [
                10018,
                10025
            ],
            [
                10184,
                10213
            ],
            [
                10224,
                10247
            ],
            [
                10247,
                10263
            ],
            [
                10272,
                10284
            ],
            [
                10284,
                10289
            ],
            [
                10289,
                10335
            ],
            [
                10335,
                10355
            ],
            [
                10355,
                10377
            ],
            [
                10383,
                10426
            ],
            [
                10426,
                10465
            ],
            [
                10547,
                10567
            ],
            [
                10567,
                10634
            ],
            [
                10634,
                10642
            ],
            [
                10657,
                10718
            ],
            [
                10718,
                10789
            ],
            [
                10789,
                10862
            ],
            [
                10967,
                11052
            ],
            [
                11052,
                11053
            ],
            [
                11066,
                11087
            ],
            [
                11095,
                11150
            ],
            [
                11184,
                11198
            ],
            [
                11205,
                11247
            ],
            [
                11198,
                11199
            ],
            [
                11260,
                11264
            ],
            [
                11269,
                11285
            ],
            [
                11285,
                11294
            ],
            [
                11296,
                11298
            ],
            [
                11300,
                11304
            ],
            [
                11321,
                11323
            ],
            [
                11328,
                11332
            ],
            [
                11334,
                11336
            ],
            [
                11386,
                11419
            ],
            [
                11445,
                11500
            ],
            [
                11505,
                11510
            ],
            [
                11542,
                11556
            ],
            [
                11562,
                11569
            ],
            [
                11621,
                11623
            ],
            [
                11623,
                11624
            ],
            [
                11677,
                11679
            ],
            [
                11693,
                11735
            ],
            [
                11742,
                11771
            ],
            [
                11777,
                11796
            ],
            [
                11806,
                11834
            ],
            [
                11834,
                11879
            ],
            [
                11879,
                11880
            ],
            [
                11894,
                11904
            ],
            [
                11904,
                11933
            ],
            [
                11933,
                11948
            ],
            [
                11948,
                11951
            ],
            [
                11953,
                11957
            ],
            [
                11959,
                11976
            ],
            [
                11978,
                11980
            ],
            [
                11981,
                12009
            ],
            [
                12051,
                12062
            ],
            [
                12064,
                12117
            ],
            [
                12117,
                12140
            ],
            [
                12612,
                12622
            ],
            [
                12631,
                12681
            ],
            [
                12766,
                12769
            ],
            [
                12769,
                12782
            ],
            [
                12784,
                12840
            ],
            [
                12853,
                12855
            ],
            [
                12855,
                12874
            ],
            [
                12874,
                12910
            ],
            [
                12910,
                12986
            ],
            [
                13015,
                13085
            ],
            [
                13085,
                13112
            ],
            [
                13131,
                13133
            ],
            [
                13293,
                13324
            ],
            [
                13324,
                13357
            ],
            [
                13357,
                13361
            ],
            [
                13363,
                13416
            ],
            [
                13416,
                13439
            ],
            [
                13439,
                13440
            ],
            [
                13456,
                13468
            ],
            [
                13506,
                13520
            ],
            [
                13534,
                13546
            ],
            [
                13606,
                13629
            ],
            [
                13629,
                13647
            ],
            [
                13661,
                13664
            ],
            [
                13664,
                13669
            ],
            [
                13679,
                13682
            ],
            [
                13687,
                13706
            ],
            [
                13706,
                13711
            ],
            [
                13718,
                13747
            ],
            [
                13747,
                13812
            ],
            [
                13820,
                13831
            ],
            [
                13831,
                13848
            ],
            [
                13848,
                13870
            ],
            [
                13870,
                13897
            ],
            [
                13897,
                13906
            ],
            [
                13908,
                13910
            ],
            [
                13912,
                13956
            ],
            [
                13956,
                13988
            ],
            [
                13988,
                14004
            ],
            [
                14022,
                14043
            ],
            [
                14043,
                14070
            ],
            [
                14070,
                14090
            ],
            [
                14090,
                14120
            ],
            [
                14133,
                14136
            ],
            [
                14136,
                14273
            ],
            [
                14273,
                14292
            ],
            [
                14292,
                14471
            ],
            [
                14479,
                14633
            ],
            [
                14842,
                14853
            ],
            [
                14867,
                14868
            ],
            [
                14879,
                14906
            ],
            [
                14931,
                14973
            ],
            [
                14987,
                15027
            ],
            [
                15034,
                15103
            ],
            [
                15155,
                15157
            ],
            [
                15157,
                15205
            ],
            [
                15226,
                15315
            ],
            [
                15315,
                15338
            ],
            [
                15347,
                15360
            ],
            [
                15393,
                15395
            ],
            [
                15395,
                15522
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15571
            ],
            [
                15571,
                15592
            ],
            [
                15620,
                15667
            ],
            [
                15667,
                15719
            ],
            [
                15719,
                15764
            ],
            [
                15813,
                15815
            ],
            [
                15815,
                15828
            ],
            [
                15830,
                15832
            ],
            [
                15833,
                15868
            ],
            [
                15868,
                15913
            ],
            [
                15916,
                16003
            ],
            [
                16003,
                16024
            ],
            [
                16024,
                16041
            ],
            [
                16115,
                16140
            ],
            [
                16050,
                16064
            ],
            [
                16144,
                16297
            ],
            [
                16312,
                16338
            ],
            [
                16443,
                16445
            ],
            [
                16445,
                16453
            ],
            [
                16460,
                16462
            ],
            [
                16486,
                16513
            ],
            [
                16802,
                16803
            ],
            [
                16846,
                16851
            ],
            [
                16820,
                16828
            ],
            [
                16851,
                16858
            ],
            [
                16858,
                16921
            ],
            [
                16921,
                16922
            ],
            [
                16944,
                17000
            ],
            [
                17020,
                17029
            ],
            [
                17032,
                17082
            ],
            [
                17095,
                17132
            ],
            [
                17132,
                17176
            ],
            [
                17176,
                17189
            ],
            [
                17270,
                17280
            ],
            [
                17190,
                17192
            ],
            [
                17204,
                17217
            ],
            [
                17223,
                17242
            ],
            [
                17243,
                17247
            ],
            [
                17290,
                17323
            ],
            [
                17359,
                17393
            ],
            [
                17393,
                17404
            ],
            [
                17442,
                17445
            ],
            [
                17445,
                17451
            ],
            [
                17460,
                17490
            ],
            [
                17507,
                17603
            ],
            [
                17659,
                17661
            ],
            [
                17661,
                17743
            ],
            [
                17745,
                17785
            ],
            [
                17787,
                17857
            ],
            [
                17900,
                17903
            ],
            [
                17903,
                17939
            ],
            [
                17944,
                17950
            ],
            [
                18006,
                18013
            ],
            [
                18014,
                18039
            ],
            [
                18064,
                18086
            ],
            [
                18105,
                18107
            ],
            [
                18107,
                18165
            ],
            [
                18261,
                18263
            ],
            [
                18272,
                18310
            ],
            [
                18326,
                18366
            ],
            [
                18366,
                18444
            ],
            [
                18444,
                18510
            ],
            [
                18510,
                18511
            ],
            [
                18591,
                18616
            ],
            [
                18616,
                18725
            ],
            [
                18788,
                18803
            ],
            [
                18774,
                18779
            ],
            [
                18783,
                18786
            ],
            [
                18737,
                18741
            ],
            [
                18804,
                18836
            ],
            [
                18836,
                18840
            ],
            [
                18932,
                18959
            ],
            [
                18864,
                18880
            ],
            [
                18914,
                18915
            ],
            [
                18882,
                18883
            ],
            [
                18970,
                19000
            ],
            [
                19009,
                19043
            ],
            [
                19070,
                19105
            ],
            [
                19114,
                19117
            ],
            [
                19119,
                19148
            ],
            [
                19189,
                19191
            ],
            [
                19191,
                19206
            ],
            [
                19214,
                19222
            ],
            [
                19222,
                19293
            ],
            [
                19293,
                19310
            ],
            [
                19310,
                19357
            ],
            [
                19357,
                19389
            ],
            [
                19389,
                19401
            ],
            [
                19401,
                19426
            ],
            [
                19426,
                19510
            ],
            [
                19510,
                19611
            ],
            [
                19644,
                19682
            ],
            [
                19710,
                19763
            ],
            [
                19763,
                19853
            ],
            [
                19853,
                19892
            ],
            [
                19892,
                19917
            ],
            [
                19930,
                19933
            ],
            [
                19933,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20011
            ],
            [
                20015,
                20024
            ],
            [
                20072,
                20075
            ],
            [
                20075,
                20183
            ],
            [
                20183,
                20231
            ],
            [
                20231,
                20251
            ],
            [
                20251,
                20339
            ],
            [
                20339,
                20355
            ],
            [
                20355,
                20378
            ],
            [
                20450,
                20458
            ],
            [
                20460,
                20463
            ],
            [
                20472,
                20508
            ],
            [
                20508,
                20567
            ],
            [
                20567,
                20589
            ],
            [
                20589,
                20596
            ],
            [
                20607,
                20644
            ],
            [
                20644,
                20684
            ],
            [
                20684,
                20690
            ],
            [
                20690,
                20730
            ],
            [
                20761,
                20763
            ],
            [
                20763,
                20791
            ],
            [
                20791,
                20796
            ],
            [
                20796,
                20801
            ],
            [
                20801,
                20837
            ],
            [
                20902,
                21008
            ],
            [
                21008,
                21098
            ],
            [
                21118,
                21128
            ],
            [
                21147,
                21192
            ],
            [
                21192,
                21204
            ],
            [
                21206,
                21210
            ],
            [
                21212,
                21267
            ],
            [
                21276,
                21306
            ],
            [
                21306,
                21308
            ],
            [
                21308,
                21540
            ],
            [
                21556,
                21568
            ],
            [
                21568,
                21602
            ],
            [
                21628,
                21669
            ],
            [
                21905,
                21910
            ],
            [
                21916,
                21932
            ],
            [
                21932,
                21953
            ],
            [
                22017,
                22057
            ],
            [
                22074,
                22076
            ],
            [
                22076,
                22109
            ],
            [
                22109,
                22162
            ],
            [
                22162,
                22207
            ],
            [
                22207,
                22219
            ],
            [
                22233,
                22265
            ],
            [
                22265,
                22301
            ],
            [
                22301,
                22397
            ],
            [
                22397,
                22446
            ],
            [
                22446,
                22496
            ],
            [
                22512,
                22533
            ],
            [
                22573,
                22575
            ],
            [
                22607,
                22628
            ],
            [
                22636,
                22670
            ],
            [
                22689,
                22789
            ],
            [
                22838,
                22862
            ],
            [
                22789,
                22791
            ],
            [
                22863,
                22879
            ],
            [
                22879,
                22899
            ],
            [
                22899,
                22930
            ],
            [
                22930,
                22986
            ],
            [
                22986,
                23003
            ],
            [
                23003,
                23027
            ],
            [
                23027,
                23168
            ],
            [
                23227,
                23259
            ],
            [
                23272,
                23295
            ],
            [
                23299,
                23306
            ],
            [
                23319,
                23397
            ],
            [
                23405,
                23440
            ],
            [
                23449,
                23521
            ],
            [
                23534,
                23555
            ],
            [
                23555,
                23618
            ],
            [
                23618,
                23650
            ],
            [
                23650,
                23657
            ],
            [
                23672,
                23678
            ],
            [
                23663,
                23666
            ],
            [
                23678,
                23722
            ],
            [
                23722,
                23741
            ],
            [
                23741,
                23767
            ],
            [
                23770,
                23787
            ],
            [
                23790,
                23820
            ],
            [
                23830,
                23903
            ]
        ],
        "row_chars": [
            [
                0,
                77
            ],
            [
                77,
                302
            ],
            [
                302,
                350
            ],
            [
                350,
                459
            ],
            [
                459,
                489
            ],
            [
                489,
                520
            ],
            [
                520,
                535
            ],
            [
                535,
                575
            ],
            [
                575,
                594
            ],
            [
                594,
                648
            ],
            [
                648,
                710
            ],
            [
                710,
                750
            ],
            [
                750,
                807
            ],
            [
                807,
                867
            ],
            [
                867,
                912
            ],
            [
                912,
                987
            ],
            [
                987,
                1029
            ],
            [
                1029,
                1160
            ],
            [
                1160,
                1238
            ],
            [
                1238,
                1316
            ],
            [
                1316,
                1492
            ],
            [
                1492,
                1617
            ],
            [
                1617,
                1658
            ],
            [
                1658,
                1673
            ],
            [
                1673,
                1687
            ],
            [
                1687,
                1697
            ],
            [
                1697,
                1740
            ],
            [
                1740,
                1788
            ],
            [
                1788,
                1823
            ],
            [
                1823,
                1863
            ],
            [
                1863,
                1902
            ],
            [
                1902,
                1974
            ],
            [
                1974,
                2127
            ],
            [
                2127,
                2248
            ],
            [
                2248,
                2313
            ],
            [
                2313,
                2348
            ],
            [
                2348,
                2378
            ],
            [
                2378,
                2826
            ],
            [
                2826,
                2856
            ],
            [
                2856,
                3027
            ],
            [
                3027,
                3048
            ],
            [
                3048,
                3073
            ],
            [
                3073,
                3585
            ],
            [
                3585,
                3618
            ],
            [
                3618,
                3769
            ],
            [
                3769,
                3933
            ],
            [
                3933,
                4031
            ],
            [
                4031,
                4235
            ],
            [
                4235,
                4340
            ],
            [
                4340,
                4516
            ],
            [
                4516,
                4623
            ],
            [
                4623,
                4717
            ],
            [
                4717,
                4764
            ],
            [
                4764,
                4818
            ],
            [
                4818,
                4852
            ],
            [
                4852,
                4896
            ],
            [
                4896,
                4989
            ],
            [
                4989,
                5024
            ],
            [
                5024,
                5141
            ],
            [
                5141,
                5198
            ],
            [
                5198,
                5214
            ],
            [
                5214,
                5273
            ],
            [
                5273,
                5359
            ],
            [
                5359,
                5582
            ],
            [
                5582,
                5689
            ],
            [
                5689,
                5730
            ],
            [
                5730,
                5939
            ],
            [
                5939,
                6002
            ],
            [
                6002,
                6052
            ],
            [
                6052,
                6077
            ],
            [
                6077,
                6129
            ],
            [
                6129,
                6533
            ],
            [
                6533,
                6625
            ],
            [
                6625,
                6658
            ],
            [
                6658,
                6753
            ],
            [
                6753,
                6935
            ],
            [
                6935,
                6984
            ],
            [
                6984,
                7037
            ],
            [
                7037,
                7081
            ],
            [
                7081,
                7213
            ],
            [
                7213,
                7267
            ],
            [
                7267,
                7417
            ],
            [
                7417,
                7430
            ],
            [
                7430,
                7632
            ],
            [
                7632,
                7677
            ],
            [
                7677,
                7791
            ],
            [
                7791,
                7926
            ],
            [
                7926,
                7996
            ],
            [
                7996,
                8065
            ],
            [
                8065,
                8123
            ],
            [
                8123,
                8205
            ],
            [
                8205,
                8276
            ],
            [
                8276,
                8306
            ],
            [
                8306,
                8339
            ],
            [
                8339,
                8376
            ],
            [
                8376,
                8584
            ],
            [
                8584,
                8841
            ],
            [
                8841,
                9260
            ],
            [
                9260,
                9303
            ],
            [
                9303,
                9376
            ],
            [
                9376,
                9461
            ],
            [
                9461,
                9576
            ],
            [
                9576,
                9683
            ],
            [
                9683,
                9899
            ],
            [
                9899,
                9947
            ],
            [
                9947,
                9962
            ],
            [
                9962,
                10028
            ],
            [
                10028,
                10056
            ],
            [
                10056,
                10103
            ],
            [
                10103,
                10184
            ],
            [
                10184,
                10247
            ],
            [
                10247,
                10284
            ],
            [
                10284,
                10289
            ],
            [
                10289,
                10335
            ],
            [
                10335,
                10355
            ],
            [
                10355,
                10426
            ],
            [
                10426,
                10465
            ],
            [
                10465,
                10547
            ],
            [
                10547,
                10567
            ],
            [
                10567,
                10634
            ],
            [
                10634,
                10718
            ],
            [
                10718,
                10789
            ],
            [
                10789,
                10862
            ],
            [
                10862,
                11052
            ],
            [
                11052,
                11087
            ],
            [
                11087,
                11150
            ],
            [
                11150,
                11184
            ],
            [
                11184,
                11285
            ],
            [
                11285,
                11386
            ],
            [
                11386,
                11623
            ],
            [
                11623,
                11834
            ],
            [
                11834,
                11879
            ],
            [
                11879,
                11904
            ],
            [
                11904,
                11933
            ],
            [
                11933,
                11948
            ],
            [
                11948,
                12117
            ],
            [
                12117,
                12140
            ],
            [
                12140,
                12290
            ],
            [
                12290,
                12361
            ],
            [
                12361,
                12396
            ],
            [
                12396,
                12471
            ],
            [
                12471,
                12601
            ],
            [
                12601,
                12769
            ],
            [
                12769,
                12855
            ],
            [
                12855,
                12874
            ],
            [
                12874,
                12910
            ],
            [
                12910,
                13085
            ],
            [
                13085,
                13133
            ],
            [
                13133,
                13293
            ],
            [
                13293,
                13324
            ],
            [
                13324,
                13357
            ],
            [
                13357,
                13416
            ],
            [
                13416,
                13439
            ],
            [
                13439,
                13486
            ],
            [
                13486,
                13548
            ],
            [
                13548,
                13606
            ],
            [
                13606,
                13629
            ],
            [
                13629,
                13664
            ],
            [
                13664,
                13669
            ],
            [
                13669,
                13706
            ],
            [
                13706,
                13747
            ],
            [
                13747,
                13831
            ],
            [
                13831,
                13848
            ],
            [
                13848,
                13870
            ],
            [
                13870,
                13897
            ],
            [
                13897,
                13956
            ],
            [
                13956,
                13988
            ],
            [
                13988,
                14043
            ],
            [
                14043,
                14070
            ],
            [
                14070,
                14090
            ],
            [
                14090,
                14136
            ],
            [
                14136,
                14273
            ],
            [
                14273,
                14292
            ],
            [
                14292,
                14633
            ],
            [
                14633,
                14842
            ],
            [
                14842,
                14906
            ],
            [
                14906,
                15157
            ],
            [
                15157,
                15315
            ],
            [
                15315,
                15395
            ],
            [
                15395,
                15522
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15571
            ],
            [
                15571,
                15592
            ],
            [
                15592,
                15620
            ],
            [
                15620,
                15667
            ],
            [
                15667,
                15719
            ],
            [
                15719,
                15815
            ],
            [
                15815,
                15868
            ],
            [
                15868,
                16003
            ],
            [
                16003,
                16024
            ],
            [
                16024,
                16445
            ],
            [
                16445,
                16513
            ],
            [
                16513,
                16522
            ],
            [
                16522,
                16574
            ],
            [
                16574,
                16605
            ],
            [
                16605,
                16698
            ],
            [
                16698,
                16730
            ],
            [
                16730,
                16802
            ],
            [
                16802,
                16858
            ],
            [
                16858,
                16921
            ],
            [
                16921,
                17032
            ],
            [
                17032,
                17132
            ],
            [
                17132,
                17176
            ],
            [
                17176,
                17290
            ],
            [
                17290,
                17393
            ],
            [
                17393,
                17445
            ],
            [
                17445,
                17661
            ],
            [
                17661,
                17903
            ],
            [
                17903,
                18107
            ],
            [
                18107,
                18366
            ],
            [
                18366,
                18444
            ],
            [
                18444,
                18510
            ],
            [
                18510,
                18616
            ],
            [
                18616,
                18725
            ],
            [
                18725,
                18836
            ],
            [
                18836,
                19191
            ],
            [
                19191,
                19222
            ],
            [
                19222,
                19293
            ],
            [
                19293,
                19310
            ],
            [
                19310,
                19357
            ],
            [
                19357,
                19389
            ],
            [
                19389,
                19401
            ],
            [
                19401,
                19426
            ],
            [
                19426,
                19510
            ],
            [
                19510,
                19685
            ],
            [
                19685,
                19708
            ],
            [
                19708,
                19763
            ],
            [
                19763,
                19853
            ],
            [
                19853,
                19892
            ],
            [
                19892,
                19933
            ],
            [
                19933,
                19954
            ],
            [
                19954,
                19995
            ],
            [
                19995,
                20075
            ],
            [
                20075,
                20183
            ],
            [
                20183,
                20231
            ],
            [
                20231,
                20251
            ],
            [
                20251,
                20339
            ],
            [
                20339,
                20355
            ],
            [
                20355,
                20380
            ],
            [
                20380,
                20404
            ],
            [
                20404,
                20508
            ],
            [
                20508,
                20567
            ],
            [
                20567,
                20589
            ],
            [
                20589,
                20644
            ],
            [
                20644,
                20684
            ],
            [
                20684,
                20690
            ],
            [
                20690,
                20763
            ],
            [
                20763,
                20791
            ],
            [
                20791,
                20796
            ],
            [
                20796,
                20801
            ],
            [
                20801,
                20838
            ],
            [
                20838,
                20902
            ],
            [
                20902,
                21008
            ],
            [
                21008,
                21098
            ],
            [
                21098,
                21192
            ],
            [
                21192,
                21267
            ],
            [
                21267,
                21273
            ],
            [
                21273,
                21308
            ],
            [
                21308,
                21568
            ],
            [
                21568,
                21757
            ],
            [
                21757,
                21839
            ],
            [
                21839,
                21905
            ],
            [
                21905,
                21932
            ],
            [
                21932,
                21953
            ],
            [
                21953,
                22076
            ],
            [
                22076,
                22109
            ],
            [
                22109,
                22162
            ],
            [
                22162,
                22207
            ],
            [
                22207,
                22265
            ],
            [
                22265,
                22301
            ],
            [
                22301,
                22397
            ],
            [
                22397,
                22446
            ],
            [
                22446,
                22575
            ],
            [
                22575,
                22789
            ],
            [
                22789,
                22879
            ],
            [
                22879,
                22899
            ],
            [
                22899,
                22930
            ],
            [
                22930,
                22986
            ],
            [
                22986,
                23003
            ],
            [
                23003,
                23027
            ],
            [
                23027,
                23555
            ],
            [
                23555,
                23618
            ],
            [
                23618,
                23650
            ],
            [
                23650,
                23722
            ],
            [
                23722,
                23741
            ],
            [
                23741,
                23903
            ]
        ]
    },
    "abridged": {
        "text": "The evening was still and warm; it promised to become sultry. Round the descending sun the clouds glowed purple; summer tints suffused the horizon, and cast rosy reflections on house and tree. The two girls came down from the fields slowly. By the time they reached the churchyard the bells were hushed; the multitudes were gathered into the church.\n\"How pleasant and calm it is!\" said Caroline.\n\"And how hot it will be in the church!\" responded Shirley. \"And what a dreary long speech Dr. Boultby will make! And how the curates will hammer over their prepared orations! For my part, I would rather not enter.\"\n\"But my uncle will be angry if we are absent.\"\n\"I can bear his wrath; he will not devour me. I shall be sorry to miss his pungent speech. I shall be sorry also to deprive you of Mr. Hall's friendly homily; but here I must stay. Nature is now at her evening prayers; she is kneeling before those red hills. I see her prostrate on the great steps of her altar, praying for a fair night for mariners at sea, for travellers in deserts, for lambs on moors, and unfledged birds in woods. Caroline, she is like what Eve was when she and Adam stood alone on earth.\"\n\"That is not Milton's Eve, Shirley.\"\n\"Milton's Eve! No. Milton was great; but was he good? He saw heaven; he looked down on hell. He saw Satan, and Sin his daughter, and Death their horrible offspring. He saw the tarnished armies of devils. Milton tried to see the first woman; but, Cary, he saw her not.\"\n\"You are bold to say so, Shirley.\"\n\"I would remind him that the first men of the earth were Titans, and that Eve was their mother; from her sprang Saturn, Hyperion, Oceanus; she bore Prometheus-\"\n\"Pagan!\"\n\"I say, there were giants on the earth in those days - giants that strove to scale heaven, with the strength which could bear a thousand years of bondage, the vitality and uncorrupted excellence which, after millennia of struggles, could conceive and bring forth a Messiah. The first woman was heaven-born. Vast was the heart whence came the blood of nations, and grand the head where rested the crown of creation.\"\n\"She coveted an apple, and was cheated by a snake; but you have got such a hash of Scripture and mythology into your head that there is no making any sense of you.\"\n\"On those hills I see a woman-Titan,\" announced Shirley. \"Her robe of blue air spreads to the outskirts of the heath; a veil white as an avalanche sweeps from her head to her feet, and arabesques of lightning flame on its borders. Her steady eyes are clear, as deep as lakes; they are lifted and full of worship, they tremble with the softness of love and prayer. Her forehead has the expanse of a cloud, and is paler than the moon. She reclines her bosom on the ridge of Stilbro' Moor; her mighty hands are joined beneath it. So kneeling, face to face she speaks with God. That Eve is Jehovah's daughter, as Adam was His son.\"\n\"She is very vague and visionary. Come, Shirley, we ought to go into church.\"\n\"Caroline, I will not; I will stay out here with my mother Eve. I love her - undying, mighty being! Heaven may have faded from her brow when she fell in paradise, but all that is glorious on earth shines there still. She is showing me her heart. Hush, Caroline! You will see her and feel as I do, if we are both silent.\"\n\"I will humour your whim; but you will begin talking again within ten minutes.\"\nMiss Keeldar leaned against a headstone; she fixed her eyes on the deep-burning west, and sank into a pleasurable trance. Caroline paced to and fro beneath the rectory wall, dreaming too in her way.\nShirley had mentioned the word \"mother.\" That word suggested to Caroline's imagination not the mighty and mystical parent of Shirley's visions, but a gentle human form - her own mother, unknown, unloved, but longed for.\n\"Oh, that the day would come when she would remember her child! Oh that I might know her, and love her!\"\nThe longing of her childhood filled her soul again. The desire which many a night had kept her awake in her crib, relit suddenly, and glowed in her heart: that her mother might come some happy day, and look upon her with loving eyes, and say to her tenderly, \"Caroline, my child, I have a home for you. All the love you have needed, and not tasted, from infancy, I have saved for you carefully. Come; it shall cherish you now.\"\nA noise on the road roused Caroline and Shirley from their visions. They heard the tramp of horses, and saw a glitter through the trees, glimpses of martial scarlet. Silent and orderly, six soldiers rode by.\n\"The same we saw this afternoon,\" whispered Shirley. \"They wish to be as little noticed as possible, and are moving while the people are at church.\"\nScarcely were the soldiers out of sight, when a different disturbance broke the night-hush - a child's impatient scream. A man came out of the church, carrying in his arms a robust little boy of some two years old - roaring with all the power of his lungs; he had probably just awoken. Two small girls followed. The fresh air soon quieted the child. The man sat down, dandling him tenderly on his knee; the little girls sat on either side.\n\"Good-evening, William,\" said Shirley. He took off his hat, and grinned in pleasure. He was a rough-headed, hard-featured personage, not old, but very weather-beaten. His attire was decent and clean; that of his children singularly neat. It was our old friend Farren.\n\"You are not going into the church?\" he inquired, a little bashfully. Before gentlemen, William was often dogged; with proud or insolent ladies, he was quite unmanageable, sometimes very resentful; but he responded to good-humour and civility. His stubborn nature was repelled by inflexibility in other natures; so he had never liked his former master, Moore. Unaware that Moore had recommended him as gardener to Mr. Yorke, he continued to harbour a grudge against him.\nLatterly he had often worked at Fieldhead. Miss Keeldar's frank manners charmed him. Caroline he had known from her childhood; unconsciously she was his ideal of a lady. Her gentle manner and grace moved his heart. Both the ladies liked William; they delighted to lend him books and give him plants, and they preferred his conversation over that of many coarse, pretentious people much higher in station.\n\"Who was speaking, William, when you came out?\" asked Shirley.\n\"A gentleman ye set much store on, Miss Shirley - Mr. Donne. You look raight down scornful when Mr. Donne is by.\"\n\"Do you like him, William?\"\n\"Me? I'm stalled o' t' curates, and so is t' wife. They've no manners. They talk to poor folk as if they thought they were beneath them. They're allus magnifying their office. I fair hate pride.\"\n\"But you are proud in your own way yourself,\" interposed Caroline. \"You are house-proud: you like to have everything handsome about you. Sometimes you look as if you were almost too proud to take your wages. When you were out of work, you were too proud to get anything on credit. When I wanted to give you something, what a difficulty I had in making you take it!\"\n\"True, Miss Caroline. I'd rather give than take, especially from sich as ye. Ye're a little, slender lass, and I'm a great strong man, more than twice your age. It is not my part to take fro' ye. And that day ye came to our house, and offered me five shillings, which I doubt ye could spare - that day I war a rebel. I war ashamed to be i' such a condition that a young cratur the age o' my own eldest lass should think it needful to offer me her bit o' brass.\"\n\"I suppose you were angry with me, William?\"\n\"In a way. But I forgave ye varry soon. Ye meant well. Ay, I am proud, and so are ye; but your pride and mine is clean pride - such as Mr. Malone and Mr. Donne knows nought about. Theirs is mucky pride. They can hardly speak a civil word to them they think beneath them.\"\n\"Now, William,\" said Shirley. \"be humble enough to tell me truly how you are getting on. Are you well off?\"\n\"Miss Shirley, I am varry well off. Since I got into t' gardening line, wi' Mr. Yorke's help, and since Mr. Hall helped my wife to set up a bit of a shop, I've nought to complain of. My family has plenty to eat. But t' neighbours is poor yet. I see a great deal of distress.\"\n\"And consequently, there is still discontent, I suppose?\" inquired Miss Keeldar.\n\"Ye say right. Starving folk cannot be settled folk.\"\n\"But what can be done? What more can I do?\"\n\"Do? Not much, poor young lass! Ye've given your brass; ye've done well. If ye could transport your tenant, Mr. Moore, to Botany Bay, ye'd do better. Folks hate him.\"\n\"William, for shame!\" exclaimed Caroline warmly. \"If folks do hate him, it is to their disgrace, not his. Mr. Moore himself hates nobody. He only wants to maintain his rights. You are wrong to talk so.\"\n\"I talk as I think. He has a cold, unfeeling heart.\"\n\"But,\" interposed Shirley, \"supposing Moore was driven from the country, and his mill razed to the ground, would people have more work?\"\n\"They'd have less. I know that, and they know that; and there is many an honest lad driven desperate by the certainty that whichever way he turns he cannot better himself; and there is dishonest men aplenty to guide them to the devil, scoundrels that reckons to be the 'people's friends,' and that knows nought about the people, and is as insincere as Lucifer. Human natur' is nought but selfishness. It is but just an exception here and there, sich as ye two young uns and me, that, though in a different sphere, can understand t' one t' other, and be friends. Them that reckons to be friends to a lower class from political motives is never to be trusted; they always try to make their inferiors tools. For my own part, I will not be patronized. I've had overtures made to me lately that I saw were treacherous, and I flung 'em back i' the faces o' them that offered 'em.\"\n\"You won't tell us what overtures?\"\n\"I will not. It would do no good. Them they concerned can look after theirseln.\"\n\"Ay, we'se look after werseln,\" said another voice. Joe Scott had sauntered forth from the church.\n\"I'll warrant ye, Joe,\" observed William, smiling.\n\"And I'll warrant my maister,\" was the answer. \"Young ladies,\" continued Joe, assuming a lordly air, \"ye'd better go into th' house.\"\n\"I wonder what for?\" inquired Shirley, who was often at war with the overlooker; for Joe, holding supercilious theories about women in general, resented greatly, in his secret soul, the fact of his master and his master's mill being under petticoat government.\n\"Because politics is not fit for women to be consarned in.\"\n\"But I study politics, Joe. Do you know I see a newspaper every day, and two of a Sunday?\"\n\"To read the marriages, probably, miss, and the murders, and sich like.\"\n\"I read the leading articles, Joe, and the foreign news, and I look over the market prices. In short, I read just what gentlemen read.\"\nJoe looked as disdainful as if this talk was the chattering of a magpie.\n\"Joe,\" continued Miss Keeldar, \"I cannot work out whether you are a Whig or a Tory. Pray, which are you?\"\n\"It is rather difficult to explain where you won't be understood,\" was Joe's haughty response; \"but as to being a Tory, I'd as soon be an old woman. It is the Tories that carries on the war and ruins trade; and if I be of any party - though political parties is all nonsense - I'm of that which is most favourable to peace, and, by consequence, to business.\"\n\"So am I, Joe,\" replied Shirley, who rather enjoyed talking to him on subjects with which he thought women had no right to meddle. \"I have rather a leaning to the agricultural interest, too; if some of my income comes from Hollow's Mill, more comes from the landed estate around it. It would not do to take any measures injurious to the farmers, Joe, I think?\"\n\"The dews at this hour is unwholesome for females,\" observed Joe.\n\"I am impervious to cold. I should not mind taking my turn to watch the mill one of these summer nights, armed with your musket, Joe.\"\nAt this speech, Joe poked out his chin some inches farther than usual.\n\"But I cannot get out of my head,\" she proceeded, \"an idea that we manufacturers and people of business are sometimes a little selfish and short-sighted in our views, and too regardless of human suffering. Don't you agree, Joe?\"\n\"I cannot argue where I cannot be comprehended,\" was again the answer.\n\"Man of mystery! Your master will argue with me sometimes, Joe. He is not so stiff as you are.\"\n\"Maybe not. We've all our own ways.\"\n\"Joe, do you seriously think all the wisdom in the world is lodged in male skulls?\"\n\"I think that women are a kittle and a froward generation; and I've a great respect for the doctrines of St. Paul's first Epistle to Timothy. 'Let the woman learn in silence, with all subjection. I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. For Adam was first formed, then Eve.'\"\n\"What has that to do with it?\" interjected Shirley. \"That smacks of rights of primogeniture. I'll bring it up with Mr. Yorke.\"\n\"And,\" continued Joe Scott, \"Adam was not deceived, but the woman being deceived was in the transgression.\"\n\"More shame to Adam to sin with his eyes open!\" cried Miss Keeldar. \"To confess the honest truth, Joe, I never was easy in my mind concerning that chapter. It puzzles me.\"\n\"It is very plain, miss.\"\nCaroline now joined in the dialogue for the first time. \"You allow the right of private judgment, I suppose, Joe?\"\n\"My certy, that I do! I allow it for every line of the holy Book.\"\n\"Women may exercise it as well as men?\"\n\"Nay. Women is to take their husbands' opinion. It's wholesomest for them.\"\n\"Oh! oh!\" exclaimed both Shirley and Caroline. \"Consider yourself groaned down, and cried shame over, for such a stupid observation,\" said Miss Keeldar. \"You might as well say men are to take the opinions of their priests without examination. Such a religion would be mere blind, besotted superstition.\"\n\"And what is your reading, Miss Helstone, o' these words o' St. Paul's?\"\n\"I account for them in this way,\" said Caroline. \"He wrote that chapter for a particular congregation of Christians, under peculiar circumstances; and besides, I dare say, if I could read the original Greek, I should find that many of the words have been wrongly translated, perhaps misunderstood altogether. It would be possible, I doubt not, to give the passage quite a contrary turn.\"\n\"That won't wash, miss.\"\n\"I dare say it will. Joe, you are a thoroughly dogmatical person. I like William better than you.\"\n\"Joe is well enough in his own house,\" said Shirley. \"I have seen him as quiet as a lamb at home. There is not a kinder husband in Briarfield. He does not dogmatize to his wife.\"\n\"My wife is a hard-working, plain woman; time and trouble has ta'en all the conceit out of her. But that is not the case with you, young misses. And then you reckon to have so much knowledge; and it's only superficial. One day Miss Caroline came into our counting-house when I war behind t' great desk, and she didn't see me, and she brought a slate wi' a sum on it to t' maister. Uur Harry would have settled it i' two minutes. She couldn't do it. Mr. Moore had to show her how. And when he did show her, she couldn't understand him.\"\n\"Nonsense, Joe!\"\n\"Nay, it's no nonsense. And Miss Shirley there reckons to hearken to t' maister when he's talking ower trade, so attentive like, as if she followed him word for word; and all t' while she's peeping out o' t' window to see t' mare; and then looking at a bit of a splash on her riding-skirt; and then glancing round at wer counting-house cobwebs, and thinking what mucky folk we are, and what a grand ride she'll have ower Nunnely Common. She hears no more o' Mr. Moore's talk nor if he spake Hebrew.\"\n\"Joe, you are a real slanderer. I would answer you, only the people are coming out of church. We must leave you. Man of prejudice, good-bye. William, good-bye. Children, come up to Fieldhead tomorrow, and you shall choose what you like best out of Mrs. Gill's store-room.\"",
        "paragraph_chars": [
            [
                0,
                350
            ],
            [
                350,
                396
            ],
            [
                396,
                611
            ],
            [
                611,
                658
            ],
            [
                658,
                1169
            ],
            [
                1169,
                1206
            ],
            [
                1206,
                1475
            ],
            [
                1475,
                1510
            ],
            [
                1510,
                1671
            ],
            [
                1671,
                1680
            ],
            [
                1680,
                2096
            ],
            [
                2096,
                2261
            ],
            [
                2261,
                2889
            ],
            [
                2889,
                2967
            ],
            [
                2967,
                3288
            ],
            [
                3288,
                3368
            ],
            [
                3368,
                3567
            ],
            [
                3567,
                3787
            ],
            [
                3787,
                3892
            ],
            [
                3892,
                4320
            ],
            [
                4320,
                4528
            ],
            [
                4528,
                4677
            ],
            [
                4677,
                5117
            ],
            [
                5117,
                5385
            ],
            [
                5385,
                5856
            ],
            [
                5856,
                6261
            ],
            [
                6261,
                6324
            ],
            [
                6324,
                6438
            ],
            [
                6438,
                6466
            ],
            [
                6466,
                6662
            ],
            [
                6662,
                7028
            ],
            [
                7028,
                7490
            ],
            [
                7490,
                7535
            ],
            [
                7535,
                7807
            ],
            [
                7807,
                7915
            ],
            [
                7915,
                8191
            ],
            [
                8191,
                8272
            ],
            [
                8272,
                8326
            ],
            [
                8326,
                8370
            ],
            [
                8370,
                8537
            ],
            [
                8537,
                8740
            ],
            [
                8740,
                8793
            ],
            [
                8793,
                8930
            ],
            [
                8930,
                9805
            ],
            [
                9805,
                9841
            ],
            [
                9841,
                9922
            ],
            [
                9922,
                10021
            ],
            [
                10021,
                10072
            ],
            [
                10072,
                10206
            ],
            [
                10206,
                10467
            ],
            [
                10467,
                10527
            ],
            [
                10527,
                10618
            ],
            [
                10618,
                10691
            ],
            [
                10691,
                10827
            ],
            [
                10827,
                10900
            ],
            [
                10900,
                11006
            ],
            [
                11006,
                11365
            ],
            [
                11365,
                11726
            ],
            [
                11726,
                11792
            ],
            [
                11792,
                11927
            ],
            [
                11927,
                11998
            ],
            [
                11998,
                12227
            ],
            [
                12227,
                12298
            ],
            [
                12298,
                12394
            ],
            [
                12394,
                12431
            ],
            [
                12431,
                12515
            ],
            [
                12515,
                12840
            ],
            [
                12840,
                12967
            ],
            [
                12967,
                13075
            ],
            [
                13075,
                13247
            ],
            [
                13247,
                13273
            ],
            [
                13273,
                13388
            ],
            [
                13388,
                13455
            ],
            [
                13455,
                13495
            ],
            [
                13495,
                13571
            ],
            [
                13571,
                13875
            ],
            [
                13875,
                13948
            ],
            [
                13948,
                14336
            ],
            [
                14336,
                14361
            ],
            [
                14361,
                14460
            ],
            [
                14460,
                14639
            ],
            [
                14639,
                15175
            ],
            [
                15175,
                15192
            ],
            [
                15192,
                15692
            ],
            [
                15692,
                15964
            ]
        ],
        "segment_chars": [
            [
                0,
                62
            ],
            [
                62,
                193
            ],
            [
                193,
                241
            ],
            [
                241,
                350
            ],
            [
                350,
                381
            ],
            [
                381,
                396
            ],
            [
                396,
                436
            ],
            [
                436,
                455
            ],
            [
                455,
                509
            ],
            [
                509,
                571
            ],
            [
                571,
                611
            ],
            [
                611,
                658
            ],
            [
                658,
                704
            ],
            [
                704,
                749
            ],
            [
                749,
                839
            ],
            [
                839,
                917
            ],
            [
                917,
                1093
            ],
            [
                1093,
                1169
            ],
            [
                1169,
                1206
            ],
            [
                1206,
                1221
            ],
            [
                1221,
                1225
            ],
            [
                1225,
                1260
            ],
            [
                1260,
                1299
            ],
            [
                1299,
                1371
            ],
            [
                1371,
                1410
            ],
            [
                1410,
                1475
            ],
            [
                1475,
                1510
            ],
            [
                1510,
                1671
            ],
            [
                1671,
                1680
            ],
            [
                1680,
                1954
            ],
            [
                1954,
                1987
            ],
            [
                1987,
                2096
            ],
            [
                2096,
                2261
            ],
            [
                2261,
                2318
            ],
            [
                2318,
                2492
            ],
            [
                2492,
                2625
            ],
            [
                2625,
                2694
            ],
            [
                2694,
                2788
            ],
            [
                2788,
                2835
            ],
            [
                2835,
                2889
            ],
            [
                2889,
                2923
            ],
            [
                2923,
                2967
            ],
            [
                2967,
                3031
            ],
            [
                3031,
                3067
            ],
            [
                3067,
                3184
            ],
            [
                3184,
                3213
            ],
            [
                3213,
                3229
            ],
            [
                3229,
                3288
            ],
            [
                3288,
                3368
            ],
            [
                3368,
                3490
            ],
            [
                3490,
                3567
            ],
            [
                3567,
                3608
            ],
            [
                3608,
                3787
            ],
            [
                3787,
                3851
            ],
            [
                3851,
                3892
            ],
            [
                3892,
                3944
            ],
            [
                3944,
                4195
            ],
            [
                4195,
                4287
            ],
            [
                4287,
                4320
            ],
            [
                4320,
                4388
            ],
            [
                4388,
                4486
            ],
            [
                4486,
                4528
            ],
            [
                4528,
                4581
            ],
            [
                4581,
                4677
            ],
            [
                4677,
                4798
            ],
            [
                4798,
                4963
            ],
            [
                4963,
                4989
            ],
            [
                4989,
                5027
            ],
            [
                5027,
                5117
            ],
            [
                5117,
                5156
            ],
            [
                5156,
                5202
            ],
            [
                5202,
                5284
            ],
            [
                5284,
                5355
            ],
            [
                5355,
                5385
            ],
            [
                5385,
                5422
            ],
            [
                5422,
                5455
            ],
            [
                5455,
                5629
            ],
            [
                5629,
                5745
            ],
            [
                5745,
                5856
            ],
            [
                5856,
                5899
            ],
            [
                5899,
                5941
            ],
            [
                5941,
                6026
            ],
            [
                6026,
                6071
            ],
            [
                6071,
                6261
            ],
            [
                6261,
                6309
            ],
            [
                6309,
                6324
            ],
            [
                6324,
                6385
            ],
            [
                6385,
                6438
            ],
            [
                6438,
                6466
            ],
            [
                6466,
                6471
            ],
            [
                6471,
                6517
            ],
            [
                6517,
                6537
            ],
            [
                6537,
                6603
            ],
            [
                6603,
                6642
            ],
            [
                6642,
                6662
            ],
            [
                6662,
                6729
            ],
            [
                6729,
                6799
            ],
            [
                6799,
                6870
            ],
            [
                6870,
                6943
            ],
            [
                6943,
                7028
            ],
            [
                7028,
                7050
            ],
            [
                7050,
                7105
            ],
            [
                7105,
                7189
            ],
            [
                7189,
                7224
            ],
            [
                7224,
                7345
            ],
            [
                7345,
                7490
            ],
            [
                7490,
                7535
            ],
            [
                7535,
                7546
            ],
            [
                7546,
                7575
            ],
            [
                7575,
                7590
            ],
            [
                7590,
                7715
            ],
            [
                7715,
                7738
            ],
            [
                7738,
                7807
            ],
            [
                7807,
                7837
            ],
            [
                7837,
                7896
            ],
            [
                7896,
                7915
            ],
            [
                7915,
                7951
            ],
            [
                7951,
                8098
            ],
            [
                8098,
                8127
            ],
            [
                8127,
                8158
            ],
            [
                8158,
                8191
            ],
            [
                8191,
                8249
            ],
            [
                8249,
                8272
            ],
            [
                8272,
                8287
            ],
            [
                8287,
                8326
            ],
            [
                8326,
                8349
            ],
            [
                8349,
                8370
            ],
            [
                8370,
                8375
            ],
            [
                8375,
                8402
            ],
            [
                8402,
                8443
            ],
            [
                8443,
                8520
            ],
            [
                8520,
                8537
            ],
            [
                8537,
                8559
            ],
            [
                8559,
                8586
            ],
            [
                8586,
                8643
            ],
            [
                8643,
                8675
            ],
            [
                8675,
                8713
            ],
            [
                8713,
                8740
            ],
            [
                8740,
                8760
            ],
            [
                8760,
                8793
            ],
            [
                8793,
                8930
            ],
            [
                8930,
                8949
            ],
            [
                8949,
                9291
            ],
            [
                9291,
                9331
            ],
            [
                9331,
                9492
            ],
            [
                9492,
                9635
            ],
            [
                9635,
                9678
            ],
            [
                9678,
                9805
            ],
            [
                9805,
                9841
            ],
            [
                9841,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                9922
            ],
            [
                9922,
                9974
            ],
            [
                9974,
                10021
            ],
            [
                10021,
                10072
            ],
            [
                10072,
                10119
            ],
            [
                10119,
                10206
            ],
            [
                10206,
                10227
            ],
            [
                10227,
                10467
            ],
            [
                10467,
                10527
            ],
            [
                10527,
                10555
            ],
            [
                10555,
                10618
            ],
            [
                10618,
                10691
            ],
            [
                10691,
                10783
            ],
            [
                10783,
                10827
            ],
            [
                10827,
                10900
            ],
            [
                10900,
                10984
            ],
            [
                10984,
                11006
            ],
            [
                11006,
                11155
            ],
            [
                11155,
                11365
            ],
            [
                11365,
                11496
            ],
            [
                11496,
                11648
            ],
            [
                11648,
                11726
            ],
            [
                11726,
                11792
            ],
            [
                11792,
                11818
            ],
            [
                11818,
                11927
            ],
            [
                11927,
                11998
            ],
            [
                11998,
                12204
            ],
            [
                12204,
                12227
            ],
            [
                12227,
                12298
            ],
            [
                12298,
                12315
            ],
            [
                12315,
                12362
            ],
            [
                12362,
                12394
            ],
            [
                12394,
                12406
            ],
            [
                12406,
                12431
            ],
            [
                12431,
                12515
            ],
            [
                12515,
                12657
            ],
            [
                12657,
                12711
            ],
            [
                12711,
                12801
            ],
            [
                12801,
                12840
            ],
            [
                12840,
                12871
            ],
            [
                12871,
                12892
            ],
            [
                12892,
                12933
            ],
            [
                12933,
                12967
            ],
            [
                12967,
                13075
            ],
            [
                13075,
                13123
            ],
            [
                13123,
                13143
            ],
            [
                13143,
                13231
            ],
            [
                13231,
                13247
            ],
            [
                13247,
                13273
            ],
            [
                13273,
                13329
            ],
            [
                13329,
                13388
            ],
            [
                13388,
                13410
            ],
            [
                13410,
                13455
            ],
            [
                13455,
                13495
            ],
            [
                13495,
                13501
            ],
            [
                13501,
                13543
            ],
            [
                13543,
                13571
            ],
            [
                13571,
                13576
            ],
            [
                13576,
                13581
            ],
            [
                13581,
                13618
            ],
            [
                13618,
                13724
            ],
            [
                13724,
                13814
            ],
            [
                13814,
                13875
            ],
            [
                13875,
                13948
            ],
            [
                13948,
                13997
            ],
            [
                13997,
                14257
            ],
            [
                14257,
                14336
            ],
            [
                14336,
                14361
            ],
            [
                14361,
                14382
            ],
            [
                14382,
                14427
            ],
            [
                14427,
                14460
            ],
            [
                14460,
                14513
            ],
            [
                14513,
                14558
            ],
            [
                14558,
                14603
            ],
            [
                14603,
                14639
            ],
            [
                14639,
                14735
            ],
            [
                14735,
                14784
            ],
            [
                14784,
                14858
            ],
            [
                14858,
                15020
            ],
            [
                15020,
                15068
            ],
            [
                15068,
                15088
            ],
            [
                15088,
                15119
            ],
            [
                15119,
                15175
            ],
            [
                15175,
                15192
            ],
            [
                15192,
                15216
            ],
            [
                15216,
                15629
            ],
            [
                15629,
                15692
            ],
            [
                15692,
                15724
            ],
            [
                15724,
                15786
            ],
            [
                15786,
                15805
            ],
            [
                15805,
                15833
            ],
            [
                15833,
                15852
            ],
            [
                15852,
                15964
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                32,
                34
            ],
            [
                35,
                53
            ],
            [
                54,
                60
            ],
            [
                60,
                62
            ],
            [
                62,
                125
            ],
            [
                126,
                176
            ],
            [
                177,
                182
            ],
            [
                183,
                186
            ],
            [
                187,
                191
            ],
            [
                191,
                193
            ],
            [
                193,
                241
            ],
            [
                241,
                349
            ],
            [
                350,
                381
            ],
            [
                381,
                396
            ],
            [
                396,
                436
            ],
            [
                436,
                455
            ],
            [
                455,
                509
            ],
            [
                509,
                571
            ],
            [
                571,
                611
            ],
            [
                611,
                641
            ],
            [
                655,
                658
            ],
            [
                658,
                660
            ],
            [
                665,
                669
            ],
            [
                670,
                704
            ],
            [
                704,
                749
            ],
            [
                749,
                799
            ],
            [
                800,
                815
            ],
            [
                815,
                839
            ],
            [
                839,
                917
            ],
            [
                917,
                1093
            ],
            [
                1093,
                1102
            ],
            [
                1103,
                1169
            ],
            [
                1169,
                1170
            ],
            [
                1170,
                1206
            ],
            [
                1206,
                1221
            ],
            [
                1221,
                1223
            ],
            [
                1225,
                1260
            ],
            [
                1260,
                1299
            ],
            [
                1299,
                1371
            ],
            [
                1382,
                1398
            ],
            [
                1408,
                1410
            ],
            [
                1410,
                1475
            ],
            [
                1475,
                1510
            ],
            [
                1510,
                1518
            ],
            [
                1519,
                1668
            ],
            [
                1671,
                1677
            ],
            [
                1680,
                1732
            ],
            [
                1742,
                1769
            ],
            [
                1769,
                1770
            ],
            [
                1771,
                1775
            ],
            [
                1776,
                1847
            ],
            [
                1848,
                1874
            ],
            [
                1875,
                1887
            ],
            [
                1898,
                1900
            ],
            [
                1901,
                1910
            ],
            [
                1910,
                1954
            ],
            [
                1954,
                1987
            ],
            [
                1987,
                2012
            ],
            [
                2018,
                2053
            ],
            [
                2054,
                2075
            ],
            [
                2082,
                2096
            ],
            [
                2096,
                2258
            ],
            [
                2261,
                2262
            ],
            [
                2262,
                2276
            ],
            [
                2277,
                2278
            ],
            [
                2279,
                2282
            ],
            [
                2283,
                2296
            ],
            [
                2316,
                2318
            ],
            [
                2319,
                2377
            ],
            [
                2377,
                2492
            ],
            [
                2492,
                2507
            ],
            [
                2508,
                2518
            ],
            [
                2522,
                2535
            ],
            [
                2537,
                2616
            ],
            [
                2617,
                2625
            ],
            [
                2625,
                2687
            ],
            [
                2688,
                2692
            ],
            [
                2692,
                2694
            ],
            [
                2694,
                2788
            ],
            [
                2788,
                2835
            ],
            [
                2835,
                2889
            ],
            [
                2889,
                2923
            ],
            [
                2923,
                2967
            ],
            [
                2967,
                3029
            ],
            [
                3029,
                3031
            ],
            [
                3031,
                3041
            ],
            [
                3044,
                3067
            ],
            [
                3067,
                3184
            ],
            [
                3184,
                3190
            ],
            [
                3191,
                3213
            ],
            [
                3213,
                3229
            ],
            [
                3229,
                3288
            ],
            [
                3288,
                3346
            ],
            [
                3354,
                3365
            ],
            [
                3365,
                3368
            ],
            [
                3368,
                3380
            ],
            [
                3381,
                3395
            ],
            [
                3398,
                3490
            ],
            [
                3490,
                3498
            ],
            [
                3499,
                3535
            ],
            [
                3536,
                3566
            ],
            [
                3567,
                3608
            ],
            [
                3608,
                3734
            ],
            [
                3737,
                3774
            ],
            [
                3775,
                3787
            ],
            [
                3787,
                3790
            ],
            [
                3792,
                3851
            ],
            [
                3851,
                3880
            ],
            [
                3881,
                3892
            ],
            [
                3892,
                3944
            ],
            [
                3944,
                4005
            ],
            [
                4006,
                4032
            ],
            [
                4033,
                4045
            ],
            [
                4047,
                4093
            ],
            [
                4094,
                4107
            ],
            [
                4108,
                4149
            ],
            [
                4149,
                4193
            ],
            [
                4193,
                4195
            ],
            [
                4195,
                4287
            ],
            [
                4287,
                4320
            ],
            [
                4320,
                4355
            ],
            [
                4356,
                4372
            ],
            [
                4379,
                4388
            ],
            [
                4388,
                4392
            ],
            [
                4393,
                4418
            ],
            [
                4418,
                4455
            ],
            [
                4455,
                4456
            ],
            [
                4457,
                4484
            ],
            [
                4484,
                4486
            ],
            [
                4486,
                4523
            ],
            [
                4524,
                4528
            ],
            [
                4528,
                4581
            ],
            [
                4582,
                4636
            ],
            [
                4644,
                4674
            ],
            [
                4677,
                4690
            ],
            [
                4691,
                4703
            ],
            [
                4708,
                4710
            ],
            [
                4711,
                4716
            ],
            [
                4716,
                4722
            ],
            [
                4725,
                4767
            ],
            [
                4770,
                4798
            ],
            [
                4798,
                4803
            ],
            [
                4816,
                4848
            ],
            [
                4849,
                4857
            ],
            [
                4858,
                4890
            ],
            [
                4891,
                4892
            ],
            [
                4901,
                4932
            ],
            [
                4934,
                4954
            ],
            [
                4961,
                4963
            ],
            [
                4963,
                4966
            ],
            [
                4973,
                4978
            ],
            [
                4979,
                4989
            ],
            [
                4989,
                5002
            ],
            [
                5003,
                5027
            ],
            [
                5027,
                5043
            ],
            [
                5043,
                5057
            ],
            [
                5058,
                5066
            ],
            [
                5067,
                5078
            ],
            [
                5078,
                5083
            ],
            [
                5084,
                5096
            ],
            [
                5101,
                5103
            ],
            [
                5111,
                5117
            ],
            [
                5117,
                5154
            ],
            [
                5154,
                5156
            ],
            [
                5156,
                5158
            ],
            [
                5159,
                5188
            ],
            [
                5192,
                5202
            ],
            [
                5202,
                5284
            ],
            [
                5284,
                5355
            ],
            [
                5355,
                5384
            ],
            [
                5385,
                5422
            ],
            [
                5422,
                5434
            ],
            [
                5435,
                5436
            ],
            [
                5444,
                5448
            ],
            [
                5453,
                5455
            ],
            [
                5455,
                5471
            ],
            [
                5471,
                5472
            ],
            [
                5473,
                5490
            ],
            [
                5491,
                5528
            ],
            [
                5528,
                5589
            ],
            [
                5600,
                5602
            ],
            [
                5603,
                5629
            ],
            [
                5629,
                5632
            ],
            [
                5633,
                5641
            ],
            [
                5642,
                5648
            ],
            [
                5649,
                5696
            ],
            [
                5700,
                5712
            ],
            [
                5719,
                5743
            ],
            [
                5743,
                5744
            ],
            [
                5753,
                5757
            ],
            [
                5764,
                5767
            ],
            [
                5780,
                5809
            ],
            [
                5810,
                5850
            ],
            [
                5851,
                5854
            ],
            [
                5856,
                5899
            ],
            [
                5899,
                5919
            ],
            [
                5920,
                5927
            ],
            [
                5936,
                5941
            ],
            [
                5941,
                6026
            ],
            [
                6026,
                6036
            ],
            [
                6044,
                6047
            ],
            [
                6048,
                6053
            ],
            [
                6054,
                6059
            ],
            [
                6060,
                6063
            ],
            [
                6064,
                6071
            ],
            [
                6071,
                6101
            ],
            [
                6117,
                6134
            ],
            [
                6139,
                6154
            ],
            [
                6154,
                6155
            ],
            [
                6156,
                6191
            ],
            [
                6197,
                6217
            ],
            [
                6218,
                6236
            ],
            [
                6242,
                6261
            ],
            [
                6261,
                6309
            ],
            [
                6309,
                6324
            ],
            [
                6324,
                6343
            ],
            [
                6349,
                6371
            ],
            [
                6376,
                6383
            ],
            [
                6385,
                6414
            ],
            [
                6415,
                6438
            ],
            [
                6438,
                6454
            ],
            [
                6454,
                6466
            ],
            [
                6466,
                6471
            ],
            [
                6471,
                6517
            ],
            [
                6517,
                6537
            ],
            [
                6537,
                6559
            ],
            [
                6560,
                6603
            ],
            [
                6603,
                6642
            ],
            [
                6642,
                6662
            ],
            [
                6662,
                6729
            ],
            [
                6729,
                6737
            ],
            [
                6738,
                6799
            ],
            [
                6799,
                6870
            ],
            [
                6870,
                6943
            ],
            [
                6943,
                7028
            ],
            [
                7028,
                7029
            ],
            [
                7029,
                7050
            ],
            [
                7050,
                7105
            ],
            [
                7105,
                7119
            ],
            [
                7119,
                7161
            ],
            [
                7161,
                7162
            ],
            [
                7163,
                7167
            ],
            [
                7173,
                7189
            ],
            [
                7189,
                7198
            ],
            [
                7199,
                7201
            ],
            [
                7202,
                7206
            ],
            [
                7207,
                7209
            ],
            [
                7215,
                7219
            ],
            [
                7220,
                7222
            ],
            [
                7224,
                7257
            ],
            [
                7257,
                7312
            ],
            [
                7313,
                7318
            ],
            [
                7321,
                7335
            ],
            [
                7336,
                7343
            ],
            [
                7343,
                7345
            ],
            [
                7345,
                7346
            ],
            [
                7359,
                7361
            ],
            [
                7362,
                7404
            ],
            [
                7405,
                7434
            ],
            [
                7442,
                7461
            ],
            [
                7462,
                7490
            ],
            [
                7490,
                7535
            ],
            [
                7535,
                7536
            ],
            [
                7536,
                7546
            ],
            [
                7546,
                7575
            ],
            [
                7575,
                7590
            ],
            [
                7590,
                7593
            ],
            [
                7594,
                7598
            ],
            [
                7599,
                7616
            ],
            [
                7617,
                7619
            ],
            [
                7619,
                7647
            ],
            [
                7648,
                7659
            ],
            [
                7662,
                7715
            ],
            [
                7715,
                7738
            ],
            [
                7743,
                7753
            ],
            [
                7754,
                7804
            ],
            [
                7804,
                7807
            ],
            [
                7807,
                7820
            ],
            [
                7838,
                7894
            ],
            [
                7894,
                7896
            ],
            [
                7896,
                7915
            ],
            [
                7915,
                7951
            ],
            [
                7951,
                8027
            ],
            [
                8028,
                8098
            ],
            [
                8098,
                8125
            ],
            [
                8125,
                8127
            ],
            [
                8127,
                8158
            ],
            [
                8158,
                8191
            ],
            [
                8191,
                8195
            ],
            [
                8196,
                8249
            ],
            [
                8249,
                8272
            ],
            [
                8272,
                8273
            ],
            [
                8273,
                8285
            ],
            [
                8296,
                8310
            ],
            [
                8311,
                8323
            ],
            [
                8326,
                8349
            ],
            [
                8349,
                8367
            ],
            [
                8367,
                8370
            ],
            [
                8370,
                8375
            ],
            [
                8375,
                8378
            ],
            [
                8383,
                8402
            ],
            [
                8402,
                8407
            ],
            [
                8414,
                8443
            ],
            [
                8443,
                8508
            ],
            [
                8509,
                8520
            ],
            [
                8520,
                8537
            ],
            [
                8537,
                8559
            ],
            [
                8559,
                8586
            ],
            [
                8586,
                8595
            ],
            [
                8596,
                8598
            ],
            [
                8599,
                8643
            ],
            [
                8643,
                8675
            ],
            [
                8675,
                8691
            ],
            [
                8692,
                8713
            ],
            [
                8713,
                8740
            ],
            [
                8740,
                8760
            ],
            [
                8760,
                8790
            ],
            [
                8790,
                8793
            ],
            [
                8793,
                8930
            ],
            [
                8930,
                8949
            ],
            [
                8949,
                9128
            ],
            [
                9137,
                9291
            ],
            [
                9291,
                9302
            ],
            [
                9302,
                9303
            ],
            [
                9304,
                9331
            ],
            [
                9331,
                9373
            ],
            [
                9373,
                9413
            ],
            [
                9421,
                9490
            ],
            [
                9490,
                9492
            ],
            [
                9492,
                9540
            ],
            [
                9546,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9663,
                9676
            ],
            [
                9676,
                9678
            ],
            [
                9678,
                9805
            ],
            [
                9805,
                9841
            ],
            [
                9841,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                9922
            ],
            [
                9922,
                9974
            ],
            [
                9974,
                10019
            ],
            [
                10019,
                10021
            ],
            [
                10021,
                10034
            ],
            [
                10035,
                10037
            ],
            [
                10037,
                10072
            ],
            [
                10072,
                10117
            ],
            [
                10119,
                10206
            ],
            [
                10206,
                10227
            ],
            [
                10227,
                10244
            ],
            [
                10245,
                10270
            ],
            [
                10271,
                10285
            ],
            [
                10285,
                10438
            ],
            [
                10439,
                10465
            ],
            [
                10465,
                10467
            ],
            [
                10467,
                10475
            ],
            [
                10485,
                10487
            ],
            [
                10500,
                10527
            ],
            [
                10527,
                10528
            ],
            [
                10534,
                10539
            ],
            [
                10540,
                10548
            ],
            [
                10548,
                10555
            ],
            [
                10555,
                10618
            ],
            [
                10618,
                10619
            ],
            [
                10622,
                10678
            ],
            [
                10679,
                10688
            ],
            [
                10691,
                10741
            ],
            [
                10746,
                10783
            ],
            [
                10783,
                10827
            ],
            [
                10827,
                10840
            ],
            [
                10841,
                10851
            ],
            [
                10855,
                10857
            ],
            [
                10858,
                10871
            ],
            [
                10872,
                10891
            ],
            [
                10895,
                10899
            ],
            [
                10900,
                10933
            ],
            [
                10950,
                10984
            ],
            [
                10984,
                10995
            ],
            [
                11003,
                11006
            ],
            [
                11006,
                11012
            ],
            [
                11020,
                11050
            ],
            [
                11057,
                11153
            ],
            [
                11153,
                11155
            ],
            [
                11155,
                11237
            ],
            [
                11240,
                11280
            ],
            [
                11283,
                11353
            ],
            [
                11362,
                11365
            ],
            [
                11365,
                11401
            ],
            [
                11402,
                11408
            ],
            [
                11417,
                11424
            ],
            [
                11432,
                11457
            ],
            [
                11472,
                11494
            ],
            [
                11494,
                11496
            ],
            [
                11497,
                11555
            ],
            [
                11556,
                11558
            ],
            [
                11564,
                11602
            ],
            [
                11608,
                11648
            ],
            [
                11648,
                11726
            ],
            [
                11726,
                11792
            ],
            [
                11792,
                11793
            ],
            [
                11793,
                11818
            ],
            [
                11818,
                11927
            ],
            [
                11927,
                11942
            ],
            [
                11947,
                11952
            ],
            [
                11953,
                11956
            ],
            [
                11961,
                11965
            ],
            [
                11966,
                11998
            ],
            [
                11998,
                12002
            ],
            [
                12003,
                12030
            ],
            [
                12030,
                12046
            ],
            [
                12046,
                12047
            ],
            [
                12048,
                12049
            ],
            [
                12052,
                12082
            ],
            [
                12090,
                12124
            ],
            [
                12133,
                12168
            ],
            [
                12169,
                12172
            ],
            [
                12173,
                12202
            ],
            [
                12202,
                12204
            ],
            [
                12204,
                12219
            ],
            [
                12219,
                12227
            ],
            [
                12227,
                12298
            ],
            [
                12298,
                12315
            ],
            [
                12315,
                12362
            ],
            [
                12362,
                12394
            ],
            [
                12394,
                12406
            ],
            [
                12406,
                12431
            ],
            [
                12431,
                12515
            ],
            [
                12515,
                12616
            ],
            [
                12617,
                12655
            ],
            [
                12658,
                12711
            ],
            [
                12711,
                12801
            ],
            [
                12801,
                12840
            ],
            [
                12840,
                12865
            ],
            [
                12868,
                12871
            ],
            [
                12871,
                12892
            ],
            [
                12892,
                12933
            ],
            [
                12933,
                12949
            ],
            [
                12955,
                12964
            ],
            [
                12964,
                12967
            ],
            [
                12967,
                13075
            ],
            [
                13075,
                13123
            ],
            [
                13123,
                13143
            ],
            [
                13143,
                13231
            ],
            [
                13231,
                13247
            ],
            [
                13247,
                13270
            ],
            [
                13273,
                13281
            ],
            [
                13282,
                13285
            ],
            [
                13293,
                13329
            ],
            [
                13329,
                13388
            ],
            [
                13388,
                13410
            ],
            [
                13410,
                13417
            ],
            [
                13418,
                13455
            ],
            [
                13455,
                13495
            ],
            [
                13495,
                13501
            ],
            [
                13501,
                13541
            ],
            [
                13541,
                13543
            ],
            [
                13543,
                13571
            ],
            [
                13571,
                13576
            ],
            [
                13576,
                13581
            ],
            [
                13581,
                13617
            ],
            [
                13618,
                13724
            ],
            [
                13724,
                13814
            ],
            [
                13819,
                13829
            ],
            [
                13830,
                13875
            ],
            [
                13875,
                13887
            ],
            [
                13888,
                13892
            ],
            [
                13893,
                13948
            ],
            [
                13949,
                13979
            ],
            [
                13995,
                13997
            ],
            [
                13998,
                14230
            ],
            [
                14245,
                14257
            ],
            [
                14257,
                14291
            ],
            [
                14292,
                14333
            ],
            [
                14336,
                14341
            ],
            [
                14345,
                14361
            ],
            [
                14361,
                14382
            ],
            [
                14385,
                14425
            ],
            [
                14425,
                14427
            ],
            [
                14427,
                14460
            ],
            [
                14460,
                14513
            ],
            [
                14513,
                14558
            ],
            [
                14558,
                14570
            ],
            [
                14571,
                14603
            ],
            [
                14603,
                14639
            ],
            [
                14639,
                14735
            ],
            [
                14735,
                14784
            ],
            [
                14784,
                14834
            ],
            [
                14835,
                14856
            ],
            [
                14856,
                14858
            ],
            [
                14858,
                14879
            ],
            [
                14885,
                14919
            ],
            [
                14920,
                15020
            ],
            [
                15024,
                15048
            ],
            [
                15049,
                15051
            ],
            [
                15052,
                15068
            ],
            [
                15068,
                15088
            ],
            [
                15088,
                15119
            ],
            [
                15119,
                15175
            ],
            [
                15175,
                15192
            ],
            [
                15192,
                15216
            ],
            [
                15216,
                15357
            ],
            [
                15357,
                15389
            ],
            [
                15390,
                15413
            ],
            [
                15414,
                15421
            ],
            [
                15421,
                15499
            ],
            [
                15500,
                15535
            ],
            [
                15535,
                15607
            ],
            [
                15608,
                15629
            ],
            [
                15629,
                15692
            ],
            [
                15692,
                15724
            ],
            [
                15724,
                15731
            ],
            [
                15732,
                15738
            ],
            [
                15739,
                15742
            ],
            [
                15742,
                15786
            ],
            [
                15786,
                15805
            ],
            [
                15805,
                15831
            ],
            [
                15833,
                15850
            ],
            [
                15852,
                15882
            ],
            [
                15891,
                15964
            ]
        ],
        "row_chars": [
            [
                0,
                62
            ],
            [
                62,
                193
            ],
            [
                193,
                241
            ],
            [
                241,
                350
            ],
            [
                350,
                350
            ],
            [
                350,
                381
            ],
            [
                381,
                396
            ],
            [
                396,
                436
            ],
            [
                436,
                455
            ],
            [
                455,
                509
            ],
            [
                509,
                571
            ],
            [
                571,
                611
            ],
            [
                611,
                658
            ],
            [
                658,
                704
            ],
            [
                704,
                749
            ],
            [
                749,
                749
            ],
            [
                749,
                749
            ],
            [
                749,
                839
            ],
            [
                839,
                839
            ],
            [
                839,
                917
            ],
            [
                917,
                1093
            ],
            [
                1093,
                1169
            ],
            [
                1169,
                1206
            ],
            [
                1206,
                1221
            ],
            [
                1221,
                1221
            ],
            [
                1221,
                1221
            ],
            [
                1221,
                1225
            ],
            [
                1225,
                1225
            ],
            [
                1225,
                1260
            ],
            [
                1260,
                1260
            ],
            [
                1260,
                1299
            ],
            [
                1299,
                1371
            ],
            [
                1371,
                1371
            ],
            [
                1371,
                1410
            ],
            [
                1410,
                1475
            ],
            [
                1475,
                1510
            ],
            [
                1510,
                1510
            ],
            [
                1510,
                1510
            ],
            [
                1510,
                1510
            ],
            [
                1510,
                1671
            ],
            [
                1671,
                1680
            ],
            [
                1680,
                1680
            ],
            [
                1680,
                1954
            ],
            [
                1954,
                1987
            ],
            [
                1987,
                2096
            ],
            [
                2096,
                2261
            ],
            [
                2261,
                2318
            ],
            [
                2318,
                2492
            ],
            [
                2492,
                2492
            ],
            [
                2492,
                2625
            ],
            [
                2625,
                2694
            ],
            [
                2694,
                2788
            ],
            [
                2788,
                2835
            ],
            [
                2835,
                2889
            ],
            [
                2889,
                2923
            ],
            [
                2923,
                2967
            ],
            [
                2967,
                3031
            ],
            [
                3031,
                3067
            ],
            [
                3067,
                3184
            ],
            [
                3184,
                3213
            ],
            [
                3213,
                3229
            ],
            [
                3229,
                3288
            ],
            [
                3288,
                3368
            ],
            [
                3368,
                3490
            ],
            [
                3490,
                3567
            ],
            [
                3567,
                3608
            ],
            [
                3608,
                3787
            ],
            [
                3787,
                3851
            ],
            [
                3851,
                3892
            ],
            [
                3892,
                3892
            ],
            [
                3892,
                3944
            ],
            [
                3944,
                4195
            ],
            [
                4195,
                4287
            ],
            [
                4287,
                4320
            ],
            [
                4320,
                4388
            ],
            [
                4388,
                4486
            ],
            [
                4486,
                4528
            ],
            [
                4528,
                4581
            ],
            [
                4581,
                4581
            ],
            [
                4581,
                4677
            ],
            [
                4677,
                4677
            ],
            [
                4677,
                4798
            ],
            [
                4798,
                4798
            ],
            [
                4798,
                4963
            ],
            [
                4963,
                4989
            ],
            [
                4989,
                5027
            ],
            [
                5027,
                5117
            ],
            [
                5117,
                5156
            ],
            [
                5156,
                5156
            ],
            [
                5156,
                5202
            ],
            [
                5202,
                5284
            ],
            [
                5284,
                5355
            ],
            [
                5355,
                5385
            ],
            [
                5385,
                5385
            ],
            [
                5385,
                5422
            ],
            [
                5422,
                5455
            ],
            [
                5455,
                5629
            ],
            [
                5629,
                5856
            ],
            [
                5856,
                5899
            ],
            [
                5899,
                5941
            ],
            [
                5941,
                6026
            ],
            [
                6026,
                6071
            ],
            [
                6071,
                6071
            ],
            [
                6071,
                6261
            ],
            [
                6261,
                6309
            ],
            [
                6309,
                6324
            ],
            [
                6324,
                6385
            ],
            [
                6385,
                6385
            ],
            [
                6385,
                6385
            ],
            [
                6385,
                6385
            ],
            [
                6385,
                6438
            ],
            [
                6438,
                6466
            ],
            [
                6466,
                6471
            ],
            [
                6471,
                6517
            ],
            [
                6517,
                6537
            ],
            [
                6537,
                6603
            ],
            [
                6603,
                6642
            ],
            [
                6642,
                6642
            ],
            [
                6642,
                6662
            ],
            [
                6662,
                6729
            ],
            [
                6729,
                6799
            ],
            [
                6799,
                6870
            ],
            [
                6870,
                6943
            ],
            [
                6943,
                7028
            ],
            [
                7028,
                7050
            ],
            [
                7050,
                7105
            ],
            [
                7105,
                7105
            ],
            [
                7105,
                7189
            ],
            [
                7189,
                7224
            ],
            [
                7224,
                7345
            ],
            [
                7345,
                7490
            ],
            [
                7490,
                7535
            ],
            [
                7535,
                7546
            ],
            [
                7546,
                7575
            ],
            [
                7575,
                7590
            ],
            [
                7590,
                7715
            ],
            [
                7715,
                7738
            ],
            [
                7738,
                7738
            ],
            [
                7738,
                7738
            ],
            [
                7738,
                7738
            ],
            [
                7738,
                7738
            ],
            [
                7738,
                7738
            ],
            [
                7738,
                7807
            ],
            [
                7807,
                7896
            ],
            [
                7896,
                7915
            ],
            [
                7915,
                7951
            ],
            [
                7951,
                8098
            ],
            [
                8098,
                8127
            ],
            [
                8127,
                8127
            ],
            [
                8127,
                8158
            ],
            [
                8158,
                8191
            ],
            [
                8191,
                8249
            ],
            [
                8249,
                8272
            ],
            [
                8272,
                8287
            ],
            [
                8287,
                8326
            ],
            [
                8326,
                8326
            ],
            [
                8326,
                8349
            ],
            [
                8349,
                8370
            ],
            [
                8370,
                8375
            ],
            [
                8375,
                8402
            ],
            [
                8402,
                8443
            ],
            [
                8443,
                8520
            ],
            [
                8520,
                8537
            ],
            [
                8537,
                8559
            ],
            [
                8559,
                8586
            ],
            [
                8586,
                8643
            ],
            [
                8643,
                8675
            ],
            [
                8675,
                8713
            ],
            [
                8713,
                8740
            ],
            [
                8740,
                8760
            ],
            [
                8760,
                8793
            ],
            [
                8793,
                8930
            ],
            [
                8930,
                8949
            ],
            [
                8949,
                9291
            ],
            [
                9291,
                9291
            ],
            [
                9291,
                9331
            ],
            [
                9331,
                9492
            ],
            [
                9492,
                9635
            ],
            [
                9635,
                9678
            ],
            [
                9678,
                9805
            ],
            [
                9805,
                9841
            ],
            [
                9841,
                9854
            ],
            [
                9854,
                9875
            ],
            [
                9875,
                9875
            ],
            [
                9875,
                9922
            ],
            [
                9922,
                9974
            ],
            [
                9974,
                10021
            ],
            [
                10021,
                10072
            ],
            [
                10072,
                10206
            ],
            [
                10206,
                10227
            ],
            [
                10227,
                10467
            ],
            [
                10467,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10555
            ],
            [
                10555,
                10618
            ],
            [
                10618,
                10691
            ],
            [
                10691,
                10783
            ],
            [
                10783,
                10827
            ],
            [
                10827,
                10900
            ],
            [
                10900,
                10984
            ],
            [
                10984,
                11006
            ],
            [
                11006,
                11155
            ],
            [
                11155,
                11365
            ],
            [
                11365,
                11496
            ],
            [
                11496,
                11648
            ],
            [
                11648,
                11726
            ],
            [
                11726,
                11792
            ],
            [
                11792,
                11818
            ],
            [
                11818,
                11927
            ],
            [
                11927,
                11998
            ],
            [
                11998,
                12204
            ],
            [
                12204,
                12227
            ],
            [
                12227,
                12298
            ],
            [
                12298,
                12315
            ],
            [
                12315,
                12362
            ],
            [
                12362,
                12394
            ],
            [
                12394,
                12406
            ],
            [
                12406,
                12431
            ],
            [
                12431,
                12515
            ],
            [
                12515,
                12657
            ],
            [
                12657,
                12657
            ],
            [
                12657,
                12711
            ],
            [
                12711,
                12801
            ],
            [
                12801,
                12840
            ],
            [
                12840,
                12871
            ],
            [
                12871,
                12892
            ],
            [
                12892,
                12933
            ],
            [
                12933,
                12967
            ],
            [
                12967,
                13075
            ],
            [
                13075,
                13123
            ],
            [
                13123,
                13143
            ],
            [
                13143,
                13231
            ],
            [
                13231,
                13247
            ],
            [
                13247,
                13273
            ],
            [
                13273,
                13273
            ],
            [
                13273,
                13329
            ],
            [
                13329,
                13388
            ],
            [
                13388,
                13410
            ],
            [
                13410,
                13455
            ],
            [
                13455,
                13495
            ],
            [
                13495,
                13501
            ],
            [
                13501,
                13543
            ],
            [
                13543,
                13571
            ],
            [
                13571,
                13576
            ],
            [
                13576,
                13581
            ],
            [
                13581,
                13618
            ],
            [
                13618,
                13618
            ],
            [
                13618,
                13724
            ],
            [
                13724,
                13814
            ],
            [
                13814,
                13875
            ],
            [
                13875,
                13948
            ],
            [
                13948,
                13948
            ],
            [
                13948,
                13997
            ],
            [
                13997,
                14257
            ],
            [
                14257,
                14336
            ],
            [
                14336,
                14336
            ],
            [
                14336,
                14336
            ],
            [
                14336,
                14361
            ],
            [
                14361,
                14382
            ],
            [
                14382,
                14427
            ],
            [
                14427,
                14460
            ],
            [
                14460,
                14513
            ],
            [
                14513,
                14558
            ],
            [
                14558,
                14603
            ],
            [
                14603,
                14639
            ],
            [
                14639,
                14735
            ],
            [
                14735,
                14784
            ],
            [
                14784,
                14858
            ],
            [
                14858,
                15020
            ],
            [
                15020,
                15068
            ],
            [
                15068,
                15088
            ],
            [
                15088,
                15119
            ],
            [
                15119,
                15175
            ],
            [
                15175,
                15192
            ],
            [
                15192,
                15216
            ],
            [
                15216,
                15629
            ],
            [
                15629,
                15692
            ],
            [
                15692,
                15724
            ],
            [
                15724,
                15786
            ],
            [
                15786,
                15805
            ],
            [
                15805,
                15964
            ]
        ]
    }
}