{
    "original": {
        "text": "The two girls met no living soul on their way back to the rectory. They let themselves in noiselessly; they stole upstairs unheard--the breaking morning gave them what light they needed. Shirley sought her couch immediately; and though the room was strange--for she had never slept at the rectory before--and though the recent scene was one unparalleled for excitement and terror by any it had hitherto been her lot to witness, yet scarce was her head laid on the pillow ere a deep, refreshing sleep closed her eyes and calmed her senses.\nPerfect health was Shirley's enviable portion. Though warm-hearted and sympathetic, she was not nervous; powerful emotions could rouse and sway without exhausting her spirit. The tempest troubled and shook her while it lasted, but it left her elasticity unbent, and her freshness quite unblighted. As every day brought her stimulating emotion, so every night yielded her recreating rest. Caroline now watched her sleeping, and read the serenity of her mind in the beauty of her happy countenance.\nFor herself, being of a different temperament, she could not sleep. The commonplace excitement of the tea-drinking and school-gathering would alone have sufficed to make her restless all night; the effect of the terrible drama which had just been enacted before her eyes was not likely to quit her for days. It was vain even to try to retain a recumbent posture; she sat up by Shirley's side, counting the slow minutes, and watching the June sun mount the heavens.\nLife wastes fast in such vigils as Caroline had of late but too often kept--vigils during which the mind, having no pleasant food to nourish it, no manna of hope, no hived-honey of joyous memories, tries to live on the meagre diet of wishes, and failing to derive thence either delight or support, and feeling itself ready to perish with craving want, turns to philosophy, to resolution, to resignation; calls on all these gods for aid, calls vainly--is unheard, unhelped, and languishes.\nCaroline was a Christian; therefore in trouble she framed many a prayer after the Christian creed, preferred it with deep earnestness, begged for patience, strength, relief. This world, however, we all know, is the scene of trial and probation; and, for any favourable result her petitions had yet wrought, it seemed to her that they were unheard and unaccepted. She believed, sometimes, that God had turned His face from her. At moments she was a Calvinist, and, sinking into the gulf of religious despair, she saw darkening over her the doom of reprobation.\nMost people have had a period or periods in their lives when they have felt thus forsaken--when, having long hoped against hope, and still seen the day of fruition deferred, their hearts have truly sickened within them. This is a terrible hour, but it is often that darkest point which precedes the rise of day--that turn of the year when the icy January wind carries over the waste at once the dirge of departing winter and the prophecy of coming spring. The perishing birds, however, cannot thus understand the blast before which they shiver; and as little can the suffering soul recognize, in the climax of its affliction, the dawn of its deliverance. Yet, let whoever grieves still cling fast to love and faith in God. God will never deceive, never finally desert him. \"Whom He loveth, He chasteneth.\" These words are true, and should not be forgotten.\nThe household was astir at last; the servants were up; the shutters were opened below. Caroline, as she quitted the couch, which had been but a thorny one to her, felt that revival of spirits which the return of day, of action, gives to all but the wholly despairing or actually dying. She dressed herself, as usual, carefully, trying so to arrange her hair and attire that nothing of the forlornness she felt at heart should be visible externally. She looked as fresh as Shirley when both were dressed, only that Miss Keeldar's eyes were lively, and Miss Helstone's languid.\n\"To-day I shall have much to say to Moore,\" were Shirley's first words; and you could see in her face that life was full of interest, expectation, and occupation for her. \"He will have to undergo cross-examination,\" she added. \"I dare say he thinks he has outwitted me cleverly. And this is the way men deal with women--still concealing danger from them--thinking, I suppose, to spare them pain. They imagined we little knew where they were to-night. We _know_ they little conjectured where we were. Men, I believe, fancy women's minds something like those of children. Now, that is a mistake.\"\nThis was said as she stood at the glass, training her naturally waved hair into curls, by twining it round her fingers. She took up the theme again five minutes after, as Caroline fastened her dress and clasped her girdle.\n\"If men could see us as we really are, they would be a little amazed; but the cleverest, the acutest men are often under an illusion about women. They do not read them in a true light; they misapprehend them, both for good and evil. Their good woman is a queer thing, half doll, half angel; their bad woman almost always a fiend. Then to hear them fall into ecstasies with each other's creations--worshipping the heroine of such a poem, novel, drama--thinking it fine, divine! Fine and divine it may be, but often quite artificial--false as the rose in my best bonnet there. If I spoke all I think on this point, if I gave my real opinion of some first-rate female characters in first-rate works, where should I be? Dead under a cairn of avenging stones in half an hour.\"\n\"Shirley, you chatter so, I can't fasten you. Be still. And, after all, authors' heroines are almost as good as authoresses' heroes.\"\n\"Not at all. Women read men more truly than men read women. I'll prove that in a magazine paper some day when I've time; only it will never be inserted. It will be 'declined with thanks,' and left for me at the publisher's.\"\n\"To be sure. You could not write cleverly enough. You don't know enough. You are not learned, Shirley.\"\n\"God knows I can't contradict you, Cary; I'm as ignorant as a stone. There's one comfort, however: you are not much better.\"\nThey descended to breakfast.\n\"I wonder how Mrs. Pryor and Hortense Moore have passed the night,\" said Caroline, as she made the coffee. \"Selfish being that I am, I never thought of either of them till just now. They will have heard all the tumult, Fieldhead and the cottage are so near; and Hortense is timid in such matters--so, no doubt, is Mrs. Pryor.\"\n\"Take my word for it, Lina, Moore will have contrived to get his sister out of the way. She went home with Miss Mann. He will have quartered her there for the night. As to Mrs. Pryor, I own I am uneasy about her; but in another half-hour we will be with her.\"\nBy this time the news of what had happened at the Hollow was spread all over the neighbourhood. Fanny, who had been to Fieldhead to fetch the milk, returned in panting haste with tidings that there had been a battle in the night at Mr. Moore's mill, and that some said twenty men were killed. Eliza, during Fanny's absence, had been apprised by the butcher's boy that the mill was burnt to the ground. Both women rushed into the parlour to announce these terrible facts to the ladies, terminating their clear and accurate narrative by the assertion that they were sure master must have been in it all. He and Thomas, the clerk, they were confident, must have gone last night to join Mr. Moore and the soldiers. Mr. Malone, too, had not been heard of at his lodgings since yesterday afternoon; and Joe Scott's wife and family were in the greatest distress, wondering what had become of their head.\nScarcely was this information imparted when a knock at the kitchen door announced the Fieldhead errand-boy, arrived in hot haste, bearing a billet from Mrs. Pryor. It was hurriedly written, and urged Miss Keeldar to return directly, as the neighbourhood and the house seemed likely to be all in confusion, and orders would have to be given which the mistress of the hall alone could regulate. In a postscript it was entreated that Miss Helstone might not be left alone at the rectory. She had better, it was suggested, accompany Miss Keeldar.\n\"There are not two opinions on that head,\" said Shirley, as she tied on her own bonnet, and then ran to fetch Caroline's.\n\"But what will Fanny and Eliza do? And if my uncle returns?\"\n\"Your uncle will not return yet; he has other fish to fry. He will be galloping backwards and forwards from Briarfield to Stilbro' all day, rousing the magistrates in the court-house and the officers at the barracks; and Fanny and Eliza can have in Joe Scott's and the clerk's wives to bear them company. Besides, of course, there is no real danger to be apprehended now. Weeks will elapse before the rioters can again rally, or plan any other attempt; and I am much mistaken if Moore and Mr. Helstone will not take advantage of last night's outbreak to quell them altogether. They will frighten the authorities of Stilbro' into energetic measures. I only hope they will not be too severe--not pursue the discomfited too relentlessly.\"\n\"Robert will not be cruel. We saw that last night,\" said Caroline.\n\"But he will be hard,\" retorted Shirley; \"and so will your uncle.\"\nAs they hurried along the meadow and plantation path to Fieldhead, they saw the distant highway already alive with an unwonted flow of equestrians and pedestrians, tending in the direction of the usually solitary Hollow. On reaching the hall, they found the backyard gates open, and the court and kitchen seemed crowded with excited milk-fetchers--men, women, and children--whom Mrs. Gill, the housekeeper, appeared vainly persuading to take their milk-cans and depart. (It _is_, or _was_, by-the-bye, the custom in the north of England for the cottagers on a country squire's estate to receive their supplies of milk and butter from the dairy of the manor house, on whose pastures a herd of milch kine was usually fed for the convenience of the neighbourhood. Miss Keeldar owned such a herd--all deep-dewlapped, Craven cows, reared on the sweet herbage and clear waters of bonny Airedale; and very proud she was of their sleek aspect and high condition.) Seeing now the state of matters, and that it was desirable to effect a clearance of the premises, Shirley stepped in amongst the gossiping groups. She bade them good-morning with a certain frank, tranquil ease--the natural characteristic of her manner when she addressed numbers, especially if those numbers belonged to the working-class; she was cooler amongst her equals, and rather proud to those above her. She then asked them if they had all got their milk measured out; and understanding that they had, she further observed that she \"wondered what they were waiting for, then.\"\n\"We're just talking a bit over this battle there has been at your mill, mistress,\" replied a man.\n\"Talking a bit! Just like you!\" said Shirley. \"It is a queer thing all the world is so fond of _talking_ over events. You _talk_ if anybody dies suddenly; you _talk_ if a fire breaks out; you _talk_ if a mill-owner fails; you _talk_ if he's murdered. What good does your talking do?\"\nThere is nothing the lower orders like better than a little downright good-humoured rating. Flattery they scorn very much; honest abuse they enjoy. They call it speaking plainly, and take a sincere delight in being the objects thereof. The homely harshness of Miss Keeldar's salutation won her the ear of the whole throng in a second.\n\"We're no war nor some 'at is aboon us, are we?\" asked a man, smiling.\n\"Nor a whit better. You that should be models of industry are just as gossip-loving as the idle. Fine, rich people that have nothing to do may be partly excused for trifling their time away; you who have to earn your bread with the sweat of your brow are quite inexcusable.\"\n\"That's queer, mistress. Suld we never have a holiday because we work hard?\"\n\"_Never_,\" was the prompt answer; \"unless,\" added the \"mistress,\" with a smile that half belied the severity of her speech--\"unless you knew how to make a better use of it than to get together over rum and tea if you are women, or over beer and pipes if you are men, and _talk_ scandal at your neighbours' expense. Come, friends,\" she added, changing at once from bluntness to courtesy, \"oblige me by taking your cans and going home. I expect several persons to call to-day, and it will be inconvenient to have the avenues to the house crowded.\"\nYorkshire people are as yielding to persuasion as they are stubborn against compulsion. The yard was clear in five minutes.\n\"Thank you, and good-bye to you, friends,\" said Shirley, as she closed the gates on a quiet court.\nNow, let me hear the most refined of cockneys presume to find fault with Yorkshire manners. Taken as they ought to be, the majority of the lads and lasses of the West Riding are gentlemen and ladies, every inch of them. It is only against the weak affectation and futile pomposity of a would-be aristocrat they turn mutinous.\nEntering by the back way, the young ladies passed through the kitchen (or _house_, as the inner kitchen is called) to the hall. Mrs. Pryor came running down the oak staircase to meet them. She was all unnerved; her naturally sanguine complexion was pale; her usually placid, though timid, blue eye was wandering, unsettled, alarmed. She did not, however, break out into any exclamations, or hurried narrative of what had happened. Her predominant feeling had been in the course of the night, and was now this morning, a sense of dissatisfaction with herself that she could not feel firmer, cooler, more equal to the demands of the occasion.\n\"You are aware,\" she began with a trembling voice, and yet the most conscientious anxiety to avoid exaggeration in what she was about to say, \"that a body of rioters has attacked Mr. Moore's mill to-night. We heard the firing and confusion very plainly here; we none of us slept. It was a sad night. The house has been in great bustle all the morning with people coming and going. The servants have applied to me for orders and directions, which I really did not feel warranted in giving. Mr. Moore has, I believe, sent up for refreshments for the soldiers and others engaged in the defence, for some conveniences also for the wounded. I could not undertake the responsibility of giving orders or taking measures. I fear delay may have been injurious in some instances; but this is not my house. You were absent, my dear Miss Keeldar. What could I do?\"\n\"Were no refreshments sent?\" asked Shirley, while her countenance, hitherto so clear, propitious, and quiet, even while she was rating the milk-fetchers, suddenly turned dark and warm.\n\"I think not, my dear.\"\n\"And nothing for the wounded--no linen, no wine, no bedding?\"\n\"I think not. I cannot tell what Mrs. Gill did; but it seemed impossible to me, at the moment, to venture to dispose of your property by sending supplies to soldiers. Provisions for a company of soldiers sounds formidable. How many there are I did not ask; but I could not think of allowing them to pillage the house, as it were. I intended to do what was right, yet I did not see the case quite clearly, I own.\"\n\"It lies in a nutshell, notwithstanding. These soldiers have risked their lives in defence of my property: I suppose they have a right to my gratitude. The wounded are our fellow-creatures: I suppose we should aid them.--Mrs. Gill!\"\nShe turned, and called in a voice more clear than soft. It rang through the thick oak of the hall and kitchen doors more effectually than a bell's summons. Mrs. Gill, who was deep in bread-making, came with hands and apron in culinary case, not having dared to stop to rub the dough from the one or to shake the flour from the other. Her mistress had never called a servant in that voice save once before, and that was when she had seen from the window Tartar in full tug with two carriers' dogs, each of them a match for him in size, if not in courage, and their masters standing by, encouraging their animals, while hers was unbefriended. Then indeed she had summoned John as if the Day of Judgment were at hand. Nor had she waited for the said John's coming, but had walked out into the lane bonnetless, and after informing the carriers that she held them far less of men than the three brutes whirling and worrying in the dust before them, had put her hands round the thick neck of the largest of the curs, and given her whole strength to the essay of choking it from Tartar's torn and bleeding eye, just above and below which organ the vengeful fangs were inserted. Five or six men were presently on the spot to help her, but she never thanked one of them. \"They might have come before if their will had been good,\" she said. She had not a word for anybody during the rest of the day, but sat near the hall fire till evening watching and tending Tartar, who lay all gory, stiff, and swelled on a mat at her feet. She wept furtively over him sometimes, and murmured the softest words of pity and endearment, in tones whose music the old, scarred, canine warrior acknowledged by licking her hand or her sandal alternately with his own red wounds. As to John, his lady turned a cold shoulder on him for a week afterwards.\nMrs. Gill, remembering this little episode, came \"all of a tremble,\" as she said herself. In a firm, brief voice Miss Keeldar proceeded to put questions and give orders. That at such a time Fieldhead should have evinced the inhospitality of a miser's hovel stung her haughty spirit to the quick; and the revolt of its pride was seen in the heaving of her heart, stirred stormily under the lace and silk which veiled it.\n\"How long is it since that message came from the mill?\"\n\"Not an hour yet, ma'am,\" answered the housekeeper soothingly.\n\"Not an hour! You might almost as well have said not a day. They will have applied elsewhere by this time. Send a man instantly down to tell them that everything this house contains is at Mr. Moore's, Mr. Helstone's, and the soldiers' service. Do that first.\"\nWhile the order was being executed, Shirley moved away from her friends, and stood at the hall-window, silent, unapproachable. When Mrs. Gill came back, she turned. The purple flush which painful excitement kindles on a pale cheek glowed on hers; the spark which displeasure lights in a dark eye fired her glance.\n\"Let the contents of the larder and the wine-cellar be brought up, put into the hay-carts, and driven down to the Hollow. If there does not happen to be much bread or much meat in the house, go to the butcher and baker, and desire them to send what they have. But I will see for myself.\"\nShe moved off.\n\"All will be right soon; she will get over it in an hour,\" whispered Caroline to Mrs. Pryor. \"Go upstairs, dear madam,\" she added affectionately, \"and try to be as calm and easy as you can. The truth is, Shirley will blame herself more than you before the day is over.\"\nBy dint of a few more gentle assurances and persuasions, Miss Helstone contrived to soothe the agitated lady. Having accompanied her to her apartment, and promised to rejoin her there when things were settled, Caroline left her to see, as she said, \"if she could be useful.\" She presently found that she could be very useful; for the retinue of servants at Fieldhead was by no means numerous, and just now their mistress found plenty of occupation for all the hands at her command, and for her own also. The delicate good-nature and dexterous activity which Caroline brought to the aid of the housekeeper and maids--all somewhat scared by their lady's unwonted mood--did a world of good at once; it helped the assistants and appeased the directress. A chance glance and smile from Caroline moved Shirley to an answering smile directly. The former was carrying a heavy basket up the cellar stairs.\n\"This is a shame!\" cried Shirley, running to her. \"It will strain your arm.\"\nShe took it from her, and herself bore it out into the yard. The cloud of temper was dispelled when she came back; the flash in her eye was melted; the shade on her forehead vanished. She resumed her usual cheerful and cordial manner to those about her, tempering her revived spirits with a little of the softness of shame at her previous unjust anger.\nShe was still superintending the lading of the cart, when a gentleman entered the yard and approached her ere she was aware of his presence.\n\"I hope I see Miss Keeldar well this morning?\" he said, examining with rather significant scrutiny her still flushed face.\nShe gave him a look, and then again bent to her employment without reply. A pleasant enough smile played on her lips, but she hid it. The gentleman repeated his salutation, stooping, that it might reach her ear with more facility.\n\"Well enough, if she be good enough,\" was the answer; \"and so is Mr. Moore too, I dare say. To speak truth, I am not anxious about him; some slight mischance would be only his just due. His conduct has been--we will say _strange_ just now, till we have time to characterize it by a more exact epithet. Meantime, may I ask what brings him here?\"\n\"Mr. Helstone and I have just received your message that everything at Fieldhead was at our service. We judged, by the unlimited wording of the gracious intimation, that you would be giving yourself too much trouble. I perceive our conjecture was correct. We are not a regiment, remember--only about half a dozen soldiers and as many civilians. Allow me to retrench something from these too abundant supplies.\"\nMiss Keeldar blushed, while she laughed at her own over-eager generosity and most disproportionate calculations. Moore laughed too, very quietly though; and as quietly he ordered basket after basket to be taken from the cart, and remanded vessel after vessel to the cellar.\n\"The rector must hear of this,\" he said; \"he will make a good story of it. What an excellent army contractor Miss Keeldar would have been!\" Again he laughed, adding, \"It is precisely as I conjectured.\"\n\"You ought to be thankful,\" said Shirley, \"and not mock me. What could I do? How could I gauge your appetites or number your band? For aught I knew, there might have been fifty of you at least to victual. You told me nothing; and then an application to provision soldiers naturally suggests large ideas.\"\n\"It appears so,\" remarked Moore, levelling another of his keen, quiet glances at the discomfited Shirley.--\"Now,\" he continued, addressing the carter, \"I think you may take what remains to the Hollow. Your load will be somewhat lighter than the one Miss Keeldar destined you to carry.\"\nAs the vehicle rumbled out of the yard, Shirley, rallying her spirits, demanded what had become of the wounded.\n\"There was not a single man hurt on our side,\" was the answer.\n\"You were hurt yourself, on the temples,\" interposed a quick, low voice--that of Caroline, who, having withdrawn within the shade of the door, and behind the large person of Mrs. Gill, had till now escaped Moore's notice. When she spoke, his eye searched the obscurity of her retreat.\n\"Are you much hurt?\" she inquired.\n\"As you might scratch your finger with a needle in sewing.\"\n\"Lift your hair and let us see.\"\nHe took his hat off, and did as he was bid, disclosing only a narrow slip of court-plaster. Caroline indicated, by a slight movement of the head, that she was satisfied, and disappeared within the clear obscure of the interior.\n\"How did she know I was hurt?\" asked Moore.\n\"By rumour, no doubt. But it is too good in her to trouble herself about you. For my part, it was of your victims I was thinking when I inquired after the wounded. What damage have your opponents sustained?\"\n\"One of the rioters, or victims as you call them, was killed, and six were hurt.\"\n\"What have you done with them?\"\n\"What you will perfectly approve. Medical aid was procured immediately; and as soon as we can get a couple of covered wagons and some clean straw, they will be removed to Stilbro'.\"\n\"Straw! You must have beds and bedding. I will send my wagon directly, properly furnished; and Mr. Yorke, I am sure, will send his.\"\n\"You guess correctly; he has volunteered already. And Mrs. Yorke--who, like you, seems disposed to regard the rioters as martyrs, and me, and especially Mr. Helstone, as murderers--is at this moment, I believe, most assiduously engaged in fitting it up with feather-beds, pillows, bolsters, blankets, etc. The _victims_ lack no attentions, I promise you. Mr. Hall, your favourite parson, has been with them ever since six o'clock, exhorting them, praying with them, and even waiting on them like any nurse; and Caroline's good friend, Miss Ainley, that _very_ plain old maid, sent in a stock of lint and linen, something in the proportion of another lady's allowance of beef and wine.\"\n\"That will do. Where is your sister?\"\n\"Well cared for. I had her securely domiciled with Miss Mann. This very morning the two set out for Wormwood Wells [a noted watering-place], and will stay there some weeks.\"\n\"So Mr. Helstone domiciled me at the rectory! Mighty clever you gentlemen think you are! I make you heartily welcome to the idea, and hope its savour, as you chew the cud of reflection upon it, gives you pleasure. Acute and astute, why are you not also omniscient? How is it that events transpire, under your very noses, of which you have no suspicion? It should be so, otherwise the exquisite gratification of outmanoeuvring you would be unknown. Ah, friend, you may search my countenance, but you cannot read it.\"\nMoore, indeed, looked as if he could not.\n\"You think me a dangerous specimen of my sex. Don't you now?\"\n\"A peculiar one, at least.\"\n\"But Caroline--is she peculiar?\"\n\"In her way--yes.\"\n\"Her way! What is her way?\"\n\"You know her as well as I do.\"\n\"And knowing her, I assert that she is neither eccentric nor difficult of control. Is she?\"\n\"That depends----\"\n\"However, there is nothing masculine about _her_?\"\n\"Why lay such emphasis on _her_? Do you consider her a contrast, in that respect, to yourself?\"\n\"You do, no doubt; but that does not signify. Caroline is neither masculine, nor of what they call the spirited order of women.\"\n\"I have seen her flash out.\"\n\"So have I, but not with manly fire. It was a short, vivid, trembling glow, that shot up, shone, vanished----\"\n\"And left her scared at her own daring. You describe others besides Caroline.\"\n\"The point I wish to establish is, that Miss Helstone, though gentle, tractable, and candid enough, is still perfectly capable of defying even Mr. Moore's penetration.\"\n\"What have you and she been doing?\" asked Moore suddenly.\n\"Have you had any breakfast?\"\n\"What is your mutual mystery?\"\n\"If you are hungry, Mrs. Gill will give you something to eat here. Step into the oak parlour, and ring the bell. You will be served as if at an inn; or, if you like better, go back to the Hollow.\"\n\"The alternative is not open to me; I _must_ go back. Good-morning. The first leisure I have I will see you again.\"",
        "paragraph_chars": [
            [
                0,
                539
            ],
            [
                539,
                1036
            ],
            [
                1036,
                1501
            ],
            [
                1501,
                1990
            ],
            [
                1990,
                2550
            ],
            [
                2550,
                3407
            ],
            [
                3407,
                3983
            ],
            [
                3983,
                4578
            ],
            [
                4578,
                4801
            ],
            [
                4801,
                5573
            ],
            [
                5573,
                5707
            ],
            [
                5707,
                5932
            ],
            [
                5932,
                6036
            ],
            [
                6036,
                6161
            ],
            [
                6161,
                6190
            ],
            [
                6190,
                6517
            ],
            [
                6517,
                6777
            ],
            [
                6777,
                7674
            ],
            [
                7674,
                8217
            ],
            [
                8217,
                8339
            ],
            [
                8339,
                8400
            ],
            [
                8400,
                9136
            ],
            [
                9136,
                9203
            ],
            [
                9203,
                9270
            ],
            [
                9270,
                10810
            ],
            [
                10810,
                10908
            ],
            [
                10908,
                11192
            ],
            [
                11192,
                11527
            ],
            [
                11527,
                11598
            ],
            [
                11598,
                11873
            ],
            [
                11873,
                11950
            ],
            [
                11950,
                12496
            ],
            [
                12496,
                12620
            ],
            [
                12620,
                12719
            ],
            [
                12719,
                13045
            ],
            [
                13045,
                13686
            ],
            [
                13686,
                14539
            ],
            [
                14539,
                14724
            ],
            [
                14724,
                14748
            ],
            [
                14748,
                14810
            ],
            [
                14810,
                15223
            ],
            [
                15223,
                15456
            ],
            [
                15456,
                17280
            ],
            [
                17280,
                17700
            ],
            [
                17700,
                17756
            ],
            [
                17756,
                17819
            ],
            [
                17819,
                18079
            ],
            [
                18079,
                18393
            ],
            [
                18393,
                18681
            ],
            [
                18681,
                18696
            ],
            [
                18696,
                18966
            ],
            [
                18966,
                19863
            ],
            [
                19863,
                19940
            ],
            [
                19940,
                20293
            ],
            [
                20293,
                20434
            ],
            [
                20434,
                20557
            ],
            [
                20557,
                20788
            ],
            [
                20788,
                21133
            ],
            [
                21133,
                21544
            ],
            [
                21544,
                21818
            ],
            [
                21818,
                22020
            ],
            [
                22020,
                22325
            ],
            [
                22325,
                22611
            ],
            [
                22611,
                22723
            ],
            [
                22723,
                22786
            ],
            [
                22786,
                23071
            ],
            [
                23071,
                23106
            ],
            [
                23106,
                23166
            ],
            [
                23166,
                23199
            ],
            [
                23199,
                23427
            ],
            [
                23427,
                23471
            ],
            [
                23471,
                23679
            ],
            [
                23679,
                23761
            ],
            [
                23761,
                23793
            ],
            [
                23793,
                23975
            ],
            [
                23975,
                24108
            ],
            [
                24108,
                24794
            ],
            [
                24794,
                24832
            ],
            [
                24832,
                25006
            ],
            [
                25006,
                25522
            ],
            [
                25522,
                25564
            ],
            [
                25564,
                25626
            ],
            [
                25626,
                25654
            ],
            [
                25654,
                25687
            ],
            [
                25687,
                25706
            ],
            [
                25706,
                25734
            ],
            [
                25734,
                25766
            ],
            [
                25766,
                25858
            ],
            [
                25858,
                25877
            ],
            [
                25877,
                25928
            ],
            [
                25928,
                26024
            ],
            [
                26024,
                26153
            ],
            [
                26153,
                26182
            ],
            [
                26182,
                26293
            ],
            [
                26293,
                26372
            ],
            [
                26372,
                26541
            ],
            [
                26541,
                26599
            ],
            [
                26599,
                26629
            ],
            [
                26629,
                26660
            ],
            [
                26660,
                26857
            ],
            [
                26857,
                26972
            ]
        ],
        "segment_chars": [
            [
                0,
                67
            ],
            [
                67,
                187
            ],
            [
                187,
                539
            ],
            [
                539,
                586
            ],
            [
                586,
                714
            ],
            [
                714,
                837
            ],
            [
                837,
                927
            ],
            [
                927,
                1036
            ],
            [
                1036,
                1104
            ],
            [
                1104,
                1344
            ],
            [
                1344,
                1501
            ],
            [
                1501,
                1990
            ],
            [
                1990,
                2164
            ],
            [
                2164,
                2353
            ],
            [
                2353,
                2417
            ],
            [
                2417,
                2550
            ],
            [
                2550,
                2770
            ],
            [
                2770,
                3006
            ],
            [
                3006,
                3205
            ],
            [
                3205,
                3273
            ],
            [
                3273,
                3323
            ],
            [
                3323,
                3356
            ],
            [
                3356,
                3407
            ],
            [
                3407,
                3494
            ],
            [
                3494,
                3693
            ],
            [
                3693,
                3856
            ],
            [
                3856,
                3983
            ],
            [
                3983,
                4154
            ],
            [
                4154,
                4210
            ],
            [
                4210,
                4262
            ],
            [
                4262,
                4379
            ],
            [
                4379,
                4434
            ],
            [
                4434,
                4483
            ],
            [
                4483,
                4553
            ],
            [
                4553,
                4578
            ],
            [
                4578,
                4698
            ],
            [
                4698,
                4801
            ],
            [
                4801,
                4947
            ],
            [
                4947,
                5034
            ],
            [
                5034,
                5131
            ],
            [
                5131,
                5278
            ],
            [
                5278,
                5376
            ],
            [
                5376,
                5517
            ],
            [
                5517,
                5573
            ],
            [
                5573,
                5619
            ],
            [
                5619,
                5629
            ],
            [
                5629,
                5707
            ],
            [
                5707,
                5720
            ],
            [
                5720,
                5767
            ],
            [
                5767,
                5860
            ],
            [
                5860,
                5932
            ],
            [
                5932,
                5945
            ],
            [
                5945,
                5982
            ],
            [
                5982,
                6005
            ],
            [
                6005,
                6036
            ],
            [
                6036,
                6105
            ],
            [
                6105,
                6161
            ],
            [
                6161,
                6190
            ],
            [
                6190,
                6297
            ],
            [
                6297,
                6372
            ],
            [
                6372,
                6517
            ],
            [
                6517,
                6605
            ],
            [
                6605,
                6635
            ],
            [
                6635,
                6683
            ],
            [
                6683,
                6777
            ],
            [
                6777,
                6873
            ],
            [
                6873,
                7070
            ],
            [
                7070,
                7179
            ],
            [
                7179,
                7379
            ],
            [
                7379,
                7488
            ],
            [
                7488,
                7674
            ],
            [
                7674,
                7838
            ],
            [
                7838,
                8067
            ],
            [
                8067,
                8159
            ],
            [
                8159,
                8217
            ],
            [
                8217,
                8339
            ],
            [
                8339,
                8374
            ],
            [
                8374,
                8400
            ],
            [
                8400,
                8459
            ],
            [
                8459,
                8705
            ],
            [
                8705,
                8772
            ],
            [
                8772,
                8977
            ],
            [
                8977,
                9049
            ],
            [
                9049,
                9136
            ],
            [
                9136,
                9163
            ],
            [
                9163,
                9203
            ],
            [
                9203,
                9270
            ],
            [
                9270,
                9491
            ],
            [
                9491,
                9740
            ],
            [
                9740,
                10031
            ],
            [
                10031,
                10226
            ],
            [
                10226,
                10373
            ],
            [
                10373,
                10637
            ],
            [
                10637,
                10810
            ],
            [
                10810,
                10908
            ],
            [
                10908,
                10924
            ],
            [
                10924,
                10940
            ],
            [
                10940,
                10954
            ],
            [
                10954,
                11026
            ],
            [
                11026,
                11159
            ],
            [
                11159,
                11192
            ],
            [
                11192,
                11284
            ],
            [
                11284,
                11340
            ],
            [
                11340,
                11428
            ],
            [
                11428,
                11527
            ],
            [
                11527,
                11576
            ],
            [
                11576,
                11598
            ],
            [
                11598,
                11618
            ],
            [
                11618,
                11695
            ],
            [
                11695,
                11873
            ],
            [
                11873,
                11898
            ],
            [
                11898,
                11950
            ],
            [
                11950,
                12265
            ],
            [
                12265,
                12384
            ],
            [
                12384,
                12496
            ],
            [
                12496,
                12584
            ],
            [
                12584,
                12620
            ],
            [
                12620,
                12719
            ],
            [
                12719,
                12811
            ],
            [
                12811,
                12939
            ],
            [
                12939,
                13045
            ],
            [
                13045,
                13173
            ],
            [
                13173,
                13234
            ],
            [
                13234,
                13378
            ],
            [
                13378,
                13476
            ],
            [
                13476,
                13686
            ],
            [
                13686,
                13892
            ],
            [
                13892,
                13966
            ],
            [
                13966,
                13986
            ],
            [
                13986,
                14067
            ],
            [
                14067,
                14175
            ],
            [
                14175,
                14322
            ],
            [
                14322,
                14400
            ],
            [
                14400,
                14482
            ],
            [
                14482,
                14521
            ],
            [
                14521,
                14539
            ],
            [
                14539,
                14568
            ],
            [
                14568,
                14724
            ],
            [
                14724,
                14748
            ],
            [
                14748,
                14810
            ],
            [
                14810,
                14824
            ],
            [
                14824,
                14977
            ],
            [
                14977,
                15033
            ],
            [
                15033,
                15140
            ],
            [
                15140,
                15223
            ],
            [
                15223,
                15264
            ],
            [
                15264,
                15375
            ],
            [
                15375,
                15449
            ],
            [
                15449,
                15456
            ],
            [
                15456,
                15512
            ],
            [
                15512,
                15612
            ],
            [
                15612,
                15790
            ],
            [
                15790,
                16097
            ],
            [
                16097,
                16171
            ],
            [
                16171,
                16627
            ],
            [
                16627,
                16718
            ],
            [
                16718,
                16787
            ],
            [
                16787,
                16974
            ],
            [
                16974,
                17206
            ],
            [
                17206,
                17280
            ],
            [
                17280,
                17370
            ],
            [
                17370,
                17450
            ],
            [
                17450,
                17700
            ],
            [
                17700,
                17756
            ],
            [
                17756,
                17819
            ],
            [
                17819,
                17833
            ],
            [
                17833,
                17879
            ],
            [
                17879,
                17926
            ],
            [
                17926,
                18063
            ],
            [
                18063,
                18079
            ],
            [
                18079,
                18206
            ],
            [
                18206,
                18244
            ],
            [
                18244,
                18393
            ],
            [
                18393,
                18515
            ],
            [
                18515,
                18653
            ],
            [
                18653,
                18681
            ],
            [
                18681,
                18696
            ],
            [
                18696,
                18789
            ],
            [
                18789,
                18886
            ],
            [
                18886,
                18966
            ],
            [
                18966,
                19076
            ],
            [
                19076,
                19241
            ],
            [
                19241,
                19470
            ],
            [
                19470,
                19716
            ],
            [
                19716,
                19802
            ],
            [
                19802,
                19863
            ],
            [
                19863,
                19882
            ],
            [
                19882,
                19913
            ],
            [
                19913,
                19940
            ],
            [
                19940,
                20001
            ],
            [
                20001,
                20124
            ],
            [
                20124,
                20293
            ],
            [
                20293,
                20434
            ],
            [
                20434,
                20481
            ],
            [
                20481,
                20557
            ],
            [
                20557,
                20631
            ],
            [
                20631,
                20691
            ],
            [
                20691,
                20788
            ],
            [
                20788,
                20880
            ],
            [
                20880,
                20974
            ],
            [
                20974,
                21090
            ],
            [
                21090,
                21133
            ],
            [
                21133,
                21234
            ],
            [
                21234,
                21350
            ],
            [
                21350,
                21389
            ],
            [
                21389,
                21478
            ],
            [
                21478,
                21544
            ],
            [
                21544,
                21657
            ],
            [
                21657,
                21818
            ],
            [
                21818,
                21893
            ],
            [
                21893,
                21958
            ],
            [
                21958,
                22020
            ],
            [
                22020,
                22080
            ],
            [
                22080,
                22097
            ],
            [
                22097,
                22151
            ],
            [
                22151,
                22225
            ],
            [
                22225,
                22325
            ],
            [
                22325,
                22526
            ],
            [
                22526,
                22611
            ],
            [
                22611,
                22723
            ],
            [
                22723,
                22786
            ],
            [
                22786,
                23008
            ],
            [
                23008,
                23071
            ],
            [
                23071,
                23092
            ],
            [
                23092,
                23106
            ],
            [
                23106,
                23166
            ],
            [
                23166,
                23199
            ],
            [
                23199,
                23291
            ],
            [
                23291,
                23427
            ],
            [
                23427,
                23458
            ],
            [
                23458,
                23471
            ],
            [
                23471,
                23493
            ],
            [
                23493,
                23549
            ],
            [
                23549,
                23635
            ],
            [
                23635,
                23679
            ],
            [
                23679,
                23761
            ],
            [
                23761,
                23793
            ],
            [
                23793,
                23827
            ],
            [
                23827,
                23975
            ],
            [
                23975,
                23983
            ],
            [
                23983,
                24015
            ],
            [
                24015,
                24108
            ],
            [
                24108,
                24158
            ],
            [
                24158,
                24414
            ],
            [
                24414,
                24463
            ],
            [
                24463,
                24794
            ],
            [
                24794,
                24809
            ],
            [
                24809,
                24832
            ],
            [
                24832,
                24849
            ],
            [
                24849,
                24894
            ],
            [
                24894,
                25006
            ],
            [
                25006,
                25052
            ],
            [
                25052,
                25095
            ],
            [
                25095,
                25220
            ],
            [
                25220,
                25271
            ],
            [
                25271,
                25359
            ],
            [
                25359,
                25454
            ],
            [
                25454,
                25522
            ],
            [
                25522,
                25564
            ],
            [
                25564,
                25610
            ],
            [
                25610,
                25626
            ],
            [
                25626,
                25654
            ],
            [
                25654,
                25687
            ],
            [
                25687,
                25706
            ],
            [
                25706,
                25716
            ],
            [
                25716,
                25734
            ],
            [
                25734,
                25766
            ],
            [
                25766,
                25849
            ],
            [
                25849,
                25858
            ],
            [
                25858,
                25877
            ],
            [
                25877,
                25928
            ],
            [
                25928,
                25961
            ],
            [
                25961,
                26024
            ],
            [
                26024,
                26070
            ],
            [
                26070,
                26153
            ],
            [
                26153,
                26182
            ],
            [
                26182,
                26219
            ],
            [
                26219,
                26293
            ],
            [
                26293,
                26333
            ],
            [
                26333,
                26372
            ],
            [
                26372,
                26541
            ],
            [
                26541,
                26577
            ],
            [
                26577,
                26599
            ],
            [
                26599,
                26629
            ],
            [
                26629,
                26660
            ],
            [
                26660,
                26727
            ],
            [
                26727,
                26773
            ],
            [
                26773,
                26857
            ],
            [
                26857,
                26911
            ],
            [
                26911,
                26925
            ],
            [
                26925,
                26972
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                33,
                67
            ],
            [
                67,
                101
            ],
            [
                108,
                122
            ],
            [
                132,
                135
            ],
            [
                168,
                173
            ],
            [
                185,
                187
            ],
            [
                187,
                205
            ],
            [
                223,
                256
            ],
            [
                481,
                482
            ],
            [
                305,
                332
            ],
            [
                390,
                393
            ],
            [
                403,
                407
            ],
            [
                341,
                386
            ],
            [
                262,
                269
            ],
            [
                426,
                470
            ],
            [
                297,
                303
            ],
            [
                477,
                481
            ],
            [
                494,
                515
            ],
            [
                537,
                539
            ],
            [
                558,
                565
            ],
            [
                539,
                553
            ],
            [
                584,
                586
            ],
            [
                586,
                667
            ],
            [
                678,
                714
            ],
            [
                714,
                734
            ],
            [
                745,
                777
            ],
            [
                805,
                837
            ],
            [
                927,
                951
            ],
            [
                975,
                977
            ],
            [
                952,
                960
            ],
            [
                1034,
                1036
            ],
            [
                1036,
                1047
            ],
            [
                1081,
                1104
            ],
            [
                1104,
                1137
            ],
            [
                1155,
                1218
            ],
            [
                1228,
                1262
            ],
            [
                1269,
                1272
            ],
            [
                1307,
                1344
            ],
            [
                1344,
                1363
            ],
            [
                1397,
                1428
            ],
            [
                1460,
                1472
            ],
            [
                1478,
                1501
            ],
            [
                1501,
                1548
            ],
            [
                1561,
                1575
            ],
            [
                1672,
                1673
            ],
            [
                1580,
                1606
            ],
            [
                1614,
                1616
            ],
            [
                1658,
                1662
            ],
            [
                1787,
                1789
            ],
            [
                1682,
                1697
            ],
            [
                1631,
                1633
            ],
            [
                1697,
                1741
            ],
            [
                1799,
                1846
            ],
            [
                1851,
                1923
            ],
            [
                1929,
                1950
            ],
            [
                1952,
                1963
            ],
            [
                1743,
                1746
            ],
            [
                1964,
                1972
            ],
            [
                1988,
                1990
            ],
            [
                1990,
                2040
            ],
            [
                2087,
                2088
            ],
            [
                2132,
                2164
            ],
            [
                2295,
                2306
            ],
            [
                2314,
                2318
            ],
            [
                2266,
                2269
            ],
            [
                2324,
                2353
            ],
            [
                2353,
                2416
            ],
            [
                2550,
                2579
            ],
            [
                2591,
                2639
            ],
            [
                2641,
                2677
            ],
            [
                2722,
                2770
            ],
            [
                2770,
                2860
            ],
            [
                2862,
                2917
            ],
            [
                2941,
                3006
            ],
            [
                3006,
                3042
            ],
            [
                3048,
                3058
            ],
            [
                3099,
                3101
            ],
            [
                3082,
                3098
            ],
            [
                3109,
                3141
            ],
            [
                3176,
                3204
            ],
            [
                3407,
                3494
            ],
            [
                3494,
                3510
            ],
            [
                3568,
                3622
            ],
            [
                3635,
                3693
            ],
            [
                3693,
                3704
            ],
            [
                3724,
                3734
            ],
            [
                3742,
                3744
            ],
            [
                3776,
                3780
            ],
            [
                3789,
                3816
            ],
            [
                3826,
                3856
            ],
            [
                3856,
                3909
            ],
            [
                3911,
                3915
            ],
            [
                3921,
                3983
            ],
            [
                3983,
                3984
            ],
            [
                3991,
                4072
            ],
            [
                4085,
                4115
            ],
            [
                4130,
                4133
            ],
            [
                4117,
                4128
            ],
            [
                4145,
                4154
            ],
            [
                4154,
                4210
            ],
            [
                4210,
                4251
            ],
            [
                4260,
                4262
            ],
            [
                4266,
                4301
            ],
            [
                4309,
                4336
            ],
            [
                4338,
                4379
            ],
            [
                4483,
                4553
            ],
            [
                4553,
                4578
            ],
            [
                4578,
                4611
            ],
            [
                4617,
                4631
            ],
            [
                4648,
                4663
            ],
            [
                4665,
                4698
            ],
            [
                4746,
                4776
            ],
            [
                4744,
                4745
            ],
            [
                4698,
                4701
            ],
            [
                4801,
                4853
            ],
            [
                4863,
                4888
            ],
            [
                4902,
                4947
            ],
            [
                4986,
                5034
            ],
            [
                5034,
                5131
            ],
            [
                5131,
                5196
            ],
            [
                5203,
                5236
            ],
            [
                5238,
                5243
            ],
            [
                5252,
                5278
            ],
            [
                5278,
                5331
            ],
            [
                5333,
                5356
            ],
            [
                5362,
                5368
            ],
            [
                5573,
                5619
            ],
            [
                5619,
                5629
            ],
            [
                5629,
                5707
            ],
            [
                5707,
                5720
            ],
            [
                5720,
                5767
            ],
            [
                5767,
                5796
            ],
            [
                5803,
                5849
            ],
            [
                5858,
                5860
            ],
            [
                5860,
                5892
            ],
            [
                5932,
                5945
            ],
            [
                5982,
                6005
            ],
            [
                6005,
                6036
            ],
            [
                6036,
                6037
            ],
            [
                6047,
                6105
            ],
            [
                6105,
                6161
            ],
            [
                6161,
                6190
            ],
            [
                6190,
                6297
            ],
            [
                6297,
                6372
            ],
            [
                6372,
                6407
            ],
            [
                6446,
                6469
            ],
            [
                6514,
                6517
            ],
            [
                6517,
                6605
            ],
            [
                6635,
                6661
            ],
            [
                6619,
                6633
            ],
            [
                6668,
                6683
            ],
            [
                6683,
                6702
            ],
            [
                6707,
                6777
            ],
            [
                6777,
                6873
            ],
            [
                6873,
                6955
            ],
            [
                6964,
                7070
            ],
            [
                7070,
                7075
            ],
            [
                7101,
                7109
            ],
            [
                7119,
                7179
            ],
            [
                7179,
                7261
            ],
            [
                7326,
                7377
            ],
            [
                7568,
                7674
            ],
            [
                7718,
                7781
            ],
            [
                7812,
                7813
            ],
            [
                7821,
                7838
            ],
            [
                7838,
                7927
            ],
            [
                7962,
                8013
            ],
            [
                8020,
                8044
            ],
            [
                8065,
                8067
            ],
            [
                8067,
                8157
            ],
            [
                8173,
                8174
            ],
            [
                8163,
                8173
            ],
            [
                8193,
                8217
            ],
            [
                8217,
                8218
            ],
            [
                8257,
                8292
            ],
            [
                8297,
                8308
            ],
            [
                8314,
                8339
            ],
            [
                8339,
                8374
            ],
            [
                8374,
                8400
            ],
            [
                8459,
                8645
            ],
            [
                8649,
                8682
            ],
            [
                8646,
                8648
            ],
            [
                8683,
                8685
            ],
            [
                8691,
                8705
            ],
            [
                8725,
                8748
            ],
            [
                8767,
                8772
            ],
            [
                8772,
                8824
            ],
            [
                8851,
                8858
            ],
            [
                8879,
                8906
            ],
            [
                8911,
                8977
            ],
            [
                8977,
                9049
            ],
            [
                9049,
                9088
            ],
            [
                9133,
                9136
            ],
            [
                9136,
                9163
            ],
            [
                9163,
                9203
            ],
            [
                9203,
                9270
            ],
            [
                9270,
                9302
            ],
            [
                9318,
                9384
            ],
            [
                9417,
                9433
            ],
            [
                9445,
                9448
            ],
            [
                9483,
                9491
            ],
            [
                9491,
                9574
            ],
            [
                9582,
                9616
            ],
            [
                9762,
                9763
            ],
            [
                9854,
                9879
            ],
            [
                9899,
                9913
            ],
            [
                9621,
                9622
            ],
            [
                9754,
                9757
            ],
            [
                9772,
                9782
            ],
            [
                9766,
                9767
            ],
            [
                9649,
                9676
            ],
            [
                9973,
                9976
            ],
            [
                9686,
                9692
            ],
            [
                9704,
                9739
            ],
            [
                10226,
                10232
            ],
            [
                10237,
                10257
            ],
            [
                10322,
                10373
            ],
            [
                10373,
                10406
            ],
            [
                10415,
                10435
            ],
            [
                10598,
                10603
            ],
            [
                10646,
                10651
            ],
            [
                10657,
                10738
            ],
            [
                10747,
                10810
            ],
            [
                10810,
                10852
            ],
            [
                10868,
                10908
            ],
            [
                10908,
                10922
            ],
            [
                10940,
                10954
            ],
            [
                10954,
                11002
            ],
            [
                11004,
                11011
            ],
            [
                11013,
                11026
            ],
            [
                11159,
                11189
            ],
            [
                11618,
                11621
            ],
            [
                11627,
                11655
            ],
            [
                11886,
                11887
            ],
            [
                11789,
                11792
            ],
            [
                11656,
                11694
            ],
            [
                11695,
                11743
            ],
            [
                11751,
                11788
            ],
            [
                11870,
                11873
            ],
            [
                11598,
                11599
            ],
            [
                11903,
                11949
            ],
            [
                11582,
                11598
            ],
            [
                11950,
                11951
            ],
            [
                11952,
                11957
            ],
            [
                11958,
                11991
            ],
            [
                12082,
                12085
            ],
            [
                12098,
                12129
            ],
            [
                12222,
                12226
            ],
            [
                12228,
                12265
            ],
            [
                12265,
                12384
            ],
            [
                12384,
                12416
            ],
            [
                12423,
                12496
            ],
            [
                12584,
                12619
            ],
            [
                12620,
                12644
            ],
            [
                12651,
                12700
            ],
            [
                12717,
                12719
            ],
            [
                13045,
                13114
            ],
            [
                13160,
                13173
            ],
            [
                13173,
                13205
            ],
            [
                13210,
                13234
            ],
            [
                13234,
                13241
            ],
            [
                13246,
                13254
            ],
            [
                13294,
                13298
            ],
            [
                13318,
                13319
            ],
            [
                13369,
                13378
            ],
            [
                13608,
                13611
            ],
            [
                13535,
                13536
            ],
            [
                13561,
                13562
            ],
            [
                13590,
                13602
            ],
            [
                13541,
                13544
            ],
            [
                13618,
                13621
            ],
            [
                13643,
                13686
            ],
            [
                13686,
                13744
            ],
            [
                13776,
                13797
            ],
            [
                13826,
                13833
            ],
            [
                13844,
                13851
            ],
            [
                13856,
                13881
            ],
            [
                13890,
                13892
            ],
            [
                13892,
                13966
            ],
            [
                13966,
                13986
            ],
            [
                13986,
                14036
            ],
            [
                14065,
                14067
            ],
            [
                14067,
                14102
            ],
            [
                14114,
                14175
            ],
            [
                14175,
                14246
            ],
            [
                14305,
                14322
            ],
            [
                14322,
                14379
            ],
            [
                14398,
                14400
            ],
            [
                14400,
                14426
            ],
            [
                14454,
                14482
            ],
            [
                14482,
                14521
            ],
            [
                14521,
                14539
            ],
            [
                14539,
                14568
            ],
            [
                14568,
                14604
            ],
            [
                14693,
                14724
            ],
            [
                14724,
                14748
            ],
            [
                14748,
                14776
            ],
            [
                14778,
                14810
            ],
            [
                14810,
                14824
            ],
            [
                14824,
                14888
            ],
            [
                14905,
                14977
            ],
            [
                14977,
                15033
            ],
            [
                15033,
                15066
            ],
            [
                15140,
                15216
            ],
            [
                15220,
                15223
            ],
            [
                15264,
                15329
            ],
            [
                15340,
                15375
            ],
            [
                15375,
                15412
            ],
            [
                15423,
                15441
            ],
            [
                15444,
                15456
            ],
            [
                15456,
                15459
            ],
            [
                15472,
                15483
            ],
            [
                15495,
                15500
            ],
            [
                15466,
                15467
            ],
            [
                15484,
                15489
            ],
            [
                15610,
                15612
            ],
            [
                15612,
                15651
            ],
            [
                15679,
                15681
            ],
            [
                15744,
                15747
            ],
            [
                15651,
                15657
            ],
            [
                15695,
                15700
            ],
            [
                15722,
                15743
            ],
            [
                15663,
                15668
            ],
            [
                15752,
                15754
            ],
            [
                15758,
                15778
            ],
            [
                15673,
                15678
            ],
            [
                15788,
                15790
            ],
            [
                15790,
                15861
            ],
            [
                15875,
                15879
            ],
            [
                15909,
                15915
            ],
            [
                15884,
                15887
            ],
            [
                15928,
                15936
            ],
            [
                15937,
                15952
            ],
            [
                16037,
                16039
            ],
            [
                16014,
                16027
            ],
            [
                16095,
                16097
            ],
            [
                16097,
                16101
            ],
            [
                16113,
                16171
            ],
            [
                16190,
                16193
            ],
            [
                16216,
                16217
            ],
            [
                16179,
                16182
            ],
            [
                16222,
                16250
            ],
            [
                16398,
                16399
            ],
            [
                16404,
                16453
            ],
            [
                16261,
                16266
            ],
            [
                16477,
                16480
            ],
            [
                16487,
                16498
            ],
            [
                16520,
                16554
            ],
            [
                16625,
                16627
            ],
            [
                16787,
                16798
            ],
            [
                16799,
                16805
            ],
            [
                16810,
                16853
            ],
            [
                16873,
                16885
            ],
            [
                16899,
                16913
            ],
            [
                16972,
                16974
            ],
            [
                16974,
                17067
            ],
            [
                17089,
                17154
            ],
            [
                17204,
                17206
            ],
            [
                17206,
                17280
            ],
            [
                17280,
                17328
            ],
            [
                17368,
                17370
            ],
            [
                17450,
                17491
            ],
            [
                17504,
                17507
            ],
            [
                17537,
                17542
            ],
            [
                17528,
                17530
            ],
            [
                17547,
                17574
            ],
            [
                17698,
                17700
            ],
            [
                17700,
                17755
            ],
            [
                17756,
                17819
            ],
            [
                17819,
                17833
            ],
            [
                17833,
                17842
            ],
            [
                17850,
                17879
            ],
            [
                17879,
                17926
            ],
            [
                17926,
                18063
            ],
            [
                18063,
                18079
            ],
            [
                18079,
                18133
            ],
            [
                18152,
                18206
            ],
            [
                18206,
                18242
            ],
            [
                18297,
                18298
            ],
            [
                18304,
                18309
            ],
            [
                18364,
                18365
            ],
            [
                18330,
                18335
            ],
            [
                18342,
                18353
            ],
            [
                18381,
                18393
            ],
            [
                18393,
                18515
            ],
            [
                18515,
                18517
            ],
            [
                18529,
                18532
            ],
            [
                18546,
                18559
            ],
            [
                18565,
                18653
            ],
            [
                18653,
                18681
            ],
            [
                18696,
                18697
            ],
            [
                18721,
                18789
            ],
            [
                18789,
                18864
            ],
            [
                18874,
                18886
            ],
            [
                18886,
                18966
            ],
            [
                18977,
                19005
            ],
            [
                19021,
                19036
            ],
            [
                19047,
                19076
            ],
            [
                19076,
                19082
            ],
            [
                19095,
                19115
            ],
            [
                19174,
                19200
            ],
            [
                19216,
                19238
            ],
            [
                19241,
                19244
            ],
            [
                19255,
                19295
            ],
            [
                19323,
                19332
            ],
            [
                19311,
                19319
            ],
            [
                19357,
                19470
            ],
            [
                19470,
                19473
            ],
            [
                19483,
                19488
            ],
            [
                19518,
                19532
            ],
            [
                19555,
                19580
            ],
            [
                19582,
                19617
            ],
            [
                19627,
                19631
            ],
            [
                19633,
                19652
            ],
            [
                19660,
                19661
            ],
            [
                19495,
                19498
            ],
            [
                19662,
                19664
            ],
            [
                19691,
                19699
            ],
            [
                19714,
                19716
            ],
            [
                19770,
                19772
            ],
            [
                19747,
                19755
            ],
            [
                19813,
                19863
            ],
            [
                19913,
                19937
            ],
            [
                19940,
                19943
            ],
            [
                19944,
                19965
            ],
            [
                19974,
                20001
            ],
            [
                20001,
                20034
            ],
            [
                20053,
                20086
            ],
            [
                20122,
                20124
            ],
            [
                20124,
                20192
            ],
            [
                20291,
                20293
            ],
            [
                20297,
                20325
            ],
            [
                20333,
                20379
            ],
            [
                20432,
                20434
            ],
            [
                20434,
                20481
            ],
            [
                20481,
                20499
            ],
            [
                20533,
                20536
            ],
            [
                20543,
                20557
            ],
            [
                20557,
                20629
            ],
            [
                20673,
                20674
            ],
            [
                20631,
                20632
            ],
            [
                20649,
                20654
            ],
            [
                20689,
                20691
            ],
            [
                20691,
                20717
            ],
            [
                20786,
                20788
            ],
            [
                20788,
                20793
            ],
            [
                20817,
                20878
            ],
            [
                20878,
                20880
            ],
            [
                20880,
                20959
            ],
            [
                20972,
                20974
            ],
            [
                20974,
                20994
            ],
            [
                21004,
                21007
            ],
            [
                21088,
                21090
            ],
            [
                21100,
                21133
            ],
            [
                21133,
                21234
            ],
            [
                21234,
                21243
            ],
            [
                21298,
                21348
            ],
            [
                21350,
                21351
            ],
            [
                21380,
                21389
            ],
            [
                21389,
                21420
            ],
            [
                21422,
                21476
            ],
            [
                21544,
                21616
            ],
            [
                21655,
                21657
            ],
            [
                21657,
                21675
            ],
            [
                21689,
                21695
            ],
            [
                21681,
                21688
            ],
            [
                21695,
                21700
            ],
            [
                21715,
                21722
            ],
            [
                21743,
                21748
            ],
            [
                21755,
                21773
            ],
            [
                21803,
                21818
            ],
            [
                21818,
                21893
            ],
            [
                21893,
                21957
            ],
            [
                22020,
                22080
            ],
            [
                22097,
                22151
            ],
            [
                22151,
                22203
            ],
            [
                22223,
                22225
            ],
            [
                22225,
                22249
            ],
            [
                22255,
                22316
            ],
            [
                22322,
                22325
            ],
            [
                22325,
                22429
            ],
            [
                22524,
                22525
            ],
            [
                22432,
                22451
            ],
            [
                22600,
                22602
            ],
            [
                22464,
                22477
            ],
            [
                22526,
                22535
            ],
            [
                22544,
                22560
            ],
            [
                22493,
                22497
            ],
            [
                22511,
                22524
            ],
            [
                22608,
                22611
            ],
            [
                22611,
                22658
            ],
            [
                22682,
                22723
            ],
            [
                22723,
                22786
            ],
            [
                22786,
                22817
            ],
            [
                22825,
                22857
            ],
            [
                22859,
                22876
            ],
            [
                22906,
                22909
            ],
            [
                22880,
                22881
            ],
            [
                22877,
                22880
            ],
            [
                22971,
                23008
            ],
            [
                23071,
                23091
            ],
            [
                23106,
                23166
            ],
            [
                23166,
                23199
            ],
            [
                23199,
                23219
            ],
            [
                23243,
                23253
            ],
            [
                23259,
                23275
            ],
            [
                23289,
                23291
            ],
            [
                23291,
                23299
            ],
            [
                23345,
                23384
            ],
            [
                23425,
                23427
            ],
            [
                23427,
                23458
            ],
            [
                23458,
                23471
            ],
            [
                23471,
                23493
            ],
            [
                23493,
                23511
            ],
            [
                23515,
                23549
            ],
            [
                23549,
                23568
            ],
            [
                23572,
                23599
            ],
            [
                23569,
                23571
            ],
            [
                23633,
                23635
            ],
            [
                23635,
                23679
            ],
            [
                23679,
                23758
            ],
            [
                23827,
                23842
            ],
            [
                23852,
                23975
            ],
            [
                23975,
                23983
            ],
            [
                23983,
                24015
            ],
            [
                24015,
                24044
            ],
            [
                24064,
                24108
            ],
            [
                24108,
                24109
            ],
            [
                24130,
                24158
            ],
            [
                24158,
                24172
            ],
            [
                24174,
                24194
            ],
            [
                24204,
                24244
            ],
            [
                24246,
                24249
            ],
            [
                24261,
                24273
            ],
            [
                24275,
                24287
            ],
            [
                24289,
                24318
            ],
            [
                24347,
                24387
            ],
            [
                24399,
                24407
            ],
            [
                24412,
                24414
            ],
            [
                24414,
                24417
            ],
            [
                24428,
                24463
            ],
            [
                24463,
                24514
            ],
            [
                24520,
                24538
            ],
            [
                24583,
                24655
            ],
            [
                24684,
                24693
            ],
            [
                24694,
                24717
            ],
            [
                24791,
                24794
            ],
            [
                24794,
                24809
            ],
            [
                24809,
                24832
            ],
            [
                24832,
                24849
            ],
            [
                24878,
                24894
            ],
            [
                24894,
                24898
            ],
            [
                24904,
                24931
            ],
            [
                24932,
                24946
            ],
            [
                24973,
                25006
            ],
            [
                25052,
                25095
            ],
            [
                25238,
                25271
            ],
            [
                25271,
                25292
            ],
            [
                25302,
                25359
            ],
            [
                25454,
                25519
            ],
            [
                25565,
                25610
            ],
            [
                25610,
                25619
            ],
            [
                25623,
                25626
            ],
            [
                25626,
                25654
            ],
            [
                25654,
                25667
            ],
            [
                25669,
                25687
            ],
            [
                25687,
                25698
            ],
            [
                25700,
                25706
            ],
            [
                25706,
                25716
            ],
            [
                25716,
                25731
            ],
            [
                25798,
                25849
            ],
            [
                26079,
                26081
            ],
            [
                26108,
                26122
            ],
            [
                26127,
                26135
            ],
            [
                26150,
                26153
            ],
            [
                26153,
                26179
            ],
            [
                26182,
                26219
            ],
            [
                26219,
                26287
            ],
            [
                26293,
                26333
            ],
            [
                26333,
                26372
            ],
            [
                26372,
                26392
            ],
            [
                26403,
                26440
            ],
            [
                26453,
                26456
            ],
            [
                26442,
                26451
            ],
            [
                26470,
                26541
            ],
            [
                26541,
                26577
            ],
            [
                26577,
                26599
            ],
            [
                26599,
                26626
            ],
            [
                26680,
                26720
            ],
            [
                26725,
                26727
            ],
            [
                26727,
                26771
            ],
            [
                26857,
                26858
            ],
            [
                26893,
                26894
            ],
            [
                26896,
                26900
            ],
            [
                26902,
                26911
            ],
            [
                26911,
                26925
            ],
            [
                26925,
                26949
            ],
            [
                26950,
                26972
            ]
        ],
        "row_chars": [
            [
                0,
                67
            ],
            [
                67,
                187
            ],
            [
                187,
                539
            ],
            [
                539,
                586
            ],
            [
                586,
                714
            ],
            [
                714,
                837
            ],
            [
                837,
                927
            ],
            [
                927,
                1036
            ],
            [
                1036,
                1104
            ],
            [
                1104,
                1344
            ],
            [
                1344,
                1501
            ],
            [
                1501,
                1990
            ],
            [
                1990,
                2164
            ],
            [
                2164,
                2353
            ],
            [
                2353,
                2417
            ],
            [
                2417,
                2550
            ],
            [
                2550,
                2770
            ],
            [
                2770,
                3006
            ],
            [
                3006,
                3205
            ],
            [
                3205,
                3273
            ],
            [
                3273,
                3323
            ],
            [
                3323,
                3356
            ],
            [
                3356,
                3407
            ],
            [
                3407,
                3494
            ],
            [
                3494,
                3693
            ],
            [
                3693,
                3856
            ],
            [
                3856,
                3983
            ],
            [
                3983,
                4154
            ],
            [
                4154,
                4210
            ],
            [
                4210,
                4262
            ],
            [
                4262,
                4379
            ],
            [
                4379,
                4434
            ],
            [
                4434,
                4483
            ],
            [
                4483,
                4553
            ],
            [
                4553,
                4578
            ],
            [
                4578,
                4698
            ],
            [
                4698,
                4801
            ],
            [
                4801,
                4947
            ],
            [
                4947,
                5034
            ],
            [
                5034,
                5131
            ],
            [
                5131,
                5278
            ],
            [
                5278,
                5376
            ],
            [
                5376,
                5517
            ],
            [
                5517,
                5573
            ],
            [
                5573,
                5619
            ],
            [
                5619,
                5629
            ],
            [
                5629,
                5707
            ],
            [
                5707,
                5720
            ],
            [
                5720,
                5767
            ],
            [
                5767,
                5860
            ],
            [
                5860,
                5932
            ],
            [
                5932,
                5945
            ],
            [
                5945,
                5982
            ],
            [
                5982,
                6005
            ],
            [
                6005,
                6036
            ],
            [
                6036,
                6105
            ],
            [
                6105,
                6161
            ],
            [
                6161,
                6190
            ],
            [
                6190,
                6297
            ],
            [
                6297,
                6372
            ],
            [
                6372,
                6517
            ],
            [
                6517,
                6605
            ],
            [
                6605,
                6683
            ],
            [
                6683,
                6777
            ],
            [
                6777,
                6873
            ],
            [
                6873,
                7070
            ],
            [
                7070,
                7179
            ],
            [
                7179,
                7674
            ],
            [
                7674,
                7838
            ],
            [
                7838,
                8067
            ],
            [
                8067,
                8217
            ],
            [
                8217,
                8339
            ],
            [
                8339,
                8374
            ],
            [
                8374,
                8400
            ],
            [
                8400,
                8459
            ],
            [
                8459,
                8705
            ],
            [
                8705,
                8772
            ],
            [
                8772,
                8977
            ],
            [
                8977,
                9049
            ],
            [
                9049,
                9136
            ],
            [
                9136,
                9163
            ],
            [
                9163,
                9203
            ],
            [
                9203,
                9270
            ],
            [
                9270,
                9491
            ],
            [
                9491,
                10031
            ],
            [
                10031,
                10226
            ],
            [
                10226,
                10373
            ],
            [
                10373,
                10810
            ],
            [
                10810,
                10908
            ],
            [
                10908,
                10924
            ],
            [
                10924,
                10940
            ],
            [
                10940,
                10954
            ],
            [
                10954,
                11026
            ],
            [
                11026,
                11159
            ],
            [
                11159,
                11192
            ],
            [
                11192,
                11284
            ],
            [
                11284,
                11340
            ],
            [
                11340,
                11428
            ],
            [
                11428,
                11527
            ],
            [
                11527,
                11576
            ],
            [
                11576,
                11950
            ],
            [
                11950,
                12265
            ],
            [
                12265,
                12384
            ],
            [
                12384,
                12496
            ],
            [
                12496,
                12584
            ],
            [
                12584,
                12620
            ],
            [
                12620,
                12719
            ],
            [
                12719,
                12811
            ],
            [
                12811,
                12939
            ],
            [
                12939,
                13045
            ],
            [
                13045,
                13173
            ],
            [
                13173,
                13234
            ],
            [
                13234,
                13378
            ],
            [
                13378,
                13476
            ],
            [
                13476,
                13686
            ],
            [
                13686,
                13892
            ],
            [
                13892,
                13966
            ],
            [
                13966,
                13986
            ],
            [
                13986,
                14067
            ],
            [
                14067,
                14175
            ],
            [
                14175,
                14322
            ],
            [
                14322,
                14400
            ],
            [
                14400,
                14482
            ],
            [
                14482,
                14521
            ],
            [
                14521,
                14539
            ],
            [
                14539,
                14568
            ],
            [
                14568,
                14724
            ],
            [
                14724,
                14748
            ],
            [
                14748,
                14810
            ],
            [
                14810,
                14824
            ],
            [
                14824,
                14977
            ],
            [
                14977,
                15033
            ],
            [
                15033,
                15223
            ],
            [
                15223,
                15264
            ],
            [
                15264,
                15375
            ],
            [
                15375,
                15456
            ],
            [
                15456,
                15612
            ],
            [
                15612,
                15790
            ],
            [
                15790,
                16097
            ],
            [
                16097,
                16171
            ],
            [
                16171,
                16627
            ],
            [
                16627,
                16718
            ],
            [
                16718,
                16787
            ],
            [
                16787,
                16974
            ],
            [
                16974,
                17206
            ],
            [
                17206,
                17280
            ],
            [
                17280,
                17370
            ],
            [
                17370,
                17450
            ],
            [
                17450,
                17700
            ],
            [
                17700,
                17756
            ],
            [
                17756,
                17819
            ],
            [
                17819,
                17833
            ],
            [
                17833,
                17879
            ],
            [
                17879,
                17926
            ],
            [
                17926,
                18063
            ],
            [
                18063,
                18079
            ],
            [
                18079,
                18206
            ],
            [
                18206,
                18393
            ],
            [
                18393,
                18515
            ],
            [
                18515,
                18653
            ],
            [
                18653,
                18681
            ],
            [
                18681,
                18696
            ],
            [
                18696,
                18789
            ],
            [
                18789,
                18886
            ],
            [
                18886,
                18966
            ],
            [
                18966,
                19076
            ],
            [
                19076,
                19241
            ],
            [
                19241,
                19470
            ],
            [
                19470,
                19716
            ],
            [
                19716,
                19863
            ],
            [
                19863,
                19882
            ],
            [
                19882,
                20001
            ],
            [
                20001,
                20124
            ],
            [
                20124,
                20293
            ],
            [
                20293,
                20434
            ],
            [
                20434,
                20481
            ],
            [
                20481,
                20557
            ],
            [
                20557,
                20691
            ],
            [
                20691,
                20788
            ],
            [
                20788,
                20880
            ],
            [
                20880,
                20974
            ],
            [
                20974,
                21090
            ],
            [
                21090,
                21133
            ],
            [
                21133,
                21234
            ],
            [
                21234,
                21389
            ],
            [
                21389,
                21478
            ],
            [
                21478,
                21544
            ],
            [
                21544,
                21657
            ],
            [
                21657,
                21818
            ],
            [
                21818,
                21893
            ],
            [
                21893,
                21958
            ],
            [
                21958,
                22020
            ],
            [
                22020,
                22080
            ],
            [
                22080,
                22097
            ],
            [
                22097,
                22151
            ],
            [
                22151,
                22225
            ],
            [
                22225,
                22325
            ],
            [
                22325,
                22611
            ],
            [
                22611,
                22723
            ],
            [
                22723,
                22786
            ],
            [
                22786,
                23008
            ],
            [
                23008,
                23071
            ],
            [
                23071,
                23092
            ],
            [
                23092,
                23106
            ],
            [
                23106,
                23166
            ],
            [
                23166,
                23199
            ],
            [
                23199,
                23291
            ],
            [
                23291,
                23427
            ],
            [
                23427,
                23458
            ],
            [
                23458,
                23471
            ],
            [
                23471,
                23493
            ],
            [
                23493,
                23549
            ],
            [
                23549,
                23635
            ],
            [
                23635,
                23679
            ],
            [
                23679,
                23761
            ],
            [
                23761,
                23793
            ],
            [
                23793,
                23827
            ],
            [
                23827,
                23975
            ],
            [
                23975,
                23983
            ],
            [
                23983,
                24015
            ],
            [
                24015,
                24108
            ],
            [
                24108,
                24158
            ],
            [
                24158,
                24414
            ],
            [
                24414,
                24463
            ],
            [
                24463,
                24794
            ],
            [
                24794,
                24809
            ],
            [
                24809,
                24832
            ],
            [
                24832,
                24849
            ],
            [
                24849,
                24894
            ],
            [
                24894,
                25006
            ],
            [
                25006,
                25052
            ],
            [
                25052,
                25095
            ],
            [
                25095,
                25220
            ],
            [
                25220,
                25271
            ],
            [
                25271,
                25359
            ],
            [
                25359,
                25454
            ],
            [
                25454,
                25522
            ],
            [
                25522,
                25564
            ],
            [
                25564,
                25610
            ],
            [
                25610,
                25626
            ],
            [
                25626,
                25654
            ],
            [
                25654,
                25687
            ],
            [
                25687,
                25706
            ],
            [
                25706,
                25716
            ],
            [
                25716,
                25734
            ],
            [
                25734,
                25766
            ],
            [
                25766,
                25849
            ],
            [
                25849,
                25858
            ],
            [
                25858,
                25877
            ],
            [
                25877,
                25928
            ],
            [
                25928,
                25961
            ],
            [
                25961,
                26024
            ],
            [
                26024,
                26070
            ],
            [
                26070,
                26153
            ],
            [
                26153,
                26182
            ],
            [
                26182,
                26219
            ],
            [
                26219,
                26293
            ],
            [
                26293,
                26333
            ],
            [
                26333,
                26372
            ],
            [
                26372,
                26541
            ],
            [
                26541,
                26577
            ],
            [
                26577,
                26599
            ],
            [
                26599,
                26629
            ],
            [
                26629,
                26660
            ],
            [
                26660,
                26727
            ],
            [
                26727,
                26773
            ],
            [
                26773,
                26857
            ],
            [
                26857,
                26911
            ],
            [
                26911,
                26925
            ],
            [
                26925,
                26972
            ]
        ]
    },
    "abridged": {
        "text": "The two girls met nobody on their way back to the rectory. They let themselves in noiselessly, and stole upstairs by the early dawn light. Shirley sought her bed; and though the room was strange, and though the recent scene had been unparalleled for excitement and terror by any she had yet witnessed, yet scarce was her head laid on the pillow before deep sleep closed her eyes.\nShirley had perfect health. Though warm-hearted and sympathetic, she was not nervous; powerful emotions could sway without exhausting her spirit. The tempest troubled her while it lasted, but it left her freshness quite unblighted. Caroline now watched her serenely sleeping.\nFor herself, she could not sleep. The commonplace excitement of the school-gathering would alone have sufficed to make her restless; the effect of the terrible drama she had seen was not likely to quit her for days. It was vain even to lie down; she sat up by Shirley's side, watching the sun mount the heavens.\nLife wastes fast in such vigils as Caroline had lately too often kept - vigils during which the mind, with no hope or joyous memories to feed on, tries to live on the meagre diet of wishes; and feeling itself ready to perish with craving, turns to philosophy, to resolution, to resignation; calls on all these for aid, calls vainly - is unheard, and unhelped.\nCaroline was a Christian; therefore in trouble she prayed often, begging for patience, strength, relief. However, it seemed that her prayers were unheard and unaccepted. She believed, sometimes, that God had turned His face from her.\nMost people have had a period in their lives when they have felt thus forsaken - when, having long hoped against hope, their hearts have truly sickened within them. This is a terrible hour, but it is often that darkest point which precedes the rise of day - that turn of the year when the icy January wind carries both the dirge of departing winter and the prophecy of coming spring. The perishing birds, however, cannot understand this as they shiver; and nor can the suffering soul recognize the dawn of its deliverance.\nThe household was astir at last; the servants were up; the shutters were opened below. Caroline, as she rose, felt that revival of spirits which the return of day gives to all but the wholly despairing or actually dying. She dressed carefully, so that none of the forlornness she felt should be visible externally. She looked as fresh as Shirley when both were dressed; only Miss Keeldar's eyes were lively, and Miss Helstone's languid.\n\"Today I shall have much to say to Moore,\" were Shirley's first words; and you could see that life was full of interest and expectation for her. \"He will have to undergo cross-examination,\" she added. \"I dare say he thinks he has outwitted me. This is the way men deal with women - concealing danger from them - thinking, I suppose, to spare them pain. Men, I believe, fancy women's minds something like those of children. Now, that is a mistake.\"\nThis was said as she stood at the mirror, training her hair into curls by twining it round her fingers. As Caroline fastened her dress, she continued:\n\"If men could see us as we really are, they would be amazed; but the cleverest men are often under an illusion about women. They misapprehend them, both for good and evil. Their good woman is a queer thing, half doll, half angel; their bad woman almost always a fiend. Then to hear them fall into ecstasies with each other's creations - worshipping the heroine of such a poem or novel - thinking it fine, divine! Fine and divine it may be, but often quite artificial - false as the rose in my bonnet.\"\n\"Shirley, you chatter so, I can't fasten you. Be still. And, after all, authors' heroines are almost as good as authoresses' heroes.\"\n\"Not at all. Women read men more truly than men read women. I'll prove that in a magazine article some day when I've time; only it will never be published. It will be 'declined with thanks'.\"\n\"To be sure. You don't know enough. You are not learned, Shirley.\"\n\"I can't contradict you, Cary; I'm as ignorant as a stone. There's one comfort, however: you are not much better.\"\nThey descended to breakfast.\n\"I wonder how Mrs. Pryor and Hortense Moore have passed the night,\" said Caroline, as she made the coffee. \"Selfish being that I am, I never thought of either of them till just now. They will have heard all the tumult; and Hortense is timid.\"\n\"Take my word for it, Lina, Moore will have contrived to get his sister out of the way. He will have quartered her with Miss Mann for the night. As to Mrs. Pryor, I confess I am uneasy about her; but in another half-hour we will be with her.\"\nBy this time the news of what had happened at the Hollow was spread all over the neighbourhood. Fanny, who had been to Fieldhead to fetch the milk, returned in panting haste with news that there had been a battle in the night at Mr. Moore's mill, and that some said twenty men were killed. Eliza had been informed by the butcher's boy that the mill was burnt to the ground. Both women rushed into the parlour to announce these terrible facts to the ladies, saying that they were sure master must have been in it all; and Joe Scott's wife and family were in the greatest distress, wondering what had become of their head.\nA knock at the kitchen door announced the Fieldhead errand-boy, with a note from Mrs. Pryor. It was hurriedly written, and urged Miss Keeldar to return directly, as the neighbourhood was all in confusion, and orders would have to be given by the mistress of the hall. In a postscript it was entreated that Miss Helstone might not be left alone at the rectory, but had better accompany Miss Keeldar.\n\"I agree,\" said Shirley, as she tied on her bonnet, and ran to fetch Caroline's.\n\"But what will Fanny and Eliza do? And if my uncle returns?\"\n\"Your uncle will not return yet; he will be galloping backwards and forwards from Briarfield to Stilbro' all day, rousing the magistrates in the court-house and the officers at the barracks; and Fanny and Eliza can have Joe Scott's and the clerk's wives in to keep them company. There is no real danger now. Weeks will elapse before the rioters can again rally; and I expect Moore and Mr. Helstone will take advantage of last night's outbreak to quell them altogether. They will frighten the authorities of Stilbro' into energetic measures. I only hope they will not be too severe.\"\n\"Robert will not be cruel. We saw that last night,\" said Caroline.\n\"But he will be hard,\" retorted Shirley; \"and so will your uncle.\"\nAs they hurried along the meadow path to Fieldhead, they saw the distant highway already alive with horsemen and pedestrians, heading towards the Hollow. On reaching the hall, they found the backyard gates open, and the court and kitchen crowded with excited milk-fetchers - waiting to receive their supplies from the dairy, as was the custom - whom Mrs. Gill, the housekeeper, was vainly trying to persuade to take their milk-cans and depart.\nSeeing the state of matters, Shirley stepped in amongst the gossiping groups. She bade them good-morning with a frank, tranquil ease, and asked if they had all got their milk measured out; and understanding that they had, she observed that she \"wondered what they were waiting for, then.\"\n\"We're just talking a bit over this battle at your mill, mistress,\" replied a man.\n\"Talking a bit!\" said Shirley. \"It is a queer thing all the world is so fond of talking over events. What good does your talking do? You working people should be models of industry, but you are just as gossip-loving as the idle. Fine, rich people that have nothing to do may be excused for trifling their time away; but not you.\"\n\"Should we never have a holiday because we work hard?\" asked a man, smiling.\n\"Never,\" was the prompt answer; \"unless you make a better use of it than to talk scandal at your neighbours' expense. Come, friends,\" she added, changing at once from bluntness to courtesy, \"oblige me by taking your cans and going home. I expect several persons to call today, and it will be inconvenient to have the avenues to the house crowded.\"\nThe yard was clear in five minutes. \"Thank you, and good-bye, friends,\" said Shirley, as she closed the gates.\nEntering by the back way, the young ladies passed through the kitchen to the hall. Mrs. Pryor came running down the staircase to meet them. She was unnerved and pale, and looked alarmed. She felt, more than anything, dissatisfied with herself because she was not more equal to the demands of the occasion.\n\"You are aware,\" she began with a trembling voice, and yet anxious to avoid exaggeration, \"that rioters have attacked Mr. Moore's mill. We heard the firing and confusion very plainly here; we none of us slept. It was a sad night. The house has been in great bustle all the morning. The servants have applied to me for directions, which I really did not feel warranted in giving. Mr. Moore has, I believe, sent up for refreshments for the soldiers and aid for the wounded. I could not undertake the responsibility of giving orders. I fear delay may have been harmful; but this is not my house. You were absent, my dear Miss Keeldar. What could I do?\"\n\"Were no refreshments sent?\" asked Shirley, while her countenance suddenly turned dark and warm.\n\"I think not, my dear.\"\n\"And nothing for the wounded - no linen, no wine, no bedding?\"\n\"I think not. I cannot tell what Mrs. Gill did; but it seemed impossible to me to venture to dispose of your property by sending supplies to soldiers. Provisions for a company of soldiers sounds formidable. How many there are I did not ask; I intended to do what was right, yet I did not see the case quite clearly, I admit.\"\n\"These soldiers have risked their lives in defence of my property: they have a right to my gratitude. The wounded are our fellow-creatures: we should aid them. - Mrs. Gill!\"\nShe called in a clear, penetrating voice. Mrs. Gill, who was deep in bread-making in the kitchen, came at once, not daring even to rub the dough from her hands or shake the flour from her apron. Her mistress had never called a servant in that voice save once before, when Tartar had been fighting with two large carriers' dogs, encouraged by their masters. Then Miss Keeldar had summoned John as if the Day of Judgment were at hand. Without waiting for him, she had walked out into the lane, put her hands round the thick neck of the largest cur, and used all her strength to pull it from Tartar's torn and bleeding head. She had not said a word to anybody during the rest of the day, but sat till evening tending Tartar. She wept furtively over him sometimes, and murmured the softest words of pity and endearment, which the old, scarred, canine warrior acknowledged by licking her hand. As to John, his lady turned a cold shoulder on him for a week afterwards.\nMrs. Gill, remembering this little episode, came promptly. That at such a time Fieldhead should have been inhospitable stung Shirley's haughty spirit to the quick.\n\"How long is it since that message came from the mill?\" she demanded.\n\"Not an hour yet, ma'am,\" answered the housekeeper soothingly.\n\"Not an hour! You might as well have said not a day. They will have applied elsewhere by this time. Send a man instantly down to tell them that everything this house contains is at Mr. Moore's, Mr. Helstone's, and the soldiers' service. Do that first.\"\nWhile the order was being executed, Shirley moved away and stood at the hall-window, silent, unapproachable. When Mrs. Gill came back, she turned, with a flushed cheek and a spark of displeasure firing her glance.\n\"Let the contents of the larder and the wine-cellar be brought up, put into the hay-carts, and driven down to the Hollow. If we have not much bread or meat in the house, go to the butcher and baker, and desire them to send what they have. But I will see for myself.\"\n\"She will get over it in an hour,\" whispered Caroline to Mrs. Pryor. \"Go upstairs, dear madam,\" she added affectionately, \"and try to be as calm as you can. The truth is, Shirley will blame herself more than you before the day is over.\"\nWith a few more gentle assurances, Miss Helstone managed to soothe the agitated lady. Having taken her to her apartment, Caroline left her to see if she could be useful.\nShe found that she could be very useful; for Fieldhead had not many servants, and just now their mistress found plenty of occupation for all the hands at her command, and for her own also. The good-natured help which Caroline gave the housekeeper and maids - all somewhat scared by their lady's mood - did a world of good; and it appeased Shirley herself. She ran over to Caroline, who was carrying a heavy basket up the cellar stairs.\n\"It will strain your arm,\" she cried; took it from her, and bore it out into the yard. The cloud of temper was dispelled; the flash in her eye was melted. She resumed her usual cheerful and cordial manner to those about her.\nShirley was still superintending the loading of the cart, when a gentleman entered the yard.\n\"I hope I see Miss Keeldar well this morning?\" he said, examining her flushed face.\nShe gave him a look, and then again bent to her employment without reply, hiding a smile. The gentleman repeated his greeting.\n\"Well enough,\" was the answer; \"and so is Mr. Moore too, I dare say.\" For the gentleman was he. \"To speak truth, I am not anxious about him; some slight mischance would be only deserved. His conduct has been - let us say strange. May I ask what brings him here?\"\n\"Mr. Helstone and I have just received your message that everything at Fieldhead was at our service. We judged that you would be giving yourself too much trouble; and I see we were correct. We are not a regiment, remember - only about half a dozen soldiers and as many civilians.\"\nMiss Keeldar blushed, while she laughed at her own over-eager generosity. Moore laughed too, though quietly; and ordered baskets to be removed from the cart, and vessels returned to the cellar.\n\"The rector must hear of this,\" he said; \"he will make a good story of it. What an excellent army contractor Miss Keeldar would have been!\"\n\"You ought to be thankful,\" said Shirley, \"and not mock me. How could I gauge your appetites or number your band? For aught I knew, there might have been fifty of you. You told me nothing; and an application to provision soldiers naturally suggests large numbers.\"\n\"It appears so,\" remarked Moore, levelling another of his keen, quiet glances at the discomfited Shirley. - \"Now,\" he continued to the carter, \"Your load is somewhat lighter. Take it to the Hollow.\"\nAs the vehicle rumbled out of the yard, Shirley demanded what had become of the wounded.\n\"There was not a single man hurt on our side,\" was the answer.\n\"You were hurt yourself, on the head,\" interposed a quick, low voice - that of Caroline, in the doorway, who had till now escaped Moore's notice. \"Are you much hurt?\"\n\"As you might scratch your finger with a needle in sewing.\"\n\"Lift your hair and let us see.\"\nHe took his hat off, disclosing a narrow slip of plaster. Caroline nodded slightly to show that she was satisfied, and disappeared inside.\n\"How did she know I was hurt?\" asked Moore.\n\"By rumour, no doubt. But it is too good of her to trouble herself about you. For my part, it was your victims I was thinking of. What damage have your opponents sustained?\"\n\"One of the rioters, or victims as you call them, was killed, and six were hurt. Medical aid was fetched immediately; and as soon as we can get a couple of covered wagons and some clean straw, they will be removed to Stilbro'.\"\n\"Straw! You must have beds and bedding. I will send my wagon directly; and Mr. Yorke, I am sure, will send his.\"\n\"He has volunteered already. And Mrs. Yorke - who, like you, seems to regard the rioters as martyrs, and me and Mr. Helstone as murderers - is at this moment, I believe, fitting it up with feather-beds, pillows and blankets. The victims lack no attentions, I promise you. Mr. Hall, your favourite parson, has been with them since six o'clock, waiting on them like any nurse; and Caroline's good friend, Miss Ainley, sent in a vast stock of lint and linen.\"\n\"That will do. Where is your sister?\"\n\"Well cared for. She is with Miss Mann. This morning the two set out for the resort of Wormwood Wells, and will stay there some weeks.\"\n\"Mighty clever you gentlemen think you are! Why are you not also omniscient? How is it that events occur, under your very noses, of which you have no suspicion? Ah, friend, you may search my countenance, but you cannot read it. You think me a dangerous specimen of my sex. Don't you?\"\n\"A peculiar one, at least.\"\n\"But Caroline - is she peculiar?\"\n\"In her way, yes.\"\n\"Her way! What is her way? She is neither eccentric nor difficult of control. She is not what they call a spirited woman.\"\n\"I have seen her flash out,\" said Moore.\n\"So have I, but not with manly fire. It was a short, vivid, trembling glow, that shot up, shone, vanished-\"\n\"And left her scared at her own daring. You describe others besides Caroline.\"\n\"The point I wish to make is, that Miss Helstone, though gentle and tractable, is still perfectly capable of defying even Mr. Moore's penetration.\"\n\"What have you and she been doing?\" asked Moore suddenly.\n\"Have you had any breakfast? Mrs. Gill will give you something to eat. Step into the oak parlour, and ring the bell.\"\n\"No, I must go back. Good-morning. The first leisure I have, I will see you again.\"",
        "paragraph_chars": [
            [
                0,
                380
            ],
            [
                380,
                656
            ],
            [
                656,
                968
            ],
            [
                968,
                1328
            ],
            [
                1328,
                1562
            ],
            [
                1562,
                2085
            ],
            [
                2085,
                2522
            ],
            [
                2522,
                2970
            ],
            [
                2970,
                3121
            ],
            [
                3121,
                3623
            ],
            [
                3623,
                3757
            ],
            [
                3757,
                3949
            ],
            [
                3949,
                4016
            ],
            [
                4016,
                4131
            ],
            [
                4131,
                4160
            ],
            [
                4160,
                4403
            ],
            [
                4403,
                4646
            ],
            [
                4646,
                5267
            ],
            [
                5267,
                5666
            ],
            [
                5666,
                5747
            ],
            [
                5747,
                5808
            ],
            [
                5808,
                6391
            ],
            [
                6391,
                6458
            ],
            [
                6458,
                6525
            ],
            [
                6525,
                6969
            ],
            [
                6969,
                7258
            ],
            [
                7258,
                7341
            ],
            [
                7341,
                7671
            ],
            [
                7671,
                7748
            ],
            [
                7748,
                8096
            ],
            [
                8096,
                8207
            ],
            [
                8207,
                8513
            ],
            [
                8513,
                9163
            ],
            [
                9163,
                9260
            ],
            [
                9260,
                9284
            ],
            [
                9284,
                9347
            ],
            [
                9347,
                9673
            ],
            [
                9673,
                9847
            ],
            [
                9847,
                10810
            ],
            [
                10810,
                10974
            ],
            [
                10974,
                11044
            ],
            [
                11044,
                11107
            ],
            [
                11107,
                11360
            ],
            [
                11360,
                11574
            ],
            [
                11574,
                11841
            ],
            [
                11841,
                12078
            ],
            [
                12078,
                12248
            ],
            [
                12248,
                12684
            ],
            [
                12684,
                12909
            ],
            [
                12909,
                13002
            ],
            [
                13002,
                13086
            ],
            [
                13086,
                13213
            ],
            [
                13213,
                13476
            ],
            [
                13476,
                13757
            ],
            [
                13757,
                13951
            ],
            [
                13951,
                14091
            ],
            [
                14091,
                14356
            ],
            [
                14356,
                14555
            ],
            [
                14555,
                14644
            ],
            [
                14644,
                14707
            ],
            [
                14707,
                14874
            ],
            [
                14874,
                14934
            ],
            [
                14934,
                14967
            ],
            [
                14967,
                15106
            ],
            [
                15106,
                15150
            ],
            [
                15150,
                15324
            ],
            [
                15324,
                15552
            ],
            [
                15552,
                15665
            ],
            [
                15665,
                16122
            ],
            [
                16122,
                16160
            ],
            [
                16160,
                16296
            ],
            [
                16296,
                16581
            ],
            [
                16581,
                16609
            ],
            [
                16609,
                16643
            ],
            [
                16643,
                16662
            ],
            [
                16662,
                16785
            ],
            [
                16785,
                16826
            ],
            [
                16826,
                16934
            ],
            [
                16934,
                17013
            ],
            [
                17013,
                17161
            ],
            [
                17161,
                17219
            ],
            [
                17219,
                17337
            ],
            [
                17337,
                17420
            ]
        ],
        "segment_chars": [
            [
                0,
                59
            ],
            [
                59,
                139
            ],
            [
                139,
                380
            ],
            [
                380,
                408
            ],
            [
                408,
                526
            ],
            [
                526,
                612
            ],
            [
                612,
                656
            ],
            [
                656,
                690
            ],
            [
                690,
                872
            ],
            [
                872,
                968
            ],
            [
                968,
                1328
            ],
            [
                1328,
                1433
            ],
            [
                1433,
                1498
            ],
            [
                1498,
                1562
            ],
            [
                1562,
                1727
            ],
            [
                1727,
                1946
            ],
            [
                1946,
                2085
            ],
            [
                2085,
                2172
            ],
            [
                2172,
                2306
            ],
            [
                2306,
                2400
            ],
            [
                2400,
                2522
            ],
            [
                2522,
                2667
            ],
            [
                2667,
                2723
            ],
            [
                2723,
                2766
            ],
            [
                2766,
                2875
            ],
            [
                2875,
                2945
            ],
            [
                2945,
                2970
            ],
            [
                2970,
                3074
            ],
            [
                3074,
                3121
            ],
            [
                3121,
                3245
            ],
            [
                3245,
                3293
            ],
            [
                3293,
                3390
            ],
            [
                3390,
                3534
            ],
            [
                3534,
                3623
            ],
            [
                3623,
                3669
            ],
            [
                3669,
                3679
            ],
            [
                3679,
                3757
            ],
            [
                3757,
                3770
            ],
            [
                3770,
                3817
            ],
            [
                3817,
                3913
            ],
            [
                3913,
                3949
            ],
            [
                3949,
                3962
            ],
            [
                3962,
                3985
            ],
            [
                3985,
                4016
            ],
            [
                4016,
                4075
            ],
            [
                4075,
                4131
            ],
            [
                4131,
                4160
            ],
            [
                4160,
                4267
            ],
            [
                4267,
                4342
            ],
            [
                4342,
                4403
            ],
            [
                4403,
                4491
            ],
            [
                4491,
                4548
            ],
            [
                4548,
                4646
            ],
            [
                4646,
                4742
            ],
            [
                4742,
                4936
            ],
            [
                4936,
                5020
            ],
            [
                5020,
                5267
            ],
            [
                5267,
                5360
            ],
            [
                5360,
                5535
            ],
            [
                5535,
                5666
            ],
            [
                5666,
                5747
            ],
            [
                5747,
                5782
            ],
            [
                5782,
                5808
            ],
            [
                5808,
                6087
            ],
            [
                6087,
                6116
            ],
            [
                6116,
                6277
            ],
            [
                6277,
                6349
            ],
            [
                6349,
                6391
            ],
            [
                6391,
                6418
            ],
            [
                6418,
                6458
            ],
            [
                6458,
                6525
            ],
            [
                6525,
                6679
            ],
            [
                6679,
                6969
            ],
            [
                6969,
                7047
            ],
            [
                7047,
                7258
            ],
            [
                7258,
                7341
            ],
            [
                7341,
                7358
            ],
            [
                7358,
                7372
            ],
            [
                7372,
                7442
            ],
            [
                7442,
                7474
            ],
            [
                7474,
                7570
            ],
            [
                7570,
                7671
            ],
            [
                7671,
                7726
            ],
            [
                7726,
                7748
            ],
            [
                7748,
                7866
            ],
            [
                7866,
                7985
            ],
            [
                7985,
                8096
            ],
            [
                8096,
                8132
            ],
            [
                8132,
                8207
            ],
            [
                8207,
                8290
            ],
            [
                8290,
                8347
            ],
            [
                8347,
                8394
            ],
            [
                8394,
                8513
            ],
            [
                8513,
                8649
            ],
            [
                8649,
                8723
            ],
            [
                8723,
                8743
            ],
            [
                8743,
                8795
            ],
            [
                8795,
                8892
            ],
            [
                8892,
                8985
            ],
            [
                8985,
                9044
            ],
            [
                9044,
                9106
            ],
            [
                9106,
                9145
            ],
            [
                9145,
                9163
            ],
            [
                9163,
                9192
            ],
            [
                9192,
                9260
            ],
            [
                9260,
                9284
            ],
            [
                9284,
                9347
            ],
            [
                9347,
                9361
            ],
            [
                9361,
                9498
            ],
            [
                9498,
                9554
            ],
            [
                9554,
                9673
            ],
            [
                9673,
                9775
            ],
            [
                9775,
                9833
            ],
            [
                9833,
                9847
            ],
            [
                9847,
                9889
            ],
            [
                9889,
                10042
            ],
            [
                10042,
                10204
            ],
            [
                10204,
                10280
            ],
            [
                10280,
                10469
            ],
            [
                10469,
                10569
            ],
            [
                10569,
                10736
            ],
            [
                10736,
                10810
            ],
            [
                10810,
                10869
            ],
            [
                10869,
                10974
            ],
            [
                10974,
                11030
            ],
            [
                11030,
                11044
            ],
            [
                11044,
                11107
            ],
            [
                11107,
                11121
            ],
            [
                11121,
                11160
            ],
            [
                11160,
                11207
            ],
            [
                11207,
                11344
            ],
            [
                11344,
                11360
            ],
            [
                11360,
                11469
            ],
            [
                11469,
                11574
            ],
            [
                11574,
                11696
            ],
            [
                11696,
                11813
            ],
            [
                11813,
                11841
            ],
            [
                11841,
                11910
            ],
            [
                11910,
                11998
            ],
            [
                11998,
                12078
            ],
            [
                12078,
                12164
            ],
            [
                12164,
                12248
            ],
            [
                12248,
                12437
            ],
            [
                12437,
                12604
            ],
            [
                12604,
                12684
            ],
            [
                12684,
                12771
            ],
            [
                12771,
                12839
            ],
            [
                12839,
                12909
            ],
            [
                12909,
                13002
            ],
            [
                13002,
                13049
            ],
            [
                13049,
                13086
            ],
            [
                13086,
                13176
            ],
            [
                13176,
                13213
            ],
            [
                13213,
                13283
            ],
            [
                13283,
                13309
            ],
            [
                13309,
                13400
            ],
            [
                13400,
                13443
            ],
            [
                13443,
                13476
            ],
            [
                13476,
                13577
            ],
            [
                13577,
                13666
            ],
            [
                13666,
                13757
            ],
            [
                13757,
                13831
            ],
            [
                13831,
                13951
            ],
            [
                13951,
                14026
            ],
            [
                14026,
                14091
            ],
            [
                14091,
                14151
            ],
            [
                14151,
                14205
            ],
            [
                14205,
                14259
            ],
            [
                14259,
                14356
            ],
            [
                14356,
                14462
            ],
            [
                14462,
                14531
            ],
            [
                14531,
                14555
            ],
            [
                14555,
                14644
            ],
            [
                14644,
                14707
            ],
            [
                14707,
                14853
            ],
            [
                14853,
                14874
            ],
            [
                14874,
                14934
            ],
            [
                14934,
                14967
            ],
            [
                14967,
                15025
            ],
            [
                15025,
                15106
            ],
            [
                15106,
                15137
            ],
            [
                15137,
                15150
            ],
            [
                15150,
                15172
            ],
            [
                15172,
                15228
            ],
            [
                15228,
                15280
            ],
            [
                15280,
                15324
            ],
            [
                15324,
                15405
            ],
            [
                15405,
                15552
            ],
            [
                15552,
                15560
            ],
            [
                15560,
                15592
            ],
            [
                15592,
                15665
            ],
            [
                15665,
                15694
            ],
            [
                15694,
                15890
            ],
            [
                15890,
                15937
            ],
            [
                15937,
                16122
            ],
            [
                16122,
                16137
            ],
            [
                16137,
                16160
            ],
            [
                16160,
                16177
            ],
            [
                16177,
                16200
            ],
            [
                16200,
                16296
            ],
            [
                16296,
                16340
            ],
            [
                16340,
                16373
            ],
            [
                16373,
                16457
            ],
            [
                16457,
                16524
            ],
            [
                16524,
                16569
            ],
            [
                16569,
                16581
            ],
            [
                16581,
                16609
            ],
            [
                16609,
                16643
            ],
            [
                16643,
                16662
            ],
            [
                16662,
                16672
            ],
            [
                16672,
                16689
            ],
            [
                16689,
                16740
            ],
            [
                16740,
                16785
            ],
            [
                16785,
                16826
            ],
            [
                16826,
                16863
            ],
            [
                16863,
                16934
            ],
            [
                16934,
                16974
            ],
            [
                16974,
                17013
            ],
            [
                17013,
                17161
            ],
            [
                17161,
                17197
            ],
            [
                17197,
                17219
            ],
            [
                17219,
                17248
            ],
            [
                17248,
                17290
            ],
            [
                17290,
                17337
            ],
            [
                17337,
                17358
            ],
            [
                17358,
                17372
            ],
            [
                17372,
                17420
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                25,
                59
            ],
            [
                59,
                93
            ],
            [
                99,
                113
            ],
            [
                117,
                120
            ],
            [
                132,
                137
            ],
            [
                137,
                139
            ],
            [
                139,
                157
            ],
            [
                161,
                194
            ],
            [
                194,
                195
            ],
            [
                196,
                223
            ],
            [
                224,
                227
            ],
            [
                228,
                232
            ],
            [
                233,
                278
            ],
            [
                279,
                286
            ],
            [
                300,
                344
            ],
            [
                345,
                351
            ],
            [
                352,
                356
            ],
            [
                357,
                378
            ],
            [
                378,
                380
            ],
            [
                380,
                387
            ],
            [
                392,
                406
            ],
            [
                406,
                408
            ],
            [
                408,
                489
            ],
            [
                490,
                526
            ],
            [
                526,
                546
            ],
            [
                547,
                579
            ],
            [
                580,
                612
            ],
            [
                612,
                636
            ],
            [
                637,
                639
            ],
            [
                646,
                654
            ],
            [
                654,
                656
            ],
            [
                656,
                667
            ],
            [
                667,
                690
            ],
            [
                690,
                723
            ],
            [
                724,
                787
            ],
            [
                787,
                821
            ],
            [
                826,
                829
            ],
            [
                835,
                872
            ],
            [
                872,
                891
            ],
            [
                900,
                931
            ],
            [
                932,
                944
            ],
            [
                945,
                968
            ],
            [
                968,
                1015
            ],
            [
                1023,
                1037
            ],
            [
                1038,
                1039
            ],
            [
                1043,
                1069
            ],
            [
                1075,
                1077
            ],
            [
                1078,
                1082
            ],
            [
                1083,
                1085
            ],
            [
                1086,
                1101
            ],
            [
                1102,
                1104
            ],
            [
                1112,
                1156
            ],
            [
                1158,
                1205
            ],
            [
                1205,
                1277
            ],
            [
                1278,
                1299
            ],
            [
                1302,
                1313
            ],
            [
                1314,
                1317
            ],
            [
                1318,
                1326
            ],
            [
                1326,
                1328
            ],
            [
                1328,
                1378
            ],
            [
                1391,
                1392
            ],
            [
                1401,
                1433
            ],
            [
                1440,
                1451
            ],
            [
                1452,
                1456
            ],
            [
                1457,
                1460
            ],
            [
                1469,
                1498
            ],
            [
                1498,
                1561
            ],
            [
                1562,
                1591
            ],
            [
                1592,
                1640
            ],
            [
                1643,
                1679
            ],
            [
                1679,
                1727
            ],
            [
                1727,
                1817
            ],
            [
                1820,
                1875
            ],
            [
                1881,
                1946
            ],
            [
                1946,
                1982
            ],
            [
                1983,
                1993
            ],
            [
                1999,
                2001
            ],
            [
                2002,
                2018
            ],
            [
                2023,
                2055
            ],
            [
                2056,
                2084
            ],
            [
                2085,
                2172
            ],
            [
                2172,
                2188
            ],
            [
                2193,
                2247
            ],
            [
                2248,
                2306
            ],
            [
                2306,
                2317
            ],
            [
                2318,
                2328
            ],
            [
                2329,
                2331
            ],
            [
                2332,
                2336
            ],
            [
                2342,
                2369
            ],
            [
                2370,
                2400
            ],
            [
                2400,
                2453
            ],
            [
                2455,
                2459
            ],
            [
                2460,
                2522
            ],
            [
                2522,
                2523
            ],
            [
                2529,
                2610
            ],
            [
                2611,
                2641
            ],
            [
                2642,
                2645
            ],
            [
                2646,
                2657
            ],
            [
                2658,
                2667
            ],
            [
                2667,
                2723
            ],
            [
                2723,
                2764
            ],
            [
                2764,
                2766
            ],
            [
                2766,
                2801
            ],
            [
                2804,
                2831
            ],
            [
                2834,
                2875
            ],
            [
                2875,
                2945
            ],
            [
                2945,
                2970
            ],
            [
                2970,
                3003
            ],
            [
                3010,
                3024
            ],
            [
                3025,
                3040
            ],
            [
                3041,
                3074
            ],
            [
                3074,
                3104
            ],
            [
                3104,
                3105
            ],
            [
                3106,
                3109
            ],
            [
                3121,
                3173
            ],
            [
                3174,
                3199
            ],
            [
                3200,
                3245
            ],
            [
                3245,
                3293
            ],
            [
                3293,
                3390
            ],
            [
                3390,
                3455
            ],
            [
                3463,
                3496
            ],
            [
                3500,
                3505
            ],
            [
                3508,
                3534
            ],
            [
                3534,
                3587
            ],
            [
                3590,
                3613
            ],
            [
                3614,
                3620
            ],
            [
                3623,
                3669
            ],
            [
                3669,
                3679
            ],
            [
                3679,
                3757
            ],
            [
                3757,
                3770
            ],
            [
                3770,
                3817
            ],
            [
                3817,
                3846
            ],
            [
                3855,
                3901
            ],
            [
                3911,
                3913
            ],
            [
                3913,
                3945
            ],
            [
                3949,
                3962
            ],
            [
                3962,
                3985
            ],
            [
                3985,
                4016
            ],
            [
                4016,
                4017
            ],
            [
                4017,
                4075
            ],
            [
                4075,
                4131
            ],
            [
                4131,
                4160
            ],
            [
                4160,
                4267
            ],
            [
                4267,
                4342
            ],
            [
                4342,
                4377
            ],
            [
                4377,
                4400
            ],
            [
                4400,
                4403
            ],
            [
                4403,
                4491
            ],
            [
                4491,
                4517
            ],
            [
                4518,
                4532
            ],
            [
                4533,
                4548
            ],
            [
                4548,
                4567
            ],
            [
                4576,
                4646
            ],
            [
                4646,
                4742
            ],
            [
                4742,
                4824
            ],
            [
                4830,
                4936
            ],
            [
                4936,
                4941
            ],
            [
                4942,
                4950
            ],
            [
                4960,
                5020
            ],
            [
                5020,
                5102
            ],
            [
                5110,
                5161
            ],
            [
                5161,
                5267
            ],
            [
                5267,
                5330
            ],
            [
                5336,
                5337
            ],
            [
                5343,
                5360
            ],
            [
                5360,
                5449
            ],
            [
                5454,
                5505
            ],
            [
                5509,
                5533
            ],
            [
                5533,
                5535
            ],
            [
                5535,
                5625
            ],
            [
                5625,
                5626
            ],
            [
                5631,
                5641
            ],
            [
                5642,
                5666
            ],
            [
                5666,
                5667
            ],
            [
                5674,
                5709
            ],
            [
                5710,
                5721
            ],
            [
                5722,
                5747
            ],
            [
                5747,
                5782
            ],
            [
                5782,
                5808
            ],
            [
                5841,
                6027
            ],
            [
                6028,
                6061
            ],
            [
                6062,
                6064
            ],
            [
                6065,
                6067
            ],
            [
                6073,
                6087
            ],
            [
                6087,
                6110
            ],
            [
                6111,
                6116
            ],
            [
                6116,
                6168
            ],
            [
                6168,
                6175
            ],
            [
                6183,
                6210
            ],
            [
                6211,
                6277
            ],
            [
                6277,
                6349
            ],
            [
                6349,
                6388
            ],
            [
                6388,
                6391
            ],
            [
                6391,
                6418
            ],
            [
                6418,
                6458
            ],
            [
                6458,
                6525
            ],
            [
                6525,
                6557
            ],
            [
                6558,
                6624
            ],
            [
                6634,
                6650
            ],
            [
                6667,
                6670
            ],
            [
                6671,
                6679
            ],
            [
                6679,
                6762
            ],
            [
                6763,
                6797
            ],
            [
                6798,
                6799
            ],
            [
                6808,
                6833
            ],
            [
                6834,
                6848
            ],
            [
                6848,
                6849
            ],
            [
                6853,
                6856
            ],
            [
                6857,
                6867
            ],
            [
                6868,
                6869
            ],
            [
                6875,
                6902
            ],
            [
                6903,
                6906
            ],
            [
                6907,
                6913
            ],
            [
                6933,
                6968
            ],
            [
                6969,
                6975
            ],
            [
                6976,
                6996
            ],
            [
                6996,
                7047
            ],
            [
                7047,
                7080
            ],
            [
                7081,
                7101
            ],
            [
                7101,
                7106
            ],
            [
                7107,
                7112
            ],
            [
                7113,
                7194
            ],
            [
                7195,
                7258
            ],
            [
                7258,
                7300
            ],
            [
                7301,
                7341
            ],
            [
                7341,
                7355
            ],
            [
                7358,
                7372
            ],
            [
                7372,
                7420
            ],
            [
                7421,
                7428
            ],
            [
                7429,
                7442
            ],
            [
                7442,
                7472
            ],
            [
                7474,
                7477
            ],
            [
                7493,
                7521
            ],
            [
                7521,
                7522
            ],
            [
                7527,
                7530
            ],
            [
                7531,
                7569
            ],
            [
                7570,
                7618
            ],
            [
                7619,
                7656
            ],
            [
                7668,
                7671
            ],
            [
                7671,
                7672
            ],
            [
                7679,
                7725
            ],
            [
                7732,
                7748
            ],
            [
                7748,
                7749
            ],
            [
                7749,
                7754
            ],
            [
                7754,
                7787
            ],
            [
                7788,
                7791
            ],
            [
                7792,
                7823
            ],
            [
                7824,
                7828
            ],
            [
                7829,
                7866
            ],
            [
                7866,
                7985
            ],
            [
                7985,
                8017
            ],
            [
                8023,
                8096
            ],
            [
                8096,
                8131
            ],
            [
                8132,
                8156
            ],
            [
                8156,
                8205
            ],
            [
                8205,
                8207
            ],
            [
                8207,
                8276
            ],
            [
                8277,
                8290
            ],
            [
                8290,
                8322
            ],
            [
                8323,
                8347
            ],
            [
                8347,
                8354
            ],
            [
                8355,
                8363
            ],
            [
                8368,
                8372
            ],
            [
                8372,
                8373
            ],
            [
                8385,
                8394
            ],
            [
                8394,
                8397
            ],
            [
                8402,
                8403
            ],
            [
                8422,
                8423
            ],
            [
                8437,
                8449
            ],
            [
                8462,
                8465
            ],
            [
                8466,
                8469
            ],
            [
                8470,
                8513
            ],
            [
                8513,
                8571
            ],
            [
                8580,
                8601
            ],
            [
                8601,
                8608
            ],
            [
                8609,
                8616
            ],
            [
                8622,
                8647
            ],
            [
                8647,
                8649
            ],
            [
                8649,
                8723
            ],
            [
                8723,
                8743
            ],
            [
                8743,
                8793
            ],
            [
                8793,
                8795
            ],
            [
                8795,
                8830
            ],
            [
                8831,
                8892
            ],
            [
                8892,
                8963
            ],
            [
                8968,
                8985
            ],
            [
                8985,
                9042
            ],
            [
                9042,
                9044
            ],
            [
                9044,
                9070
            ],
            [
                9078,
                9106
            ],
            [
                9106,
                9145
            ],
            [
                9145,
                9163
            ],
            [
                9163,
                9192
            ],
            [
                9192,
                9228
            ],
            [
                9229,
                9260
            ],
            [
                9260,
                9284
            ],
            [
                9284,
                9312
            ],
            [
                9315,
                9347
            ],
            [
                9347,
                9361
            ],
            [
                9361,
                9425
            ],
            [
                9426,
                9498
            ],
            [
                9498,
                9554
            ],
            [
                9554,
                9587
            ],
            [
                9588,
                9664
            ],
            [
                9670,
                9673
            ],
            [
                9674,
                9739
            ],
            [
                9740,
                9775
            ],
            [
                9775,
                9812
            ],
            [
                9813,
                9831
            ],
            [
                9835,
                9847
            ],
            [
                9847,
                9850
            ],
            [
                9851,
                9862
            ],
            [
                9863,
                9868
            ],
            [
                9868,
                9869
            ],
            [
                9882,
                9887
            ],
            [
                9887,
                9889
            ],
            [
                9889,
                9928
            ],
            [
                9929,
                9931
            ],
            [
                9932,
                9935
            ],
            [
                9943,
                9949
            ],
            [
                9957,
                9962
            ],
            [
                9975,
                9996
            ],
            [
                10001,
                10006
            ],
            [
                10007,
                10009
            ],
            [
                10010,
                10030
            ],
            [
                10035,
                10040
            ],
            [
                10040,
                10042
            ],
            [
                10042,
                10113
            ],
            [
                10114,
                10118
            ],
            [
                10119,
                10125
            ],
            [
                10126,
                10129
            ],
            [
                10144,
                10152
            ],
            [
                10159,
                10174
            ],
            [
                10186,
                10188
            ],
            [
                10189,
                10202
            ],
            [
                10202,
                10204
            ],
            [
                10204,
                10208
            ],
            [
                10222,
                10280
            ],
            [
                10296,
                10299
            ],
            [
                10303,
                10304
            ],
            [
                10305,
                10308
            ],
            [
                10309,
                10337
            ],
            [
                10337,
                10338
            ],
            [
                10339,
                10388
            ],
            [
                10392,
                10397
            ],
            [
                10407,
                10410
            ],
            [
                10411,
                10422
            ],
            [
                10428,
                10462
            ],
            [
                10467,
                10469
            ],
            [
                10469,
                10480
            ],
            [
                10486,
                10492
            ],
            [
                10496,
                10539
            ],
            [
                10540,
                10552
            ],
            [
                10553,
                10567
            ],
            [
                10567,
                10569
            ],
            [
                10569,
                10662
            ],
            [
                10669,
                10734
            ],
            [
                10734,
                10736
            ],
            [
                10736,
                10810
            ],
            [
                10810,
                10858
            ],
            [
                10867,
                10869
            ],
            [
                10869,
                10910
            ],
            [
                10916,
                10919
            ],
            [
                10929,
                10934
            ],
            [
                10942,
                10944
            ],
            [
                10945,
                10972
            ],
            [
                10972,
                10974
            ],
            [
                10974,
                11029
            ],
            [
                11044,
                11107
            ],
            [
                11107,
                11121
            ],
            [
                11121,
                11130
            ],
            [
                11131,
                11160
            ],
            [
                11160,
                11207
            ],
            [
                11207,
                11344
            ],
            [
                11344,
                11360
            ],
            [
                11360,
                11414
            ],
            [
                11415,
                11469
            ],
            [
                11469,
                11505
            ],
            [
                11512,
                11513
            ],
            [
                11522,
                11527
            ],
            [
                11532,
                11533
            ],
            [
                11534,
                11539
            ],
            [
                11543,
                11554
            ],
            [
                11562,
                11574
            ],
            [
                11574,
                11696
            ],
            [
                11696,
                11698
            ],
            [
                11707,
                11710
            ],
            [
                11711,
                11724
            ],
            [
                11725,
                11813
            ],
            [
                11813,
                11841
            ],
            [
                11841,
                11842
            ],
            [
                11842,
                11910
            ],
            [
                11910,
                11985
            ],
            [
                11986,
                11998
            ],
            [
                11998,
                12078
            ],
            [
                12083,
                12111
            ],
            [
                12111,
                12126
            ],
            [
                12135,
                12164
            ],
            [
                12164,
                12170
            ],
            [
                12177,
                12197
            ],
            [
                12197,
                12223
            ],
            [
                12224,
                12246
            ],
            [
                12248,
                12251
            ],
            [
                12252,
                12292
            ],
            [
                12293,
                12302
            ],
            [
                12316,
                12324
            ],
            [
                12324,
                12437
            ],
            [
                12437,
                12440
            ],
            [
                12441,
                12446
            ],
            [
                12459,
                12473
            ],
            [
                12479,
                12504
            ],
            [
                12507,
                12542
            ],
            [
                12543,
                12547
            ],
            [
                12550,
                12569
            ],
            [
                12569,
                12570
            ],
            [
                12571,
                12574
            ],
            [
                12575,
                12577
            ],
            [
                12578,
                12586
            ],
            [
                12602,
                12604
            ],
            [
                12617,
                12619
            ],
            [
                12620,
                12628
            ],
            [
                12634,
                12684
            ],
            [
                12684,
                12708
            ],
            [
                12711,
                12714
            ],
            [
                12722,
                12743
            ],
            [
                12744,
                12771
            ],
            [
                12771,
                12804
            ],
            [
                12804,
                12837
            ],
            [
                12837,
                12839
            ],
            [
                12839,
                12907
            ],
            [
                12907,
                12909
            ],
            [
                12917,
                12945
            ],
            [
                12954,
                13000
            ],
            [
                13000,
                13002
            ],
            [
                13002,
                13049
            ],
            [
                13049,
                13067
            ],
            [
                13068,
                13071
            ],
            [
                13072,
                13086
            ],
            [
                13086,
                13158
            ],
            [
                13158,
                13159
            ],
            [
                13167,
                13168
            ],
            [
                13169,
                13174
            ],
            [
                13174,
                13176
            ],
            [
                13176,
                13202
            ],
            [
                13211,
                13213
            ],
            [
                13213,
                13218
            ],
            [
                13219,
                13280
            ],
            [
                13307,
                13309
            ],
            [
                13310,
                13389
            ],
            [
                13398,
                13400
            ],
            [
                13400,
                13420
            ],
            [
                13430,
                13433
            ],
            [
                13441,
                13443
            ],
            [
                13443,
                13476
            ],
            [
                13476,
                13577
            ],
            [
                13577,
                13586
            ],
            [
                13587,
                13637
            ],
            [
                13643,
                13644
            ],
            [
                13657,
                13666
            ],
            [
                13666,
                13697
            ],
            [
                13700,
                13754
            ],
            [
                13757,
                13829
            ],
            [
                13829,
                13831
            ],
            [
                13831,
                13849
            ],
            [
                13850,
                13856
            ],
            [
                13857,
                13864
            ],
            [
                13864,
                13869
            ],
            [
                13870,
                13877
            ],
            [
                13886,
                13891
            ],
            [
                13900,
                13918
            ],
            [
                13936,
                13951
            ],
            [
                13951,
                14026
            ],
            [
                14026,
                14090
            ],
            [
                14091,
                14151
            ],
            [
                14151,
                14205
            ],
            [
                14205,
                14257
            ],
            [
                14257,
                14259
            ],
            [
                14259,
                14283
            ],
            [
                14284,
                14345
            ],
            [
                14353,
                14356
            ],
            [
                14356,
                14460
            ],
            [
                14460,
                14461
            ],
            [
                14464,
                14483
            ],
            [
                14484,
                14486
            ],
            [
                14487,
                14500
            ],
            [
                14500,
                14509
            ],
            [
                14513,
                14529
            ],
            [
                14531,
                14535
            ],
            [
                14539,
                14552
            ],
            [
                14552,
                14555
            ],
            [
                14555,
                14602
            ],
            [
                14603,
                14644
            ],
            [
                14644,
                14707
            ],
            [
                14707,
                14738
            ],
            [
                14743,
                14775
            ],
            [
                14778,
                14795
            ],
            [
                14799,
                14802
            ],
            [
                14810,
                14811
            ],
            [
                14812,
                14815
            ],
            [
                14816,
                14853
            ],
            [
                14853,
                14873
            ],
            [
                14874,
                14934
            ],
            [
                14934,
                14967
            ],
            [
                14967,
                14987
            ],
            [
                14988,
                14998
            ],
            [
                14999,
                15015
            ],
            [
                15023,
                15025
            ],
            [
                15025,
                15033
            ],
            [
                15058,
                15097
            ],
            [
                15104,
                15106
            ],
            [
                15106,
                15137
            ],
            [
                15137,
                15150
            ],
            [
                15150,
                15172
            ],
            [
                15172,
                15190
            ],
            [
                15194,
                15228
            ],
            [
                15228,
                15247
            ],
            [
                15248,
                15275
            ],
            [
                15276,
                15278
            ],
            [
                15278,
                15280
            ],
            [
                15280,
                15324
            ],
            [
                15324,
                15403
            ],
            [
                15405,
                15420
            ],
            [
                15429,
                15552
            ],
            [
                15552,
                15560
            ],
            [
                15560,
                15592
            ],
            [
                15592,
                15621
            ],
            [
                15621,
                15665
            ],
            [
                15665,
                15666
            ],
            [
                15666,
                15694
            ],
            [
                15694,
                15708
            ],
            [
                15711,
                15731
            ],
            [
                15732,
                15772
            ],
            [
                15773,
                15776
            ],
            [
                15777,
                15789
            ],
            [
                15790,
                15802
            ],
            [
                15805,
                15834
            ],
            [
                15835,
                15875
            ],
            [
                15880,
                15888
            ],
            [
                15888,
                15890
            ],
            [
                15890,
                15893
            ],
            [
                15902,
                15937
            ],
            [
                15937,
                15988
            ],
            [
                15989,
                16007
            ],
            [
                16008,
                16080
            ],
            [
                16081,
                16090
            ],
            [
                16096,
                16119
            ],
            [
                16119,
                16122
            ],
            [
                16122,
                16137
            ],
            [
                16137,
                16160
            ],
            [
                16160,
                16177
            ],
            [
                16184,
                16200
            ],
            [
                16200,
                16204
            ],
            [
                16205,
                16232
            ],
            [
                16247,
                16261
            ],
            [
                16263,
                16296
            ],
            [
                16297,
                16340
            ],
            [
                16340,
                16373
            ],
            [
                16373,
                16394
            ],
            [
                16400,
                16457
            ],
            [
                16457,
                16522
            ],
            [
                16524,
                16569
            ],
            [
                16569,
                16578
            ],
            [
                16578,
                16581
            ],
            [
                16581,
                16609
            ],
            [
                16609,
                16622
            ],
            [
                16625,
                16643
            ],
            [
                16643,
                16654
            ],
            [
                16656,
                16662
            ],
            [
                16662,
                16672
            ],
            [
                16672,
                16687
            ],
            [
                16689,
                16740
            ],
            [
                16744,
                16746
            ],
            [
                16751,
                16765
            ],
            [
                16768,
                16776
            ],
            [
                16782,
                16785
            ],
            [
                16785,
                16811
            ],
            [
                16826,
                16863
            ],
            [
                16863,
                16931
            ],
            [
                16934,
                16974
            ],
            [
                16974,
                17013
            ],
            [
                17013,
                17033
            ],
            [
                17039,
                17076
            ],
            [
                17077,
                17080
            ],
            [
                17081,
                17090
            ],
            [
                17090,
                17161
            ],
            [
                17161,
                17197
            ],
            [
                17197,
                17219
            ],
            [
                17219,
                17246
            ],
            [
                17248,
                17288
            ],
            [
                17288,
                17290
            ],
            [
                17290,
                17334
            ],
            [
                17337,
                17338
            ],
            [
                17342,
                17343
            ],
            [
                17344,
                17348
            ],
            [
                17349,
                17358
            ],
            [
                17358,
                17372
            ],
            [
                17372,
                17396
            ],
            [
                17398,
                17420
            ]
        ],
        "row_chars": [
            [
                0,
                59
            ],
            [
                59,
                139
            ],
            [
                139,
                380
            ],
            [
                380,
                408
            ],
            [
                408,
                526
            ],
            [
                526,
                612
            ],
            [
                612,
                612
            ],
            [
                612,
                656
            ],
            [
                656,
                690
            ],
            [
                690,
                872
            ],
            [
                872,
                968
            ],
            [
                968,
                1328
            ],
            [
                1328,
                1433
            ],
            [
                1433,
                1498
            ],
            [
                1498,
                1562
            ],
            [
                1562,
                1562
            ],
            [
                1562,
                1727
            ],
            [
                1727,
                1946
            ],
            [
                1946,
                2085
            ],
            [
                2085,
                2085
            ],
            [
                2085,
                2085
            ],
            [
                2085,
                2085
            ],
            [
                2085,
                2085
            ],
            [
                2085,
                2172
            ],
            [
                2172,
                2306
            ],
            [
                2306,
                2400
            ],
            [
                2400,
                2522
            ],
            [
                2522,
                2667
            ],
            [
                2667,
                2723
            ],
            [
                2723,
                2766
            ],
            [
                2766,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2945
            ],
            [
                2945,
                2970
            ],
            [
                2970,
                3074
            ],
            [
                3074,
                3121
            ],
            [
                3121,
                3245
            ],
            [
                3245,
                3293
            ],
            [
                3293,
                3390
            ],
            [
                3390,
                3534
            ],
            [
                3534,
                3623
            ],
            [
                3623,
                3623
            ],
            [
                3623,
                3623
            ],
            [
                3623,
                3669
            ],
            [
                3669,
                3679
            ],
            [
                3679,
                3757
            ],
            [
                3757,
                3770
            ],
            [
                3770,
                3817
            ],
            [
                3817,
                3913
            ],
            [
                3913,
                3949
            ],
            [
                3949,
                3962
            ],
            [
                3962,
                3962
            ],
            [
                3962,
                3985
            ],
            [
                3985,
                4016
            ],
            [
                4016,
                4075
            ],
            [
                4075,
                4131
            ],
            [
                4131,
                4160
            ],
            [
                4160,
                4267
            ],
            [
                4267,
                4342
            ],
            [
                4342,
                4403
            ],
            [
                4403,
                4491
            ],
            [
                4491,
                4548
            ],
            [
                4548,
                4646
            ],
            [
                4646,
                4742
            ],
            [
                4742,
                4936
            ],
            [
                4936,
                5020
            ],
            [
                5020,
                5267
            ],
            [
                5267,
                5360
            ],
            [
                5360,
                5535
            ],
            [
                5535,
                5666
            ],
            [
                5666,
                5747
            ],
            [
                5747,
                5782
            ],
            [
                5782,
                5808
            ],
            [
                5808,
                5808
            ],
            [
                5808,
                6087
            ],
            [
                6087,
                6116
            ],
            [
                6116,
                6277
            ],
            [
                6277,
                6349
            ],
            [
                6349,
                6391
            ],
            [
                6391,
                6418
            ],
            [
                6418,
                6458
            ],
            [
                6458,
                6525
            ],
            [
                6525,
                6679
            ],
            [
                6679,
                6969
            ],
            [
                6969,
                6969
            ],
            [
                6969,
                7047
            ],
            [
                7047,
                7258
            ],
            [
                7258,
                7341
            ],
            [
                7341,
                7358
            ],
            [
                7358,
                7358
            ],
            [
                7358,
                7372
            ],
            [
                7372,
                7442
            ],
            [
                7442,
                7442
            ],
            [
                7442,
                7474
            ],
            [
                7474,
                7474
            ],
            [
                7474,
                7474
            ],
            [
                7474,
                7474
            ],
            [
                7474,
                7474
            ],
            [
                7474,
                7474
            ],
            [
                7474,
                7748
            ],
            [
                7748,
                7866
            ],
            [
                7866,
                7985
            ],
            [
                7985,
                8096
            ],
            [
                8096,
                8096
            ],
            [
                8096,
                8132
            ],
            [
                8132,
                8207
            ],
            [
                8207,
                8207
            ],
            [
                8207,
                8207
            ],
            [
                8207,
                8207
            ],
            [
                8207,
                8290
            ],
            [
                8290,
                8347
            ],
            [
                8347,
                8394
            ],
            [
                8394,
                8394
            ],
            [
                8394,
                8513
            ],
            [
                8513,
                8649
            ],
            [
                8649,
                8723
            ],
            [
                8723,
                8743
            ],
            [
                8743,
                8795
            ],
            [
                8795,
                8892
            ],
            [
                8892,
                8985
            ],
            [
                8985,
                9044
            ],
            [
                9044,
                9106
            ],
            [
                9106,
                9145
            ],
            [
                9145,
                9163
            ],
            [
                9163,
                9192
            ],
            [
                9192,
                9260
            ],
            [
                9260,
                9284
            ],
            [
                9284,
                9347
            ],
            [
                9347,
                9361
            ],
            [
                9361,
                9498
            ],
            [
                9498,
                9554
            ],
            [
                9554,
                9673
            ],
            [
                9673,
                9673
            ],
            [
                9673,
                9775
            ],
            [
                9775,
                9847
            ],
            [
                9847,
                9889
            ],
            [
                9889,
                10042
            ],
            [
                10042,
                10204
            ],
            [
                10204,
                10280
            ],
            [
                10280,
                10469
            ],
            [
                10469,
                10469
            ],
            [
                10469,
                10469
            ],
            [
                10469,
                10569
            ],
            [
                10569,
                10736
            ],
            [
                10736,
                10810
            ],
            [
                10810,
                10869
            ],
            [
                10869,
                10869
            ],
            [
                10869,
                10974
            ],
            [
                10974,
                11044
            ],
            [
                11044,
                11107
            ],
            [
                11107,
                11121
            ],
            [
                11121,
                11160
            ],
            [
                11160,
                11207
            ],
            [
                11207,
                11344
            ],
            [
                11344,
                11360
            ],
            [
                11360,
                11469
            ],
            [
                11469,
                11574
            ],
            [
                11574,
                11696
            ],
            [
                11696,
                11813
            ],
            [
                11813,
                11841
            ],
            [
                11841,
                11841
            ],
            [
                11841,
                11910
            ],
            [
                11910,
                11998
            ],
            [
                11998,
                12078
            ],
            [
                12078,
                12164
            ],
            [
                12164,
                12248
            ],
            [
                12248,
                12437
            ],
            [
                12437,
                12604
            ],
            [
                12604,
                12684
            ],
            [
                12684,
                12684
            ],
            [
                12684,
                12771
            ],
            [
                12771,
                12839
            ],
            [
                12839,
                12909
            ],
            [
                12909,
                13002
            ],
            [
                13002,
                13049
            ],
            [
                13049,
                13086
            ],
            [
                13086,
                13176
            ],
            [
                13176,
                13213
            ],
            [
                13213,
                13309
            ],
            [
                13309,
                13400
            ],
            [
                13400,
                13443
            ],
            [
                13443,
                13476
            ],
            [
                13476,
                13577
            ],
            [
                13577,
                13666
            ],
            [
                13666,
                13757
            ],
            [
                13757,
                13757
            ],
            [
                13757,
                13831
            ],
            [
                13831,
                13951
            ],
            [
                13951,
                14026
            ],
            [
                14026,
                14091
            ],
            [
                14091,
                14091
            ],
            [
                14091,
                14151
            ],
            [
                14151,
                14151
            ],
            [
                14151,
                14205
            ],
            [
                14205,
                14259
            ],
            [
                14259,
                14356
            ],
            [
                14356,
                14555
            ],
            [
                14555,
                14644
            ],
            [
                14644,
                14707
            ],
            [
                14707,
                14853
            ],
            [
                14853,
                14853
            ],
            [
                14853,
                14874
            ],
            [
                14874,
                14874
            ],
            [
                14874,
                14934
            ],
            [
                14934,
                14967
            ],
            [
                14967,
                15025
            ],
            [
                15025,
                15106
            ],
            [
                15106,
                15137
            ],
            [
                15137,
                15150
            ],
            [
                15150,
                15172
            ],
            [
                15172,
                15228
            ],
            [
                15228,
                15280
            ],
            [
                15280,
                15324
            ],
            [
                15324,
                15405
            ],
            [
                15405,
                15405
            ],
            [
                15405,
                15405
            ],
            [
                15405,
                15552
            ],
            [
                15552,
                15560
            ],
            [
                15560,
                15592
            ],
            [
                15592,
                15665
            ],
            [
                15665,
                15694
            ],
            [
                15694,
                15890
            ],
            [
                15890,
                15937
            ],
            [
                15937,
                16122
            ],
            [
                16122,
                16137
            ],
            [
                16137,
                16160
            ],
            [
                16160,
                16177
            ],
            [
                16177,
                16200
            ],
            [
                16200,
                16296
            ],
            [
                16296,
                16296
            ],
            [
                16296,
                16340
            ],
            [
                16340,
                16340
            ],
            [
                16340,
                16373
            ],
            [
                16373,
                16457
            ],
            [
                16457,
                16457
            ],
            [
                16457,
                16524
            ],
            [
                16524,
                16524
            ],
            [
                16524,
                16569
            ],
            [
                16569,
                16581
            ],
            [
                16581,
                16609
            ],
            [
                16609,
                16643
            ],
            [
                16643,
                16662
            ],
            [
                16662,
                16672
            ],
            [
                16672,
                16689
            ],
            [
                16689,
                16689
            ],
            [
                16689,
                16740
            ],
            [
                16740,
                16740
            ],
            [
                16740,
                16740
            ],
            [
                16740,
                16740
            ],
            [
                16740,
                16740
            ],
            [
                16740,
                16740
            ],
            [
                16740,
                16740
            ],
            [
                16740,
                16785
            ],
            [
                16785,
                16826
            ],
            [
                16826,
                16863
            ],
            [
                16863,
                16934
            ],
            [
                16934,
                16974
            ],
            [
                16974,
                17013
            ],
            [
                17013,
                17161
            ],
            [
                17161,
                17197
            ],
            [
                17197,
                17219
            ],
            [
                17219,
                17248
            ],
            [
                17248,
                17248
            ],
            [
                17248,
                17290
            ],
            [
                17290,
                17337
            ],
            [
                17337,
                17337
            ],
            [
                17337,
                17358
            ],
            [
                17358,
                17372
            ],
            [
                17372,
                17420
            ]
        ]
    }
}