{
    "original": {
        "text": "Louis Moore was used to a quiet life. Being a quiet man, he endured it better than most men would. Having a large world of his own in his own head and heart, he tolerated confinement to a small, still corner of the real world very patiently.\nHow hushed is Fieldhead this evening! All but Moore--Miss Keeldar, the whole family of the Sympsons, even Henry--are gone to Nunnely. Sir Philip would have them come; he wished to make them acquainted with his mother and sisters, who are now at the priory. Kind gentleman as the baronet is, he asked the tutor too; but the tutor would much sooner have made an appointment with the ghost of the Earl of Huntingdon to meet him, and a shadowy ring of his merry men, under the canopy of the thickest, blackest, oldest oak in Nunnely Forest. Yes, he would rather have appointed tryst with a phantom abbess, or mist-pale nun, among the wet and weedy relics of that ruined sanctuary of theirs, mouldering in the core of the wood. Louis Moore longs to have something near him to-night; but not the boy-baronet, nor his benevolent but stern mother, nor his patrician sisters, nor one soul of the Sympsons.\nThis night is not calm; the equinox still struggles in its storms. The wild rains of the day are abated; the great single cloud disparts and rolls away from heaven, not passing and leaving a sea all sapphire, but tossed buoyant before a continued, long-sounding, high-rushing moonlight tempest. The moon reigns glorious, glad of the gale, as glad as if she gave herself to his fierce caress with love. No Endymion will watch for his goddess to-night. There are no flocks out on the mountains; and it is well, for to-night she welcomes olus.\nMoore, sitting in the schoolroom, heard the storm roar round the other gable and along the hall-front. This end was sheltered. He wanted no shelter; he desired no subdued sounds or screened position.\n\"All the parlours are empty,\" said he. \"I am sick at heart of this cell.\"\nHe left it, and went where the casements, larger and freer than the branch-screened lattice of his own apartment, admitted unimpeded the dark-blue, the silver-fleeced, the stirring and sweeping vision of the autumn night-sky. He carried no candle; unneeded was lamp or fire. The broad and clear though cloud-crossed and fluctuating beam of the moon shone on every floor and wall.\nMoore wanders through all the rooms. He seems following a phantom from parlour to parlour. In the oak room he stops. This is not chill, and polished, and fireless like the _salon_. The hearth is hot and ruddy; the cinders tinkle in the intense heat of their clear glow; near the rug is a little work-table, a desk upon it, a chair near it.\nDoes the vision Moore has tracked occupy that chair? You would think so, could you see him standing before it. There is as much interest now in his eye, and as much significance in his face, as if in this household solitude he had found a living companion, and was going to speak to it.\nHe makes discoveries. A bag--a small satin bag--hangs on the chair-back. The desk is open, the keys are in the lock. A pretty seal, a silver pen, a crimson berry or two of ripe fruit on a green leaf, a small, clean, delicate glove--these trifles at once decorate and disarrange the stand they strew. Order forbids details in a picture--she puts them tidily away; but details give charm.\nMoore spoke.\n\"Her mark,\" he said. \"Here she has been--careless, attractive thing!--called away in haste, doubtless, and forgetting to return and put all to rights. Why does she leave fascination in her footprints? Whence did she acquire the gift to be heedless and never offend? There is always something to chide in her, and the reprimand never settles in displeasure on the heart, but, for her lover or her husband, when it had trickled a while in words, would naturally melt from his lips in a kiss. Better pass half an hour in remonstrating with her than a day in admiring or praising any other woman alive. Am I muttering? soliloquizing? Stop that.\"\nHe did stop it. He stood thinking, and then he made an arrangement for his evening's comfort.\nHe dropped the curtains over the broad window and regal moon. He shut out sovereign and court and starry armies; he added fuel to the hot but fast-wasting fire; he lit a candle, of which there were a pair on the table; he placed another chair opposite that near the workstand; and then he sat down. His next movement was to take from his pocket a small, thick book of blank paper, to produce a pencil, and to begin to write in a cramp, compact hand. Come near, by all means, reader. Do not be shy. Stoop over his shoulder fearlessly, and read as he scribbles.\n\"It is nine o'clock; the carriage will not return before eleven, I am certain. Freedom is mine till then; till then I may occupy her room, sit opposite her chair, rest my elbow on her table, have her little mementoes about me.\n\"I used rather to like Solitude--to fancy her a somewhat quiet and serious, yet fair nymph; an Oread, descending to me from lone mountain-passes, something of the blue mist of hills in her array and of their chill breeze in her breath, but much also of their solemn beauty in her mien. I once could court her serenely, and imagine my heart easier when I held her to it--all mute, but majestic.\n\"Since that day I called S. to me in the schoolroom, and she came and sat so near my side; since she opened the trouble of her mind to me, asked my protection, appealed to my strength--since that hour I abhor Solitude. Cold abstraction, fleshless skeleton, daughter, mother, and mate of Death!\n\"It is pleasant to write about what is near and dear as the core of my heart. None can deprive me of this little book, and through this pencil I can say to it what I will--say what I dare utter to nothing living--say what I dare not _think_ aloud.\n\"We have scarcely encountered each other since that evening. Once, when I was alone in the drawing-room, seeking a book of Henry's, she entered, dressed for a concert at Stilbro'. Shyness--_her_ shyness, not mine--drew a silver veil between us. Much cant have I heard and read about 'maiden modesty,' but, properly used, and not hackneyed, the words are good and appropriate words. As she passed to the window, after tacitly but gracefully recognizing me, I could call her nothing in my own mind save 'stainless virgin.' To my perception, a delicate splendour robed her, and the modesty of girlhood was her halo. I may be the most fatuous, as I am one of the plainest, of men, but in truth that shyness of hers touched me exquisitely; it flattered my finest sensations. I looked a stupid block, I dare say. I was alive with a life of Paradise, as she turned _her_ glance from _my_ glance, and softly averted her head to hide the suffusion of her cheek.\n\"I know this is the talk of a dreamer--of a rapt, romantic lunatic. I _do_ dream. I _will_ dream now and then; and if she has inspired romance into my prosaic composition, how can I help it?\n\"What a child she is sometimes! What an unsophisticated, untaught thing! I see her now looking up into my face, and entreating me to prevent them from smothering her, and to be sure and give her a strong narcotic. I see her confessing that she was not so self-sufficing, so independent of sympathy, as people thought. I see the secret tear drop quietly from her eyelash. She said I thought her childish, and I did. She imagined I despised her. Despised her! It was unutterably sweet to feel myself at once near her and above her--to be conscious of a natural right and power to sustain her, as a husband should sustain his wife.\n\"I worship her perfections; but it is her faults, or at least her foibles, that bring her near to me, that nestle her to my heart, that fold her about with my love, and that for a most selfish but deeply-natural reason. These faults are the steps by which I mount to ascendency over her. If she rose a trimmed, artificial mound, without inequality, what vantage would she offer the foot? It is the natural hill, with its mossy breaks and hollows, whose slope invites ascent, whose summit it is pleasure to gain.\n\"To leave metaphor. It delights my eye to look on her. She suits me. If I were a king and she the housemaid that swept my palace-stairs, across all that space between us my eye would recognize her qualities; a true pulse would beat for her in my heart, though an unspanned gulf made acquaintance impossible. If I were a gentleman, and she waited on me as a servant, I could not help liking that Shirley. Take from her her education; take her ornaments, her sumptuous dress, all extrinsic advantages; take all grace, but such as the symmetry of her form renders inevitable; present her to me at a cottage door, in a stuff gown; let her offer me there a draught of water, with that smile, with that warm good-will with which she now dispenses manorial hospitality--I should like her. I should wish to stay an hour; I should linger to talk with that rustic. I should not feel as I _now_ do; I should find in her nothing divine; but whenever I met the young peasant, it would be with pleasure; whenever I left her, it would be with regret.\n\"How culpably careless in her to leave her desk open, where I know she has money! In the lock hang the keys of all her repositories, of her very jewel-casket. There is a purse in that little satin bag; I see the tassel of silver beads hanging out. That spectacle would provoke my brother Robert. All her little failings would, I know, be a source of irritation to him. If they vex me it is a most pleasurable vexation. I delight to find her at fault; and were I always resident with her, I am aware she would be no niggard in thus ministering to my enjoyment. She would just give me something to do, to rectify--a theme for my tutor lectures. I never lecture Henry, never feel disposed to do so. If he does wrong--and that is very seldom, dear, excellent lad!--a word suffices. Often I do no more than shake my head. But the moment her _minois mutin_ meets my eye, expostulatory words crowd to my lips. From a taciturn man I believe she would transform me into a talker. Whence comes the delight I take in that talk? It puzzles myself sometimes. The more _crne, malin, taquin_ is her mood, consequently the clearer occasion she gives me for disapprobation, the more I seek her, the better I like her. She is never wilder than when equipped in her habit and hat, never less manageable than when she and Zo come in fiery from a race with the wind on the hills; and I confess it--to this mute page I may confess it--I have waited an hour in the court for the chance of witnessing her return, and for the dearer chance of receiving her in my arms from the saddle. I have noticed (again it is to this page only I would make the remark) that she will never permit any man but myself to render her that assistance. I have seen her politely decline Sir Philip Nunnely's aid. She is always mighty gentle with her young baronet, mighty tender for his feelings, forsooth, and of his very thin-skinned _amour propre_. I have marked her haughtily reject Sam Wynne's. Now I know--my heart knows it, for it has felt it--that she resigns herself to me unreluctantly. Is she conscious how my strength rejoices to serve her? I myself am not her slave--I declare it--but my faculties gather to her beauty, like the genii to the glisten of the lamp. All my knowledge, all my prudence, all my calm, and all my power stand in her presence humbly waiting a task. How glad they are when a mandate comes! What joy they take in the toils she assigns! Does she know it?\n\"I have called her careless. It is remarkable that her carelessness never compromises her refinement. Indeed, through this very loophole of character, the reality, depth, genuineness of that refinement may be ascertained. A whole garment sometimes covers meagreness and malformation; through a rent sleeve a fair round arm may be revealed. I have seen and handled many of her possessions, because they are frequently astray. I never saw anything that did not proclaim the lady--nothing sordid, nothing soiled. In one sense she is as scrupulous as, in another, she is unthinking. As a peasant girl, she would go ever trim and cleanly. Look at the pure kid of this little glove, at the fresh, unsullied satin of the bag.\n\"What a difference there is between S. and that pearl C. H.! Caroline, I fancy, is the soul of conscientious punctuality and nice exactitude. She would precisely suit the domestic habits of a certain fastidious kinsman of mine--so delicate, dexterous, quaint, quick, quiet--all done to a minute, all arranged to a strawbreadth. She would suit Robert. But what could _I_ do with anything so nearly faultless? _She_ is my equal, poor as myself. She is certainly pretty: a little Raffaelle head hers--Raffaelle in feature, quite English in expression, all insular grace and purity; but where is there anything to alter, anything to endure, anything to reprimand, to be anxious about? There she is, a lily of the valley, untinted, needing no tint. What change could improve her? What pencil dare to paint? _My_ sweetheart, if I ever have one, must bear nearer affinity to the rose--a sweet, lively delight guarded with prickly peril. _My_ wife, if I ever marry, must stir my great frame with a sting now and then; she must furnish use to her husband's vast mass of patience. I was not made so enduring to be mated with a lamb; I should find more congenial responsibility in the charge of a young lioness or leopardess. I like few things sweet but what are likewise pungent--few things bright but what are likewise hot. I like the summer day, whose sun makes fruit blush and corn blanch. Beauty is never so beautiful as when, if I tease it, it wreathes back on me with spirit. Fascination is never so imperial as when, roused and half ireful, she threatens transformation to fierceness. I fear I should tire of the mute, monotonous innocence of the lamb; I should ere long feel as burdensome the nestling dove which never stirred in my bosom; but my patience would exult in stilling the flutterings and training the energies of the restless merlin. In managing the wild instincts of the scarce manageable _bte fauve_ my powers would revel.\n\"O my pupil! O Peri! too mutinous for heaven, too innocent for hell, never shall I do more than see, and worship, and wish for thee. Alas! knowing I could make thee happy, will it be my doom to see thee possessed by those who have not that power?\n\"However kindly the hand, if it is feeble, it cannot bend Shirley; and she must be bent. It cannot curb her; and she must be curbed.\n\"Beware, Sir Philip Nunnely! I never see you walking or sitting at her side, and observe her lips compressed, or her brow knit, in resolute endurance of some trait of your character which she neither admires nor likes, in determined toleration of some weakness she believes atoned for by a virtue, but which annoys her despite that belief; I never mark the grave glow of her face, the unsmiling sparkle of her eye, the slight recoil of her whole frame when you draw a little too near, and gaze a little too expressively, and whisper a little too warmly--I never witness these things but I think of the fable of Semele reversed.\n\"It is not the daughter of Cadmus I see, nor do I realize her fatal longing to look on Jove in the majesty of his god-head. It is a priest of Juno that stands before me, watching late and lone at a shrine in an Argive temple. For years of solitary ministry he has lived on dreams. There is divine madness upon him. He loves the idol he serves, and prays day and night that his frenzy may be fed, and that the Ox-eyed may smile on her votary. She has heard; she will be propitious. All Argos slumbers. The doors of the temple are shut; the priest waits at the altar.\n\"A shock of heaven and earth is felt--not by the slumbering city, only by that lonely watcher, brave and unshaken in his fanaticism. In the midst of silence, with no preluding sound, he is wrapped in sudden light. Through the roof, through the rent, wide-yawning, vast, white-blazing blue of heaven above, pours a wondrous descent, dread as the downrushing of stars. He has what he asked. Withdraw--forbear to look--I am blinded. I hear in that fane an unspeakable sound. Would that I could not hear it! I see an insufferable glory burning terribly between the pillars. Gods be merciful and quench it!\n\"A pious Argive enters to make an early offering in the cool dawn of morning. There was thunder in the night; the bolt fell here. The shrine is shivered, the marble pavement round split and blackened. Saturnia's statue rises chaste, grand, untouched; at her feet piled ashes lie pale. No priest remains; he who watched will be seen no more.\n* * * * *\n\"There is the carriage! Let me lock up the desk and pocket the keys. She will be seeking them to-morrow; she will have to come to me. I hear her: 'Mr. Moore, have you seen my keys?'\n\"So she will say, in her clear voice, speaking with reluctance, looking ashamed, conscious that this is the twentieth time of asking. I will tantalize her, keep her with me, expecting, doubting; and when I _do_ restore them, it shall not be without a lecture. Here is the bag, too, and the purse; the glove--pen--seal. She shall wring them all out of me slowly and separately--only by confession, penitence, entreaty. I never can touch her hand, or a ringlet of her head, or a ribbon of her dress, but I will make privileges for myself. Every feature of her face, her bright eyes, her lips, shall go through each change they know, for my pleasure--display each exquisite variety of glance and curve, to delight, thrill, perhaps more hopelessly to enchain me. If I must be her slave, I will not lose my freedom for nothing.\"\nHe locked the desk, pocketed all the property, and went.",
        "paragraph_chars": [
            [
                0,
                242
            ],
            [
                242,
                1139
            ],
            [
                1139,
                1680
            ],
            [
                1680,
                1880
            ],
            [
                1880,
                1954
            ],
            [
                1954,
                2334
            ],
            [
                2334,
                2674
            ],
            [
                2674,
                2961
            ],
            [
                2961,
                3348
            ],
            [
                3348,
                3361
            ],
            [
                3361,
                4003
            ],
            [
                4003,
                4097
            ],
            [
                4097,
                4657
            ],
            [
                4657,
                4884
            ],
            [
                4884,
                5278
            ],
            [
                5278,
                5572
            ],
            [
                5572,
                5820
            ],
            [
                5820,
                6773
            ],
            [
                6773,
                6964
            ],
            [
                6964,
                7593
            ],
            [
                7593,
                8105
            ],
            [
                8105,
                9141
            ],
            [
                9141,
                11584
            ],
            [
                11584,
                12303
            ],
            [
                12303,
                14238
            ],
            [
                14238,
                14485
            ],
            [
                14485,
                14618
            ],
            [
                14618,
                15246
            ],
            [
                15246,
                15812
            ],
            [
                15812,
                16414
            ],
            [
                16414,
                16755
            ],
            [
                16755,
                16765
            ],
            [
                16765,
                16947
            ],
            [
                16947,
                17771
            ],
            [
                17771,
                17827
            ]
        ],
        "segment_chars": [
            [
                0,
                38
            ],
            [
                38,
                99
            ],
            [
                99,
                242
            ],
            [
                242,
                280
            ],
            [
                280,
                376
            ],
            [
                376,
                499
            ],
            [
                499,
                779
            ],
            [
                779,
                965
            ],
            [
                965,
                1139
            ],
            [
                1139,
                1206
            ],
            [
                1206,
                1434
            ],
            [
                1434,
                1541
            ],
            [
                1541,
                1590
            ],
            [
                1590,
                1680
            ],
            [
                1680,
                1783
            ],
            [
                1783,
                1807
            ],
            [
                1807,
                1880
            ],
            [
                1880,
                1919
            ],
            [
                1919,
                1954
            ],
            [
                1954,
                2180
            ],
            [
                2180,
                2229
            ],
            [
                2229,
                2334
            ],
            [
                2334,
                2371
            ],
            [
                2371,
                2425
            ],
            [
                2425,
                2451
            ],
            [
                2451,
                2515
            ],
            [
                2515,
                2674
            ],
            [
                2674,
                2727
            ],
            [
                2727,
                2785
            ],
            [
                2785,
                2961
            ],
            [
                2961,
                2983
            ],
            [
                2983,
                3034
            ],
            [
                3034,
                3078
            ],
            [
                3078,
                3261
            ],
            [
                3261,
                3348
            ],
            [
                3348,
                3361
            ],
            [
                3361,
                3382
            ],
            [
                3382,
                3512
            ],
            [
                3512,
                3562
            ],
            [
                3562,
                3627
            ],
            [
                3627,
                3851
            ],
            [
                3851,
                3960
            ],
            [
                3960,
                3976
            ],
            [
                3976,
                3991
            ],
            [
                3991,
                4003
            ],
            [
                4003,
                4019
            ],
            [
                4019,
                4097
            ],
            [
                4097,
                4159
            ],
            [
                4159,
                4396
            ],
            [
                4396,
                4547
            ],
            [
                4547,
                4580
            ],
            [
                4580,
                4595
            ],
            [
                4595,
                4657
            ],
            [
                4657,
                4736
            ],
            [
                4736,
                4884
            ],
            [
                4884,
                5170
            ],
            [
                5170,
                5278
            ],
            [
                5278,
                5497
            ],
            [
                5497,
                5572
            ],
            [
                5572,
                5650
            ],
            [
                5650,
                5820
            ],
            [
                5820,
                5881
            ],
            [
                5881,
                6000
            ],
            [
                6000,
                6065
            ],
            [
                6065,
                6202
            ],
            [
                6202,
                6341
            ],
            [
                6341,
                6433
            ],
            [
                6433,
                6590
            ],
            [
                6590,
                6627
            ],
            [
                6627,
                6773
            ],
            [
                6773,
                6841
            ],
            [
                6841,
                6855
            ],
            [
                6855,
                6964
            ],
            [
                6964,
                6996
            ],
            [
                6996,
                7037
            ],
            [
                7037,
                7178
            ],
            [
                7178,
                7282
            ],
            [
                7282,
                7335
            ],
            [
                7335,
                7379
            ],
            [
                7379,
                7408
            ],
            [
                7408,
                7422
            ],
            [
                7422,
                7593
            ],
            [
                7593,
                7813
            ],
            [
                7813,
                7881
            ],
            [
                7881,
                7981
            ],
            [
                7981,
                8105
            ],
            [
                8105,
                8125
            ],
            [
                8125,
                8160
            ],
            [
                8160,
                8174
            ],
            [
                8174,
                8413
            ],
            [
                8413,
                8509
            ],
            [
                8509,
                8887
            ],
            [
                8887,
                8960
            ],
            [
                8960,
                9141
            ],
            [
                9141,
                9223
            ],
            [
                9223,
                9300
            ],
            [
                9300,
                9389
            ],
            [
                9389,
                9437
            ],
            [
                9437,
                9510
            ],
            [
                9510,
                9560
            ],
            [
                9560,
                9701
            ],
            [
                9701,
                9784
            ],
            [
                9784,
                9837
            ],
            [
                9837,
                9919
            ],
            [
                9919,
                9958
            ],
            [
                9958,
                10044
            ],
            [
                10044,
                10112
            ],
            [
                10112,
                10158
            ],
            [
                10158,
                10187
            ],
            [
                10187,
                10342
            ],
            [
                10342,
                10701
            ],
            [
                10701,
                10849
            ],
            [
                10849,
                10908
            ],
            [
                10908,
                11047
            ],
            [
                11047,
                11095
            ],
            [
                11095,
                11192
            ],
            [
                11192,
                11248
            ],
            [
                11248,
                11371
            ],
            [
                11371,
                11481
            ],
            [
                11481,
                11521
            ],
            [
                11521,
                11566
            ],
            [
                11566,
                11584
            ],
            [
                11584,
                11613
            ],
            [
                11613,
                11686
            ],
            [
                11686,
                11806
            ],
            [
                11806,
                11924
            ],
            [
                11924,
                12009
            ],
            [
                12009,
                12094
            ],
            [
                12094,
                12163
            ],
            [
                12163,
                12218
            ],
            [
                12218,
                12303
            ],
            [
                12303,
                12364
            ],
            [
                12364,
                12445
            ],
            [
                12445,
                12631
            ],
            [
                12631,
                12654
            ],
            [
                12654,
                12711
            ],
            [
                12711,
                12746
            ],
            [
                12746,
                12984
            ],
            [
                12984,
                13047
            ],
            [
                13047,
                13078
            ],
            [
                13078,
                13105
            ],
            [
                13105,
                13233
            ],
            [
                13233,
                13374
            ],
            [
                13374,
                13518
            ],
            [
                13518,
                13618
            ],
            [
                13618,
                13686
            ],
            [
                13686,
                13775
            ],
            [
                13775,
                13885
            ],
            [
                13885,
                14147
            ],
            [
                14147,
                14238
            ],
            [
                14238,
                14251
            ],
            [
                14251,
                14259
            ],
            [
                14259,
                14371
            ],
            [
                14371,
                14377
            ],
            [
                14377,
                14485
            ],
            [
                14485,
                14574
            ],
            [
                14574,
                14618
            ],
            [
                14618,
                14647
            ],
            [
                14647,
                15246
            ],
            [
                15246,
                15370
            ],
            [
                15370,
                15472
            ],
            [
                15472,
                15527
            ],
            [
                15527,
                15561
            ],
            [
                15561,
                15688
            ],
            [
                15688,
                15727
            ],
            [
                15727,
                15747
            ],
            [
                15747,
                15812
            ],
            [
                15812,
                15945
            ],
            [
                15945,
                16026
            ],
            [
                16026,
                16179
            ],
            [
                16179,
                16201
            ],
            [
                16201,
                16242
            ],
            [
                16242,
                16284
            ],
            [
                16284,
                16316
            ],
            [
                16316,
                16382
            ],
            [
                16382,
                16414
            ],
            [
                16414,
                16492
            ],
            [
                16492,
                16544
            ],
            [
                16544,
                16615
            ],
            [
                16615,
                16699
            ],
            [
                16699,
                16755
            ],
            [
                16755,
                16765
            ],
            [
                16765,
                16789
            ],
            [
                16789,
                16834
            ],
            [
                16834,
                16899
            ],
            [
                16899,
                16916
            ],
            [
                16916,
                16947
            ],
            [
                16947,
                17081
            ],
            [
                17081,
                17207
            ],
            [
                17207,
                17266
            ],
            [
                17266,
                17365
            ],
            [
                17365,
                17484
            ],
            [
                17484,
                17706
            ],
            [
                17706,
                17771
            ],
            [
                17771,
                17827
            ]
        ],
        "overlap_chars": [
            [
                0,
                38
            ],
            [
                99,
                119
            ],
            [
                131,
                242
            ],
            [
                242,
                280
            ],
            [
                280,
                293
            ],
            [
                355,
                376
            ],
            [
                376,
                386
            ],
            [
                412,
                418
            ],
            [
                398,
                402
            ],
            [
                419,
                421
            ],
            [
                448,
                499
            ],
            [
                517,
                520
            ],
            [
                499,
                503
            ],
            [
                521,
                528
            ],
            [
                536,
                576
            ],
            [
                589,
                593
            ],
            [
                655,
                662
            ],
            [
                672,
                673
            ],
            [
                623,
                628
            ],
            [
                760,
                762
            ],
            [
                619,
                622
            ],
            [
                629,
                631
            ],
            [
                763,
                778
            ],
            [
                1139,
                1161
            ],
            [
                1302,
                1303
            ],
            [
                1206,
                1220
            ],
            [
                1236,
                1242
            ],
            [
                1204,
                1205
            ],
            [
                1163,
                1166
            ],
            [
                1352,
                1358
            ],
            [
                1328,
                1329
            ],
            [
                1402,
                1434
            ],
            [
                1434,
                1480
            ],
            [
                1489,
                1540
            ],
            [
                1680,
                1713
            ],
            [
                1720,
                1734
            ],
            [
                1761,
                1783
            ],
            [
                1807,
                1809
            ],
            [
                1817,
                1831
            ],
            [
                1840,
                1857
            ],
            [
                1878,
                1880
            ],
            [
                1919,
                1951
            ],
            [
                1907,
                1909
            ],
            [
                1915,
                1918
            ],
            [
                1954,
                1956
            ],
            [
                1962,
                1969
            ],
            [
                1975,
                1984
            ],
            [
                1994,
                2002
            ],
            [
                2013,
                2017
            ],
            [
                2049,
                2052
            ],
            [
                2057,
                2067
            ],
            [
                2018,
                2021
            ],
            [
                2139,
                2180
            ],
            [
                2180,
                2182
            ],
            [
                2191,
                2201
            ],
            [
                2298,
                2302
            ],
            [
                2309,
                2334
            ],
            [
                2334,
                2371
            ],
            [
                2371,
                2425
            ],
            [
                2425,
                2451
            ],
            [
                2451,
                2468
            ],
            [
                2484,
                2505
            ],
            [
                2515,
                2582
            ],
            [
                2602,
                2647
            ],
            [
                2657,
                2664
            ],
            [
                2672,
                2674
            ],
            [
                2674,
                2727
            ],
            [
                2727,
                2746
            ],
            [
                2868,
                2870
            ],
            [
                2753,
                2756
            ],
            [
                2747,
                2752
            ],
            [
                2757,
                2783
            ],
            [
                2802,
                2810
            ],
            [
                2815,
                2825
            ],
            [
                2959,
                2961
            ],
            [
                2961,
                2983
            ],
            [
                2990,
                3007
            ],
            [
                3015,
                3034
            ],
            [
                3034,
                3078
            ],
            [
                3078,
                3129
            ],
            [
                3144,
                3175
            ],
            [
                3186,
                3191
            ],
            [
                3193,
                3242
            ],
            [
                3259,
                3260
            ],
            [
                3348,
                3361
            ],
            [
                3361,
                3382
            ],
            [
                3382,
                3400
            ],
            [
                3410,
                3428
            ],
            [
                3431,
                3452
            ],
            [
                3464,
                3481
            ],
            [
                3493,
                3512
            ],
            [
                3512,
                3562
            ],
            [
                3573,
                3576
            ],
            [
                3600,
                3608
            ],
            [
                3627,
                3669
            ],
            [
                3731,
                3734
            ],
            [
                3613,
                3618
            ],
            [
                3678,
                3687
            ],
            [
                3740,
                3764
            ],
            [
                3805,
                3851
            ],
            [
                3851,
                3915
            ],
            [
                3928,
                3960
            ],
            [
                3960,
                3976
            ],
            [
                3991,
                4003
            ],
            [
                4003,
                4019
            ],
            [
                4019,
                4049
            ],
            [
                4108,
                4120
            ],
            [
                4157,
                4159
            ],
            [
                4210,
                4230
            ],
            [
                4252,
                4274
            ],
            [
                4181,
                4184
            ],
            [
                4319,
                4339
            ],
            [
                4305,
                4308
            ],
            [
                4372,
                4377
            ],
            [
                4383,
                4395
            ],
            [
                4426,
                4449
            ],
            [
                4499,
                4502
            ],
            [
                4489,
                4498
            ],
            [
                4512,
                4525
            ],
            [
                4531,
                4547
            ],
            [
                4547,
                4556
            ],
            [
                4570,
                4580
            ],
            [
                4595,
                4618
            ],
            [
                4629,
                4657
            ],
            [
                4657,
                4720
            ],
            [
                4734,
                4736
            ],
            [
                4736,
                4762
            ],
            [
                4773,
                4795
            ],
            [
                4853,
                4884
            ],
            [
                4884,
                4915
            ],
            [
                5168,
                5170
            ],
            [
                5170,
                5188
            ],
            [
                5193,
                5237
            ],
            [
                5189,
                5192
            ],
            [
                5258,
                5278
            ],
            [
                5278,
                5461
            ],
            [
                5463,
                5497
            ],
            [
                5497,
                5501
            ],
            [
                5557,
                5572
            ],
            [
                5572,
                5602
            ],
            [
                5648,
                5650
            ],
            [
                5695,
                5724
            ],
            [
                5731,
                5742
            ],
            [
                5785,
                5804
            ],
            [
                5806,
                5811
            ],
            [
                5813,
                5820
            ],
            [
                5820,
                5881
            ],
            [
                5881,
                5923
            ],
            [
                5950,
                6000
            ],
            [
                6010,
                6013
            ],
            [
                6015,
                6022
            ],
            [
                6039,
                6065
            ],
            [
                6065,
                6069
            ],
            [
                6075,
                6124
            ],
            [
                6135,
                6139
            ],
            [
                6126,
                6134
            ],
            [
                6158,
                6178
            ],
            [
                6200,
                6202
            ],
            [
                6359,
                6433
            ],
            [
                6433,
                6458
            ],
            [
                6489,
                6553
            ],
            [
                6588,
                6590
            ],
            [
                6590,
                6627
            ],
            [
                6627,
                6638
            ],
            [
                6654,
                6677
            ],
            [
                6679,
                6682
            ],
            [
                6684,
                6695
            ],
            [
                6697,
                6699
            ],
            [
                6701,
                6748
            ],
            [
                6762,
                6773
            ],
            [
                6773,
                6810
            ],
            [
                6812,
                6841
            ],
            [
                6855,
                6856
            ],
            [
                6864,
                6883
            ],
            [
                6945,
                6964
            ],
            [
                6964,
                6996
            ],
            [
                6996,
                7037
            ],
            [
                7335,
                7379
            ],
            [
                7379,
                7408
            ],
            [
                7408,
                7422
            ],
            [
                7422,
                7492
            ],
            [
                7494,
                7593
            ],
            [
                7593,
                7642
            ],
            [
                7655,
                7723
            ],
            [
                7767,
                7772
            ],
            [
                7778,
                7813
            ],
            [
                7813,
                7850
            ],
            [
                7860,
                7880
            ],
            [
                8125,
                8160
            ],
            [
                8174,
                8314
            ],
            [
                8320,
                8356
            ],
            [
                8411,
                8413
            ],
            [
                8509,
                8513
            ],
            [
                8523,
                8536
            ],
            [
                8577,
                8578
            ],
            [
                8543,
                8577
            ],
            [
                8536,
                8537
            ],
            [
                8519,
                8522
            ],
            [
                8696,
                8719
            ],
            [
                8726,
                8756
            ],
            [
                8765,
                8790
            ],
            [
                8811,
                8812
            ],
            [
                8868,
                8885
            ],
            [
                8603,
                8604
            ],
            [
                8690,
                8692
            ],
            [
                8792,
                8796
            ],
            [
                8649,
                8652
            ],
            [
                8885,
                8886
            ],
            [
                9141,
                9145
            ],
            [
                9155,
                9223
            ],
            [
                9223,
                9239
            ],
            [
                9252,
                9259
            ],
            [
                9244,
                9248
            ],
            [
                9298,
                9300
            ],
            [
                9300,
                9352
            ],
            [
                9353,
                9359
            ],
            [
                9376,
                9389
            ],
            [
                9437,
                9475
            ],
            [
                9418,
                9436
            ],
            [
                9510,
                9560
            ],
            [
                9560,
                9590
            ],
            [
                9699,
                9701
            ],
            [
                9784,
                9837
            ],
            [
                9837,
                9853
            ],
            [
                9855,
                9899
            ],
            [
                9902,
                9919
            ],
            [
                9958,
                9976
            ],
            [
                9992,
                10042
            ],
            [
                10094,
                10112
            ],
            [
                10158,
                10168
            ],
            [
                10176,
                10187
            ],
            [
                10187,
                10195
            ],
            [
                10221,
                10229
            ],
            [
                10296,
                10341
            ],
            [
                10342,
                10361
            ],
            [
                10401,
                10438
            ],
            [
                10451,
                10466
            ],
            [
                10486,
                10513
            ],
            [
                10554,
                10582
            ],
            [
                10589,
                10606
            ],
            [
                10618,
                10658
            ],
            [
                10384,
                10387
            ],
            [
                10684,
                10701
            ],
            [
                10701,
                10715
            ],
            [
                10772,
                10820
            ],
            [
                10832,
                10836
            ],
            [
                10882,
                10900
            ],
            [
                10906,
                10908
            ],
            [
                10908,
                10958
            ],
            [
                11099,
                11105
            ],
            [
                11146,
                11176
            ],
            [
                11190,
                11192
            ],
            [
                11192,
                11248
            ],
            [
                11248,
                11273
            ],
            [
                11289,
                11292
            ],
            [
                11371,
                11481
            ],
            [
                11566,
                11584
            ],
            [
                11584,
                11613
            ],
            [
                11635,
                11686
            ],
            [
                11956,
                11971
            ],
            [
                11986,
                12007
            ],
            [
                11971,
                11972
            ],
            [
                12009,
                12060
            ],
            [
                12062,
                12094
            ],
            [
                12218,
                12303
            ],
            [
                12303,
                12338
            ],
            [
                12342,
                12345
            ],
            [
                12362,
                12364
            ],
            [
                12364,
                12423
            ],
            [
                12443,
                12445
            ],
            [
                12445,
                12502
            ],
            [
                12514,
                12529
            ],
            [
                12531,
                12533
            ],
            [
                12544,
                12554
            ],
            [
                12563,
                12568
            ],
            [
                12570,
                12575
            ],
            [
                12629,
                12631
            ],
            [
                12654,
                12668
            ],
            [
                12670,
                12671
            ],
            [
                12673,
                12711
            ],
            [
                12746,
                12770
            ],
            [
                12882,
                12984
            ],
            [
                12990,
                12996
            ],
            [
                12998,
                13019
            ],
            [
                13030,
                13047
            ],
            [
                13078,
                13103
            ],
            [
                13073,
                13077
            ],
            [
                13106,
                13108
            ],
            [
                13110,
                13151
            ],
            [
                13159,
                13179
            ],
            [
                13181,
                13233
            ],
            [
                13374,
                13388
            ],
            [
                13401,
                13439
            ],
            [
                13487,
                13516
            ],
            [
                13440,
                13454
            ],
            [
                13516,
                13518
            ],
            [
                13892,
                13912
            ],
            [
                13947,
                13951
            ],
            [
                13913,
                13939
            ],
            [
                13951,
                13961
            ],
            [
                13971,
                14138
            ],
            [
                14145,
                14146
            ],
            [
                14238,
                14251
            ],
            [
                14307,
                14371
            ],
            [
                14371,
                14377
            ],
            [
                14377,
                14485
            ],
            [
                14485,
                14493
            ],
            [
                14501,
                14574
            ],
            [
                14574,
                14618
            ],
            [
                14618,
                14647
            ],
            [
                14647,
                14658
            ],
            [
                14685,
                14688
            ],
            [
                14682,
                14684
            ],
            [
                14689,
                14693
            ],
            [
                14707,
                14809
            ],
            [
                14914,
                14919
            ],
            [
                14883,
                14914
            ],
            [
                14958,
                14959
            ],
            [
                14699,
                14706
            ],
            [
                14933,
                14936
            ],
            [
                15037,
                15050
            ],
            [
                15070,
                15170
            ],
            [
                15244,
                15246
            ],
            [
                15376,
                15392
            ],
            [
                15398,
                15472
            ],
            [
                15472,
                15527
            ],
            [
                15561,
                15640
            ],
            [
                15686,
                15688
            ],
            [
                15688,
                15711
            ],
            [
                15725,
                15727
            ],
            [
                15792,
                15812
            ],
            [
                15812,
                15848
            ],
            [
                15883,
                15890
            ],
            [
                15907,
                15912
            ],
            [
                15876,
                15877
            ],
            [
                15891,
                15905
            ],
            [
                15943,
                15945
            ],
            [
                15995,
                16026
            ],
            [
                16026,
                16055
            ],
            [
                16062,
                16080
            ],
            [
                16096,
                16110
            ],
            [
                16116,
                16179
            ],
            [
                16179,
                16201
            ],
            [
                16316,
                16382
            ],
            [
                16382,
                16414
            ],
            [
                16414,
                16415
            ],
            [
                16463,
                16469
            ],
            [
                16483,
                16490
            ],
            [
                16415,
                16462
            ],
            [
                16490,
                16492
            ],
            [
                16492,
                16544
            ],
            [
                16544,
                16587
            ],
            [
                16594,
                16615
            ],
            [
                16615,
                16699
            ],
            [
                16699,
                16755
            ],
            [
                16765,
                16789
            ],
            [
                16789,
                16834
            ],
            [
                16834,
                16858
            ],
            [
                16868,
                16897
            ],
            [
                16899,
                16900
            ],
            [
                16923,
                16927
            ],
            [
                16932,
                16936
            ],
            [
                17009,
                17081
            ],
            [
                17081,
                17102
            ],
            [
                17166,
                17170
            ],
            [
                17112,
                17116
            ],
            [
                17196,
                17207
            ],
            [
                17207,
                17253
            ],
            [
                17255,
                17258
            ],
            [
                17264,
                17266
            ],
            [
                17266,
                17322
            ],
            [
                17324,
                17365
            ],
            [
                17484,
                17593
            ],
            [
                17595,
                17706
            ],
            [
                17706,
                17771
            ],
            [
                17771,
                17827
            ]
        ],
        "row_chars": [
            [
                0,
                38
            ],
            [
                38,
                99
            ],
            [
                99,
                242
            ],
            [
                242,
                280
            ],
            [
                280,
                376
            ],
            [
                376,
                499
            ],
            [
                499,
                779
            ],
            [
                779,
                965
            ],
            [
                965,
                1139
            ],
            [
                1139,
                1434
            ],
            [
                1434,
                1541
            ],
            [
                1541,
                1590
            ],
            [
                1590,
                1680
            ],
            [
                1680,
                1783
            ],
            [
                1783,
                1807
            ],
            [
                1807,
                1880
            ],
            [
                1880,
                1954
            ],
            [
                1954,
                2180
            ],
            [
                2180,
                2334
            ],
            [
                2334,
                2371
            ],
            [
                2371,
                2425
            ],
            [
                2425,
                2451
            ],
            [
                2451,
                2515
            ],
            [
                2515,
                2674
            ],
            [
                2674,
                2727
            ],
            [
                2727,
                2961
            ],
            [
                2961,
                2983
            ],
            [
                2983,
                3034
            ],
            [
                3034,
                3078
            ],
            [
                3078,
                3261
            ],
            [
                3261,
                3348
            ],
            [
                3348,
                3361
            ],
            [
                3361,
                3382
            ],
            [
                3382,
                3512
            ],
            [
                3512,
                3562
            ],
            [
                3562,
                3851
            ],
            [
                3851,
                3960
            ],
            [
                3960,
                3976
            ],
            [
                3976,
                3991
            ],
            [
                3991,
                4003
            ],
            [
                4003,
                4019
            ],
            [
                4019,
                4159
            ],
            [
                4159,
                4396
            ],
            [
                4396,
                4547
            ],
            [
                4547,
                4580
            ],
            [
                4580,
                4595
            ],
            [
                4595,
                4657
            ],
            [
                4657,
                4736
            ],
            [
                4736,
                4884
            ],
            [
                4884,
                5170
            ],
            [
                5170,
                5278
            ],
            [
                5278,
                5497
            ],
            [
                5497,
                5572
            ],
            [
                5572,
                5650
            ],
            [
                5650,
                5820
            ],
            [
                5820,
                5881
            ],
            [
                5881,
                6000
            ],
            [
                6000,
                6065
            ],
            [
                6065,
                6202
            ],
            [
                6202,
                6341
            ],
            [
                6341,
                6433
            ],
            [
                6433,
                6590
            ],
            [
                6590,
                6627
            ],
            [
                6627,
                6773
            ],
            [
                6773,
                6841
            ],
            [
                6841,
                6855
            ],
            [
                6855,
                6964
            ],
            [
                6964,
                6996
            ],
            [
                6996,
                7037
            ],
            [
                7037,
                7178
            ],
            [
                7178,
                7282
            ],
            [
                7282,
                7335
            ],
            [
                7335,
                7379
            ],
            [
                7379,
                7408
            ],
            [
                7408,
                7422
            ],
            [
                7422,
                7593
            ],
            [
                7593,
                7813
            ],
            [
                7813,
                7881
            ],
            [
                7881,
                7981
            ],
            [
                7981,
                8105
            ],
            [
                8105,
                8125
            ],
            [
                8125,
                8160
            ],
            [
                8160,
                8174
            ],
            [
                8174,
                8413
            ],
            [
                8413,
                8509
            ],
            [
                8509,
                8887
            ],
            [
                8887,
                8960
            ],
            [
                8960,
                9141
            ],
            [
                9141,
                9223
            ],
            [
                9223,
                9300
            ],
            [
                9300,
                9389
            ],
            [
                9389,
                9510
            ],
            [
                9510,
                9560
            ],
            [
                9560,
                9701
            ],
            [
                9701,
                9784
            ],
            [
                9784,
                9837
            ],
            [
                9837,
                9919
            ],
            [
                9919,
                9958
            ],
            [
                9958,
                10112
            ],
            [
                10112,
                10158
            ],
            [
                10158,
                10187
            ],
            [
                10187,
                10342
            ],
            [
                10342,
                10701
            ],
            [
                10701,
                10908
            ],
            [
                10908,
                11047
            ],
            [
                11047,
                11095
            ],
            [
                11095,
                11192
            ],
            [
                11192,
                11248
            ],
            [
                11248,
                11481
            ],
            [
                11481,
                11521
            ],
            [
                11521,
                11566
            ],
            [
                11566,
                11584
            ],
            [
                11584,
                11613
            ],
            [
                11613,
                11686
            ],
            [
                11686,
                11806
            ],
            [
                11806,
                11924
            ],
            [
                11924,
                12094
            ],
            [
                12094,
                12163
            ],
            [
                12163,
                12218
            ],
            [
                12218,
                12303
            ],
            [
                12303,
                12364
            ],
            [
                12364,
                12445
            ],
            [
                12445,
                12631
            ],
            [
                12631,
                12654
            ],
            [
                12654,
                12711
            ],
            [
                12711,
                12746
            ],
            [
                12746,
                12984
            ],
            [
                12984,
                13047
            ],
            [
                13047,
                13105
            ],
            [
                13105,
                13233
            ],
            [
                13233,
                13374
            ],
            [
                13374,
                13518
            ],
            [
                13518,
                13618
            ],
            [
                13618,
                13686
            ],
            [
                13686,
                13775
            ],
            [
                13775,
                13885
            ],
            [
                13885,
                14147
            ],
            [
                14147,
                14238
            ],
            [
                14238,
                14251
            ],
            [
                14251,
                14259
            ],
            [
                14259,
                14371
            ],
            [
                14371,
                14377
            ],
            [
                14377,
                14485
            ],
            [
                14485,
                14574
            ],
            [
                14574,
                14618
            ],
            [
                14618,
                14647
            ],
            [
                14647,
                15246
            ],
            [
                15246,
                15370
            ],
            [
                15370,
                15472
            ],
            [
                15472,
                15527
            ],
            [
                15527,
                15561
            ],
            [
                15561,
                15688
            ],
            [
                15688,
                15727
            ],
            [
                15727,
                15747
            ],
            [
                15747,
                15812
            ],
            [
                15812,
                15945
            ],
            [
                15945,
                16026
            ],
            [
                16026,
                16179
            ],
            [
                16179,
                16201
            ],
            [
                16201,
                16242
            ],
            [
                16242,
                16284
            ],
            [
                16284,
                16316
            ],
            [
                16316,
                16382
            ],
            [
                16382,
                16414
            ],
            [
                16414,
                16492
            ],
            [
                16492,
                16544
            ],
            [
                16544,
                16615
            ],
            [
                16615,
                16699
            ],
            [
                16699,
                16755
            ],
            [
                16755,
                16765
            ],
            [
                16765,
                16789
            ],
            [
                16789,
                16834
            ],
            [
                16834,
                17081
            ],
            [
                17081,
                17207
            ],
            [
                17207,
                17266
            ],
            [
                17266,
                17365
            ],
            [
                17365,
                17484
            ],
            [
                17484,
                17706
            ],
            [
                17706,
                17771
            ],
            [
                17771,
                17827
            ]
        ]
    },
    "abridged": {
        "text": "Louis Moore was used to a quiet life. Having a large world in his own head and heart, he tolerated confinement to a small, still corner of the real world very patiently.\nHow hushed is Fieldhead this evening! All but Moore are gone to Nunnely. Sir Philip wished them to meet his mother and sisters, who are now at the priory. The kind baronet asked the tutor too; but the tutor would rather have arranged to meet a ghost in the middle of Nunnely forest.\nThis night is not calm, although the wild rains have abated. The sky is tossed by a high-rushing moonlight tempest. The moon reigns glorious, glad of the gale, as if she gave herself to his fierce caress with love.\nMoore, sitting in the schoolroom, hears the storm roar along the hall-front. He wants no shelter; he desires no subdued sounds.\n\"I am sick at heart of this cell,\" says he.\nHe leaves it, and goes where the windows, larger than those in his apartment, admit the sweeping vision of the autumn night-sky. He carries no candle; moonbeams shine on every floor and wall.\nMoore wanders through all the rooms. He seems following a phantom from parlour to parlour. In the oak room he stops. This is not chill and fireless like the salon. The hearth is hot and ruddy; the cinders tinkle in the intense heat; near the rug is a little work-table, a desk and a chair.\nDoes the vision Moore has tracked occupy that chair? You would think so, if you could see him standing before it with interest in his eye.\nHe makes discoveries. A small satin bag hangs on the chair-back. The desk is open, the keys are in the lock. A pretty seal, a silver pen, a crimson berry or two on a green leaf, a small, clean glove - these trifles at once decorate and disarrange the picture.\nMoore spoke.\n\"Her mark,\" he said. \"Here she has been - careless, attractive thing! - called away in haste, and forgetting to put all to rights. Why does she leave fascination in her footprints? She is heedless - there is always something to chide in her, but she never offends. Any reprimand from her lover or her husband would naturally melt from his lips in a kiss. Better pass half an hour in remonstrating with her than a day in praising any other woman alive. Am I muttering? Stop that.\"\nHe did stop it. He stood thinking, and then he closed the curtains. He added fuel to the fire; he lit a candle, and placed another chair at the desk; and he sat down.\nTaking from his pocket a small notebook and a pencil, he began to write in a cramped, compact hand. Come near, reader. Stoop over his shoulder, and read as he scribbles.\n\"It is nine o'clock; the carriage will not return before eleven. Freedom is mine till then; I may occupy her room, with her little mementoes about me.\n\"I used rather to like Solitude. I once could court Solitude serenely, and imagine my heart easier when I found her - mute, but majestic.\n\"Since that day I called S. to me in the schoolroom, and she came and sat so near my side; since she opened the trouble of her mind to me, asked my protection, appealed to my strength - since that hour I abhor Solitude. Cold mate of Death!\n\"It is pleasant to write about her. Through this pencil I can say what I will - say what I dare not even think aloud.\n\"We have scarcely encountered each other since that evening. Once, when I was alone in the drawing-room, she entered, dressed for a concert at Stilbro'. Her shyness drew a silver veil between us. Much triteness have I heard and read about 'maiden modesty,' but used properly, the words are good. A delicate splendour robed her, and the modesty of girlhood was her halo. I may be the most fatuous of men, but in truth that shyness of hers touched me exquisitely. I looked a stupid block, I dare say. I was alive to Paradise, as she turned her glance from my glance, and softly averted her head to hide the blush on her cheek.\n\"I know this is the talk of a dreamer - of a rapt, romantic lunatic. I do dream now and then; how can I help it?\n\"What a child she is sometimes! What an unsophisticated, untaught thing! She said I thought her childish, and I did. She imagined I despised her. Despised her! It was unutterably sweet to feel myself at once near her and above her - to be conscious of a natural right and power to sustain her, as a husband should sustain his wife.\n\"I worship her perfections; but it is her faults, her foibles, that bring her near to me, that nestle her to my heart, for a selfish but deeply-natural reason. These faults are the steps by which I can have ascendency over her.\n\"It delights my eye to look on her. If I were a king and she the housemaid that swept my palace-stairs, across all that space between us my eye would recognize her qualities; a pulse would beat for her in my heart. Take away her education, her ornaments, her sumptuous dress; place her at a cottage door, in a drab gown; let her offer me there a drink of water, with that smile - I should like her; I should linger to talk with her.\n\"How careless in her to leave her desk open, where I know she has money! In the lock hang all her keys. There is a purse in that little satin bag; I see the beaded tassel hanging out. All her little failings would, I know, irritate my brother Robert. If they vex me it is a most pleasurable vexation. I delight to find her at fault. I never lecture Henry, never feel disposed to do so. If he does wrong - and that is very seldom, dear, excellent lad! - a word suffices. But the moment her mischievous face meets my eye, expostulatory words crowd to my lips, transforming me into a talker. It puzzles me sometimes. The more teasing her mood, the more I seek her, the better I like her.\n\"She is never wilder, never less manageable than when she comes in fiery from a ride on the hills; and I confess I have waited an hour in the courtyard for the chance of seeing her return, and for the dearer chance of lifting her from the saddle. I have noticed that she will never permit any man but myself to do that; not even Sir Philip Nunnely. She is always mighty gentle with her young baronet. But I know that she resigns herself to me willingly. Is she conscious how my strength rejoices to serve her? I myself am not her slave; but all my knowledge, all my prudence, all my calm, and all my power stand in her presence humbly waiting a task. Does she know it?\n\"I have called her careless. Yet her carelessness never compromises her refinement. Her possessions are frequently astray, but amongst them I never saw anything that did not proclaim the lady - nothing sordid, nothing soiled. Look at the pure kid of this little glove, at the fresh, unsullied satin of the bag.\n\"What a difference there is between her and Caroline Helstone! Caroline, I fancy, is the soul of conscientious punctuality. She would precisely suit the domestic habits of a certain kinsman of mine - so dexterous, quick and quiet. But what could I do with anything so nearly faultless? She is certainly pretty: but where is there anything to alter, anything to endure, anything to reprimand, to be anxious about? She is a lily of the valley, needing no tint. What pencil dare to paint her? My sweetheart, if I ever have one, must bear affinity to the rose - a sweet, lively delight guarded with prickly peril. I was not made to be mated with a lamb; I should find a young lioness or leopardess more congenial. I should tire of the lamb's mute, monotonous innocence; I should feel as burdensome the nestling dove which never stirred in my bosom; but my patience would exult in stilling the flutterings and training the energies of the restless falcon.\n\"O my pupil! Never shall I do more than see, and worship, and wish for thee. Alas! knowing I could make thee happy, will it be my doom to see thee possessed by those who have not that power?\n\"However kind the hand, if it is feeble, it cannot bend Shirley; and she must be bent. It cannot curb her; and she must be curbed.\n\"Beware, Sir Philip Nunnely! I never see her at your side without observing her lips compressed, or her brow knit, in resolute endurance of some trait of your character which she does not like, but believes atoned for by a virtue. I observe her slight recoil when you draw a little too near, and gaze a little too expressively, and whisper a little too warmly.\n\"I see a priest of Juno: he stands before me, watching late and lone at a shrine in an Argive temple. For years of solitary ministry he has lived on dreams. He loves the idol he serves, and prays day and night that his frenzy may be fed. She has heard; she will favour him. He waits at the altar.\n\"A shock of heaven and earth is felt by that brave, lonely watcher. He is wrapped in sudden light. Through the roof, through the wide-yawning, vast blue of heaven, pours a wondrous descent, dread as the downrushing of stars. He has what he asked. I see an insufferable glory burning terribly between the pillars. Gods be merciful and quench it!\n\"In the morning, a pious Argive enters to make an early offering. There was thunder in the night; the bolt fell here. The shrine is shivered, the marble pavement split and blackened. Saturnia's statue rises chaste, grand, untouched; at her feet piled ashes lie pale. No priest remains; he who watched will be seen no more.\n\"There is the carriage! Let me lock up the desk and pocket the keys. She will be seeking them tomorrow; she will have to come to me asking if I have seen them, looking ashamed, conscious that this is the twentieth time of asking. I will tantalize her, before restoring them with a lecture. Here is the bag, too, and the purse; the glove - pen - seal. She shall wring them all out of me slowly and separately - only by confession, penitence, entreaty. Every feature of her face, her bright eyes, her lips, shall go through each change they know, for my pleasure - display each exquisite variety of glance and curve, to delight, thrill, perhaps more hopelessly to enchain me. If I must be her slave, I will not lose my freedom for nothing.\"\nHe locked the desk, pocketed all the property, and went.",
        "paragraph_chars": [
            [
                0,
                170
            ],
            [
                170,
                453
            ],
            [
                453,
                668
            ],
            [
                668,
                796
            ],
            [
                796,
                840
            ],
            [
                840,
                1032
            ],
            [
                1032,
                1322
            ],
            [
                1322,
                1461
            ],
            [
                1461,
                1721
            ],
            [
                1721,
                1734
            ],
            [
                1734,
                2214
            ],
            [
                2214,
                2381
            ],
            [
                2381,
                2551
            ],
            [
                2551,
                2702
            ],
            [
                2702,
                2840
            ],
            [
                2840,
                3080
            ],
            [
                3080,
                3198
            ],
            [
                3198,
                3823
            ],
            [
                3823,
                3936
            ],
            [
                3936,
                4268
            ],
            [
                4268,
                4496
            ],
            [
                4496,
                4929
            ],
            [
                4929,
                5614
            ],
            [
                5614,
                6283
            ],
            [
                6283,
                6594
            ],
            [
                6594,
                7545
            ],
            [
                7545,
                7736
            ],
            [
                7736,
                7867
            ],
            [
                7867,
                8228
            ],
            [
                8228,
                8525
            ],
            [
                8525,
                8870
            ],
            [
                8870,
                9193
            ],
            [
                9193,
                9932
            ],
            [
                9932,
                9988
            ]
        ],
        "segment_chars": [
            [
                0,
                38
            ],
            [
                38,
                170
            ],
            [
                170,
                208
            ],
            [
                208,
                243
            ],
            [
                243,
                325
            ],
            [
                325,
                453
            ],
            [
                453,
                514
            ],
            [
                514,
                569
            ],
            [
                569,
                668
            ],
            [
                668,
                745
            ],
            [
                745,
                796
            ],
            [
                796,
                840
            ],
            [
                840,
                969
            ],
            [
                969,
                1032
            ],
            [
                1032,
                1069
            ],
            [
                1069,
                1123
            ],
            [
                1123,
                1149
            ],
            [
                1149,
                1196
            ],
            [
                1196,
                1322
            ],
            [
                1322,
                1375
            ],
            [
                1375,
                1461
            ],
            [
                1461,
                1483
            ],
            [
                1483,
                1526
            ],
            [
                1526,
                1570
            ],
            [
                1570,
                1721
            ],
            [
                1721,
                1734
            ],
            [
                1734,
                1755
            ],
            [
                1755,
                1804
            ],
            [
                1804,
                1865
            ],
            [
                1865,
                1915
            ],
            [
                1915,
                1999
            ],
            [
                1999,
                2089
            ],
            [
                2089,
                2186
            ],
            [
                2186,
                2202
            ],
            [
                2202,
                2214
            ],
            [
                2214,
                2230
            ],
            [
                2230,
                2282
            ],
            [
                2282,
                2381
            ],
            [
                2381,
                2481
            ],
            [
                2481,
                2500
            ],
            [
                2500,
                2551
            ],
            [
                2551,
                2616
            ],
            [
                2616,
                2702
            ],
            [
                2702,
                2735
            ],
            [
                2735,
                2840
            ],
            [
                2840,
                3060
            ],
            [
                3060,
                3080
            ],
            [
                3080,
                3116
            ],
            [
                3116,
                3198
            ],
            [
                3198,
                3259
            ],
            [
                3259,
                3351
            ],
            [
                3351,
                3394
            ],
            [
                3394,
                3494
            ],
            [
                3494,
                3568
            ],
            [
                3568,
                3660
            ],
            [
                3660,
                3697
            ],
            [
                3697,
                3823
            ],
            [
                3823,
                3892
            ],
            [
                3892,
                3936
            ],
            [
                3936,
                3968
            ],
            [
                3968,
                4009
            ],
            [
                4009,
                4053
            ],
            [
                4053,
                4082
            ],
            [
                4082,
                4096
            ],
            [
                4096,
                4268
            ],
            [
                4268,
                4428
            ],
            [
                4428,
                4496
            ],
            [
                4496,
                4532
            ],
            [
                4532,
                4711
            ],
            [
                4711,
                4929
            ],
            [
                4929,
                5002
            ],
            [
                5002,
                5033
            ],
            [
                5033,
                5113
            ],
            [
                5113,
                5180
            ],
            [
                5180,
                5230
            ],
            [
                5230,
                5262
            ],
            [
                5262,
                5315
            ],
            [
                5315,
                5380
            ],
            [
                5380,
                5399
            ],
            [
                5399,
                5518
            ],
            [
                5518,
                5543
            ],
            [
                5543,
                5614
            ],
            [
                5614,
                5861
            ],
            [
                5861,
                5963
            ],
            [
                5963,
                6015
            ],
            [
                6015,
                6068
            ],
            [
                6068,
                6124
            ],
            [
                6124,
                6265
            ],
            [
                6265,
                6283
            ],
            [
                6283,
                6312
            ],
            [
                6312,
                6367
            ],
            [
                6367,
                6509
            ],
            [
                6509,
                6594
            ],
            [
                6594,
                6657
            ],
            [
                6657,
                6718
            ],
            [
                6718,
                6825
            ],
            [
                6825,
                6880
            ],
            [
                6880,
                7007
            ],
            [
                7007,
                7053
            ],
            [
                7053,
                7084
            ],
            [
                7084,
                7204
            ],
            [
                7204,
                7304
            ],
            [
                7304,
                7545
            ],
            [
                7545,
                7558
            ],
            [
                7558,
                7622
            ],
            [
                7622,
                7628
            ],
            [
                7628,
                7736
            ],
            [
                7736,
                7823
            ],
            [
                7823,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                8098
            ],
            [
                8098,
                8228
            ],
            [
                8228,
                8330
            ],
            [
                8330,
                8385
            ],
            [
                8385,
                8466
            ],
            [
                8466,
                8502
            ],
            [
                8502,
                8525
            ],
            [
                8525,
                8593
            ],
            [
                8593,
                8624
            ],
            [
                8624,
                8750
            ],
            [
                8750,
                8772
            ],
            [
                8772,
                8838
            ],
            [
                8838,
                8870
            ],
            [
                8870,
                8936
            ],
            [
                8936,
                8988
            ],
            [
                8988,
                9053
            ],
            [
                9053,
                9137
            ],
            [
                9137,
                9193
            ],
            [
                9193,
                9217
            ],
            [
                9217,
                9262
            ],
            [
                9262,
                9423
            ],
            [
                9423,
                9483
            ],
            [
                9483,
                9544
            ],
            [
                9544,
                9644
            ],
            [
                9644,
                9867
            ],
            [
                9867,
                9932
            ],
            [
                9932,
                9988
            ]
        ],
        "overlap_chars": [
            [
                0,
                38
            ],
            [
                38,
                58
            ],
            [
                59,
                170
            ],
            [
                170,
                208
            ],
            [
                208,
                221
            ],
            [
                222,
                243
            ],
            [
                243,
                253
            ],
            [
                254,
                260
            ],
            [
                261,
                265
            ],
            [
                266,
                268
            ],
            [
                274,
                325
            ],
            [
                325,
                328
            ],
            [
                329,
                333
            ],
            [
                334,
                341
            ],
            [
                342,
                382
            ],
            [
                390,
                394
            ],
            [
                404,
                411
            ],
            [
                412,
                413
            ],
            [
                414,
                419
            ],
            [
                420,
                422
            ],
            [
                423,
                426
            ],
            [
                434,
                436
            ],
            [
                437,
                452
            ],
            [
                453,
                475
            ],
            [
                475,
                476
            ],
            [
                486,
                500
            ],
            [
                506,
                512
            ],
            [
                512,
                513
            ],
            [
                514,
                517
            ],
            [
                525,
                531
            ],
            [
                535,
                536
            ],
            [
                537,
                569
            ],
            [
                569,
                615
            ],
            [
                616,
                667
            ],
            [
                668,
                701
            ],
            [
                708,
                722
            ],
            [
                723,
                745
            ],
            [
                745,
                747
            ],
            [
                754,
                768
            ],
            [
                777,
                794
            ],
            [
                794,
                796
            ],
            [
                796,
                828
            ],
            [
                828,
                830
            ],
            [
                836,
                839
            ],
            [
                840,
                842
            ],
            [
                850,
                857
            ],
            [
                863,
                872
            ],
            [
                880,
                888
            ],
            [
                889,
                893
            ],
            [
                903,
                906
            ],
            [
                907,
                917
            ],
            [
                924,
                927
            ],
            [
                928,
                969
            ],
            [
                969,
                971
            ],
            [
                980,
                990
            ],
            [
                991,
                995
            ],
            [
                1007,
                1032
            ],
            [
                1032,
                1069
            ],
            [
                1069,
                1123
            ],
            [
                1123,
                1149
            ],
            [
                1149,
                1166
            ],
            [
                1167,
                1188
            ],
            [
                1196,
                1263
            ],
            [
                1263,
                1308
            ],
            [
                1313,
                1320
            ],
            [
                1320,
                1322
            ],
            [
                1322,
                1375
            ],
            [
                1375,
                1394
            ],
            [
                1395,
                1397
            ],
            [
                1398,
                1401
            ],
            [
                1402,
                1407
            ],
            [
                1408,
                1434
            ],
            [
                1440,
                1448
            ],
            [
                1449,
                1459
            ],
            [
                1459,
                1461
            ],
            [
                1461,
                1483
            ],
            [
                1483,
                1500
            ],
            [
                1507,
                1526
            ],
            [
                1526,
                1570
            ],
            [
                1570,
                1621
            ],
            [
                1622,
                1653
            ],
            [
                1654,
                1659
            ],
            [
                1662,
                1711
            ],
            [
                1719,
                1720
            ],
            [
                1721,
                1734
            ],
            [
                1734,
                1755
            ],
            [
                1755,
                1773
            ],
            [
                1784,
                1802
            ],
            [
                1806,
                1827
            ],
            [
                1828,
                1845
            ],
            [
                1846,
                1865
            ],
            [
                1865,
                1915
            ],
            [
                1915,
                1918
            ],
            [
                1922,
                1930
            ],
            [
                1933,
                1975
            ],
            [
                1976,
                1979
            ],
            [
                1984,
                1989
            ],
            [
                2003,
                2012
            ],
            [
                2018,
                2042
            ],
            [
                2043,
                2089
            ],
            [
                2089,
                2153
            ],
            [
                2154,
                2186
            ],
            [
                2186,
                2202
            ],
            [
                2202,
                2214
            ],
            [
                2214,
                2230
            ],
            [
                2230,
                2260
            ],
            [
                2268,
                2280
            ],
            [
                2280,
                2282
            ],
            [
                2282,
                2302
            ],
            [
                2303,
                2325
            ],
            [
                2326,
                2329
            ],
            [
                2330,
                2350
            ],
            [
                2354,
                2357
            ],
            [
                2362,
                2367
            ],
            [
                2368,
                2380
            ],
            [
                2388,
                2411
            ],
            [
                2421,
                2424
            ],
            [
                2425,
                2434
            ],
            [
                2444,
                2457
            ],
            [
                2465,
                2481
            ],
            [
                2481,
                2490
            ],
            [
                2490,
                2500
            ],
            [
                2500,
                2523
            ],
            [
                2523,
                2551
            ],
            [
                2551,
                2614
            ],
            [
                2614,
                2616
            ],
            [
                2616,
                2642
            ],
            [
                2643,
                2665
            ],
            [
                2671,
                2702
            ],
            [
                2702,
                2733
            ],
            [
                2733,
                2735
            ],
            [
                2735,
                2753
            ],
            [
                2763,
                2807
            ],
            [
                2814,
                2817
            ],
            [
                2820,
                2840
            ],
            [
                2840,
                3023
            ],
            [
                3026,
                3060
            ],
            [
                3060,
                3064
            ],
            [
                3065,
                3080
            ],
            [
                3080,
                3110
            ],
            [
                3114,
                3116
            ],
            [
                3116,
                3145
            ],
            [
                3146,
                3157
            ],
            [
                3160,
                3179
            ],
            [
                3185,
                3190
            ],
            [
                3191,
                3198
            ],
            [
                3198,
                3259
            ],
            [
                3259,
                3301
            ],
            [
                3301,
                3351
            ],
            [
                3351,
                3354
            ],
            [
                3355,
                3362
            ],
            [
                3368,
                3394
            ],
            [
                3394,
                3398
            ],
            [
                3409,
                3458
            ],
            [
                3459,
                3463
            ],
            [
                3464,
                3472
            ],
            [
                3472,
                3492
            ],
            [
                3492,
                3494
            ],
            [
                3494,
                3568
            ],
            [
                3568,
                3593
            ],
            [
                3594,
                3658
            ],
            [
                3658,
                3660
            ],
            [
                3660,
                3697
            ],
            [
                3697,
                3708
            ],
            [
                3712,
                3735
            ],
            [
                3736,
                3739
            ],
            [
                3740,
                3751
            ],
            [
                3752,
                3754
            ],
            [
                3755,
                3802
            ],
            [
                3812,
                3823
            ],
            [
                3823,
                3860
            ],
            [
                3863,
                3892
            ],
            [
                3892,
                3893
            ],
            [
                3897,
                3916
            ],
            [
                3917,
                3936
            ],
            [
                3936,
                3968
            ],
            [
                3968,
                4009
            ],
            [
                4009,
                4053
            ],
            [
                4053,
                4082
            ],
            [
                4082,
                4096
            ],
            [
                4096,
                4166
            ],
            [
                4169,
                4268
            ],
            [
                4268,
                4317
            ],
            [
                4318,
                4386
            ],
            [
                4387,
                4392
            ],
            [
                4393,
                4428
            ],
            [
                4428,
                4465
            ],
            [
                4475,
                4495
            ],
            [
                4497,
                4532
            ],
            [
                4532,
                4672
            ],
            [
                4673,
                4709
            ],
            [
                4709,
                4711
            ],
            [
                4711,
                4715
            ],
            [
                4721,
                4734
            ],
            [
                4734,
                4735
            ],
            [
                4736,
                4770
            ],
            [
                4770,
                4771
            ],
            [
                4778,
                4781
            ],
            [
                4782,
                4805
            ],
            [
                4811,
                4841
            ],
            [
                4848,
                4873
            ],
            [
                4874,
                4875
            ],
            [
                4876,
                4893
            ],
            [
                4893,
                4894
            ],
            [
                4911,
                4913
            ],
            [
                4919,
                4923
            ],
            [
                4924,
                4927
            ],
            [
                4927,
                4928
            ],
            [
                4929,
                4933
            ],
            [
                4934,
                5002
            ],
            [
                5002,
                5018
            ],
            [
                5019,
                5026
            ],
            [
                5027,
                5031
            ],
            [
                5031,
                5033
            ],
            [
                5033,
                5085
            ],
            [
                5093,
                5099
            ],
            [
                5100,
                5113
            ],
            [
                5113,
                5151
            ],
            [
                5161,
                5179
            ],
            [
                5180,
                5230
            ],
            [
                5230,
                5260
            ],
            [
                5260,
                5262
            ],
            [
                5262,
                5315
            ],
            [
                5315,
                5331
            ],
            [
                5334,
                5378
            ],
            [
                5382,
                5399
            ],
            [
                5399,
                5417
            ],
            [
                5435,
                5485
            ],
            [
                5500,
                5518
            ],
            [
                5518,
                5528
            ],
            [
                5532,
                5543
            ],
            [
                5543,
                5551
            ],
            [
                5560,
                5568
            ],
            [
                5568,
                5613
            ],
            [
                5615,
                5634
            ],
            [
                5634,
                5671
            ],
            [
                5678,
                5693
            ],
            [
                5699,
                5726
            ],
            [
                5727,
                5755
            ],
            [
                5766,
                5783
            ],
            [
                5791,
                5831
            ],
            [
                5840,
                5843
            ],
            [
                5844,
                5861
            ],
            [
                5861,
                5875
            ],
            [
                5876,
                5924
            ],
            [
                5928,
                5932
            ],
            [
                5943,
                5961
            ],
            [
                5961,
                5963
            ],
            [
                5963,
                6013
            ],
            [
                6019,
                6025
            ],
            [
                6026,
                6056
            ],
            [
                6066,
                6068
            ],
            [
                6068,
                6124
            ],
            [
                6124,
                6149
            ],
            [
                6151,
                6154
            ],
            [
                6155,
                6265
            ],
            [
                6265,
                6283
            ],
            [
                6283,
                6312
            ],
            [
                6316,
                6367
            ],
            [
                6367,
                6382
            ],
            [
                6383,
                6404
            ],
            [
                6404,
                6405
            ],
            [
                6423,
                6474
            ],
            [
                6477,
                6509
            ],
            [
                6509,
                6594
            ],
            [
                6594,
                6629
            ],
            [
                6634,
                6637
            ],
            [
                6655,
                6657
            ],
            [
                6657,
                6716
            ],
            [
                6716,
                6718
            ],
            [
                6718,
                6775
            ],
            [
                6776,
                6791
            ],
            [
                6794,
                6796
            ],
            [
                6797,
                6807
            ],
            [
                6808,
                6813
            ],
            [
                6818,
                6823
            ],
            [
                6823,
                6825
            ],
            [
                6825,
                6839
            ],
            [
                6840,
                6841
            ],
            [
                6842,
                6880
            ],
            [
                6880,
                6904
            ],
            [
                6905,
                7007
            ],
            [
                7007,
                7013
            ],
            [
                7014,
                7035
            ],
            [
                7036,
                7053
            ],
            [
                7053,
                7078
            ],
            [
                7079,
                7083
            ],
            [
                7084,
                7086
            ],
            [
                7087,
                7128
            ],
            [
                7129,
                7149
            ],
            [
                7152,
                7204
            ],
            [
                7204,
                7218
            ],
            [
                7219,
                7257
            ],
            [
                7258,
                7287
            ],
            [
                7288,
                7302
            ],
            [
                7302,
                7304
            ],
            [
                7304,
                7324
            ],
            [
                7325,
                7329
            ],
            [
                7332,
                7358
            ],
            [
                7358,
                7368
            ],
            [
                7369,
                7536
            ],
            [
                7543,
                7544
            ],
            [
                7545,
                7558
            ],
            [
                7558,
                7622
            ],
            [
                7622,
                7628
            ],
            [
                7628,
                7736
            ],
            [
                7736,
                7744
            ],
            [
                7750,
                7823
            ],
            [
                7823,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                7907
            ],
            [
                7908,
                7911
            ],
            [
                7912,
                7914
            ],
            [
                7920,
                7924
            ],
            [
                7943,
                8045
            ],
            [
                8059,
                8064
            ],
            [
                8065,
                8096
            ],
            [
                8098,
                8099
            ],
            [
                8100,
                8107
            ],
            [
                8108,
                8111
            ],
            [
                8112,
                8125
            ],
            [
                8126,
                8226
            ],
            [
                8226,
                8228
            ],
            [
                8235,
                8251
            ],
            [
                8256,
                8330
            ],
            [
                8330,
                8385
            ],
            [
                8385,
                8464
            ],
            [
                8464,
                8466
            ],
            [
                8466,
                8489
            ],
            [
                8500,
                8502
            ],
            [
                8505,
                8525
            ],
            [
                8525,
                8561
            ],
            [
                8562,
                8569
            ],
            [
                8570,
                8575
            ],
            [
                8575,
                8576
            ],
            [
                8577,
                8591
            ],
            [
                8591,
                8593
            ],
            [
                8593,
                8624
            ],
            [
                8624,
                8653
            ],
            [
                8654,
                8672
            ],
            [
                8673,
                8687
            ],
            [
                8687,
                8750
            ],
            [
                8750,
                8772
            ],
            [
                8772,
                8838
            ],
            [
                8838,
                8870
            ],
            [
                8870,
                8871
            ],
            [
                8871,
                8877
            ],
            [
                8878,
                8885
            ],
            [
                8887,
                8934
            ],
            [
                8934,
                8936
            ],
            [
                8936,
                8988
            ],
            [
                8988,
                9031
            ],
            [
                9032,
                9053
            ],
            [
                9053,
                9137
            ],
            [
                9137,
                9193
            ],
            [
                9193,
                9217
            ],
            [
                9217,
                9262
            ],
            [
                9262,
                9286
            ],
            [
                9295,
                9324
            ],
            [
                9335,
                9336
            ],
            [
                9337,
                9341
            ],
            [
                9342,
                9346
            ],
            [
                9351,
                9423
            ],
            [
                9423,
                9444
            ],
            [
                9462,
                9466
            ],
            [
                9467,
                9471
            ],
            [
                9472,
                9483
            ],
            [
                9483,
                9529
            ],
            [
                9532,
                9535
            ],
            [
                9542,
                9544
            ],
            [
                9544,
                9600
            ],
            [
                9603,
                9644
            ],
            [
                9644,
                9753
            ],
            [
                9756,
                9867
            ],
            [
                9867,
                9932
            ],
            [
                9932,
                9988
            ]
        ],
        "row_chars": [
            [
                0,
                38
            ],
            [
                38,
                38
            ],
            [
                38,
                170
            ],
            [
                170,
                208
            ],
            [
                208,
                243
            ],
            [
                243,
                325
            ],
            [
                325,
                453
            ],
            [
                453,
                453
            ],
            [
                453,
                453
            ],
            [
                453,
                569
            ],
            [
                569,
                668
            ],
            [
                668,
                668
            ],
            [
                668,
                668
            ],
            [
                668,
                745
            ],
            [
                745,
                745
            ],
            [
                745,
                796
            ],
            [
                796,
                840
            ],
            [
                840,
                969
            ],
            [
                969,
                1032
            ],
            [
                1032,
                1069
            ],
            [
                1069,
                1123
            ],
            [
                1123,
                1149
            ],
            [
                1149,
                1196
            ],
            [
                1196,
                1322
            ],
            [
                1322,
                1375
            ],
            [
                1375,
                1461
            ],
            [
                1461,
                1483
            ],
            [
                1483,
                1526
            ],
            [
                1526,
                1570
            ],
            [
                1570,
                1721
            ],
            [
                1721,
                1721
            ],
            [
                1721,
                1734
            ],
            [
                1734,
                1755
            ],
            [
                1755,
                1865
            ],
            [
                1865,
                1915
            ],
            [
                1915,
                2089
            ],
            [
                2089,
                2186
            ],
            [
                2186,
                2202
            ],
            [
                2202,
                2202
            ],
            [
                2202,
                2214
            ],
            [
                2214,
                2230
            ],
            [
                2230,
                2282
            ],
            [
                2282,
                2381
            ],
            [
                2381,
                2481
            ],
            [
                2481,
                2500
            ],
            [
                2500,
                2500
            ],
            [
                2500,
                2551
            ],
            [
                2551,
                2616
            ],
            [
                2616,
                2702
            ],
            [
                2702,
                2735
            ],
            [
                2735,
                2840
            ],
            [
                2840,
                3060
            ],
            [
                3060,
                3080
            ],
            [
                3080,
                3116
            ],
            [
                3116,
                3198
            ],
            [
                3198,
                3259
            ],
            [
                3259,
                3351
            ],
            [
                3351,
                3394
            ],
            [
                3394,
                3494
            ],
            [
                3494,
                3494
            ],
            [
                3494,
                3568
            ],
            [
                3568,
                3660
            ],
            [
                3660,
                3697
            ],
            [
                3697,
                3823
            ],
            [
                3823,
                3892
            ],
            [
                3892,
                3892
            ],
            [
                3892,
                3936
            ],
            [
                3936,
                3968
            ],
            [
                3968,
                4009
            ],
            [
                4009,
                4009
            ],
            [
                4009,
                4009
            ],
            [
                4009,
                4009
            ],
            [
                4009,
                4053
            ],
            [
                4053,
                4082
            ],
            [
                4082,
                4096
            ],
            [
                4096,
                4268
            ],
            [
                4268,
                4428
            ],
            [
                4428,
                4496
            ],
            [
                4496,
                4496
            ],
            [
                4496,
                4496
            ],
            [
                4496,
                4496
            ],
            [
                4496,
                4532
            ],
            [
                4532,
                4532
            ],
            [
                4532,
                4711
            ],
            [
                4711,
                4711
            ],
            [
                4711,
                4929
            ],
            [
                4929,
                4929
            ],
            [
                4929,
                4929
            ],
            [
                4929,
                5002
            ],
            [
                5002,
                5033
            ],
            [
                5033,
                5113
            ],
            [
                5113,
                5180
            ],
            [
                5180,
                5230
            ],
            [
                5230,
                5262
            ],
            [
                5262,
                5262
            ],
            [
                5262,
                5315
            ],
            [
                5315,
                5399
            ],
            [
                5399,
                5399
            ],
            [
                5399,
                5518
            ],
            [
                5518,
                5518
            ],
            [
                5518,
                5543
            ],
            [
                5543,
                5614
            ],
            [
                5614,
                5861
            ],
            [
                5861,
                5963
            ],
            [
                5963,
                6015
            ],
            [
                6015,
                6015
            ],
            [
                6015,
                6068
            ],
            [
                6068,
                6124
            ],
            [
                6124,
                6265
            ],
            [
                6265,
                6265
            ],
            [
                6265,
                6265
            ],
            [
                6265,
                6283
            ],
            [
                6283,
                6312
            ],
            [
                6312,
                6367
            ],
            [
                6367,
                6367
            ],
            [
                6367,
                6367
            ],
            [
                6367,
                6509
            ],
            [
                6509,
                6509
            ],
            [
                6509,
                6509
            ],
            [
                6509,
                6594
            ],
            [
                6594,
                6657
            ],
            [
                6657,
                6718
            ],
            [
                6718,
                6825
            ],
            [
                6825,
                6825
            ],
            [
                6825,
                6880
            ],
            [
                6880,
                6880
            ],
            [
                6880,
                7007
            ],
            [
                7007,
                7053
            ],
            [
                7053,
                7084
            ],
            [
                7084,
                7204
            ],
            [
                7204,
                7204
            ],
            [
                7204,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7304
            ],
            [
                7304,
                7545
            ],
            [
                7545,
                7545
            ],
            [
                7545,
                7558
            ],
            [
                7558,
                7558
            ],
            [
                7558,
                7622
            ],
            [
                7622,
                7628
            ],
            [
                7628,
                7736
            ],
            [
                7736,
                7823
            ],
            [
                7823,
                7867
            ],
            [
                7867,
                7896
            ],
            [
                7896,
                8228
            ],
            [
                8228,
                8228
            ],
            [
                8228,
                8330
            ],
            [
                8330,
                8385
            ],
            [
                8385,
                8385
            ],
            [
                8385,
                8466
            ],
            [
                8466,
                8502
            ],
            [
                8502,
                8502
            ],
            [
                8502,
                8525
            ],
            [
                8525,
                8593
            ],
            [
                8593,
                8624
            ],
            [
                8624,
                8750
            ],
            [
                8750,
                8772
            ],
            [
                8772,
                8772
            ],
            [
                8772,
                8772
            ],
            [
                8772,
                8772
            ],
            [
                8772,
                8838
            ],
            [
                8838,
                8870
            ],
            [
                8870,
                8936
            ],
            [
                8936,
                8988
            ],
            [
                8988,
                9053
            ],
            [
                9053,
                9137
            ],
            [
                9137,
                9193
            ],
            [
                9193,
                9193
            ],
            [
                9193,
                9217
            ],
            [
                9217,
                9262
            ],
            [
                9262,
                9423
            ],
            [
                9423,
                9483
            ],
            [
                9483,
                9544
            ],
            [
                9544,
                9644
            ],
            [
                9644,
                9644
            ],
            [
                9644,
                9867
            ],
            [
                9867,
                9932
            ],
            [
                9932,
                9988
            ]
        ]
    }
}