{
    "original": {
        "text": "Everybody said it was high time for Mr. Moore to return home. All Briarfield wondered at his strange absence, and Whinbury and Nunnely brought each its separate contribution of amazement.\nWas it known why he stayed away? Yes. It was known twenty--forty times over, there being at least forty plausible reasons adduced to account for the unaccountable circumstance. Business it was not--_that_ the gossips agreed. He had achieved the business on which he departed long ago. His four ringleaders he had soon scented out and run down. He had attended their trial, heard their conviction and sentence, and seen them safely shipped prior to transportation.\nThis was known at Briarfield. The newspapers had reported it. The _Stilbro' Courier_ had given every particular, with amplifications. None applauded his perseverance or hailed his success, though the mill-owners were glad of it, trusting that the terrors of law vindicated would henceforward paralyze the sinister valour of disaffection. Disaffection, however, was still heard muttering to himself. He swore ominous oaths over the drugged beer of alehouses, and drank strange toasts in fiery British gin.\nOne report affirmed that Moore _dared_ not come to Yorkshire; he knew his life was not worth an hour's purchase if he did.\n\"I'll tell him that,\" said Mr. Yorke, when his foreman mentioned the rumour; \"and if _that_ does not bring him home full gallop, nothing will.\"\nEither that or some other motive prevailed at last to recall him. He announced to Joe Scott the day he should arrive at Stilbro', desiring his hackney to be sent to the George for his accommodation; and Joe Scott having informed Mr. Yorke, that gentleman made it in his way to meet him.\nIt was market-day. Moore arrived in time to take his usual place at the market dinner. As something of a stranger, and as a man of note and action, the assembled manufacturers received him with a certain distinction. Some, who in public would scarcely have dared to acknowledge his acquaintance, lest a little of the hate and vengeance laid up in store for him should perchance have fallen on them, in private hailed him as in some sort their champion. When the wine had circulated, their respect would have kindled to enthusiasm had not Moore's unshaken nonchalance held it in a damp, low, smouldering state.\nMr. Yorke, the permanent president of these dinners, witnessed his young friend's bearing with exceeding complacency. If one thing could stir his temper or excite his contempt more than another, it was to see a man befooled by flattery or elate with popularity. If one thing smoothed, soothed, and charmed him especially, it was the spectacle of a public character incapable of relishing his publicity--_incapable_, I say. Disdain would but have incensed; it was indifference that appeased his rough spirit.\nRobert, leaning back in his chair, quiet and almost surly, while the clothiers and blanket-makers vaunted his prowess and rehearsed his deeds--many of them interspersing their flatteries with coarse invectives against the operative class--was a delectable sight for Mr. Yorke. His heart tingled with the pleasing conviction that these gross eulogiums shamed Moore deeply, and made him half scorn himself and his work. On abuse, on reproach, on calumny, it is easy to smile; but painful indeed is the panegyric of those we contemn. Often had Moore gazed with a brilliant countenance over howling crowds from a hostile hustings. He had breasted the storm of unpopularity with gallant bearing and soul elate; but he drooped his head under the half-bred tradesmen's praise, and shrank chagrined before their congratulations.\nYorke could not help asking him how he liked his supporters, and whether he did not think they did honour to his cause. \"But it is a pity, lad,\" he added, \"that you did not hang these four samples of the unwashed. If you had managed _that_ feat, the gentry here would have riven the horses out of the coach, yoked to a score of asses, and drawn you into Stilbro' like a conquering general.\"\nMoore soon forsook the wine, broke from the party, and took the road. In less than five minutes Mr. Yorke followed him. They rode out of Stilbro' together.\nIt was early to go home, but yet it was late in the day. The last ray of the sun had already faded from the cloud-edges, and the October night was casting over the moorlands the shadow of her approach.\nMr. Yorke, moderately exhilarated with his moderate libations, and not displeased to see young Moore again in Yorkshire, and to have him for his comrade during the long ride home, took the discourse much to himself. He touched briefly, but scoffingly, on the trials and the conviction; he passed thence to the gossip of the neighbourhood, and ere long he attacked Moore on his own personal concerns.\n\"Bob, I believe you are worsted, and you deserve it. All was smooth. Fortune had fallen in love with you. She had decreed you the first prize in her wheel--twenty thousand pounds; she only required that you should hold your hand out and take it. And what did you do? You called for a horse and rode a-hunting to Warwickshire. Your sweetheart--Fortune, I mean--was perfectly indulgent. She said, 'I'll excuse him; he's young.' She waited, like 'Patience on a monument,' till the chase was over and the vermin-prey run down. She expected you would come back then, and be a good lad. You might still have had her first prize.\n\"It capped her beyond expression, and me too, to find that, instead of thundering home in a breakneck gallop and laying your assize laurels at her feet, you coolly took coach up to London. What you have done there Satan knows; nothing in this world, I believe, but sat and sulked. Your face was never lily fair, but it is olive green now. You're not as bonny as you were, man.\"\n\"And who is to have this prize you talk so much about?\"\n\"Only a baronet; that is all. I have not a doubt in my own mind you've lost her. She will be Lady Nunnely before Christmas.\"\n\"Hem! Quite probable.\"\n\"But she need not to have been. Fool of a lad! I swear you might have had her.\"\n\"By what token, Mr. Yorke?\"\n\"By every token--by the light of her eyes, the red of her cheeks. Red they grew when your name was mentioned, though of custom they are pale.\"\n\"My chance is quite over, I suppose?\"\n\"It ought to be. But try; it is worth trying. I call this Sir Philip milk and water. And then he writes verses, they say--tags rhymes. _You_ are above that, Bob, at all events.\"\n\"Would you advise me to propose, late as it is, Mr. Yorke--at the eleventh hour?\"\n\"You can but make the experiment, Robert. If she has a fancy for you--and, on my conscience, I believe she has or had--she will forgive much. But, my lad, you are laughing. Is it at me? You had better grin at your own perverseness. I see, however, you laugh at the wrong side of your mouth. You have as sour a look at this moment as one need wish to see.\"\n\"I have so quarrelled with myself, Yorke. I have so kicked against the pricks, and struggled in a strait waistcoat, and dislocated my wrists with wrenching them in handcuffs, and battered my hard head by driving it against a harder wall.\"\n\"Ha! I'm glad to hear that. Sharp exercise yon! I hope it has done you good--ta'en some of the self-conceit out of you?\"\n\"Self-conceit? What is it? Self-respect, self-tolerance even, what are they? Do you sell the articles? Do you know anybody who does? Give an indication. They would find in me a liberal chapman. I would part with my last guinea this minute to buy.\"\n\"Is it so with you, Robert? I find that spicy. I like a man to speak his mind. What has gone wrong?\"\n\"The machinery of all my nature; the whole enginery of this human mill; the boiler, which I take to be the heart, is fit to burst.\"\n\"That suld be putten i' print; it's striking. It's almost blank verse. Ye'll be jingling into poetry just e'now. If the afflatus comes, give way, Robert. Never heed me; I'll bear it this whet [time].\"\n\"Hideous, abhorrent, base blunder! You may commit in a moment what you will rue for years--what life cannot cancel.\"\n\"Lad, go on. I call it pie, nuts, sugar-candy. I like the taste uncommonly. Go on. It will do you good to talk. The moor is before us now, and there is no life for many a mile round.\"\n\"I _will_ talk. I am not ashamed to tell. There is a sort of wild cat in my breast, and I choose that you shall hear how it can yell.\"\n\"To me it is music. What grand voices you and Louis have! When Louis sings--tones off like a soft, deep bell--I've felt myself tremble again. The night is still. It listens. It is just leaning down to you, like a black priest to a blacker penitent. Confess, lad. Smooth naught down. Be candid as a convicted, justified, sanctified Methody at an experience meeting. Make yourself as wicked as Beelzebub. It will ease your mind.\"\n\"As mean as Mammon, you would say. Yorke, if I got off horseback and laid myself down across the road, would you have the goodness to gallop over me, backwards and forwards, about twenty times?\"\n\"Wi' all the pleasure in life, if there were no such thing as a coroner's inquest.\"\n\"Hiram Yorke, I certainly believed she loved me. I have seen her eyes sparkle radiantly when she has found me out in a crowd; she has flushed up crimson when she has offered me her hand, and said, 'How do you do, Mr. Moore?'\n\"My name had a magical influence over her. When others uttered it she changed countenance--I know she did. She pronounced it herself in the most musical of her many musical tones. She was cordial to me; she took an interest in me; she was anxious about me; she wished me well; she sought, she seized every opportunity to benefit me. I considered, paused, watched, weighed, wondered. I could come to but one conclusion--this is love.\n\"I looked at her, Yorke. I saw in her youth and a species of beauty. I saw power in her. Her wealth offered me the redemption of my honour and my standing. I owed her gratitude. She had aided me substantially and effectually by a loan of five thousand pounds. Could I remember these things? Could I believe she loved me? Could I hear wisdom urge me to marry her, and disregard every dear advantage, disbelieve every flattering suggestion, disdain every well-weighed counsel, turn and leave her? Young, graceful, gracious--my benefactress, attached to me, enamoured of me. I used to say so to myself; dwell on the word; mouth it over and over again; swell over it with a pleasant, pompous complacency, with an admiration dedicated entirely to myself, and unimpaired even by esteem for her; indeed I smiled in deep secrecy at her _navet_ and simplicity in being the first to love, and to show it. That whip of yours seems to have a good heavy handle, Yorke; you can swing it about your head and knock me out of the saddle, if you choose. I should rather relish a loundering whack.\"\n\"Tak patience, Robert, till the moon rises and I can see you. Speak plain out--did you love her or not? I could like to know. I feel curious.\"\n\"Sir--sir--I say--she is very pretty, in her own style, and very attractive. She has a look, at times, of a thing made out of fire and air, at which I stand and marvel, without a thought of clasping and kissing it. I felt in her a powerful magnet to my interest and vanity. I never felt as if nature meant her to be my other and better self. When a question on that head rushed upon me, I flung it off, saying brutally I should be rich with her and ruined without her--vowing I would be practical, and not romantic.\"\n\"A very sensible resolve. What mischief came of it, Bob?\"\n\"With this sensible resolve I walked up to Fieldhead one night last August. It was the very eve of my departure for Birmingham; for, you see, I wanted to secure Fortune's splendid prize. I had previously dispatched a note requesting a private interview. I found her at home, and alone.\n\"She received me without embarrassment, for she thought I came on business. _I_ was embarrassed enough, but determined. I hardly know how I got the operation over; but I went to work in a hard, firm fashion--frightful enough, I dare say. I sternly offered myself--my fine person--with my debts, of course, as a settlement.\n\"It vexed me, it kindled my ire, to find that she neither blushed, trembled, nor looked down. She responded, 'I doubt whether I have understood you, Mr. Moore.'\n\"And I had to go over the whole proposal twice, and word it as plainly as A B C, before she would fully take it in. And then, what did she do? Instead of faltering a sweet Yes, or maintaining a soft, confused silence (which would have been as good), she started up, walked twice fast through the room, in the way that _she_ only does, and no other woman, and ejaculated, 'God bless me!'\n\"Yorke, I stood on the hearth, backed by the mantelpiece; against it I leaned, and prepared for anything--everything. I knew my doom, and I knew myself. There was no misunderstanding her aspect and voice. She stopped and looked at me.\n\"'God bless me!' she piteously repeated, in that shocked, indignant, yet saddened accent. 'You have made a strange proposal--strange from _you_; and if you knew how strangely you worded it and looked it, you would be startled at yourself. You spoke like a brigand who demanded my purse rather than like a lover who asked my heart.'\n\"A queer sentence, was it not, Yorke? And I knew, as she uttered it, it was true as queer. Her words were a mirror in which I saw myself.\n\"I looked at her, dumb and wolfish. She at once enraged and shamed me.\n\"'Grard Moore, you know you don't love Shirley Keeldar.' I might have broken out into false swearing--vowed that I did love her; but I could not lie in her pure face. I could not perjure myself in her truthful presence. Besides, such hollow oaths would have been vain as void. She would no more have believed me than she would have believed the ghost of Judas, had he broken from the night and stood before her. Her female heart had finer perceptions than to be cheated into mistaking my half-coarse, half-cold admiration for true-throbbing, manly love.\n\"What next happened? you will say, Mr. Yorke.\n\"Why, she sat down in the window-seat and cried. She cried passionately. Her eyes not only rained but lightened. They flashed, open, large, dark, haughty, upon me. They said, 'You have pained me; you have outraged me; you have deceived me.'\n\"She added words soon to looks.\n\"'I _did_ respect--I _did_ admire--I _did_ like you,' she said--'yes, as much as if you were my brother; and _you--you_ want to make a speculation of me. You would immolate me to that mill, your Moloch!'\n\"I had the common sense to abstain from any word of excuse, any attempt at palliation. I stood to be scorned.\n\"Sold to the devil for the time being, I was certainly infatuated. When I did speak, what do you think I said?\n\"'Whatever my own feelings were, I was persuaded _you_ loved _me_, Miss Keeldar.'\n\"Beautiful, was it not? She sat quite confounded. 'Is it Robert Moore that speaks?' I heard her mutter. 'Is it a man--or something lower?'\n\"'Do you mean,' she asked aloud--'do you mean you thought I loved you as we love those we wish to marry?'\n\"It _was_ my meaning, and I said so.\n\"'You conceived an idea obnoxious to a woman's feelings,' was her answer. 'You have announced it in a fashion revolting to a woman's soul. You insinuate that all the frank kindness I have shown you has been a complicated, a bold, and an immodest manuvre to ensnare a husband. You imply that at last you come here out of pity to offer me your hand, because I have courted you. Let me say this: Your sight is jaundiced; you have seen wrong. Your mind is warped; you have judged wrong. Your tongue betrays you; you now speak wrong. I never loved you. Be at rest there. My heart is as pure of passion for you as yours is barren of affection for me.'\n\"I hope I was answered, Yorke?\n\"'I seem to be a blind, besotted sort of person,' was my remark.\n\"'_Loved_ you!' she cried. 'Why, I have been as frank with you as a sister--never shunned you, never feared you. You cannot,' she affirmed triumphantly--'you cannot make me tremble with your coming, nor accelerate my pulse by your influence.'\n\"I alleged that often, when she spoke to me, she blushed, and that the sound of my name moved her.\n\"'Not for _your_ sake!' she declared briefly. I urged explanation, but could get none.\n\"'When I sat beside you at the school feast, did you think I loved you then? When I stopped you in Maythorn Lane, did you think I loved you then? When I called on you in the counting-house, when I walked with you on the pavement, did you think I loved you then?'\n\"So she questioned me; and I said I did.\n\"By the Lord! Yorke, she rose, she grew tall, she expanded and refined almost to flame. There was a trembling all through her, as in live coal when its vivid vermilion is hottest.\n\"'That is to say that you have the worst opinion of me; that you deny me the possession of all I value most. That is to say that I am a traitor to all my sisters; that I have acted as no woman can act without degrading herself and her sex; that I have sought where the incorrupt of my kind naturally scorn and abhor to seek.' She and I were silent for many a minute. 'Lucifer, Star of the Morning,' she went on, 'thou art fallen! You, once high in my esteem, are hurled down; you, once intimate in my friendship, are cast out. Go!'\n\"I went not. I had heard her voice tremble, seen her lip quiver. I knew another storm of tears would fall, and then I believed some calm and some sunshine must come, and I would wait for it.\n\"As fast, but more quietly than before, the warm rain streamed down. There was another sound in her weeping--a softer, more regretful sound. While I watched, her eyes lifted to me a gaze more reproachful than haughty, more mournful than incensed.\n\"'O Moore!' said she. It was worse than 'Et tu, Brute!'\n\"I relieved myself by what should have been a sigh, but it became a groan. A sense of Cain-like desolation made my breast ache.\n\"'There has been error in what I have done,' I said, 'and it has won me bitter wages, which I will go and spend far from her who gave them.'\n\"I took my hat. All the time I could not have borne to depart so, and I believed she would not let me. Nor would she but for the mortal pang I had given her pride, that cowed her compassion and kept her silent.\n\"I was obliged to turn back of my own accord when I reached the door, to approach her, and to say, 'Forgive me.'\n\"'I could, if there was not myself to forgive too,' was her reply; 'but to mislead a sagacious man so far I must have done wrong.'\n\"I broke out suddenly with some declamation I do not remember. I know that it was sincere, and that my wish and aim were to absolve her to herself. In fact, in her case self-accusation was a chimera.\n\"At last she extended her hand. For the first time I wished to take her in my arms and kiss her. I _did_ kiss her hand many times.\n\"'Some day we shall be friends again,' she said, 'when you have had time to read my actions and motives in a true light, and not so horribly to misinterpret them. Time may give you the right key to all. Then, perhaps, you will comprehend me, and then we shall be reconciled.'\n\"Farewell drops rolled slow down her cheeks. She wiped them away.\n\"'I am sorry for what has happened--deeply sorry,' she sobbed. So was I, God knows! Thus were we severed.\"\n\"A queer tale!\" commented Mr. Yorke.\n\"I'll do it no more,\" vowed his companion; \"never more will I mention marriage to a woman unless I feel love. Henceforth credit and commerce may take care of themselves. Bankruptcy may come when it lists. I have done with slavish fear of disaster. I mean to work diligently, wait patiently, bear steadily. Let the worst come, I will take my axe and an emigrant's berth, and go out with Louis to the West; he and I have settled it. No woman shall ever again look at me as Miss Keeldar looked, ever again feel towards me as Miss Keeldar felt. In no woman's presence will I ever again stand at once such a fool and such a knave, such a brute and such a puppy.\"\n\"Tut!\" said the imperturbable Yorke, \"you make too much of it; but still, I say, I am capped. Firstly, that she did not love you; and secondly, that you did not love her. You are both young; you are both handsome; you are both well enough for wit and even for temper--take you on the right side. What ailed you that you could not agree?\"\n\"We never _have_ been, never _could_ be _at home_ with each other, Yorke. Admire each other as we might at a distance, still we jarred when we came very near. I have sat at one side of a room and observed her at the other, perhaps in an excited, genial moment, when she had some of her favourites round her--her old beaux, for instance, yourself and Helstone, with whom she is so playful, pleasant, and eloquent. I have watched her when she was most natural, most lively, and most lovely; my judgment has pronounced her beautiful. Beautiful she is at times, when her mood and her array partake of the splendid. I have drawn a little nearer, feeling that our terms of acquaintance gave me the right of approach. I have joined the circle round her seat, caught her eye, and mastered her attention; then we have conversed; and others, thinking me, perhaps, peculiarly privileged, have withdrawn by degrees, and left us alone. Were we happy thus left? For myself, I must say No. Always a feeling of constraint came over me; always I was disposed to be stern and strange. We talked politics and business. No soft sense of domestic intimacy ever opened our hearts, or thawed our language and made it flow easy and limpid. If we had confidences, they were confidences of the counting-house, not of the heart. Nothing in her cherished affection in me, made me better, gentler; she only stirred my brain and whetted my acuteness. She never crept into my heart or influenced its pulse; and for this good reason, no doubt, because I had not the secret of making her love me.\"\n\"Well, lad, it is a queer thing. I might laugh at thee, and reckon to despise thy refinements; but as it is dark night and we are by ourselves, I don't mind telling thee that thy talk brings back a glimpse of my own past life. Twenty-five years ago I tried to persuade a beautiful woman to love me, and she would not. I had not the key to her nature; she was a stone wall to me, doorless and windowless.\"\n\"But you loved _her_, Yorke; you worshipped Mary Cave. Your conduct, after all, was that of a man--never of a fortune-hunter.\"\n\"Ay, I _did_ love her; but then she was beautiful as the moon we do _not_ see to-night. There is naught like her in these days. Miss Helstone, maybe, has a look of her, but nobody else.\"\n\"Who has a look of her?\"\n\"That black-coated tyrant's niece--that quiet, delicate Miss Helstone. Many a time I have put on my spectacles to look at the lassie in church, because she has gentle blue een, wi' long lashes; and when she sits in shadow, and is very still and very pale, and is, happen, about to fall asleep wi' the length of the sermon and the heat of the biggin', she is as like one of Canova's marbles as aught else.\"\n\"Was Mary Cave in that style?\"\n\"Far grander!--less lass-like and flesh-like. You wondered why she hadn't wings and a crown. She was a stately, peaceful angel was my Mary.\"\n\"And you could not persuade her to love you?\"\n\"Not with all I could do, though I prayed Heaven many a time, on my bended knees, to help me.\"\n\"Mary Cave was not what you think her, Yorke. I have seen her picture at the rectory. She is no angel, but a fair, regular-featured, taciturn-looking woman--rather too white and lifeless for my taste. But, supposing she had been something better than she was----\"\n\"Robert,\" interrupted Yorke, \"I could fell you off your horse at this moment. However, I'll hold my hand. Reason tells me you are right and I am wrong. I know well enough that the passion I still have is only the remnant of an illusion. If Miss Cave had possessed either feeling or sense, she could not have been so perfectly impassible to my regard as she showed herself; she must have preferred me to that copper-faced despot.\"\n\"Supposing, Yorke, she had been educated (no women were educated in those days); supposing she had possessed a thoughtful, original mind, a love of knowledge, a wish for information, which she took an artless delight in receiving from your lips, and having measured out to her by your hand; supposing her conversation, when she sat at your side, was fertile, varied, imbued with a picturesque grace and genial interest, quiet flowing but clear and bounteous; supposing that when you stood near her by chance, or when you sat near her by design, comfort at once became your atmosphere, and content your element; supposing that whenever her face was under your gaze, or her idea filled your thoughts, you gradually ceased to be hard and anxious, and pure affection, love of home, thirst for sweet discourse, unselfish longing to protect and cherish, replaced the sordid, cankering calculations of your trade; supposing, with all this, that many a time, when you had been so happy as to possess your Mary's little hand, you had felt it tremble as you held it, just as a warm little bird trembles when you take it from its nest; supposing you had noticed her shrink into the background on your entrance into a room, yet if you sought her in her retreat she welcomed you with the sweetest smile that ever lit a fair virgin face, and only turned her eyes from the encounter of your own lest their clearness should reveal too much; supposing, in short, your Mary had been not cold, but modest; not vacant, but reflective; not obtuse, but sensitive; not inane, but innocent; not prudish, but pure,--would you have left her to court another woman for her wealth?\"\nMr. Yorke raised his hat, wiped his forehead with his handkerchief.\n\"The moon is up,\" was his first not quite relevant remark, pointing with his whip across the moor. \"There she is, rising into the haze, staring at us wi' a strange red glower. She is no more silver than old Helstone's brow is ivory. What does she mean by leaning her cheek on Rushedge i' that way, and looking at us wi' a scowl and a menace?\"\n\"Yorke, if Mary had loved you silently yet faithfully, chastely yet fervently, as you would wish your wife to love, would you have left her?\"\n\"Robert!\"--he lifted his arm, he held it suspended, and paused--\"Robert! this is a queer world, and men are made of the queerest dregs that Chaos churned up in her ferment. I might swear sounding oaths--oaths that would make the poachers think there was a bittern booming in Bilberry Moss--that, in the case you put, death only should have parted me from Mary. But I have lived in the world fifty-five years; I have been forced to study human nature; and, to speak a dark truth, the odds are, if Mary had loved and not scorned me, if I had been secure of her affection, certain of her constancy, been irritated by no doubts, stung by no humiliations--the odds are\" (he let his hand fall heavy on the saddle)--\"the odds are I should have left her!\"\nThey rode side by side in silence. Ere either spoke again they were on the other side of Rushedge. Briarfield lights starred the purple skirt of the moor. Robert, being the youngest, and having less of the past to absorb him than his comrade, recommenced first.\n\"I believe--I daily find it proved--that we can get nothing in this world worth keeping, not so much as a principle or a conviction, except out of purifying flame or through strengthening peril. We err, we fall, we are humbled; then we walk more carefully. We greedily eat and drink poison out of the gilded cup of vice or from the beggar's wallet of avarice. We are sickened, degraded; everything good in us rebels against us; our souls rise bitterly indignant against our bodies; there is a period of civil war; if the soul has strength, it conquers and rules thereafter.\"\n\"What art thou going to do now, Robert? What are thy plans?\"\n\"For my private plans, I'll keep them to myself--which is very easy, as at present I have none. No private life is permitted a man in my position--a man in debt. For my public plans, my views are a little altered. While I was in Birmingham I looked a little into reality, considered closely and at their source the causes of the present troubles of this country. I did the same in London. Unknown, I could go where I pleased, mix with whom I would. I went where there was want of food, of fuel, of clothing; where there was no occupation and no hope. I saw some, with naturally elevated tendencies and good feelings, kept down amongst sordid privations and harassing griefs. I saw many originally low, and to whom lack of education left scarcely anything but animal wants, disappointed in those wants, ahungered, athirst, and desperate as famished animals. I saw what taught my brain a new lesson, and filled my breast with fresh feelings. I have no intention to profess more softness or sentiment than I have hitherto professed; mutiny and ambition I regard as I have always regarded them. I should resist a riotous mob just as heretofore; I should open on the scent of a runaway ringleader as eagerly as ever, and run him down as relentlessly, and follow him up to condign punishment as rigorously; but I should do it now chiefly for the sake and the security of those he misled. Something there is to look to, Yorke, beyond a man's personal interest, beyond the advancement of well-laid schemes, beyond even the discharge of dishonouring debts. To respect himself, a man must believe he renders justice to his fellow-men. Unless I am more considerate to ignorance, more forbearing to suffering, than I have hitherto been, I shall scorn myself as grossly unjust.--What now?\" he said, addressing his horse, which, hearing the ripple of water, and feeling thirsty, turned to a wayside trough, where the moonbeam was playing in a crystal eddy.\n\"Yorke,\" pursued Moore, \"ride on; I must let him drink.\"\nYorke accordingly rode slowly forwards, occupying himself as he advanced in discriminating, amongst the many lights now spangling the distance, those of Briarmains. Stilbro' Moor was left behind; plantations rose dusk on either hand; they were descending the hill; below them lay the valley with its populous parish: they felt already at home.\nSurrounded no longer by heath, it was not startling to Mr. Yorke to see a hat rise, and to hear a voice speak behind the wall. The words, however, were peculiar.\n\"When the wicked perisheth there is shouting,\" it said; and added, \"As the whirlwind passeth, so is the wicked no more\" (with a deeper growl): \"terrors take hold of him as waters; hell is naked before him. He shall die without knowledge.\"\nA fierce flash and sharp crack violated the calm of night. Yorke, ere he turned, knew the four convicts of Birmingham were avenged.",
        "paragraph_chars": [
            [
                0,
                188
            ],
            [
                188,
                652
            ],
            [
                652,
                1157
            ],
            [
                1157,
                1280
            ],
            [
                1280,
                1424
            ],
            [
                1424,
                1711
            ],
            [
                1711,
                2321
            ],
            [
                2321,
                2829
            ],
            [
                2829,
                3650
            ],
            [
                3650,
                4041
            ],
            [
                4041,
                4197
            ],
            [
                4197,
                4399
            ],
            [
                4399,
                4799
            ],
            [
                4799,
                5422
            ],
            [
                5422,
                5800
            ],
            [
                5800,
                5856
            ],
            [
                5856,
                5981
            ],
            [
                5981,
                6004
            ],
            [
                6004,
                6084
            ],
            [
                6084,
                6112
            ],
            [
                6112,
                6255
            ],
            [
                6255,
                6293
            ],
            [
                6293,
                6471
            ],
            [
                6471,
                6553
            ],
            [
                6553,
                6909
            ],
            [
                6909,
                7148
            ],
            [
                7148,
                7269
            ],
            [
                7269,
                7517
            ],
            [
                7517,
                7618
            ],
            [
                7618,
                7750
            ],
            [
                7750,
                7951
            ],
            [
                7951,
                8068
            ],
            [
                8068,
                8252
            ],
            [
                8252,
                8387
            ],
            [
                8387,
                8815
            ],
            [
                8815,
                9010
            ],
            [
                9010,
                9094
            ],
            [
                9094,
                9319
            ],
            [
                9319,
                9752
            ],
            [
                9752,
                10832
            ],
            [
                10832,
                10975
            ],
            [
                10975,
                11492
            ],
            [
                11492,
                11550
            ],
            [
                11550,
                11836
            ],
            [
                11836,
                12159
            ],
            [
                12159,
                12320
            ],
            [
                12320,
                12707
            ],
            [
                12707,
                12942
            ],
            [
                12942,
                13274
            ],
            [
                13274,
                13412
            ],
            [
                13412,
                13483
            ],
            [
                13483,
                14037
            ],
            [
                14037,
                14083
            ],
            [
                14083,
                14324
            ],
            [
                14324,
                14356
            ],
            [
                14356,
                14560
            ],
            [
                14560,
                14670
            ],
            [
                14670,
                14781
            ],
            [
                14781,
                14863
            ],
            [
                14863,
                15002
            ],
            [
                15002,
                15108
            ],
            [
                15108,
                15145
            ],
            [
                15145,
                15791
            ],
            [
                15791,
                15822
            ],
            [
                15822,
                15887
            ],
            [
                15887,
                16130
            ],
            [
                16130,
                16229
            ],
            [
                16229,
                16316
            ],
            [
                16316,
                16579
            ],
            [
                16579,
                16620
            ],
            [
                16620,
                16800
            ],
            [
                16800,
                17332
            ],
            [
                17332,
                17523
            ],
            [
                17523,
                17770
            ],
            [
                17770,
                17826
            ],
            [
                17826,
                17954
            ],
            [
                17954,
                18095
            ],
            [
                18095,
                18306
            ],
            [
                18306,
                18419
            ],
            [
                18419,
                18550
            ],
            [
                18550,
                18750
            ],
            [
                18750,
                18881
            ],
            [
                18881,
                19157
            ],
            [
                19157,
                19223
            ],
            [
                19223,
                19330
            ],
            [
                19330,
                19367
            ],
            [
                19367,
                20025
            ],
            [
                20025,
                20363
            ],
            [
                20363,
                21928
            ],
            [
                21928,
                22333
            ],
            [
                22333,
                22460
            ],
            [
                22460,
                22647
            ],
            [
                22647,
                22672
            ],
            [
                22672,
                23078
            ],
            [
                23078,
                23109
            ],
            [
                23109,
                23250
            ],
            [
                23250,
                23296
            ],
            [
                23296,
                23391
            ],
            [
                23391,
                23655
            ],
            [
                23655,
                24085
            ],
            [
                24085,
                25740
            ],
            [
                25740,
                25808
            ],
            [
                25808,
                26151
            ],
            [
                26151,
                26293
            ],
            [
                26293,
                27041
            ],
            [
                27041,
                27303
            ],
            [
                27303,
                27878
            ],
            [
                27878,
                27939
            ],
            [
                27939,
                29882
            ],
            [
                29882,
                29939
            ],
            [
                29939,
                30283
            ],
            [
                30283,
                30445
            ],
            [
                30445,
                30684
            ],
            [
                30684,
                30815
            ]
        ],
        "segment_chars": [
            [
                0,
                62
            ],
            [
                62,
                188
            ],
            [
                188,
                221
            ],
            [
                221,
                226
            ],
            [
                226,
                365
            ],
            [
                365,
                413
            ],
            [
                413,
                473
            ],
            [
                473,
                532
            ],
            [
                532,
                652
            ],
            [
                652,
                682
            ],
            [
                682,
                714
            ],
            [
                714,
                786
            ],
            [
                786,
                990
            ],
            [
                990,
                1051
            ],
            [
                1051,
                1157
            ],
            [
                1157,
                1280
            ],
            [
                1280,
                1424
            ],
            [
                1424,
                1490
            ],
            [
                1490,
                1711
            ],
            [
                1711,
                1730
            ],
            [
                1730,
                1798
            ],
            [
                1798,
                1928
            ],
            [
                1928,
                2164
            ],
            [
                2164,
                2321
            ],
            [
                2321,
                2439
            ],
            [
                2439,
                2583
            ],
            [
                2583,
                2744
            ],
            [
                2744,
                2829
            ],
            [
                2829,
                3106
            ],
            [
                3106,
                3247
            ],
            [
                3247,
                3360
            ],
            [
                3360,
                3456
            ],
            [
                3456,
                3650
            ],
            [
                3650,
                3770
            ],
            [
                3770,
                3864
            ],
            [
                3864,
                4041
            ],
            [
                4041,
                4111
            ],
            [
                4111,
                4161
            ],
            [
                4161,
                4197
            ],
            [
                4197,
                4254
            ],
            [
                4254,
                4399
            ],
            [
                4399,
                4615
            ],
            [
                4615,
                4799
            ],
            [
                4799,
                4852
            ],
            [
                4852,
                4868
            ],
            [
                4868,
                4905
            ],
            [
                4905,
                5045
            ],
            [
                5045,
                5066
            ],
            [
                5066,
                5125
            ],
            [
                5125,
                5184
            ],
            [
                5184,
                5225
            ],
            [
                5225,
                5322
            ],
            [
                5322,
                5380
            ],
            [
                5380,
                5422
            ],
            [
                5422,
                5611
            ],
            [
                5611,
                5703
            ],
            [
                5703,
                5761
            ],
            [
                5761,
                5800
            ],
            [
                5800,
                5856
            ],
            [
                5856,
                5886
            ],
            [
                5886,
                5937
            ],
            [
                5937,
                5981
            ],
            [
                5981,
                5987
            ],
            [
                5987,
                6004
            ],
            [
                6004,
                6036
            ],
            [
                6036,
                6051
            ],
            [
                6051,
                6084
            ],
            [
                6084,
                6112
            ],
            [
                6112,
                6178
            ],
            [
                6178,
                6255
            ],
            [
                6255,
                6293
            ],
            [
                6293,
                6310
            ],
            [
                6310,
                6339
            ],
            [
                6339,
                6378
            ],
            [
                6378,
                6428
            ],
            [
                6428,
                6471
            ],
            [
                6471,
                6553
            ],
            [
                6553,
                6595
            ],
            [
                6595,
                6695
            ],
            [
                6695,
                6726
            ],
            [
                6726,
                6739
            ],
            [
                6739,
                6785
            ],
            [
                6785,
                6844
            ],
            [
                6844,
                6909
            ],
            [
                6909,
                6951
            ],
            [
                6951,
                7148
            ],
            [
                7148,
                7153
            ],
            [
                7153,
                7176
            ],
            [
                7176,
                7196
            ],
            [
                7196,
                7269
            ],
            [
                7269,
                7284
            ],
            [
                7284,
                7296
            ],
            [
                7296,
                7346
            ],
            [
                7346,
                7372
            ],
            [
                7372,
                7402
            ],
            [
                7402,
                7422
            ],
            [
                7422,
                7463
            ],
            [
                7463,
                7517
            ],
            [
                7517,
                7545
            ],
            [
                7545,
                7564
            ],
            [
                7564,
                7596
            ],
            [
                7596,
                7618
            ],
            [
                7618,
                7750
            ],
            [
                7750,
                7796
            ],
            [
                7796,
                7821
            ],
            [
                7821,
                7863
            ],
            [
                7863,
                7904
            ],
            [
                7904,
                7951
            ],
            [
                7951,
                7986
            ],
            [
                7986,
                8068
            ],
            [
                8068,
                8081
            ],
            [
                8081,
                8115
            ],
            [
                8115,
                8144
            ],
            [
                8144,
                8151
            ],
            [
                8151,
                8180
            ],
            [
                8180,
                8252
            ],
            [
                8252,
                8268
            ],
            [
                8268,
                8294
            ],
            [
                8294,
                8387
            ],
            [
                8387,
                8407
            ],
            [
                8407,
                8445
            ],
            [
                8445,
                8529
            ],
            [
                8529,
                8549
            ],
            [
                8549,
                8561
            ],
            [
                8561,
                8636
            ],
            [
                8636,
                8650
            ],
            [
                8650,
                8670
            ],
            [
                8670,
                8752
            ],
            [
                8752,
                8790
            ],
            [
                8790,
                8815
            ],
            [
                8815,
                8850
            ],
            [
                8850,
                9010
            ],
            [
                9010,
                9094
            ],
            [
                9094,
                9143
            ],
            [
                9143,
                9319
            ],
            [
                9319,
                9362
            ],
            [
                9362,
                9426
            ],
            [
                9426,
                9499
            ],
            [
                9499,
                9652
            ],
            [
                9652,
                9702
            ],
            [
                9702,
                9752
            ],
            [
                9752,
                9777
            ],
            [
                9777,
                9821
            ],
            [
                9821,
                9841
            ],
            [
                9841,
                9908
            ],
            [
                9908,
                9930
            ],
            [
                9930,
                10012
            ],
            [
                10012,
                10043
            ],
            [
                10043,
                10073
            ],
            [
                10073,
                10247
            ],
            [
                10247,
                10324
            ],
            [
                10324,
                10647
            ],
            [
                10647,
                10788
            ],
            [
                10788,
                10832
            ],
            [
                10832,
                10894
            ],
            [
                10894,
                10936
            ],
            [
                10936,
                10958
            ],
            [
                10958,
                10975
            ],
            [
                10975,
                11052
            ],
            [
                11052,
                11190
            ],
            [
                11190,
                11249
            ],
            [
                11249,
                11317
            ],
            [
                11317,
                11492
            ],
            [
                11492,
                11518
            ],
            [
                11518,
                11550
            ],
            [
                11550,
                11626
            ],
            [
                11626,
                11737
            ],
            [
                11737,
                11804
            ],
            [
                11804,
                11836
            ],
            [
                11836,
                11912
            ],
            [
                11912,
                11956
            ],
            [
                11956,
                12074
            ],
            [
                12074,
                12159
            ],
            [
                12159,
                12253
            ],
            [
                12253,
                12320
            ],
            [
                12320,
                12436
            ],
            [
                12436,
                12463
            ],
            [
                12463,
                12707
            ],
            [
                12707,
                12825
            ],
            [
                12825,
                12860
            ],
            [
                12860,
                12912
            ],
            [
                12912,
                12942
            ],
            [
                12942,
                12959
            ],
            [
                12959,
                13032
            ],
            [
                13032,
                13181
            ],
            [
                13181,
                13274
            ],
            [
                13274,
                13312
            ],
            [
                13312,
                13365
            ],
            [
                13365,
                13412
            ],
            [
                13412,
                13448
            ],
            [
                13448,
                13483
            ],
            [
                13483,
                13540
            ],
            [
                13540,
                13650
            ],
            [
                13650,
                13703
            ],
            [
                13703,
                13760
            ],
            [
                13760,
                13895
            ],
            [
                13895,
                14037
            ],
            [
                14037,
                14058
            ],
            [
                14058,
                14083
            ],
            [
                14083,
                14132
            ],
            [
                14132,
                14156
            ],
            [
                14156,
                14196
            ],
            [
                14196,
                14247
            ],
            [
                14247,
                14324
            ],
            [
                14324,
                14356
            ],
            [
                14356,
                14510
            ],
            [
                14510,
                14560
            ],
            [
                14560,
                14647
            ],
            [
                14647,
                14670
            ],
            [
                14670,
                14737
            ],
            [
                14737,
                14781
            ],
            [
                14781,
                14863
            ],
            [
                14863,
                14887
            ],
            [
                14887,
                14913
            ],
            [
                14913,
                14947
            ],
            [
                14947,
                14967
            ],
            [
                14967,
                15002
            ],
            [
                15002,
                15108
            ],
            [
                15108,
                15145
            ],
            [
                15145,
                15219
            ],
            [
                15219,
                15284
            ],
            [
                15284,
                15421
            ],
            [
                15421,
                15521
            ],
            [
                15521,
                15584
            ],
            [
                15584,
                15628
            ],
            [
                15628,
                15674
            ],
            [
                15674,
                15693
            ],
            [
                15693,
                15711
            ],
            [
                15711,
                15791
            ],
            [
                15791,
                15822
            ],
            [
                15822,
                15887
            ],
            [
                15887,
                15903
            ],
            [
                15903,
                15914
            ],
            [
                15914,
                16000
            ],
            [
                16000,
                16130
            ],
            [
                16130,
                16229
            ],
            [
                16229,
                16253
            ],
            [
                16253,
                16275
            ],
            [
                16275,
                16316
            ],
            [
                16316,
                16393
            ],
            [
                16393,
                16462
            ],
            [
                16462,
                16579
            ],
            [
                16579,
                16620
            ],
            [
                16620,
                16634
            ],
            [
                16634,
                16708
            ],
            [
                16708,
                16800
            ],
            [
                16800,
                16909
            ],
            [
                16909,
                17126
            ],
            [
                17126,
                17167
            ],
            [
                17167,
                17230
            ],
            [
                17230,
                17327
            ],
            [
                17327,
                17332
            ],
            [
                17332,
                17345
            ],
            [
                17345,
                17397
            ],
            [
                17397,
                17523
            ],
            [
                17523,
                17592
            ],
            [
                17592,
                17664
            ],
            [
                17664,
                17770
            ],
            [
                17770,
                17782
            ],
            [
                17782,
                17792
            ],
            [
                17792,
                17826
            ],
            [
                17826,
                17901
            ],
            [
                17901,
                17954
            ],
            [
                17954,
                18095
            ],
            [
                18095,
                18111
            ],
            [
                18111,
                18198
            ],
            [
                18198,
                18306
            ],
            [
                18306,
                18419
            ],
            [
                18419,
                18550
            ],
            [
                18550,
                18613
            ],
            [
                18613,
                18698
            ],
            [
                18698,
                18750
            ],
            [
                18750,
                18782
            ],
            [
                18782,
                18847
            ],
            [
                18847,
                18881
            ],
            [
                18881,
                19044
            ],
            [
                19044,
                19084
            ],
            [
                19084,
                19157
            ],
            [
                19157,
                19202
            ],
            [
                19202,
                19223
            ],
            [
                19223,
                19286
            ],
            [
                19286,
                19307
            ],
            [
                19307,
                19330
            ],
            [
                19330,
                19346
            ],
            [
                19346,
                19367
            ],
            [
                19367,
                19477
            ],
            [
                19477,
                19537
            ],
            [
                19537,
                19572
            ],
            [
                19572,
                19615
            ],
            [
                19615,
                19673
            ],
            [
                19673,
                19798
            ],
            [
                19798,
                19908
            ],
            [
                19908,
                20025
            ],
            [
                20025,
                20032
            ],
            [
                20032,
                20119
            ],
            [
                20119,
                20196
            ],
            [
                20196,
                20321
            ],
            [
                20321,
                20363
            ],
            [
                20363,
                20437
            ],
            [
                20437,
                20522
            ],
            [
                20522,
                20776
            ],
            [
                20776,
                20894
            ],
            [
                20894,
                20974
            ],
            [
                20974,
                21074
            ],
            [
                21074,
                21286
            ],
            [
                21286,
                21311
            ],
            [
                21311,
                21338
            ],
            [
                21338,
                21430
            ],
            [
                21430,
                21463
            ],
            [
                21463,
                21579
            ],
            [
                21579,
                21665
            ],
            [
                21665,
                21784
            ],
            [
                21784,
                21928
            ],
            [
                21928,
                21961
            ],
            [
                21961,
                22155
            ],
            [
                22155,
                22246
            ],
            [
                22246,
                22333
            ],
            [
                22333,
                22388
            ],
            [
                22388,
                22460
            ],
            [
                22460,
                22548
            ],
            [
                22548,
                22588
            ],
            [
                22588,
                22647
            ],
            [
                22647,
                22672
            ],
            [
                22672,
                22743
            ],
            [
                22743,
                23078
            ],
            [
                23078,
                23109
            ],
            [
                23109,
                23155
            ],
            [
                23155,
                23202
            ],
            [
                23202,
                23250
            ],
            [
                23250,
                23296
            ],
            [
                23296,
                23391
            ],
            [
                23391,
                23437
            ],
            [
                23437,
                23477
            ],
            [
                23477,
                23592
            ],
            [
                23592,
                23655
            ],
            [
                23655,
                23733
            ],
            [
                23733,
                23761
            ],
            [
                23761,
                23807
            ],
            [
                23807,
                23892
            ],
            [
                23892,
                24085
            ],
            [
                24085,
                25740
            ],
            [
                25740,
                25808
            ],
            [
                25808,
                25907
            ],
            [
                25907,
                25984
            ],
            [
                25984,
                26041
            ],
            [
                26041,
                26151
            ],
            [
                26151,
                26293
            ],
            [
                26293,
                26302
            ],
            [
                26302,
                26366
            ],
            [
                26366,
                26466
            ],
            [
                26466,
                26654
            ],
            [
                26654,
                27041
            ],
            [
                27041,
                27076
            ],
            [
                27076,
                27140
            ],
            [
                27140,
                27196
            ],
            [
                27196,
                27303
            ],
            [
                27303,
                27498
            ],
            [
                27498,
                27560
            ],
            [
                27560,
                27663
            ],
            [
                27663,
                27878
            ],
            [
                27878,
                27918
            ],
            [
                27918,
                27939
            ],
            [
                27939,
                28035
            ],
            [
                28035,
                28101
            ],
            [
                28101,
                28153
            ],
            [
                28153,
                28302
            ],
            [
                28302,
                28328
            ],
            [
                28328,
                28388
            ],
            [
                28388,
                28490
            ],
            [
                28490,
                28614
            ],
            [
                28614,
                28796
            ],
            [
                28796,
                28879
            ],
            [
                28879,
                29030
            ],
            [
                29030,
                29321
            ],
            [
                29321,
                29487
            ],
            [
                29487,
                29564
            ],
            [
                29564,
                29716
            ],
            [
                29716,
                29882
            ],
            [
                29882,
                29939
            ],
            [
                29939,
                30104
            ],
            [
                30104,
                30283
            ],
            [
                30283,
                30410
            ],
            [
                30410,
                30445
            ],
            [
                30445,
                30651
            ],
            [
                30651,
                30684
            ],
            [
                30684,
                30743
            ],
            [
                30743,
                30815
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                40,
                62
            ],
            [
                393,
                411
            ],
            [
                387,
                391
            ],
            [
                374,
                384
            ],
            [
                365,
                373
            ],
            [
                215,
                219
            ],
            [
                411,
                413
            ],
            [
                413,
                419
            ],
            [
                463,
                473
            ],
            [
                494,
                505
            ],
            [
                522,
                530
            ],
            [
                473,
                493
            ],
            [
                532,
                652
            ],
            [
                682,
                709
            ],
            [
                712,
                714
            ],
            [
                786,
                790
            ],
            [
                821,
                909
            ],
            [
                953,
                956
            ],
            [
                910,
                913
            ],
            [
                925,
                930
            ],
            [
                944,
                950
            ],
            [
                976,
                979
            ],
            [
                988,
                990
            ],
            [
                990,
                1049
            ],
            [
                1049,
                1050
            ],
            [
                1157,
                1187
            ],
            [
                1196,
                1239
            ],
            [
                1269,
                1280
            ],
            [
                1280,
                1364
            ],
            [
                1366,
                1370
            ],
            [
                1372,
                1424
            ],
            [
                1424,
                1456
            ],
            [
                1467,
                1474
            ],
            [
                1485,
                1490
            ],
            [
                1490,
                1492
            ],
            [
                1503,
                1515
            ],
            [
                1516,
                1553
            ],
            [
                1623,
                1678
            ],
            [
                1698,
                1711
            ],
            [
                1711,
                1730
            ],
            [
                1730,
                1796
            ],
            [
                1824,
                1825
            ],
            [
                1859,
                1904
            ],
            [
                1915,
                1926
            ],
            [
                1857,
                1858
            ],
            [
                2110,
                2120
            ],
            [
                1974,
                1976
            ],
            [
                1948,
                1953
            ],
            [
                1938,
                1947
            ],
            [
                2128,
                2134
            ],
            [
                2148,
                2164
            ],
            [
                2249,
                2277
            ],
            [
                2291,
                2295
            ],
            [
                2194,
                2199
            ],
            [
                2230,
                2240
            ],
            [
                2278,
                2290
            ],
            [
                2297,
                2321
            ],
            [
                2321,
                2335
            ],
            [
                2346,
                2410
            ],
            [
                2426,
                2433
            ],
            [
                2437,
                2439
            ],
            [
                2545,
                2559
            ],
            [
                2571,
                2583
            ],
            [
                2802,
                2829
            ],
            [
                2829,
                2926
            ],
            [
                3068,
                3106
            ],
            [
                3370,
                3375
            ],
            [
                3542,
                3558
            ],
            [
                3597,
                3609
            ],
            [
                3620,
                3626
            ],
            [
                3472,
                3475
            ],
            [
                3579,
                3590
            ],
            [
                3633,
                3649
            ],
            [
                4047,
                4068
            ],
            [
                4092,
                4100
            ],
            [
                4101,
                4111
            ],
            [
                4139,
                4159
            ],
            [
                4161,
                4197
            ],
            [
                4230,
                4254
            ],
            [
                4270,
                4277
            ],
            [
                4258,
                4266
            ],
            [
                4278,
                4351
            ],
            [
                4385,
                4388
            ],
            [
                4375,
                4381
            ],
            [
                4352,
                4370
            ],
            [
                4397,
                4399
            ],
            [
                4399,
                4437
            ],
            [
                4460,
                4465
            ],
            [
                4524,
                4531
            ],
            [
                4488,
                4499
            ],
            [
                4544,
                4551
            ],
            [
                4518,
                4519
            ],
            [
                4598,
                4602
            ],
            [
                4559,
                4562
            ],
            [
                4613,
                4615
            ],
            [
                4615,
                4633
            ],
            [
                4651,
                4668
            ],
            [
                4673,
                4741
            ],
            [
                4746,
                4775
            ],
            [
                4780,
                4799
            ],
            [
                4799,
                4852
            ],
            [
                4868,
                4875
            ],
            [
                4900,
                4903
            ],
            [
                4962,
                4978
            ],
            [
                4921,
                4924
            ],
            [
                4983,
                4987
            ],
            [
                4876,
                4879
            ],
            [
                5013,
                5017
            ],
            [
                5028,
                5031
            ],
            [
                5018,
                5027
            ],
            [
                5032,
                5045
            ],
            [
                5045,
                5066
            ],
            [
                5066,
                5097
            ],
            [
                5108,
                5125
            ],
            [
                5142,
                5149
            ],
            [
                5229,
                5235
            ],
            [
                5320,
                5322
            ],
            [
                5380,
                5404
            ],
            [
                5415,
                5422
            ],
            [
                5422,
                5423
            ],
            [
                5480,
                5546
            ],
            [
                5554,
                5585
            ],
            [
                5600,
                5611
            ],
            [
                5611,
                5656
            ],
            [
                5670,
                5701
            ],
            [
                5800,
                5856
            ],
            [
                5856,
                5886
            ],
            [
                5937,
                5978
            ],
            [
                6036,
                6051
            ],
            [
                6051,
                6084
            ],
            [
                6084,
                6092
            ],
            [
                6098,
                6112
            ],
            [
                6112,
                6121
            ],
            [
                6129,
                6153
            ],
            [
                6166,
                6176
            ],
            [
                6187,
                6191
            ],
            [
                6159,
                6162
            ],
            [
                6192,
                6220
            ],
            [
                6252,
                6255
            ],
            [
                6255,
                6293
            ],
            [
                6293,
                6310
            ],
            [
                6310,
                6313
            ],
            [
                6319,
                6339
            ],
            [
                6339,
                6378
            ],
            [
                6378,
                6403
            ],
            [
                6426,
                6428
            ],
            [
                6429,
                6432
            ],
            [
                6434,
                6448
            ],
            [
                6453,
                6471
            ],
            [
                6471,
                6528
            ],
            [
                6550,
                6553
            ],
            [
                6553,
                6565
            ],
            [
                6585,
                6595
            ],
            [
                6595,
                6621
            ],
            [
                6626,
                6627
            ],
            [
                6672,
                6695
            ],
            [
                6695,
                6724
            ],
            [
                6909,
                6916
            ],
            [
                6920,
                6951
            ],
            [
                6951,
                6957
            ],
            [
                7088,
                7099
            ],
            [
                7105,
                7133
            ],
            [
                7141,
                7148
            ],
            [
                7596,
                7618
            ],
            [
                7618,
                7660
            ],
            [
                7670,
                7750
            ],
            [
                7821,
                7850
            ],
            [
                7894,
                7902
            ],
            [
                7951,
                7959
            ],
            [
                7970,
                7986
            ],
            [
                7986,
                8040
            ],
            [
                8850,
                8900
            ],
            [
                8908,
                9010
            ],
            [
                9010,
                9094
            ],
            [
                9094,
                9095
            ],
            [
                9108,
                9143
            ],
            [
                9143,
                9190
            ],
            [
                9201,
                9203
            ],
            [
                9208,
                9319
            ],
            [
                9319,
                9360
            ],
            [
                9360,
                9362
            ],
            [
                9385,
                9388
            ],
            [
                9362,
                9373
            ],
            [
                9382,
                9384
            ],
            [
                9424,
                9426
            ],
            [
                9426,
                9443
            ],
            [
                9452,
                9454
            ],
            [
                9475,
                9478
            ],
            [
                9459,
                9471
            ],
            [
                9497,
                9499
            ],
            [
                9522,
                9606
            ],
            [
                9637,
                9652
            ],
            [
                9702,
                9736
            ],
            [
                9738,
                9752
            ],
            [
                9752,
                9753
            ],
            [
                9770,
                9775
            ],
            [
                9768,
                9769
            ],
            [
                9783,
                9789
            ],
            [
                9777,
                9782
            ],
            [
                9790,
                9799
            ],
            [
                9813,
                9819
            ],
            [
                9819,
                9821
            ],
            [
                9841,
                9890
            ],
            [
                9906,
                9908
            ],
            [
                9930,
                9960
            ],
            [
                9977,
                10012
            ],
            [
                10043,
                10073
            ],
            [
                10548,
                10556
            ],
            [
                10573,
                10579
            ],
            [
                10581,
                10586
            ],
            [
                10588,
                10605
            ],
            [
                10536,
                10539
            ],
            [
                10625,
                10629
            ],
            [
                10645,
                10647
            ],
            [
                10647,
                10707
            ],
            [
                10716,
                10779
            ],
            [
                10832,
                10833
            ],
            [
                10845,
                10894
            ],
            [
                10911,
                10934
            ],
            [
                10975,
                10976
            ],
            [
                10993,
                11029
            ],
            [
                11050,
                11052
            ],
            [
                11052,
                11066
            ],
            [
                11078,
                11173
            ],
            [
                11186,
                11190
            ],
            [
                11225,
                11249
            ],
            [
                11249,
                11317
            ],
            [
                11317,
                11321
            ],
            [
                11336,
                11340
            ],
            [
                11324,
                11332
            ],
            [
                11358,
                11393
            ],
            [
                11394,
                11442
            ],
            [
                11444,
                11492
            ],
            [
                11492,
                11516
            ],
            [
                11516,
                11517
            ],
            [
                11550,
                11624
            ],
            [
                11681,
                11682
            ],
            [
                11633,
                11636
            ],
            [
                11642,
                11661
            ],
            [
                11735,
                11737
            ],
            [
                11737,
                11742
            ],
            [
                11765,
                11771
            ],
            [
                11804,
                11836
            ],
            [
                11836,
                11912
            ],
            [
                11913,
                11914
            ],
            [
                11916,
                11956
            ],
            [
                11956,
                11998
            ],
            [
                12072,
                12074
            ],
            [
                12074,
                12098
            ],
            [
                12100,
                12114
            ],
            [
                12116,
                12159
            ],
            [
                12159,
                12171
            ],
            [
                12192,
                12253
            ],
            [
                12253,
                12320
            ],
            [
                12320,
                12367
            ],
            [
                12401,
                12436
            ],
            [
                12436,
                12463
            ],
            [
                12463,
                12536
            ],
            [
                12653,
                12654
            ],
            [
                12570,
                12621
            ],
            [
                12655,
                12658
            ],
            [
                12689,
                12707
            ],
            [
                12707,
                12737
            ],
            [
                12786,
                12789
            ],
            [
                12825,
                12839
            ],
            [
                12858,
                12860
            ],
            [
                12860,
                12912
            ],
            [
                12912,
                12942
            ],
            [
                12942,
                12959
            ],
            [
                12959,
                12962
            ],
            [
                12973,
                13023
            ],
            [
                13030,
                13032
            ],
            [
                13032,
                13065
            ],
            [
                13085,
                13181
            ],
            [
                13181,
                13274
            ],
            [
                13316,
                13354
            ],
            [
                13363,
                13365
            ],
            [
                13413,
                13448
            ],
            [
                13448,
                13483
            ],
            [
                13483,
                13537
            ],
            [
                13540,
                13583
            ],
            [
                13591,
                13638
            ],
            [
                13644,
                13650
            ],
            [
                13703,
                13711
            ],
            [
                13760,
                13769
            ],
            [
                13778,
                13794
            ],
            [
                13893,
                13895
            ],
            [
                13968,
                14013
            ],
            [
                14025,
                14037
            ],
            [
                14037,
                14038
            ],
            [
                14043,
                14047
            ],
            [
                14087,
                14130
            ],
            [
                14142,
                14156
            ],
            [
                14156,
                14164
            ],
            [
                14229,
                14237
            ],
            [
                14268,
                14274
            ],
            [
                14277,
                14278
            ],
            [
                14208,
                14209
            ],
            [
                14279,
                14299
            ],
            [
                14194,
                14195
            ],
            [
                14325,
                14340
            ],
            [
                14354,
                14356
            ],
            [
                14356,
                14359
            ],
            [
                14361,
                14364
            ],
            [
                14366,
                14373
            ],
            [
                14375,
                14376
            ],
            [
                14378,
                14381
            ],
            [
                14399,
                14418
            ],
            [
                14420,
                14464
            ],
            [
                14466,
                14469
            ],
            [
                14471,
                14474
            ],
            [
                14476,
                14508
            ],
            [
                14755,
                14780
            ],
            [
                14783,
                14829
            ],
            [
                14831,
                14834
            ],
            [
                14836,
                14841
            ],
            [
                14843,
                14845
            ],
            [
                14846,
                14863
            ],
            [
                14863,
                14887
            ],
            [
                14887,
                14913
            ],
            [
                14913,
                14947
            ],
            [
                14947,
                14967
            ],
            [
                15007,
                15033
            ],
            [
                15035,
                15036
            ],
            [
                15048,
                15067
            ],
            [
                15072,
                15105
            ],
            [
                15284,
                15366
            ],
            [
                15369,
                15378
            ],
            [
                15382,
                15421
            ],
            [
                15421,
                15521
            ],
            [
                15521,
                15537
            ],
            [
                15563,
                15584
            ],
            [
                15584,
                15628
            ],
            [
                15628,
                15674
            ],
            [
                15674,
                15693
            ],
            [
                15693,
                15711
            ],
            [
                15711,
                15791
            ],
            [
                15791,
                15822
            ],
            [
                15822,
                15836
            ],
            [
                15839,
                15844
            ],
            [
                15846,
                15854
            ],
            [
                15869,
                15887
            ],
            [
                15887,
                15889
            ],
            [
                15890,
                15895
            ],
            [
                15897,
                15903
            ],
            [
                15903,
                15914
            ],
            [
                15914,
                15961
            ],
            [
                15963,
                16000
            ],
            [
                16073,
                16077
            ],
            [
                16045,
                16067
            ],
            [
                16084,
                16089
            ],
            [
                16101,
                16109
            ],
            [
                16127,
                16130
            ],
            [
                16130,
                16140
            ],
            [
                16192,
                16227
            ],
            [
                16227,
                16229
            ],
            [
                16229,
                16238
            ],
            [
                16240,
                16244
            ],
            [
                16246,
                16253
            ],
            [
                16253,
                16275
            ],
            [
                16275,
                16316
            ],
            [
                16316,
                16393
            ],
            [
                16462,
                16579
            ],
            [
                16579,
                16580
            ],
            [
                16606,
                16619
            ],
            [
                16634,
                16678
            ],
            [
                16691,
                16707
            ],
            [
                16920,
                16923
            ],
            [
                16963,
                17026
            ],
            [
                17230,
                17233
            ],
            [
                17235,
                17258
            ],
            [
                17259,
                17262
            ],
            [
                17263,
                17327
            ],
            [
                17327,
                17332
            ],
            [
                17332,
                17345
            ],
            [
                17345,
                17350
            ],
            [
                17376,
                17397
            ],
            [
                17397,
                17468
            ],
            [
                17487,
                17491
            ],
            [
                17496,
                17523
            ],
            [
                17642,
                17646
            ],
            [
                17662,
                17664
            ],
            [
                17681,
                17770
            ],
            [
                17770,
                17782
            ],
            [
                17782,
                17792
            ],
            [
                17827,
                17828
            ],
            [
                17894,
                17897
            ],
            [
                17899,
                17900
            ],
            [
                17954,
                17956
            ],
            [
                17985,
                17996
            ],
            [
                17996,
                18011
            ],
            [
                18046,
                18055
            ],
            [
                18092,
                18095
            ],
            [
                18095,
                18111
            ],
            [
                18165,
                18196
            ],
            [
                18150,
                18156
            ],
            [
                18196,
                18198
            ],
            [
                18212,
                18215
            ],
            [
                18208,
                18211
            ],
            [
                18298,
                18305
            ],
            [
                18307,
                18375
            ],
            [
                18393,
                18419
            ],
            [
                18419,
                18501
            ],
            [
                18514,
                18517
            ],
            [
                18525,
                18550
            ],
            [
                18550,
                18613
            ],
            [
                18613,
                18624
            ],
            [
                18671,
                18685
            ],
            [
                18696,
                18698
            ],
            [
                18748,
                18750
            ],
            [
                18750,
                18782
            ],
            [
                18782,
                18847
            ],
            [
                18847,
                18848
            ],
            [
                18850,
                18853
            ],
            [
                18855,
                18881
            ],
            [
                18881,
                18972
            ],
            [
                18985,
                19044
            ],
            [
                19044,
                19082
            ],
            [
                19157,
                19158
            ],
            [
                19167,
                19202
            ],
            [
                19202,
                19223
            ],
            [
                19223,
                19229
            ],
            [
                19230,
                19257
            ],
            [
                19271,
                19286
            ],
            [
                19286,
                19307
            ],
            [
                19307,
                19319
            ],
            [
                19327,
                19330
            ],
            [
                19330,
                19346
            ],
            [
                19346,
                19367
            ],
            [
                19367,
                19477
            ],
            [
                19488,
                19537
            ],
            [
                19615,
                19641
            ],
            [
                19642,
                19656
            ],
            [
                19671,
                19673
            ],
            [
                19677,
                19686
            ],
            [
                19691,
                19704
            ],
            [
                19716,
                19761
            ],
            [
                19796,
                19798
            ],
            [
                19798,
                19812
            ],
            [
                19859,
                19908
            ],
            [
                19908,
                19954
            ],
            [
                19963,
                19978
            ],
            [
                19984,
                20009
            ],
            [
                20015,
                20025
            ],
            [
                20025,
                20032
            ],
            [
                20032,
                20086
            ],
            [
                20117,
                20119
            ],
            [
                20126,
                20127
            ],
            [
                20128,
                20158
            ],
            [
                20169,
                20196
            ],
            [
                20196,
                20237
            ],
            [
                20272,
                20275
            ],
            [
                20268,
                20271
            ],
            [
                20257,
                20263
            ],
            [
                20319,
                20321
            ],
            [
                20321,
                20363
            ],
            [
                20363,
                20372
            ],
            [
                20393,
                20398
            ],
            [
                20400,
                20402
            ],
            [
                20404,
                20411
            ],
            [
                20413,
                20437
            ],
            [
                20488,
                20522
            ],
            [
                20522,
                20571
            ],
            [
                20795,
                20820
            ],
            [
                20709,
                20712
            ],
            [
                20827,
                20833
            ],
            [
                20892,
                20894
            ],
            [
                20974,
                21003
            ],
            [
                21076,
                21114
            ],
            [
                21131,
                21134
            ],
            [
                21271,
                21275
            ],
            [
                21279,
                21284
            ],
            [
                21122,
                21125
            ],
            [
                21284,
                21286
            ],
            [
                21286,
                21304
            ],
            [
                21309,
                21311
            ],
            [
                21311,
                21338
            ],
            [
                21338,
                21382
            ],
            [
                21390,
                21391
            ],
            [
                21411,
                21430
            ],
            [
                21430,
                21463
            ],
            [
                21579,
                21665
            ],
            [
                21784,
                21813
            ],
            [
                21925,
                21928
            ],
            [
                21928,
                21961
            ],
            [
                22072,
                22155
            ],
            [
                22155,
                22246
            ],
            [
                22246,
                22333
            ],
            [
                22333,
                22347
            ],
            [
                22349,
                22352
            ],
            [
                22353,
                22388
            ],
            [
                22432,
                22437
            ],
            [
                22441,
                22460
            ],
            [
                22460,
                22466
            ],
            [
                22468,
                22471
            ],
            [
                22473,
                22521
            ],
            [
                22546,
                22548
            ],
            [
                22548,
                22588
            ],
            [
                22588,
                22647
            ],
            [
                22647,
                22672
            ],
            [
                22672,
                22673
            ],
            [
                22707,
                22743
            ],
            [
                22743,
                22761
            ],
            [
                22791,
                22815
            ],
            [
                22870,
                22927
            ],
            [
                23033,
                23037
            ],
            [
                23065,
                23066
            ],
            [
                23075,
                23078
            ],
            [
                23078,
                23109
            ],
            [
                23109,
                23121
            ],
            [
                23155,
                23202
            ],
            [
                23202,
                23235
            ],
            [
                23236,
                23250
            ],
            [
                23391,
                23437
            ],
            [
                23437,
                23477
            ],
            [
                23477,
                23522
            ],
            [
                23541,
                23546
            ],
            [
                23532,
                23533
            ],
            [
                23548,
                23558
            ],
            [
                23569,
                23592
            ],
            [
                23592,
                23595
            ],
            [
                23597,
                23606
            ],
            [
                23655,
                23716
            ],
            [
                23720,
                23733
            ],
            [
                23733,
                23743
            ],
            [
                23759,
                23761
            ],
            [
                23807,
                23892
            ],
            [
                23892,
                23947
            ],
            [
                24037,
                24085
            ],
            [
                24085,
                24243
            ],
            [
                24268,
                24329
            ],
            [
                24374,
                24402
            ],
            [
                24431,
                24434
            ],
            [
                24444,
                24450
            ],
            [
                24484,
                24487
            ],
            [
                24542,
                24567
            ],
            [
                24574,
                24582
            ],
            [
                24782,
                24787
            ],
            [
                24638,
                24645
            ],
            [
                24630,
                24637
            ],
            [
                24670,
                24681
            ],
            [
                24694,
                24719
            ],
            [
                25041,
                25044
            ],
            [
                24417,
                24419
            ],
            [
                24358,
                24361
            ],
            [
                24594,
                24596
            ],
            [
                24854,
                24856
            ],
            [
                24615,
                24618
            ],
            [
                24266,
                24267
            ],
            [
                25129,
                25132
            ],
            [
                24798,
                24819
            ],
            [
                24329,
                24334
            ],
            [
                24891,
                24931
            ],
            [
                24990,
                25001
            ],
            [
                25018,
                25022
            ],
            [
                24597,
                24605
            ],
            [
                25077,
                25105
            ],
            [
                25110,
                25125
            ],
            [
                25142,
                25318
            ],
            [
                24351,
                24354
            ],
            [
                25334,
                25374
            ],
            [
                25407,
                25433
            ],
            [
                25465,
                25469
            ],
            [
                25486,
                25549
            ],
            [
                25564,
                25570
            ],
            [
                24402,
                24403
            ],
            [
                25616,
                25625
            ],
            [
                24829,
                24837
            ],
            [
                25676,
                25699
            ],
            [
                24429,
                24430
            ],
            [
                25700,
                25740
            ],
            [
                25740,
                25765
            ],
            [
                25766,
                25808
            ],
            [
                25808,
                25833
            ],
            [
                25859,
                25865
            ],
            [
                25905,
                25906
            ],
            [
                26151,
                26229
            ],
            [
                26267,
                26293
            ],
            [
                26293,
                26302
            ],
            [
                26304,
                26322
            ],
            [
                26345,
                26355
            ],
            [
                26357,
                26366
            ],
            [
                26466,
                26479
            ],
            [
                26489,
                26494
            ],
            [
                26583,
                26654
            ],
            [
                26654,
                26771
            ],
            [
                26786,
                26803
            ],
            [
                26820,
                26862
            ],
            [
                26944,
                26999
            ],
            [
                27002,
                27041
            ],
            [
                27041,
                27076
            ],
            [
                27080,
                27140
            ],
            [
                27140,
                27150
            ],
            [
                27151,
                27196
            ],
            [
                27196,
                27202
            ],
            [
                27284,
                27303
            ],
            [
                27303,
                27313
            ],
            [
                27339,
                27391
            ],
            [
                27436,
                27442
            ],
            [
                27469,
                27476
            ],
            [
                27419,
                27421
            ],
            [
                27491,
                27498
            ],
            [
                27498,
                27560
            ],
            [
                27817,
                27878
            ],
            [
                27878,
                27918
            ],
            [
                27918,
                27939
            ],
            [
                27939,
                27986
            ],
            [
                27988,
                28035
            ],
            [
                28101,
                28153
            ],
            [
                28153,
                28178
            ],
            [
                28179,
                28267
            ],
            [
                28276,
                28302
            ],
            [
                28388,
                28465
            ],
            [
                28477,
                28490
            ],
            [
                28796,
                28813
            ],
            [
                28823,
                28847
            ],
            [
                28858,
                28879
            ],
            [
                28879,
                28888
            ],
            [
                28910,
                28941
            ],
            [
                28967,
                29030
            ],
            [
                29030,
                29067
            ],
            [
                29078,
                29088
            ],
            [
                29110,
                29111
            ],
            [
                29120,
                29149
            ],
            [
                29238,
                29283
            ],
            [
                29301,
                29321
            ],
            [
                29321,
                29391
            ],
            [
                29485,
                29487
            ],
            [
                29487,
                29528
            ],
            [
                29545,
                29564
            ],
            [
                29564,
                29648
            ],
            [
                29658,
                29702
            ],
            [
                29705,
                29716
            ],
            [
                29716,
                29752
            ],
            [
                29804,
                29830
            ],
            [
                29880,
                29881
            ],
            [
                29882,
                29888
            ],
            [
                29904,
                29905
            ],
            [
                29907,
                29939
            ],
            [
                29939,
                29977
            ],
            [
                30102,
                30104
            ],
            [
                30104,
                30151
            ],
            [
                30157,
                30203
            ],
            [
                30256,
                30260
            ],
            [
                30277,
                30283
            ],
            [
                30335,
                30337
            ],
            [
                30312,
                30313
            ],
            [
                30338,
                30347
            ],
            [
                30317,
                30324
            ],
            [
                30371,
                30410
            ],
            [
                30410,
                30445
            ],
            [
                30445,
                30500
            ],
            [
                30512,
                30651
            ],
            [
                30651,
                30684
            ],
            [
                30684,
                30708
            ],
            [
                30715,
                30743
            ],
            [
                30743,
                30749
            ],
            [
                30754,
                30815
            ]
        ],
        "row_chars": [
            [
                0,
                62
            ],
            [
                62,
                188
            ],
            [
                188,
                413
            ],
            [
                413,
                473
            ],
            [
                473,
                652
            ],
            [
                652,
                682
            ],
            [
                682,
                714
            ],
            [
                714,
                786
            ],
            [
                786,
                990
            ],
            [
                990,
                1051
            ],
            [
                1051,
                1157
            ],
            [
                1157,
                1280
            ],
            [
                1280,
                1424
            ],
            [
                1424,
                1490
            ],
            [
                1490,
                1711
            ],
            [
                1711,
                1730
            ],
            [
                1730,
                2164
            ],
            [
                2164,
                2321
            ],
            [
                2321,
                2439
            ],
            [
                2439,
                2583
            ],
            [
                2583,
                2744
            ],
            [
                2744,
                2829
            ],
            [
                2829,
                3106
            ],
            [
                3106,
                3247
            ],
            [
                3247,
                3360
            ],
            [
                3360,
                3650
            ],
            [
                3650,
                3770
            ],
            [
                3770,
                3864
            ],
            [
                3864,
                4041
            ],
            [
                4041,
                4111
            ],
            [
                4111,
                4197
            ],
            [
                4197,
                4254
            ],
            [
                4254,
                4399
            ],
            [
                4399,
                4615
            ],
            [
                4615,
                4799
            ],
            [
                4799,
                4852
            ],
            [
                4852,
                4868
            ],
            [
                4868,
                5045
            ],
            [
                5045,
                5066
            ],
            [
                5066,
                5125
            ],
            [
                5125,
                5322
            ],
            [
                5322,
                5380
            ],
            [
                5380,
                5422
            ],
            [
                5422,
                5611
            ],
            [
                5611,
                5703
            ],
            [
                5703,
                5761
            ],
            [
                5761,
                5800
            ],
            [
                5800,
                5856
            ],
            [
                5856,
                5886
            ],
            [
                5886,
                5937
            ],
            [
                5937,
                5981
            ],
            [
                5981,
                5987
            ],
            [
                5987,
                6004
            ],
            [
                6004,
                6036
            ],
            [
                6036,
                6051
            ],
            [
                6051,
                6084
            ],
            [
                6084,
                6112
            ],
            [
                6112,
                6255
            ],
            [
                6255,
                6293
            ],
            [
                6293,
                6310
            ],
            [
                6310,
                6339
            ],
            [
                6339,
                6378
            ],
            [
                6378,
                6428
            ],
            [
                6428,
                6471
            ],
            [
                6471,
                6553
            ],
            [
                6553,
                6595
            ],
            [
                6595,
                6695
            ],
            [
                6695,
                6726
            ],
            [
                6726,
                6739
            ],
            [
                6739,
                6785
            ],
            [
                6785,
                6844
            ],
            [
                6844,
                6909
            ],
            [
                6909,
                6951
            ],
            [
                6951,
                7148
            ],
            [
                7148,
                7153
            ],
            [
                7153,
                7176
            ],
            [
                7176,
                7196
            ],
            [
                7196,
                7269
            ],
            [
                7269,
                7284
            ],
            [
                7284,
                7296
            ],
            [
                7296,
                7346
            ],
            [
                7346,
                7372
            ],
            [
                7372,
                7402
            ],
            [
                7402,
                7422
            ],
            [
                7422,
                7463
            ],
            [
                7463,
                7517
            ],
            [
                7517,
                7545
            ],
            [
                7545,
                7564
            ],
            [
                7564,
                7596
            ],
            [
                7596,
                7618
            ],
            [
                7618,
                7750
            ],
            [
                7750,
                7796
            ],
            [
                7796,
                7821
            ],
            [
                7821,
                7904
            ],
            [
                7904,
                7951
            ],
            [
                7951,
                7986
            ],
            [
                7986,
                8068
            ],
            [
                8068,
                8081
            ],
            [
                8081,
                8115
            ],
            [
                8115,
                8144
            ],
            [
                8144,
                8151
            ],
            [
                8151,
                8180
            ],
            [
                8180,
                8252
            ],
            [
                8252,
                8268
            ],
            [
                8268,
                8294
            ],
            [
                8294,
                8387
            ],
            [
                8387,
                8407
            ],
            [
                8407,
                8445
            ],
            [
                8445,
                8529
            ],
            [
                8529,
                8549
            ],
            [
                8549,
                8561
            ],
            [
                8561,
                8636
            ],
            [
                8636,
                8650
            ],
            [
                8650,
                8670
            ],
            [
                8670,
                8752
            ],
            [
                8752,
                8790
            ],
            [
                8790,
                8815
            ],
            [
                8815,
                8850
            ],
            [
                8850,
                9010
            ],
            [
                9010,
                9094
            ],
            [
                9094,
                9143
            ],
            [
                9143,
                9319
            ],
            [
                9319,
                9362
            ],
            [
                9362,
                9426
            ],
            [
                9426,
                9499
            ],
            [
                9499,
                9652
            ],
            [
                9652,
                9702
            ],
            [
                9702,
                9752
            ],
            [
                9752,
                9821
            ],
            [
                9821,
                9841
            ],
            [
                9841,
                9908
            ],
            [
                9908,
                9930
            ],
            [
                9930,
                10012
            ],
            [
                10012,
                10043
            ],
            [
                10043,
                10073
            ],
            [
                10073,
                10247
            ],
            [
                10247,
                10324
            ],
            [
                10324,
                10647
            ],
            [
                10647,
                10788
            ],
            [
                10788,
                10832
            ],
            [
                10832,
                10894
            ],
            [
                10894,
                10936
            ],
            [
                10936,
                10958
            ],
            [
                10958,
                10975
            ],
            [
                10975,
                11052
            ],
            [
                11052,
                11190
            ],
            [
                11190,
                11249
            ],
            [
                11249,
                11317
            ],
            [
                11317,
                11492
            ],
            [
                11492,
                11518
            ],
            [
                11518,
                11550
            ],
            [
                11550,
                11737
            ],
            [
                11737,
                11836
            ],
            [
                11836,
                11912
            ],
            [
                11912,
                11956
            ],
            [
                11956,
                12074
            ],
            [
                12074,
                12159
            ],
            [
                12159,
                12253
            ],
            [
                12253,
                12320
            ],
            [
                12320,
                12436
            ],
            [
                12436,
                12463
            ],
            [
                12463,
                12707
            ],
            [
                12707,
                12860
            ],
            [
                12860,
                12912
            ],
            [
                12912,
                12942
            ],
            [
                12942,
                12959
            ],
            [
                12959,
                13032
            ],
            [
                13032,
                13181
            ],
            [
                13181,
                13274
            ],
            [
                13274,
                13312
            ],
            [
                13312,
                13365
            ],
            [
                13365,
                13412
            ],
            [
                13412,
                13448
            ],
            [
                13448,
                13483
            ],
            [
                13483,
                13540
            ],
            [
                13540,
                13650
            ],
            [
                13650,
                13703
            ],
            [
                13703,
                13895
            ],
            [
                13895,
                14037
            ],
            [
                14037,
                14156
            ],
            [
                14156,
                14324
            ],
            [
                14324,
                14356
            ],
            [
                14356,
                14510
            ],
            [
                14510,
                14560
            ],
            [
                14560,
                14647
            ],
            [
                14647,
                14670
            ],
            [
                14670,
                14737
            ],
            [
                14737,
                14781
            ],
            [
                14781,
                14863
            ],
            [
                14863,
                14887
            ],
            [
                14887,
                14913
            ],
            [
                14913,
                14947
            ],
            [
                14947,
                14967
            ],
            [
                14967,
                15002
            ],
            [
                15002,
                15108
            ],
            [
                15108,
                15145
            ],
            [
                15145,
                15219
            ],
            [
                15219,
                15284
            ],
            [
                15284,
                15421
            ],
            [
                15421,
                15521
            ],
            [
                15521,
                15584
            ],
            [
                15584,
                15628
            ],
            [
                15628,
                15674
            ],
            [
                15674,
                15693
            ],
            [
                15693,
                15711
            ],
            [
                15711,
                15791
            ],
            [
                15791,
                15822
            ],
            [
                15822,
                15887
            ],
            [
                15887,
                15903
            ],
            [
                15903,
                15914
            ],
            [
                15914,
                16000
            ],
            [
                16000,
                16130
            ],
            [
                16130,
                16229
            ],
            [
                16229,
                16253
            ],
            [
                16253,
                16275
            ],
            [
                16275,
                16316
            ],
            [
                16316,
                16393
            ],
            [
                16393,
                16462
            ],
            [
                16462,
                16579
            ],
            [
                16579,
                16620
            ],
            [
                16620,
                16634
            ],
            [
                16634,
                16708
            ],
            [
                16708,
                16800
            ],
            [
                16800,
                16909
            ],
            [
                16909,
                17126
            ],
            [
                17126,
                17167
            ],
            [
                17167,
                17230
            ],
            [
                17230,
                17327
            ],
            [
                17327,
                17332
            ],
            [
                17332,
                17345
            ],
            [
                17345,
                17397
            ],
            [
                17397,
                17523
            ],
            [
                17523,
                17592
            ],
            [
                17592,
                17664
            ],
            [
                17664,
                17770
            ],
            [
                17770,
                17782
            ],
            [
                17782,
                17792
            ],
            [
                17792,
                17826
            ],
            [
                17826,
                17901
            ],
            [
                17901,
                17954
            ],
            [
                17954,
                18095
            ],
            [
                18095,
                18111
            ],
            [
                18111,
                18198
            ],
            [
                18198,
                18306
            ],
            [
                18306,
                18419
            ],
            [
                18419,
                18550
            ],
            [
                18550,
                18613
            ],
            [
                18613,
                18698
            ],
            [
                18698,
                18750
            ],
            [
                18750,
                18782
            ],
            [
                18782,
                18847
            ],
            [
                18847,
                18881
            ],
            [
                18881,
                19044
            ],
            [
                19044,
                19084
            ],
            [
                19084,
                19157
            ],
            [
                19157,
                19202
            ],
            [
                19202,
                19223
            ],
            [
                19223,
                19286
            ],
            [
                19286,
                19307
            ],
            [
                19307,
                19330
            ],
            [
                19330,
                19346
            ],
            [
                19346,
                19367
            ],
            [
                19367,
                19477
            ],
            [
                19477,
                19537
            ],
            [
                19537,
                19572
            ],
            [
                19572,
                19615
            ],
            [
                19615,
                19673
            ],
            [
                19673,
                19798
            ],
            [
                19798,
                19908
            ],
            [
                19908,
                20025
            ],
            [
                20025,
                20032
            ],
            [
                20032,
                20119
            ],
            [
                20119,
                20196
            ],
            [
                20196,
                20321
            ],
            [
                20321,
                20363
            ],
            [
                20363,
                20437
            ],
            [
                20437,
                20522
            ],
            [
                20522,
                20894
            ],
            [
                20894,
                20974
            ],
            [
                20974,
                21286
            ],
            [
                21286,
                21311
            ],
            [
                21311,
                21338
            ],
            [
                21338,
                21430
            ],
            [
                21430,
                21463
            ],
            [
                21463,
                21579
            ],
            [
                21579,
                21665
            ],
            [
                21665,
                21784
            ],
            [
                21784,
                21928
            ],
            [
                21928,
                21961
            ],
            [
                21961,
                22155
            ],
            [
                22155,
                22246
            ],
            [
                22246,
                22333
            ],
            [
                22333,
                22388
            ],
            [
                22388,
                22460
            ],
            [
                22460,
                22548
            ],
            [
                22548,
                22588
            ],
            [
                22588,
                22647
            ],
            [
                22647,
                22672
            ],
            [
                22672,
                22743
            ],
            [
                22743,
                23078
            ],
            [
                23078,
                23109
            ],
            [
                23109,
                23155
            ],
            [
                23155,
                23202
            ],
            [
                23202,
                23250
            ],
            [
                23250,
                23296
            ],
            [
                23296,
                23391
            ],
            [
                23391,
                23437
            ],
            [
                23437,
                23477
            ],
            [
                23477,
                23592
            ],
            [
                23592,
                23655
            ],
            [
                23655,
                23733
            ],
            [
                23733,
                23761
            ],
            [
                23761,
                23807
            ],
            [
                23807,
                23892
            ],
            [
                23892,
                24085
            ],
            [
                24085,
                25740
            ],
            [
                25740,
                25808
            ],
            [
                25808,
                25907
            ],
            [
                25907,
                25984
            ],
            [
                25984,
                26041
            ],
            [
                26041,
                26151
            ],
            [
                26151,
                26293
            ],
            [
                26293,
                26302
            ],
            [
                26302,
                26366
            ],
            [
                26366,
                26466
            ],
            [
                26466,
                26654
            ],
            [
                26654,
                27041
            ],
            [
                27041,
                27076
            ],
            [
                27076,
                27140
            ],
            [
                27140,
                27196
            ],
            [
                27196,
                27303
            ],
            [
                27303,
                27498
            ],
            [
                27498,
                27560
            ],
            [
                27560,
                27663
            ],
            [
                27663,
                27878
            ],
            [
                27878,
                27918
            ],
            [
                27918,
                27939
            ],
            [
                27939,
                28035
            ],
            [
                28035,
                28101
            ],
            [
                28101,
                28153
            ],
            [
                28153,
                28302
            ],
            [
                28302,
                28328
            ],
            [
                28328,
                28388
            ],
            [
                28388,
                28490
            ],
            [
                28490,
                28614
            ],
            [
                28614,
                28796
            ],
            [
                28796,
                28879
            ],
            [
                28879,
                29030
            ],
            [
                29030,
                29321
            ],
            [
                29321,
                29487
            ],
            [
                29487,
                29564
            ],
            [
                29564,
                29716
            ],
            [
                29716,
                29882
            ],
            [
                29882,
                29939
            ],
            [
                29939,
                30104
            ],
            [
                30104,
                30283
            ],
            [
                30283,
                30410
            ],
            [
                30410,
                30445
            ],
            [
                30445,
                30651
            ],
            [
                30651,
                30684
            ],
            [
                30684,
                30743
            ],
            [
                30743,
                30815
            ]
        ]
    },
    "abridged": {
        "text": "Everybody said it was high time for Mr. Robert Moore to return home. The gossips agreed that it was not business that kept him away. He had finished that long ago. He had soon run down his four ringleaders; he had attended their trial, heard their conviction and sentence, and seen them safely shipped prior to transportation.\nThe newspapers had reported this. None hailed his success, though the mill-owners were glad of it, trusting that the terrors of the law would from now on paralyse the disaffected. Disaffection, however, was still heard muttering to himself in alehouses.\nOne report affirmed that Moore dared not come to Yorkshire; he knew his life was forfeit if he did.\n\"I'll tell him that,\" said Mr. Yorke, when his foreman mentioned the rumour; \"and if that does not bring him home full gallop, nothing will.\"\nEither that or some other motive at last recalled him. He wrote to Joe Scott naming the day he should arrive at Stilbro', and Joe Scott having informed Mr. Yorke, that gentleman went to meet him.\nIt was market-day. Moore arrived in time to take his usual place at the market dinner, where the assembled manufacturers received him with distinction, daring in private to do what they would not do in public - hailing him as their champion. Moore's unshaken nonchalance dampened their enthusiasm and held it in a low, smouldering state.\nMr. Yorke, the president of these dinners, witnessed his young friend's bearing complacently. He despised men who were fooled by flattery or popularity. Indifference appeased his rough spirit.\nRobert, leaning back in his chair, quiet and almost surly, while the clothiers and blanket-makers praised him, was a delectable sight for Mr. Yorke. Moore drooped his head, and shrank before the tradesmen's congratulations. He soon forsook the wine and took to the road. Mr. Yorke followed him, and they rode out of Stilbro' together.\nIt was late in the day. The sun's last ray had already faded from the cloud-edges, and the October night was casting her shadow over the moorlands.\nMr. Yorke, moderately exhilarated with drink, and pleased to have young Moore as a comrade, did much of the talking. He touched briefly on the trials and conviction; he passed thence to the gossip of the neighbourhood, and before long he attacked Moore on his personal concerns.\n\"Bob, I believe you are worsted, and you deserve it. Fortune offered you twenty thousand pounds; you only had to hold out your hand and take it. And what did you do? You called for a horse and rode to Warwickshire. Yet Fortune waited for you. You might still have had the prize.\n\"Then, instead of thundering home in a breakneck gallop and laying your laurels at her feet, you coolly went to London. What you have done there Satan knows; nothing, I believe, but sat and sulked.\"\n\"And who is to have this prize you talk so much about?\"\n\"Only a baronet; that is all. She will be Lady Nunnely before Christmas. Fool of a lad! I swear you might have had her.\"\n\"By what sign, Mr. Yorke?\"\n\"By every sign - by the light of her eyes; her cheeks grew red when your name was mentioned.\"\n\"My chance is quite over, I suppose?\"\n\"It ought to be. But it is worth trying. I call this Sir Philip milk and water. And then he writes verses. You are above that, at all events.\"\n\"Would you advise me to propose, late as it is, Mr. Yorke?\"\n\"You can but try, Robert. If she has a fancy for you, she will forgive much. But, my lad, you are laughing.\"\n\"I have quarrelled with myself, Yorke. I have battered my head by driving it against a wall.\"\n\"Why, what has gone wrong?\"\n\"The machinery of all my nature; the whole engine of this human mill; the boiler, which I take to be the heart, is fit to burst.\"\n\"Ye'll be jingling into poetry, Robert.\"\n\"Hideous, base blunder! You may commit in a moment what you will rue for years. Yorke, if I got off horseback and laid myself down in the road, would you have the goodness to gallop over me, backwards and forwards, about twenty times?\"\n\"Wi' all the pleasure in life, if there were no such thing as a coroner's inquest.\"\n\"I certainly believed she loved me. I have seen her eyes sparkle radiantly when she saw me in a crowd; she has flushed up crimson when she has offered me her hand, and said, 'How do you do, Mr. Moore?'\n\"My name had a magical influence over her,\" continued Moore. \"She blushed when others said it. She pronounced it in her most musical tone. She took an interest in me; she was anxious about me; she wished me well; she sought to benefit me. I could come to but one conclusion - this is love.\n\"Yorke, in her I saw youth and beauty; and power. Her wealth offered me the redemption of my honour. She had aided me substantially by a loan of five thousand pounds. Could I believe she loved me? Indeed I smiled at her navet and simplicity in showing her love. That whip of yours seems to have a good heavy handle, Yorke; swing it about your head and knock me out of the saddle, if you please.\"\n\"Patience, Robert, till the moon rises and I can see you. Did you love her or not?\"\n\"She is very pretty, in her own style. She has a look of a thing made out of fire and air, at which I stand and marvel, without a thought of clasping it. She attracted my interest and vanity. I never felt as if nature meant her to be my other and better self. When that question came to me, I flung it off, saying brutally that I should be rich with her and ruined without her - vowing I would be practical, and not romantic.\"\n\"A very sensible resolve,\" said Mr. Yorke.\n\"With this sensible resolve I walked up to Fieldhead one night last August, the eve of my departure. I had sent a note, and I found her at home, and alone.\n\"She received me without embarrassment, for she thought I came on business. I was embarrassed enough, but determined. I hardly know how I got the operation over. I sternly offered myself - my fine person - with my debts, of course, as a settlement.\n\"It vexed me to find that she neither blushed, trembled, nor looked down. She responded, 'I doubt whether I have understood you, Mr. Moore.'\n\"And I had to go over the whole proposal twice, before she would fully take it in. And then, what did she do? Instead of faltering a sweet Yes, or maintaining a soft, confused silence, she started up, walked twice fast through the room, and exclaimed, 'God bless me!'\n\"Yorke, I stood on the hearth, and I knew my doom. There was no misunderstanding her aspect and voice. She stopped and looked at me.\n\"'God bless me!' she repeated, in that shocked, indignant, yet saddened tone. 'You have made a strange proposal; and if you knew how strangely you worded it and looked it, you would be startled at yourself. You spoke like a brigand who demanded my purse rather than like a lover who asked my heart.'\n\"I knew, as she uttered it, it was true. I looked at her, dumb and wolfish. She at once enraged and shamed me.\n\"'Grard Moore, you know you don't love Shirley Keeldar,' she said. I might have broken out into false swearing - vowed that I did love her; but I could not lie in her face. Besides, she would not have believed me. She would never have mistaken my half-coarse, half-cold admiration for true manly love.\n\"Next, she sat down in the window-seat and cried passionately. Her eyes were haughty, pained; saying, you have outraged me. She added words.\n\"'I did respect - I did like you,' she said, 'Yes, as much as if you were my brother; and you - you want to make a speculation of me, for that mill!'\n\"And what do you think I said? 'Whatever my own feelings were, I was persuaded you loved me, Miss Keeldar.'\n\"Beautiful, was it not? She sat quite confounded. 'Is it Robert Moore that speaks?' I heard her mutter. 'Do you mean,' she asked aloud, 'you thought I loved as we love those we wish to marry? You insinuate that all the frank kindness I have shown you has been a complicated, bold, and immodest manuvre to ensnare a husband. You imply that at last you come here out of pity to offer me your hand, because I have courted you. Let me say this: you have seen wrong. Your mind is warped; you have judged wrong. Your tongue betrays you; you now speak wrong. I never loved you. Be at rest there. My heart is as pure of passion for you as yours is barren of affection for me.'\n\"I hope I was answered, Yorke?\n\"'I seem to be blind and besotted,' was my remark.\n\"'Loved you!' she cried. 'Why, I have been as frank with you as a sister - never shunned you, never feared you. Your presence cannot make me tremble, nor quicken my pulse.'\n\"I alleged that the sound of my name moved her; it made her blush.\n\"'Not for your sake!' she declared briefly. I urged explanation, but could get none.\n\"'When I sat beside you at the school feast, did you think I loved you then? When I called on you in the counting-house, when I walked with you on the pavement, did you think I loved you then?'\n\"I said I did. Yorke, she rose, she grew tall, she expanded almost to flame.\n\"'Then you say that I have acted as no woman can act without degrading herself. You were once high in my esteem, but are now hurled down; you, once intimate in my friendship, are cast out. Go!'\n\"I went not. I had seen her lip quiver. I knew another storm of tears would fall, and then I believed some calm must follow, and I would wait for it.\n\"This time she wept more softly. Her eyes lifted to me a gaze more reproachful than haughty, more mournful than incensed.\n\"'O Moore!' said she. I groaned.\n\"'I have done wrong,' I said, 'and I will go.'\n\"I took my hat. Yet I believed she would not let me depart. But she was silent. I was obliged to turn back of my own accord when I reached the door, and to say, 'Forgive me.'\n\"'I could, if there was not myself to forgive too,' was her reply; 'but to mislead an intelligent man I must have done wrong.'\n\"I broke out suddenly with some declamation I do not remember. I know that I sincerely wished to absolve her. She had done no wrong.\n\"At last she extended her hand. For the first time I wished to take her in my arms and kiss her. I did kiss her hand many times.\n\"'Some day we shall be friends again,' she said, 'when you have had time to read my actions in a true light, and not so horribly to misinterpret them. Time may give you the right key to all.'\n\"Drops rolled slow down her cheeks. She wiped them away.\n\"'I am deeply sorry for what has happened,' she sobbed. So was I, God knows! Thus were we parted.\"\n\"A queer tale!\" commented Mr. Yorke.\n\"I'll do it no more,\" vowed his companion; \"never more will I mention marriage to a woman unless I feel love. Credit and commerce may take care of themselves. I mean to work diligently, and wait patiently. If the worst comes, I will take an emigrant's berth, and go out with Louis to America. No woman shall ever again feel towards me as Miss Keeldar felt. In no woman's presence will I ever again stand such a fool and a knave, such a brute and a puppy.\"\n\"Tut!\" said the imperturbable Yorke, \"you make too much of it. Still, I am surprised that she did not love you; and that you did not love her. You are both young; you are both handsome, and have wit enough. What ailed you that you could not agree?\"\n\"We never could be at home with each other, Yorke. We jarred when we came very near. I have sat at one side of a room and observed her when she was most natural and lively. I have drawn a little nearer, have joined the circle round her seat, and been left alone with her. Were we happy thus? For myself, I must say No. Always a feeling of constraint came over me; I became stern and strange. We talked politics and business. If we had confidences, they were confidences of the counting-house, not of the heart. She never crept into my heart.\"\n\"Well, lad, it is a queer thing. I don't mind telling thee that thy talk brings back a glimpse of my own past life. Twenty-five years ago I tried to persuade a beautiful woman to love me, and she would not. I had not the key to her nature; she was a stone wall to me, doorless and windowless.\"\n\"But you loved her, Yorke; you worshipped Mary Cave. You were never a fortune-hunter.\"\n\"Ay, I did love her; but then she was beautiful as the moon. There is naught like her in these days. Miss Helstone, maybe, has a look of her, but nobody else.\"\n\"Who has a look of her?\"\n\"That quiet, delicate Miss Helstone. Many a time I have looked at the lassie in church, when she sits in shadow, and is very still and very pale, like a marble statue.\"\n\"Was Mary Cave in that style?\"\n\"Far grander! You wondered why she hadn't wings and a crown. She was a stately, peaceful angel, was my Mary.\"\n\"Mary Cave was not what you think her, Yorke. I have seen her picture at the rectory. She is no angel, but a fair, regular-featured woman - rather too lifeless for my taste. But supposing-\"\n\"Robert,\" interrupted Yorke, \"I could fell you off your horse this moment. However, I won't. I know well enough that the passion I still have is only the remnant of an illusion. If Miss Cave had possessed either feeling or sense, she would have preferred me to that copper-faced despot.\"\n\"Supposing, Yorke, she had been educated (no women were educated in those days); supposing she had possessed a thoughtful, original mind, a love of knowledge, which she took an artless delight in receiving from your lips; supposing her conversation was varied and graceful; supposing that when you were near her, you were at once comforted and contented; supposing that whenever you looked at her or thought of her, you ceased to be hard and calculating, and felt an unselfish longing to protect and cherish; supposing that when you took your Mary's little hand, you felt it tremble just as a warm little bird trembles when you take it from its nest; supposing you had noticed her shrink into the background on your entrance into a room, yet if you sought her out she welcomed you with the sweetest smile, and only turned her eyes away lest they should reveal too much; supposing, in short, your Mary had been modest, sensitive and pure - would you have left her, to court another woman for her wealth?\"\nMr. Yorke raised his hat, and wiped his forehead with his handkerchief.\n\"The moon is up,\" was his only remark.\n\"Yorke, if Mary had loved you silently yet faithfully, chastely yet fervently, would you have left her?\"\n\"Robert!\" He lifted his arm, and paused. \"Robert! I might swear thunderous oaths that, in the case you put, death only should have parted me from Mary. But I have lived in the world fifty-five years; I have been forced to study human nature; and, to speak a dark truth, if Mary had loved me, if I had been secure of her affection, the odds are\" (he let his hand fall heavy on the saddle) - \"the odds are I should have left her!\"\nThey rode side by side in silence. Before either spoke again they were on the other side of Rushedge. Briarfield's lights starred the purple skirt of the moor. Robert recommenced first.\n\"I believe that we can get nothing in this world worth keeping, except through struggle or peril. We err, we fall, we are humbled; then we walk more carefully. If the soul has strength, it conquers and rules thereafter.\"\n\"What art thou going to do now, Robert? What are thy plans?\"\n\"For my private plans, I'll keep them to myself - which is very easy, as at present I have none. As for my public plans, my views are a little altered. While I was in Birmingham and London I looked a little into reality, considered closely and at their source the causes of the troubles of this country. I went where there was want of food, of fuel, of clothing; where there was no work and no hope. I saw what taught me a new lesson, and filled me with fresh feelings. I have no more softness or sentiment than previously; mutiny and ambition I regard as I have always regarded them. I should resist a riotous mob just as before; I should hunt a ringleader as eagerly as ever; but I should do it now chiefly for the sake of those he misled. Something there is to look to, Yorke, beyond a man's personal interest. To respect himself, a man must believe he is just to his fellow-men. Unless I am more considerate to ignorance, more forbearing to suffering, than I have been, I shall scorn myself as grossly unjust. - What now?\" he said, addressing his horse, which had turned to a wayside trough. \"Yorke, ride on; I must let him drink.\"\nYorke accordingly rode slowly forwards. Stilbro' Moor was left behind; plantations rose shadowy on either hand; they were descending the hill; they were almost home.\nThis close to the village, Mr. Yorke was not startled to hear a voice speak behind the wall. The words, however, were peculiar.\n\"When the wicked perisheth there is shouting,\" it said; \"As the whirlwind passeth, so is the wicked no more\" (with a deeper growl): \"Terrors take hold of him as waters; hell is naked before him. He shall die without knowledge.\"\nA fierce flash and sharp gunshot violated the calm of night. Yorke, even before he turned, knew the four convicts of Birmingham were avenged.",
        "paragraph_chars": [
            [
                0,
                327
            ],
            [
                327,
                581
            ],
            [
                581,
                681
            ],
            [
                681,
                823
            ],
            [
                823,
                1019
            ],
            [
                1019,
                1357
            ],
            [
                1357,
                1550
            ],
            [
                1550,
                1885
            ],
            [
                1885,
                2033
            ],
            [
                2033,
                2312
            ],
            [
                2312,
                2591
            ],
            [
                2591,
                2790
            ],
            [
                2790,
                2846
            ],
            [
                2846,
                2967
            ],
            [
                2967,
                2994
            ],
            [
                2994,
                3088
            ],
            [
                3088,
                3126
            ],
            [
                3126,
                3269
            ],
            [
                3269,
                3329
            ],
            [
                3329,
                3438
            ],
            [
                3438,
                3532
            ],
            [
                3532,
                3560
            ],
            [
                3560,
                3690
            ],
            [
                3690,
                3731
            ],
            [
                3731,
                3967
            ],
            [
                3967,
                4051
            ],
            [
                4051,
                4253
            ],
            [
                4253,
                4543
            ],
            [
                4543,
                4939
            ],
            [
                4939,
                5023
            ],
            [
                5023,
                5450
            ],
            [
                5450,
                5493
            ],
            [
                5493,
                5649
            ],
            [
                5649,
                5898
            ],
            [
                5898,
                6039
            ],
            [
                6039,
                6307
            ],
            [
                6307,
                6440
            ],
            [
                6440,
                6740
            ],
            [
                6740,
                6851
            ],
            [
                6851,
                7153
            ],
            [
                7153,
                7294
            ],
            [
                7294,
                7444
            ],
            [
                7444,
                7552
            ],
            [
                7552,
                8221
            ],
            [
                8221,
                8252
            ],
            [
                8252,
                8303
            ],
            [
                8303,
                8476
            ],
            [
                8476,
                8543
            ],
            [
                8543,
                8628
            ],
            [
                8628,
                8822
            ],
            [
                8822,
                8899
            ],
            [
                8899,
                9093
            ],
            [
                9093,
                9243
            ],
            [
                9243,
                9365
            ],
            [
                9365,
                9398
            ],
            [
                9398,
                9445
            ],
            [
                9445,
                9620
            ],
            [
                9620,
                9747
            ],
            [
                9747,
                9880
            ],
            [
                9880,
                10009
            ],
            [
                10009,
                10201
            ],
            [
                10201,
                10258
            ],
            [
                10258,
                10357
            ],
            [
                10357,
                10394
            ],
            [
                10394,
                10850
            ],
            [
                10850,
                11099
            ],
            [
                11099,
                11642
            ],
            [
                11642,
                11936
            ],
            [
                11936,
                12023
            ],
            [
                12023,
                12183
            ],
            [
                12183,
                12208
            ],
            [
                12208,
                12377
            ],
            [
                12377,
                12408
            ],
            [
                12408,
                12518
            ],
            [
                12518,
                12708
            ],
            [
                12708,
                12996
            ],
            [
                12996,
                14000
            ],
            [
                14000,
                14072
            ],
            [
                14072,
                14111
            ],
            [
                14111,
                14216
            ],
            [
                14216,
                14645
            ],
            [
                14645,
                14831
            ],
            [
                14831,
                15052
            ],
            [
                15052,
                15113
            ],
            [
                15113,
                16249
            ],
            [
                16249,
                16415
            ],
            [
                16415,
                16543
            ],
            [
                16543,
                16771
            ],
            [
                16771,
                16912
            ]
        ],
        "segment_chars": [
            [
                0,
                69
            ],
            [
                69,
                133
            ],
            [
                133,
                164
            ],
            [
                164,
                327
            ],
            [
                327,
                361
            ],
            [
                361,
                507
            ],
            [
                507,
                581
            ],
            [
                581,
                681
            ],
            [
                681,
                823
            ],
            [
                823,
                878
            ],
            [
                878,
                1019
            ],
            [
                1019,
                1038
            ],
            [
                1038,
                1261
            ],
            [
                1261,
                1357
            ],
            [
                1357,
                1451
            ],
            [
                1451,
                1510
            ],
            [
                1510,
                1550
            ],
            [
                1550,
                1699
            ],
            [
                1699,
                1774
            ],
            [
                1774,
                1821
            ],
            [
                1821,
                1885
            ],
            [
                1885,
                1909
            ],
            [
                1909,
                2033
            ],
            [
                2033,
                2150
            ],
            [
                2150,
                2312
            ],
            [
                2312,
                2365
            ],
            [
                2365,
                2457
            ],
            [
                2457,
                2478
            ],
            [
                2478,
                2527
            ],
            [
                2527,
                2555
            ],
            [
                2555,
                2591
            ],
            [
                2591,
                2711
            ],
            [
                2711,
                2790
            ],
            [
                2790,
                2846
            ],
            [
                2846,
                2876
            ],
            [
                2876,
                2919
            ],
            [
                2919,
                2934
            ],
            [
                2934,
                2967
            ],
            [
                2967,
                2994
            ],
            [
                2994,
                3088
            ],
            [
                3088,
                3126
            ],
            [
                3126,
                3143
            ],
            [
                3143,
                3167
            ],
            [
                3167,
                3206
            ],
            [
                3206,
                3233
            ],
            [
                3233,
                3269
            ],
            [
                3269,
                3329
            ],
            [
                3329,
                3355
            ],
            [
                3355,
                3406
            ],
            [
                3406,
                3438
            ],
            [
                3438,
                3477
            ],
            [
                3477,
                3532
            ],
            [
                3532,
                3560
            ],
            [
                3560,
                3690
            ],
            [
                3690,
                3731
            ],
            [
                3731,
                3755
            ],
            [
                3755,
                3811
            ],
            [
                3811,
                3967
            ],
            [
                3967,
                4051
            ],
            [
                4051,
                4087
            ],
            [
                4087,
                4253
            ],
            [
                4253,
                4314
            ],
            [
                4314,
                4348
            ],
            [
                4348,
                4392
            ],
            [
                4392,
                4492
            ],
            [
                4492,
                4543
            ],
            [
                4543,
                4593
            ],
            [
                4593,
                4644
            ],
            [
                4644,
                4710
            ],
            [
                4710,
                4740
            ],
            [
                4740,
                4805
            ],
            [
                4805,
                4939
            ],
            [
                4939,
                4997
            ],
            [
                4997,
                5023
            ],
            [
                5023,
                5062
            ],
            [
                5062,
                5177
            ],
            [
                5177,
                5215
            ],
            [
                5215,
                5283
            ],
            [
                5283,
                5450
            ],
            [
                5450,
                5493
            ],
            [
                5493,
                5594
            ],
            [
                5594,
                5649
            ],
            [
                5649,
                5725
            ],
            [
                5725,
                5767
            ],
            [
                5767,
                5811
            ],
            [
                5811,
                5898
            ],
            [
                5898,
                5972
            ],
            [
                5972,
                6039
            ],
            [
                6039,
                6122
            ],
            [
                6122,
                6149
            ],
            [
                6149,
                6307
            ],
            [
                6307,
                6358
            ],
            [
                6358,
                6410
            ],
            [
                6410,
                6440
            ],
            [
                6440,
                6457
            ],
            [
                6457,
                6518
            ],
            [
                6518,
                6647
            ],
            [
                6647,
                6740
            ],
            [
                6740,
                6781
            ],
            [
                6781,
                6816
            ],
            [
                6816,
                6851
            ],
            [
                6851,
                6918
            ],
            [
                6918,
                7024
            ],
            [
                7024,
                7065
            ],
            [
                7065,
                7153
            ],
            [
                7153,
                7216
            ],
            [
                7216,
                7277
            ],
            [
                7277,
                7294
            ],
            [
                7294,
                7444
            ],
            [
                7444,
                7475
            ],
            [
                7475,
                7552
            ],
            [
                7552,
                7576
            ],
            [
                7576,
                7602
            ],
            [
                7602,
                7636
            ],
            [
                7636,
                7656
            ],
            [
                7656,
                7744
            ],
            [
                7744,
                7876
            ],
            [
                7876,
                7976
            ],
            [
                7976,
                8014
            ],
            [
                8014,
                8058
            ],
            [
                8058,
                8104
            ],
            [
                8104,
                8123
            ],
            [
                8123,
                8141
            ],
            [
                8141,
                8221
            ],
            [
                8221,
                8252
            ],
            [
                8252,
                8303
            ],
            [
                8303,
                8317
            ],
            [
                8317,
                8328
            ],
            [
                8328,
                8415
            ],
            [
                8415,
                8476
            ],
            [
                8476,
                8543
            ],
            [
                8543,
                8565
            ],
            [
                8565,
                8587
            ],
            [
                8587,
                8628
            ],
            [
                8628,
                8705
            ],
            [
                8705,
                8822
            ],
            [
                8822,
                8837
            ],
            [
                8837,
                8899
            ],
            [
                8899,
                8979
            ],
            [
                8979,
                9088
            ],
            [
                9088,
                9093
            ],
            [
                9093,
                9106
            ],
            [
                9106,
                9133
            ],
            [
                9133,
                9243
            ],
            [
                9243,
                9276
            ],
            [
                9276,
                9365
            ],
            [
                9365,
                9377
            ],
            [
                9377,
                9387
            ],
            [
                9387,
                9398
            ],
            [
                9398,
                9445
            ],
            [
                9445,
                9461
            ],
            [
                9461,
                9505
            ],
            [
                9505,
                9525
            ],
            [
                9525,
                9620
            ],
            [
                9620,
                9747
            ],
            [
                9747,
                9810
            ],
            [
                9810,
                9857
            ],
            [
                9857,
                9880
            ],
            [
                9880,
                9912
            ],
            [
                9912,
                9977
            ],
            [
                9977,
                10009
            ],
            [
                10009,
                10160
            ],
            [
                10160,
                10201
            ],
            [
                10201,
                10237
            ],
            [
                10237,
                10258
            ],
            [
                10258,
                10314
            ],
            [
                10314,
                10335
            ],
            [
                10335,
                10357
            ],
            [
                10357,
                10373
            ],
            [
                10373,
                10394
            ],
            [
                10394,
                10504
            ],
            [
                10504,
                10553
            ],
            [
                10553,
                10600
            ],
            [
                10600,
                10687
            ],
            [
                10687,
                10751
            ],
            [
                10751,
                10850
            ],
            [
                10850,
                10857
            ],
            [
                10857,
                10913
            ],
            [
                10913,
                10993
            ],
            [
                10993,
                11057
            ],
            [
                11057,
                11099
            ],
            [
                11099,
                11150
            ],
            [
                11150,
                11184
            ],
            [
                11184,
                11272
            ],
            [
                11272,
                11371
            ],
            [
                11371,
                11391
            ],
            [
                11391,
                11418
            ],
            [
                11418,
                11491
            ],
            [
                11491,
                11524
            ],
            [
                11524,
                11610
            ],
            [
                11610,
                11642
            ],
            [
                11642,
                11675
            ],
            [
                11675,
                11758
            ],
            [
                11758,
                11849
            ],
            [
                11849,
                11936
            ],
            [
                11936,
                11989
            ],
            [
                11989,
                12023
            ],
            [
                12023,
                12084
            ],
            [
                12084,
                12124
            ],
            [
                12124,
                12183
            ],
            [
                12183,
                12208
            ],
            [
                12208,
                12245
            ],
            [
                12245,
                12377
            ],
            [
                12377,
                12408
            ],
            [
                12408,
                12422
            ],
            [
                12422,
                12469
            ],
            [
                12469,
                12518
            ],
            [
                12518,
                12564
            ],
            [
                12564,
                12604
            ],
            [
                12604,
                12692
            ],
            [
                12692,
                12708
            ],
            [
                12708,
                12783
            ],
            [
                12783,
                12801
            ],
            [
                12801,
                12886
            ],
            [
                12886,
                12996
            ],
            [
                12996,
                14000
            ],
            [
                14000,
                14072
            ],
            [
                14072,
                14111
            ],
            [
                14111,
                14216
            ],
            [
                14216,
                14226
            ],
            [
                14226,
                14257
            ],
            [
                14257,
                14266
            ],
            [
                14266,
                14368
            ],
            [
                14368,
                14645
            ],
            [
                14645,
                14680
            ],
            [
                14680,
                14747
            ],
            [
                14747,
                14805
            ],
            [
                14805,
                14831
            ],
            [
                14831,
                14929
            ],
            [
                14929,
                14991
            ],
            [
                14991,
                15052
            ],
            [
                15052,
                15092
            ],
            [
                15092,
                15113
            ],
            [
                15113,
                15210
            ],
            [
                15210,
                15265
            ],
            [
                15265,
                15417
            ],
            [
                15417,
                15513
            ],
            [
                15513,
                15583
            ],
            [
                15583,
                15698
            ],
            [
                15698,
                15855
            ],
            [
                15855,
                15927
            ],
            [
                15927,
                15996
            ],
            [
                15996,
                16127
            ],
            [
                16127,
                16140
            ],
            [
                16140,
                16209
            ],
            [
                16209,
                16249
            ],
            [
                16249,
                16289
            ],
            [
                16289,
                16415
            ],
            [
                16415,
                16508
            ],
            [
                16508,
                16543
            ],
            [
                16543,
                16738
            ],
            [
                16738,
                16771
            ],
            [
                16771,
                16832
            ],
            [
                16832,
                16912
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                47,
                69
            ],
            [
                69,
                87
            ],
            [
                88,
                92
            ],
            [
                93,
                103
            ],
            [
                104,
                112
            ],
            [
                127,
                131
            ],
            [
                131,
                133
            ],
            [
                133,
                139
            ],
            [
                154,
                164
            ],
            [
                164,
                175
            ],
            [
                176,
                184
            ],
            [
                185,
                205
            ],
            [
                207,
                327
            ],
            [
                327,
                354
            ],
            [
                359,
                361
            ],
            [
                361,
                365
            ],
            [
                366,
                454
            ],
            [
                455,
                458
            ],
            [
                459,
                462
            ],
            [
                463,
                468
            ],
            [
                481,
                487
            ],
            [
                494,
                497
            ],
            [
                505,
                507
            ],
            [
                507,
                566
            ],
            [
                579,
                580
            ],
            [
                581,
                611
            ],
            [
                618,
                661
            ],
            [
                670,
                681
            ],
            [
                681,
                765
            ],
            [
                766,
                770
            ],
            [
                771,
                823
            ],
            [
                823,
                855
            ],
            [
                856,
                863
            ],
            [
                873,
                878
            ],
            [
                878,
                880
            ],
            [
                887,
                899
            ],
            [
                907,
                944
            ],
            [
                945,
                1000
            ],
            [
                1006,
                1019
            ],
            [
                1019,
                1038
            ],
            [
                1038,
                1104
            ],
            [
                1104,
                1105
            ],
            [
                1112,
                1157
            ],
            [
                1158,
                1169
            ],
            [
                1169,
                1170
            ],
            [
                1178,
                1188
            ],
            [
                1189,
                1191
            ],
            [
                1205,
                1210
            ],
            [
                1218,
                1227
            ],
            [
                1238,
                1244
            ],
            [
                1245,
                1261
            ],
            [
                1261,
                1289
            ],
            [
                1290,
                1294
            ],
            [
                1299,
                1304
            ],
            [
                1305,
                1315
            ],
            [
                1320,
                1332
            ],
            [
                1333,
                1357
            ],
            [
                1357,
                1371
            ],
            [
                1372,
                1436
            ],
            [
                1437,
                1444
            ],
            [
                1449,
                1451
            ],
            [
                1483,
                1497
            ],
            [
                1498,
                1510
            ],
            [
                1523,
                1550
            ],
            [
                1550,
                1647
            ],
            [
                1661,
                1699
            ],
            [
                1699,
                1704
            ],
            [
                1705,
                1721
            ],
            [
                1721,
                1733
            ],
            [
                1734,
                1740
            ],
            [
                1741,
                1744
            ],
            [
                1745,
                1756
            ],
            [
                1757,
                1773
            ],
            [
                1777,
                1798
            ],
            [
                1799,
                1807
            ],
            [
                1811,
                1821
            ],
            [
                1823,
                1843
            ],
            [
                1849,
                1885
            ],
            [
                1885,
                1909
            ],
            [
                1909,
                1916
            ],
            [
                1919,
                1927
            ],
            [
                1928,
                2001
            ],
            [
                2002,
                2005
            ],
            [
                2006,
                2012
            ],
            [
                2013,
                2031
            ],
            [
                2031,
                2033
            ],
            [
                2033,
                2071
            ],
            [
                2077,
                2082
            ],
            [
                2091,
                2098
            ],
            [
                2099,
                2110
            ],
            [
                2116,
                2123
            ],
            [
                2123,
                2124
            ],
            [
                2129,
                2133
            ],
            [
                2137,
                2140
            ],
            [
                2148,
                2150
            ],
            [
                2150,
                2168
            ],
            [
                2169,
                2186
            ],
            [
                2187,
                2255
            ],
            [
                2263,
                2292
            ],
            [
                2293,
                2312
            ],
            [
                2312,
                2365
            ],
            [
                2365,
                2372
            ],
            [
                2381,
                2384
            ],
            [
                2392,
                2408
            ],
            [
                2409,
                2412
            ],
            [
                2413,
                2417
            ],
            [
                2418,
                2421
            ],
            [
                2425,
                2429
            ],
            [
                2430,
                2433
            ],
            [
                2434,
                2443
            ],
            [
                2444,
                2457
            ],
            [
                2457,
                2478
            ],
            [
                2478,
                2509
            ],
            [
                2510,
                2527
            ],
            [
                2531,
                2538
            ],
            [
                2539,
                2545
            ],
            [
                2553,
                2555
            ],
            [
                2555,
                2579
            ],
            [
                2584,
                2591
            ],
            [
                2591,
                2592
            ],
            [
                2596,
                2662
            ],
            [
                2663,
                2694
            ],
            [
                2700,
                2711
            ],
            [
                2711,
                2756
            ],
            [
                2756,
                2787
            ],
            [
                2790,
                2846
            ],
            [
                2846,
                2876
            ],
            [
                2876,
                2917
            ],
            [
                2919,
                2934
            ],
            [
                2934,
                2967
            ],
            [
                2967,
                2975
            ],
            [
                2980,
                2994
            ],
            [
                2994,
                3003
            ],
            [
                3011,
                3035
            ],
            [
                3037,
                3047
            ],
            [
                3048,
                3052
            ],
            [
                3053,
                3056
            ],
            [
                3057,
                3085
            ],
            [
                3085,
                3088
            ],
            [
                3088,
                3126
            ],
            [
                3126,
                3143
            ],
            [
                3143,
                3146
            ],
            [
                3147,
                3167
            ],
            [
                3167,
                3206
            ],
            [
                3206,
                3231
            ],
            [
                3231,
                3233
            ],
            [
                3233,
                3236
            ],
            [
                3237,
                3251
            ],
            [
                3251,
                3269
            ],
            [
                3269,
                3326
            ],
            [
                3326,
                3329
            ],
            [
                3329,
                3341
            ],
            [
                3345,
                3355
            ],
            [
                3355,
                3381
            ],
            [
                3381,
                3382
            ],
            [
                3383,
                3406
            ],
            [
                3406,
                3435
            ],
            [
                3438,
                3445
            ],
            [
                3446,
                3477
            ],
            [
                3477,
                3483
            ],
            [
                3484,
                3495
            ],
            [
                3496,
                3524
            ],
            [
                3525,
                3532
            ],
            [
                3538,
                3560
            ],
            [
                3560,
                3602
            ],
            [
                3610,
                3690
            ],
            [
                3691,
                3720
            ],
            [
                3720,
                3728
            ],
            [
                3731,
                3739
            ],
            [
                3739,
                3755
            ],
            [
                3755,
                3809
            ],
            [
                3811,
                3861
            ],
            [
                3865,
                3967
            ],
            [
                3967,
                4051
            ],
            [
                4051,
                4052
            ],
            [
                4052,
                4087
            ],
            [
                4087,
                4134
            ],
            [
                4139,
                4141
            ],
            [
                4142,
                4253
            ],
            [
                4253,
                4294
            ],
            [
                4312,
                4314
            ],
            [
                4315,
                4318
            ],
            [
                4327,
                4338
            ],
            [
                4344,
                4346
            ],
            [
                4346,
                4348
            ],
            [
                4348,
                4365
            ],
            [
                4366,
                4368
            ],
            [
                4369,
                4372
            ],
            [
                4373,
                4385
            ],
            [
                4390,
                4392
            ],
            [
                4392,
                4476
            ],
            [
                4477,
                4492
            ],
            [
                4492,
                4526
            ],
            [
                4529,
                4543
            ],
            [
                4543,
                4544
            ],
            [
                4544,
                4549
            ],
            [
                4549,
                4550
            ],
            [
                4551,
                4557
            ],
            [
                4558,
                4563
            ],
            [
                4564,
                4573
            ],
            [
                4574,
                4580
            ],
            [
                4591,
                4593
            ],
            [
                4593,
                4642
            ],
            [
                4642,
                4644
            ],
            [
                4644,
                4674
            ],
            [
                4675,
                4710
            ],
            [
                4710,
                4740
            ],
            [
                4747,
                4755
            ],
            [
                4756,
                4762
            ],
            [
                4763,
                4768
            ],
            [
                4769,
                4786
            ],
            [
                4795,
                4798
            ],
            [
                4799,
                4803
            ],
            [
                4803,
                4805
            ],
            [
                4805,
                4865
            ],
            [
                4866,
                4929
            ],
            [
                4939,
                4940
            ],
            [
                4948,
                4997
            ],
            [
                4997,
                5020
            ],
            [
                5023,
                5024
            ],
            [
                5024,
                5060
            ],
            [
                5060,
                5062
            ],
            [
                5062,
                5076
            ],
            [
                5077,
                5172
            ],
            [
                5173,
                5177
            ],
            [
                5191,
                5215
            ],
            [
                5215,
                5283
            ],
            [
                5283,
                5287
            ],
            [
                5288,
                5292
            ],
            [
                5293,
                5301
            ],
            [
                5310,
                5345
            ],
            [
                5351,
                5399
            ],
            [
                5402,
                5450
            ],
            [
                5450,
                5474
            ],
            [
                5484,
                5485
            ],
            [
                5493,
                5567
            ],
            [
                5567,
                5568
            ],
            [
                5569,
                5572
            ],
            [
                5573,
                5592
            ],
            [
                5592,
                5594
            ],
            [
                5594,
                5599
            ],
            [
                5605,
                5611
            ],
            [
                5617,
                5649
            ],
            [
                5649,
                5725
            ],
            [
                5725,
                5726
            ],
            [
                5727,
                5767
            ],
            [
                5767,
                5809
            ],
            [
                5809,
                5811
            ],
            [
                5811,
                5835
            ],
            [
                5838,
                5852
            ],
            [
                5855,
                5898
            ],
            [
                5898,
                5910
            ],
            [
                5911,
                5972
            ],
            [
                5972,
                6039
            ],
            [
                6039,
                6086
            ],
            [
                6087,
                6122
            ],
            [
                6122,
                6149
            ],
            [
                6149,
                6222
            ],
            [
                6222,
                6223
            ],
            [
                6224,
                6275
            ],
            [
                6276,
                6279
            ],
            [
                6289,
                6307
            ],
            [
                6307,
                6337
            ],
            [
                6338,
                6341
            ],
            [
                6342,
                6356
            ],
            [
                6356,
                6358
            ],
            [
                6358,
                6410
            ],
            [
                6410,
                6440
            ],
            [
                6440,
                6457
            ],
            [
                6457,
                6460
            ],
            [
                6461,
                6511
            ],
            [
                6516,
                6518
            ],
            [
                6518,
                6551
            ],
            [
                6551,
                6647
            ],
            [
                6647,
                6740
            ],
            [
                6741,
                6779
            ],
            [
                6779,
                6781
            ],
            [
                6781,
                6816
            ],
            [
                6816,
                6851
            ],
            [
                6851,
                6905
            ],
            [
                6918,
                6961
            ],
            [
                6970,
                7017
            ],
            [
                7018,
                7024
            ],
            [
                7024,
                7032
            ],
            [
                7033,
                7042
            ],
            [
                7047,
                7063
            ],
            [
                7063,
                7065
            ],
            [
                7095,
                7140
            ],
            [
                7141,
                7153
            ],
            [
                7153,
                7154
            ],
            [
                7154,
                7158
            ],
            [
                7158,
                7201
            ],
            [
                7202,
                7216
            ],
            [
                7216,
                7224
            ],
            [
                7230,
                7238
            ],
            [
                7239,
                7245
            ],
            [
                7245,
                7246
            ],
            [
                7253,
                7254
            ],
            [
                7255,
                7275
            ],
            [
                7275,
                7276
            ],
            [
                7277,
                7292
            ],
            [
                7292,
                7294
            ],
            [
                7294,
                7297
            ],
            [
                7298,
                7301
            ],
            [
                7302,
                7309
            ],
            [
                7312,
                7313
            ],
            [
                7314,
                7317
            ],
            [
                7318,
                7337
            ],
            [
                7339,
                7383
            ],
            [
                7384,
                7387
            ],
            [
                7390,
                7393
            ],
            [
                7394,
                7426
            ],
            [
                7449,
                7474
            ],
            [
                7476,
                7522
            ],
            [
                7523,
                7526
            ],
            [
                7527,
                7532
            ],
            [
                7533,
                7535
            ],
            [
                7535,
                7552
            ],
            [
                7552,
                7576
            ],
            [
                7576,
                7602
            ],
            [
                7602,
                7636
            ],
            [
                7636,
                7656
            ],
            [
                7660,
                7686
            ],
            [
                7688,
                7689
            ],
            [
                7689,
                7708
            ],
            [
                7709,
                7742
            ],
            [
                7744,
                7826
            ],
            [
                7827,
                7836
            ],
            [
                7837,
                7876
            ],
            [
                7876,
                7976
            ],
            [
                7976,
                7992
            ],
            [
                7993,
                8014
            ],
            [
                8014,
                8058
            ],
            [
                8058,
                8104
            ],
            [
                8104,
                8123
            ],
            [
                8123,
                8141
            ],
            [
                8141,
                8221
            ],
            [
                8221,
                8252
            ],
            [
                8252,
                8266
            ],
            [
                8267,
                8272
            ],
            [
                8277,
                8285
            ],
            [
                8285,
                8303
            ],
            [
                8303,
                8305
            ],
            [
                8305,
                8310
            ],
            [
                8311,
                8317
            ],
            [
                8317,
                8328
            ],
            [
                8328,
                8375
            ],
            [
                8378,
                8415
            ],
            [
                8415,
                8419
            ],
            [
                8429,
                8451
            ],
            [
                8451,
                8456
            ],
            [
                8465,
                8473
            ],
            [
                8473,
                8476
            ],
            [
                8476,
                8486
            ],
            [
                8487,
                8522
            ],
            [
                8541,
                8543
            ],
            [
                8543,
                8552
            ],
            [
                8553,
                8557
            ],
            [
                8558,
                8565
            ],
            [
                8565,
                8587
            ],
            [
                8587,
                8628
            ],
            [
                8628,
                8705
            ],
            [
                8705,
                8822
            ],
            [
                8822,
                8823
            ],
            [
                8823,
                8836
            ],
            [
                8837,
                8881
            ],
            [
                8882,
                8898
            ],
            [
                8910,
                8913
            ],
            [
                8914,
                8977
            ],
            [
                8979,
                8982
            ],
            [
                8988,
                9011
            ],
            [
                9016,
                9019
            ],
            [
                9024,
                9088
            ],
            [
                9088,
                9093
            ],
            [
                9093,
                9106
            ],
            [
                9106,
                9111
            ],
            [
                9112,
                9133
            ],
            [
                9133,
                9204
            ],
            [
                9205,
                9209
            ],
            [
                9216,
                9243
            ],
            [
                9263,
                9267
            ],
            [
                9274,
                9276
            ],
            [
                9276,
                9365
            ],
            [
                9365,
                9377
            ],
            [
                9377,
                9387
            ],
            [
                9387,
                9388
            ],
            [
                9389,
                9392
            ],
            [
                9396,
                9397
            ],
            [
                9398,
                9400
            ],
            [
                9400,
                9411
            ],
            [
                9417,
                9432
            ],
            [
                9433,
                9442
            ],
            [
                9442,
                9445
            ],
            [
                9445,
                9461
            ],
            [
                9465,
                9496
            ],
            [
                9497,
                9503
            ],
            [
                9503,
                9505
            ],
            [
                9505,
                9508
            ],
            [
                9509,
                9512
            ],
            [
                9517,
                9524
            ],
            [
                9525,
                9593
            ],
            [
                9594,
                9620
            ],
            [
                9620,
                9702
            ],
            [
                9718,
                9721
            ],
            [
                9722,
                9747
            ],
            [
                9747,
                9810
            ],
            [
                9810,
                9821
            ],
            [
                9841,
                9855
            ],
            [
                9855,
                9857
            ],
            [
                9878,
                9880
            ],
            [
                9880,
                9912
            ],
            [
                9912,
                9977
            ],
            [
                9977,
                9978
            ],
            [
                9979,
                9982
            ],
            [
                9983,
                10009
            ],
            [
                10009,
                10100
            ],
            [
                10101,
                10160
            ],
            [
                10160,
                10198
            ],
            [
                10201,
                10202
            ],
            [
                10202,
                10237
            ],
            [
                10237,
                10258
            ],
            [
                10258,
                10264
            ],
            [
                10272,
                10299
            ],
            [
                10299,
                10314
            ],
            [
                10314,
                10335
            ],
            [
                10335,
                10347
            ],
            [
                10354,
                10357
            ],
            [
                10357,
                10373
            ],
            [
                10373,
                10394
            ],
            [
                10394,
                10504
            ],
            [
                10504,
                10553
            ],
            [
                10553,
                10579
            ],
            [
                10584,
                10598
            ],
            [
                10598,
                10600
            ],
            [
                10603,
                10612
            ],
            [
                10618,
                10631
            ],
            [
                10632,
                10677
            ],
            [
                10685,
                10687
            ],
            [
                10687,
                10701
            ],
            [
                10702,
                10751
            ],
            [
                10751,
                10797
            ],
            [
                10798,
                10813
            ],
            [
                10814,
                10839
            ],
            [
                10840,
                10850
            ],
            [
                10850,
                10857
            ],
            [
                10857,
                10911
            ],
            [
                10911,
                10913
            ],
            [
                10918,
                10919
            ],
            [
                10935,
                10965
            ],
            [
                10966,
                10993
            ],
            [
                10993,
                11034
            ],
            [
                11036,
                11039
            ],
            [
                11045,
                11048
            ],
            [
                11049,
                11055
            ],
            [
                11055,
                11057
            ],
            [
                11057,
                11099
            ],
            [
                11099,
                11108
            ],
            [
                11109,
                11114
            ],
            [
                11115,
                11117
            ],
            [
                11118,
                11125
            ],
            [
                11126,
                11150
            ],
            [
                11150,
                11184
            ],
            [
                11184,
                11233
            ],
            [
                11234,
                11259
            ],
            [
                11260,
                11263
            ],
            [
                11264,
                11270
            ],
            [
                11270,
                11272
            ],
            [
                11272,
                11301
            ],
            [
                11302,
                11340
            ],
            [
                11341,
                11344
            ],
            [
                11350,
                11354
            ],
            [
                11355,
                11360
            ],
            [
                11366,
                11369
            ],
            [
                11369,
                11371
            ],
            [
                11371,
                11389
            ],
            [
                11389,
                11391
            ],
            [
                11391,
                11418
            ],
            [
                11418,
                11462
            ],
            [
                11463,
                11464
            ],
            [
                11472,
                11491
            ],
            [
                11491,
                11524
            ],
            [
                11524,
                11610
            ],
            [
                11610,
                11639
            ],
            [
                11639,
                11642
            ],
            [
                11642,
                11675
            ],
            [
                11675,
                11758
            ],
            [
                11758,
                11849
            ],
            [
                11849,
                11936
            ],
            [
                11936,
                11950
            ],
            [
                11951,
                11954
            ],
            [
                11954,
                11989
            ],
            [
                11998,
                12003
            ],
            [
                12004,
                12023
            ],
            [
                12023,
                12029
            ],
            [
                12030,
                12033
            ],
            [
                12034,
                12082
            ],
            [
                12082,
                12084
            ],
            [
                12084,
                12124
            ],
            [
                12124,
                12183
            ],
            [
                12183,
                12208
            ],
            [
                12208,
                12209
            ],
            [
                12209,
                12245
            ],
            [
                12245,
                12263
            ],
            [
                12271,
                12295
            ],
            [
                12296,
                12353
            ],
            [
                12354,
                12358
            ],
            [
                12359,
                12360
            ],
            [
                12374,
                12377
            ],
            [
                12377,
                12408
            ],
            [
                12408,
                12420
            ],
            [
                12422,
                12469
            ],
            [
                12469,
                12502
            ],
            [
                12504,
                12518
            ],
            [
                12518,
                12564
            ],
            [
                12564,
                12604
            ],
            [
                12604,
                12649
            ],
            [
                12650,
                12655
            ],
            [
                12656,
                12657
            ],
            [
                12658,
                12668
            ],
            [
                12669,
                12692
            ],
            [
                12692,
                12695
            ],
            [
                12696,
                12705
            ],
            [
                12708,
                12769
            ],
            [
                12770,
                12783
            ],
            [
                12783,
                12793
            ],
            [
                12799,
                12801
            ],
            [
                12801,
                12886
            ],
            [
                12886,
                12941
            ],
            [
                12948,
                12996
            ],
            [
                12996,
                13154
            ],
            [
                13155,
                13216
            ],
            [
                13216,
                13244
            ],
            [
                13245,
                13248
            ],
            [
                13249,
                13255
            ],
            [
                13256,
                13259
            ],
            [
                13268,
                13293
            ],
            [
                13299,
                13307
            ],
            [
                13307,
                13312
            ],
            [
                13318,
                13325
            ],
            [
                13326,
                13333
            ],
            [
                13336,
                13347
            ],
            [
                13349,
                13374
            ],
            [
                13375,
                13378
            ],
            [
                13386,
                13388
            ],
            [
                13389,
                13392
            ],
            [
                13393,
                13395
            ],
            [
                13404,
                13406
            ],
            [
                13407,
                13410
            ],
            [
                13410,
                13411
            ],
            [
                13412,
                13415
            ],
            [
                13416,
                13437
            ],
            [
                13449,
                13454
            ],
            [
                13463,
                13503
            ],
            [
                13503,
                13514
            ],
            [
                13515,
                13519
            ],
            [
                13520,
                13528
            ],
            [
                13534,
                13562
            ],
            [
                13563,
                13578
            ],
            [
                13579,
                13755
            ],
            [
                13756,
                13759
            ],
            [
                13760,
                13800
            ],
            [
                13800,
                13826
            ],
            [
                13832,
                13836
            ],
            [
                13842,
                13905
            ],
            [
                13906,
                13912
            ],
            [
                13912,
                13913
            ],
            [
                13914,
                13923
            ],
            [
                13924,
                13932
            ],
            [
                13935,
                13958
            ],
            [
                13958,
                13959
            ],
            [
                13960,
                14000
            ],
            [
                14000,
                14025
            ],
            [
                14030,
                14072
            ],
            [
                14072,
                14097
            ],
            [
                14103,
                14109
            ],
            [
                14109,
                14110
            ],
            [
                14111,
                14189
            ],
            [
                14190,
                14216
            ],
            [
                14216,
                14225
            ],
            [
                14226,
                14244
            ],
            [
                14245,
                14255
            ],
            [
                14257,
                14266
            ],
            [
                14266,
                14279
            ],
            [
                14291,
                14296
            ],
            [
                14297,
                14368
            ],
            [
                14368,
                14485
            ],
            [
                14486,
                14503
            ],
            [
                14504,
                14546
            ],
            [
                14547,
                14602
            ],
            [
                14606,
                14645
            ],
            [
                14645,
                14680
            ],
            [
                14687,
                14747
            ],
            [
                14747,
                14757
            ],
            [
                14760,
                14805
            ],
            [
                14805,
                14811
            ],
            [
                14812,
                14831
            ],
            [
                14831,
                14841
            ],
            [
                14842,
                14894
            ],
            [
                14895,
                14901
            ],
            [
                14902,
                14909
            ],
            [
                14919,
                14921
            ],
            [
                14922,
                14929
            ],
            [
                14929,
                14991
            ],
            [
                14991,
                15052
            ],
            [
                15052,
                15092
            ],
            [
                15092,
                15113
            ],
            [
                15113,
                15160
            ],
            [
                15163,
                15210
            ],
            [
                15213,
                15265
            ],
            [
                15265,
                15290
            ],
            [
                15302,
                15390
            ],
            [
                15391,
                15417
            ],
            [
                15417,
                15494
            ],
            [
                15500,
                15513
            ],
            [
                15513,
                15530
            ],
            [
                15534,
                15558
            ],
            [
                15562,
                15583
            ],
            [
                15583,
                15592
            ],
            [
                15593,
                15624
            ],
            [
                15635,
                15698
            ],
            [
                15698,
                15735
            ],
            [
                15742,
                15752
            ],
            [
                15758,
                15759
            ],
            [
                15760,
                15789
            ],
            [
                15789,
                15834
            ],
            [
                15835,
                15855
            ],
            [
                15855,
                15925
            ],
            [
                15925,
                15927
            ],
            [
                15927,
                15968
            ],
            [
                15977,
                15996
            ],
            [
                15996,
                16080
            ],
            [
                16081,
                16125
            ],
            [
                16129,
                16140
            ],
            [
                16140,
                16176
            ],
            [
                16181,
                16207
            ],
            [
                16207,
                16208
            ],
            [
                16209,
                16215
            ],
            [
                16215,
                16216
            ],
            [
                16217,
                16249
            ],
            [
                16249,
                16287
            ],
            [
                16287,
                16289
            ],
            [
                16289,
                16336
            ],
            [
                16345,
                16391
            ],
            [
                16392,
                16396
            ],
            [
                16409,
                16415
            ],
            [
                16426,
                16428
            ],
            [
                16440,
                16441
            ],
            [
                16442,
                16451
            ],
            [
                16452,
                16459
            ],
            [
                16469,
                16508
            ],
            [
                16508,
                16543
            ],
            [
                16543,
                16598
            ],
            [
                16599,
                16738
            ],
            [
                16738,
                16771
            ],
            [
                16771,
                16795
            ],
            [
                16804,
                16832
            ],
            [
                16832,
                16838
            ],
            [
                16851,
                16912
            ]
        ],
        "row_chars": [
            [
                0,
                69
            ],
            [
                69,
                69
            ],
            [
                69,
                133
            ],
            [
                133,
                164
            ],
            [
                164,
                327
            ],
            [
                327,
                327
            ],
            [
                327,
                361
            ],
            [
                361,
                361
            ],
            [
                361,
                507
            ],
            [
                507,
                581
            ],
            [
                581,
                581
            ],
            [
                581,
                681
            ],
            [
                681,
                823
            ],
            [
                823,
                878
            ],
            [
                878,
                1019
            ],
            [
                1019,
                1038
            ],
            [
                1038,
                1261
            ],
            [
                1261,
                1357
            ],
            [
                1357,
                1451
            ],
            [
                1451,
                1510
            ],
            [
                1510,
                1510
            ],
            [
                1510,
                1550
            ],
            [
                1550,
                1699
            ],
            [
                1699,
                1699
            ],
            [
                1699,
                1699
            ],
            [
                1699,
                1774
            ],
            [
                1774,
                1774
            ],
            [
                1774,
                1774
            ],
            [
                1774,
                1774
            ],
            [
                1774,
                1821
            ],
            [
                1821,
                1885
            ],
            [
                1885,
                1909
            ],
            [
                1909,
                2033
            ],
            [
                2033,
                2150
            ],
            [
                2150,
                2312
            ],
            [
                2312,
                2365
            ],
            [
                2365,
                2365
            ],
            [
                2365,
                2457
            ],
            [
                2457,
                2478
            ],
            [
                2478,
                2527
            ],
            [
                2527,
                2555
            ],
            [
                2555,
                2555
            ],
            [
                2555,
                2591
            ],
            [
                2591,
                2711
            ],
            [
                2711,
                2790
            ],
            [
                2790,
                2790
            ],
            [
                2790,
                2790
            ],
            [
                2790,
                2846
            ],
            [
                2846,
                2876
            ],
            [
                2876,
                2876
            ],
            [
                2876,
                2919
            ],
            [
                2919,
                2919
            ],
            [
                2919,
                2919
            ],
            [
                2919,
                2919
            ],
            [
                2919,
                2934
            ],
            [
                2934,
                2967
            ],
            [
                2967,
                2994
            ],
            [
                2994,
                3088
            ],
            [
                3088,
                3126
            ],
            [
                3126,
                3143
            ],
            [
                3143,
                3167
            ],
            [
                3167,
                3206
            ],
            [
                3206,
                3233
            ],
            [
                3233,
                3269
            ],
            [
                3269,
                3329
            ],
            [
                3329,
                3355
            ],
            [
                3355,
                3406
            ],
            [
                3406,
                3438
            ],
            [
                3438,
                3438
            ],
            [
                3438,
                3438
            ],
            [
                3438,
                3438
            ],
            [
                3438,
                3438
            ],
            [
                3438,
                3477
            ],
            [
                3477,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3532
            ],
            [
                3532,
                3560
            ],
            [
                3560,
                3690
            ],
            [
                3690,
                3690
            ],
            [
                3690,
                3690
            ],
            [
                3690,
                3731
            ],
            [
                3731,
                3731
            ],
            [
                3731,
                3755
            ],
            [
                3755,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3811
            ],
            [
                3811,
                3967
            ],
            [
                3967,
                4051
            ],
            [
                4051,
                4087
            ],
            [
                4087,
                4253
            ],
            [
                4253,
                4314
            ],
            [
                4314,
                4348
            ],
            [
                4348,
                4392
            ],
            [
                4392,
                4492
            ],
            [
                4492,
                4492
            ],
            [
                4492,
                4543
            ],
            [
                4543,
                4593
            ],
            [
                4593,
                4593
            ],
            [
                4593,
                4644
            ],
            [
                4644,
                4644
            ],
            [
                4644,
                4710
            ],
            [
                4710,
                4710
            ],
            [
                4710,
                4740
            ],
            [
                4740,
                4740
            ],
            [
                4740,
                4740
            ],
            [
                4740,
                4805
            ],
            [
                4805,
                4939
            ],
            [
                4939,
                4939
            ],
            [
                4939,
                4997
            ],
            [
                4997,
                5023
            ],
            [
                5023,
                5023
            ],
            [
                5023,
                5023
            ],
            [
                5023,
                5062
            ],
            [
                5062,
                5177
            ],
            [
                5177,
                5215
            ],
            [
                5215,
                5283
            ],
            [
                5283,
                5450
            ],
            [
                5450,
                5493
            ],
            [
                5493,
                5493
            ],
            [
                5493,
                5594
            ],
            [
                5594,
                5649
            ],
            [
                5649,
                5725
            ],
            [
                5725,
                5767
            ],
            [
                5767,
                5811
            ],
            [
                5811,
                5898
            ],
            [
                5898,
                5972
            ],
            [
                5972,
                6039
            ],
            [
                6039,
                6122
            ],
            [
                6122,
                6149
            ],
            [
                6149,
                6307
            ],
            [
                6307,
                6358
            ],
            [
                6358,
                6410
            ],
            [
                6410,
                6440
            ],
            [
                6440,
                6457
            ],
            [
                6457,
                6518
            ],
            [
                6518,
                6647
            ],
            [
                6647,
                6740
            ],
            [
                6740,
                6740
            ],
            [
                6740,
                6781
            ],
            [
                6781,
                6781
            ],
            [
                6781,
                6816
            ],
            [
                6816,
                6851
            ],
            [
                6851,
                6918
            ],
            [
                6918,
                7024
            ],
            [
                7024,
                7024
            ],
            [
                7024,
                7065
            ],
            [
                7065,
                7153
            ],
            [
                7153,
                7216
            ],
            [
                7216,
                7277
            ],
            [
                7277,
                7294
            ],
            [
                7294,
                7444
            ],
            [
                7444,
                7444
            ],
            [
                7444,
                7444
            ],
            [
                7444,
                7444
            ],
            [
                7444,
                7444
            ],
            [
                7444,
                7475
            ],
            [
                7475,
                7552
            ],
            [
                7552,
                7576
            ],
            [
                7576,
                7602
            ],
            [
                7602,
                7636
            ],
            [
                7636,
                7656
            ],
            [
                7656,
                7656
            ],
            [
                7656,
                7744
            ],
            [
                7744,
                7744
            ],
            [
                7744,
                7744
            ],
            [
                7744,
                7744
            ],
            [
                7744,
                7876
            ],
            [
                7876,
                7976
            ],
            [
                7976,
                8014
            ],
            [
                8014,
                8058
            ],
            [
                8058,
                8104
            ],
            [
                8104,
                8123
            ],
            [
                8123,
                8141
            ],
            [
                8141,
                8221
            ],
            [
                8221,
                8252
            ],
            [
                8252,
                8303
            ],
            [
                8303,
                8317
            ],
            [
                8317,
                8328
            ],
            [
                8328,
                8415
            ],
            [
                8415,
                8476
            ],
            [
                8476,
                8543
            ],
            [
                8543,
                8565
            ],
            [
                8565,
                8587
            ],
            [
                8587,
                8628
            ],
            [
                8628,
                8705
            ],
            [
                8705,
                8705
            ],
            [
                8705,
                8822
            ],
            [
                8822,
                8837
            ],
            [
                8837,
                8837
            ],
            [
                8837,
                8899
            ],
            [
                8899,
                8899
            ],
            [
                8899,
                8899
            ],
            [
                8899,
                8979
            ],
            [
                8979,
                8979
            ],
            [
                8979,
                8979
            ],
            [
                8979,
                9088
            ],
            [
                9088,
                9093
            ],
            [
                9093,
                9106
            ],
            [
                9106,
                9133
            ],
            [
                9133,
                9243
            ],
            [
                9243,
                9243
            ],
            [
                9243,
                9276
            ],
            [
                9276,
                9365
            ],
            [
                9365,
                9377
            ],
            [
                9377,
                9387
            ],
            [
                9387,
                9387
            ],
            [
                9387,
                9398
            ],
            [
                9398,
                9398
            ],
            [
                9398,
                9445
            ],
            [
                9445,
                9461
            ],
            [
                9461,
                9505
            ],
            [
                9505,
                9525
            ],
            [
                9525,
                9620
            ],
            [
                9620,
                9747
            ],
            [
                9747,
                9810
            ],
            [
                9810,
                9857
            ],
            [
                9857,
                9880
            ],
            [
                9880,
                9912
            ],
            [
                9912,
                9977
            ],
            [
                9977,
                10009
            ],
            [
                10009,
                10160
            ],
            [
                10160,
                10201
            ],
            [
                10201,
                10201
            ],
            [
                10201,
                10237
            ],
            [
                10237,
                10258
            ],
            [
                10258,
                10314
            ],
            [
                10314,
                10335
            ],
            [
                10335,
                10357
            ],
            [
                10357,
                10373
            ],
            [
                10373,
                10394
            ],
            [
                10394,
                10504
            ],
            [
                10504,
                10553
            ],
            [
                10553,
                10553
            ],
            [
                10553,
                10553
            ],
            [
                10553,
                10600
            ],
            [
                10600,
                10687
            ],
            [
                10687,
                10751
            ],
            [
                10751,
                10850
            ],
            [
                10850,
                10857
            ],
            [
                10857,
                10913
            ],
            [
                10913,
                10993
            ],
            [
                10993,
                11057
            ],
            [
                11057,
                11099
            ],
            [
                11099,
                11150
            ],
            [
                11150,
                11184
            ],
            [
                11184,
                11272
            ],
            [
                11272,
                11272
            ],
            [
                11272,
                11371
            ],
            [
                11371,
                11391
            ],
            [
                11391,
                11418
            ],
            [
                11418,
                11491
            ],
            [
                11491,
                11524
            ],
            [
                11524,
                11524
            ],
            [
                11524,
                11610
            ],
            [
                11610,
                11610
            ],
            [
                11610,
                11642
            ],
            [
                11642,
                11675
            ],
            [
                11675,
                11758
            ],
            [
                11758,
                11849
            ],
            [
                11849,
                11936
            ],
            [
                11936,
                11989
            ],
            [
                11989,
                12023
            ],
            [
                12023,
                12084
            ],
            [
                12084,
                12124
            ],
            [
                12124,
                12183
            ],
            [
                12183,
                12208
            ],
            [
                12208,
                12245
            ],
            [
                12245,
                12377
            ],
            [
                12377,
                12408
            ],
            [
                12408,
                12422
            ],
            [
                12422,
                12469
            ],
            [
                12469,
                12518
            ],
            [
                12518,
                12518
            ],
            [
                12518,
                12518
            ],
            [
                12518,
                12564
            ],
            [
                12564,
                12604
            ],
            [
                12604,
                12692
            ],
            [
                12692,
                12708
            ],
            [
                12708,
                12783
            ],
            [
                12783,
                12801
            ],
            [
                12801,
                12801
            ],
            [
                12801,
                12886
            ],
            [
                12886,
                12996
            ],
            [
                12996,
                14000
            ],
            [
                14000,
                14072
            ],
            [
                14072,
                14111
            ],
            [
                14111,
                14111
            ],
            [
                14111,
                14111
            ],
            [
                14111,
                14111
            ],
            [
                14111,
                14216
            ],
            [
                14216,
                14226
            ],
            [
                14226,
                14266
            ],
            [
                14266,
                14266
            ],
            [
                14266,
                14368
            ],
            [
                14368,
                14645
            ],
            [
                14645,
                14680
            ],
            [
                14680,
                14747
            ],
            [
                14747,
                14805
            ],
            [
                14805,
                14831
            ],
            [
                14831,
                14929
            ],
            [
                14929,
                14991
            ],
            [
                14991,
                14991
            ],
            [
                14991,
                15052
            ],
            [
                15052,
                15092
            ],
            [
                15092,
                15113
            ],
            [
                15113,
                15210
            ],
            [
                15210,
                15210
            ],
            [
                15210,
                15265
            ],
            [
                15265,
                15417
            ],
            [
                15417,
                15417
            ],
            [
                15417,
                15417
            ],
            [
                15417,
                15513
            ],
            [
                15513,
                15513
            ],
            [
                15513,
                15513
            ],
            [
                15513,
                15583
            ],
            [
                15583,
                15698
            ],
            [
                15698,
                15855
            ],
            [
                15855,
                15927
            ],
            [
                15927,
                15996
            ],
            [
                15996,
                16140
            ],
            [
                16140,
                16209
            ],
            [
                16209,
                16249
            ],
            [
                16249,
                16289
            ],
            [
                16289,
                16415
            ],
            [
                16415,
                16508
            ],
            [
                16508,
                16543
            ],
            [
                16543,
                16738
            ],
            [
                16738,
                16771
            ],
            [
                16771,
                16832
            ],
            [
                16832,
                16912
            ]
        ]
    }
}