{
    "original": {
        "text": "Martin, having known the taste of excitement, wanted a second draught; having felt the dignity of power, he loathed to relinquish it. Miss Helstone--that girl he had always called ugly, and whose face was now perpetually before his eyes, by day and by night, in dark and in sunshine--had once come within his sphere. It fretted him to think the visit might never be repeated.\nThough a schoolboy he was no ordinary schoolboy; he was destined to grow up an original. At a few years' later date he took great pains to pare and polish himself down to the pattern of the rest of the world, but he never succeeded; an unique stamp marked him always. He now sat idle at his desk in the grammar school, casting about in his mind for the means of adding another chapter to his commenced romance. He did not yet know how many commenced life-romances are doomed never to get beyond the first, or at most the second chapter. His Saturday half-holiday he spent in the wood with his book of fairy legends, and that other unwritten book of his imagination.\nMartin harboured an irreligious reluctance to see the approach of Sunday. His father and mother, while disclaiming community with the Establishment, failed not duly, once on the sacred day, to fill their large pew in Briarfield Church with the whole of their blooming family. Theoretically, Mr. Yorke placed all sects and churches on a level. Mrs. Yorke awarded the palm to Moravians and Quakers, on account of that crown of humility by these worthies worn. Neither of them were ever known, however, to set foot in a conventicle.\nMartin, I say, disliked Sunday, because the morning service was long, and the sermon usually little to his taste. This Saturday afternoon, however, his woodland musings disclosed to him a new-found charm in the coming day.\nIt proved a day of deep snow--so deep that Mrs. Yorke during breakfast announced her conviction that the children, both boys and girls, would be better at home; and her decision that, instead of going to church, they should sit silent for two hours in the back parlour, while Rose and Martin alternately read a succession of sermons--John Wesley's \"Sermons.\" John Wesley, being a reformer and an agitator, had a place both in her own and her husband's favour.\n\"Rose will do as she pleases,\" said Martin, not looking up from the book which, according to his custom then and in after-life, he was studying over his bread and milk.\n\"Rose will do as she is told, and Martin too,\" observed the mother.\n\"I am going to church.\"\nSo her son replied, with the ineffable quietude of a true Yorke, who knows his will and means to have it, and who, if pushed to the wall, will let himself be crushed to death, provided no way of escape can be found, but will never capitulate.\n\"It is not fit weather,\" said the father.\nNo answer. The youth read studiously; he slowly broke his bread and sipped his milk.\n\"Martin hates to go to church, but he hates still more to obey,\" said Mrs. Yorke.\n\"I suppose I am influenced by pure perverseness?\"\n\"Yes, you are.\"\n\"Mother, _I am not_.\"\n\"By what, then, are you influenced?\"\n\"By a complication of motives, the intricacies of which I should as soon think of explaining to you as I should of turning myself inside out to exhibit the internal machinery of my frame.\"\n\"Hear Martin! hear him!\" cried Mr. Yorke. \"I must see and have this lad of mine brought up to the bar. Nature meant him to live by his tongue. Hesther, your third son must certainly be a lawyer; he has the stock-in-trade--brass, self-conceit, and words--words--words.\"\n\"Some bread, Rose, if you please,\" requested Martin, with intense gravity, serenity, phlegm. The boy had naturally a low, plaintive voice, which in his \"dour moods\" rose scarcely above a lady's whisper. The more inflexibly stubborn the humour, the softer, the sadder the tone. He rang the bell, and gently asked for his walking-shoes.\n\"But, Martin,\" urged his sire, \"there is drift all the way; a man could hardly wade through it. However, lad,\" he continued, seeing that the boy rose as the church bell began to toll, \"this is a case wherein I would by no means balk the obdurate chap of his will. Go to church by all means. There is a pitiless wind, and a sharp, frozen sleet, besides the depth under foot. Go out into it, since thou prefers it to a warm fireside.\"\nMartin quietly assumed his cloak, comforter, and cap, and deliberately went out.\n\"My father has more sense than my mother,\" he pronounced. \"How women miss it! They drive the nail into the flesh, thinking they are hammering away at insensate stone.\"\nHe reached church early.\n\"Now, if the weather frightens her (and it is a real December tempest), or if that Mrs. Pryor objects to her going out, and I should miss her after all, it will vex me; but, tempest or tornado, hail or ice, she _ought_ to come, and if she has a mind worthy of her eyes and features she _will_ come. She will be here for the chance of seeing me, as I am here for the chance of seeing her. She will want to get a word respecting her confounded sweetheart, as I want to get another flavour of what I think the essence of life--a taste of existence, with the spirit preserved in it, and not evaporated. Adventure is to stagnation what champagne is to flat porter.\"\nHe looked round. The church was cold, silent, empty, but for one old woman. As the chimes subsided and the single bell tolled slowly, another and another elderly parishioner came dropping in, and took a humble station in the free sittings. It is always the frailest, the oldest, and the poorest that brave the worst weather, to prove and maintain their constancy to dear old mother church. This wild morning not one affluent family attended, not one carriage party appeared--all the lined and cushioned pews were empty; only on the bare oaken seats sat ranged the gray-haired elders and feeble paupers.\n\"I'll scorn her if she doesn't come,\" muttered Martin, shortly and savagely, to himself. The rector's shovel-hat had passed the porch. Mr. Helstone and his clerk were in the vestry.\nThe bells ceased--the reading-desk was filled--the doors were closed--the service commenced. Void stood the rectory pew--she was not there. Martin scorned her.\n\"Worthless thing! vapid thing! commonplace humbug! Like all other girls--weakly, selfish, shallow!\"\nSuch was Martin's liturgy.\n\"She is not like our picture. Her eyes are not large and expressive; her nose is not straight, delicate, Hellenic; her mouth has not that charm I thought it had, which I imagined could beguile me of sullenness in my worst moods. What is she? A thread-paper, a doll, a toy, a _girl_, in short.\"\nSo absorbed was the young cynic he forgot to rise from his knees at the proper place, and was still in an exemplary attitude of devotion when, the litany over, the first hymn was given out. To be so caught did not contribute to soothe him. He started up red (for he was as sensitive to ridicule as any girl). To make the matter worse, the church door had reopened, and the aisles were filling: patter, patter, patter, a hundred little feet trotted in. It was the Sunday scholars. According to Briarfield winter custom, these children had till now been kept where there was a warm stove, and only led into church just before the communion and sermon.\nThe little ones were settled first, and at last, when the boys and the younger girls were all arranged--when the organ was swelling high, and the choir and congregation were rising to uplift a spiritual song--a tall class of young women came quietly in, closing the procession. Their teacher, having seen them seated, passed into the rectory pew. The French-gray cloak and small beaver bonnet were known to Martin; it was the very costume his eyes had ached to catch. Miss Helstone had not suffered the storm to prove an impediment. After all, she was come to church. Martin probably whispered his satisfaction to his hymn book; at any rate, he therewith hid his face two minutes.\nSatisfied or not, he had time to get very angry with her again before the sermon was over. She had never once looked his way; at least he had not been so lucky as to encounter a glance.\n\"If,\" he said--\"if she takes no notice of me, if she shows I am not in her thoughts, I shall have a worse, a meaner opinion of her than ever. Most despicable would it be to come for the sake of those sheep-faced Sunday scholars, and not for my sake or that long skeleton Moore's.\"\nThe sermon found an end; the benediction was pronounced; the congregation dispersed. She had not been near him.\nNow, indeed, as Martin set his face homeward, he felt that the sleet was sharp and the east wind cold.\nHis nearest way lay through some fields. It was a dangerous, because an untrodden way. He did not care; he would take it. Near the second stile rose a clump of trees. Was that an umbrella waiting there? Yes, an umbrella, held with evident difficulty against the blast; behind it fluttered a French-gray cloak. Martin grinned as he toiled up the steep, encumbered field, difficult to the foot as a slope in the upper realms of Etna. There was an inimitable look in his face when, having gained the stile, he seated himself coolly thereupon, and thus opened a conference which, for his own part, he was willing to prolong indefinitely.\n\"I think you had better strike a bargain. Exchange me for Mrs. Pryor.\"\n\"I was not sure whether you would come this way, Martin, but I thought I would run the chance. There is no such thing as getting a quiet word spoken in the church or churchyard.\"\n\"Will you agree?--make over Mrs. Pryor to my mother, and put me in her skirts?\"\n\"As if I could understand you! What puts Mrs. Pryor into your head?\"\n\"You call her 'mamma,' don't you?\"\n\"She _is_ my mamma.\"\n\"Not possible--or so inefficient, so careless a mamma; I should make a five times better one. You _may_ laugh. I have no objection to see you laugh. Your teeth--I hate ugly teeth; but yours are as pretty as a pearl necklace, and a necklace of which the pearls are very fair, even, and well matched too.\"\n\"Martin, what now? I thought the Yorkes never paid compliments?\"\n\"They have not done till this generation; but I feel as if it were my vocation to turn out a new variety of the Yorke species. I am rather tired of my own ancestors. We have traditions going back for four ages--tales of Hiram, which was the son of Hiram, which was the son of Samuel, which was the son of John, which was the son of Zerubbabel Yorke. All, from Zerubbabel down to the last Hiram, were such as you see my father. Before that there was a Godfrey. We have his picture; it hangs in Moore's bedroom; it is like me. Of his character we know nothing; but I am sure it was different to his descendants. He has long, curling dark hair; he is carefully and cavalierly dressed. Having said that he is like me, I need not add that he is handsome.\"\n\"You are not handsome, Martin.\"\n\"No; but wait awhile--just let me take my time. I mean to begin from this day to cultivate, to polish, and we shall see.\"\n\"You are a very strange, a very unaccountable boy, Martin. But don't imagine you ever will be handsome; you cannot.\"\n\"I mean to try. But we were talking about Mrs. Pryor. She must be the most unnatural mamma in existence, coolly to let her daughter come out in this weather. Mine was in such a rage because I would go to church; she was fit to fling the kitchen brush after me.\"\n\"Mamma was very much concerned about me; but I am afraid I was obstinate. I _would_ go.\"\n\"To see me?\"\n\"Exactly; I thought of nothing else. I greatly feared the snow would hinder you from coming. You don't know how pleased I was to see you all by yourself in the pew.\"\n\"_I_ came to fulfil my duty, and set the parish a good example. And so you were obstinate, were you? I should like to see you obstinate, I should. Wouldn't I have you in good discipline if I owned you? Let me take the umbrella.\"\n\"I can't stay two minutes; our dinner will be ready.\"\n\"And so will ours; and we have always a hot dinner on Sundays. Roast goose to-day, with apple-pie and rice-pudding. I always contrive to know the bill of fare. Well, I like these things uncommonly; but I'll make the sacrifice, if you will.\"\n\"We have a cold dinner. My uncle will allow no unnecessary cooking on the Sabbath. But I must return; the house would be in commotion if I failed to appear.\"\n\"So will Briarmains, bless you! I think I hear my father sending out the overlooker and five of the dyers, to look in six directions for the body of his prodigal son in the snow; and my mother repenting her of her many misdeeds towards me, now I am gone.\"\n\"Martin, how is Mr. Moore?\"\n\"_That_ is what you came for, just to say that word.\"\n\"Come, tell me quickly.\"\n\"Hang him! he is no worse; but as ill-used as ever--mewed up, kept in solitary confinement. They mean to make either an idiot or a maniac of him, and take out a commission of lunacy. Horsfall starves him; you saw how thin he was.\"\n\"You were very good the other day, Martin.\"\n\"What day? I am always good--a model.\"\n\"When will you be so good again?\"\n\"I see what you are after; but you'll not wheedle me--I am no cat's-paw.\"\n\"But it must be done. It is quite a right thing, and a necessary thing.\"\n\"How you encroach! Remember, I managed the matter of my own free will before.\"\n\"And you will again.\"\n\"I won't. The business gave me far too much trouble. I like my ease.\"\n\"Mr. Moore wishes to see me, Martin, and I wish to see him.\"\n\"I dare say\" (coolly).\n\"It is too bad of your mother to exclude his friends.\"\n\"Tell her so.\"\n\"His own relations.\"\n\"Come and blow her up.\"\n\"You know that would advance nothing. Well, I shall stick to my point. See him I will. If you won't help me, I'll manage without help.\"\n\"Do; there is nothing like self-reliance, self-dependence.\"\n\"I have no time to reason with you now; but I consider you provoking. Good-morning.\"\nAway she went, the umbrella shut, for she could not carry it against the wind.\n\"She is not vapid; she is not shallow,\" said Martin. \"I shall like to watch, and mark how she will work her way without help. If the storm were not of snow, but of fire--such as came refreshingly down on the cities of the plain--she would go through it to procure five minutes' speech of that Moore. Now, I consider I have had a pleasant morning. The disappointments got time on; the fears and fits of anger only made that short discourse pleasanter, when it came at last. She expected to coax me at once. She'll not manage that in one effort. She shall come again, again, and yet again. It would please me to put her in a passion--to make her cry. I want to discover how far she will go--what she will do and dare--to get her will. It seems strange and new to find one human being thinking so much about another as she thinks about Moore. But it is time to go home; my appetite tells me the hour. Won't I walk into that goose? and we'll try whether Matthew or I shall get the largest cut of the apple-pie to-day.\"",
        "paragraph_chars": [
            [
                0,
                376
            ],
            [
                376,
                1042
            ],
            [
                1042,
                1572
            ],
            [
                1572,
                1795
            ],
            [
                1795,
                2255
            ],
            [
                2255,
                2424
            ],
            [
                2424,
                2492
            ],
            [
                2492,
                2516
            ],
            [
                2516,
                2759
            ],
            [
                2759,
                2801
            ],
            [
                2801,
                2886
            ],
            [
                2886,
                2968
            ],
            [
                2968,
                3018
            ],
            [
                3018,
                3034
            ],
            [
                3034,
                3056
            ],
            [
                3056,
                3093
            ],
            [
                3093,
                3282
            ],
            [
                3282,
                3551
            ],
            [
                3551,
                3886
            ],
            [
                3886,
                4319
            ],
            [
                4319,
                4400
            ],
            [
                4400,
                4568
            ],
            [
                4568,
                4593
            ],
            [
                4593,
                5254
            ],
            [
                5254,
                5857
            ],
            [
                5857,
                6039
            ],
            [
                6039,
                6199
            ],
            [
                6199,
                6299
            ],
            [
                6299,
                6326
            ],
            [
                6326,
                6620
            ],
            [
                6620,
                7270
            ],
            [
                7270,
                7951
            ],
            [
                7951,
                8137
            ],
            [
                8137,
                8418
            ],
            [
                8418,
                8530
            ],
            [
                8530,
                8633
            ],
            [
                8633,
                9267
            ],
            [
                9267,
                9338
            ],
            [
                9338,
                9517
            ],
            [
                9517,
                9597
            ],
            [
                9597,
                9666
            ],
            [
                9666,
                9701
            ],
            [
                9701,
                9722
            ],
            [
                9722,
                10026
            ],
            [
                10026,
                10091
            ],
            [
                10091,
                10842
            ],
            [
                10842,
                10874
            ],
            [
                10874,
                10996
            ],
            [
                10996,
                11113
            ],
            [
                11113,
                11375
            ],
            [
                11375,
                11464
            ],
            [
                11464,
                11477
            ],
            [
                11477,
                11643
            ],
            [
                11643,
                11872
            ],
            [
                11872,
                11926
            ],
            [
                11926,
                12167
            ],
            [
                12167,
                12325
            ],
            [
                12325,
                12581
            ],
            [
                12581,
                12609
            ],
            [
                12609,
                12663
            ],
            [
                12663,
                12688
            ],
            [
                12688,
                12919
            ],
            [
                12919,
                12963
            ],
            [
                12963,
                13002
            ],
            [
                13002,
                13036
            ],
            [
                13036,
                13110
            ],
            [
                13110,
                13183
            ],
            [
                13183,
                13262
            ],
            [
                13262,
                13284
            ],
            [
                13284,
                13354
            ],
            [
                13354,
                13415
            ],
            [
                13415,
                13438
            ],
            [
                13438,
                13493
            ],
            [
                13493,
                13508
            ],
            [
                13508,
                13529
            ],
            [
                13529,
                13553
            ],
            [
                13553,
                13689
            ],
            [
                13689,
                13749
            ],
            [
                13749,
                13834
            ],
            [
                13834,
                13913
            ],
            [
                13913,
                14927
            ]
        ],
        "segment_chars": [
            [
                0,
                134
            ],
            [
                134,
                317
            ],
            [
                317,
                376
            ],
            [
                376,
                465
            ],
            [
                465,
                644
            ],
            [
                644,
                787
            ],
            [
                787,
                913
            ],
            [
                913,
                1042
            ],
            [
                1042,
                1116
            ],
            [
                1116,
                1318
            ],
            [
                1318,
                1385
            ],
            [
                1385,
                1500
            ],
            [
                1500,
                1572
            ],
            [
                1572,
                1686
            ],
            [
                1686,
                1795
            ],
            [
                1795,
                2154
            ],
            [
                2154,
                2255
            ],
            [
                2255,
                2424
            ],
            [
                2424,
                2492
            ],
            [
                2492,
                2516
            ],
            [
                2516,
                2759
            ],
            [
                2759,
                2801
            ],
            [
                2801,
                2812
            ],
            [
                2812,
                2886
            ],
            [
                2886,
                2968
            ],
            [
                2968,
                3018
            ],
            [
                3018,
                3034
            ],
            [
                3034,
                3056
            ],
            [
                3056,
                3093
            ],
            [
                3093,
                3282
            ],
            [
                3282,
                3296
            ],
            [
                3296,
                3307
            ],
            [
                3307,
                3324
            ],
            [
                3324,
                3385
            ],
            [
                3385,
                3425
            ],
            [
                3425,
                3551
            ],
            [
                3551,
                3644
            ],
            [
                3644,
                3754
            ],
            [
                3754,
                3828
            ],
            [
                3828,
                3886
            ],
            [
                3886,
                3982
            ],
            [
                3982,
                4150
            ],
            [
                4150,
                4177
            ],
            [
                4177,
                4260
            ],
            [
                4260,
                4319
            ],
            [
                4319,
                4400
            ],
            [
                4400,
                4458
            ],
            [
                4458,
                4478
            ],
            [
                4478,
                4568
            ],
            [
                4568,
                4593
            ],
            [
                4593,
                4892
            ],
            [
                4892,
                4981
            ],
            [
                4981,
                5192
            ],
            [
                5192,
                5254
            ],
            [
                5254,
                5271
            ],
            [
                5271,
                5330
            ],
            [
                5330,
                5494
            ],
            [
                5494,
                5644
            ],
            [
                5644,
                5857
            ],
            [
                5857,
                5946
            ],
            [
                5946,
                5992
            ],
            [
                5992,
                6039
            ],
            [
                6039,
                6132
            ],
            [
                6132,
                6179
            ],
            [
                6179,
                6199
            ],
            [
                6199,
                6217
            ],
            [
                6217,
                6230
            ],
            [
                6230,
                6250
            ],
            [
                6250,
                6299
            ],
            [
                6299,
                6326
            ],
            [
                6326,
                6356
            ],
            [
                6356,
                6555
            ],
            [
                6555,
                6568
            ],
            [
                6568,
                6620
            ],
            [
                6620,
                6810
            ],
            [
                6810,
                6860
            ],
            [
                6860,
                6929
            ],
            [
                6929,
                7072
            ],
            [
                7072,
                7100
            ],
            [
                7100,
                7270
            ],
            [
                7270,
                7548
            ],
            [
                7548,
                7617
            ],
            [
                7617,
                7738
            ],
            [
                7738,
                7803
            ],
            [
                7803,
                7838
            ],
            [
                7838,
                7951
            ],
            [
                7951,
                8042
            ],
            [
                8042,
                8137
            ],
            [
                8137,
                8279
            ],
            [
                8279,
                8418
            ],
            [
                8418,
                8503
            ],
            [
                8503,
                8530
            ],
            [
                8530,
                8633
            ],
            [
                8633,
                8674
            ],
            [
                8674,
                8720
            ],
            [
                8720,
                8755
            ],
            [
                8755,
                8800
            ],
            [
                8800,
                8836
            ],
            [
                8836,
                8943
            ],
            [
                8943,
                9065
            ],
            [
                9065,
                9267
            ],
            [
                9267,
                9309
            ],
            [
                9309,
                9338
            ],
            [
                9338,
                9433
            ],
            [
                9433,
                9517
            ],
            [
                9517,
                9597
            ],
            [
                9597,
                9628
            ],
            [
                9628,
                9666
            ],
            [
                9666,
                9701
            ],
            [
                9701,
                9722
            ],
            [
                9722,
                9816
            ],
            [
                9816,
                9833
            ],
            [
                9833,
                9871
            ],
            [
                9871,
                10026
            ],
            [
                10026,
                10045
            ],
            [
                10045,
                10091
            ],
            [
                10091,
                10218
            ],
            [
                10218,
                10257
            ],
            [
                10257,
                10441
            ],
            [
                10441,
                10518
            ],
            [
                10518,
                10551
            ],
            [
                10551,
                10616
            ],
            [
                10616,
                10701
            ],
            [
                10701,
                10773
            ],
            [
                10773,
                10842
            ],
            [
                10842,
                10874
            ],
            [
                10874,
                10922
            ],
            [
                10922,
                10996
            ],
            [
                10996,
                11055
            ],
            [
                11055,
                11113
            ],
            [
                11113,
                11129
            ],
            [
                11129,
                11167
            ],
            [
                11167,
                11271
            ],
            [
                11271,
                11375
            ],
            [
                11375,
                11449
            ],
            [
                11449,
                11464
            ],
            [
                11464,
                11477
            ],
            [
                11477,
                11514
            ],
            [
                11514,
                11570
            ],
            [
                11570,
                11643
            ],
            [
                11643,
                11707
            ],
            [
                11707,
                11744
            ],
            [
                11744,
                11790
            ],
            [
                11790,
                11845
            ],
            [
                11845,
                11872
            ],
            [
                11872,
                11926
            ],
            [
                11926,
                11989
            ],
            [
                11989,
                12042
            ],
            [
                12042,
                12086
            ],
            [
                12086,
                12167
            ],
            [
                12167,
                12191
            ],
            [
                12191,
                12250
            ],
            [
                12250,
                12325
            ],
            [
                12325,
                12357
            ],
            [
                12357,
                12581
            ],
            [
                12581,
                12609
            ],
            [
                12609,
                12663
            ],
            [
                12663,
                12688
            ],
            [
                12688,
                12699
            ],
            [
                12699,
                12780
            ],
            [
                12780,
                12871
            ],
            [
                12871,
                12919
            ],
            [
                12919,
                12963
            ],
            [
                12963,
                12974
            ],
            [
                12974,
                13002
            ],
            [
                13002,
                13036
            ],
            [
                13036,
                13110
            ],
            [
                13110,
                13132
            ],
            [
                13132,
                13183
            ],
            [
                13183,
                13202
            ],
            [
                13202,
                13262
            ],
            [
                13262,
                13284
            ],
            [
                13284,
                13294
            ],
            [
                13294,
                13337
            ],
            [
                13337,
                13354
            ],
            [
                13354,
                13415
            ],
            [
                13415,
                13438
            ],
            [
                13438,
                13493
            ],
            [
                13493,
                13508
            ],
            [
                13508,
                13529
            ],
            [
                13529,
                13553
            ],
            [
                13553,
                13591
            ],
            [
                13591,
                13624
            ],
            [
                13624,
                13640
            ],
            [
                13640,
                13689
            ],
            [
                13689,
                13749
            ],
            [
                13749,
                13819
            ],
            [
                13819,
                13834
            ],
            [
                13834,
                13913
            ],
            [
                13913,
                13966
            ],
            [
                13966,
                14039
            ],
            [
                14039,
                14213
            ],
            [
                14213,
                14260
            ],
            [
                14260,
                14386
            ],
            [
                14386,
                14419
            ],
            [
                14419,
                14457
            ],
            [
                14457,
                14501
            ],
            [
                14501,
                14562
            ],
            [
                14562,
                14646
            ],
            [
                14646,
                14753
            ],
            [
                14753,
                14811
            ],
            [
                14811,
                14841
            ],
            [
                14841,
                14927
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                34,
                44
            ],
            [
                98,
                104
            ],
            [
                46,
                52
            ],
            [
                132,
                134
            ],
            [
                134,
                147
            ],
            [
                149,
                227
            ],
            [
                284,
                287
            ],
            [
                293,
                317
            ],
            [
                317,
                376
            ],
            [
                398,
                465
            ],
            [
                468,
                479
            ],
            [
                481,
                486
            ],
            [
                492,
                607
            ],
            [
                642,
                644
            ],
            [
                644,
                650
            ],
            [
                703,
                767
            ],
            [
                778,
                787
            ],
            [
                787,
                815
            ],
            [
                826,
                880
            ],
            [
                882,
                884
            ],
            [
                897,
                912
            ],
            [
                1059,
                1073
            ],
            [
                1105,
                1116
            ],
            [
                1116,
                1137
            ],
            [
                1191,
                1197
            ],
            [
                1232,
                1281
            ],
            [
                1295,
                1300
            ],
            [
                1286,
                1291
            ],
            [
                1310,
                1318
            ],
            [
                1612,
                1674
            ],
            [
                1572,
                1578
            ],
            [
                1679,
                1686
            ],
            [
                1686,
                1795
            ],
            [
                1795,
                1823
            ],
            [
                1825,
                1837
            ],
            [
                1849,
                1865
            ],
            [
                1838,
                1848
            ],
            [
                1866,
                1875
            ],
            [
                1891,
                1908
            ],
            [
                1977,
                2006
            ],
            [
                2012,
                2050
            ],
            [
                2056,
                2086
            ],
            [
                2099,
                2103
            ],
            [
                2129,
                2151
            ],
            [
                2255,
                2318
            ],
            [
                2348,
                2351
            ],
            [
                2323,
                2327
            ],
            [
                2422,
                2424
            ],
            [
                2424,
                2470
            ],
            [
                2480,
                2492
            ],
            [
                2492,
                2515
            ],
            [
                2516,
                2534
            ],
            [
                2534,
                2535
            ],
            [
                2567,
                2620
            ],
            [
                2757,
                2759
            ],
            [
                2759,
                2801
            ],
            [
                2801,
                2812
            ],
            [
                2812,
                2886
            ],
            [
                2886,
                2968
            ],
            [
                2968,
                2969
            ],
            [
                3044,
                3052
            ],
            [
                2984,
                3015
            ],
            [
                3022,
                3023
            ],
            [
                3094,
                3282
            ],
            [
                3282,
                3296
            ],
            [
                3296,
                3307
            ],
            [
                3307,
                3324
            ],
            [
                3324,
                3331
            ],
            [
                3340,
                3375
            ],
            [
                3383,
                3385
            ],
            [
                3477,
                3487
            ],
            [
                3511,
                3534
            ],
            [
                3493,
                3494
            ],
            [
                3536,
                3541
            ],
            [
                3496,
                3497
            ],
            [
                3543,
                3551
            ],
            [
                3551,
                3602
            ],
            [
                3604,
                3624
            ],
            [
                3642,
                3644
            ],
            [
                3828,
                3886
            ],
            [
                3886,
                3910
            ],
            [
                3915,
                3923
            ],
            [
                3933,
                3977
            ],
            [
                3980,
                3982
            ],
            [
                3982,
                3994
            ],
            [
                4009,
                4010
            ],
            [
                4150,
                4177
            ],
            [
                4177,
                4228
            ],
            [
                4258,
                4260
            ],
            [
                4260,
                4319
            ],
            [
                4319,
                4333
            ],
            [
                4342,
                4352
            ],
            [
                4364,
                4376
            ],
            [
                4390,
                4400
            ],
            [
                4400,
                4458
            ],
            [
                4458,
                4473
            ],
            [
                4568,
                4593
            ],
            [
                4593,
                4627
            ],
            [
                4744,
                4745
            ],
            [
                4665,
                4712
            ],
            [
                4746,
                4766
            ],
            [
                4787,
                4803
            ],
            [
                4805,
                4810
            ],
            [
                4812,
                4814
            ],
            [
                4886,
                4892
            ],
            [
                4892,
                4981
            ],
            [
                4981,
                5008
            ],
            [
                5020,
                5071
            ],
            [
                5119,
                5127
            ],
            [
                5254,
                5269
            ],
            [
                5271,
                5274
            ],
            [
                5286,
                5291
            ],
            [
                5300,
                5305
            ],
            [
                5275,
                5281
            ],
            [
                5328,
                5330
            ],
            [
                5330,
                5336
            ],
            [
                5368,
                5387
            ],
            [
                5408,
                5425
            ],
            [
                5428,
                5432
            ],
            [
                5442,
                5454
            ],
            [
                5357,
                5360
            ],
            [
                5492,
                5494
            ],
            [
                5494,
                5536
            ],
            [
                5541,
                5577
            ],
            [
                5579,
                5581
            ],
            [
                5636,
                5644
            ],
            [
                5644,
                5685
            ],
            [
                5719,
                5727
            ],
            [
                5729,
                5736
            ],
            [
                5747,
                5790
            ],
            [
                5797,
                5806
            ],
            [
                5814,
                5817
            ],
            [
                5822,
                5840
            ],
            [
                5848,
                5857
            ],
            [
                5857,
                5910
            ],
            [
                5924,
                5932
            ],
            [
                5934,
                5946
            ],
            [
                5946,
                5992
            ],
            [
                5992,
                6039
            ],
            [
                6039,
                6055
            ],
            [
                6068,
                6069
            ],
            [
                6086,
                6107
            ],
            [
                6109,
                6120
            ],
            [
                6130,
                6132
            ],
            [
                6160,
                6179
            ],
            [
                6179,
                6199
            ],
            [
                6199,
                6209
            ],
            [
                6217,
                6230
            ],
            [
                6250,
                6258
            ],
            [
                6265,
                6270
            ],
            [
                6272,
                6296
            ],
            [
                6327,
                6354
            ],
            [
                6354,
                6356
            ],
            [
                6356,
                6393
            ],
            [
                6439,
                6486
            ],
            [
                6553,
                6555
            ],
            [
                6555,
                6568
            ],
            [
                6568,
                6597
            ],
            [
                6599,
                6600
            ],
            [
                6602,
                6606
            ],
            [
                6607,
                6620
            ],
            [
                6620,
                6704
            ],
            [
                6808,
                6810
            ],
            [
                6860,
                6889
            ],
            [
                6893,
                6914
            ],
            [
                6926,
                6929
            ],
            [
                6929,
                7072
            ],
            [
                7072,
                7100
            ],
            [
                7100,
                7270
            ],
            [
                7270,
                7317
            ],
            [
                7479,
                7548
            ],
            [
                7548,
                7617
            ],
            [
                7617,
                7628
            ],
            [
                7633,
                7638
            ],
            [
                7688,
                7691
            ],
            [
                7668,
                7683
            ],
            [
                7736,
                7738
            ],
            [
                7738,
                7755
            ],
            [
                7822,
                7836
            ],
            [
                7769,
                7778
            ],
            [
                7803,
                7812
            ],
            [
                7836,
                7838
            ],
            [
                7838,
                7914
            ],
            [
                7925,
                7937
            ],
            [
                7915,
                7920
            ],
            [
                7938,
                7951
            ],
            [
                7951,
                7987
            ],
            [
                7993,
                8042
            ],
            [
                8042,
                8075
            ],
            [
                8135,
                8137
            ],
            [
                8152,
                8182
            ],
            [
                8222,
                8242
            ],
            [
                8253,
                8279
            ],
            [
                8301,
                8303
            ],
            [
                8295,
                8300
            ],
            [
                8304,
                8306
            ],
            [
                8284,
                8294
            ],
            [
                8307,
                8364
            ],
            [
                8415,
                8418
            ],
            [
                8418,
                8428
            ],
            [
                8473,
                8503
            ],
            [
                8503,
                8530
            ],
            [
                8530,
                8633
            ],
            [
                8633,
                8665
            ],
            [
                8666,
                8674
            ],
            [
                8755,
                8800
            ],
            [
                8800,
                8836
            ],
            [
                8836,
                8863
            ],
            [
                8872,
                8931
            ],
            [
                8936,
                8943
            ],
            [
                8943,
                8983
            ],
            [
                8996,
                9001
            ],
            [
                9063,
                9065
            ],
            [
                9137,
                9161
            ],
            [
                9167,
                9171
            ],
            [
                9126,
                9136
            ],
            [
                9173,
                9176
            ],
            [
                9267,
                9309
            ],
            [
                9309,
                9338
            ],
            [
                9338,
                9340
            ],
            [
                9362,
                9393
            ],
            [
                9431,
                9433
            ],
            [
                9433,
                9444
            ],
            [
                9459,
                9517
            ],
            [
                9517,
                9533
            ],
            [
                9578,
                9580
            ],
            [
                9545,
                9555
            ],
            [
                9594,
                9597
            ],
            [
                9597,
                9628
            ],
            [
                9628,
                9666
            ],
            [
                9666,
                9698
            ],
            [
                9756,
                9775
            ],
            [
                9754,
                9755
            ],
            [
                9777,
                9785
            ],
            [
                9793,
                9810
            ],
            [
                9814,
                9816
            ],
            [
                9816,
                9819
            ],
            [
                9821,
                9824
            ],
            [
                9826,
                9833
            ],
            [
                9876,
                9881
            ],
            [
                9945,
                9946
            ],
            [
                9916,
                9945
            ],
            [
                10023,
                10026
            ],
            [
                10026,
                10045
            ],
            [
                10045,
                10091
            ],
            [
                10091,
                10115
            ],
            [
                10131,
                10143
            ],
            [
                10182,
                10218
            ],
            [
                10218,
                10255
            ],
            [
                10996,
                11020
            ],
            [
                11028,
                11053
            ],
            [
                11129,
                11132
            ],
            [
                11155,
                11165
            ],
            [
                11171,
                11217
            ],
            [
                11225,
                11269
            ],
            [
                11375,
                11421
            ],
            [
                11434,
                11449
            ],
            [
                11449,
                11450
            ],
            [
                11452,
                11457
            ],
            [
                11459,
                11461
            ],
            [
                11487,
                11512
            ],
            [
                11512,
                11514
            ],
            [
                11514,
                11515
            ],
            [
                11531,
                11545
            ],
            [
                11553,
                11556
            ],
            [
                11568,
                11570
            ],
            [
                11570,
                11613
            ],
            [
                11618,
                11643
            ],
            [
                11643,
                11644
            ],
            [
                11645,
                11646
            ],
            [
                11648,
                11655
            ],
            [
                11676,
                11707
            ],
            [
                11707,
                11744
            ],
            [
                11744,
                11778
            ],
            [
                11788,
                11790
            ],
            [
                11845,
                11872
            ],
            [
                11872,
                11926
            ],
            [
                11926,
                11989
            ],
            [
                11989,
                12000
            ],
            [
                12007,
                12040
            ],
            [
                12122,
                12167
            ],
            [
                12167,
                12189
            ],
            [
                12234,
                12250
            ],
            [
                12250,
                12322
            ],
            [
                12582,
                12606
            ],
            [
                12664,
                12688
            ],
            [
                12688,
                12699
            ],
            [
                12699,
                12738
            ],
            [
                12750,
                12780
            ],
            [
                12871,
                12919
            ],
            [
                12919,
                12960
            ],
            [
                13003,
                13036
            ],
            [
                13036,
                13088
            ],
            [
                13294,
                13335
            ],
            [
                13354,
                13355
            ],
            [
                13357,
                13415
            ],
            [
                13415,
                13438
            ],
            [
                13640,
                13689
            ],
            [
                13689,
                13729
            ],
            [
                13746,
                13749
            ],
            [
                13749,
                13819
            ],
            [
                13819,
                13834
            ],
            [
                13834,
                13913
            ],
            [
                13913,
                13966
            ],
            [
                13966,
                13982
            ],
            [
                13999,
                14039
            ],
            [
                14229,
                14260
            ],
            [
                14386,
                14417
            ],
            [
                14419,
                14436
            ],
            [
                14455,
                14457
            ],
            [
                14457,
                14471
            ],
            [
                14479,
                14501
            ],
            [
                14501,
                14543
            ],
            [
                14545,
                14562
            ],
            [
                14562,
                14600
            ],
            [
                14602,
                14615
            ],
            [
                14623,
                14627
            ],
            [
                14629,
                14646
            ],
            [
                14646,
                14753
            ],
            [
                14753,
                14779
            ],
            [
                14809,
                14811
            ],
            [
                14845,
                14850
            ],
            [
                14855,
                14897
            ],
            [
                14902,
                14904
            ],
            [
                14909,
                14918
            ],
            [
                14925,
                14927
            ]
        ],
        "row_chars": [
            [
                0,
                134
            ],
            [
                134,
                317
            ],
            [
                317,
                376
            ],
            [
                376,
                465
            ],
            [
                465,
                644
            ],
            [
                644,
                787
            ],
            [
                787,
                913
            ],
            [
                913,
                1042
            ],
            [
                1042,
                1116
            ],
            [
                1116,
                1318
            ],
            [
                1318,
                1385
            ],
            [
                1385,
                1500
            ],
            [
                1500,
                1572
            ],
            [
                1572,
                1686
            ],
            [
                1686,
                1795
            ],
            [
                1795,
                2154
            ],
            [
                2154,
                2255
            ],
            [
                2255,
                2424
            ],
            [
                2424,
                2492
            ],
            [
                2492,
                2516
            ],
            [
                2516,
                2759
            ],
            [
                2759,
                2801
            ],
            [
                2801,
                2812
            ],
            [
                2812,
                2886
            ],
            [
                2886,
                2968
            ],
            [
                2968,
                3282
            ],
            [
                3282,
                3296
            ],
            [
                3296,
                3307
            ],
            [
                3307,
                3324
            ],
            [
                3324,
                3385
            ],
            [
                3385,
                3425
            ],
            [
                3425,
                3551
            ],
            [
                3551,
                3644
            ],
            [
                3644,
                3754
            ],
            [
                3754,
                3828
            ],
            [
                3828,
                3886
            ],
            [
                3886,
                3982
            ],
            [
                3982,
                4177
            ],
            [
                4177,
                4260
            ],
            [
                4260,
                4319
            ],
            [
                4319,
                4400
            ],
            [
                4400,
                4458
            ],
            [
                4458,
                4568
            ],
            [
                4568,
                4593
            ],
            [
                4593,
                4892
            ],
            [
                4892,
                4981
            ],
            [
                4981,
                5192
            ],
            [
                5192,
                5254
            ],
            [
                5254,
                5330
            ],
            [
                5330,
                5494
            ],
            [
                5494,
                5644
            ],
            [
                5644,
                5857
            ],
            [
                5857,
                5946
            ],
            [
                5946,
                5992
            ],
            [
                5992,
                6039
            ],
            [
                6039,
                6132
            ],
            [
                6132,
                6179
            ],
            [
                6179,
                6199
            ],
            [
                6199,
                6230
            ],
            [
                6230,
                6250
            ],
            [
                6250,
                6299
            ],
            [
                6299,
                6326
            ],
            [
                6326,
                6356
            ],
            [
                6356,
                6555
            ],
            [
                6555,
                6568
            ],
            [
                6568,
                6620
            ],
            [
                6620,
                6810
            ],
            [
                6810,
                6860
            ],
            [
                6860,
                6929
            ],
            [
                6929,
                7072
            ],
            [
                7072,
                7100
            ],
            [
                7100,
                7270
            ],
            [
                7270,
                7548
            ],
            [
                7548,
                7617
            ],
            [
                7617,
                7738
            ],
            [
                7738,
                7838
            ],
            [
                7838,
                7951
            ],
            [
                7951,
                8042
            ],
            [
                8042,
                8137
            ],
            [
                8137,
                8279
            ],
            [
                8279,
                8418
            ],
            [
                8418,
                8503
            ],
            [
                8503,
                8530
            ],
            [
                8530,
                8633
            ],
            [
                8633,
                8674
            ],
            [
                8674,
                8720
            ],
            [
                8720,
                8755
            ],
            [
                8755,
                8800
            ],
            [
                8800,
                8836
            ],
            [
                8836,
                8943
            ],
            [
                8943,
                9065
            ],
            [
                9065,
                9267
            ],
            [
                9267,
                9309
            ],
            [
                9309,
                9338
            ],
            [
                9338,
                9433
            ],
            [
                9433,
                9517
            ],
            [
                9517,
                9597
            ],
            [
                9597,
                9628
            ],
            [
                9628,
                9666
            ],
            [
                9666,
                9701
            ],
            [
                9701,
                9722
            ],
            [
                9722,
                9816
            ],
            [
                9816,
                9833
            ],
            [
                9833,
                9871
            ],
            [
                9871,
                10026
            ],
            [
                10026,
                10045
            ],
            [
                10045,
                10091
            ],
            [
                10091,
                10218
            ],
            [
                10218,
                10257
            ],
            [
                10257,
                10441
            ],
            [
                10441,
                10518
            ],
            [
                10518,
                10551
            ],
            [
                10551,
                10616
            ],
            [
                10616,
                10701
            ],
            [
                10701,
                10773
            ],
            [
                10773,
                10842
            ],
            [
                10842,
                10874
            ],
            [
                10874,
                10922
            ],
            [
                10922,
                10996
            ],
            [
                10996,
                11055
            ],
            [
                11055,
                11113
            ],
            [
                11113,
                11129
            ],
            [
                11129,
                11271
            ],
            [
                11271,
                11375
            ],
            [
                11375,
                11449
            ],
            [
                11449,
                11464
            ],
            [
                11464,
                11514
            ],
            [
                11514,
                11570
            ],
            [
                11570,
                11643
            ],
            [
                11643,
                11707
            ],
            [
                11707,
                11744
            ],
            [
                11744,
                11790
            ],
            [
                11790,
                11845
            ],
            [
                11845,
                11872
            ],
            [
                11872,
                11926
            ],
            [
                11926,
                11989
            ],
            [
                11989,
                12167
            ],
            [
                12167,
                12250
            ],
            [
                12250,
                12325
            ],
            [
                12325,
                12357
            ],
            [
                12357,
                12581
            ],
            [
                12581,
                12609
            ],
            [
                12609,
                12663
            ],
            [
                12663,
                12688
            ],
            [
                12688,
                12699
            ],
            [
                12699,
                12780
            ],
            [
                12780,
                12871
            ],
            [
                12871,
                12919
            ],
            [
                12919,
                12963
            ],
            [
                12963,
                12974
            ],
            [
                12974,
                13002
            ],
            [
                13002,
                13036
            ],
            [
                13036,
                13110
            ],
            [
                13110,
                13132
            ],
            [
                13132,
                13183
            ],
            [
                13183,
                13202
            ],
            [
                13202,
                13262
            ],
            [
                13262,
                13284
            ],
            [
                13284,
                13294
            ],
            [
                13294,
                13337
            ],
            [
                13337,
                13354
            ],
            [
                13354,
                13415
            ],
            [
                13415,
                13438
            ],
            [
                13438,
                13493
            ],
            [
                13493,
                13508
            ],
            [
                13508,
                13529
            ],
            [
                13529,
                13553
            ],
            [
                13553,
                13591
            ],
            [
                13591,
                13624
            ],
            [
                13624,
                13640
            ],
            [
                13640,
                13689
            ],
            [
                13689,
                13749
            ],
            [
                13749,
                13819
            ],
            [
                13819,
                13834
            ],
            [
                13834,
                13913
            ],
            [
                13913,
                13966
            ],
            [
                13966,
                14039
            ],
            [
                14039,
                14213
            ],
            [
                14213,
                14260
            ],
            [
                14260,
                14386
            ],
            [
                14386,
                14457
            ],
            [
                14457,
                14501
            ],
            [
                14501,
                14562
            ],
            [
                14562,
                14646
            ],
            [
                14646,
                14753
            ],
            [
                14753,
                14811
            ],
            [
                14811,
                14841
            ],
            [
                14841,
                14927
            ]
        ]
    },
    "abridged": {
        "text": "Martin, having tasted excitement and power, wanted more. Miss Helstone - that girl he had always called ugly, and whose face was now perpetually before him - had come within his sphere. It fretted him to think the visit might never be repeated.\nMartin was no ordinary schoolboy; he was destined to grow up an original. A few years later he took great pains to pare and polish himself down to the pattern of the rest of the world, but he never succeeded. He now cast about in his mind for the means of adding another chapter to his romance. He did not yet know how many life-romances are doomed never to get beyond the first or second chapter.\nHe had an irreligious dislike of Sunday. His father and mother never failed to fill their large pew in Briarfield Church with their whole family. The morning service was long, and the sermon usually little to Martin's taste. This Saturday afternoon, however, his woodland musings disclosed to him a new-found charm in the coming day.\nIt proved a day of deep snow - so deep that during breakfast Mrs. Yorke announced that the children, instead of going to church, should sit silent for two hours in the parlour, while Rose and Martin read John Wesley's \"Sermons\".\n\"Rose will do as she pleases,\" said Martin, not looking up from his book.\n\"Rose will do as she is told, and Martin too,\" said the mother.\n\"I am going to church.\" So her son replied quietly, like a true Yorke, who knows his will and means to have it.\n\"It is not fit weather,\" said the father.\nNo answer. The youth read studiously; he slowly broke his bread and sipped his milk.\n\"Martin hates to go to church, but he hates still more to obey,\" said Mrs. Yorke.\n\"I am not influenced by pure perverseness, but by a complication of motives, the intricacies of which I should as soon think of explaining to you as I should of turning myself inside out to exhibit the internal machinery of my frame.\"\n\"Hear Martin! hear him!\" cried Mr. Yorke. \"I must have this lad of mine brought up to be a lawyer. He has the self-conceit, and words - words - words.\"\n\"Some bread, Rose, if you please,\" requested Martin with intense gravity. He rang the bell, and gently asked for his walking-shoes.\n\"But, Martin,\" urged his father, \"there are snowdrifts all the way; a man could hardly wade through. However, lad, go to church by all means. There is a pitiless wind, and a sharp, frozen sleet. Go out into it, since thou prefers it to a warm fireside.\"\nMartin quietly put on his cloak, scarf and cap, and went out.\n\"My father has more sense than my mother,\" he pronounced. \"How women miss their aim!\"\nHe reached church early.\n\"Now, if the weather frightens her, or if that Mrs. Pryor objects to her going out, it will vex me; but, hail or ice, she ought to come. She will be here for the chance of seeing me, as I am here for the chance of seeing her. She will want to get a word about her confounded sweetheart, as I want to get another taste of adventure.\"\nHe looked round at the cold, empty church. As the bell tolled slowly, elderly parishioners came in, and took the humblest seats. It is always the frailest, the oldest, and poorest that brave the worst weather to attend church. This wild morning not one affluent family appeared: all the cushioned pews were empty; only on the bare oak seats sat the grey-haired elders and paupers.\n\"I'll scorn her if she doesn't come,\" muttered Martin savagely to himself. The rector's shovel-hat had passed the porch. Mr. Helstone and his clerk were in the vestry.\nThe bells ceased - the doors were closed - the service began. She was not there. Martin scorned her.\n\"Worthless, vapid thing! Like all girls - weakly, selfish, shallow! She is not like our picture at all. Her eyes are not large and expressive; her mouth has not that charm I thought it had. What is she? A thread-paper, a doll, a toy; a girl, in short.\"\nSo absorbed was the young cynic he forgot to rise from his knees at the proper place. He started up red (for he was sensitive to ridicule). To make the matter worse, the church door had reopened, and the aisles were filling: patter, patter, patter, a hundred little feet trotted in. It was the Sunday scholars. According to Briarfield winter custom, these children had till now been kept where there was a warm stove, and only led into church just before the communion and sermon.\nThe little ones were settled first, and at last a tall class of young women came quietly in, closing the procession. Their teacher, having seen them seated, passed into the rectory pew. The French-grey cloak was known to Martin. Miss Helstone had come to church in the storm after all. Martin probably whispered his satisfaction to his hymn book; at any rate, he hid his face there for two minutes.\nSatisfied or not, he had time to get angry with her again before the sermon was over. She had never once looked his way.\n\"If she takes no notice of me, I shall have a worse opinion of her than ever. It would be despicable of her just to come for the sake of those sheep-faced Sunday scholars.\"\nThe sermon ended; the congregation dispersed. She had not been near him.\nNow, indeed, as Martin set his face homeward, he felt that the sleet was sharp and the east wind cold.\nHis nearest way lay through some untrodden fields. Near the second stile rose a clump of trees. Was that an umbrella waiting there? Yes, an umbrella, held with difficulty against the blast; behind it fluttered a French-grey cloak. Martin grinned as he toiled up the steep field. He seated himself coolly upon the stile, and said:\n\"I think you had better strike a bargain. Exchange me for Mrs. Pryor.\"\n\"I hoped you would come this way, Martin. There is no chance of getting a quiet word spoken in the church or churchyard.\"\n\"Will you agree? Exchange me for Mrs. Pryor?\"\n\"As if I could understand you! What puts Mrs. Pryor into your head?\"\n\"You call her 'mamma,' don't you? She is so careless a mamma, I should be five times better. You may laugh. You have pretty teeth, as pretty as a pearl necklace.\"\n\"Martin, what now? I thought the Yorkes never paid compliments?\"\n\"They have not done till now; but I feel I should start a new variety of the Yorke species. I am rather tired of my own ancestors.\"\n\"You are a very strange, unaccountable boy, Martin.\"\n\"But Mrs. Pryor must be the most unnatural mamma in existence, to let her daughter come out in this weather.\"\n\"Mamma was very much concerned about me; but I was obstinate. I would go. I thought of nothing else but seeing you. I thought the snow would stop you. You don't know how pleased I was to see you by yourself in the pew.\"\n\"I came to set the parish a good example. And so you were obstinate, were you? I should like to see you obstinate. Let me take the umbrella.\"\n\"I can't stay two minutes; our dinner will be ready.\"\n\"And so will ours; and we have always a hot dinner on Sundays. Roast goose today, with apple-pie and rice-pudding; but I'll make the sacrifice, if you will.\"\n\"We have a cold dinner on the Sabbath. But I must return; the house would be in commotion if I failed to appear. Martin, how is Mr. Moore? Come, tell me quickly.\"\n\"Hang him! he is no worse; but as ill-used as ever - kept in solitary confinement. Horsfall starves him; you saw how thin he was.\"\n\"You were very good the other day, Martin. When will you be so good again?\"\n\"I see what you are after; but you'll not wheedle me. The business gave me far too much trouble.\"\n\"But Mr. Moore wishes to see me, Martin, and I wish to see him.\"\n\"I dare say\" (coolly).\n\"Well, if you won't help me, I'll manage without help.\"\n\"Do; there is nothing like self-reliance.\"\n\"I have no time to reason with you now; but I consider you provoking. Good-morning.\"\nAway she went, the umbrella shut, for she could not carry it against the wind.\n\"She is not vapid; she is not shallow,\" said Martin. \"I shall like to see how she will work her way without help. I have had a pleasant morning. She expected to coax me at once, but she'll not manage it. She shall come again, and yet again. It would please me to put her in a passion - to make her cry. I want to discover how far she will go - what she will dare to get her will. It seems strange and new to find one human being thinking so much about another as she thinks about Moore. But it is time to go home; I am hungry. We'll see whether Matthew or I shall get the largest slice of apple-pie today.\"",
        "paragraph_chars": [
            [
                0,
                245
            ],
            [
                245,
                643
            ],
            [
                643,
                977
            ],
            [
                977,
                1206
            ],
            [
                1206,
                1280
            ],
            [
                1280,
                1344
            ],
            [
                1344,
                1456
            ],
            [
                1456,
                1498
            ],
            [
                1498,
                1583
            ],
            [
                1583,
                1665
            ],
            [
                1665,
                1900
            ],
            [
                1900,
                2052
            ],
            [
                2052,
                2184
            ],
            [
                2184,
                2438
            ],
            [
                2438,
                2500
            ],
            [
                2500,
                2586
            ],
            [
                2586,
                2611
            ],
            [
                2611,
                2944
            ],
            [
                2944,
                3325
            ],
            [
                3325,
                3493
            ],
            [
                3493,
                3594
            ],
            [
                3594,
                3847
            ],
            [
                3847,
                4328
            ],
            [
                4328,
                4727
            ],
            [
                4727,
                4848
            ],
            [
                4848,
                5021
            ],
            [
                5021,
                5094
            ],
            [
                5094,
                5197
            ],
            [
                5197,
                5527
            ],
            [
                5527,
                5598
            ],
            [
                5598,
                5720
            ],
            [
                5720,
                5766
            ],
            [
                5766,
                5835
            ],
            [
                5835,
                5998
            ],
            [
                5998,
                6063
            ],
            [
                6063,
                6195
            ],
            [
                6195,
                6248
            ],
            [
                6248,
                6358
            ],
            [
                6358,
                6578
            ],
            [
                6578,
                6720
            ],
            [
                6720,
                6774
            ],
            [
                6774,
                6932
            ],
            [
                6932,
                7095
            ],
            [
                7095,
                7226
            ],
            [
                7226,
                7302
            ],
            [
                7302,
                7400
            ],
            [
                7400,
                7465
            ],
            [
                7465,
                7488
            ],
            [
                7488,
                7544
            ],
            [
                7544,
                7587
            ],
            [
                7587,
                7672
            ],
            [
                7672,
                7751
            ],
            [
                7751,
                8357
            ]
        ],
        "segment_chars": [
            [
                0,
                57
            ],
            [
                57,
                186
            ],
            [
                186,
                245
            ],
            [
                245,
                319
            ],
            [
                319,
                454
            ],
            [
                454,
                540
            ],
            [
                540,
                643
            ],
            [
                643,
                684
            ],
            [
                684,
                789
            ],
            [
                789,
                868
            ],
            [
                868,
                977
            ],
            [
                977,
                1206
            ],
            [
                1206,
                1280
            ],
            [
                1280,
                1344
            ],
            [
                1344,
                1368
            ],
            [
                1368,
                1456
            ],
            [
                1456,
                1498
            ],
            [
                1498,
                1509
            ],
            [
                1509,
                1583
            ],
            [
                1583,
                1665
            ],
            [
                1665,
                1900
            ],
            [
                1900,
                1914
            ],
            [
                1914,
                1925
            ],
            [
                1925,
                1942
            ],
            [
                1942,
                1999
            ],
            [
                1999,
                2052
            ],
            [
                2052,
                2126
            ],
            [
                2126,
                2184
            ],
            [
                2184,
                2285
            ],
            [
                2285,
                2326
            ],
            [
                2326,
                2379
            ],
            [
                2379,
                2438
            ],
            [
                2438,
                2500
            ],
            [
                2500,
                2558
            ],
            [
                2558,
                2586
            ],
            [
                2586,
                2611
            ],
            [
                2611,
                2748
            ],
            [
                2748,
                2837
            ],
            [
                2837,
                2944
            ],
            [
                2944,
                2987
            ],
            [
                2987,
                3073
            ],
            [
                3073,
                3171
            ],
            [
                3171,
                3325
            ],
            [
                3325,
                3400
            ],
            [
                3400,
                3446
            ],
            [
                3446,
                3493
            ],
            [
                3493,
                3555
            ],
            [
                3555,
                3574
            ],
            [
                3574,
                3594
            ],
            [
                3594,
                3619
            ],
            [
                3619,
                3662
            ],
            [
                3662,
                3698
            ],
            [
                3698,
                3784
            ],
            [
                3784,
                3797
            ],
            [
                3797,
                3847
            ],
            [
                3847,
                3933
            ],
            [
                3933,
                3987
            ],
            [
                3987,
                4130
            ],
            [
                4130,
                4158
            ],
            [
                4158,
                4328
            ],
            [
                4328,
                4445
            ],
            [
                4445,
                4514
            ],
            [
                4514,
                4557
            ],
            [
                4557,
                4614
            ],
            [
                4614,
                4727
            ],
            [
                4727,
                4813
            ],
            [
                4813,
                4848
            ],
            [
                4848,
                4926
            ],
            [
                4926,
                5021
            ],
            [
                5021,
                5067
            ],
            [
                5067,
                5094
            ],
            [
                5094,
                5197
            ],
            [
                5197,
                5248
            ],
            [
                5248,
                5293
            ],
            [
                5293,
                5329
            ],
            [
                5329,
                5428
            ],
            [
                5428,
                5476
            ],
            [
                5476,
                5527
            ],
            [
                5527,
                5569
            ],
            [
                5569,
                5598
            ],
            [
                5598,
                5640
            ],
            [
                5640,
                5720
            ],
            [
                5720,
                5737
            ],
            [
                5737,
                5766
            ],
            [
                5766,
                5797
            ],
            [
                5797,
                5835
            ],
            [
                5835,
                5869
            ],
            [
                5869,
                5928
            ],
            [
                5928,
                5943
            ],
            [
                5943,
                5998
            ],
            [
                5998,
                6017
            ],
            [
                6017,
                6063
            ],
            [
                6063,
                6155
            ],
            [
                6155,
                6195
            ],
            [
                6195,
                6248
            ],
            [
                6248,
                6358
            ],
            [
                6358,
                6420
            ],
            [
                6420,
                6432
            ],
            [
                6432,
                6474
            ],
            [
                6474,
                6509
            ],
            [
                6509,
                6578
            ],
            [
                6578,
                6620
            ],
            [
                6620,
                6657
            ],
            [
                6657,
                6693
            ],
            [
                6693,
                6720
            ],
            [
                6720,
                6774
            ],
            [
                6774,
                6837
            ],
            [
                6837,
                6932
            ],
            [
                6932,
                6971
            ],
            [
                6971,
                7045
            ],
            [
                7045,
                7071
            ],
            [
                7071,
                7095
            ],
            [
                7095,
                7106
            ],
            [
                7106,
                7178
            ],
            [
                7178,
                7226
            ],
            [
                7226,
                7269
            ],
            [
                7269,
                7302
            ],
            [
                7302,
                7356
            ],
            [
                7356,
                7400
            ],
            [
                7400,
                7465
            ],
            [
                7465,
                7488
            ],
            [
                7488,
                7544
            ],
            [
                7544,
                7587
            ],
            [
                7587,
                7657
            ],
            [
                7657,
                7672
            ],
            [
                7672,
                7751
            ],
            [
                7751,
                7804
            ],
            [
                7804,
                7865
            ],
            [
                7865,
                7896
            ],
            [
                7896,
                7955
            ],
            [
                7955,
                7992
            ],
            [
                7992,
                8054
            ],
            [
                8054,
                8131
            ],
            [
                8131,
                8238
            ],
            [
                8238,
                8278
            ],
            [
                8278,
                8357
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                22,
                32
            ],
            [
                37,
                43
            ],
            [
                44,
                50
            ],
            [
                55,
                57
            ],
            [
                57,
                70
            ],
            [
                73,
                151
            ],
            [
                158,
                161
            ],
            [
                162,
                186
            ],
            [
                186,
                245
            ],
            [
                252,
                319
            ],
            [
                319,
                330
            ],
            [
                331,
                336
            ],
            [
                337,
                452
            ],
            [
                452,
                454
            ],
            [
                454,
                460
            ],
            [
                466,
                530
            ],
            [
                531,
                540
            ],
            [
                540,
                568
            ],
            [
                569,
                623
            ],
            [
                624,
                626
            ],
            [
                627,
                642
            ],
            [
                650,
                664
            ],
            [
                673,
                684
            ],
            [
                684,
                705
            ],
            [
                712,
                718
            ],
            [
                719,
                768
            ],
            [
                769,
                774
            ],
            [
                775,
                780
            ],
            [
                781,
                789
            ],
            [
                789,
                851
            ],
            [
                852,
                858
            ],
            [
                861,
                868
            ],
            [
                868,
                977
            ],
            [
                977,
                1005
            ],
            [
                1008,
                1020
            ],
            [
                1021,
                1037
            ],
            [
                1038,
                1048
            ],
            [
                1049,
                1058
            ],
            [
                1059,
                1076
            ],
            [
                1076,
                1105
            ],
            [
                1106,
                1144
            ],
            [
                1145,
                1175
            ],
            [
                1176,
                1180
            ],
            [
                1181,
                1203
            ],
            [
                1206,
                1269
            ],
            [
                1270,
                1273
            ],
            [
                1274,
                1278
            ],
            [
                1278,
                1280
            ],
            [
                1280,
                1326
            ],
            [
                1332,
                1344
            ],
            [
                1344,
                1367
            ],
            [
                1368,
                1386
            ],
            [
                1394,
                1395
            ],
            [
                1401,
                1454
            ],
            [
                1454,
                1456
            ],
            [
                1456,
                1498
            ],
            [
                1498,
                1509
            ],
            [
                1509,
                1583
            ],
            [
                1583,
                1665
            ],
            [
                1665,
                1666
            ],
            [
                1666,
                1674
            ],
            [
                1675,
                1706
            ],
            [
                1706,
                1707
            ],
            [
                1712,
                1900
            ],
            [
                1900,
                1914
            ],
            [
                1914,
                1925
            ],
            [
                1925,
                1942
            ],
            [
                1942,
                1949
            ],
            [
                1950,
                1985
            ],
            [
                1997,
                1999
            ],
            [
                1999,
                2009
            ],
            [
                2010,
                2033
            ],
            [
                2034,
                2035
            ],
            [
                2036,
                2041
            ],
            [
                2042,
                2043
            ],
            [
                2044,
                2052
            ],
            [
                2052,
                2103
            ],
            [
                2104,
                2124
            ],
            [
                2124,
                2126
            ],
            [
                2126,
                2184
            ],
            [
                2184,
                2208
            ],
            [
                2215,
                2223
            ],
            [
                2239,
                2283
            ],
            [
                2283,
                2285
            ],
            [
                2285,
                2297
            ],
            [
                2297,
                2298
            ],
            [
                2299,
                2326
            ],
            [
                2326,
                2377
            ],
            [
                2377,
                2379
            ],
            [
                2379,
                2438
            ],
            [
                2438,
                2452
            ],
            [
                2460,
                2470
            ],
            [
                2477,
                2489
            ],
            [
                2490,
                2500
            ],
            [
                2500,
                2558
            ],
            [
                2558,
                2573
            ],
            [
                2586,
                2611
            ],
            [
                2611,
                2645
            ],
            [
                2645,
                2646
            ],
            [
                2647,
                2694
            ],
            [
                2695,
                2715
            ],
            [
                2716,
                2732
            ],
            [
                2733,
                2738
            ],
            [
                2739,
                2741
            ],
            [
                2742,
                2748
            ],
            [
                2748,
                2837
            ],
            [
                2837,
                2864
            ],
            [
                2871,
                2922
            ],
            [
                2923,
                2931
            ],
            [
                2944,
                2959
            ],
            [
                2963,
                2966
            ],
            [
                2967,
                2972
            ],
            [
                2973,
                2978
            ],
            [
                2979,
                2985
            ],
            [
                2985,
                2987
            ],
            [
                2987,
                2993
            ],
            [
                2994,
                3013
            ],
            [
                3014,
                3031
            ],
            [
                3035,
                3039
            ],
            [
                3040,
                3052
            ],
            [
                3053,
                3056
            ],
            [
                3071,
                3073
            ],
            [
                3073,
                3115
            ],
            [
                3116,
                3152
            ],
            [
                3153,
                3155
            ],
            [
                3163,
                3171
            ],
            [
                3171,
                3212
            ],
            [
                3213,
                3221
            ],
            [
                3223,
                3230
            ],
            [
                3231,
                3274
            ],
            [
                3279,
                3288
            ],
            [
                3289,
                3292
            ],
            [
                3297,
                3315
            ],
            [
                3316,
                3325
            ],
            [
                3325,
                3378
            ],
            [
                3379,
                3387
            ],
            [
                3388,
                3400
            ],
            [
                3400,
                3446
            ],
            [
                3446,
                3493
            ],
            [
                3493,
                3509
            ],
            [
                3510,
                3511
            ],
            [
                3512,
                3533
            ],
            [
                3536,
                3547
            ],
            [
                3553,
                3555
            ],
            [
                3555,
                3574
            ],
            [
                3574,
                3594
            ],
            [
                3594,
                3604
            ],
            [
                3606,
                3619
            ],
            [
                3619,
                3627
            ],
            [
                3628,
                3633
            ],
            [
                3636,
                3660
            ],
            [
                3662,
                3689
            ],
            [
                3696,
                3698
            ],
            [
                3698,
                3735
            ],
            [
                3735,
                3782
            ],
            [
                3782,
                3784
            ],
            [
                3784,
                3797
            ],
            [
                3797,
                3826
            ],
            [
                3828,
                3829
            ],
            [
                3830,
                3834
            ],
            [
                3834,
                3847
            ],
            [
                3847,
                3931
            ],
            [
                3931,
                3933
            ],
            [
                3933,
                3962
            ],
            [
                3963,
                3984
            ],
            [
                3984,
                3987
            ],
            [
                3987,
                4130
            ],
            [
                4130,
                4158
            ],
            [
                4158,
                4328
            ],
            [
                4328,
                4375
            ],
            [
                4376,
                4445
            ],
            [
                4445,
                4514
            ],
            [
                4514,
                4525
            ],
            [
                4530,
                4535
            ],
            [
                4536,
                4539
            ],
            [
                4540,
                4555
            ],
            [
                4555,
                4557
            ],
            [
                4557,
                4574
            ],
            [
                4575,
                4589
            ],
            [
                4593,
                4602
            ],
            [
                4603,
                4612
            ],
            [
                4612,
                4614
            ],
            [
                4614,
                4690
            ],
            [
                4691,
                4703
            ],
            [
                4704,
                4709
            ],
            [
                4714,
                4727
            ],
            [
                4727,
                4763
            ],
            [
                4764,
                4813
            ],
            [
                4813,
                4846
            ],
            [
                4846,
                4848
            ],
            [
                4848,
                4878
            ],
            [
                4879,
                4899
            ],
            [
                4900,
                4926
            ],
            [
                4926,
                4928
            ],
            [
                4929,
                4934
            ],
            [
                4935,
                4937
            ],
            [
                4938,
                4948
            ],
            [
                4961,
                5018
            ],
            [
                5018,
                5021
            ],
            [
                5021,
                5031
            ],
            [
                5037,
                5067
            ],
            [
                5067,
                5094
            ],
            [
                5094,
                5197
            ],
            [
                5197,
                5229
            ],
            [
                5240,
                5248
            ],
            [
                5248,
                5293
            ],
            [
                5293,
                5329
            ],
            [
                5329,
                5356
            ],
            [
                5357,
                5416
            ],
            [
                5421,
                5428
            ],
            [
                5428,
                5468
            ],
            [
                5469,
                5474
            ],
            [
                5474,
                5476
            ],
            [
                5476,
                5500
            ],
            [
                5501,
                5505
            ],
            [
                5506,
                5516
            ],
            [
                5517,
                5520
            ],
            [
                5527,
                5569
            ],
            [
                5569,
                5598
            ],
            [
                5598,
                5600
            ],
            [
                5607,
                5638
            ],
            [
                5638,
                5640
            ],
            [
                5640,
                5651
            ],
            [
                5662,
                5720
            ],
            [
                5720,
                5736
            ],
            [
                5746,
                5748
            ],
            [
                5753,
                5763
            ],
            [
                5763,
                5766
            ],
            [
                5766,
                5797
            ],
            [
                5797,
                5835
            ],
            [
                5835,
                5867
            ],
            [
                5876,
                5895
            ],
            [
                5895,
                5896
            ],
            [
                5897,
                5905
            ],
            [
                5909,
                5926
            ],
            [
                5926,
                5928
            ],
            [
                5928,
                5931
            ],
            [
                5932,
                5935
            ],
            [
                5936,
                5943
            ],
            [
                5959,
                5964
            ],
            [
                5964,
                5965
            ],
            [
                5966,
                5995
            ],
            [
                5995,
                5998
            ],
            [
                5998,
                6017
            ],
            [
                6017,
                6063
            ],
            [
                6063,
                6087
            ],
            [
                6091,
                6103
            ],
            [
                6119,
                6155
            ],
            [
                6155,
                6192
            ],
            [
                6195,
                6219
            ],
            [
                6220,
                6245
            ],
            [
                6249,
                6252
            ],
            [
                6253,
                6263
            ],
            [
                6264,
                6310
            ],
            [
                6311,
                6355
            ],
            [
                6358,
                6404
            ],
            [
                6405,
                6420
            ],
            [
                6420,
                6421
            ],
            [
                6422,
                6427
            ],
            [
                6428,
                6430
            ],
            [
                6432,
                6457
            ],
            [
                6472,
                6474
            ],
            [
                6474,
                6475
            ],
            [
                6484,
                6498
            ],
            [
                6504,
                6507
            ],
            [
                6507,
                6509
            ],
            [
                6509,
                6552
            ],
            [
                6553,
                6578
            ],
            [
                6578,
                6579
            ],
            [
                6579,
                6580
            ],
            [
                6581,
                6588
            ],
            [
                6589,
                6620
            ],
            [
                6620,
                6657
            ],
            [
                6657,
                6691
            ],
            [
                6691,
                6693
            ],
            [
                6693,
                6720
            ],
            [
                6720,
                6774
            ],
            [
                6774,
                6837
            ],
            [
                6837,
                6848
            ],
            [
                6854,
                6887
            ],
            [
                6887,
                6932
            ],
            [
                6932,
                6954
            ],
            [
                6955,
                6971
            ],
            [
                6971,
                7043
            ],
            [
                7045,
                7069
            ],
            [
                7071,
                7095
            ],
            [
                7095,
                7106
            ],
            [
                7106,
                7145
            ],
            [
                7148,
                7178
            ],
            [
                7178,
                7226
            ],
            [
                7226,
                7267
            ],
            [
                7269,
                7302
            ],
            [
                7302,
                7354
            ],
            [
                7356,
                7397
            ],
            [
                7400,
                7401
            ],
            [
                7407,
                7465
            ],
            [
                7465,
                7488
            ],
            [
                7495,
                7544
            ],
            [
                7544,
                7584
            ],
            [
                7584,
                7587
            ],
            [
                7587,
                7657
            ],
            [
                7657,
                7672
            ],
            [
                7672,
                7751
            ],
            [
                7751,
                7804
            ],
            [
                7804,
                7820
            ],
            [
                7825,
                7865
            ],
            [
                7865,
                7896
            ],
            [
                7896,
                7927
            ],
            [
                7933,
                7950
            ],
            [
                7953,
                7955
            ],
            [
                7955,
                7969
            ],
            [
                7970,
                7992
            ],
            [
                7992,
                8034
            ],
            [
                8037,
                8054
            ],
            [
                8054,
                8092
            ],
            [
                8095,
                8108
            ],
            [
                8109,
                8113
            ],
            [
                8114,
                8131
            ],
            [
                8131,
                8238
            ],
            [
                8238,
                8264
            ],
            [
                8276,
                8278
            ],
            [
                8278,
                8283
            ],
            [
                8288,
                8330
            ],
            [
                8337,
                8339
            ],
            [
                8340,
                8349
            ],
            [
                8355,
                8357
            ]
        ],
        "row_chars": [
            [
                0,
                57
            ],
            [
                57,
                186
            ],
            [
                186,
                245
            ],
            [
                245,
                319
            ],
            [
                319,
                454
            ],
            [
                454,
                540
            ],
            [
                540,
                643
            ],
            [
                643,
                643
            ],
            [
                643,
                684
            ],
            [
                684,
                789
            ],
            [
                789,
                789
            ],
            [
                789,
                789
            ],
            [
                789,
                789
            ],
            [
                789,
                868
            ],
            [
                868,
                977
            ],
            [
                977,
                1206
            ],
            [
                1206,
                1206
            ],
            [
                1206,
                1280
            ],
            [
                1280,
                1344
            ],
            [
                1344,
                1368
            ],
            [
                1368,
                1456
            ],
            [
                1456,
                1498
            ],
            [
                1498,
                1509
            ],
            [
                1509,
                1583
            ],
            [
                1583,
                1665
            ],
            [
                1665,
                1900
            ],
            [
                1900,
                1914
            ],
            [
                1914,
                1925
            ],
            [
                1925,
                1942
            ],
            [
                1942,
                1999
            ],
            [
                1999,
                1999
            ],
            [
                1999,
                2052
            ],
            [
                2052,
                2126
            ],
            [
                2126,
                2126
            ],
            [
                2126,
                2126
            ],
            [
                2126,
                2184
            ],
            [
                2184,
                2285
            ],
            [
                2285,
                2326
            ],
            [
                2326,
                2379
            ],
            [
                2379,
                2438
            ],
            [
                2438,
                2500
            ],
            [
                2500,
                2558
            ],
            [
                2558,
                2586
            ],
            [
                2586,
                2611
            ],
            [
                2611,
                2748
            ],
            [
                2748,
                2837
            ],
            [
                2837,
                2944
            ],
            [
                2944,
                2944
            ],
            [
                2944,
                2987
            ],
            [
                2987,
                3073
            ],
            [
                3073,
                3171
            ],
            [
                3171,
                3325
            ],
            [
                3325,
                3400
            ],
            [
                3400,
                3446
            ],
            [
                3446,
                3493
            ],
            [
                3493,
                3555
            ],
            [
                3555,
                3574
            ],
            [
                3574,
                3594
            ],
            [
                3594,
                3619
            ],
            [
                3619,
                3619
            ],
            [
                3619,
                3662
            ],
            [
                3662,
                3662
            ],
            [
                3662,
                3698
            ],
            [
                3698,
                3784
            ],
            [
                3784,
                3797
            ],
            [
                3797,
                3847
            ],
            [
                3847,
                3933
            ],
            [
                3933,
                3933
            ],
            [
                3933,
                3987
            ],
            [
                3987,
                4130
            ],
            [
                4130,
                4158
            ],
            [
                4158,
                4328
            ],
            [
                4328,
                4445
            ],
            [
                4445,
                4514
            ],
            [
                4514,
                4557
            ],
            [
                4557,
                4614
            ],
            [
                4614,
                4727
            ],
            [
                4727,
                4813
            ],
            [
                4813,
                4848
            ],
            [
                4848,
                4926
            ],
            [
                4926,
                5021
            ],
            [
                5021,
                5067
            ],
            [
                5067,
                5094
            ],
            [
                5094,
                5197
            ],
            [
                5197,
                5248
            ],
            [
                5248,
                5248
            ],
            [
                5248,
                5248
            ],
            [
                5248,
                5293
            ],
            [
                5293,
                5329
            ],
            [
                5329,
                5428
            ],
            [
                5428,
                5476
            ],
            [
                5476,
                5527
            ],
            [
                5527,
                5569
            ],
            [
                5569,
                5598
            ],
            [
                5598,
                5640
            ],
            [
                5640,
                5720
            ],
            [
                5720,
                5766
            ],
            [
                5766,
                5797
            ],
            [
                5797,
                5835
            ],
            [
                5835,
                5869
            ],
            [
                5869,
                5869
            ],
            [
                5869,
                5928
            ],
            [
                5928,
                5943
            ],
            [
                5943,
                5943
            ],
            [
                5943,
                5998
            ],
            [
                5998,
                6017
            ],
            [
                6017,
                6063
            ],
            [
                6063,
                6155
            ],
            [
                6155,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6195
            ],
            [
                6195,
                6248
            ],
            [
                6248,
                6248
            ],
            [
                6248,
                6248
            ],
            [
                6248,
                6358
            ],
            [
                6358,
                6358
            ],
            [
                6358,
                6420
            ],
            [
                6420,
                6432
            ],
            [
                6432,
                6474
            ],
            [
                6474,
                6509
            ],
            [
                6509,
                6578
            ],
            [
                6578,
                6620
            ],
            [
                6620,
                6657
            ],
            [
                6657,
                6693
            ],
            [
                6693,
                6693
            ],
            [
                6693,
                6720
            ],
            [
                6720,
                6774
            ],
            [
                6774,
                6837
            ],
            [
                6837,
                6932
            ],
            [
                6932,
                6971
            ],
            [
                6971,
                7045
            ],
            [
                7045,
                7045
            ],
            [
                7045,
                7045
            ],
            [
                7045,
                7071
            ],
            [
                7071,
                7071
            ],
            [
                7071,
                7095
            ],
            [
                7095,
                7106
            ],
            [
                7106,
                7178
            ],
            [
                7178,
                7178
            ],
            [
                7178,
                7226
            ],
            [
                7226,
                7269
            ],
            [
                7269,
                7269
            ],
            [
                7269,
                7269
            ],
            [
                7269,
                7302
            ],
            [
                7302,
                7356
            ],
            [
                7356,
                7356
            ],
            [
                7356,
                7356
            ],
            [
                7356,
                7356
            ],
            [
                7356,
                7356
            ],
            [
                7356,
                7356
            ],
            [
                7356,
                7356
            ],
            [
                7356,
                7400
            ],
            [
                7400,
                7400
            ],
            [
                7400,
                7465
            ],
            [
                7465,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7488
            ],
            [
                7488,
                7544
            ],
            [
                7544,
                7587
            ],
            [
                7587,
                7657
            ],
            [
                7657,
                7672
            ],
            [
                7672,
                7751
            ],
            [
                7751,
                7804
            ],
            [
                7804,
                7865
            ],
            [
                7865,
                7865
            ],
            [
                7865,
                7896
            ],
            [
                7896,
                7896
            ],
            [
                7896,
                7955
            ],
            [
                7955,
                7992
            ],
            [
                7992,
                8054
            ],
            [
                8054,
                8131
            ],
            [
                8131,
                8238
            ],
            [
                8238,
                8278
            ],
            [
                8278,
                8278
            ],
            [
                8278,
                8357
            ]
        ]
    }
}