{
    "original": {
        "text": "Martin had planned well. He had laid out a dexterously concerted scheme for his private amusement. But older and wiser schemers than he are often doomed to see their finest-spun projects swept to annihilation by the sudden broom of Fate, that fell housewife whose red arm none can control. In the present instance this broom was manufactured out of the tough fibres of Moore's own stubborn purpose, bound tight with his will. He was now resuming his strength, and making strange head against Mrs. Horsfall. Each morning he amazed that matron with a fresh astonishment. First he discharged her from her valet duties; he would dress himself. Then he refused the coffee she brought him; he would breakfast with the family. Lastly, he forbade her his chamber. On the same day, amidst the outcries of all the women in the place, he put his head out of doors. The morning after, he followed Mr. Yorke to his counting-house, and requested an envoy to fetch a chaise from the Red House Inn. He was resolved, he said, to return home to the Hollow that very afternoon. Mr. Yorke, instead of opposing, aided and abetted him. The chaise was sent for, though Mrs. Yorke declared the step would be his death. It came. Moore, little disposed to speak, made his purse do duty for his tongue. He expressed his gratitude to the servants and to Mrs. Horsfall by the chink of his coin. The latter personage approved and understood this language perfectly; it made amends for all previous contumacy. She and her patient parted the best friends in the world.\nThe kitchen visited and soothed, Moore betook himself to the parlour. He had Mrs. Yorke to appease; not quite so easy a task as the pacification of her housemaids. There she sat plunged in sullen dudgeon, the gloomiest speculations on the depths of man's ingratitude absorbing her thoughts. He drew near and bent over her; she was obliged to look up, if it were only to bid him \"avaunt.\" There was beauty still in his pale, wasted features; there was earnestness and a sort of sweetness--for he was smiling--in his hollow eyes.\n\"Good-bye!\" he said, and as he spoke the smile glittered and melted. He had no iron mastery of his sensations now; a trifling emotion made itself apparent in his present weak state.\n\"And what are you going to leave us for?\" she asked. \"We will keep you, and do anything in the world for you, if you will only stay till you are stronger.\"\n\"Good-bye!\" he again said; and added, \"You have been a mother to me; give your wilful son one embrace.\"\nLike a foreigner, as he was, he offered her first one cheek, then the other. She kissed him.\n\"What a trouble--what a burden I have been to you!\" he muttered.\n\"You are the worst trouble now, headstrong youth!\" was the answer. \"I wonder who is to nurse you at Hollow's Cottage? Your sister Hortense knows no more about such matters than a child.\"\n\"Thank God! for I have had nursing enough to last me my life.\"\nHere the little girls came in--Jessie crying, Rose quiet but grave. Moore took them out into the hall to soothe, pet, and kiss them. He knew it was not in their mother's nature to bear to see any living thing caressed but herself. She would have felt annoyed had he fondled a kitten in her presence.\nThe boys were standing about the chaise as Moore entered it; but for them he had no farewell. To Mr. Yorke he only said, \"You have a good riddance of me. That was an unlucky shot for you, Yorke; it turned Briarmains into an hospital. Come and see me at the cottage soon.\"\nHe drew up the glass; the chaise rolled away. In half an hour he alighted at his own garden wicket. Having paid the driver and dismissed the vehicle, he leaned on that wicket an instant, at once to rest and to muse.\n\"Six months ago I passed out at this gate,\" said he, \"a proud, angry, disappointed man. I come back sadder and wiser; weakly enough, but not worried. A cold, gray, yet quiet world lies round--a world where, if I hope little, I fear nothing. All slavish terrors of embarrassment have left me. Let the worst come, I can work, as Joe Scott does, for an honourable living; in such doom I yet see some hardship but no degradation. Formerly, pecuniary ruin was equivalent in my eyes to personal dishonour. It is not so now; I know the difference. Ruin _is_ an evil, but one for which I am prepared; the day of whose coming I know, for I have calculated. I can yet put it off six months--not an hour longer. If things by that time alter, which is not probable; if fetters, which now seem indissoluble, should be loosened from our trade (of all things the most unlikely to happen), I might conquer in this long struggle yet--I might--good God! what might I not do? But the thought is a brief madness; let me see things with sane eyes. Ruin will come, lay her axe to my fortune's roots, and hew them down. I shall snatch a sapling, I shall cross the sea, and plant it in American woods. Louis will go with me. Will none but Louis go? I cannot tell--I have no right to ask.\"\nHe entered the house.\nIt was afternoon, twilight yet out of doors--starless and moonless twilight; for though keenly freezing with a dry, black frost, heaven wore a mask of clouds congealed and fast locked. The mill-dam too was frozen. The Hollow was very still. Indoors it was already dark. Sarah had lit a good fire in the parlour; she was preparing tea in the kitchen.\n\"Hortense,\" said Moore, as his sister bustled up to help him off with his cloak, \"I am pleased to come home.\"\nHortense did not feel the peculiar novelty of this expression coming from her brother, who had never before called the cottage his home, and to whom its narrow limits had always heretofore seemed rather restrictive than protective. Still, whatever contributed to his happiness pleased her, and she expressed herself to that effect.\nHe sat down, but soon rose again. He went to the window; he came back to the fire.\n\"Hortense!\"\n\"Mon frre?\"\n\"This little parlour looks very clean and pleasant--unusually bright, somehow.\"\n\"It is true, brother; I have had the whole house thoroughly and scrupulously cleaned in your absence.\"\n\"Sister, I think on this first day of your return home you ought to have a friend or so to tea, if it were only to see how fresh and spruce you have made the little place.\"\n\"True, brother. If it were not late I might send for Miss Mann.\"\n\"So you might; but it really is too late to disturb that good lady, and the evening is much too cold for her to come out.\"\n\"How thoughtful in you, dear Grard! We must put it off till another day.\"\n\"I want some one to-day, dear sister--some quiet guest, who would tire neither of us.\"\n\"Miss Ainley?\"\n\"An excellent person, they say; but she lives too far off. Tell Harry Scott to step up to the rectory with a request from you that Caroline Helstone should come and spend the evening with you.\"\n\"Would it not be better to-morrow, dear brother?\"\n\"I should like her to see the place as it is just now; its brilliant cleanliness and perfect neatness are so much to your credit.\"\n\"It might benefit her in the way of example.\"\n\"It might and must; she ought to come.\"\nHe went into the kitchen.\n\"Sarah, delay tea half an hour.\" He then commissioned her to dispatch Harry Scott to the rectory, giving her a twisted note hastily scribbled in pencil by himself, and addressed \"Miss Helstone.\"\nScarcely had Sarah time to get impatient under the fear of damage to her toast already prepared when the messenger returned, and with him the invited guest.\nShe entered through the kitchen, quietly tripped up Sarah's stairs to take off her bonnet and furs, and came down as quietly, with her beautiful curls nicely smoothed, her graceful merino dress and delicate collar all trim and spotless, her gay little work-bag in her hand. She lingered to exchange a few kindly words with Sarah, and to look at the new tortoise-shell kitten basking on the kitchen hearth, and to speak to the canary-bird, which a sudden blaze from the fire had startled on its perch; and then she betook herself to the parlour.\nThe gentle salutation, the friendly welcome, were interchanged in such tranquil sort as befitted cousins meeting; a sense of pleasure, subtle and quiet as a perfume, diffused itself through the room; the newly-kindled lamp burnt up bright; the tray and the singing urn were brought in.\n\"I am pleased to come home,\" repeated Mr. Moore.\nThey assembled round the table. Hortense chiefly talked. She congratulated Caroline on the evident improvement in her health. Her colour and her plump cheeks were returning, she remarked. It was true. There was an obvious change in Miss Helstone. All about her seemed elastic; depression, fear, forlornness, were withdrawn. No longer crushed, and saddened, and slow, and drooping, she looked like one who had tasted the cordial of heart's ease, and been lifted on the wing of hope.\nAfter tea Hortense went upstairs. She had not rummaged her drawers for a month past, and the impulse to perform that operation was now become resistless. During her absence the talk passed into Caroline's hands. She took it up with ease; she fell into her best tone of conversation. A pleasing facility and elegance of language gave fresh charm to familiar topics; a new music in the always soft voice gently surprised and pleasingly captivated the listener; unwonted shades and lights of expression elevated the young countenance with character, and kindled it with animation.\n\"Caroline, you look as if you had heard good tidings,\" said Moore, after earnestly gazing at her for some minutes.\n\"Do I?\"\n\"I sent for you this evening that I might be cheered; but you cheer me more than I had calculated.\"\n\"I am glad of that. And I _really_ cheer you?\"\n\"You look brightly, move buoyantly, speak musically.\"\n\"It is pleasant to be here again.\"\n\"Truly it is pleasant; I feel it so. And to see health on your cheek and hope in your eye is pleasant, Cary; but what is this hope, and what is the source of this sunshine I perceive about you?\"\n\"For one thing, I am happy in mamma. I love her so much, and she loves me. Long and tenderly she nursed me. Now, when her care has made me well, I can occupy myself for and with her all the day. I say it is my turn to attend to her; and I _do_ attend to her. I am her waiting-woman as well as her child. I like--you would laugh if you knew what pleasure I have in making dresses and sewing for her. She looks so nice now, Robert; I will not let her be old-fashioned. And then, she is charming to talk to--full of wisdom, ripe in judgment, rich in information, exhaustless in stores her observant faculties have quietly amassed. Every day that I live with her I like her better, I esteem her more highly, I love her more tenderly.\"\n\"_That_ for one thing, then, Cary. You talk in such a way about 'mamma' it is enough to make one jealous of the old lady.\"\n\"She is not old, Robert.\"\n\"Of the young lady, then.\"\n\"She does not pretend to be young.\"\n\"Well, of the matron. But you said 'mamma's' affection was _one_ thing that made you happy; now for the other thing.\"\n\"I am glad you are better.\"\n\"What besides?\"\n\"I am glad we are friends.\"\n\"You and I?\"\n\"Yes. I once thought we never should be.\"\n\"Cary, some day I mean to tell you a thing about myself that is not to my credit, and consequently will not please you.\"\n\"Ah, don't! I cannot bear to think ill of you.\"\n\"And I cannot bear that you should think better of me than I deserve.\"\n\"Well, but I half know your 'thing;' indeed, I believe I know all about it.\"\n\"You do not.\"\n\"I believe I do.\"\n\"Whom does it concern besides me?\"\nShe coloured; she hesitated; she was silent.\n\"Speak, Cary! Whom does it concern?\"\nShe tried to utter a name, and could not.\n\"Tell me; there is none present but ourselves. Be frank.\"\n\"But if I guess wrong?\"\n\"I will forgive. Whisper, Cary.\"\nHe bent his ear to her lips. Still she would not, or could not, speak clearly to the point. Seeing that Moore waited and was resolved to hear something, she at last said, \"Miss Keeldar spent a day at the rectory about a week since. The evening came on very wintry, and we persuaded her to stay all night.\"\n\"And you and she curled your hair together?\"\n\"How do you know that?\"\n\"And then you chattered, and she told you----\"\n\"It was not at curling-hair time, so you are not as wise as you think; and, besides, she didn't tell me.\"\n\"You slept together afterwards?\"\n\"We occupied the same room and bed. We did not sleep much; we talked the whole night through.\"\n\"I'll be sworn you did! And then it all came out--_tant pis_. I would rather you had heard it from myself.\"\n\"You are quite wrong. She did not tell me what you suspect--she is not the person to proclaim such things; but yet I inferred something from parts of her discourse. I gathered more from rumour, and I made out the rest by instinct.\"\n\"But if she did not tell you that I wanted to marry her for the sake of her money, and that she refused me indignantly and scornfully (you need neither start nor blush; nor yet need you prick your trembling fingers with your needle. That is the plain truth, whether you like it or not)--if such was not the subject of her august confidences, on what point did they turn? You say you talked the whole night through; what about?\"\n\"About things we never thoroughly discussed before, intimate friends as we have been; but you hardly expect I should tell you?\"\n\"Yes, yes, Cary; you will tell me. You said we were friends, and friends should always confide in each other.\"\n\"But you are sure you won't repeat it?\"\n\"Quite sure.\"\n\"Not to Louis?\"\n\"Not even to Louis. What does Louis care for young ladies' secrets?\"\n\"Robert, Shirley is a curious, magnanimous being.\"\n\"I dare say. I can imagine there are both odd points and grand points about her.\"\n\"I have found her chary in showing her feelings; but when they rush out, river-like, and pass full and powerful before you--almost without leave from her--you gaze, wonder; you admire, and--I think--love her.\"\n\"You saw this spectacle?\"\n\"Yes; at dead of night, when all the house was silent, and starlight and the cold reflection from the snow glimmered in our chamber, then I saw Shirley's heart.\"\n\"Her heart's core? Do you think she showed you that?\"\n\"Her heart's core.\"\n\"And how was it?\"\n\"Like a shrine, for it was holy; like snow, for it was pure; like flame, for it was warm; like death, for it was strong.\"\n\"Can she love? tell me that.\"\n\"What think you?\"\n\"She has loved none that have loved her yet.\"\n\"Who are those that have loved her?\"\nHe named a list of gentlemen, closing with Sir Philip Nunnely.\n\"She has loved none of these.\"\n\"Yet some of them were worthy of a woman's affection.\"\n\"Of some women's, but not of Shirley's.\"\n\"Is she better than others of her sex?\"\n\"She is peculiar, and more dangerous to take as a wife--rashly.\"\n\"I can imagine that.\"\n\"She spoke of you----\"\n\"Oh, she did! I thought you denied it.\"\n\"She did not speak in the way you fancy; but I asked her, and I would make her tell me what she thought of you, or rather how she felt towards you. I wanted to know; I had long wanted to know.\"\n\"So had I; but let us hear. She thinks meanly, she feels contemptuously, doubtless?\"\n\"She thinks of you almost as highly as a woman can think of a man. You know she can be eloquent. I yet feel in fancy the glow of the language in which her opinion was conveyed.\"\n\"But how does she feel?\"\n\"Till you shocked her (she said you had shocked her, but she would not tell me how) she felt as a sister feels towards a brother of whom she is at once fond and proud.\"\n\"I'll shock her no more, Cary, for the shock rebounded on myself till I staggered again. But that comparison about sister and brother is all nonsense. She is too rich and proud to entertain fraternal sentiments for me.\"\n\"You don't know her, Robert; and, somehow, I fancy now (I had other ideas formerly) that you cannot know her. You and she are not so constructed as to be able thoroughly to understand each other.\"\n\"It may be so. I esteem her, I admire her; and yet my impressions concerning her are harsh--perhaps uncharitable. I believe, for instance, that she is incapable of love----\"\n\"Shirley incapable of love!\"\n\"That she will never marry. I imagine her jealous of compromising her pride, of relinquishing her power, of sharing her property.\"\n\"Shirley has hurt your _amour propre_.\"\n\"She did hurt it; though I had not an emotion of tenderness, nor a spark of passion for her.\"\n\"Then, Robert, it was very wicked in you to want to marry her.\"\n\"And very mean, my little pastor, my pretty priestess. I never wanted to kiss Miss Keeldar in my life, though she has fine lips, scarlet and round as ripe cherries; or, if I did wish it, it was the mere desire of the eye.\"\n\"I doubt, now, whether you are speaking the truth. The grapes or the cherries are sour--'hung too high.'\"\n\"She has a pretty figure, a pretty face, beautiful hair. I acknowledge all her charms and feel none of them, or only feel them in a way she would disdain. I suppose I was truly tempted by the mere gilding of the bait. Caroline, what a noble fellow your Robert is--great, good, disinterested, and then so pure!\"\n\"But not perfect. He made a great blunder once, and we will hear no more about it.\"\n\"And shall we think no more about it, Cary? Shall we not despise him in our heart--gentle but just, compassionate but upright?\"\n\"Never! We will remember that with what measure we mete it shall be measured unto us, and so we will give no scorn, only affection.\"\n\"Which won't satisfy, I warn you of that. Something besides affection--something far stronger, sweeter, warmer--will be demanded one day. Is it there to give?\"\nCaroline was moved, much moved.\n\"Be calm, Lina,\" said Moore soothingly. \"I have no intention, because I have no right, to perturb your mind now, nor for months to come. Don't look as if you would leave me. We will make no more agitating allusions; we will resume our gossip. Do not tremble; look me in the face. See what a poor, pale, grim phantom I am--more pitiable than formidable.\"\nShe looked shyly. \"There is something formidable still, pale as you are,\" she said, as her eye fell under his.\n\"To return to Shirley,\" pursued Moore: \"is it your opinion that she is ever likely to marry?\"\n\"She loves.\"\n\"Platonically--theoretically--all humbug!\"\n\"She loves what I call sincerely.\"\n\"Did she say so?\"\n\"I cannot affirm that she said so. No such confession as 'I love this man or that' passed her lips.\"\n\"I thought not.\"\n\"But the feeling made its way in spite of her, and I saw it. She spoke of one man in a strain not to be misunderstood. Her voice alone was sufficient testimony. Having wrung from her an opinion on your character, I demanded a second opinion of--another person about whom I had my conjectures, though they were the most tangled and puzzled conjectures in the world. I would _make_ her speak. I shook her, I chid her, I pinched her fingers when she tried to put me off with gibes and jests in her queer provoking way, and at last out it came. The voice, I say, was enough; hardly raised above a whisper, and yet such a soft vehemence in its tones. There was no confession, no confidence, in the matter. To these things she cannot condescend; but I am sure that man's happiness is dear to her as her own life.\"\n\"Who is it?\"\n\"I charged her with the fact. She did not deny, she did not avow, but looked at me. I saw her eyes by the snow-gleam. It was quite enough. I triumphed over her mercilessly.\"\n\"What right had _you_ to triumph? Do you mean to say _you_ are fancy free?\"\n\"Whatever _I_ am, Shirley is a bondswoman. Lioness, she has found her captor. Mistress she may be of all round her, but her own mistress she is not.\"\n\"So you exulted at recognizing a fellow-slave in one so fair and imperial?\"\n\"I did; Robert, you say right, in one so fair and imperial.\"\n\"You confess it--a _fellow_-slave?\"\n\"I confess nothing; but I say that haughty Shirley is no more free than was Hagar.\"\n\"And who, pray, is the Abraham, the hero of a patriarch who has achieved such a conquest?\"\n\"You still speak scornfully, and cynically, and sorely; but I will make you change your note before I have done with you.\"\n\"We will see that. Can she marry this Cupidon?\"\n\"Cupidon! he is just about as much a Cupidon as you are a Cyclops.\"\n\"Can she marry him?\"\n\"You will see.\"\n\"I want to know his name, Cary.\"\n\"Guess it.\"\n\"Is it any one in this neighbourhood?\"\n\"Yes, in Briarfield parish.\"\n\"Then it is some person unworthy of her. I don't know a soul in Briarfield parish her equal.\"\n\"Guess.\"\n\"Impossible. I suppose she is under a delusion, and will plunge into some absurdity, after all.\"\nCaroline smiled.\n\"Do _you_ approve the choice?\" asked Moore.\n\"Quite, _quite_.\"\n\"Then I _am_ puzzled; for the head which owns this bounteous fall of hazel curls is an excellent little thinking machine, most accurate in its working. It boasts a correct, steady judgment, inherited from 'mamma,' I suppose.\"\n\"And I _quite_ approve, and mamma was charmed.\"\n\"'Mamma' charmed--Mrs. Pryor! It can't be romantic, then?\"\n\"It _is_ romantic, but it is also right.\"\n\"Tell me, Cary--tell me out of pity; I am too weak to be tantalized.\"\n\"You shall be tantalized--it will do you no harm; you are not so weak as you pretend.\"\n\"I have twice this evening had some thoughts of falling on the floor at your feet.\"\n\"You had better not. I shall decline to help you up.\"\n\"And worshipping you downright. My mother was a Roman Catholic. You look like the loveliest of her pictures of the Virgin. I think I will embrace her faith and kneel and adore.\"\n\"Robert, Robert, sit still; don't be absurd. I will go to Hortense if you commit extravagances.\"\n\"You have stolen my senses. Just now nothing will come into my mind but _les litanies de la sainte Virge. Rose cleste, reine des anges_!\"\n\"_Tour d'ivoire, maison d'or_--is not that the jargon? Well, sit down quietly, and guess your riddle.\"\n\"But 'mamma' charmed--there's the puzzle.\"\n\"I'll tell you what mamma said when I told her. 'Depend upon it, my dear, such a choice will make the happiness of Miss Keeldar's life.'\"\n\"I'll guess once, and no more. It is old Helstone. She is going to be your aunt.\"\n\"I'll tell my uncle; I'll tell Shirley!\" cried Caroline, laughing gleefully. \"Guess again, Robert; your blunders are charming.\"\n\"It is the parson--Hall.\"\n\"Indeed, no; he is mine, if you please.\"\n\"Yours! Ay, the whole generation of women in Briarfield seem to have made an idol of that priest. I wonder why; he is bald, sand-blind, gray-haired.\"\n\"Fanny will be here to fetch me before you have solved the riddle, if you don't make haste.\"\n\"I'll guess no more--I am tired; and then I don't care. Miss Keeldar may marry _le grand Turc_ for me.\"\n\"Must I whisper?\"\n\"That you must, and quickly. Here comes Hortense; come near, a little nearer, my own Lina. I care for the whisper more than the words.\"\nShe whispered. Robert gave a start, a flash of the eye, a brief laugh. Miss Moore entered, and Sarah followed behind, with information that Fanny was come. The hour of converse was over.\nRobert found a moment to exchange a few more whispered sentences. He was waiting at the foot of the staircase as Caroline descended after putting on her shawl.\n\"Must I call Shirley a noble creature now?\" he asked.\n\"If you wish to speak the truth, certainly.\"\n\"Must I forgive her?\"\n\"Forgive her? Naughty Robert! Was she in the wrong, or were you?\"\n\"Must I at length love her downright, Cary?\"\nCaroline looked keenly up, and made a movement towards him, something between the loving and the petulant.\n\"Only give the word, and I'll try to obey you.\"\n\"Indeed, you must not love her; the bare idea is perverse.\"\n\"But then she is handsome, peculiarly handsome. Hers is a beauty that grows on you. You think her but graceful when you first see her; you discover her to be beautiful when you have known her for a year.\"\n\"It is not you who are to say these things. Now, Robert, be good.\"\n\"O Cary, I have no love to give. Were the goddess of beauty to woo me, I could not meet her advances. There is no heart which I can call mine in this breast.\"\n\"So much the better; you are a great deal safer without. Good-night.\"\n\"Why must you always go, Lina, at the very instant when I most want you to stay?\"\n\"Because you most wish to retain when you are most certain to lose.\"\n\"Listen; one other word. Take care of your own heart--do you hear me?\"\n\"There is no danger.\"\n\"I am not convinced of that. The Platonic parson, for instance.\"\n\"Who--Malone?\"\n\"Cyril Hall. I owe more than one twinge of jealousy to that quarter.\"\n\"As to you, you have been flirting with Miss Mann. She showed me the other day a plant you had given her.--Fanny, I am ready.\"",
        "paragraph_chars": [
            [
                0,
                1537
            ],
            [
                1537,
                2065
            ],
            [
                2065,
                2247
            ],
            [
                2247,
                2403
            ],
            [
                2403,
                2507
            ],
            [
                2507,
                2600
            ],
            [
                2600,
                2665
            ],
            [
                2665,
                2852
            ],
            [
                2852,
                2915
            ],
            [
                2915,
                3215
            ],
            [
                3215,
                3487
            ],
            [
                3487,
                3703
            ],
            [
                3703,
                4968
            ],
            [
                4968,
                4990
            ],
            [
                4990,
                5340
            ],
            [
                5340,
                5450
            ],
            [
                5450,
                5782
            ],
            [
                5782,
                5865
            ],
            [
                5865,
                5877
            ],
            [
                5877,
                5889
            ],
            [
                5889,
                5969
            ],
            [
                5969,
                6072
            ],
            [
                6072,
                6245
            ],
            [
                6245,
                6310
            ],
            [
                6310,
                6433
            ],
            [
                6433,
                6507
            ],
            [
                6507,
                6594
            ],
            [
                6594,
                6609
            ],
            [
                6609,
                6803
            ],
            [
                6803,
                6853
            ],
            [
                6853,
                6984
            ],
            [
                6984,
                7030
            ],
            [
                7030,
                7070
            ],
            [
                7070,
                7096
            ],
            [
                7096,
                7291
            ],
            [
                7291,
                7448
            ],
            [
                7448,
                7993
            ],
            [
                7993,
                8279
            ],
            [
                8279,
                8328
            ],
            [
                8328,
                8810
            ],
            [
                8810,
                9388
            ],
            [
                9388,
                9503
            ],
            [
                9503,
                9511
            ],
            [
                9511,
                9611
            ],
            [
                9611,
                9658
            ],
            [
                9658,
                9712
            ],
            [
                9712,
                9747
            ],
            [
                9747,
                9942
            ],
            [
                9942,
                10673
            ],
            [
                10673,
                10796
            ],
            [
                10796,
                10822
            ],
            [
                10822,
                10849
            ],
            [
                10849,
                10885
            ],
            [
                10885,
                11003
            ],
            [
                11003,
                11031
            ],
            [
                11031,
                11047
            ],
            [
                11047,
                11075
            ],
            [
                11075,
                11088
            ],
            [
                11088,
                11130
            ],
            [
                11130,
                11251
            ],
            [
                11251,
                11299
            ],
            [
                11299,
                11370
            ],
            [
                11370,
                11447
            ],
            [
                11447,
                11461
            ],
            [
                11461,
                11479
            ],
            [
                11479,
                11514
            ],
            [
                11514,
                11559
            ],
            [
                11559,
                11596
            ],
            [
                11596,
                11638
            ],
            [
                11638,
                11696
            ],
            [
                11696,
                11720
            ],
            [
                11720,
                11753
            ],
            [
                11753,
                12059
            ],
            [
                12059,
                12104
            ],
            [
                12104,
                12128
            ],
            [
                12128,
                12175
            ],
            [
                12175,
                12281
            ],
            [
                12281,
                12314
            ],
            [
                12314,
                12409
            ],
            [
                12409,
                12517
            ],
            [
                12517,
                12749
            ],
            [
                12749,
                13177
            ],
            [
                13177,
                13305
            ],
            [
                13305,
                13416
            ],
            [
                13416,
                13456
            ],
            [
                13456,
                13470
            ],
            [
                13470,
                13486
            ],
            [
                13486,
                13555
            ],
            [
                13555,
                13606
            ],
            [
                13606,
                13688
            ],
            [
                13688,
                13898
            ],
            [
                13898,
                13924
            ],
            [
                13924,
                14086
            ],
            [
                14086,
                14140
            ],
            [
                14140,
                14160
            ],
            [
                14160,
                14178
            ],
            [
                14178,
                14300
            ],
            [
                14300,
                14330
            ],
            [
                14330,
                14348
            ],
            [
                14348,
                14394
            ],
            [
                14394,
                14431
            ],
            [
                14431,
                14494
            ],
            [
                14494,
                14525
            ],
            [
                14525,
                14580
            ],
            [
                14580,
                14621
            ],
            [
                14621,
                14661
            ],
            [
                14661,
                14726
            ],
            [
                14726,
                14748
            ],
            [
                14748,
                14771
            ],
            [
                14771,
                14811
            ],
            [
                14811,
                15005
            ],
            [
                15005,
                15090
            ],
            [
                15090,
                15268
            ],
            [
                15268,
                15293
            ],
            [
                15293,
                15462
            ],
            [
                15462,
                15682
            ],
            [
                15682,
                15879
            ],
            [
                15879,
                16053
            ],
            [
                16053,
                16082
            ],
            [
                16082,
                16213
            ],
            [
                16213,
                16253
            ],
            [
                16253,
                16347
            ],
            [
                16347,
                16411
            ],
            [
                16411,
                16634
            ],
            [
                16634,
                16740
            ],
            [
                16740,
                17051
            ],
            [
                17051,
                17135
            ],
            [
                17135,
                17263
            ],
            [
                17263,
                17396
            ],
            [
                17396,
                17556
            ],
            [
                17556,
                17588
            ],
            [
                17588,
                17942
            ],
            [
                17942,
                18053
            ],
            [
                18053,
                18147
            ],
            [
                18147,
                18160
            ],
            [
                18160,
                18203
            ],
            [
                18203,
                18238
            ],
            [
                18238,
                18256
            ],
            [
                18256,
                18357
            ],
            [
                18357,
                18374
            ],
            [
                18374,
                19182
            ],
            [
                19182,
                19195
            ],
            [
                19195,
                19369
            ],
            [
                19369,
                19445
            ],
            [
                19445,
                19595
            ],
            [
                19595,
                19671
            ],
            [
                19671,
                19732
            ],
            [
                19732,
                19768
            ],
            [
                19768,
                19852
            ],
            [
                19852,
                19943
            ],
            [
                19943,
                20066
            ],
            [
                20066,
                20114
            ],
            [
                20114,
                20182
            ],
            [
                20182,
                20203
            ],
            [
                20203,
                20219
            ],
            [
                20219,
                20252
            ],
            [
                20252,
                20264
            ],
            [
                20264,
                20303
            ],
            [
                20303,
                20332
            ],
            [
                20332,
                20426
            ],
            [
                20426,
                20435
            ],
            [
                20435,
                20532
            ],
            [
                20532,
                20549
            ],
            [
                20549,
                20593
            ],
            [
                20593,
                20611
            ],
            [
                20611,
                20837
            ],
            [
                20837,
                20885
            ],
            [
                20885,
                20944
            ],
            [
                20944,
                20986
            ],
            [
                20986,
                21056
            ],
            [
                21056,
                21143
            ],
            [
                21143,
                21227
            ],
            [
                21227,
                21281
            ],
            [
                21281,
                21459
            ],
            [
                21459,
                21556
            ],
            [
                21556,
                21694
            ],
            [
                21694,
                21797
            ],
            [
                21797,
                21840
            ],
            [
                21840,
                21978
            ],
            [
                21978,
                22060
            ],
            [
                22060,
                22188
            ],
            [
                22188,
                22214
            ],
            [
                22214,
                22255
            ],
            [
                22255,
                22405
            ],
            [
                22405,
                22498
            ],
            [
                22498,
                22602
            ],
            [
                22602,
                22620
            ],
            [
                22620,
                22756
            ],
            [
                22756,
                22943
            ],
            [
                22943,
                23103
            ],
            [
                23103,
                23157
            ],
            [
                23157,
                23202
            ],
            [
                23202,
                23224
            ],
            [
                23224,
                23290
            ],
            [
                23290,
                23335
            ],
            [
                23335,
                23442
            ],
            [
                23442,
                23490
            ],
            [
                23490,
                23550
            ],
            [
                23550,
                23755
            ],
            [
                23755,
                23822
            ],
            [
                23822,
                23981
            ],
            [
                23981,
                24051
            ],
            [
                24051,
                24133
            ],
            [
                24133,
                24202
            ],
            [
                24202,
                24273
            ],
            [
                24273,
                24295
            ],
            [
                24295,
                24360
            ],
            [
                24360,
                24375
            ],
            [
                24375,
                24445
            ],
            [
                24445,
                24571
            ]
        ],
        "segment_chars": [
            [
                0,
                25
            ],
            [
                25,
                99
            ],
            [
                99,
                290
            ],
            [
                290,
                426
            ],
            [
                426,
                507
            ],
            [
                507,
                569
            ],
            [
                569,
                640
            ],
            [
                640,
                720
            ],
            [
                720,
                756
            ],
            [
                756,
                854
            ],
            [
                854,
                983
            ],
            [
                983,
                1059
            ],
            [
                1059,
                1114
            ],
            [
                1114,
                1195
            ],
            [
                1195,
                1204
            ],
            [
                1204,
                1276
            ],
            [
                1276,
                1366
            ],
            [
                1366,
                1479
            ],
            [
                1479,
                1537
            ],
            [
                1537,
                1607
            ],
            [
                1607,
                1701
            ],
            [
                1701,
                1828
            ],
            [
                1828,
                1925
            ],
            [
                1925,
                2065
            ],
            [
                2065,
                2077
            ],
            [
                2077,
                2134
            ],
            [
                2134,
                2247
            ],
            [
                2247,
                2289
            ],
            [
                2289,
                2300
            ],
            [
                2300,
                2403
            ],
            [
                2403,
                2415
            ],
            [
                2415,
                2507
            ],
            [
                2507,
                2584
            ],
            [
                2584,
                2600
            ],
            [
                2600,
                2652
            ],
            [
                2652,
                2665
            ],
            [
                2665,
                2716
            ],
            [
                2716,
                2732
            ],
            [
                2732,
                2783
            ],
            [
                2783,
                2852
            ],
            [
                2852,
                2864
            ],
            [
                2864,
                2915
            ],
            [
                2915,
                2983
            ],
            [
                2983,
                3048
            ],
            [
                3048,
                3146
            ],
            [
                3146,
                3215
            ],
            [
                3215,
                3309
            ],
            [
                3309,
                3369
            ],
            [
                3369,
                3449
            ],
            [
                3449,
                3487
            ],
            [
                3487,
                3533
            ],
            [
                3533,
                3587
            ],
            [
                3587,
                3703
            ],
            [
                3703,
                3791
            ],
            [
                3791,
                3853
            ],
            [
                3853,
                3944
            ],
            [
                3944,
                3995
            ],
            [
                3995,
                4129
            ],
            [
                4129,
                4203
            ],
            [
                4203,
                4244
            ],
            [
                4244,
                4351
            ],
            [
                4351,
                4404
            ],
            [
                4404,
                4639
            ],
            [
                4639,
                4660
            ],
            [
                4660,
                4730
            ],
            [
                4730,
                4800
            ],
            [
                4800,
                4881
            ],
            [
                4881,
                4904
            ],
            [
                4904,
                4928
            ],
            [
                4928,
                4968
            ],
            [
                4968,
                4990
            ],
            [
                4990,
                5175
            ],
            [
                5175,
                5204
            ],
            [
                5204,
                5231
            ],
            [
                5231,
                5260
            ],
            [
                5260,
                5340
            ],
            [
                5340,
                5450
            ],
            [
                5450,
                5682
            ],
            [
                5682,
                5782
            ],
            [
                5782,
                5816
            ],
            [
                5816,
                5865
            ],
            [
                5865,
                5877
            ],
            [
                5877,
                5889
            ],
            [
                5889,
                5969
            ],
            [
                5969,
                6072
            ],
            [
                6072,
                6245
            ],
            [
                6245,
                6261
            ],
            [
                6261,
                6310
            ],
            [
                6310,
                6433
            ],
            [
                6433,
                6469
            ],
            [
                6469,
                6507
            ],
            [
                6507,
                6594
            ],
            [
                6594,
                6609
            ],
            [
                6609,
                6668
            ],
            [
                6668,
                6803
            ],
            [
                6803,
                6853
            ],
            [
                6853,
                6984
            ],
            [
                6984,
                7030
            ],
            [
                7030,
                7070
            ],
            [
                7070,
                7096
            ],
            [
                7096,
                7129
            ],
            [
                7129,
                7291
            ],
            [
                7291,
                7448
            ],
            [
                7448,
                7722
            ],
            [
                7722,
                7993
            ],
            [
                7993,
                8279
            ],
            [
                8279,
                8328
            ],
            [
                8328,
                8360
            ],
            [
                8360,
                8385
            ],
            [
                8385,
                8454
            ],
            [
                8454,
                8516
            ],
            [
                8516,
                8529
            ],
            [
                8529,
                8575
            ],
            [
                8575,
                8652
            ],
            [
                8652,
                8810
            ],
            [
                8810,
                8844
            ],
            [
                8844,
                8964
            ],
            [
                8964,
                9022
            ],
            [
                9022,
                9093
            ],
            [
                9093,
                9388
            ],
            [
                9388,
                9503
            ],
            [
                9503,
                9511
            ],
            [
                9511,
                9611
            ],
            [
                9611,
                9631
            ],
            [
                9631,
                9658
            ],
            [
                9658,
                9712
            ],
            [
                9712,
                9747
            ],
            [
                9747,
                9784
            ],
            [
                9784,
                9942
            ],
            [
                9942,
                9979
            ],
            [
                9979,
                10017
            ],
            [
                10017,
                10050
            ],
            [
                10050,
                10137
            ],
            [
                10137,
                10201
            ],
            [
                10201,
                10246
            ],
            [
                10246,
                10341
            ],
            [
                10341,
                10409
            ],
            [
                10409,
                10570
            ],
            [
                10570,
                10673
            ],
            [
                10673,
                10708
            ],
            [
                10708,
                10796
            ],
            [
                10796,
                10822
            ],
            [
                10822,
                10849
            ],
            [
                10849,
                10885
            ],
            [
                10885,
                10907
            ],
            [
                10907,
                11003
            ],
            [
                11003,
                11031
            ],
            [
                11031,
                11047
            ],
            [
                11047,
                11075
            ],
            [
                11075,
                11088
            ],
            [
                11088,
                11094
            ],
            [
                11094,
                11130
            ],
            [
                11130,
                11251
            ],
            [
                11251,
                11263
            ],
            [
                11263,
                11299
            ],
            [
                11299,
                11370
            ],
            [
                11370,
                11447
            ],
            [
                11447,
                11461
            ],
            [
                11461,
                11479
            ],
            [
                11479,
                11514
            ],
            [
                11514,
                11559
            ],
            [
                11559,
                11573
            ],
            [
                11573,
                11596
            ],
            [
                11596,
                11638
            ],
            [
                11638,
                11685
            ],
            [
                11685,
                11696
            ],
            [
                11696,
                11720
            ],
            [
                11720,
                11737
            ],
            [
                11737,
                11753
            ],
            [
                11753,
                11782
            ],
            [
                11782,
                11845
            ],
            [
                11845,
                11985
            ],
            [
                11985,
                12059
            ],
            [
                12059,
                12104
            ],
            [
                12104,
                12128
            ],
            [
                12128,
                12175
            ],
            [
                12175,
                12281
            ],
            [
                12281,
                12314
            ],
            [
                12314,
                12350
            ],
            [
                12350,
                12409
            ],
            [
                12409,
                12433
            ],
            [
                12433,
                12471
            ],
            [
                12471,
                12517
            ],
            [
                12517,
                12539
            ],
            [
                12539,
                12682
            ],
            [
                12682,
                12749
            ],
            [
                12749,
                12982
            ],
            [
                12982,
                13120
            ],
            [
                13120,
                13177
            ],
            [
                13177,
                13305
            ],
            [
                13305,
                13340
            ],
            [
                13340,
                13416
            ],
            [
                13416,
                13456
            ],
            [
                13456,
                13470
            ],
            [
                13470,
                13486
            ],
            [
                13486,
                13506
            ],
            [
                13506,
                13555
            ],
            [
                13555,
                13606
            ],
            [
                13606,
                13619
            ],
            [
                13619,
                13688
            ],
            [
                13688,
                13898
            ],
            [
                13898,
                13924
            ],
            [
                13924,
                14086
            ],
            [
                14086,
                14105
            ],
            [
                14105,
                14140
            ],
            [
                14140,
                14160
            ],
            [
                14160,
                14178
            ],
            [
                14178,
                14300
            ],
            [
                14300,
                14315
            ],
            [
                14315,
                14330
            ],
            [
                14330,
                14348
            ],
            [
                14348,
                14394
            ],
            [
                14394,
                14431
            ],
            [
                14431,
                14494
            ],
            [
                14494,
                14525
            ],
            [
                14525,
                14580
            ],
            [
                14580,
                14621
            ],
            [
                14621,
                14661
            ],
            [
                14661,
                14726
            ],
            [
                14726,
                14748
            ],
            [
                14748,
                14771
            ],
            [
                14771,
                14785
            ],
            [
                14785,
                14811
            ],
            [
                14811,
                14959
            ],
            [
                14959,
                15005
            ],
            [
                15005,
                15033
            ],
            [
                15033,
                15090
            ],
            [
                15090,
                15157
            ],
            [
                15157,
                15187
            ],
            [
                15187,
                15268
            ],
            [
                15268,
                15293
            ],
            [
                15293,
                15462
            ],
            [
                15462,
                15551
            ],
            [
                15551,
                15613
            ],
            [
                15613,
                15682
            ],
            [
                15682,
                15792
            ],
            [
                15792,
                15879
            ],
            [
                15879,
                15894
            ],
            [
                15894,
                15993
            ],
            [
                15993,
                16053
            ],
            [
                16053,
                16082
            ],
            [
                16082,
                16110
            ],
            [
                16110,
                16213
            ],
            [
                16213,
                16253
            ],
            [
                16253,
                16347
            ],
            [
                16347,
                16411
            ],
            [
                16411,
                16466
            ],
            [
                16466,
                16634
            ],
            [
                16634,
                16685
            ],
            [
                16685,
                16740
            ],
            [
                16740,
                16797
            ],
            [
                16797,
                16895
            ],
            [
                16895,
                16958
            ],
            [
                16958,
                17051
            ],
            [
                17051,
                17069
            ],
            [
                17069,
                17135
            ],
            [
                17135,
                17179
            ],
            [
                17179,
                17263
            ],
            [
                17263,
                17271
            ],
            [
                17271,
                17396
            ],
            [
                17396,
                17438
            ],
            [
                17438,
                17534
            ],
            [
                17534,
                17556
            ],
            [
                17556,
                17588
            ],
            [
                17588,
                17628
            ],
            [
                17628,
                17725
            ],
            [
                17725,
                17762
            ],
            [
                17762,
                17831
            ],
            [
                17831,
                17868
            ],
            [
                17868,
                17942
            ],
            [
                17942,
                17960
            ],
            [
                17960,
                18053
            ],
            [
                18053,
                18147
            ],
            [
                18147,
                18160
            ],
            [
                18160,
                18203
            ],
            [
                18203,
                18238
            ],
            [
                18238,
                18256
            ],
            [
                18256,
                18291
            ],
            [
                18291,
                18357
            ],
            [
                18357,
                18374
            ],
            [
                18374,
                18435
            ],
            [
                18435,
                18493
            ],
            [
                18493,
                18535
            ],
            [
                18535,
                18739
            ],
            [
                18739,
                18765
            ],
            [
                18765,
                18915
            ],
            [
                18915,
                19020
            ],
            [
                19020,
                19075
            ],
            [
                19075,
                19182
            ],
            [
                19182,
                19195
            ],
            [
                19195,
                19225
            ],
            [
                19225,
                19279
            ],
            [
                19279,
                19313
            ],
            [
                19313,
                19334
            ],
            [
                19334,
                19369
            ],
            [
                19369,
                19403
            ],
            [
                19403,
                19445
            ],
            [
                19445,
                19488
            ],
            [
                19488,
                19523
            ],
            [
                19523,
                19595
            ],
            [
                19595,
                19671
            ],
            [
                19671,
                19732
            ],
            [
                19732,
                19768
            ],
            [
                19768,
                19852
            ],
            [
                19852,
                19943
            ],
            [
                19943,
                20066
            ],
            [
                20066,
                20085
            ],
            [
                20085,
                20114
            ],
            [
                20114,
                20124
            ],
            [
                20124,
                20182
            ],
            [
                20182,
                20203
            ],
            [
                20203,
                20219
            ],
            [
                20219,
                20252
            ],
            [
                20252,
                20264
            ],
            [
                20264,
                20303
            ],
            [
                20303,
                20332
            ],
            [
                20332,
                20373
            ],
            [
                20373,
                20426
            ],
            [
                20426,
                20435
            ],
            [
                20435,
                20448
            ],
            [
                20448,
                20532
            ],
            [
                20532,
                20549
            ],
            [
                20549,
                20580
            ],
            [
                20580,
                20593
            ],
            [
                20593,
                20611
            ],
            [
                20611,
                20763
            ],
            [
                20763,
                20837
            ],
            [
                20837,
                20885
            ],
            [
                20885,
                20915
            ],
            [
                20915,
                20944
            ],
            [
                20944,
                20986
            ],
            [
                20986,
                21056
            ],
            [
                21056,
                21143
            ],
            [
                21143,
                21227
            ],
            [
                21227,
                21248
            ],
            [
                21248,
                21281
            ],
            [
                21281,
                21313
            ],
            [
                21313,
                21345
            ],
            [
                21345,
                21404
            ],
            [
                21404,
                21459
            ],
            [
                21459,
                21504
            ],
            [
                21504,
                21556
            ],
            [
                21556,
                21584
            ],
            [
                21584,
                21662
            ],
            [
                21662,
                21694
            ],
            [
                21694,
                21749
            ],
            [
                21749,
                21797
            ],
            [
                21797,
                21840
            ],
            [
                21840,
                21888
            ],
            [
                21888,
                21978
            ],
            [
                21978,
                22009
            ],
            [
                22009,
                22029
            ],
            [
                22029,
                22060
            ],
            [
                22060,
                22101
            ],
            [
                22101,
                22137
            ],
            [
                22137,
                22188
            ],
            [
                22188,
                22214
            ],
            [
                22214,
                22255
            ],
            [
                22255,
                22263
            ],
            [
                22263,
                22353
            ],
            [
                22353,
                22405
            ],
            [
                22405,
                22498
            ],
            [
                22498,
                22554
            ],
            [
                22554,
                22602
            ],
            [
                22602,
                22620
            ],
            [
                22620,
                22649
            ],
            [
                22649,
                22711
            ],
            [
                22711,
                22756
            ],
            [
                22756,
                22771
            ],
            [
                22771,
                22827
            ],
            [
                22827,
                22912
            ],
            [
                22912,
                22943
            ],
            [
                22943,
                23009
            ],
            [
                23009,
                23103
            ],
            [
                23103,
                23147
            ],
            [
                23147,
                23157
            ],
            [
                23157,
                23202
            ],
            [
                23202,
                23224
            ],
            [
                23224,
                23238
            ],
            [
                23238,
                23254
            ],
            [
                23254,
                23290
            ],
            [
                23290,
                23335
            ],
            [
                23335,
                23442
            ],
            [
                23442,
                23490
            ],
            [
                23490,
                23550
            ],
            [
                23550,
                23598
            ],
            [
                23598,
                23634
            ],
            [
                23634,
                23755
            ],
            [
                23755,
                23799
            ],
            [
                23799,
                23822
            ],
            [
                23822,
                23855
            ],
            [
                23855,
                23924
            ],
            [
                23924,
                23981
            ],
            [
                23981,
                24038
            ],
            [
                24038,
                24051
            ],
            [
                24051,
                24133
            ],
            [
                24133,
                24202
            ],
            [
                24202,
                24227
            ],
            [
                24227,
                24273
            ],
            [
                24273,
                24295
            ],
            [
                24295,
                24324
            ],
            [
                24324,
                24360
            ],
            [
                24360,
                24375
            ],
            [
                24375,
                24388
            ],
            [
                24388,
                24445
            ],
            [
                24445,
                24496
            ],
            [
                24496,
                24571
            ]
        ],
        "overlap_chars": [
            [
                0,
                25
            ],
            [
                99,
                236
            ],
            [
                288,
                290
            ],
            [
                290,
                292
            ],
            [
                314,
                318
            ],
            [
                305,
                313
            ],
            [
                397,
                398
            ],
            [
                293,
                296
            ],
            [
                319,
                328
            ],
            [
                342,
                397
            ],
            [
                424,
                426
            ],
            [
                429,
                483
            ],
            [
                484,
                507
            ],
            [
                507,
                546
            ],
            [
                549,
                569
            ],
            [
                569,
                577
            ],
            [
                589,
                592
            ],
            [
                616,
                640
            ],
            [
                640,
                720
            ],
            [
                720,
                755
            ],
            [
                854,
                931
            ],
            [
                950,
                958
            ],
            [
                959,
                983
            ],
            [
                983,
                1059
            ],
            [
                1059,
                1096
            ],
            [
                1109,
                1114
            ],
            [
                1114,
                1195
            ],
            [
                1204,
                1236
            ],
            [
                1279,
                1366
            ],
            [
                1411,
                1415
            ],
            [
                1366,
                1376
            ],
            [
                1483,
                1537
            ],
            [
                1570,
                1607
            ],
            [
                1607,
                1636
            ],
            [
                1707,
                1741
            ],
            [
                1756,
                1760
            ],
            [
                1746,
                1751
            ],
            [
                1769,
                1803
            ],
            [
                1826,
                1828
            ],
            [
                1828,
                1830
            ],
            [
                1845,
                1886
            ],
            [
                1925,
                2023
            ],
            [
                2045,
                2065
            ],
            [
                2065,
                2077
            ],
            [
                2077,
                2085
            ],
            [
                2132,
                2134
            ],
            [
                2441,
                2507
            ],
            [
                2584,
                2599
            ],
            [
                2732,
                2733
            ],
            [
                2742,
                2783
            ],
            [
                2783,
                2852
            ],
            [
                2852,
                2864
            ],
            [
                2868,
                2915
            ],
            [
                2915,
                2944
            ],
            [
                2946,
                2983
            ],
            [
                2983,
                2998
            ],
            [
                3003,
                3016
            ],
            [
                3026,
                3027
            ],
            [
                2999,
                3002
            ],
            [
                3070,
                3084
            ],
            [
                3031,
                3032
            ],
            [
                3017,
                3026
            ],
            [
                3042,
                3046
            ],
            [
                3063,
                3066
            ],
            [
                3095,
                3145
            ],
            [
                3215,
                3309
            ],
            [
                3309,
                3337
            ],
            [
                3369,
                3435
            ],
            [
                3346,
                3347
            ],
            [
                3439,
                3449
            ],
            [
                3449,
                3487
            ],
            [
                3509,
                3533
            ],
            [
                3533,
                3578
            ],
            [
                3585,
                3587
            ],
            [
                3587,
                3593
            ],
            [
                3614,
                3654
            ],
            [
                3662,
                3673
            ],
            [
                3682,
                3693
            ],
            [
                3697,
                3703
            ],
            [
                3703,
                3720
            ],
            [
                3744,
                3791
            ],
            [
                3791,
                3819
            ],
            [
                3851,
                3853
            ],
            [
                3853,
                3860
            ],
            [
                3877,
                3893
            ],
            [
                3895,
                3944
            ],
            [
                3999,
                4008
            ],
            [
                4013,
                4070
            ],
            [
                4127,
                4129
            ],
            [
                4129,
                4138
            ],
            [
                4149,
                4157
            ],
            [
                4192,
                4201
            ],
            [
                4169,
                4179
            ],
            [
                4201,
                4203
            ],
            [
                4203,
                4219
            ],
            [
                4242,
                4244
            ],
            [
                4244,
                4248
            ],
            [
                4250,
                4252
            ],
            [
                4254,
                4294
            ],
            [
                4349,
                4351
            ],
            [
                4351,
                4356
            ],
            [
                4361,
                4382
            ],
            [
                4384,
                4404
            ],
            [
                4404,
                4433
            ],
            [
                4577,
                4592
            ],
            [
                4615,
                4618
            ],
            [
                4660,
                4663
            ],
            [
                4668,
                4678
            ],
            [
                4687,
                4706
            ],
            [
                4714,
                4730
            ],
            [
                4730,
                4800
            ],
            [
                4800,
                4825
            ],
            [
                4834,
                4881
            ],
            [
                4881,
                4904
            ],
            [
                4909,
                4923
            ],
            [
                4926,
                4928
            ],
            [
                4928,
                4941
            ],
            [
                4943,
                4968
            ],
            [
                4968,
                4990
            ],
            [
                4990,
                4996
            ],
            [
                5008,
                5016
            ],
            [
                5021,
                5033
            ],
            [
                5065,
                5066
            ],
            [
                5231,
                5260
            ],
            [
                5260,
                5300
            ],
            [
                5306,
                5340
            ],
            [
                5340,
                5385
            ],
            [
                5389,
                5450
            ],
            [
                5541,
                5586
            ],
            [
                5450,
                5475
            ],
            [
                5485,
                5500
            ],
            [
                5680,
                5682
            ],
            [
                5682,
                5688
            ],
            [
                5744,
                5747
            ],
            [
                5727,
                5734
            ],
            [
                5769,
                5773
            ],
            [
                5780,
                5782
            ],
            [
                5782,
                5816
            ],
            [
                5816,
                5865
            ],
            [
                5865,
                5874
            ],
            [
                5890,
                5939
            ],
            [
                5966,
                5969
            ],
            [
                5969,
                5970
            ],
            [
                5991,
                6028
            ],
            [
                6046,
                6069
            ],
            [
                5980,
                5989
            ],
            [
                6069,
                6072
            ],
            [
                6072,
                6088
            ],
            [
                6127,
                6170
            ],
            [
                6179,
                6245
            ],
            [
                6245,
                6261
            ],
            [
                6261,
                6310
            ],
            [
                6310,
                6331
            ],
            [
                6339,
                6381
            ],
            [
                6402,
                6430
            ],
            [
                6508,
                6519
            ],
            [
                6550,
                6561
            ],
            [
                6561,
                6594
            ],
            [
                6594,
                6609
            ],
            [
                6609,
                6629
            ],
            [
                6639,
                6668
            ],
            [
                6668,
                6791
            ],
            [
                6800,
                6803
            ],
            [
                6803,
                6826
            ],
            [
                6836,
                6853
            ],
            [
                6853,
                6984
            ],
            [
                6984,
                7030
            ],
            [
                7181,
                7184
            ],
            [
                7215,
                7219
            ],
            [
                7260,
                7273
            ],
            [
                7154,
                7156
            ],
            [
                7275,
                7288
            ],
            [
                7392,
                7432
            ],
            [
                7441,
                7448
            ],
            [
                7448,
                7496
            ],
            [
                7515,
                7598
            ],
            [
                7606,
                7641
            ],
            [
                7666,
                7722
            ],
            [
                7722,
                7800
            ],
            [
                7816,
                7857
            ],
            [
                7953,
                7961
            ],
            [
                7980,
                7993
            ],
            [
                8016,
                8036
            ],
            [
                8115,
                8117
            ],
            [
                7993,
                7996
            ],
            [
                8064,
                8077
            ],
            [
                8081,
                8108
            ],
            [
                8139,
                8144
            ],
            [
                8118,
                8126
            ],
            [
                8159,
                8191
            ],
            [
                8231,
                8279
            ],
            [
                8279,
                8328
            ],
            [
                8328,
                8360
            ],
            [
                8360,
                8385
            ],
            [
                8385,
                8418
            ],
            [
                8427,
                8454
            ],
            [
                8454,
                8516
            ],
            [
                8516,
                8529
            ],
            [
                8529,
                8573
            ],
            [
                8652,
                8669
            ],
            [
                8671,
                8683
            ],
            [
                8707,
                8736
            ],
            [
                8777,
                8810
            ],
            [
                8810,
                8844
            ],
            [
                8844,
                8888
            ],
            [
                8893,
                8944
            ],
            [
                8962,
                8964
            ],
            [
                8964,
                8982
            ],
            [
                9004,
                9012
            ],
            [
                9026,
                9030
            ],
            [
                9034,
                9036
            ],
            [
                8983,
                8986
            ],
            [
                9079,
                9091
            ],
            [
                9037,
                9047
            ],
            [
                9062,
                9065
            ],
            [
                9117,
                9193
            ],
            [
                9201,
                9228
            ],
            [
                9255,
                9268
            ],
            [
                9361,
                9368
            ],
            [
                9372,
                9388
            ],
            [
                9388,
                9460
            ],
            [
                9471,
                9503
            ],
            [
                9503,
                9511
            ],
            [
                9511,
                9611
            ],
            [
                9611,
                9631
            ],
            [
                9713,
                9747
            ],
            [
                9747,
                9759
            ],
            [
                9782,
                9784
            ],
            [
                9784,
                9867
            ],
            [
                9891,
                9942
            ],
            [
                9942,
                9979
            ],
            [
                9979,
                10017
            ],
            [
                10017,
                10050
            ],
            [
                10137,
                10173
            ],
            [
                10199,
                10201
            ],
            [
                10254,
                10341
            ],
            [
                10341,
                10409
            ],
            [
                10409,
                10412
            ],
            [
                10419,
                10445
            ],
            [
                10447,
                10462
            ],
            [
                10528,
                10537
            ],
            [
                10479,
                10500
            ],
            [
                10568,
                10570
            ],
            [
                10570,
                10579
            ],
            [
                10601,
                10618
            ],
            [
                10644,
                10673
            ],
            [
                10708,
                10796
            ],
            [
                10796,
                10822
            ],
            [
                10885,
                10907
            ],
            [
                10907,
                10919
            ],
            [
                10921,
                10928
            ],
            [
                10930,
                10943
            ],
            [
                10945,
                10948
            ],
            [
                10950,
                11003
            ],
            [
                11003,
                11031
            ],
            [
                11031,
                11047
            ],
            [
                11047,
                11072
            ],
            [
                11094,
                11130
            ],
            [
                11130,
                11210
            ],
            [
                11248,
                11251
            ],
            [
                11251,
                11263
            ],
            [
                11263,
                11299
            ],
            [
                11299,
                11370
            ],
            [
                11370,
                11376
            ],
            [
                11381,
                11447
            ],
            [
                11479,
                11514
            ],
            [
                11514,
                11541
            ],
            [
                11557,
                11559
            ],
            [
                11559,
                11573
            ],
            [
                11648,
                11685
            ],
            [
                11737,
                11753
            ],
            [
                11782,
                11801
            ],
            [
                11817,
                11822
            ],
            [
                11843,
                11845
            ],
            [
                11845,
                11869
            ],
            [
                11904,
                11977
            ],
            [
                11983,
                11985
            ],
            [
                11985,
                12059
            ],
            [
                12059,
                12104
            ],
            [
                12104,
                12128
            ],
            [
                12128,
                12169
            ],
            [
                12175,
                12278
            ],
            [
                12315,
                12317
            ],
            [
                12286,
                12291
            ],
            [
                12327,
                12335
            ],
            [
                12345,
                12348
            ],
            [
                12350,
                12409
            ],
            [
                12409,
                12433
            ],
            [
                12433,
                12457
            ],
            [
                12517,
                12539
            ],
            [
                12539,
                12558
            ],
            [
                12622,
                12627
            ],
            [
                12632,
                12652
            ],
            [
                12682,
                12749
            ],
            [
                12749,
                12892
            ],
            [
                13030,
                13033
            ],
            [
                12911,
                12917
            ],
            [
                12982,
                13005
            ],
            [
                13036,
                13070
            ],
            [
                13078,
                13090
            ],
            [
                13094,
                13098
            ],
            [
                13118,
                13120
            ],
            [
                13120,
                13177
            ],
            [
                13177,
                13227
            ],
            [
                13261,
                13305
            ],
            [
                13305,
                13306
            ],
            [
                13311,
                13321
            ],
            [
                13340,
                13416
            ],
            [
                13416,
                13453
            ],
            [
                13471,
                13474
            ],
            [
                13475,
                13486
            ],
            [
                13486,
                13506
            ],
            [
                13506,
                13555
            ],
            [
                13555,
                13584
            ],
            [
                13598,
                13603
            ],
            [
                13723,
                13772
            ],
            [
                13782,
                13799
            ],
            [
                13843,
                13852
            ],
            [
                13807,
                13810
            ],
            [
                13853,
                13876
            ],
            [
                13878,
                13885
            ],
            [
                13887,
                13895
            ],
            [
                13930,
                14083
            ],
            [
                14087,
                14103
            ],
            [
                14226,
                14232
            ],
            [
                14179,
                14209
            ],
            [
                14161,
                14164
            ],
            [
                14233,
                14266
            ],
            [
                14220,
                14221
            ],
            [
                14291,
                14300
            ],
            [
                14300,
                14315
            ],
            [
                14349,
                14393
            ],
            [
                14434,
                14494
            ],
            [
                14494,
                14525
            ],
            [
                14525,
                14577
            ],
            [
                14580,
                14621
            ],
            [
                14621,
                14661
            ],
            [
                14661,
                14705
            ],
            [
                14721,
                14723
            ],
            [
                14706,
                14715
            ],
            [
                14723,
                14726
            ],
            [
                14726,
                14748
            ],
            [
                14748,
                14765
            ],
            [
                14820,
                14823
            ],
            [
                14830,
                14844
            ],
            [
                14850,
                14857
            ],
            [
                14886,
                14902
            ],
            [
                14937,
                14959
            ],
            [
                14959,
                14960
            ],
            [
                14988,
                15005
            ],
            [
                15033,
                15043
            ],
            [
                15062,
                15077
            ],
            [
                15087,
                15090
            ],
            [
                15090,
                15157
            ],
            [
                15294,
                15397
            ],
            [
                15445,
                15449
            ],
            [
                15398,
                15421
            ],
            [
                15459,
                15462
            ],
            [
                15555,
                15559
            ],
            [
                15596,
                15598
            ],
            [
                15603,
                15613
            ],
            [
                15613,
                15641
            ],
            [
                15677,
                15679
            ],
            [
                15679,
                15682
            ],
            [
                15682,
                15732
            ],
            [
                15766,
                15792
            ],
            [
                15792,
                15803
            ],
            [
                15841,
                15851
            ],
            [
                15855,
                15879
            ],
            [
                15879,
                15880
            ],
            [
                15892,
                15894
            ],
            [
                15908,
                15921
            ],
            [
                15993,
                16002
            ],
            [
                16023,
                16047
            ],
            [
                16053,
                16082
            ],
            [
                16082,
                16083
            ],
            [
                16083,
                16110
            ],
            [
                16162,
                16169
            ],
            [
                16176,
                16185
            ],
            [
                16148,
                16157
            ],
            [
                16210,
                16213
            ],
            [
                16213,
                16214
            ],
            [
                16226,
                16235
            ],
            [
                16250,
                16253
            ],
            [
                16253,
                16261
            ],
            [
                16269,
                16287
            ],
            [
                16318,
                16328
            ],
            [
                16302,
                16312
            ],
            [
                16329,
                16347
            ],
            [
                16347,
                16411
            ],
            [
                16740,
                16744
            ],
            [
                16751,
                16757
            ],
            [
                16795,
                16797
            ],
            [
                16797,
                16856
            ],
            [
                16867,
                16895
            ],
            [
                16895,
                16910
            ],
            [
                16917,
                16931
            ],
            [
                16937,
                16958
            ],
            [
                16958,
                17002
            ],
            [
                17048,
                17051
            ],
            [
                17069,
                17132
            ],
            [
                17271,
                17292
            ],
            [
                17311,
                17313
            ],
            [
                17322,
                17330
            ],
            [
                17347,
                17396
            ],
            [
                17396,
                17416
            ],
            [
                17416,
                17428
            ],
            [
                17436,
                17438
            ],
            [
                17438,
                17465
            ],
            [
                17467,
                17506
            ],
            [
                17508,
                17534
            ],
            [
                17534,
                17556
            ],
            [
                17556,
                17568
            ],
            [
                17576,
                17588
            ],
            [
                17588,
                17628
            ],
            [
                17628,
                17638
            ],
            [
                17668,
                17673
            ],
            [
                17639,
                17648
            ],
            [
                17675,
                17695
            ],
            [
                17705,
                17725
            ],
            [
                17831,
                17868
            ],
            [
                17868,
                17908
            ],
            [
                17910,
                17942
            ],
            [
                17942,
                17960
            ],
            [
                17960,
                18024
            ],
            [
                18051,
                18053
            ],
            [
                18053,
                18147
            ],
            [
                18147,
                18160
            ],
            [
                18160,
                18173
            ],
            [
                18190,
                18203
            ],
            [
                18203,
                18213
            ],
            [
                18226,
                18235
            ],
            [
                18291,
                18293
            ],
            [
                18299,
                18309
            ],
            [
                18316,
                18320
            ],
            [
                18339,
                18354
            ],
            [
                18375,
                18390
            ],
            [
                18404,
                18419
            ],
            [
                18433,
                18435
            ],
            [
                18435,
                18460
            ],
            [
                18468,
                18471
            ],
            [
                18475,
                18493
            ],
            [
                18535,
                18541
            ],
            [
                18553,
                18556
            ],
            [
                18560,
                18567
            ],
            [
                18585,
                18617
            ],
            [
                18619,
                18650
            ],
            [
                18705,
                18724
            ],
            [
                18737,
                18739
            ],
            [
                18739,
                18740
            ],
            [
                18933,
                18936
            ],
            [
                18827,
                18829
            ],
            [
                18748,
                18752
            ],
            [
                18754,
                18763
            ],
            [
                18888,
                18913
            ],
            [
                18776,
                18777
            ],
            [
                18862,
                18864
            ],
            [
                18965,
                18983
            ],
            [
                18841,
                18845
            ],
            [
                18984,
                18988
            ],
            [
                18991,
                19005
            ],
            [
                19018,
                19020
            ],
            [
                19118,
                19151
            ],
            [
                19152,
                19182
            ],
            [
                19182,
                19195
            ],
            [
                19195,
                19214
            ],
            [
                19223,
                19225
            ],
            [
                19225,
                19228
            ],
            [
                19265,
                19279
            ],
            [
                19313,
                19334
            ],
            [
                19492,
                19495
            ],
            [
                19501,
                19521
            ],
            [
                19852,
                19874
            ],
            [
                19888,
                19892
            ],
            [
                19908,
                19943
            ],
            [
                19943,
                19959
            ],
            [
                19976,
                19985
            ],
            [
                19997,
                20054
            ],
            [
                20063,
                20066
            ],
            [
                20066,
                20078
            ],
            [
                20083,
                20085
            ],
            [
                20235,
                20249
            ],
            [
                20252,
                20264
            ],
            [
                20264,
                20303
            ],
            [
                20303,
                20332
            ],
            [
                20373,
                20423
            ],
            [
                20448,
                20532
            ],
            [
                20532,
                20549
            ],
            [
                20549,
                20552
            ],
            [
                20554,
                20557
            ],
            [
                20559,
                20580
            ],
            [
                20580,
                20593
            ],
            [
                20593,
                20599
            ],
            [
                20608,
                20611
            ],
            [
                20611,
                20618
            ],
            [
                20620,
                20622
            ],
            [
                20624,
                20636
            ],
            [
                20773,
                20837
            ],
            [
                20837,
                20838
            ],
            [
                20842,
                20843
            ],
            [
                20845,
                20850
            ],
            [
                20852,
                20885
            ],
            [
                20903,
                20913
            ],
            [
                20894,
                20901
            ],
            [
                20913,
                20915
            ],
            [
                20915,
                20944
            ],
            [
                20944,
                20947
            ],
            [
                20949,
                20951
            ],
            [
                20953,
                20986
            ],
            [
                20986,
                21000
            ],
            [
                21021,
                21056
            ],
            [
                21056,
                21080
            ],
            [
                21082,
                21143
            ],
            [
                21143,
                21224
            ],
            [
                21282,
                21313
            ],
            [
                21313,
                21345
            ],
            [
                21345,
                21404
            ],
            [
                21404,
                21459
            ],
            [
                21459,
                21460
            ],
            [
                21468,
                21502
            ],
            [
                21466,
                21467
            ],
            [
                21504,
                21525
            ],
            [
                21553,
                21556
            ],
            [
                21556,
                21584
            ],
            [
                21662,
                21666
            ],
            [
                21673,
                21674
            ],
            [
                21691,
                21694
            ],
            [
                21755,
                21758
            ],
            [
                21764,
                21794
            ],
            [
                21841,
                21870
            ],
            [
                21888,
                21978
            ],
            [
                21978,
                22009
            ],
            [
                22009,
                22029
            ],
            [
                22033,
                22060
            ],
            [
                22060,
                22079
            ],
            [
                22098,
                22101
            ],
            [
                22101,
                22137
            ],
            [
                22137,
                22157
            ],
            [
                22185,
                22188
            ],
            [
                22188,
                22205
            ],
            [
                22207,
                22214
            ],
            [
                22214,
                22255
            ],
            [
                22255,
                22263
            ],
            [
                22263,
                22266
            ],
            [
                22267,
                22270
            ],
            [
                22291,
                22318
            ],
            [
                22332,
                22336
            ],
            [
                22340,
                22353
            ],
            [
                22353,
                22377
            ],
            [
                22395,
                22402
            ],
            [
                22499,
                22517
            ],
            [
                22519,
                22529
            ],
            [
                22552,
                22554
            ],
            [
                22554,
                22576
            ],
            [
                22581,
                22590
            ],
            [
                22593,
                22596
            ],
            [
                22599,
                22602
            ],
            [
                22602,
                22620
            ],
            [
                22620,
                22621
            ],
            [
                22647,
                22649
            ],
            [
                22649,
                22668
            ],
            [
                22756,
                22771
            ],
            [
                22771,
                22791
            ],
            [
                22812,
                22827
            ],
            [
                22827,
                22872
            ],
            [
                22910,
                22912
            ],
            [
                22912,
                22943
            ],
            [
                22943,
                23007
            ],
            [
                23053,
                23064
            ],
            [
                23089,
                23101
            ],
            [
                23101,
                23103
            ],
            [
                23103,
                23110
            ],
            [
                23116,
                23123
            ],
            [
                23141,
                23147
            ],
            [
                23147,
                23157
            ],
            [
                23202,
                23203
            ],
            [
                23218,
                23221
            ],
            [
                23238,
                23254
            ],
            [
                23254,
                23290
            ],
            [
                23290,
                23316
            ],
            [
                23326,
                23335
            ],
            [
                23335,
                23350
            ],
            [
                23358,
                23360
            ],
            [
                23351,
                23357
            ],
            [
                23440,
                23441
            ],
            [
                23490,
                23511
            ],
            [
                23520,
                23525
            ],
            [
                23531,
                23550
            ],
            [
                23550,
                23554
            ],
            [
                23560,
                23575
            ],
            [
                23596,
                23598
            ],
            [
                23598,
                23634
            ],
            [
                23634,
                23755
            ],
            [
                23799,
                23822
            ],
            [
                23822,
                23855
            ],
            [
                23855,
                23924
            ],
            [
                23933,
                23963
            ],
            [
                23978,
                23981
            ],
            [
                23981,
                24038
            ],
            [
                24038,
                24051
            ],
            [
                24051,
                24130
            ],
            [
                24211,
                24214
            ],
            [
                24221,
                24227
            ],
            [
                24227,
                24254
            ],
            [
                24256,
                24273
            ],
            [
                24273,
                24295
            ],
            [
                24295,
                24324
            ],
            [
                24324,
                24327
            ],
            [
                24337,
                24348
            ],
            [
                24369,
                24372
            ],
            [
                24382,
                24386
            ],
            [
                24357,
                24360
            ],
            [
                24445,
                24496
            ],
            [
                24496,
                24549
            ],
            [
                24557,
                24558
            ],
            [
                24569,
                24571
            ]
        ],
        "row_chars": [
            [
                0,
                25
            ],
            [
                25,
                99
            ],
            [
                99,
                290
            ],
            [
                290,
                426
            ],
            [
                426,
                507
            ],
            [
                507,
                569
            ],
            [
                569,
                640
            ],
            [
                640,
                720
            ],
            [
                720,
                756
            ],
            [
                756,
                854
            ],
            [
                854,
                983
            ],
            [
                983,
                1059
            ],
            [
                1059,
                1114
            ],
            [
                1114,
                1195
            ],
            [
                1195,
                1204
            ],
            [
                1204,
                1366
            ],
            [
                1366,
                1537
            ],
            [
                1537,
                1607
            ],
            [
                1607,
                1828
            ],
            [
                1828,
                1925
            ],
            [
                1925,
                2065
            ],
            [
                2065,
                2077
            ],
            [
                2077,
                2134
            ],
            [
                2134,
                2247
            ],
            [
                2247,
                2289
            ],
            [
                2289,
                2300
            ],
            [
                2300,
                2403
            ],
            [
                2403,
                2415
            ],
            [
                2415,
                2507
            ],
            [
                2507,
                2584
            ],
            [
                2584,
                2600
            ],
            [
                2600,
                2652
            ],
            [
                2652,
                2665
            ],
            [
                2665,
                2716
            ],
            [
                2716,
                2732
            ],
            [
                2732,
                2783
            ],
            [
                2783,
                2852
            ],
            [
                2852,
                2864
            ],
            [
                2864,
                2915
            ],
            [
                2915,
                2983
            ],
            [
                2983,
                3146
            ],
            [
                3146,
                3215
            ],
            [
                3215,
                3309
            ],
            [
                3309,
                3449
            ],
            [
                3449,
                3487
            ],
            [
                3487,
                3533
            ],
            [
                3533,
                3587
            ],
            [
                3587,
                3703
            ],
            [
                3703,
                3791
            ],
            [
                3791,
                3853
            ],
            [
                3853,
                3944
            ],
            [
                3944,
                3995
            ],
            [
                3995,
                4129
            ],
            [
                4129,
                4203
            ],
            [
                4203,
                4244
            ],
            [
                4244,
                4351
            ],
            [
                4351,
                4404
            ],
            [
                4404,
                4639
            ],
            [
                4639,
                4660
            ],
            [
                4660,
                4730
            ],
            [
                4730,
                4800
            ],
            [
                4800,
                4881
            ],
            [
                4881,
                4904
            ],
            [
                4904,
                4928
            ],
            [
                4928,
                4968
            ],
            [
                4968,
                4990
            ],
            [
                4990,
                5260
            ],
            [
                5260,
                5340
            ],
            [
                5340,
                5450
            ],
            [
                5450,
                5682
            ],
            [
                5682,
                5782
            ],
            [
                5782,
                5816
            ],
            [
                5816,
                5865
            ],
            [
                5865,
                5877
            ],
            [
                5877,
                5889
            ],
            [
                5889,
                5969
            ],
            [
                5969,
                6072
            ],
            [
                6072,
                6245
            ],
            [
                6245,
                6261
            ],
            [
                6261,
                6310
            ],
            [
                6310,
                6433
            ],
            [
                6433,
                6469
            ],
            [
                6469,
                6507
            ],
            [
                6507,
                6594
            ],
            [
                6594,
                6609
            ],
            [
                6609,
                6668
            ],
            [
                6668,
                6803
            ],
            [
                6803,
                6853
            ],
            [
                6853,
                6984
            ],
            [
                6984,
                7030
            ],
            [
                7030,
                7070
            ],
            [
                7070,
                7096
            ],
            [
                7096,
                7129
            ],
            [
                7129,
                7291
            ],
            [
                7291,
                7448
            ],
            [
                7448,
                7722
            ],
            [
                7722,
                7993
            ],
            [
                7993,
                8279
            ],
            [
                8279,
                8328
            ],
            [
                8328,
                8360
            ],
            [
                8360,
                8385
            ],
            [
                8385,
                8454
            ],
            [
                8454,
                8516
            ],
            [
                8516,
                8529
            ],
            [
                8529,
                8810
            ],
            [
                8810,
                8844
            ],
            [
                8844,
                8964
            ],
            [
                8964,
                9388
            ],
            [
                9388,
                9503
            ],
            [
                9503,
                9511
            ],
            [
                9511,
                9611
            ],
            [
                9611,
                9631
            ],
            [
                9631,
                9658
            ],
            [
                9658,
                9712
            ],
            [
                9712,
                9747
            ],
            [
                9747,
                9784
            ],
            [
                9784,
                9942
            ],
            [
                9942,
                9979
            ],
            [
                9979,
                10017
            ],
            [
                10017,
                10050
            ],
            [
                10050,
                10137
            ],
            [
                10137,
                10201
            ],
            [
                10201,
                10246
            ],
            [
                10246,
                10341
            ],
            [
                10341,
                10409
            ],
            [
                10409,
                10570
            ],
            [
                10570,
                10673
            ],
            [
                10673,
                10708
            ],
            [
                10708,
                10796
            ],
            [
                10796,
                10822
            ],
            [
                10822,
                10849
            ],
            [
                10849,
                10885
            ],
            [
                10885,
                10907
            ],
            [
                10907,
                11003
            ],
            [
                11003,
                11031
            ],
            [
                11031,
                11047
            ],
            [
                11047,
                11075
            ],
            [
                11075,
                11088
            ],
            [
                11088,
                11094
            ],
            [
                11094,
                11130
            ],
            [
                11130,
                11251
            ],
            [
                11251,
                11263
            ],
            [
                11263,
                11299
            ],
            [
                11299,
                11370
            ],
            [
                11370,
                11447
            ],
            [
                11447,
                11461
            ],
            [
                11461,
                11479
            ],
            [
                11479,
                11514
            ],
            [
                11514,
                11559
            ],
            [
                11559,
                11573
            ],
            [
                11573,
                11596
            ],
            [
                11596,
                11638
            ],
            [
                11638,
                11685
            ],
            [
                11685,
                11696
            ],
            [
                11696,
                11720
            ],
            [
                11720,
                11737
            ],
            [
                11737,
                11753
            ],
            [
                11753,
                11782
            ],
            [
                11782,
                11845
            ],
            [
                11845,
                11985
            ],
            [
                11985,
                12059
            ],
            [
                12059,
                12104
            ],
            [
                12104,
                12128
            ],
            [
                12128,
                12175
            ],
            [
                12175,
                12281
            ],
            [
                12281,
                12409
            ],
            [
                12409,
                12433
            ],
            [
                12433,
                12471
            ],
            [
                12471,
                12517
            ],
            [
                12517,
                12539
            ],
            [
                12539,
                12749
            ],
            [
                12749,
                13120
            ],
            [
                13120,
                13177
            ],
            [
                13177,
                13305
            ],
            [
                13305,
                13416
            ],
            [
                13416,
                13456
            ],
            [
                13456,
                13470
            ],
            [
                13470,
                13486
            ],
            [
                13486,
                13506
            ],
            [
                13506,
                13555
            ],
            [
                13555,
                13606
            ],
            [
                13606,
                13619
            ],
            [
                13619,
                13688
            ],
            [
                13688,
                13898
            ],
            [
                13898,
                13924
            ],
            [
                13924,
                14160
            ],
            [
                14160,
                14300
            ],
            [
                14300,
                14315
            ],
            [
                14315,
                14330
            ],
            [
                14330,
                14348
            ],
            [
                14348,
                14394
            ],
            [
                14394,
                14431
            ],
            [
                14431,
                14494
            ],
            [
                14494,
                14525
            ],
            [
                14525,
                14580
            ],
            [
                14580,
                14621
            ],
            [
                14621,
                14661
            ],
            [
                14661,
                14726
            ],
            [
                14726,
                14748
            ],
            [
                14748,
                14959
            ],
            [
                14959,
                15005
            ],
            [
                15005,
                15033
            ],
            [
                15033,
                15090
            ],
            [
                15090,
                15157
            ],
            [
                15157,
                15187
            ],
            [
                15187,
                15268
            ],
            [
                15268,
                15293
            ],
            [
                15293,
                15462
            ],
            [
                15462,
                15551
            ],
            [
                15551,
                15613
            ],
            [
                15613,
                15682
            ],
            [
                15682,
                15792
            ],
            [
                15792,
                15879
            ],
            [
                15879,
                15894
            ],
            [
                15894,
                16053
            ],
            [
                16053,
                16082
            ],
            [
                16082,
                16110
            ],
            [
                16110,
                16213
            ],
            [
                16213,
                16253
            ],
            [
                16253,
                16347
            ],
            [
                16347,
                16411
            ],
            [
                16411,
                16466
            ],
            [
                16466,
                16634
            ],
            [
                16634,
                16685
            ],
            [
                16685,
                16740
            ],
            [
                16740,
                16797
            ],
            [
                16797,
                16895
            ],
            [
                16895,
                16958
            ],
            [
                16958,
                17051
            ],
            [
                17051,
                17069
            ],
            [
                17069,
                17135
            ],
            [
                17135,
                17179
            ],
            [
                17179,
                17263
            ],
            [
                17263,
                17271
            ],
            [
                17271,
                17396
            ],
            [
                17396,
                17438
            ],
            [
                17438,
                17534
            ],
            [
                17534,
                17556
            ],
            [
                17556,
                17588
            ],
            [
                17588,
                17628
            ],
            [
                17628,
                17725
            ],
            [
                17725,
                17762
            ],
            [
                17762,
                17831
            ],
            [
                17831,
                17868
            ],
            [
                17868,
                17942
            ],
            [
                17942,
                17960
            ],
            [
                17960,
                18053
            ],
            [
                18053,
                18147
            ],
            [
                18147,
                18160
            ],
            [
                18160,
                18203
            ],
            [
                18203,
                18238
            ],
            [
                18238,
                18256
            ],
            [
                18256,
                18291
            ],
            [
                18291,
                18435
            ],
            [
                18435,
                18493
            ],
            [
                18493,
                18535
            ],
            [
                18535,
                18739
            ],
            [
                18739,
                19020
            ],
            [
                19020,
                19075
            ],
            [
                19075,
                19182
            ],
            [
                19182,
                19195
            ],
            [
                19195,
                19225
            ],
            [
                19225,
                19279
            ],
            [
                19279,
                19313
            ],
            [
                19313,
                19334
            ],
            [
                19334,
                19369
            ],
            [
                19369,
                19403
            ],
            [
                19403,
                19445
            ],
            [
                19445,
                19488
            ],
            [
                19488,
                19523
            ],
            [
                19523,
                19595
            ],
            [
                19595,
                19671
            ],
            [
                19671,
                19732
            ],
            [
                19732,
                19768
            ],
            [
                19768,
                19852
            ],
            [
                19852,
                19943
            ],
            [
                19943,
                20066
            ],
            [
                20066,
                20085
            ],
            [
                20085,
                20114
            ],
            [
                20114,
                20124
            ],
            [
                20124,
                20182
            ],
            [
                20182,
                20203
            ],
            [
                20203,
                20219
            ],
            [
                20219,
                20252
            ],
            [
                20252,
                20264
            ],
            [
                20264,
                20303
            ],
            [
                20303,
                20332
            ],
            [
                20332,
                20373
            ],
            [
                20373,
                20426
            ],
            [
                20426,
                20435
            ],
            [
                20435,
                20448
            ],
            [
                20448,
                20532
            ],
            [
                20532,
                20549
            ],
            [
                20549,
                20580
            ],
            [
                20580,
                20593
            ],
            [
                20593,
                20611
            ],
            [
                20611,
                20837
            ],
            [
                20837,
                20885
            ],
            [
                20885,
                20915
            ],
            [
                20915,
                20944
            ],
            [
                20944,
                20986
            ],
            [
                20986,
                21056
            ],
            [
                21056,
                21143
            ],
            [
                21143,
                21313
            ],
            [
                21313,
                21345
            ],
            [
                21345,
                21404
            ],
            [
                21404,
                21459
            ],
            [
                21459,
                21556
            ],
            [
                21556,
                21584
            ],
            [
                21584,
                21662
            ],
            [
                21662,
                21694
            ],
            [
                21694,
                21749
            ],
            [
                21749,
                21797
            ],
            [
                21797,
                21840
            ],
            [
                21840,
                21978
            ],
            [
                21978,
                22009
            ],
            [
                22009,
                22029
            ],
            [
                22029,
                22060
            ],
            [
                22060,
                22101
            ],
            [
                22101,
                22137
            ],
            [
                22137,
                22188
            ],
            [
                22188,
                22214
            ],
            [
                22214,
                22255
            ],
            [
                22255,
                22263
            ],
            [
                22263,
                22353
            ],
            [
                22353,
                22405
            ],
            [
                22405,
                22498
            ],
            [
                22498,
                22554
            ],
            [
                22554,
                22602
            ],
            [
                22602,
                22620
            ],
            [
                22620,
                22649
            ],
            [
                22649,
                22711
            ],
            [
                22711,
                22756
            ],
            [
                22756,
                22771
            ],
            [
                22771,
                22827
            ],
            [
                22827,
                22912
            ],
            [
                22912,
                22943
            ],
            [
                22943,
                23103
            ],
            [
                23103,
                23147
            ],
            [
                23147,
                23157
            ],
            [
                23157,
                23202
            ],
            [
                23202,
                23224
            ],
            [
                23224,
                23238
            ],
            [
                23238,
                23254
            ],
            [
                23254,
                23290
            ],
            [
                23290,
                23335
            ],
            [
                23335,
                23442
            ],
            [
                23442,
                23490
            ],
            [
                23490,
                23550
            ],
            [
                23550,
                23598
            ],
            [
                23598,
                23634
            ],
            [
                23634,
                23755
            ],
            [
                23755,
                23799
            ],
            [
                23799,
                23822
            ],
            [
                23822,
                23855
            ],
            [
                23855,
                23924
            ],
            [
                23924,
                23981
            ],
            [
                23981,
                24038
            ],
            [
                24038,
                24051
            ],
            [
                24051,
                24133
            ],
            [
                24133,
                24202
            ],
            [
                24202,
                24227
            ],
            [
                24227,
                24273
            ],
            [
                24273,
                24295
            ],
            [
                24295,
                24324
            ],
            [
                24324,
                24388
            ],
            [
                24388,
                24445
            ],
            [
                24445,
                24496
            ],
            [
                24496,
                24571
            ]
        ]
    },
    "abridged": {
        "text": "Martin had planned well. But older and wiser schemers than he are often doomed to see their finest-spun projects swept to annihilation by the sudden broom of Fate. In this instance, the broom was made out of the tough fibres of Moore's own stubborn purpose. Moore was now resuming his strength, and making strange headway against Mrs. Horsfall. Each morning he amazed that matron with fresh astonishment. First he told her he would dress himself. Then he refused the coffee she brought him; he would breakfast with the family. Lastly, he forbade her his chamber.\nThe morning after, he followed Mr. Yorke to his counting-house, and requested a chaise be fetched from the Red House Inn. He was resolved, he said, to return home to the Hollow that very afternoon. Mr. Yorke, instead of opposing, aided him. The chaise was sent for, though Mrs. Yorke declared the step would be his death. Moore, little disposed to speak, expressed his gratitude to the servants and to Mrs. Horsfall by the chink of his coin. At this, the latter and her patient parted the best friends in the world.\nNext Moore betook himself to the parlour. He had Mrs. Yorke to appease; she sat plunged in sullen dudgeon, speculating gloomily on the depths of man's ingratitude. He bent over her; she was obliged to look up. There was beauty still in his pale, wasted features; there was earnestness and a sort of sweetness in his hollow eyes.\n\"Good-bye!\" he said, smiling. \"You have been a mother to me; give your wilful son one embrace.\"\nShe kissed him. \"Who is to nurse you at Hollow's Cottage? Your sister Hortense knows no more about such matters than a child.\"\n\"Thank God! I have had nursing enough to last me my life.\"\nHere the little girls came in - Jessie crying, Rose quiet but grave. Moore took them into the hall, out of their mother's sight, to soothe them; for their mother could not bear to see any living thing caressed but herself.\nThe boys were standing about the chaise as Moore entered it; but for them he had no farewell. To Mr. Yorke he only said, \"That was an unlucky shot for you, Yorke; it turned Briarmains into a hospital. Come and see me at the cottage soon.\"\nThe chaise rolled away. In half an hour he alighted at his own garden gate. Having dismissed the vehicle, he leaned on that gate an instant, to rest and muse.\n\"Six months ago I left here,\" said he, \"a proud, angry, disappointed man. I come back sadder and wiser. A cold, grey world lies round - a world where, if I hope little, I fear nothing. If the worst comes, I can work, as Joe Scott does, for an honourable living. Formerly, financial ruin was dishonour in my eyes. It is not so now. Ruin is an evil, but one for which I am prepared. I have calculated that I can put it off six months - not an hour longer. If things by that time alter, I might conquer yet. But that thought is madness; let me see matters with sane eyes. Ruin will come, lay her axe to my fortune's roots, and hew them down. I shall snatch a sapling, cross the sea, and plant it in American woods. Louis will go with me. None but Louis? I cannot tell - I have no right to ask.\"\nHe entered the house.\nIt was twilight out of doors; indoors it was already dark. Sarah had lit a good fire in the parlour, and was preparing tea in the kitchen.\n\"Hortense,\" said Moore, as his sister bustled over to help him off with his cloak, \"I am pleased to come home.\"\nAlthough he had never before called the cottage his home, Hortense did not feel the novelty of this. Still, she was pleased that he was pleased.\nHe sat down, but soon rose again. He went to the window; he came back to the fire.\n\"Hortense! This little parlour looks very clean and pleasant.\"\n\"I have had the whole house thoroughly cleaned in your absence, brother.\"\n\"Sister, I think you ought to have a friend or so to tea, if only to see how fresh and spruce you have made the little place.\"\n\"True, brother. If it were not late I might send for Miss Mann.\"\n\"So you might; but it is too late to disturb that good lady, and too cold for her to come out. I want some quiet guest today, who would tire neither of us.\"\n\"Miss Ainley?\"\n\"An excellent person; but she lives too far off. Tell Harry Scott to step up to the rectory with a request from you that Caroline Helstone should come and spend the evening.\"\n\"Would it not be better tomorrow, dear brother?\"\n\"I should like her to see the place as it is just now; its brilliant cleanliness and perfect neatness are so much to your credit.\"\n\"It might benefit her in the way of example.\"\nThe note was duly written and addressed to Miss Helstone. Very soon the messenger returned, and with him the guest.\nShe entered through the kitchen, quietly tripped upstairs to take off her bonnet and furs, and came down as quietly, with her beautiful curls smoothed, her graceful merino dress trim and spotless, her gay little work-bag in her hand. She lingered to exchange a few kindly words with Sarah, and to look at the new kitten basking on the kitchen hearth, and then she went into the parlour.\nThe friendly welcome was of the tranquil sort that befitted cousins meeting; a quiet pleasure diffused itself through the room; the tray and the singing urn were brought in.\n\"I am pleased to come home,\" repeated Mr. Moore.\nThey assembled round the table. Hortense chiefly talked. She congratulated Caroline on the improvement in her health. Her colour and her plump cheeks were returning, she remarked. It was true. There was an obvious change in Miss Helstone: no longer crushed and saddened, she looked like one who had been lifted on the wing of hope.\nAfter tea Hortense went upstairs. She had not rummaged her drawers for a month, and the impulse to perform that operation was now irresistible. During her absence Caroline took up the conversation with ease; her elegance of language gave fresh charm to familiar topics; a new music in the soft voice gently surprised the listener; her face was kindled with animation.\n\"Caroline, you look as if you had heard good tidings,\" said Moore, after gazing at her for some minutes.\n\"Do I?\"\n\"I sent for you this evening that I might be cheered; but you cheer me more than I had calculated.\"\n\"I am glad of that. It is pleasant to be here again.\"\n\"Truly it is. And to see health on your cheek and hope in your eye is pleasant, Cary; but what is the source of this sunshine I perceive about you?\"\n\"For one thing, I am happy in mamma. I love her so much, and she loves me. Long and tenderly she nursed me. Now I say it is my turn to attend to her. You would laugh if you knew what pleasure I have in making dresses and sewing for her. She looks so nice now, Robert; I will not let her be old-fashioned. And she is charming to talk to - full of wisdom, observant, rich in information. Every day I like her better, I love her more tenderly.\"\n\"You talk in such a way about 'mamma' it is enough to make one jealous of the old lady.\"\n\"She is not old, Robert.\"\n\"Well, of the matron. But you said mamma's affection was one thing that made you happy; now for the other thing.\"\n\"I am glad you are better.\"\n\"What besides?\"\n\"I am glad we are friends. I once thought we never should be.\"\n\"Cary, some day I mean to tell you a thing about myself that is not to my credit.\"\n\"Ah, don't! I cannot bear to think ill of you.\"\n\"And I cannot bear that you should think better of me than I deserve.\"\n\"Well, I half know your 'thing;' indeed, I believe I know all about it.\"\n\"Whom does it concern besides me?\"\nShe coloured; she hesitated.\n\"Speak, Cary! There is none present but ourselves. Whisper, Cary.\"\nStill she would not speak. Seeing that Moore waited, she at last said, \"Miss Keeldar spent a day at the rectory about a week ago. The evening came on very wintry, and we persuaded her to stay all night.\"\n\"And you and she curled your hair together?\"\n\"How do you know that?\"\n\"And then you chattered, and she told you-\"\n\"It was not at curling-hair time, so you are not as wise as you think; and, besides, she didn't tell me. We slept in the same bed, although we did not sleep much; we talked the whole night through.\"\n\"I'll be sworn you did! And then it all came out.\"\n\"You are quite wrong. She did not tell me; but I inferred something, and I gathered more from rumour, and I made out the rest by instinct.\"\n\"But if she did not tell you that I wanted to marry her for the sake of her money, and that she refused me indignantly and scornfully (you need not blush; that is the plain truth) - if such was not the subject of her confidences, what was? You say you talked the whole night through; what about?\"\n\"About things we never thoroughly discussed before; but you hardly expect I should tell you?\"\n\"Yes, Cary; you said we were friends, and friends should always confide in each other.\"\n\"But you are sure you won't repeat it? Not even to Louis?\"\n\"Not even to Louis. What does Louis care for young ladies' secrets?\"\n\"Robert, Shirley is a curious being. She does not often show her feelings; but when they rush out, river-like, full and powerful, you gaze, you wonder; you admire, and - I think - love her. At dead of night, when all the house was silent, and starlight and the cold reflection from the snow glimmered in our chamber, then I saw Shirley's heart - her heart's core. It was like a shrine, for it was holy and pure; like flame, for it was warm, and strong.\"\n\"Can she love? She has loved none that have loved her yet.\" And Moore named a list of gentlemen, closing with Sir Philip Nunnely.\n\"She has loved none of these.\"\n\"Yet some of them were worthy of a woman's affection,\" argued Moore.\n\"Of some women's, but not of Shirley's.\"\n\"Is she better than others of her sex?\"\n\"She is peculiar, and more dangerous to take rashly as a wife.\"\n\"I can imagine that.\"\n\"She spoke of you - not in the way you imagined; but I made her tell me what she felt towards you. I wanted to know.\"\n\"She thinks of me contemptuously, no doubt?\"\n\"She thinks of you almost as highly as a woman can think of a man. Till you shocked her (she said you had shocked her, but she would not tell me how) she felt as a sister fondly feels towards a brother.\"\n\"That is nonsense. She is too rich and proud to see me as a brother.\"\n\"You don't know her, Robert; and, somehow, I fancy that you cannot know her. You and she will never thoroughly understand each other.\"\n\"Maybe. I admire her; but I believe she is incapable of love-\"\n\"Shirley incapable of love!\"\n\"And that she will never marry. She will not relinquish her power or her pride.\"\n\"She hurt your feelings.\"\n\"She did; though I had not a spark of tenderness or passion for her.\"\n\"Then, Robert, it was very wicked in you to want to marry her.\"\n\"She is very pretty. I acknowledge all her charms and feel none of them, or only in a way she would disdain. I suppose I was tempted by the gilding of the bait. Caroline, what a noble fellow your Robert is!\"\n\"He made a great blunder once, and we will hear no more about it. We will remember that we too shall be judged, and so we will give no scorn, only affection.\"\n\"Which won't satisfy me, I warn you. Something besides affection - something far stronger, sweeter, warmer - will be demanded one day. Is it there to give?\"\nCaroline was much moved.\n\"Be calm, Lina,\" said Moore soothingly. \"I have no right or intention to perturb your mind for months to come. Do not tremble; look me in the face. See what a poor, pale, grim phantom I am - more pitiable than formidable.\"\nShe looked shyly. \"There is something formidable still, pale as you are,\" she said.\n\"To return to Shirley,\" pursued Moore: \"is it your opinion that she is ever likely to marry?\"\n\"She loves.\"\n\"Platonically - theoretically - all humbug!\"\n\"She loves sincerely. No confession of love passed her lips; but the feeling showed itself in spite of her. She spoke of one man in a way that could not be misunderstood. Having asked her opinion of you, I demanded a second opinion of - another person about whom I had made puzzled conjectures. I was determined to make her speak, and at last out it came, in a whisper, and yet with such soft vehemence. I am sure that man's happiness is as dear to her as her own life.\"\n\"Who is it?\"\n\"I charged her with being in love. She just looked at me. It was quite enough. The lioness has found her captor.\"\n\"And who, pray, is the hero who has achieved such a conquest?\"\n\"You still speak cynically; but I will make you change your note before I have done.\"\n\"We will see. What is his name, Cary?\"\n\"Guess it.\"\n\"Is it any one in this neighbourhood?\"\n\"Yes, in Briarfield parish.\"\n\"I don't know a soul in Briarfield parish her equal. I suppose she is under a delusion, and will plunge into some absurdity, after all.\"\nCaroline smiled.\n\"Do you approve the choice?\" asked Moore.\n\"Quite.\"\n\"Then I am puzzled; for you have a correct, steady judgment, inherited from 'mamma,' I suppose.\"\n\"I quite approve, and mamma was charmed.\"\n\"Mrs. Pryor charmed! It can't be romantic, then?\"\n\"It is romantic, but it is also right.\"\n\"Tell me, Cary; I am too weak to be tantalized.\"\n\"You shall be tantalized - it will do you no harm; you are not so weak as you pretend.\"\n\"I have twice this evening had some thoughts of falling on the floor at your feet and worshipping you downright. My mother was a Roman Catholic. You look like the loveliest of her pictures of the Virgin. I think I will embrace her faith and kneel and adore.\"\n\"Robert, sit still; don't be absurd, or I will go to Hortense.\"\n\"You have stolen my senses. Heavenly rose, queen of angels!\"\n\"Sit quietly, and guess your riddle. I'll tell you what mamma said: 'Depend upon it, my dear, such a choice will make the happiness of Miss Keeldar's life.'\"\n\"I'll guess once, and no more. It is old Helstone. Shirley is going to be your aunt.\"\n\"I'll tell my uncle!\" cried Caroline, laughing gleefully. \"Guess again, Robert.\"\n\"It is the parson - Hall.\"\n\"Indeed, no; he is mine, if you please.\"\n\"Yours! Ay, all the women in Briarfield seem to idolise that priest. I wonder why; he is bald and grey-haired. I'll guess no more - I am tired. Miss Keeldar may marry the Grand Turk for all I care.\"\n\"Must I whisper?\"\n\"Quickly. Here comes Hortense.\"\nShe whispered. Robert gave a start, and a brief laugh. Miss Moore entered, and Sarah followed behind. The hour of converse was over.\nRobert found a moment to exchange a few more whispered sentences as Caroline put on her shawl before departing.\n\"Must I forgive Shirley now?\" he asked.\n\"Forgive her? Naughty Robert! Was she in the wrong, or were you?\"\n\"Must I at length love her, Cary?\"\nCaroline looked up keenly. \"Indeed, you must not; the idea is perverse.\"\n\"But she is handsome. Hers is a beauty that grows on you. You think her but graceful when you first see her; you discover her to be beautiful when you have known her for a year.\"\n\"Now, Robert, be good.\"\n\"O Cary, I have no love to give. Were the goddess of beauty to woo me, I could not meet her advances. I have no heart which I can call mine.\"\n\"So much the better; you are a great deal safer without. Good-night.\"\n\"Why must you always go, Lina, at the very instant when I most want you to stay? One more word. Take care of your own heart - do you hear me?\"\n\"There is no danger.\"\n\"I am not convinced of that. The parson, for one: Cyril Hall.\"\n\"As to you, you have been flirting with Miss Mann. She showed me the other day a plant you had given her. Goodbye, Robert.\"",
        "paragraph_chars": [
            [
                0,
                563
            ],
            [
                563,
                1079
            ],
            [
                1079,
                1408
            ],
            [
                1408,
                1504
            ],
            [
                1504,
                1631
            ],
            [
                1631,
                1690
            ],
            [
                1690,
                1913
            ],
            [
                1913,
                2152
            ],
            [
                2152,
                2311
            ],
            [
                2311,
                3103
            ],
            [
                3103,
                3125
            ],
            [
                3125,
                3264
            ],
            [
                3264,
                3376
            ],
            [
                3376,
                3521
            ],
            [
                3521,
                3604
            ],
            [
                3604,
                3667
            ],
            [
                3667,
                3741
            ],
            [
                3741,
                3868
            ],
            [
                3868,
                3933
            ],
            [
                3933,
                4090
            ],
            [
                4090,
                4105
            ],
            [
                4105,
                4280
            ],
            [
                4280,
                4329
            ],
            [
                4329,
                4460
            ],
            [
                4460,
                4506
            ],
            [
                4506,
                4622
            ],
            [
                4622,
                5009
            ],
            [
                5009,
                5183
            ],
            [
                5183,
                5232
            ],
            [
                5232,
                5564
            ],
            [
                5564,
                5932
            ],
            [
                5932,
                6037
            ],
            [
                6037,
                6045
            ],
            [
                6045,
                6145
            ],
            [
                6145,
                6199
            ],
            [
                6199,
                6348
            ],
            [
                6348,
                6790
            ],
            [
                6790,
                6879
            ],
            [
                6879,
                6905
            ],
            [
                6905,
                7019
            ],
            [
                7019,
                7047
            ],
            [
                7047,
                7063
            ],
            [
                7063,
                7126
            ],
            [
                7126,
                7209
            ],
            [
                7209,
                7257
            ],
            [
                7257,
                7328
            ],
            [
                7328,
                7401
            ],
            [
                7401,
                7436
            ],
            [
                7436,
                7465
            ],
            [
                7465,
                7532
            ],
            [
                7532,
                7736
            ],
            [
                7736,
                7781
            ],
            [
                7781,
                7805
            ],
            [
                7805,
                7849
            ],
            [
                7849,
                8048
            ],
            [
                8048,
                8099
            ],
            [
                8099,
                8239
            ],
            [
                8239,
                8536
            ],
            [
                8536,
                8630
            ],
            [
                8630,
                8718
            ],
            [
                8718,
                8777
            ],
            [
                8777,
                8846
            ],
            [
                8846,
                9300
            ],
            [
                9300,
                9430
            ],
            [
                9430,
                9461
            ],
            [
                9461,
                9530
            ],
            [
                9530,
                9571
            ],
            [
                9571,
                9611
            ],
            [
                9611,
                9675
            ],
            [
                9675,
                9697
            ],
            [
                9697,
                9815
            ],
            [
                9815,
                9860
            ],
            [
                9860,
                10064
            ],
            [
                10064,
                10134
            ],
            [
                10134,
                10269
            ],
            [
                10269,
                10332
            ],
            [
                10332,
                10361
            ],
            [
                10361,
                10442
            ],
            [
                10442,
                10468
            ],
            [
                10468,
                10538
            ],
            [
                10538,
                10602
            ],
            [
                10602,
                10810
            ],
            [
                10810,
                10969
            ],
            [
                10969,
                11126
            ],
            [
                11126,
                11151
            ],
            [
                11151,
                11374
            ],
            [
                11374,
                11458
            ],
            [
                11458,
                11552
            ],
            [
                11552,
                11565
            ],
            [
                11565,
                11610
            ],
            [
                11610,
                12081
            ],
            [
                12081,
                12094
            ],
            [
                12094,
                12208
            ],
            [
                12208,
                12271
            ],
            [
                12271,
                12357
            ],
            [
                12357,
                12396
            ],
            [
                12396,
                12408
            ],
            [
                12408,
                12447
            ],
            [
                12447,
                12476
            ],
            [
                12476,
                12613
            ],
            [
                12613,
                12630
            ],
            [
                12630,
                12672
            ],
            [
                12672,
                12681
            ],
            [
                12681,
                12778
            ],
            [
                12778,
                12820
            ],
            [
                12820,
                12870
            ],
            [
                12870,
                12910
            ],
            [
                12910,
                12959
            ],
            [
                12959,
                13047
            ],
            [
                13047,
                13306
            ],
            [
                13306,
                13370
            ],
            [
                13370,
                13431
            ],
            [
                13431,
                13589
            ],
            [
                13589,
                13675
            ],
            [
                13675,
                13756
            ],
            [
                13756,
                13783
            ],
            [
                13783,
                13824
            ],
            [
                13824,
                14023
            ],
            [
                14023,
                14041
            ],
            [
                14041,
                14073
            ],
            [
                14073,
                14206
            ],
            [
                14206,
                14318
            ],
            [
                14318,
                14358
            ],
            [
                14358,
                14424
            ],
            [
                14424,
                14459
            ],
            [
                14459,
                14532
            ],
            [
                14532,
                14711
            ],
            [
                14711,
                14735
            ],
            [
                14735,
                14877
            ],
            [
                14877,
                14947
            ],
            [
                14947,
                15090
            ],
            [
                15090,
                15112
            ],
            [
                15112,
                15175
            ],
            [
                15175,
                15298
            ]
        ],
        "segment_chars": [
            [
                0,
                25
            ],
            [
                25,
                164
            ],
            [
                164,
                258
            ],
            [
                258,
                345
            ],
            [
                345,
                405
            ],
            [
                405,
                447
            ],
            [
                447,
                527
            ],
            [
                527,
                563
            ],
            [
                563,
                685
            ],
            [
                685,
                761
            ],
            [
                761,
                804
            ],
            [
                804,
                885
            ],
            [
                885,
                1005
            ],
            [
                1005,
                1079
            ],
            [
                1079,
                1121
            ],
            [
                1121,
                1243
            ],
            [
                1243,
                1289
            ],
            [
                1289,
                1408
            ],
            [
                1408,
                1420
            ],
            [
                1420,
                1438
            ],
            [
                1438,
                1504
            ],
            [
                1504,
                1520
            ],
            [
                1520,
                1562
            ],
            [
                1562,
                1631
            ],
            [
                1631,
                1643
            ],
            [
                1643,
                1690
            ],
            [
                1690,
                1759
            ],
            [
                1759,
                1913
            ],
            [
                1913,
                2007
            ],
            [
                2007,
                2114
            ],
            [
                2114,
                2152
            ],
            [
                2152,
                2176
            ],
            [
                2176,
                2228
            ],
            [
                2228,
                2311
            ],
            [
                2311,
                2385
            ],
            [
                2385,
                2415
            ],
            [
                2415,
                2496
            ],
            [
                2496,
                2573
            ],
            [
                2573,
                2624
            ],
            [
                2624,
                2642
            ],
            [
                2642,
                2692
            ],
            [
                2692,
                2765
            ],
            [
                2765,
                2816
            ],
            [
                2816,
                2880
            ],
            [
                2880,
                2950
            ],
            [
                2950,
                3023
            ],
            [
                3023,
                3046
            ],
            [
                3046,
                3062
            ],
            [
                3062,
                3103
            ],
            [
                3103,
                3125
            ],
            [
                3125,
                3184
            ],
            [
                3184,
                3264
            ],
            [
                3264,
                3376
            ],
            [
                3376,
                3477
            ],
            [
                3477,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3555,
                3604
            ],
            [
                3604,
                3615
            ],
            [
                3615,
                3667
            ],
            [
                3667,
                3741
            ],
            [
                3741,
                3868
            ],
            [
                3868,
                3884
            ],
            [
                3884,
                3933
            ],
            [
                3933,
                4028
            ],
            [
                4028,
                4090
            ],
            [
                4090,
                4105
            ],
            [
                4105,
                4154
            ],
            [
                4154,
                4280
            ],
            [
                4280,
                4329
            ],
            [
                4329,
                4460
            ],
            [
                4460,
                4506
            ],
            [
                4506,
                4564
            ],
            [
                4564,
                4622
            ],
            [
                4622,
                4856
            ],
            [
                4856,
                5009
            ],
            [
                5009,
                5183
            ],
            [
                5183,
                5232
            ],
            [
                5232,
                5264
            ],
            [
                5264,
                5289
            ],
            [
                5289,
                5350
            ],
            [
                5350,
                5412
            ],
            [
                5412,
                5425
            ],
            [
                5425,
                5564
            ],
            [
                5564,
                5598
            ],
            [
                5598,
                5708
            ],
            [
                5708,
                5932
            ],
            [
                5932,
                6037
            ],
            [
                6037,
                6045
            ],
            [
                6045,
                6145
            ],
            [
                6145,
                6165
            ],
            [
                6165,
                6199
            ],
            [
                6199,
                6213
            ],
            [
                6213,
                6348
            ],
            [
                6348,
                6385
            ],
            [
                6385,
                6423
            ],
            [
                6423,
                6456
            ],
            [
                6456,
                6498
            ],
            [
                6498,
                6585
            ],
            [
                6585,
                6653
            ],
            [
                6653,
                6734
            ],
            [
                6734,
                6790
            ],
            [
                6790,
                6879
            ],
            [
                6879,
                6905
            ],
            [
                6905,
                6927
            ],
            [
                6927,
                7019
            ],
            [
                7019,
                7047
            ],
            [
                7047,
                7063
            ],
            [
                7063,
                7090
            ],
            [
                7090,
                7126
            ],
            [
                7126,
                7209
            ],
            [
                7209,
                7221
            ],
            [
                7221,
                7257
            ],
            [
                7257,
                7328
            ],
            [
                7328,
                7401
            ],
            [
                7401,
                7436
            ],
            [
                7436,
                7465
            ],
            [
                7465,
                7479
            ],
            [
                7479,
                7516
            ],
            [
                7516,
                7532
            ],
            [
                7532,
                7559
            ],
            [
                7559,
                7662
            ],
            [
                7662,
                7736
            ],
            [
                7736,
                7781
            ],
            [
                7781,
                7805
            ],
            [
                7805,
                7849
            ],
            [
                7849,
                7954
            ],
            [
                7954,
                8048
            ],
            [
                8048,
                8072
            ],
            [
                8072,
                8099
            ],
            [
                8099,
                8121
            ],
            [
                8121,
                8239
            ],
            [
                8239,
                8479
            ],
            [
                8479,
                8536
            ],
            [
                8536,
                8630
            ],
            [
                8630,
                8718
            ],
            [
                8718,
                8757
            ],
            [
                8757,
                8777
            ],
            [
                8777,
                8797
            ],
            [
                8797,
                8846
            ],
            [
                8846,
                8883
            ],
            [
                8883,
                9036
            ],
            [
                9036,
                9210
            ],
            [
                9210,
                9300
            ],
            [
                9300,
                9315
            ],
            [
                9315,
                9360
            ],
            [
                9360,
                9430
            ],
            [
                9430,
                9461
            ],
            [
                9461,
                9530
            ],
            [
                9530,
                9571
            ],
            [
                9571,
                9611
            ],
            [
                9611,
                9675
            ],
            [
                9675,
                9697
            ],
            [
                9697,
                9796
            ],
            [
                9796,
                9815
            ],
            [
                9815,
                9860
            ],
            [
                9860,
                9927
            ],
            [
                9927,
                10064
            ],
            [
                10064,
                10083
            ],
            [
                10083,
                10134
            ],
            [
                10134,
                10211
            ],
            [
                10211,
                10269
            ],
            [
                10269,
                10277
            ],
            [
                10277,
                10332
            ],
            [
                10332,
                10361
            ],
            [
                10361,
                10393
            ],
            [
                10393,
                10442
            ],
            [
                10442,
                10468
            ],
            [
                10468,
                10538
            ],
            [
                10538,
                10602
            ],
            [
                10602,
                10623
            ],
            [
                10623,
                10711
            ],
            [
                10711,
                10763
            ],
            [
                10763,
                10810
            ],
            [
                10810,
                10876
            ],
            [
                10876,
                10969
            ],
            [
                10969,
                11006
            ],
            [
                11006,
                11104
            ],
            [
                11104,
                11126
            ],
            [
                11126,
                11151
            ],
            [
                11151,
                11191
            ],
            [
                11191,
                11262
            ],
            [
                11262,
                11299
            ],
            [
                11299,
                11374
            ],
            [
                11374,
                11392
            ],
            [
                11392,
                11458
            ],
            [
                11458,
                11552
            ],
            [
                11552,
                11565
            ],
            [
                11565,
                11610
            ],
            [
                11610,
                11632
            ],
            [
                11632,
                11718
            ],
            [
                11718,
                11781
            ],
            [
                11781,
                11905
            ],
            [
                11905,
                12014
            ],
            [
                12014,
                12081
            ],
            [
                12081,
                12094
            ],
            [
                12094,
                12129
            ],
            [
                12129,
                12152
            ],
            [
                12152,
                12173
            ],
            [
                12173,
                12208
            ],
            [
                12208,
                12271
            ],
            [
                12271,
                12357
            ],
            [
                12357,
                12371
            ],
            [
                12371,
                12396
            ],
            [
                12396,
                12408
            ],
            [
                12408,
                12447
            ],
            [
                12447,
                12476
            ],
            [
                12476,
                12529
            ],
            [
                12529,
                12613
            ],
            [
                12613,
                12630
            ],
            [
                12630,
                12659
            ],
            [
                12659,
                12672
            ],
            [
                12672,
                12681
            ],
            [
                12681,
                12778
            ],
            [
                12778,
                12820
            ],
            [
                12820,
                12841
            ],
            [
                12841,
                12870
            ],
            [
                12870,
                12910
            ],
            [
                12910,
                12959
            ],
            [
                12959,
                13047
            ],
            [
                13047,
                13160
            ],
            [
                13160,
                13192
            ],
            [
                13192,
                13251
            ],
            [
                13251,
                13306
            ],
            [
                13306,
                13370
            ],
            [
                13370,
                13398
            ],
            [
                13398,
                13431
            ],
            [
                13431,
                13468
            ],
            [
                13468,
                13589
            ],
            [
                13589,
                13620
            ],
            [
                13620,
                13640
            ],
            [
                13640,
                13675
            ],
            [
                13675,
                13697
            ],
            [
                13697,
                13733
            ],
            [
                13733,
                13756
            ],
            [
                13756,
                13783
            ],
            [
                13783,
                13824
            ],
            [
                13824,
                13832
            ],
            [
                13832,
                13893
            ],
            [
                13893,
                13935
            ],
            [
                13935,
                13968
            ],
            [
                13968,
                14023
            ],
            [
                14023,
                14041
            ],
            [
                14041,
                14051
            ],
            [
                14051,
                14073
            ],
            [
                14073,
                14088
            ],
            [
                14088,
                14128
            ],
            [
                14128,
                14175
            ],
            [
                14175,
                14206
            ],
            [
                14206,
                14318
            ],
            [
                14318,
                14348
            ],
            [
                14348,
                14358
            ],
            [
                14358,
                14372
            ],
            [
                14372,
                14388
            ],
            [
                14388,
                14424
            ],
            [
                14424,
                14459
            ],
            [
                14459,
                14486
            ],
            [
                14486,
                14532
            ],
            [
                14532,
                14554
            ],
            [
                14554,
                14590
            ],
            [
                14590,
                14711
            ],
            [
                14711,
                14735
            ],
            [
                14735,
                14768
            ],
            [
                14768,
                14837
            ],
            [
                14837,
                14877
            ],
            [
                14877,
                14934
            ],
            [
                14934,
                14947
            ],
            [
                14947,
                15028
            ],
            [
                15028,
                15043
            ],
            [
                15043,
                15090
            ],
            [
                15090,
                15112
            ],
            [
                15112,
                15141
            ],
            [
                15141,
                15175
            ],
            [
                15175,
                15226
            ],
            [
                15226,
                15281
            ],
            [
                15281,
                15298
            ]
        ],
        "overlap_chars": [
            [
                0,
                25
            ],
            [
                25,
                162
            ],
            [
                162,
                164
            ],
            [
                164,
                166
            ],
            [
                167,
                171
            ],
            [
                172,
                180
            ],
            [
                180,
                181
            ],
            [
                182,
                185
            ],
            [
                186,
                195
            ],
            [
                201,
                256
            ],
            [
                256,
                258
            ],
            [
                264,
                318
            ],
            [
                322,
                345
            ],
            [
                345,
                384
            ],
            [
                385,
                405
            ],
            [
                405,
                413
            ],
            [
                419,
                422
            ],
            [
                423,
                447
            ],
            [
                447,
                527
            ],
            [
                527,
                562
            ],
            [
                563,
                640
            ],
            [
                641,
                649
            ],
            [
                661,
                685
            ],
            [
                685,
                761
            ],
            [
                761,
                798
            ],
            [
                799,
                804
            ],
            [
                804,
                885
            ],
            [
                885,
                917
            ],
            [
                918,
                1005
            ],
            [
                1008,
                1012
            ],
            [
                1014,
                1024
            ],
            [
                1025,
                1079
            ],
            [
                1084,
                1121
            ],
            [
                1121,
                1150
            ],
            [
                1151,
                1185
            ],
            [
                1186,
                1190
            ],
            [
                1198,
                1203
            ],
            [
                1207,
                1241
            ],
            [
                1241,
                1243
            ],
            [
                1243,
                1245
            ],
            [
                1246,
                1287
            ],
            [
                1289,
                1387
            ],
            [
                1388,
                1408
            ],
            [
                1408,
                1420
            ],
            [
                1420,
                1428
            ],
            [
                1436,
                1438
            ],
            [
                1438,
                1504
            ],
            [
                1504,
                1519
            ],
            [
                1520,
                1521
            ],
            [
                1521,
                1562
            ],
            [
                1562,
                1631
            ],
            [
                1631,
                1643
            ],
            [
                1643,
                1690
            ],
            [
                1690,
                1719
            ],
            [
                1722,
                1759
            ],
            [
                1759,
                1774
            ],
            [
                1775,
                1788
            ],
            [
                1788,
                1789
            ],
            [
                1790,
                1793
            ],
            [
                1797,
                1811
            ],
            [
                1817,
                1818
            ],
            [
                1819,
                1828
            ],
            [
                1829,
                1833
            ],
            [
                1858,
                1861
            ],
            [
                1862,
                1912
            ],
            [
                1913,
                2007
            ],
            [
                2007,
                2035
            ],
            [
                2035,
                2101
            ],
            [
                2102,
                2103
            ],
            [
                2104,
                2114
            ],
            [
                2114,
                2152
            ],
            [
                2152,
                2176
            ],
            [
                2176,
                2221
            ],
            [
                2226,
                2228
            ],
            [
                2228,
                2234
            ],
            [
                2235,
                2275
            ],
            [
                2281,
                2292
            ],
            [
                2293,
                2304
            ],
            [
                2305,
                2311
            ],
            [
                2311,
                2328
            ],
            [
                2338,
                2385
            ],
            [
                2385,
                2413
            ],
            [
                2413,
                2415
            ],
            [
                2415,
                2422
            ],
            [
                2428,
                2444
            ],
            [
                2447,
                2496
            ],
            [
                2499,
                2508
            ],
            [
                2514,
                2571
            ],
            [
                2571,
                2573
            ],
            [
                2573,
                2582
            ],
            [
                2593,
                2601
            ],
            [
                2602,
                2611
            ],
            [
                2612,
                2622
            ],
            [
                2622,
                2624
            ],
            [
                2624,
                2640
            ],
            [
                2640,
                2642
            ],
            [
                2642,
                2646
            ],
            [
                2647,
                2649
            ],
            [
                2650,
                2690
            ],
            [
                2690,
                2692
            ],
            [
                2715,
                2720
            ],
            [
                2721,
                2742
            ],
            [
                2745,
                2765
            ],
            [
                2765,
                2794
            ],
            [
                2795,
                2810
            ],
            [
                2811,
                2814
            ],
            [
                2816,
                2819
            ],
            [
                2825,
                2835
            ],
            [
                2836,
                2855
            ],
            [
                2864,
                2880
            ],
            [
                2880,
                2950
            ],
            [
                2950,
                2975
            ],
            [
                2976,
                3023
            ],
            [
                3023,
                3046
            ],
            [
                3046,
                3060
            ],
            [
                3060,
                3062
            ],
            [
                3062,
                3075
            ],
            [
                3078,
                3103
            ],
            [
                3103,
                3125
            ],
            [
                3125,
                3131
            ],
            [
                3132,
                3140
            ],
            [
                3141,
                3153
            ],
            [
                3153,
                3154
            ],
            [
                3155,
                3184
            ],
            [
                3184,
                3224
            ],
            [
                3230,
                3264
            ],
            [
                3264,
                3309
            ],
            [
                3315,
                3376
            ],
            [
                3388,
                3433
            ],
            [
                3434,
                3459
            ],
            [
                3460,
                3475
            ],
            [
                3475,
                3477
            ],
            [
                3477,
                3483
            ],
            [
                3484,
                3487
            ],
            [
                3492,
                3499
            ],
            [
                3500,
                3504
            ],
            [
                3519,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3555,
                3604
            ],
            [
                3604,
                3613
            ],
            [
                3615,
                3664
            ],
            [
                3664,
                3667
            ],
            [
                3667,
                3668
            ],
            [
                3668,
                3705
            ],
            [
                3706,
                3729
            ],
            [
                3729,
                3738
            ],
            [
                3738,
                3741
            ],
            [
                3741,
                3757
            ],
            [
                3758,
                3801
            ],
            [
                3802,
                3868
            ],
            [
                3868,
                3884
            ],
            [
                3884,
                3933
            ],
            [
                3933,
                3954
            ],
            [
                3955,
                3997
            ],
            [
                3998,
                4026
            ],
            [
                4028,
                4039
            ],
            [
                4040,
                4051
            ],
            [
                4057,
                4090
            ],
            [
                4090,
                4105
            ],
            [
                4105,
                4125
            ],
            [
                4125,
                4154
            ],
            [
                4154,
                4277
            ],
            [
                4277,
                4280
            ],
            [
                4280,
                4303
            ],
            [
                4312,
                4329
            ],
            [
                4329,
                4460
            ],
            [
                4460,
                4506
            ],
            [
                4506,
                4509
            ],
            [
                4510,
                4514
            ],
            [
                4532,
                4545
            ],
            [
                4546,
                4548
            ],
            [
                4549,
                4562
            ],
            [
                4574,
                4614
            ],
            [
                4615,
                4622
            ],
            [
                4622,
                4670
            ],
            [
                4680,
                4763
            ],
            [
                4764,
                4799
            ],
            [
                4800,
                4856
            ],
            [
                4856,
                4934
            ],
            [
                4935,
                4976
            ],
            [
                4977,
                4985
            ],
            [
                4996,
                5009
            ],
            [
                5009,
                5029
            ],
            [
                5034,
                5036
            ],
            [
                5037,
                5040
            ],
            [
                5041,
                5054
            ],
            [
                5060,
                5087
            ],
            [
                5088,
                5093
            ],
            [
                5094,
                5102
            ],
            [
                5103,
                5135
            ],
            [
                5135,
                5183
            ],
            [
                5183,
                5232
            ],
            [
                5232,
                5264
            ],
            [
                5264,
                5289
            ],
            [
                5289,
                5322
            ],
            [
                5323,
                5350
            ],
            [
                5350,
                5412
            ],
            [
                5412,
                5425
            ],
            [
                5425,
                5469
            ],
            [
                5471,
                5488
            ],
            [
                5489,
                5501
            ],
            [
                5501,
                5530
            ],
            [
                5531,
                5564
            ],
            [
                5564,
                5598
            ],
            [
                5598,
                5642
            ],
            [
                5642,
                5693
            ],
            [
                5706,
                5708
            ],
            [
                5708,
                5726
            ],
            [
                5727,
                5735
            ],
            [
                5736,
                5740
            ],
            [
                5741,
                5743
            ],
            [
                5744,
                5747
            ],
            [
                5748,
                5760
            ],
            [
                5761,
                5771
            ],
            [
                5772,
                5775
            ],
            [
                5776,
                5852
            ],
            [
                5853,
                5880
            ],
            [
                5881,
                5894
            ],
            [
                5908,
                5915
            ],
            [
                5916,
                5932
            ],
            [
                5932,
                6004
            ],
            [
                6005,
                6037
            ],
            [
                6037,
                6045
            ],
            [
                6045,
                6145
            ],
            [
                6145,
                6165
            ],
            [
                6165,
                6199
            ],
            [
                6199,
                6211
            ],
            [
                6211,
                6213
            ],
            [
                6213,
                6296
            ],
            [
                6297,
                6348
            ],
            [
                6348,
                6385
            ],
            [
                6385,
                6423
            ],
            [
                6423,
                6456
            ],
            [
                6460,
                6496
            ],
            [
                6496,
                6498
            ],
            [
                6498,
                6585
            ],
            [
                6585,
                6653
            ],
            [
                6653,
                6656
            ],
            [
                6657,
                6683
            ],
            [
                6686,
                6701
            ],
            [
                6702,
                6711
            ],
            [
                6711,
                6732
            ],
            [
                6732,
                6734
            ],
            [
                6734,
                6743
            ],
            [
                6744,
                6761
            ],
            [
                6761,
                6790
            ],
            [
                6791,
                6879
            ],
            [
                6879,
                6905
            ],
            [
                6905,
                6927
            ],
            [
                6927,
                6939
            ],
            [
                6940,
                6947
            ],
            [
                6948,
                6961
            ],
            [
                6962,
                6965
            ],
            [
                6966,
                7019
            ],
            [
                7019,
                7047
            ],
            [
                7047,
                7063
            ],
            [
                7063,
                7088
            ],
            [
                7090,
                7126
            ],
            [
                7126,
                7206
            ],
            [
                7206,
                7209
            ],
            [
                7209,
                7221
            ],
            [
                7221,
                7257
            ],
            [
                7257,
                7328
            ],
            [
                7328,
                7334
            ],
            [
                7335,
                7401
            ],
            [
                7401,
                7436
            ],
            [
                7436,
                7463
            ],
            [
                7463,
                7465
            ],
            [
                7465,
                7479
            ],
            [
                7479,
                7516
            ],
            [
                7516,
                7532
            ],
            [
                7532,
                7551
            ],
            [
                7552,
                7557
            ],
            [
                7557,
                7559
            ],
            [
                7559,
                7583
            ],
            [
                7583,
                7656
            ],
            [
                7660,
                7662
            ],
            [
                7662,
                7736
            ],
            [
                7736,
                7781
            ],
            [
                7781,
                7805
            ],
            [
                7805,
                7846
            ],
            [
                7849,
                7952
            ],
            [
                7954,
                7956
            ],
            [
                7957,
                7962
            ],
            [
                7966,
                7974
            ],
            [
                7975,
                7978
            ],
            [
                7989,
                8048
            ],
            [
                8048,
                8072
            ],
            [
                8072,
                8096
            ],
            [
                8099,
                8121
            ],
            [
                8121,
                8140
            ],
            [
                8140,
                8145
            ],
            [
                8146,
                8166
            ],
            [
                8172,
                8239
            ],
            [
                8239,
                8382
            ],
            [
                8383,
                8386
            ],
            [
                8387,
                8393
            ],
            [
                8394,
                8417
            ],
            [
                8421,
                8455
            ],
            [
                8456,
                8468
            ],
            [
                8469,
                8473
            ],
            [
                8477,
                8479
            ],
            [
                8479,
                8536
            ],
            [
                8536,
                8586
            ],
            [
                8586,
                8630
            ],
            [
                8630,
                8631
            ],
            [
                8631,
                8641
            ],
            [
                8642,
                8718
            ],
            [
                8718,
                8755
            ],
            [
                8757,
                8760
            ],
            [
                8766,
                8777
            ],
            [
                8777,
                8797
            ],
            [
                8797,
                8846
            ],
            [
                8846,
                8875
            ],
            [
                8876,
                8881
            ],
            [
                8907,
                8956
            ],
            [
                8957,
                8974
            ],
            [
                8976,
                8985
            ],
            [
                8986,
                8989
            ],
            [
                8990,
                9013
            ],
            [
                9016,
                9023
            ],
            [
                9026,
                9034
            ],
            [
                9036,
                9189
            ],
            [
                9192,
                9208
            ],
            [
                9210,
                9216
            ],
            [
                9217,
                9247
            ],
            [
                9248,
                9251
            ],
            [
                9252,
                9285
            ],
            [
                9285,
                9286
            ],
            [
                9291,
                9300
            ],
            [
                9300,
                9315
            ],
            [
                9315,
                9359
            ],
            [
                9370,
                9430
            ],
            [
                9430,
                9461
            ],
            [
                9461,
                9513
            ],
            [
                9530,
                9571
            ],
            [
                9571,
                9611
            ],
            [
                9611,
                9655
            ],
            [
                9660,
                9662
            ],
            [
                9663,
                9672
            ],
            [
                9672,
                9675
            ],
            [
                9675,
                9697
            ],
            [
                9697,
                9714
            ],
            [
                9717,
                9720
            ],
            [
                9721,
                9735
            ],
            [
                9744,
                9751
            ],
            [
                9757,
                9773
            ],
            [
                9774,
                9796
            ],
            [
                9796,
                9797
            ],
            [
                9798,
                9815
            ],
            [
                9816,
                9826
            ],
            [
                9833,
                9848
            ],
            [
                9857,
                9860
            ],
            [
                9860,
                9927
            ],
            [
                9927,
                10030
            ],
            [
                10031,
                10035
            ],
            [
                10038,
                10061
            ],
            [
                10061,
                10064
            ],
            [
                10065,
                10069
            ],
            [
                10070,
                10072
            ],
            [
                10073,
                10083
            ],
            [
                10083,
                10111
            ],
            [
                10116,
                10118
            ],
            [
                10131,
                10134
            ],
            [
                10134,
                10184
            ],
            [
                10185,
                10211
            ],
            [
                10211,
                10222
            ],
            [
                10234,
                10244
            ],
            [
                10245,
                10269
            ],
            [
                10269,
                10270
            ],
            [
                10275,
                10277
            ],
            [
                10277,
                10290
            ],
            [
                10295,
                10304
            ],
            [
                10305,
                10329
            ],
            [
                10332,
                10361
            ],
            [
                10361,
                10362
            ],
            [
                10366,
                10393
            ],
            [
                10406,
                10413
            ],
            [
                10417,
                10426
            ],
            [
                10430,
                10439
            ],
            [
                10439,
                10442
            ],
            [
                10442,
                10443
            ],
            [
                10447,
                10456
            ],
            [
                10465,
                10468
            ],
            [
                10468,
                10476
            ],
            [
                10476,
                10494
            ],
            [
                10495,
                10505
            ],
            [
                10506,
                10516
            ],
            [
                10520,
                10538
            ],
            [
                10538,
                10602
            ],
            [
                10602,
                10606
            ],
            [
                10615,
                10621
            ],
            [
                10621,
                10623
            ],
            [
                10623,
                10682
            ],
            [
                10683,
                10711
            ],
            [
                10711,
                10726
            ],
            [
                10727,
                10741
            ],
            [
                10742,
                10763
            ],
            [
                10763,
                10807
            ],
            [
                10807,
                10810
            ],
            [
                10811,
                10874
            ],
            [
                10876,
                10897
            ],
            [
                10898,
                10900
            ],
            [
                10905,
                10913
            ],
            [
                10920,
                10969
            ],
            [
                10969,
                10989
            ],
            [
                10992,
                11004
            ],
            [
                11004,
                11006
            ],
            [
                11006,
                11033
            ],
            [
                11036,
                11075
            ],
            [
                11078,
                11104
            ],
            [
                11104,
                11126
            ],
            [
                11126,
                11138
            ],
            [
                11139,
                11151
            ],
            [
                11151,
                11191
            ],
            [
                11191,
                11201
            ],
            [
                11202,
                11207
            ],
            [
                11211,
                11220
            ],
            [
                11221,
                11241
            ],
            [
                11242,
                11262
            ],
            [
                11262,
                11299
            ],
            [
                11299,
                11339
            ],
            [
                11342,
                11374
            ],
            [
                11374,
                11392
            ],
            [
                11392,
                11456
            ],
            [
                11456,
                11458
            ],
            [
                11458,
                11552
            ],
            [
                11552,
                11565
            ],
            [
                11565,
                11578
            ],
            [
                11597,
                11610
            ],
            [
                11610,
                11620
            ],
            [
                11621,
                11630
            ],
            [
                11632,
                11634
            ],
            [
                11635,
                11645
            ],
            [
                11649,
                11653
            ],
            [
                11654,
                11669
            ],
            [
                11671,
                11686
            ],
            [
                11701,
                11716
            ],
            [
                11716,
                11718
            ],
            [
                11718,
                11743
            ],
            [
                11759,
                11762
            ],
            [
                11763,
                11781
            ],
            [
                11781,
                11787
            ],
            [
                11794,
                11797
            ],
            [
                11798,
                11805
            ],
            [
                11812,
                11844
            ],
            [
                11847,
                11878
            ],
            [
                11884,
                11903
            ],
            [
                11903,
                11905
            ],
            [
                11905,
                11906
            ],
            [
                11907,
                11910
            ],
            [
                11922,
                11924
            ],
            [
                11925,
                11929
            ],
            [
                11930,
                11939
            ],
            [
                11939,
                11964
            ],
            [
                11964,
                11965
            ],
            [
                11966,
                11968
            ],
            [
                11969,
                11987
            ],
            [
                11988,
                11992
            ],
            [
                11993,
                11997
            ],
            [
                11998,
                12012
            ],
            [
                12012,
                12014
            ],
            [
                12014,
                12047
            ],
            [
                12051,
                12081
            ],
            [
                12081,
                12094
            ],
            [
                12094,
                12113
            ],
            [
                12127,
                12129
            ],
            [
                12129,
                12132
            ],
            [
                12138,
                12152
            ],
            [
                12152,
                12173
            ],
            [
                12181,
                12184
            ],
            [
                12185,
                12205
            ],
            [
                12208,
                12230
            ],
            [
                12231,
                12235
            ],
            [
                12236,
                12271
            ],
            [
                12271,
                12287
            ],
            [
                12288,
                12297
            ],
            [
                12297,
                12354
            ],
            [
                12354,
                12357
            ],
            [
                12357,
                12369
            ],
            [
                12369,
                12371
            ],
            [
                12379,
                12393
            ],
            [
                12396,
                12408
            ],
            [
                12408,
                12447
            ],
            [
                12447,
                12476
            ],
            [
                12477,
                12527
            ],
            [
                12529,
                12613
            ],
            [
                12613,
                12630
            ],
            [
                12630,
                12633
            ],
            [
                12634,
                12637
            ],
            [
                12638,
                12659
            ],
            [
                12659,
                12672
            ],
            [
                12672,
                12678
            ],
            [
                12678,
                12681
            ],
            [
                12681,
                12688
            ],
            [
                12689,
                12691
            ],
            [
                12692,
                12704
            ],
            [
                12714,
                12778
            ],
            [
                12778,
                12779
            ],
            [
                12779,
                12780
            ],
            [
                12781,
                12786
            ],
            [
                12787,
                12820
            ],
            [
                12821,
                12831
            ],
            [
                12832,
                12839
            ],
            [
                12839,
                12841
            ],
            [
                12841,
                12870
            ],
            [
                12870,
                12873
            ],
            [
                12874,
                12876
            ],
            [
                12877,
                12910
            ],
            [
                12910,
                12924
            ],
            [
                12924,
                12959
            ],
            [
                12959,
                12983
            ],
            [
                12986,
                13047
            ],
            [
                13047,
                13128
            ],
            [
                13129,
                13160
            ],
            [
                13160,
                13192
            ],
            [
                13192,
                13251
            ],
            [
                13251,
                13306
            ],
            [
                13306,
                13307
            ],
            [
                13307,
                13341
            ],
            [
                13341,
                13342
            ],
            [
                13346,
                13367
            ],
            [
                13367,
                13370
            ],
            [
                13370,
                13398
            ],
            [
                13407,
                13411
            ],
            [
                13411,
                13412
            ],
            [
                13428,
                13431
            ],
            [
                13432,
                13435
            ],
            [
                13436,
                13466
            ],
            [
                13468,
                13497
            ],
            [
                13499,
                13589
            ],
            [
                13589,
                13620
            ],
            [
                13620,
                13640
            ],
            [
                13648,
                13675
            ],
            [
                13675,
                13694
            ],
            [
                13694,
                13697
            ],
            [
                13697,
                13733
            ],
            [
                13733,
                13753
            ],
            [
                13753,
                13756
            ],
            [
                13756,
                13773
            ],
            [
                13776,
                13783
            ],
            [
                13783,
                13824
            ],
            [
                13824,
                13832
            ],
            [
                13832,
                13835
            ],
            [
                13840,
                13843
            ],
            [
                13844,
                13871
            ],
            [
                13872,
                13876
            ],
            [
                13880,
                13893
            ],
            [
                13893,
                13917
            ],
            [
                13926,
                13933
            ],
            [
                13935,
                13953
            ],
            [
                13956,
                13966
            ],
            [
                13966,
                13968
            ],
            [
                13968,
                13990
            ],
            [
                13995,
                14004
            ],
            [
                14006,
                14009
            ],
            [
                14020,
                14023
            ],
            [
                14023,
                14041
            ],
            [
                14041,
                14042
            ],
            [
                14049,
                14051
            ],
            [
                14051,
                14070
            ],
            [
                14073,
                14088
            ],
            [
                14088,
                14108
            ],
            [
                14113,
                14128
            ],
            [
                14128,
                14173
            ],
            [
                14173,
                14175
            ],
            [
                14175,
                14206
            ],
            [
                14206,
                14270
            ],
            [
                14271,
                14282
            ],
            [
                14287,
                14299
            ],
            [
                14316,
                14318
            ],
            [
                14318,
                14325
            ],
            [
                14334,
                14341
            ],
            [
                14342,
                14348
            ],
            [
                14348,
                14358
            ],
            [
                14358,
                14359
            ],
            [
                14367,
                14370
            ],
            [
                14372,
                14388
            ],
            [
                14388,
                14424
            ],
            [
                14424,
                14450
            ],
            [
                14450,
                14459
            ],
            [
                14459,
                14474
            ],
            [
                14475,
                14477
            ],
            [
                14478,
                14484
            ],
            [
                14484,
                14485
            ],
            [
                14486,
                14507
            ],
            [
                14507,
                14512
            ],
            [
                14513,
                14532
            ],
            [
                14532,
                14536
            ],
            [
                14537,
                14552
            ],
            [
                14552,
                14554
            ],
            [
                14554,
                14590
            ],
            [
                14590,
                14711
            ],
            [
                14712,
                14735
            ],
            [
                14735,
                14768
            ],
            [
                14768,
                14837
            ],
            [
                14844,
                14874
            ],
            [
                14874,
                14877
            ],
            [
                14877,
                14934
            ],
            [
                14934,
                14947
            ],
            [
                14947,
                15026
            ],
            [
                15028,
                15031
            ],
            [
                15037,
                15043
            ],
            [
                15043,
                15070
            ],
            [
                15073,
                15090
            ],
            [
                15090,
                15112
            ],
            [
                15112,
                15141
            ],
            [
                15141,
                15144
            ],
            [
                15145,
                15156
            ],
            [
                15157,
                15160
            ],
            [
                15168,
                15172
            ],
            [
                15172,
                15175
            ],
            [
                15175,
                15226
            ],
            [
                15226,
                15279
            ],
            [
                15288,
                15289
            ],
            [
                15296,
                15298
            ]
        ],
        "row_chars": [
            [
                0,
                25
            ],
            [
                25,
                25
            ],
            [
                25,
                164
            ],
            [
                164,
                258
            ],
            [
                258,
                345
            ],
            [
                345,
                405
            ],
            [
                405,
                447
            ],
            [
                447,
                527
            ],
            [
                527,
                563
            ],
            [
                563,
                563
            ],
            [
                563,
                685
            ],
            [
                685,
                761
            ],
            [
                761,
                804
            ],
            [
                804,
                885
            ],
            [
                885,
                885
            ],
            [
                885,
                1005
            ],
            [
                1005,
                1079
            ],
            [
                1079,
                1121
            ],
            [
                1121,
                1243
            ],
            [
                1243,
                1289
            ],
            [
                1289,
                1408
            ],
            [
                1408,
                1420
            ],
            [
                1420,
                1438
            ],
            [
                1438,
                1438
            ],
            [
                1438,
                1438
            ],
            [
                1438,
                1438
            ],
            [
                1438,
                1438
            ],
            [
                1438,
                1438
            ],
            [
                1438,
                1504
            ],
            [
                1504,
                1504
            ],
            [
                1504,
                1520
            ],
            [
                1520,
                1520
            ],
            [
                1520,
                1520
            ],
            [
                1520,
                1520
            ],
            [
                1520,
                1520
            ],
            [
                1520,
                1562
            ],
            [
                1562,
                1631
            ],
            [
                1631,
                1643
            ],
            [
                1643,
                1690
            ],
            [
                1690,
                1759
            ],
            [
                1759,
                1913
            ],
            [
                1913,
                1913
            ],
            [
                1913,
                2007
            ],
            [
                2007,
                2114
            ],
            [
                2114,
                2152
            ],
            [
                2152,
                2176
            ],
            [
                2176,
                2228
            ],
            [
                2228,
                2311
            ],
            [
                2311,
                2385
            ],
            [
                2385,
                2415
            ],
            [
                2415,
                2496
            ],
            [
                2496,
                2496
            ],
            [
                2496,
                2573
            ],
            [
                2573,
                2624
            ],
            [
                2624,
                2642
            ],
            [
                2642,
                2692
            ],
            [
                2692,
                2765
            ],
            [
                2765,
                2816
            ],
            [
                2816,
                2816
            ],
            [
                2816,
                2880
            ],
            [
                2880,
                2950
            ],
            [
                2950,
                3023
            ],
            [
                3023,
                3046
            ],
            [
                3046,
                3062
            ],
            [
                3062,
                3103
            ],
            [
                3103,
                3125
            ],
            [
                3125,
                3184
            ],
            [
                3184,
                3264
            ],
            [
                3264,
                3376
            ],
            [
                3376,
                3477
            ],
            [
                3477,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3555,
                3604
            ],
            [
                3604,
                3615
            ],
            [
                3615,
                3615
            ],
            [
                3615,
                3667
            ],
            [
                3667,
                3741
            ],
            [
                3741,
                3868
            ],
            [
                3868,
                3884
            ],
            [
                3884,
                3933
            ],
            [
                3933,
                4028
            ],
            [
                4028,
                4028
            ],
            [
                4028,
                4028
            ],
            [
                4028,
                4090
            ],
            [
                4090,
                4105
            ],
            [
                4105,
                4154
            ],
            [
                4154,
                4280
            ],
            [
                4280,
                4329
            ],
            [
                4329,
                4460
            ],
            [
                4460,
                4506
            ],
            [
                4506,
                4506
            ],
            [
                4506,
                4506
            ],
            [
                4506,
                4506
            ],
            [
                4506,
                4564
            ],
            [
                4564,
                4622
            ],
            [
                4622,
                4856
            ],
            [
                4856,
                5009
            ],
            [
                5009,
                5183
            ],
            [
                5183,
                5232
            ],
            [
                5232,
                5264
            ],
            [
                5264,
                5289
            ],
            [
                5289,
                5350
            ],
            [
                5350,
                5412
            ],
            [
                5412,
                5425
            ],
            [
                5425,
                5564
            ],
            [
                5564,
                5598
            ],
            [
                5598,
                5708
            ],
            [
                5708,
                5932
            ],
            [
                5932,
                6037
            ],
            [
                6037,
                6045
            ],
            [
                6045,
                6145
            ],
            [
                6145,
                6165
            ],
            [
                6165,
                6165
            ],
            [
                6165,
                6165
            ],
            [
                6165,
                6199
            ],
            [
                6199,
                6213
            ],
            [
                6213,
                6348
            ],
            [
                6348,
                6385
            ],
            [
                6385,
                6423
            ],
            [
                6423,
                6456
            ],
            [
                6456,
                6456
            ],
            [
                6456,
                6498
            ],
            [
                6498,
                6498
            ],
            [
                6498,
                6585
            ],
            [
                6585,
                6653
            ],
            [
                6653,
                6734
            ],
            [
                6734,
                6790
            ],
            [
                6790,
                6790
            ],
            [
                6790,
                6879
            ],
            [
                6879,
                6905
            ],
            [
                6905,
                6905
            ],
            [
                6905,
                6905
            ],
            [
                6905,
                6927
            ],
            [
                6927,
                7019
            ],
            [
                7019,
                7047
            ],
            [
                7047,
                7063
            ],
            [
                7063,
                7090
            ],
            [
                7090,
                7090
            ],
            [
                7090,
                7090
            ],
            [
                7090,
                7126
            ],
            [
                7126,
                7209
            ],
            [
                7209,
                7221
            ],
            [
                7221,
                7257
            ],
            [
                7257,
                7328
            ],
            [
                7328,
                7401
            ],
            [
                7401,
                7401
            ],
            [
                7401,
                7401
            ],
            [
                7401,
                7436
            ],
            [
                7436,
                7465
            ],
            [
                7465,
                7479
            ],
            [
                7479,
                7479
            ],
            [
                7479,
                7479
            ],
            [
                7479,
                7516
            ],
            [
                7516,
                7516
            ],
            [
                7516,
                7516
            ],
            [
                7516,
                7516
            ],
            [
                7516,
                7532
            ],
            [
                7532,
                7532
            ],
            [
                7532,
                7559
            ],
            [
                7559,
                7662
            ],
            [
                7662,
                7736
            ],
            [
                7736,
                7781
            ],
            [
                7781,
                7805
            ],
            [
                7805,
                7849
            ],
            [
                7849,
                7954
            ],
            [
                7954,
                8048
            ],
            [
                8048,
                8072
            ],
            [
                8072,
                8099
            ],
            [
                8099,
                8099
            ],
            [
                8099,
                8121
            ],
            [
                8121,
                8239
            ],
            [
                8239,
                8479
            ],
            [
                8479,
                8536
            ],
            [
                8536,
                8630
            ],
            [
                8630,
                8718
            ],
            [
                8718,
                8757
            ],
            [
                8757,
                8757
            ],
            [
                8757,
                8777
            ],
            [
                8777,
                8797
            ],
            [
                8797,
                8846
            ],
            [
                8846,
                8883
            ],
            [
                8883,
                8883
            ],
            [
                8883,
                8883
            ],
            [
                8883,
                9036
            ],
            [
                9036,
                9036
            ],
            [
                9036,
                9210
            ],
            [
                9210,
                9300
            ],
            [
                9300,
                9315
            ],
            [
                9315,
                9315
            ],
            [
                9315,
                9315
            ],
            [
                9315,
                9360
            ],
            [
                9360,
                9360
            ],
            [
                9360,
                9430
            ],
            [
                9430,
                9461
            ],
            [
                9461,
                9530
            ],
            [
                9530,
                9571
            ],
            [
                9571,
                9611
            ],
            [
                9611,
                9675
            ],
            [
                9675,
                9697
            ],
            [
                9697,
                9796
            ],
            [
                9796,
                9815
            ],
            [
                9815,
                9815
            ],
            [
                9815,
                9860
            ],
            [
                9860,
                9927
            ],
            [
                9927,
                9927
            ],
            [
                9927,
                9927
            ],
            [
                9927,
                9927
            ],
            [
                9927,
                10064
            ],
            [
                10064,
                10064
            ],
            [
                10064,
                10083
            ],
            [
                10083,
                10134
            ],
            [
                10134,
                10211
            ],
            [
                10211,
                10269
            ],
            [
                10269,
                10277
            ],
            [
                10277,
                10332
            ],
            [
                10332,
                10361
            ],
            [
                10361,
                10393
            ],
            [
                10393,
                10442
            ],
            [
                10442,
                10468
            ],
            [
                10468,
                10538
            ],
            [
                10538,
                10602
            ],
            [
                10602,
                10602
            ],
            [
                10602,
                10602
            ],
            [
                10602,
                10602
            ],
            [
                10602,
                10602
            ],
            [
                10602,
                10623
            ],
            [
                10623,
                10711
            ],
            [
                10711,
                10763
            ],
            [
                10763,
                10810
            ],
            [
                10810,
                10810
            ],
            [
                10810,
                10876
            ],
            [
                10876,
                10876
            ],
            [
                10876,
                10876
            ],
            [
                10876,
                10876
            ],
            [
                10876,
                10969
            ],
            [
                10969,
                11006
            ],
            [
                11006,
                11104
            ],
            [
                11104,
                11126
            ],
            [
                11126,
                11151
            ],
            [
                11151,
                11191
            ],
            [
                11191,
                11262
            ],
            [
                11262,
                11262
            ],
            [
                11262,
                11262
            ],
            [
                11262,
                11299
            ],
            [
                11299,
                11374
            ],
            [
                11374,
                11392
            ],
            [
                11392,
                11458
            ],
            [
                11458,
                11552
            ],
            [
                11552,
                11565
            ],
            [
                11565,
                11610
            ],
            [
                11610,
                11632
            ],
            [
                11632,
                11632
            ],
            [
                11632,
                11632
            ],
            [
                11632,
                11718
            ],
            [
                11718,
                11781
            ],
            [
                11781,
                11781
            ],
            [
                11781,
                11905
            ],
            [
                11905,
                12014
            ],
            [
                12014,
                12014
            ],
            [
                12014,
                12081
            ],
            [
                12081,
                12094
            ],
            [
                12094,
                12129
            ],
            [
                12129,
                12152
            ],
            [
                12152,
                12152
            ],
            [
                12152,
                12173
            ],
            [
                12173,
                12173
            ],
            [
                12173,
                12173
            ],
            [
                12173,
                12173
            ],
            [
                12173,
                12173
            ],
            [
                12173,
                12208
            ],
            [
                12208,
                12208
            ],
            [
                12208,
                12208
            ],
            [
                12208,
                12208
            ],
            [
                12208,
                12208
            ],
            [
                12208,
                12208
            ],
            [
                12208,
                12271
            ],
            [
                12271,
                12357
            ],
            [
                12357,
                12371
            ],
            [
                12371,
                12371
            ],
            [
                12371,
                12371
            ],
            [
                12371,
                12371
            ],
            [
                12371,
                12371
            ],
            [
                12371,
                12371
            ],
            [
                12371,
                12396
            ],
            [
                12396,
                12408
            ],
            [
                12408,
                12447
            ],
            [
                12447,
                12476
            ],
            [
                12476,
                12476
            ],
            [
                12476,
                12529
            ],
            [
                12529,
                12529
            ],
            [
                12529,
                12529
            ],
            [
                12529,
                12613
            ],
            [
                12613,
                12630
            ],
            [
                12630,
                12659
            ],
            [
                12659,
                12672
            ],
            [
                12672,
                12681
            ],
            [
                12681,
                12778
            ],
            [
                12778,
                12820
            ],
            [
                12820,
                12841
            ],
            [
                12841,
                12870
            ],
            [
                12870,
                12910
            ],
            [
                12910,
                12959
            ],
            [
                12959,
                13047
            ],
            [
                13047,
                13160
            ],
            [
                13160,
                13192
            ],
            [
                13192,
                13251
            ],
            [
                13251,
                13306
            ],
            [
                13306,
                13370
            ],
            [
                13370,
                13398
            ],
            [
                13398,
                13398
            ],
            [
                13398,
                13431
            ],
            [
                13431,
                13431
            ],
            [
                13431,
                13468
            ],
            [
                13468,
                13468
            ],
            [
                13468,
                13589
            ],
            [
                13589,
                13620
            ],
            [
                13620,
                13640
            ],
            [
                13640,
                13675
            ],
            [
                13675,
                13697
            ],
            [
                13697,
                13733
            ],
            [
                13733,
                13756
            ],
            [
                13756,
                13783
            ],
            [
                13783,
                13824
            ],
            [
                13824,
                13832
            ],
            [
                13832,
                13893
            ],
            [
                13893,
                13935
            ],
            [
                13935,
                13935
            ],
            [
                13935,
                13968
            ],
            [
                13968,
                14023
            ],
            [
                14023,
                14041
            ],
            [
                14041,
                14051
            ],
            [
                14051,
                14073
            ],
            [
                14073,
                14073
            ],
            [
                14073,
                14088
            ],
            [
                14088,
                14128
            ],
            [
                14128,
                14175
            ],
            [
                14175,
                14206
            ],
            [
                14206,
                14318
            ],
            [
                14318,
                14348
            ],
            [
                14348,
                14358
            ],
            [
                14358,
                14358
            ],
            [
                14358,
                14372
            ],
            [
                14372,
                14372
            ],
            [
                14372,
                14388
            ],
            [
                14388,
                14424
            ],
            [
                14424,
                14459
            ],
            [
                14459,
                14486
            ],
            [
                14486,
                14486
            ],
            [
                14486,
                14532
            ],
            [
                14532,
                14554
            ],
            [
                14554,
                14590
            ],
            [
                14590,
                14711
            ],
            [
                14711,
                14711
            ],
            [
                14711,
                14735
            ],
            [
                14735,
                14768
            ],
            [
                14768,
                14837
            ],
            [
                14837,
                14877
            ],
            [
                14877,
                14934
            ],
            [
                14934,
                14947
            ],
            [
                14947,
                15028
            ],
            [
                15028,
                15028
            ],
            [
                15028,
                15043
            ],
            [
                15043,
                15090
            ],
            [
                15090,
                15112
            ],
            [
                15112,
                15141
            ],
            [
                15141,
                15175
            ],
            [
                15175,
                15175
            ],
            [
                15175,
                15226
            ],
            [
                15226,
                15298
            ]
        ]
    }
}