{
    "original": {
        "text": "Moore's good spirits were still with him when he rose next morning. He and Joe Scott had both spent the night in the mill, availing themselves of certain sleeping accommodations producible from recesses in the front and back counting-houses. The master, always an early riser, was up somewhat sooner even than usual. He awoke his man by singing a French song as he made his toilet.\n\"Ye're not custen dahn, then, maister?\" cried Joe.\n\"Not a stiver, mon garon--which means, my lad. Get up, and we'll take a turn through the mill before the hands come in, and I'll explain my future plans. We'll have the machinery yet, Joseph. You never heard of Bruce, perhaps?\"\n\"And th' arrand (spider)? Yes, but I hev. I've read th' history o' Scotland, and happen knaw as mich on't as ye; and I understand ye to mean to say ye'll persevere.\"\n\"I do.\"\n\"Is there mony o' your mak' i' your country?\" inquired Joe, as he folded up his temporary bed, and put it away.\n\"In my country! Which is my country?\"\n\"Why, France--isn't it?\"\n\"Not it, indeed! The circumstance of the French having seized Antwerp, where I was born, does not make me a Frenchman.\"\n\"Holland, then?\"\n\"I am not a Dutchman. Now you are confounding Antwerp with Amsterdam.\"\n\"Flanders?\"\n\"I scorn the insinuation, Joe! I a Flamand! Have I a Flemish face--the clumsy nose standing out, the mean forehead falling back, the pale blue eyes ' fleur de tte'? Am I all body and no legs, like a Flamand? But you don't know what they are like, those Netherlanders. Joe, I'm an Anversois. My mother was an Anversoise, though she came of French lineage, which is the reason I speak French.\"\n\"But your father war Yorkshire, which maks ye a bit Yorkshire too; and onybody may see ye're akin to us, ye're so keen o' making brass, and getting forrards.\"\n\"Joe, you're an impudent dog; but I've always been accustomed to a boorish sort of insolence from my youth up. The 'classe ouvrire'--that is, the working people in Belgium--bear themselves brutally towards their employers; and by _brutally_, Joe, I mean _brutalement_--which, perhaps, when properly translated, should be _roughly_.\"\n\"We allus speak our minds i' this country; and them young parsons and grand folk fro' London is shocked at wer 'incivility;' and we like weel enough to gi'e 'em summat to be shocked at, 'cause it's sport to us to watch 'em turn up the whites o' their een, and spreed out their bits o' hands, like as they're flayed wi' bogards, and then to hear 'em say, nipping off their words short like, 'Dear! dear! Whet seveges! How very corse!'\"\n\"You _are_ savages, Joe. You don't suppose you're civilized, do you?\"\n\"Middling, middling, maister. I reckon 'at us manufacturing lads i' th' north is a deal more intelligent, and knaws a deal more nor th' farming folk i' th' south. Trade sharpens wer wits; and them that's mechanics like me is forced to think. Ye know, what wi' looking after machinery and sich like, I've getten into that way that when I see an effect, I look straight out for a cause, and I oft lig hold on't to purpose; and then I like reading, and I'm curious to knaw what them that reckons to govern us aims to do for us and wi' us. And there's many 'cuter nor me; there's many a one amang them greasy chaps 'at smells o' oil, and amang them dyers wi' blue and black skins, that has a long head, and that can tell what a fooil of a law is, as well as ye or old Yorke, and a deal better nor soft uns like Christopher Sykes o' Whinbury, and greet hectoring nowts like yond' Irish Peter, Helstone's curate.\"\n\"You think yourself a clever fellow, I know, Scott.\"\n\"Ay! I'm fairish. I can tell cheese fro' chalk, and I'm varry weel aware that I've improved sich opportunities as I have had, a deal better nor some 'at reckons to be aboon me; but there's thousands i' Yorkshire that's as good as me, and a two-three that's better.\"\n\"You're a great man--you're a sublime fellow; but you're a prig, a conceited noodle with it all, Joe! You need not to think that because you've picked up a little knowledge of practical mathematics, and because you have found some scantling of the elements of chemistry at the bottom of a dyeing vat, that therefore you're a neglected man of science; and you need not to suppose that because the course of trade does not always run smooth, and you, and such as you, are sometimes short of work and of bread, that therefore your class are martyrs, and that the whole form of government under which you live is wrong. And, moreover, you need not for a moment to insinuate that the virtues have taken refuge in cottages and wholly abandoned slated houses. Let me tell you, I particularly abominate that sort of trash, because I know so well that human nature is human nature everywhere, whether under tile or thatch, and that in every specimen of human nature that breathes, vice and virtue are ever found blended, in smaller or greater proportions, and that the proportion is not determined by station. I have seen villains who were rich, and I have seen villains who were poor, and I have seen villains who were neither rich nor poor, but who had realized Agar's wish, and lived in fair and modest competency. The clock is going to strike six. Away with you, Joe, and ring the mill bell.\"\nIt was now the middle of the month of February; by six o'clock therefore dawn was just beginning to steal on night, to penetrate with a pale ray its brown obscurity, and give a demi-translucence to its opaque shadows. Pale enough that ray was on this particular morning: no colour tinged the east, no flush warmed it. To see what a heavy lid day slowly lifted, what a wan glance she flung along the hills, you would have thought the sun's fire quenched in last night's floods. The breath of this morning was chill as its aspect; a raw wind stirred the mass of night-cloud, and showed, as it slowly rose, leaving a colourless, silver-gleaming ring all round the horizon, not blue sky, but a stratum of paler vapour beyond. It had ceased to rain, but the earth was sodden, and the pools and rivulets were full.\nThe mill-windows were alight, the bell still rung loud, and now the little children came running in, in too great a hurry, let us hope, to feel very much nipped by the inclement air; and indeed, by contrast, perhaps the morning appeared rather favourable to them than otherwise, for they had often come to their work that winter through snow-storms, through heavy rain, through hard frost.\nMr. Moore stood at the entrance to watch them pass. He counted them as they went by. To those who came rather late he said a word of reprimand, which was a little more sharply repeated by Joe Scott when the lingerers reached the work-rooms. Neither master nor overlooker spoke savagely. They were not savage men either of them, though it appeared both were rigid, for they fined a delinquent who came considerably too late. Mr. Moore made him pay his penny down ere he entered, and informed him that the next repetition of the fault would cost him twopence.\nRules, no doubt, are necessary in such cases, and coarse and cruel masters will make coarse and cruel rules, which, at the time we treat of at least, they used sometimes to enforce tyrannically; but though I describe imperfect characters (every character in this book will be found to be more or less imperfect, my pen refusing to draw anything in the model line), I have not undertaken to handle degraded or utterly infamous ones. Child-torturers, slave masters and drivers, I consign to the hands of jailers. The novelist may be excused from sullying his page with the record of their deeds.\nInstead, then, of harrowing up my reader's soul and delighting his organ of wonder with effective descriptions of stripes and scourgings, I am happy to be able to inform him that neither Mr. Moore nor his overlooker ever struck a child in their mill. Joe had, indeed, once very severely flogged a son of his own for telling a lie and persisting in it; but, like his employer, he was too phlegmatic, too calm, as well as too reasonable a man, to make corporal chastisement other than the exception to his treatment of the young.\nMr. Moore haunted his mill, his mill-yard, his dye-house, and his warehouse till the sickly dawn strengthened into day. The sun even rose--at least a white disc, clear, tintless, and almost chill-looking as ice, peeped over the dark crest of a hill, changed to silver the livid edge of the cloud above it, and looked solemnly down the whole length of the den, or narrow dale, to whose strait bounds we are at present limited. It was eight o'clock; the mill lights were all extinguished; the signal was given for breakfast; the children, released for half an hour from toil, betook themselves to the little tin cans which held their coffee, and to the small baskets which contained their allowance of bread. Let us hope they have enough to eat; it would be a pity were it otherwise.\nAnd now at last Mr. Moore quitted the mill-yard, and bent his steps to his dwelling-house. It was only a short distance from the factory, but the hedge and high bank on each side of the lane which conducted to it seemed to give it something of the appearance and feeling of seclusion. It was a small, whitewashed place, with a green porch over the door; scanty brown stalks showed in the garden soil near this porch, and likewise beneath the windows--stalks budless and flowerless now, but giving dim prediction of trained and blooming creepers for summer days. A grass plat and borders fronted the cottage. The borders presented only black mould yet, except where, in sheltered nooks, the first shoots of snowdrop or crocus peeped, green as emerald, from the earth. The spring was late; it had been a severe and prolonged winter; the last deep snow had but just disappeared before yesterday's rains; on the hills, indeed, white remnants of it yet gleamed, flecking the hollows and crowning the peaks; the lawn was not verdant, but bleached, as was the grass on the bank, and under the hedge in the lane. Three trees, gracefully grouped, rose beside the cottage. They were not lofty, but having no rivals near, they looked well and imposing where they grew. Such was Mr. Moore's home--a snug nest for content and contemplation, but one within which the wings of action and ambition could not long lie folded.\nIts air of modest comfort seemed to possess no particular attraction for its owner. Instead of entering the house at once he fetched a spade from a little shed and began to work in the garden. For about a quarter of an hour he dug on uninterrupted. At length, however, a window opened, and a female voice called to him,--\n\"Eh, bien! Tu ne djenes pas ce matin?\"\nThe answer, and the rest of the conversation, was in French; but as this is an English book, I shall translate it into English.\n\"Is breakfast ready, Hortense?\"\n\"Certainly; it has been ready half an hour.\"\n\"Then I am ready too. I have a canine hunger.\"\nHe threw down his spade, and entered the house. The narrow passage conducted him to a small parlour, where a breakfast of coffee and bread and butter, with the somewhat un-English accompaniment of stewed pears, was spread on the table. Over these viands presided the lady who had spoken from the window. I must describe her before I go any farther.\nShe seemed a little older than Mr. Moore--perhaps she was thirty-five, tall, and proportionately stout; she had very black hair, for the present twisted up in curl-papers, a high colour in her cheeks, a small nose, a pair of little black eyes. The lower part of her face was large in proportion to the upper; her forehead was small and rather corrugated; she had a fretful though not an ill-natured expression of countenance; there was something in her whole appearance one felt inclined to be half provoked with and half amused at. The strangest point was her dress--a stuff petticoat and a striped cotton camisole. The petticoat was short, displaying well a pair of feet and ankles which left much to be desired in the article of symmetry.\nYou will think I have depicted a remarkable slattern, reader. Not at all. Hortense Moore (she was Mr. Moore's sister) was a very orderly, economical person. The petticoat, camisole, and curl-papers were her morning costume, in which, of forenoons, she had always been accustomed to \"go her household ways\" in her own country. She did not choose to adopt English fashions because she was obliged to live in England; she adhered to her old Belgian modes, quite satisfied that there was a merit in so doing.\nMademoiselle had an excellent opinion of herself--an opinion not wholly undeserved, for she possessed some good and sterling qualities; but she rather over-estimated the kind and degree of these qualities, and quite left out of the account sundry little defects which accompanied them. You could never have persuaded her that she was a prejudiced and narrow-minded person, that she was too susceptible on the subject of her own dignity and importance, and too apt to take offence about trifles; yet all this was true. However, where her claims to distinction were not opposed, and where her prejudices were not offended, she could be kind and friendly enough. To her two brothers (for there was another Grard Moore besides Robert) she was very much attached. As the sole remaining representatives of their decayed family, the persons of both were almost sacred in her eyes. Of Louis, however, she knew less than of Robert. He had been sent to England when a mere boy, and had received his education at an English school. His education not being such as to adapt him for trade, perhaps, too, his natural bent not inclining him to mercantile pursuits, he had, when the blight of hereditary prospects rendered it necessary for him to push his own fortune, adopted the very arduous and very modest career of a teacher. He had been usher in a school, and was said now to be tutor in a private family. Hortense, when she mentioned Louis, described him as having what she called \"des moyens,\" but as being too backward and quiet. Her praise of Robert was in a different strain, less qualified: she was very proud of him; she regarded him as the greatest man in Europe; all he said and did was remarkable in her eyes, and she expected others to behold him from the same point of view; nothing could be more irrational, monstrous, and infamous than opposition from any quarter to Robert, unless it were opposition to herself.\nAccordingly, as soon as the said Robert was seated at the breakfast-table, and she had helped him to a portion of stewed pears, and cut him a good-sized Belgian tartine, she began to pour out a flood of amazement and horror at the transaction of last night, the destruction of the frames.\n\"Quelle ide! to destroy them. Quelle action honteuse! On voyait bien que les ouvriers de ce pays taient la fois betes et mchants. C'tait absolument comme les domestiques anglais, les servantes surtout: rien d'insupportable comme cette Sara, par exemple!\"\n\"She looks clean and industrious,\" Mr. Moore remarked.\n\"Looks! I don't know how she looks, and I do not say that she is altogether dirty or idle, mais elle est d'une insolence! She disputed with me a quarter of an hour yesterday about the cooking of the beef; she said I boiled it to rags, that English people would never be able to eat such a dish as our bouilli, that the bouillon was no better than greasy warm water, and as to the choucroute, she affirms she cannot touch it! That barrel we have in the cellar--delightfully prepared by my own hands--she termed a tub of hog-wash, which means food for pigs. I am harassed with the girl, and yet I cannot part with her lest I should get a worse. You are in the same position with your workmen, pauvre cher frre!\"\n\"I am afraid you are not very happy in England, Hortense.\"\n\"It is my duty to be happy where you are, brother; but otherwise there are certainly a thousand things which make me regret our native town. All the world here appears to me ill-bred (mal-lev). I find my habits considered ridiculous. If a girl out of your mill chances to come into the kitchen and find me in my jupon and camisole preparing dinner (for you know I cannot trust Sarah to cook a single dish), she sneers. If I accept an invitation out to tea, which I have done once or twice, I perceive I am put quite into the background; I have not that attention paid me which decidedly is my due. Of what an excellent family are the Grards, as we know, and the Moores also! They have a right to claim a certain respect, and to feel wounded when it is withheld from them. In Antwerp I was always treated with distinction; here, one would think that when I open my lips in company I speak English with a ridiculous accent, whereas I am quite assured that I pronounce it perfectly.\"\n\"Hortense, in Antwerp we were known rich; in England we were never known but poor.\"\n\"Precisely, and thus mercenary are mankind. Again, dear brother, last Sunday, if you recollect, was very wet; accordingly I went to church in my neat black sabots, objects one would not indeed wear in a fashionable city, but which in the country I have ever been accustomed to use for walking in dirty roads. Believe me, as I paced up the aisle, composed and tranquil, as I am always, four ladies, and as many gentlemen, laughed and hid their faces behind their prayer-books.\"\n\"Well, well! don't put on the sabots again. I told you before I thought they were not quite the thing for this country.\"\n\"But, brother, they are not common sabots, such as the peasantry wear. I tell you, they are sabots noirs, trs propres, trs convenables. At Mons and Leuze--cities not very far removed from the elegant capital of Brussels--it is very seldom that the respectable people wear anything else for walking in winter. Let any one try to wade the mud of the Flemish chausses in a pair of Paris brodequins, on m'en dirait des nouvelles!\"\n\"Never mind Mons and Leuze and the Flemish chausses; do at Rome as the Romans do. And as to the camisole and jupon, I am not quite sure about them either. I never see an English lady dressed in such garments. Ask Caroline Helstone.\"\n\"Caroline! _I_ ask Caroline? _I_ consult her about my dress? It is _she_ who on all points should consult _me_. She is a child.\"\n\"She is eighteen, or at least seventeen--old enough to know all about gowns, petticoats, and chaussures.\"\n\"Do not spoil Caroline, I entreat you, brother. Do not make her of more consequence than she ought to be. At present she is modest and unassuming: let us keep her so.\"\n\"With all my heart. Is she coming this morning?\"\n\"She will come at ten, as usual, to take her French lesson.\"\n\"You don't find that she sneers at you, do you?\"\n\"She does not. She appreciates me better than any one else here; but then she has more intimate opportunities of knowing me. She sees that I have education, intelligence, manner, principles--all, in short, which belongs to a person well born and well bred.\"\n\"Are you at all fond of her?\"\n\"For _fond_ I cannot say. I am not one who is prone to take violent fancies, and, consequently, my friendship is the more to be depended on. I have a regard for her as my relative; her position also inspires interest, and her conduct as my pupil has hitherto been such as rather to enhance than diminish the attachment that springs from other causes.\"\n\"She behaves pretty well at lessons?\"\n\"To _me_ she behaves very well; but you are conscious, brother, that I have a manner calculated to repel over-familiarity, to win esteem, and to command respect. Yet, possessed of penetration, I perceive clearly that Caroline is not perfect, that there is much to be desired in her.\"\n\"Give me a last cup of coffee, and while I am drinking it amuse me with an account of her faults.\"\n\"Dear brother, I am happy to see you eat your breakfast with relish, after the fatiguing night you have passed. Caroline, then, is defective; but with my forming hand and almost motherly care she may improve. There is about her an occasional something--a reserve, I think--which I do not quite like, because it is not sufficiently girlish and submissive; and there are glimpses of an unsettled hurry in her nature, which put me out. Yet she is usually most tranquil, too dejected and thoughtful indeed sometimes. In time, I doubt not, I shall make her uniformly sedate and decorous, without being unaccountably pensive. I ever disapprove what is not intelligible.\"\n\"I don't understand your account in the least. What do you mean by 'unsettled hurries,' for instance?\"\n\"An example will, perhaps, be the most satisfactory explanation. I sometimes, you are aware, make her read French poetry by way of practice in pronunciation. She has in the course of her lessons gone through much of Corneille and Racine, in a very steady, sober spirit, such as I approve. Occasionally she showed, indeed, a degree of languor in the perusal of those esteemed authors, partaking rather of apathy than sobriety; and apathy is what I cannot tolerate in those who have the benefit of my instructions--besides, one should not be apathetic in studying standard works. The other day I put into her hands a volume of short fugitive pieces. I sent her to the window to learn one by heart, and when I looked up I saw her turning the leaves over impatiently, and curling her lip, absolutely with scorn, as she surveyed the little poems cursorily. I chid her. 'Ma cousine,' said she, 'tout cela m'ennuie la mort.' I told her this was improper language. 'Dieu!' she exclaimed, 'il n'y a donc pas deux lignes de posie dans toute la littrature franaise?' I inquired what she meant. She begged my pardon with proper submission. Ere long she was still. I saw her smiling to herself over the book. She began to learn assiduously. In half an hour she came and stood before me, presented the volume, folded her hands, as I always require her to do, and commenced the repetition of that short thing by Chnier, 'La Jeune Captive.' If you had heard the manner in which she went through this, and in which she uttered a few incoherent comments when she had done, you would have known what I meant by the phrase 'unsettled hurry.' One would have thought Chnier was more moving than all Racine and all Corneille. You, brother, who have so much sagacity, will discern that this disproportionate preference argues an ill-regulated mind; but she is fortunate in her preceptress. I will give her a system, a method of thought, a set of opinions; I will give her the perfect control and guidance of her feelings.\"\n\"Be sure you do, Hortense. Here she comes. That was her shadow passed the window, I believe.\"\n\"Ah! truly. She is too early--half an hour before her time.--My child, what brings you here before I have breakfasted?\"\nThis question was addressed to an individual who now entered the room, a young girl, wrapped in a winter mantle, the folds of which were gathered with some grace round an apparently slender figure.\n\"I came in haste to see how you were, Hortense, and how Robert was too. I was sure you would be both grieved by what happened last night. I did not hear till this morning. My uncle told me at breakfast.\"\n\"Ah! it is unspeakable. You sympathize with us? Your uncle sympathizes with us?\"\n\"My uncle is very angry--but he was with Robert, I believe, was he not?--Did he not go with you to Stilbro' Moor?\"\n\"Yes, we set out in very martial style, Caroline; but the prisoners we went to rescue met us half-way.\"\n\"Of course nobody was hurt?\"\n\"Why, no; only Joe Scott's wrists were a little galled with being pinioned too tightly behind his back.\"\n\"You were not there? You were not with the wagons when they were attacked?\"\n\"No. One seldom has the fortune to be present at occurrences at which one would particularly wish to assist.\"\n\"Where are you going this morning? I saw Murgatroyd saddling your horse in the yard.\"\n\"To Whinbury. It is market day.\"\n\"Mr. Yorke is going too. I met him in his gig. Come home with him.\"\n\"Why?\"\n\"Two are better than one, and nobody dislikes Mr. Yorke--at least, poor people do not dislike him.\"\n\"Therefore he would be a protection to me, who am hated?\"\n\"Who are _misunderstood_. That, probably, is the word. Shall you be late?--Will he be late, Cousin Hortense?\"\n\"It is too probable. He has often much business to transact at Whinbury. Have you brought your exercise-book, child?\"\n\"Yes.--What time will you return, Robert?\"\n\"I generally return at seven. Do you wish me to be at home earlier?\"\n\"Try rather to be back by six. It is not absolutely dark at six now, but by seven daylight is quite gone.\"\n\"And what danger is to be apprehended, Caroline, when daylight _is_ gone? What peril do you conceive comes as the companion of darkness for me?\"\n\"I am not sure that I can define my fears, but we all have a certain anxiety at present about our friends. My uncle calls these times dangerous. He says, too, that mill-owners are unpopular.\"\n\"And I am one of the most unpopular? Is not that the fact? You are reluctant to speak out plainly, but at heart you think me liable to Pearson's fate, who was shot at--not, indeed, from behind a hedge, but in his own house, through his staircase window, as he was going to bed.\"\n\"Anne Pearson showed me the bullet in the chamber-door,\" remarked Caroline gravely, as she folded her mantle and arranged it and her muff on a side-table. \"You know,\" she continued, \"there is a hedge all the way along the road from here to Whinbury, and there are the Fieldhead plantations to pass; but you will be back by six--or before?\"\n\"Certainly he will,\" affirmed Hortense. \"And now, my child, prepare your lessons for repetition, while I put the peas to soak for the pure at dinner.\"\nWith this direction she left the room.\n\"You suspect I have many enemies, then, Caroline,\" said Mr. Moore, \"and doubtless you know me to be destitute of friends?\"\n\"Not destitute, Robert. There is your sister, your brother Louis, whom I have never seen; there is Mr. Yorke, and there is my uncle--besides, of course, many more.\"\nRobert smiled. \"You would be puzzled to name your 'many more,'\" said he. \"But show me your exercise-book. What extreme pains you take with the writing! My sister, I suppose, exacts this care. She wants to form you in all things after the model of a Flemish school-girl. What life are you destined for, Caroline? What will you do with your French, drawing, and other accomplishments, when they are acquired?\"\n\"You may well say, when they are acquired; for, as you are aware, till Hortense began to teach me, I knew precious little. As to the life I am destined for, I cannot tell. I suppose to keep my uncle's house till----\" She hesitated.\n\"Till what? Till he dies?\"\n\"No. How harsh to say that! I never think of his dying. He is only fifty-five. But till--in short, till events offer other occupations for me.\"\n\"A remarkably vague prospect! Are you content with it?\"\n\"I used to be, formerly. Children, you know, have little reflection, or rather their reflections run on ideal themes. There are moments _now_ when I am not quite satisfied.\"\n\"Why?\"\n\"I am making no money--earning nothing.\"\n\"You come to the point, Lina. You too, then, wish to make money?\"\n\"I do. I should like an occupation; and if I were a boy, it would not be so difficult to find one. I see such an easy, pleasant way of learning a business, and making my way in life.\"\n\"Go on. Let us hear what way.\"\n\"I could be apprenticed to your trade--the cloth-trade. I could learn it of you, as we are distant relations. I would do the counting-house work, keep the books, and write the letters, while you went to market. I know you greatly desire to be rich, in order to pay your father's debts; perhaps I could help you to get rich.\"\n\"Help _me_? You should think of yourself.\"\n\"I do think of myself; but must one for ever think only of oneself?\"\n\"Of whom else do I think? Of whom else _dare_ I think? The poor ought to have no large sympathies; it is their duty to be narrow.\"\n\"No, Robert----\"\n\"Yes, Caroline. Poverty is necessarily selfish, contracted, grovelling, anxious. Now and then a poor man's heart, when certain beams and dews visit it, may smell like the budding vegetation in yonder garden on this spring day, may feel ripe to evolve in foliage, perhaps blossom; but he must not encourage the pleasant impulse; he must invoke Prudence to check it, with that frosty breath of hers, which is as nipping as any north wind.\"\n\"No cottage would be happy then.\"\n\"When I speak of poverty, I do not so much mean the natural, habitual poverty of the working-man, as the embarrassed penury of the man in debt. My grub-worm is always a straitened, struggling, care-worn tradesman.\"\n\"Cherish hope, not anxiety. Certain ideas have become too fixed in your mind. It may be presumptuous to say it, but I have the impression that there is something wrong in your notions of the best means of attaining happiness, as there is in----\" Second hesitation.\n\"I am all ear, Caroline.\"\n\"In (courage! let me speak the truth)--in your manner--mind, I say only _manner_--to these Yorkshire workpeople.\"\n\"You have often wanted to tell me that, have you not?\"\n\"Yes; often--very often.\"\n\"The faults of my manner are, I think, only negative. I am not proud. What has a man in my position to be proud of? I am only taciturn, phlegmatic, and joyless.\"\n\"As if your living cloth-dressers were all machines like your frames and shears. In your own house you seem different.\"\n\"To those of my own house I am no alien, which I am to these English clowns. I might act the benevolent with them, but acting is not my _forte_. I find them irrational, perverse; they hinder me when I long to hurry forward. In treating them justly I fulfil my whole duty towards them.\"\n\"You don't expect them to love you, of course?\"\n\"Nor wish it.\"\n\"Ah!\" said the monitress, shaking her head and heaving a deep sigh. With this ejaculation, indicative that she perceived a screw to be loose somewhere, but that it was out of her reach to set it right, she bent over her grammar, and sought the rule and exercise for the day.\n\"I suppose I am not an affectionate man, Caroline. The attachment of a very few suffices me.\"\n\"If you please, Robert, will you mend me a pen or two before you go?\"\n\"First let me rule your book, for you always contrive to draw the lines aslant. There now. And now for the pens. You like a fine one, I think?\"\n\"Such as you generally make for me and Hortense; not your own broad points.\"\n\"If I were of Louis's calling I might stay at home and dedicate this morning to you and your studies, whereas I must spend it in Skyes's wool-warehouse.\"\n\"You will be making money.\"\n\"More likely losing it.\"\nAs he finished mending the pens, a horse, saddled and bridled, was brought up to the garden-gate.\n\"There, Fred is ready for me; I must go. I'll take one look to see what the spring has done in the south border, too, first.\"\nHe quitted the room, and went out into the garden ground behind the mill. A sweet fringe of young verdure and opening flowers--snowdrop, crocus, even primrose--bloomed in the sunshine under the hot wall of the factory. Moore plucked here and there a blossom and leaf, till he had collected a little bouquet. He returned to the parlour, pilfered a thread of silk from his sister's work-basket, tied the flowers, and laid them on Caroline's desk.\n\"Now, good-morning.\"\n\"Thank you, Robert. It is pretty; it looks, as it lies there, like sparkles of sunshine and blue sky. Good-morning.\"\nHe went to the door, stopped, opened his lips as if to speak, said nothing, and moved on. He passed through the wicket, and mounted his horse. In a second he had flung himself from his saddle again, transferred the reins to Murgatroyd, and re-entered the cottage.\n\"I forgot my gloves,\" he said, appearing to take something from the side-table; then, as an impromptu thought, he remarked, \"You have no binding engagement at home perhaps, Caroline?\"\n\"I never have. Some children's socks, which Mrs. Ramsden has ordered, to knit for the Jew's basket; but they will keep.\"\n\"Jew's basket be--sold! Never was utensil better named. Anything more Jewish than it--its contents and their prices--cannot be conceived. But I see something, a very tiny curl, at the corners of your lip, which tells me that you know its merits as well as I do. Forget the Jew's basket, then, and spend the day here as a change. Your uncle won't break his heart at your absence?\"\nShe smiled. \"No.\"\n\"The old Cossack! I dare say not,\" muttered Moore.\n\"Then stay and dine with Hortense; she will be glad of your company. I shall return in good time. We will have a little reading in the evening. The moon rises at half-past eight, and I will walk up to the rectory with you at nine. Do you agree?\"\nShe nodded her head, and her eyes lit up.\nMoore lingered yet two minutes. He bent over Caroline's desk and glanced at her grammar, he fingered her pen, he lifted her bouquet and played with it; his horse stamped impatient; Fred Murgatroyd hemmed and coughed at the gate, as if he wondered what in the world his master was doing. \"Good-morning,\" again said Moore, and finally vanished.\nHortense, coming in ten minutes after, found, to her surprise, that Caroline had not yet commenced her exercise.",
        "paragraph_chars": [
            [
                0,
                382
            ],
            [
                382,
                433
            ],
            [
                433,
                661
            ],
            [
                661,
                827
            ],
            [
                827,
                835
            ],
            [
                835,
                947
            ],
            [
                947,
                985
            ],
            [
                985,
                1010
            ],
            [
                1010,
                1130
            ],
            [
                1130,
                1147
            ],
            [
                1147,
                1218
            ],
            [
                1218,
                1230
            ],
            [
                1230,
                1622
            ],
            [
                1622,
                1781
            ],
            [
                1781,
                2114
            ],
            [
                2114,
                2549
            ],
            [
                2549,
                2619
            ],
            [
                2619,
                3527
            ],
            [
                3527,
                3580
            ],
            [
                3580,
                3846
            ],
            [
                3846,
                5234
            ],
            [
                5234,
                6043
            ],
            [
                6043,
                6433
            ],
            [
                6433,
                6991
            ],
            [
                6991,
                7585
            ],
            [
                7585,
                8113
            ],
            [
                8113,
                8895
            ],
            [
                8895,
                10304
            ],
            [
                10304,
                10626
            ],
            [
                10626,
                10665
            ],
            [
                10665,
                10793
            ],
            [
                10793,
                10825
            ],
            [
                10825,
                10870
            ],
            [
                10870,
                10917
            ],
            [
                10917,
                11266
            ],
            [
                11266,
                12008
            ],
            [
                12008,
                12513
            ],
            [
                12513,
                14430
            ],
            [
                14430,
                14719
            ],
            [
                14719,
                14974
            ],
            [
                14974,
                15029
            ],
            [
                15029,
                15739
            ],
            [
                15739,
                15798
            ],
            [
                15798,
                16779
            ],
            [
                16779,
                16863
            ],
            [
                16863,
                17340
            ],
            [
                17340,
                17461
            ],
            [
                17461,
                17888
            ],
            [
                17888,
                18121
            ],
            [
                18121,
                18250
            ],
            [
                18250,
                18356
            ],
            [
                18356,
                18524
            ],
            [
                18524,
                18573
            ],
            [
                18573,
                18634
            ],
            [
                18634,
                18683
            ],
            [
                18683,
                18941
            ],
            [
                18941,
                18971
            ],
            [
                18971,
                19323
            ],
            [
                19323,
                19361
            ],
            [
                19361,
                19645
            ],
            [
                19645,
                19744
            ],
            [
                19744,
                20409
            ],
            [
                20409,
                20512
            ],
            [
                20512,
                22511
            ],
            [
                22511,
                22605
            ],
            [
                22605,
                22725
            ],
            [
                22725,
                22923
            ],
            [
                22923,
                23127
            ],
            [
                23127,
                23208
            ],
            [
                23208,
                23323
            ],
            [
                23323,
                23427
            ],
            [
                23427,
                23456
            ],
            [
                23456,
                23561
            ],
            [
                23561,
                23637
            ],
            [
                23637,
                23747
            ],
            [
                23747,
                23833
            ],
            [
                23833,
                23866
            ],
            [
                23866,
                23934
            ],
            [
                23934,
                23941
            ],
            [
                23941,
                24041
            ],
            [
                24041,
                24099
            ],
            [
                24099,
                24209
            ],
            [
                24209,
                24327
            ],
            [
                24327,
                24370
            ],
            [
                24370,
                24439
            ],
            [
                24439,
                24546
            ],
            [
                24546,
                24691
            ],
            [
                24691,
                24883
            ],
            [
                24883,
                25162
            ],
            [
                25162,
                25502
            ],
            [
                25502,
                25653
            ],
            [
                25653,
                25692
            ],
            [
                25692,
                25815
            ],
            [
                25815,
                25980
            ],
            [
                25980,
                26388
            ],
            [
                26388,
                26620
            ],
            [
                26620,
                26647
            ],
            [
                26647,
                26791
            ],
            [
                26791,
                26847
            ],
            [
                26847,
                27021
            ],
            [
                27021,
                27028
            ],
            [
                27028,
                27069
            ],
            [
                27069,
                27135
            ],
            [
                27135,
                27319
            ],
            [
                27319,
                27350
            ],
            [
                27350,
                27675
            ],
            [
                27675,
                27718
            ],
            [
                27718,
                27787
            ],
            [
                27787,
                27918
            ],
            [
                27918,
                27935
            ],
            [
                27935,
                28373
            ],
            [
                28373,
                28407
            ],
            [
                28407,
                28622
            ],
            [
                28622,
                28887
            ],
            [
                28887,
                28913
            ],
            [
                28913,
                29027
            ],
            [
                29027,
                29082
            ],
            [
                29082,
                29108
            ],
            [
                29108,
                29270
            ],
            [
                29270,
                29390
            ],
            [
                29390,
                29676
            ],
            [
                29676,
                29724
            ],
            [
                29724,
                29739
            ],
            [
                29739,
                30014
            ],
            [
                30014,
                30108
            ],
            [
                30108,
                30178
            ],
            [
                30178,
                30322
            ],
            [
                30322,
                30399
            ],
            [
                30399,
                30553
            ],
            [
                30553,
                30581
            ],
            [
                30581,
                30606
            ],
            [
                30606,
                30704
            ],
            [
                30704,
                30830
            ],
            [
                30830,
                31275
            ],
            [
                31275,
                31296
            ],
            [
                31296,
                31413
            ],
            [
                31413,
                31677
            ],
            [
                31677,
                31861
            ],
            [
                31861,
                31982
            ],
            [
                31982,
                32362
            ],
            [
                32362,
                32380
            ],
            [
                32380,
                32431
            ],
            [
                32431,
                32677
            ],
            [
                32677,
                32719
            ],
            [
                32719,
                33062
            ],
            [
                33062,
                33174
            ]
        ],
        "segment_chars": [
            [
                0,
                68
            ],
            [
                68,
                242
            ],
            [
                242,
                317
            ],
            [
                317,
                382
            ],
            [
                382,
                422
            ],
            [
                422,
                433
            ],
            [
                433,
                480
            ],
            [
                480,
                587
            ],
            [
                587,
                625
            ],
            [
                625,
                661
            ],
            [
                661,
                687
            ],
            [
                687,
                703
            ],
            [
                703,
                827
            ],
            [
                827,
                835
            ],
            [
                835,
                881
            ],
            [
                881,
                947
            ],
            [
                947,
                963
            ],
            [
                963,
                985
            ],
            [
                985,
                1010
            ],
            [
                1010,
                1027
            ],
            [
                1027,
                1130
            ],
            [
                1130,
                1147
            ],
            [
                1147,
                1169
            ],
            [
                1169,
                1218
            ],
            [
                1218,
                1230
            ],
            [
                1230,
                1261
            ],
            [
                1261,
                1274
            ],
            [
                1274,
                1395
            ],
            [
                1395,
                1438
            ],
            [
                1438,
                1498
            ],
            [
                1498,
                1521
            ],
            [
                1521,
                1622
            ],
            [
                1622,
                1781
            ],
            [
                1781,
                1892
            ],
            [
                1892,
                2114
            ],
            [
                2114,
                2511
            ],
            [
                2511,
                2517
            ],
            [
                2517,
                2531
            ],
            [
                2531,
                2549
            ],
            [
                2549,
                2574
            ],
            [
                2574,
                2619
            ],
            [
                2619,
                2649
            ],
            [
                2649,
                2782
            ],
            [
                2782,
                2861
            ],
            [
                2861,
                3155
            ],
            [
                3155,
                3527
            ],
            [
                3527,
                3580
            ],
            [
                3580,
                3585
            ],
            [
                3585,
                3598
            ],
            [
                3598,
                3846
            ],
            [
                3846,
                3948
            ],
            [
                3948,
                4462
            ],
            [
                4462,
                4599
            ],
            [
                4599,
                4947
            ],
            [
                4947,
                5155
            ],
            [
                5155,
                5189
            ],
            [
                5189,
                5234
            ],
            [
                5234,
                5452
            ],
            [
                5452,
                5552
            ],
            [
                5552,
                5711
            ],
            [
                5711,
                5956
            ],
            [
                5956,
                6043
            ],
            [
                6043,
                6433
            ],
            [
                6433,
                6485
            ],
            [
                6485,
                6518
            ],
            [
                6518,
                6674
            ],
            [
                6674,
                6720
            ],
            [
                6720,
                6857
            ],
            [
                6857,
                6991
            ],
            [
                6991,
                7423
            ],
            [
                7423,
                7502
            ],
            [
                7502,
                7585
            ],
            [
                7585,
                7836
            ],
            [
                7836,
                8113
            ],
            [
                8113,
                8233
            ],
            [
                8233,
                8539
            ],
            [
                8539,
                8820
            ],
            [
                8820,
                8895
            ],
            [
                8895,
                8986
            ],
            [
                8986,
                9180
            ],
            [
                9180,
                9457
            ],
            [
                9457,
                9503
            ],
            [
                9503,
                9662
            ],
            [
                9662,
                10000
            ],
            [
                10000,
                10058
            ],
            [
                10058,
                10153
            ],
            [
                10153,
                10304
            ],
            [
                10304,
                10388
            ],
            [
                10388,
                10497
            ],
            [
                10497,
                10553
            ],
            [
                10553,
                10626
            ],
            [
                10626,
                10637
            ],
            [
                10637,
                10665
            ],
            [
                10665,
                10793
            ],
            [
                10793,
                10825
            ],
            [
                10825,
                10870
            ],
            [
                10870,
                10892
            ],
            [
                10892,
                10917
            ],
            [
                10917,
                10965
            ],
            [
                10965,
                11153
            ],
            [
                11153,
                11221
            ],
            [
                11221,
                11266
            ],
            [
                11266,
                11510
            ],
            [
                11510,
                11799
            ],
            [
                11799,
                11883
            ],
            [
                11883,
                12008
            ],
            [
                12008,
                12070
            ],
            [
                12070,
                12082
            ],
            [
                12082,
                12165
            ],
            [
                12165,
                12334
            ],
            [
                12334,
                12513
            ],
            [
                12513,
                12799
            ],
            [
                12799,
                13031
            ],
            [
                13031,
                13173
            ],
            [
                13173,
                13272
            ],
            [
                13272,
                13387
            ],
            [
                13387,
                13436
            ],
            [
                13436,
                13534
            ],
            [
                13534,
                13828
            ],
            [
                13828,
                13909
            ],
            [
                13909,
                14036
            ],
            [
                14036,
                14430
            ],
            [
                14430,
                14719
            ],
            [
                14719,
                14732
            ],
            [
                14732,
                14749
            ],
            [
                14749,
                14773
            ],
            [
                14773,
                14849
            ],
            [
                14849,
                14974
            ],
            [
                14974,
                15029
            ],
            [
                15029,
                15037
            ],
            [
                15037,
                15151
            ],
            [
                15151,
                15454
            ],
            [
                15454,
                15585
            ],
            [
                15585,
                15672
            ],
            [
                15672,
                15739
            ],
            [
                15739,
                15798
            ],
            [
                15798,
                15939
            ],
            [
                15939,
                15992
            ],
            [
                15992,
                16032
            ],
            [
                16032,
                16217
            ],
            [
                16217,
                16396
            ],
            [
                16396,
                16473
            ],
            [
                16473,
                16570
            ],
            [
                16570,
                16779
            ],
            [
                16779,
                16863
            ],
            [
                16863,
                16907
            ],
            [
                16907,
                17172
            ],
            [
                17172,
                17340
            ],
            [
                17340,
                17353
            ],
            [
                17353,
                17384
            ],
            [
                17384,
                17461
            ],
            [
                17461,
                17532
            ],
            [
                17532,
                17597
            ],
            [
                17597,
                17770
            ],
            [
                17770,
                17888
            ],
            [
                17888,
                17970
            ],
            [
                17970,
                18043
            ],
            [
                18043,
                18097
            ],
            [
                18097,
                18121
            ],
            [
                18121,
                18132
            ],
            [
                18132,
                18150
            ],
            [
                18150,
                18182
            ],
            [
                18182,
                18233
            ],
            [
                18233,
                18250
            ],
            [
                18250,
                18356
            ],
            [
                18356,
                18404
            ],
            [
                18404,
                18462
            ],
            [
                18462,
                18524
            ],
            [
                18524,
                18544
            ],
            [
                18544,
                18573
            ],
            [
                18573,
                18634
            ],
            [
                18634,
                18683
            ],
            [
                18683,
                18698
            ],
            [
                18698,
                18808
            ],
            [
                18808,
                18941
            ],
            [
                18941,
                18971
            ],
            [
                18971,
                18997
            ],
            [
                18997,
                19112
            ],
            [
                19112,
                19323
            ],
            [
                19323,
                19361
            ],
            [
                19361,
                19523
            ],
            [
                19523,
                19645
            ],
            [
                19645,
                19744
            ],
            [
                19744,
                19856
            ],
            [
                19856,
                19953
            ],
            [
                19953,
                20177
            ],
            [
                20177,
                20257
            ],
            [
                20257,
                20364
            ],
            [
                20364,
                20409
            ],
            [
                20409,
                20456
            ],
            [
                20456,
                20512
            ],
            [
                20512,
                20577
            ],
            [
                20577,
                20670
            ],
            [
                20670,
                20801
            ],
            [
                20801,
                21090
            ],
            [
                21090,
                21160
            ],
            [
                21160,
                21364
            ],
            [
                21364,
                21376
            ],
            [
                21376,
                21430
            ],
            [
                21430,
                21469
            ],
            [
                21469,
                21477
            ],
            [
                21477,
                21568
            ],
            [
                21568,
                21595
            ],
            [
                21595,
                21640
            ],
            [
                21640,
                21664
            ],
            [
                21664,
                21708
            ],
            [
                21708,
                21740
            ],
            [
                21740,
                21937
            ],
            [
                21937,
                22134
            ],
            [
                22134,
                22215
            ],
            [
                22215,
                22378
            ],
            [
                22378,
                22511
            ],
            [
                22511,
                22538
            ],
            [
                22538,
                22554
            ],
            [
                22554,
                22605
            ],
            [
                22605,
                22610
            ],
            [
                22610,
                22617
            ],
            [
                22617,
                22725
            ],
            [
                22725,
                22923
            ],
            [
                22923,
                22995
            ],
            [
                22995,
                23061
            ],
            [
                23061,
                23095
            ],
            [
                23095,
                23127
            ],
            [
                23127,
                23132
            ],
            [
                23132,
                23151
            ],
            [
                23151,
                23175
            ],
            [
                23175,
                23208
            ],
            [
                23208,
                23323
            ],
            [
                23323,
                23427
            ],
            [
                23427,
                23456
            ],
            [
                23456,
                23561
            ],
            [
                23561,
                23582
            ],
            [
                23582,
                23637
            ],
            [
                23637,
                23642
            ],
            [
                23642,
                23747
            ],
            [
                23747,
                23782
            ],
            [
                23782,
                23833
            ],
            [
                23833,
                23847
            ],
            [
                23847,
                23866
            ],
            [
                23866,
                23891
            ],
            [
                23891,
                23913
            ],
            [
                23913,
                23934
            ],
            [
                23934,
                23941
            ],
            [
                23941,
                24041
            ],
            [
                24041,
                24099
            ],
            [
                24099,
                24125
            ],
            [
                24125,
                24154
            ],
            [
                24154,
                24209
            ],
            [
                24209,
                24230
            ],
            [
                24230,
                24282
            ],
            [
                24282,
                24327
            ],
            [
                24327,
                24370
            ],
            [
                24370,
                24400
            ],
            [
                24400,
                24439
            ],
            [
                24439,
                24470
            ],
            [
                24470,
                24546
            ],
            [
                24546,
                24620
            ],
            [
                24620,
                24691
            ],
            [
                24691,
                24798
            ],
            [
                24798,
                24836
            ],
            [
                24836,
                24883
            ],
            [
                24883,
                24920
            ],
            [
                24920,
                24942
            ],
            [
                24942,
                25162
            ],
            [
                25162,
                25317
            ],
            [
                25317,
                25502
            ],
            [
                25502,
                25542
            ],
            [
                25542,
                25653
            ],
            [
                25653,
                25692
            ],
            [
                25692,
                25815
            ],
            [
                25815,
                25839
            ],
            [
                25839,
                25980
            ],
            [
                25980,
                25995
            ],
            [
                25995,
                26053
            ],
            [
                26053,
                26086
            ],
            [
                26086,
                26132
            ],
            [
                26132,
                26172
            ],
            [
                26172,
                26250
            ],
            [
                26250,
                26292
            ],
            [
                26292,
                26388
            ],
            [
                26388,
                26511
            ],
            [
                26511,
                26560
            ],
            [
                26560,
                26620
            ],
            [
                26620,
                26632
            ],
            [
                26632,
                26647
            ],
            [
                26647,
                26652
            ],
            [
                26652,
                26675
            ],
            [
                26675,
                26703
            ],
            [
                26703,
                26726
            ],
            [
                26726,
                26791
            ],
            [
                26791,
                26821
            ],
            [
                26821,
                26847
            ],
            [
                26847,
                26872
            ],
            [
                26872,
                26965
            ],
            [
                26965,
                27021
            ],
            [
                27021,
                27028
            ],
            [
                27028,
                27069
            ],
            [
                27069,
                27099
            ],
            [
                27099,
                27135
            ],
            [
                27135,
                27142
            ],
            [
                27142,
                27234
            ],
            [
                27234,
                27319
            ],
            [
                27319,
                27327
            ],
            [
                27327,
                27350
            ],
            [
                27350,
                27406
            ],
            [
                27406,
                27460
            ],
            [
                27460,
                27561
            ],
            [
                27561,
                27675
            ],
            [
                27675,
                27687
            ],
            [
                27687,
                27718
            ],
            [
                27718,
                27787
            ],
            [
                27787,
                27813
            ],
            [
                27813,
                27842
            ],
            [
                27842,
                27918
            ],
            [
                27918,
                27935
            ],
            [
                27935,
                27951
            ],
            [
                27951,
                28016
            ],
            [
                28016,
                28373
            ],
            [
                28373,
                28407
            ],
            [
                28407,
                28551
            ],
            [
                28551,
                28622
            ],
            [
                28622,
                28650
            ],
            [
                28650,
                28700
            ],
            [
                28700,
                28887
            ],
            [
                28887,
                28913
            ],
            [
                28913,
                28927
            ],
            [
                28927,
                29027
            ],
            [
                29027,
                29082
            ],
            [
                29082,
                29108
            ],
            [
                29108,
                29162
            ],
            [
                29162,
                29178
            ],
            [
                29178,
                29224
            ],
            [
                29224,
                29270
            ],
            [
                29270,
                29351
            ],
            [
                29351,
                29390
            ],
            [
                29390,
                29467
            ],
            [
                29467,
                29535
            ],
            [
                29535,
                29614
            ],
            [
                29614,
                29676
            ],
            [
                29676,
                29724
            ],
            [
                29724,
                29739
            ],
            [
                29739,
                29745
            ],
            [
                29745,
                29807
            ],
            [
                29807,
                30014
            ],
            [
                30014,
                30065
            ],
            [
                30065,
                30108
            ],
            [
                30108,
                30178
            ],
            [
                30178,
                30258
            ],
            [
                30258,
                30269
            ],
            [
                30269,
                30291
            ],
            [
                30291,
                30322
            ],
            [
                30322,
                30399
            ],
            [
                30399,
                30553
            ],
            [
                30553,
                30581
            ],
            [
                30581,
                30606
            ],
            [
                30606,
                30704
            ],
            [
                30704,
                30745
            ],
            [
                30745,
                30830
            ],
            [
                30830,
                30904
            ],
            [
                30904,
                31049
            ],
            [
                31049,
                31138
            ],
            [
                31138,
                31275
            ],
            [
                31275,
                31296
            ],
            [
                31296,
                31316
            ],
            [
                31316,
                31398
            ],
            [
                31398,
                31413
            ],
            [
                31413,
                31503
            ],
            [
                31503,
                31556
            ],
            [
                31556,
                31677
            ],
            [
                31677,
                31861
            ],
            [
                31861,
                31876
            ],
            [
                31876,
                31982
            ],
            [
                31982,
                32006
            ],
            [
                32006,
                32038
            ],
            [
                32038,
                32120
            ],
            [
                32120,
                32244
            ],
            [
                32244,
                32311
            ],
            [
                32311,
                32362
            ],
            [
                32362,
                32374
            ],
            [
                32374,
                32380
            ],
            [
                32380,
                32398
            ],
            [
                32398,
                32431
            ],
            [
                32431,
                32500
            ],
            [
                32500,
                32529
            ],
            [
                32529,
                32575
            ],
            [
                32575,
                32662
            ],
            [
                32662,
                32677
            ],
            [
                32677,
                32719
            ],
            [
                32719,
                32751
            ],
            [
                32751,
                33006
            ],
            [
                33006,
                33062
            ],
            [
                33062,
                33174
            ]
        ],
        "overlap_chars": [
            [
                0,
                5
            ],
            [
                26,
                31
            ],
            [
                8,
                20
            ],
            [
                41,
                68
            ],
            [
                68,
                88
            ],
            [
                94,
                122
            ],
            [
                203,
                209
            ],
            [
                225,
                242
            ],
            [
                242,
                252
            ],
            [
                277,
                283
            ],
            [
                264,
                269
            ],
            [
                252,
                253
            ],
            [
                320,
                364
            ],
            [
                380,
                382
            ],
            [
                480,
                486
            ],
            [
                486,
                497
            ],
            [
                510,
                572
            ],
            [
                580,
                587
            ],
            [
                587,
                615
            ],
            [
                623,
                625
            ],
            [
                625,
                661
            ],
            [
                661,
                665
            ],
            [
                687,
                691
            ],
            [
                696,
                703
            ],
            [
                770,
                772
            ],
            [
                797,
                827
            ],
            [
                827,
                835
            ],
            [
                835,
                844
            ],
            [
                863,
                881
            ],
            [
                881,
                914
            ],
            [
                925,
                928
            ],
            [
                945,
                947
            ],
            [
                947,
                963
            ],
            [
                963,
                985
            ],
            [
                985,
                997
            ],
            [
                1002,
                1010
            ],
            [
                1010,
                1011
            ],
            [
                1017,
                1027
            ],
            [
                1047,
                1057
            ],
            [
                1065,
                1130
            ],
            [
                1130,
                1131
            ],
            [
                1138,
                1147
            ],
            [
                1169,
                1218
            ],
            [
                1218,
                1230
            ],
            [
                1230,
                1261
            ],
            [
                1274,
                1295
            ],
            [
                1325,
                1326
            ],
            [
                1301,
                1312
            ],
            [
                1363,
                1377
            ],
            [
                1395,
                1420
            ],
            [
                1436,
                1438
            ],
            [
                1498,
                1519
            ],
            [
                1550,
                1556
            ],
            [
                1521,
                1530
            ],
            [
                1561,
                1593
            ],
            [
                1605,
                1622
            ],
            [
                1622,
                1638
            ],
            [
                1643,
                1756
            ],
            [
                1778,
                1781
            ],
            [
                1781,
                1809
            ],
            [
                2114,
                2220
            ],
            [
                2307,
                2309
            ],
            [
                2236,
                2237
            ],
            [
                2239,
                2250
            ],
            [
                2263,
                2299
            ],
            [
                2251,
                2253
            ],
            [
                2327,
                2336
            ],
            [
                2359,
                2364
            ],
            [
                2368,
                2373
            ],
            [
                2463,
                2466
            ],
            [
                2502,
                2511
            ],
            [
                2511,
                2517
            ],
            [
                2517,
                2531
            ],
            [
                2531,
                2539
            ],
            [
                2545,
                2549
            ],
            [
                2549,
                2553
            ],
            [
                2555,
                2558
            ],
            [
                2560,
                2574
            ],
            [
                2574,
                2619
            ],
            [
                2619,
                2620
            ],
            [
                2630,
                2649
            ],
            [
                2649,
                2657
            ],
            [
                2662,
                2723
            ],
            [
                2747,
                2782
            ],
            [
                2782,
                2796
            ],
            [
                2801,
                2810
            ],
            [
                2823,
                2861
            ],
            [
                2949,
                2986
            ],
            [
                2991,
                3002
            ],
            [
                3038,
                3063
            ],
            [
                3527,
                3563
            ],
            [
                3572,
                3580
            ],
            [
                3580,
                3585
            ],
            [
                3632,
                3635
            ],
            [
                3755,
                3819
            ],
            [
                3830,
                3846
            ],
            [
                3846,
                3847
            ],
            [
                3867,
                3904
            ],
            [
                3913,
                3929
            ],
            [
                3941,
                3948
            ],
            [
                3948,
                3960
            ],
            [
                3964,
                4008
            ],
            [
                4032,
                4048
            ],
            [
                4090,
                4195
            ],
            [
                4460,
                4462
            ],
            [
                4486,
                4489
            ],
            [
                4551,
                4553
            ],
            [
                4554,
                4562
            ],
            [
                4597,
                4599
            ],
            [
                4689,
                4729
            ],
            [
                4749,
                4751
            ],
            [
                4758,
                4763
            ],
            [
                4769,
                4771
            ],
            [
                4945,
                4947
            ],
            [
                5189,
                5234
            ],
            [
                5234,
                5258
            ],
            [
                5272,
                5281
            ],
            [
                5307,
                5333
            ],
            [
                5353,
                5362
            ],
            [
                5259,
                5262
            ],
            [
                5383,
                5398
            ],
            [
                5269,
                5271
            ],
            [
                5343,
                5348
            ],
            [
                5363,
                5378
            ],
            [
                5450,
                5452
            ],
            [
                5505,
                5531
            ],
            [
                5576,
                5593
            ],
            [
                5564,
                5571
            ],
            [
                5709,
                5711
            ],
            [
                5711,
                5714
            ],
            [
                5730,
                5747
            ],
            [
                5761,
                5773
            ],
            [
                5954,
                5956
            ],
            [
                5956,
                6043
            ],
            [
                6043,
                6081
            ],
            [
                6088,
                6186
            ],
            [
                6207,
                6210
            ],
            [
                6431,
                6432
            ],
            [
                6433,
                6464
            ],
            [
                6496,
                6518
            ],
            [
                6518,
                6535
            ],
            [
                6543,
                6635
            ],
            [
                6650,
                6674
            ],
            [
                6674,
                6718
            ],
            [
                6759,
                6760
            ],
            [
                6801,
                6811
            ],
            [
                6812,
                6813
            ],
            [
                6797,
                6800
            ],
            [
                6851,
                6856
            ],
            [
                7190,
                7357
            ],
            [
                7363,
                7366
            ],
            [
                7381,
                7387
            ],
            [
                7400,
                7407
            ],
            [
                7388,
                7396
            ],
            [
                7417,
                7423
            ],
            [
                7423,
                7438
            ],
            [
                7440,
                7445
            ],
            [
                7458,
                7465
            ],
            [
                7500,
                7502
            ],
            [
                7723,
                7736
            ],
            [
                7748,
                7754
            ],
            [
                7616,
                7625
            ],
            [
                7759,
                7835
            ],
            [
                8113,
                8139
            ],
            [
                8154,
                8233
            ],
            [
                8233,
                8240
            ],
            [
                8246,
                8250
            ],
            [
                8308,
                8309
            ],
            [
                8261,
                8262
            ],
            [
                8275,
                8280
            ],
            [
                8263,
                8274
            ],
            [
                8303,
                8308
            ],
            [
                8317,
                8323
            ],
            [
                8537,
                8539
            ],
            [
                8546,
                8559
            ],
            [
                8600,
                8686
            ],
            [
                8739,
                8744
            ],
            [
                8712,
                8727
            ],
            [
                8745,
                8756
            ],
            [
                8794,
                8799
            ],
            [
                8764,
                8777
            ],
            [
                8810,
                8819
            ],
            [
                8895,
                8947
            ],
            [
                8963,
                8969
            ],
            [
                8979,
                8986
            ],
            [
                8986,
                9036
            ],
            [
                9169,
                9171
            ],
            [
                9041,
                9085
            ],
            [
                9178,
                9180
            ],
            [
                9180,
                9294
            ],
            [
                9325,
                9344
            ],
            [
                9310,
                9311
            ],
            [
                9422,
                9457
            ],
            [
                9525,
                9529
            ],
            [
                9561,
                9579
            ],
            [
                9581,
                9624
            ],
            [
                9626,
                9662
            ],
            [
                9662,
                9681
            ],
            [
                9724,
                9748
            ],
            [
                9753,
                9769
            ],
            [
                9998,
                10000
            ],
            [
                10000,
                10012
            ],
            [
                10068,
                10082
            ],
            [
                10031,
                10057
            ],
            [
                10158,
                10161
            ],
            [
                10180,
                10191
            ],
            [
                10221,
                10304
            ],
            [
                10388,
                10417
            ],
            [
                10429,
                10451
            ],
            [
                10459,
                10497
            ],
            [
                10497,
                10534
            ],
            [
                10562,
                10563
            ],
            [
                10573,
                10615
            ],
            [
                10626,
                10637
            ],
            [
                10637,
                10665
            ],
            [
                10669,
                10710
            ],
            [
                10758,
                10775
            ],
            [
                10779,
                10793
            ],
            [
                10793,
                10825
            ],
            [
                10825,
                10870
            ],
            [
                10870,
                10890
            ],
            [
                10917,
                10965
            ],
            [
                10965,
                10983
            ],
            [
                10994,
                11045
            ],
            [
                11050,
                11067
            ],
            [
                11046,
                11049
            ],
            [
                11114,
                11153
            ],
            [
                11153,
                11157
            ],
            [
                11171,
                11220
            ],
            [
                11316,
                11323
            ],
            [
                11277,
                11306
            ],
            [
                11308,
                11315
            ],
            [
                11324,
                11346
            ],
            [
                11363,
                11394
            ],
            [
                11411,
                11466
            ],
            [
                11491,
                11510
            ],
            [
                11575,
                11591
            ],
            [
                11602,
                11675
            ],
            [
                11797,
                11799
            ],
            [
                11799,
                11832
            ],
            [
                11834,
                11835
            ],
            [
                11842,
                11882
            ],
            [
                12008,
                12022
            ],
            [
                12039,
                12070
            ],
            [
                12070,
                12082
            ],
            [
                12082,
                12096
            ],
            [
                12106,
                12124
            ],
            [
                12126,
                12165
            ],
            [
                12165,
                12214
            ],
            [
                12215,
                12230
            ],
            [
                12423,
                12453
            ],
            [
                12511,
                12513
            ],
            [
                12513,
                12561
            ],
            [
                12563,
                12624
            ],
            [
                12638,
                12656
            ],
            [
                12664,
                12678
            ],
            [
                12717,
                12737
            ],
            [
                12760,
                12774
            ],
            [
                12797,
                12799
            ],
            [
                12799,
                12846
            ],
            [
                12849,
                12877
            ],
            [
                12884,
                12885
            ],
            [
                12899,
                12902
            ],
            [
                12963,
                13030
            ],
            [
                13031,
                13038
            ],
            [
                13132,
                13173
            ],
            [
                13173,
                13215
            ],
            [
                13228,
                13272
            ],
            [
                13393,
                13419
            ],
            [
                13420,
                13424
            ],
            [
                13428,
                13436
            ],
            [
                13436,
                13455
            ],
            [
                13515,
                13532
            ],
            [
                13464,
                13488
            ],
            [
                13676,
                13679
            ],
            [
                13783,
                13794
            ],
            [
                13800,
                13828
            ],
            [
                13828,
                13834
            ],
            [
                13846,
                13909
            ],
            [
                13909,
                13917
            ],
            [
                13955,
                13961
            ],
            [
                14016,
                14036
            ],
            [
                14100,
                14121
            ],
            [
                14384,
                14391
            ],
            [
                14140,
                14249
            ],
            [
                14266,
                14274
            ],
            [
                14428,
                14430
            ],
            [
                14443,
                14453
            ],
            [
                14463,
                14530
            ],
            [
                14544,
                14556
            ],
            [
                14558,
                14561
            ],
            [
                14570,
                14656
            ],
            [
                14676,
                14686
            ],
            [
                14692,
                14719
            ],
            [
                14719,
                14720
            ],
            [
                14730,
                14732
            ],
            [
                14896,
                14897
            ],
            [
                14954,
                14955
            ],
            [
                14958,
                14959
            ],
            [
                14971,
                14974
            ],
            [
                14974,
                15029
            ],
            [
                15029,
                15035
            ],
            [
                15069,
                15093
            ],
            [
                15105,
                15119
            ],
            [
                15140,
                15151
            ],
            [
                15151,
                15208
            ],
            [
                15213,
                15220
            ],
            [
                15224,
                15263
            ],
            [
                15395,
                15398
            ],
            [
                15264,
                15268
            ],
            [
                15357,
                15382
            ],
            [
                15388,
                15393
            ],
            [
                15452,
                15454
            ],
            [
                15618,
                15640
            ],
            [
                15604,
                15612
            ],
            [
                15645,
                15672
            ],
            [
                15672,
                15719
            ],
            [
                15736,
                15739
            ],
            [
                15739,
                15798
            ],
            [
                15798,
                15852
            ],
            [
                15873,
                15882
            ],
            [
                15953,
                15957
            ],
            [
                15966,
                15980
            ],
            [
                15937,
                15938
            ],
            [
                15999,
                16008
            ],
            [
                16020,
                16032
            ],
            [
                16032,
                16041
            ],
            [
                16049,
                16095
            ],
            [
                16101,
                16109
            ],
            [
                16120,
                16128
            ],
            [
                16116,
                16119
            ],
            [
                16205,
                16217
            ],
            [
                16217,
                16242
            ],
            [
                16247,
                16254
            ],
            [
                16299,
                16374
            ],
            [
                16385,
                16396
            ],
            [
                16428,
                16438
            ],
            [
                16424,
                16427
            ],
            [
                16404,
                16423
            ],
            [
                16450,
                16473
            ],
            [
                16473,
                16499
            ],
            [
                16510,
                16517
            ],
            [
                16568,
                16570
            ],
            [
                16570,
                16618
            ],
            [
                16776,
                16779
            ],
            [
                16779,
                16814
            ],
            [
                16815,
                16834
            ],
            [
                16846,
                16851
            ],
            [
                16856,
                16863
            ],
            [
                16907,
                16940
            ],
            [
                16959,
                16962
            ],
            [
                16968,
                16971
            ],
            [
                16957,
                16958
            ],
            [
                16985,
                17026
            ],
            [
                17035,
                17115
            ],
            [
                17159,
                17172
            ],
            [
                17172,
                17208
            ],
            [
                17248,
                17259
            ],
            [
                17284,
                17340
            ],
            [
                17340,
                17353
            ],
            [
                17353,
                17358
            ],
            [
                17377,
                17384
            ],
            [
                17384,
                17401
            ],
            [
                17412,
                17458
            ],
            [
                17970,
                17996
            ],
            [
                18002,
                18012
            ],
            [
                18019,
                18043
            ],
            [
                18043,
                18097
            ],
            [
                18097,
                18121
            ],
            [
                18121,
                18132
            ],
            [
                18151,
                18152
            ],
            [
                18154,
                18182
            ],
            [
                18182,
                18187
            ],
            [
                18189,
                18192
            ],
            [
                18194,
                18226
            ],
            [
                18228,
                18230
            ],
            [
                18233,
                18250
            ],
            [
                18250,
                18266
            ],
            [
                18291,
                18325
            ],
            [
                18339,
                18342
            ],
            [
                18327,
                18337
            ],
            [
                18353,
                18356
            ],
            [
                18356,
                18363
            ],
            [
                18411,
                18415
            ],
            [
                18370,
                18378
            ],
            [
                18420,
                18460
            ],
            [
                18393,
                18403
            ],
            [
                18462,
                18524
            ],
            [
                18524,
                18544
            ],
            [
                18544,
                18573
            ],
            [
                18573,
                18574
            ],
            [
                18588,
                18605
            ],
            [
                18614,
                18634
            ],
            [
                18634,
                18683
            ],
            [
                18683,
                18698
            ],
            [
                18698,
                18728
            ],
            [
                18737,
                18760
            ],
            [
                18765,
                18769
            ],
            [
                18793,
                18795
            ],
            [
                18804,
                18808
            ],
            [
                18808,
                18828
            ],
            [
                18829,
                18838
            ],
            [
                18854,
                18860
            ],
            [
                18906,
                18941
            ],
            [
                18941,
                18949
            ],
            [
                18957,
                18970
            ],
            [
                19323,
                19324
            ],
            [
                19112,
                19151
            ],
            [
                19189,
                19192
            ],
            [
                19370,
                19391
            ],
            [
                19348,
                19358
            ],
            [
                19393,
                19400
            ],
            [
                19414,
                19429
            ],
            [
                19208,
                19210
            ],
            [
                19439,
                19445
            ],
            [
                19514,
                19523
            ],
            [
                19523,
                19526
            ],
            [
                19554,
                19645
            ],
            [
                19645,
                19702
            ],
            [
                19703,
                19744
            ],
            [
                19856,
                19864
            ],
            [
                19872,
                19897
            ],
            [
                19922,
                19953
            ],
            [
                19972,
                19985
            ],
            [
                19999,
                20007
            ],
            [
                20017,
                20177
            ],
            [
                20177,
                20257
            ],
            [
                20257,
                20312
            ],
            [
                20409,
                20428
            ],
            [
                20454,
                20456
            ],
            [
                20456,
                20486
            ],
            [
                20509,
                20512
            ],
            [
                20512,
                20513
            ],
            [
                20516,
                20523
            ],
            [
                20528,
                20529
            ],
            [
                20577,
                20578
            ],
            [
                20610,
                20613
            ],
            [
                20614,
                20632
            ],
            [
                20643,
                20651
            ],
            [
                20655,
                20670
            ],
            [
                20670,
                20677
            ],
            [
                20707,
                20801
            ],
            [
                20801,
                20817
            ],
            [
                20824,
                20833
            ],
            [
                21052,
                21061
            ],
            [
                21088,
                21090
            ],
            [
                21090,
                21105
            ],
            [
                21115,
                21118
            ],
            [
                21125,
                21126
            ],
            [
                21134,
                21142
            ],
            [
                21152,
                21158
            ],
            [
                21158,
                21160
            ],
            [
                21229,
                21295
            ],
            [
                21308,
                21318
            ],
            [
                21362,
                21364
            ],
            [
                21364,
                21368
            ],
            [
                21371,
                21376
            ],
            [
                21412,
                21413
            ],
            [
                21406,
                21407
            ],
            [
                21387,
                21401
            ],
            [
                21568,
                21595
            ],
            [
                21595,
                21615
            ],
            [
                21712,
                21740
            ],
            [
                21740,
                21759
            ],
            [
                21769,
                21785
            ],
            [
                21765,
                21768
            ],
            [
                21912,
                21915
            ],
            [
                21918,
                21934
            ],
            [
                21937,
                21953
            ],
            [
                22065,
                22103
            ],
            [
                22115,
                22134
            ],
            [
                22134,
                22199
            ],
            [
                22204,
                22215
            ],
            [
                22314,
                22364
            ],
            [
                22376,
                22378
            ],
            [
                22378,
                22393
            ],
            [
                22425,
                22450
            ],
            [
                22496,
                22511
            ],
            [
                22511,
                22538
            ],
            [
                22538,
                22552
            ],
            [
                22605,
                22610
            ],
            [
                22617,
                22623
            ],
            [
                22635,
                22647
            ],
            [
                22628,
                22633
            ],
            [
                22666,
                22725
            ],
            [
                22725,
                22755
            ],
            [
                22796,
                22808
            ],
            [
                22770,
                22795
            ],
            [
                22810,
                22836
            ],
            [
                22851,
                22856
            ],
            [
                22862,
                22870
            ],
            [
                22881,
                22886
            ],
            [
                22887,
                22892
            ],
            [
                22907,
                22923
            ],
            [
                22923,
                22974
            ],
            [
                22979,
                22985
            ],
            [
                22990,
                22995
            ],
            [
                22995,
                23015
            ],
            [
                23019,
                23023
            ],
            [
                23016,
                23018
            ],
            [
                23024,
                23061
            ],
            [
                23095,
                23111
            ],
            [
                23112,
                23124
            ],
            [
                23218,
                23231
            ],
            [
                23233,
                23256
            ],
            [
                23268,
                23279
            ],
            [
                23281,
                23323
            ],
            [
                23323,
                23342
            ],
            [
                23348,
                23427
            ],
            [
                23427,
                23428
            ],
            [
                23445,
                23456
            ],
            [
                23456,
                23464
            ],
            [
                23558,
                23561
            ],
            [
                23582,
                23637
            ],
            [
                23637,
                23640
            ],
            [
                23747,
                23780
            ],
            [
                23782,
                23833
            ],
            [
                23833,
                23847
            ],
            [
                23847,
                23866
            ],
            [
                23866,
                23891
            ],
            [
                23891,
                23913
            ],
            [
                23913,
                23931
            ],
            [
                23942,
                23996
            ],
            [
                24038,
                24041
            ],
            [
                24041,
                24098
            ],
            [
                24099,
                24100
            ],
            [
                24109,
                24122
            ],
            [
                24129,
                24130
            ],
            [
                24152,
                24154
            ],
            [
                24334,
                24370
            ],
            [
                24370,
                24398
            ],
            [
                24439,
                24443
            ],
            [
                24451,
                24470
            ],
            [
                24512,
                24546
            ],
            [
                24546,
                24562
            ],
            [
                24631,
                24637
            ],
            [
                24682,
                24688
            ],
            [
                24673,
                24681
            ],
            [
                24583,
                24593
            ],
            [
                24688,
                24691
            ],
            [
                24691,
                24705
            ],
            [
                24732,
                24744
            ],
            [
                24768,
                24778
            ],
            [
                24796,
                24798
            ],
            [
                24798,
                24836
            ],
            [
                24836,
                24883
            ],
            [
                24883,
                24920
            ],
            [
                24920,
                24942
            ],
            [
                24942,
                24985
            ],
            [
                24995,
                25004
            ],
            [
                25032,
                25033
            ],
            [
                25018,
                25025
            ],
            [
                25034,
                25046
            ],
            [
                25089,
                25114
            ],
            [
                25129,
                25135
            ],
            [
                25159,
                25162
            ],
            [
                25162,
                25196
            ],
            [
                25216,
                25218
            ],
            [
                25228,
                25244
            ],
            [
                25315,
                25317
            ],
            [
                25317,
                25318
            ],
            [
                25465,
                25488
            ],
            [
                25499,
                25502
            ],
            [
                25502,
                25542
            ],
            [
                25542,
                25582
            ],
            [
                25597,
                25631
            ],
            [
                25644,
                25652
            ],
            [
                25673,
                25692
            ],
            [
                25692,
                25757
            ],
            [
                25759,
                25760
            ],
            [
                25805,
                25815
            ],
            [
                25848,
                25860
            ],
            [
                25861,
                25904
            ],
            [
                25914,
                25928
            ],
            [
                25938,
                25946
            ],
            [
                25955,
                25980
            ],
            [
                25980,
                25995
            ],
            [
                25995,
                26053
            ],
            [
                26053,
                26086
            ],
            [
                26086,
                26090
            ],
            [
                26130,
                26131
            ],
            [
                26132,
                26141
            ],
            [
                26176,
                26193
            ],
            [
                26227,
                26250
            ],
            [
                26250,
                26292
            ],
            [
                26292,
                26388
            ],
            [
                26388,
                26434
            ],
            [
                26454,
                26511
            ],
            [
                26511,
                26560
            ],
            [
                26560,
                26599
            ],
            [
                26719,
                26720
            ],
            [
                26746,
                26791
            ],
            [
                26791,
                26821
            ],
            [
                26821,
                26847
            ],
            [
                26847,
                26860
            ],
            [
                26870,
                26872
            ],
            [
                26965,
                26982
            ],
            [
                26984,
                26987
            ],
            [
                26989,
                27018
            ],
            [
                27029,
                27033
            ],
            [
                27059,
                27069
            ],
            [
                27069,
                27073
            ],
            [
                27114,
                27132
            ],
            [
                27091,
                27097
            ],
            [
                27132,
                27135
            ],
            [
                27135,
                27142
            ],
            [
                27142,
                27234
            ],
            [
                27234,
                27235
            ],
            [
                27236,
                27319
            ],
            [
                27319,
                27327
            ],
            [
                27327,
                27338
            ],
            [
                27347,
                27350
            ],
            [
                27350,
                27387
            ],
            [
                27389,
                27406
            ],
            [
                27406,
                27422
            ],
            [
                27426,
                27429
            ],
            [
                27458,
                27460
            ],
            [
                27460,
                27461
            ],
            [
                27496,
                27510
            ],
            [
                27512,
                27561
            ],
            [
                27561,
                27571
            ],
            [
                27608,
                27660
            ],
            [
                27672,
                27675
            ],
            [
                27675,
                27680
            ],
            [
                27682,
                27684
            ],
            [
                27685,
                27687
            ],
            [
                27687,
                27718
            ],
            [
                27718,
                27753
            ],
            [
                27763,
                27787
            ],
            [
                27813,
                27825
            ],
            [
                27833,
                27842
            ],
            [
                27842,
                27850
            ],
            [
                27857,
                27864
            ],
            [
                27909,
                27915
            ],
            [
                27874,
                27884
            ],
            [
                27951,
                27961
            ],
            [
                27974,
                27981
            ],
            [
                28020,
                28023
            ],
            [
                28007,
                28014
            ],
            [
                27981,
                27982
            ],
            [
                28068,
                28071
            ],
            [
                28222,
                28226
            ],
            [
                28278,
                28286
            ],
            [
                27993,
                27994
            ],
            [
                28310,
                28323
            ],
            [
                28339,
                28370
            ],
            [
                28014,
                28015
            ],
            [
                28424,
                28434
            ],
            [
                28450,
                28454
            ],
            [
                28508,
                28549
            ],
            [
                28622,
                28648
            ],
            [
                28648,
                28650
            ],
            [
                28887,
                28889
            ],
            [
                28765,
                28817
            ],
            [
                28824,
                28862
            ],
            [
                28952,
                28966
            ],
            [
                28723,
                28725
            ],
            [
                28745,
                28748
            ],
            [
                29004,
                29027
            ],
            [
                29027,
                29082
            ],
            [
                29082,
                29087
            ],
            [
                29095,
                29108
            ],
            [
                29108,
                29162
            ],
            [
                29162,
                29178
            ],
            [
                29224,
                29243
            ],
            [
                29256,
                29259
            ],
            [
                29267,
                29270
            ],
            [
                29270,
                29281
            ],
            [
                29304,
                29308
            ],
            [
                29313,
                29338
            ],
            [
                29349,
                29351
            ],
            [
                29351,
                29390
            ],
            [
                29390,
                29391
            ],
            [
                29416,
                29420
            ],
            [
                29424,
                29429
            ],
            [
                29391,
                29393
            ],
            [
                29465,
                29467
            ],
            [
                29535,
                29614
            ],
            [
                29681,
                29706
            ],
            [
                29736,
                29739
            ],
            [
                29739,
                29745
            ],
            [
                29745,
                29749
            ],
            [
                29763,
                29806
            ],
            [
                30014,
                30065
            ],
            [
                30065,
                30093
            ],
            [
                30103,
                30108
            ],
            [
                30108,
                30109
            ],
            [
                30116,
                30145
            ],
            [
                30151,
                30154
            ],
            [
                30162,
                30178
            ],
            [
                30178,
                30222
            ],
            [
                30232,
                30258
            ],
            [
                30258,
                30269
            ],
            [
                30400,
                30409
            ],
            [
                30413,
                30418
            ],
            [
                30429,
                30441
            ],
            [
                30450,
                30553
            ],
            [
                30553,
                30581
            ],
            [
                30581,
                30603
            ],
            [
                30705,
                30711
            ],
            [
                30641,
                30646
            ],
            [
                30717,
                30725
            ],
            [
                30732,
                30745
            ],
            [
                30745,
                30754
            ],
            [
                30759,
                30763
            ],
            [
                30776,
                30779
            ],
            [
                30822,
                30830
            ],
            [
                30830,
                30832
            ],
            [
                30855,
                30879
            ],
            [
                30887,
                30904
            ],
            [
                30904,
                30921
            ],
            [
                30961,
                30973
            ],
            [
                30936,
                30939
            ],
            [
                30980,
                30988
            ],
            [
                30995,
                31049
            ],
            [
                31049,
                31062
            ],
            [
                31120,
                31136
            ],
            [
                31184,
                31186
            ],
            [
                31232,
                31239
            ],
            [
                31096,
                31097
            ],
            [
                31141,
                31164
            ],
            [
                31239,
                31275
            ],
            [
                31296,
                31316
            ],
            [
                31316,
                31338
            ],
            [
                31358,
                31398
            ],
            [
                31398,
                31413
            ],
            [
                31416,
                31441
            ],
            [
                31459,
                31464
            ],
            [
                31465,
                31473
            ],
            [
                31475,
                31492
            ],
            [
                31501,
                31503
            ],
            [
                31556,
                31570
            ],
            [
                31653,
                31677
            ],
            [
                31677,
                31707
            ],
            [
                31757,
                31761
            ],
            [
                31799,
                31861
            ],
            [
                31861,
                31876
            ],
            [
                31876,
                31897
            ],
            [
                31931,
                31982
            ],
            [
                32244,
                32268
            ],
            [
                32275,
                32297
            ],
            [
                32301,
                32311
            ],
            [
                32311,
                32362
            ],
            [
                32362,
                32374
            ],
            [
                32374,
                32380
            ],
            [
                32431,
                32500
            ],
            [
                32500,
                32501
            ],
            [
                32508,
                32514
            ],
            [
                32529,
                32575
            ],
            [
                32575,
                32662
            ],
            [
                32662,
                32677
            ],
            [
                32677,
                32719
            ],
            [
                32719,
                32733
            ],
            [
                32738,
                32741
            ],
            [
                32742,
                32751
            ],
            [
                32751,
                32806
            ],
            [
                32827,
                32898
            ],
            [
                32898,
                32899
            ],
            [
                32927,
                33005
            ],
            [
                33006,
                33062
            ],
            [
                33062,
                33150
            ],
            [
                33161,
                33174
            ]
        ],
        "row_chars": [
            [
                0,
                68
            ],
            [
                68,
                242
            ],
            [
                242,
                382
            ],
            [
                382,
                422
            ],
            [
                422,
                433
            ],
            [
                433,
                480
            ],
            [
                480,
                587
            ],
            [
                587,
                625
            ],
            [
                625,
                661
            ],
            [
                661,
                687
            ],
            [
                687,
                703
            ],
            [
                703,
                827
            ],
            [
                827,
                835
            ],
            [
                835,
                881
            ],
            [
                881,
                947
            ],
            [
                947,
                963
            ],
            [
                963,
                985
            ],
            [
                985,
                1010
            ],
            [
                1010,
                1027
            ],
            [
                1027,
                1130
            ],
            [
                1130,
                1147
            ],
            [
                1147,
                1169
            ],
            [
                1169,
                1218
            ],
            [
                1218,
                1230
            ],
            [
                1230,
                1261
            ],
            [
                1261,
                1274
            ],
            [
                1274,
                1395
            ],
            [
                1395,
                1438
            ],
            [
                1438,
                1498
            ],
            [
                1498,
                1622
            ],
            [
                1622,
                1781
            ],
            [
                1781,
                1892
            ],
            [
                1892,
                2114
            ],
            [
                2114,
                2511
            ],
            [
                2511,
                2517
            ],
            [
                2517,
                2531
            ],
            [
                2531,
                2549
            ],
            [
                2549,
                2574
            ],
            [
                2574,
                2619
            ],
            [
                2619,
                2649
            ],
            [
                2649,
                2782
            ],
            [
                2782,
                2861
            ],
            [
                2861,
                3155
            ],
            [
                3155,
                3527
            ],
            [
                3527,
                3580
            ],
            [
                3580,
                3585
            ],
            [
                3585,
                3598
            ],
            [
                3598,
                3846
            ],
            [
                3846,
                3948
            ],
            [
                3948,
                4462
            ],
            [
                4462,
                4599
            ],
            [
                4599,
                4947
            ],
            [
                4947,
                5155
            ],
            [
                5155,
                5189
            ],
            [
                5189,
                5234
            ],
            [
                5234,
                5452
            ],
            [
                5452,
                5711
            ],
            [
                5711,
                5956
            ],
            [
                5956,
                6043
            ],
            [
                6043,
                6433
            ],
            [
                6433,
                6518
            ],
            [
                6518,
                6674
            ],
            [
                6674,
                6857
            ],
            [
                6857,
                6991
            ],
            [
                6991,
                7423
            ],
            [
                7423,
                7502
            ],
            [
                7502,
                7585
            ],
            [
                7585,
                7836
            ],
            [
                7836,
                8113
            ],
            [
                8113,
                8233
            ],
            [
                8233,
                8539
            ],
            [
                8539,
                8820
            ],
            [
                8820,
                8895
            ],
            [
                8895,
                8986
            ],
            [
                8986,
                9180
            ],
            [
                9180,
                9457
            ],
            [
                9457,
                9503
            ],
            [
                9503,
                9662
            ],
            [
                9662,
                10000
            ],
            [
                10000,
                10153
            ],
            [
                10153,
                10304
            ],
            [
                10304,
                10388
            ],
            [
                10388,
                10497
            ],
            [
                10497,
                10626
            ],
            [
                10626,
                10637
            ],
            [
                10637,
                10665
            ],
            [
                10665,
                10793
            ],
            [
                10793,
                10825
            ],
            [
                10825,
                10870
            ],
            [
                10870,
                10892
            ],
            [
                10892,
                10917
            ],
            [
                10917,
                10965
            ],
            [
                10965,
                11153
            ],
            [
                11153,
                11221
            ],
            [
                11221,
                11266
            ],
            [
                11266,
                11510
            ],
            [
                11510,
                11799
            ],
            [
                11799,
                11883
            ],
            [
                11883,
                12008
            ],
            [
                12008,
                12070
            ],
            [
                12070,
                12082
            ],
            [
                12082,
                12165
            ],
            [
                12165,
                12513
            ],
            [
                12513,
                12799
            ],
            [
                12799,
                13031
            ],
            [
                13031,
                13173
            ],
            [
                13173,
                13272
            ],
            [
                13272,
                13387
            ],
            [
                13387,
                13436
            ],
            [
                13436,
                13828
            ],
            [
                13828,
                13909
            ],
            [
                13909,
                14036
            ],
            [
                14036,
                14430
            ],
            [
                14430,
                14719
            ],
            [
                14719,
                14732
            ],
            [
                14732,
                14749
            ],
            [
                14749,
                14773
            ],
            [
                14773,
                14974
            ],
            [
                14974,
                15029
            ],
            [
                15029,
                15037
            ],
            [
                15037,
                15151
            ],
            [
                15151,
                15454
            ],
            [
                15454,
                15585
            ],
            [
                15585,
                15672
            ],
            [
                15672,
                15739
            ],
            [
                15739,
                15798
            ],
            [
                15798,
                15992
            ],
            [
                15992,
                16032
            ],
            [
                16032,
                16217
            ],
            [
                16217,
                16396
            ],
            [
                16396,
                16473
            ],
            [
                16473,
                16570
            ],
            [
                16570,
                16779
            ],
            [
                16779,
                16863
            ],
            [
                16863,
                16907
            ],
            [
                16907,
                17172
            ],
            [
                17172,
                17340
            ],
            [
                17340,
                17353
            ],
            [
                17353,
                17384
            ],
            [
                17384,
                17461
            ],
            [
                17461,
                17532
            ],
            [
                17532,
                17597
            ],
            [
                17597,
                17770
            ],
            [
                17770,
                17888
            ],
            [
                17888,
                17970
            ],
            [
                17970,
                18043
            ],
            [
                18043,
                18097
            ],
            [
                18097,
                18121
            ],
            [
                18121,
                18132
            ],
            [
                18132,
                18150
            ],
            [
                18150,
                18182
            ],
            [
                18182,
                18233
            ],
            [
                18233,
                18250
            ],
            [
                18250,
                18356
            ],
            [
                18356,
                18462
            ],
            [
                18462,
                18524
            ],
            [
                18524,
                18544
            ],
            [
                18544,
                18573
            ],
            [
                18573,
                18634
            ],
            [
                18634,
                18683
            ],
            [
                18683,
                18698
            ],
            [
                18698,
                18808
            ],
            [
                18808,
                18941
            ],
            [
                18941,
                18971
            ],
            [
                18971,
                18997
            ],
            [
                18997,
                19112
            ],
            [
                19112,
                19523
            ],
            [
                19523,
                19645
            ],
            [
                19645,
                19744
            ],
            [
                19744,
                19856
            ],
            [
                19856,
                19953
            ],
            [
                19953,
                20177
            ],
            [
                20177,
                20257
            ],
            [
                20257,
                20364
            ],
            [
                20364,
                20409
            ],
            [
                20409,
                20456
            ],
            [
                20456,
                20512
            ],
            [
                20512,
                20670
            ],
            [
                20670,
                20801
            ],
            [
                20801,
                21090
            ],
            [
                21090,
                21160
            ],
            [
                21160,
                21364
            ],
            [
                21364,
                21376
            ],
            [
                21376,
                21430
            ],
            [
                21430,
                21469
            ],
            [
                21469,
                21477
            ],
            [
                21477,
                21568
            ],
            [
                21568,
                21595
            ],
            [
                21595,
                21740
            ],
            [
                21740,
                21937
            ],
            [
                21937,
                22134
            ],
            [
                22134,
                22215
            ],
            [
                22215,
                22378
            ],
            [
                22378,
                22511
            ],
            [
                22511,
                22538
            ],
            [
                22538,
                22554
            ],
            [
                22554,
                22605
            ],
            [
                22605,
                22610
            ],
            [
                22610,
                22617
            ],
            [
                22617,
                22725
            ],
            [
                22725,
                22923
            ],
            [
                22923,
                22995
            ],
            [
                22995,
                23061
            ],
            [
                23061,
                23095
            ],
            [
                23095,
                23127
            ],
            [
                23127,
                23132
            ],
            [
                23132,
                23151
            ],
            [
                23151,
                23175
            ],
            [
                23175,
                23208
            ],
            [
                23208,
                23323
            ],
            [
                23323,
                23427
            ],
            [
                23427,
                23456
            ],
            [
                23456,
                23561
            ],
            [
                23561,
                23582
            ],
            [
                23582,
                23637
            ],
            [
                23637,
                23642
            ],
            [
                23642,
                23747
            ],
            [
                23747,
                23782
            ],
            [
                23782,
                23833
            ],
            [
                23833,
                23847
            ],
            [
                23847,
                23866
            ],
            [
                23866,
                23891
            ],
            [
                23891,
                23913
            ],
            [
                23913,
                23934
            ],
            [
                23934,
                23941
            ],
            [
                23941,
                24041
            ],
            [
                24041,
                24099
            ],
            [
                24099,
                24154
            ],
            [
                24154,
                24209
            ],
            [
                24209,
                24230
            ],
            [
                24230,
                24282
            ],
            [
                24282,
                24327
            ],
            [
                24327,
                24370
            ],
            [
                24370,
                24400
            ],
            [
                24400,
                24439
            ],
            [
                24439,
                24470
            ],
            [
                24470,
                24546
            ],
            [
                24546,
                24691
            ],
            [
                24691,
                24798
            ],
            [
                24798,
                24836
            ],
            [
                24836,
                24883
            ],
            [
                24883,
                24920
            ],
            [
                24920,
                24942
            ],
            [
                24942,
                25162
            ],
            [
                25162,
                25317
            ],
            [
                25317,
                25502
            ],
            [
                25502,
                25542
            ],
            [
                25542,
                25653
            ],
            [
                25653,
                25692
            ],
            [
                25692,
                25815
            ],
            [
                25815,
                25839
            ],
            [
                25839,
                25980
            ],
            [
                25980,
                25995
            ],
            [
                25995,
                26053
            ],
            [
                26053,
                26086
            ],
            [
                26086,
                26250
            ],
            [
                26250,
                26292
            ],
            [
                26292,
                26388
            ],
            [
                26388,
                26511
            ],
            [
                26511,
                26560
            ],
            [
                26560,
                26791
            ],
            [
                26791,
                26821
            ],
            [
                26821,
                26847
            ],
            [
                26847,
                26872
            ],
            [
                26872,
                26965
            ],
            [
                26965,
                27021
            ],
            [
                27021,
                27028
            ],
            [
                27028,
                27069
            ],
            [
                27069,
                27135
            ],
            [
                27135,
                27142
            ],
            [
                27142,
                27234
            ],
            [
                27234,
                27319
            ],
            [
                27319,
                27327
            ],
            [
                27327,
                27350
            ],
            [
                27350,
                27406
            ],
            [
                27406,
                27460
            ],
            [
                27460,
                27561
            ],
            [
                27561,
                27675
            ],
            [
                27675,
                27687
            ],
            [
                27687,
                27718
            ],
            [
                27718,
                27787
            ],
            [
                27787,
                27813
            ],
            [
                27813,
                27842
            ],
            [
                27842,
                27918
            ],
            [
                27918,
                27935
            ],
            [
                27935,
                27951
            ],
            [
                27951,
                28373
            ],
            [
                28373,
                28407
            ],
            [
                28407,
                28551
            ],
            [
                28551,
                28622
            ],
            [
                28622,
                28650
            ],
            [
                28650,
                28700
            ],
            [
                28700,
                29027
            ],
            [
                29027,
                29082
            ],
            [
                29082,
                29108
            ],
            [
                29108,
                29162
            ],
            [
                29162,
                29178
            ],
            [
                29178,
                29224
            ],
            [
                29224,
                29270
            ],
            [
                29270,
                29351
            ],
            [
                29351,
                29390
            ],
            [
                29390,
                29467
            ],
            [
                29467,
                29535
            ],
            [
                29535,
                29614
            ],
            [
                29614,
                29676
            ],
            [
                29676,
                29739
            ],
            [
                29739,
                29745
            ],
            [
                29745,
                29807
            ],
            [
                29807,
                30014
            ],
            [
                30014,
                30065
            ],
            [
                30065,
                30108
            ],
            [
                30108,
                30178
            ],
            [
                30178,
                30258
            ],
            [
                30258,
                30269
            ],
            [
                30269,
                30291
            ],
            [
                30291,
                30322
            ],
            [
                30322,
                30399
            ],
            [
                30399,
                30553
            ],
            [
                30553,
                30581
            ],
            [
                30581,
                30606
            ],
            [
                30606,
                30745
            ],
            [
                30745,
                30830
            ],
            [
                30830,
                30904
            ],
            [
                30904,
                31049
            ],
            [
                31049,
                31275
            ],
            [
                31275,
                31296
            ],
            [
                31296,
                31316
            ],
            [
                31316,
                31398
            ],
            [
                31398,
                31413
            ],
            [
                31413,
                31503
            ],
            [
                31503,
                31556
            ],
            [
                31556,
                31677
            ],
            [
                31677,
                31861
            ],
            [
                31861,
                31876
            ],
            [
                31876,
                31982
            ],
            [
                31982,
                32006
            ],
            [
                32006,
                32038
            ],
            [
                32038,
                32120
            ],
            [
                32120,
                32244
            ],
            [
                32244,
                32311
            ],
            [
                32311,
                32362
            ],
            [
                32362,
                32374
            ],
            [
                32374,
                32380
            ],
            [
                32380,
                32398
            ],
            [
                32398,
                32431
            ],
            [
                32431,
                32500
            ],
            [
                32500,
                32575
            ],
            [
                32575,
                32662
            ],
            [
                32662,
                32677
            ],
            [
                32677,
                32719
            ],
            [
                32719,
                32751
            ],
            [
                32751,
                33006
            ],
            [
                33006,
                33062
            ],
            [
                33062,
                33174
            ]
        ]
    },
    "abridged": {
        "text": "Moore was still in good spirits when he rose next morning. He and Joe Scott had spent the night in the mill, on camp-beds kept in the counting-houses. The master was up early, and awoke his man by singing a French song as he dressed.\n\"Get up, Joseph, and we'll walk through the mill before the hands come in, and I'll explain my plans. We'll have the machinery yet. You never heard of Bruce, perhaps?\"\n\"And the spider? Yes, I hev. Ye mean to say ye'll persevere.\"\n\"I do.\"\n\"Is there many like you i' your country?\" inquired Joe, as he folded up his bed.\n\"In my country! Which is my country?\"\n\"Why, France - isn't it?\"\n\"No, indeed! Just because the French have seized Antwerp, where I was born, does not make me a Frenchman.\"\n\"Dutch, then?\"\n\"Now you are confounding Antwerp with Amsterdam.\"\n\"Flanders?\"\n\"I scorn the insinuation, Joe! Have I a Flemish face, with a clumsy nose and pale blue eyes? Am I all body and no legs? Joe, I'm an Anversois - a native of Antwerp - though my mother came of French lineage, which is why I speak French.\"\n\"But your father were Yorkshire, which maks ye a bit Yorkshire too; and onybody may see ye're akin to us, ye're so keen o' making brass.\"\n\"Joe, you're an impudent dog.\"\n\"We allus speak our minds i' this country; and them young parsons and grand folk fro' London is shocked at it; and we like to gi'e 'em summat to be shocked at, so we can watch 'em widen their eyes, and say, 'Dear! dear! Whet seveges! How very coarse!'\"\n\"You are savages, Joe. You don't suppose you're civilized, do you?\"\n\"Middling, maister. I reckon us manufacturing lads i' th' north is a deal more intelligent nor th' farming folk i' th' south. Trade sharpens our wits; and mechanics like me is forced to think. When I see an effect, I look straight away for a cause; and then I like reading.\"\n\"You think yourself a clever fellow, Scott.\"\n\"Ay! I'm fairish; but there's thousands i' Yorkshire that's as good as me, and a few that's better.\"\n\"You're a sublime fellow; but you're a conceited noodle too, Joe! You need not think that because you've picked up a little mathematics, and the elements of chemistry at the bottom of a dyeing vat, that therefore you're a neglected man of science. Virtue does not live only in workmen's cottages. Human nature is human nature everywhere, amongst rich or poor, and in between. Away with you, Joe, and ring the mill bell.\"\nIt was now the middle of February; dawn was just beginning to penetrate the brown obscurity of night with a pale ray. No colour tinged the east, as day slowly lifted a heavy eyelid. The morning was chill; a raw wind blew. It had ceased to rain, but the earth was sodden, and the pools and rivulets were full.\nThe mill-windows were alight, the bell rung loud, and now the little children came running in, in too great a hurry, let us hope, to feel the cold. Mr. Moore stood at the entrance, counting them as they went by. To those who came late he said a word of reprimand, which was a little more sharply repeated by Joe Scott when they reached the work-rooms. Neither master nor overlooker spoke savagely, although they fined one boy a penny for coming very late.\nThough I describe imperfect characters (every character in this book will be found to be more or less imperfect, my pen refusing to draw anything in the model line), I do not handle utterly degraded ones. There are no child-torturers or slave drivers here. I am happy to inform my reader that neither Mr. Moore nor his overlooker ever struck a child in their mill.\nMr. Moore haunted his mill, his dye-house, and his warehouse till the sickly dawn strengthened into day. The sun rose - a clear white disc, as chill as ice. At eight o'clock the signal was given for breakfast; the children, released for half an hour from toil, opened their little tin cans of coffee, and their small baskets of bread.\nAnd now at last Mr. Moore quitted the mill-yard, and went to his house. It was only a short distance from the factory, but secluded by a hedge and high bank on each side of the lane. It was a small, whitewashed place, with a green porch over the door; scanty brown stalks showed in the garden soil beneath the windows, predicting blooming creepers for summer days. Only in sheltered nooks did the first shoots of snowdrop or crocus peep, green as emerald, from the earth. The spring was late; the last deep snow had only just disappeared. Three trees, not lofty, but graceful, rose beside the cottage. It was a snug nest, but one within which the wings of action and ambition could not long lie folded.\nInstead of entering the house, Mr. Moore fetched a spade from a shed and began to work in the garden. For about a quarter of an hour he dug, until a window opened, and a female voice called:\n\"Eh, bien! Tu ne djenes pas ce matin?\"\nHis answer, and the rest of the conversation, I shall translate into English.\n\"Is breakfast ready, Hortense?\"\n\"Certainly; it has been ready half an hour.\"\n\"Then I am ready too.\"\nHe threw down his spade, and entered the house. The narrow passage led him to a small parlour, where a breakfast of coffee, bread and butter, and stewed pears, was spread on the table. Over this meal presided the lady who had spoken from the window.\nShe was a little older than Mr. Moore - perhaps thirty-five, tall, and stout; she had very black hair, twisted up in curl-papers, a high colour in her cheeks, and little black eyes. Her forehead was rather corrugated; she had a fretful though not an ill-natured expression. The strangest point was her dress - a short petticoat and a striped cotton camisole.\nYou will think she is a remarkable slattern, reader. Not at all. Hortense Moore, Mr. Moore's sister, was a very orderly, economical person. The petticoat, camisole, and curl-papers were her usual morning costume: she adhered to her old Belgian customs.\nMademoiselle had an excellent opinion of herself - an opinion not wholly undeserved, for she possessed some good qualities; but she over-estimated her own virtues, and quite left out her various little defects. You could never have persuaded her that she was prejudiced and narrow-minded, with too much self-importance, and too apt to take offence about trifles; yet all this was true.\nHowever, she could be kind and friendly enough. To her two brothers (for there was another besides Robert) she was very much attached. Louis, however, she knew less well than Robert. He had been sent to an English school when a mere boy, and had followed the arduous and modest career of a teacher. He had taught in a school, and was said now to be tutor in a private family. Hortense thought of him as backward and quiet. She was very proud of Robert, regarding him as the greatest man in Europe; all he said and did was remarkable in her eyes, and she expected others to have the same opinion.\nAs soon as Robert was seated at the breakfast-table, and she had helped him to some stewed pears and a good-sized Belgian tartine, she began to pour out a flood of amazement and horror at last night's destruction of the frames.\n\"What a shameful thing to do! It's clear that English workers are wicked beasts, just like English servants - that Sarah, for one!\"\n\"She looks clean and industrious,\" Mr. Moore remarked.\n\"Looks? I do not say that she is dirty or idle, but her insolence! She disputed with me a quarter of an hour yesterday about cooking the beef; she said I boiled it to rags, and that my stock was no better than greasy water! Yet I cannot part with the girl lest I should get a worse. You are in the same position with your workmen, my poor brother!\"\n\"I am afraid you are not very happy in England, Hortense.\"\n\"It is my duty to be happy where you are, brother; but certainly people here appear to me ill-bred. They consider my habits ridiculous. If a girl from your mill chances to come into the kitchen and finds me in my camisole and petticoat, she sneers. If I accept an invitation to tea, I am put quite into the background; I have not that attention paid me which is my due. The Grards are an excellent family, and the Moores also! They have a right to claim respect. In Antwerp I was always treated with distinction.\"\n\"Hortense, in Antwerp we were known as rich; in England we have always been known as poor.\"\n\"Again, dear brother, last Sunday, because it was wet, I went to church in my neat black sabots, footwear which one would not indeed wear in a fashionable city, but which in the country I have always used on dirty roads. Believe me, as I paced up the aisle, four ladies laughed and hid their faces behind their prayer-books.\"\n\"Well, well! don't wear them again. I told you before they were not quite the thing for this country. And as to the camisole and petticoat, I am not sure about them either. I never see an English lady dressed in such garments. Ask Caroline Helstone.\"\n\"Caroline! I consult her about my dress? It is she who on all points should consult me. She is a child.\"\n\"She is eighteen - old enough to know all about gowns and petticoats.\"\n\"Do not make Caroline of more consequence than she ought to be, brother. At present she is modest and unassuming: let us keep her so.\"\n\"With all my heart. Is she coming this morning?\"\n\"At ten, as usual, for her French lesson.\"\n\"You don't find that she sneers at you, do you?\"\n\"She does not. She appreciates me better than anyone else here; but then she sees more of me. She sees that I have the education and manner of a person well born and well bred.\"\n\"Are you fond of her?\" asked Moore.\n\"I have a regard for her as my relative; and she behaves very well at lessons. But you know, brother, that my manner commands respect. Yet I perceive clearly that Caroline is not perfect, that there is much to be desired in her.\"\n\"Give me a last cup of coffee, and while I am drinking it, amuse me with an account of her faults.\"\n\"Caroline is defective; but with my motherly care she may improve. She has an occasional reserve, which I do not quite like, because it is not sufficiently girlish and submissive; and there are glimpses of an unsettled hurry in her nature, which put me out. Yet she is usually most tranquil, too dejected and thoughtful indeed sometimes. In time, I doubt not, I shall make her uniformly sedate.\"\n\"I don't understand. What do you mean by 'unsettled hurry'?\"\n\"For example, when I ask her to read French poetry to practice her pronunciation. She has gone through much of Corneille and Racine, in a very steady, sober spirit, such as I approve. Occasionally she seemed, indeed, apathetic. The other day I gave her a book of short pieces, to learn one by heart. I saw her turning the leaves over impatiently, and curling her lip with scorn. I chided her. 'Cousin,' said she, 'all this bores me to death. Are there not two lines of poetry in all of French literature?' I inquired what she meant. She begged my pardon, and began to learn assiduously. In half an hour she stood before me, and recited Chenier's La Jeune Captive. If you had heard her, you would have known what I meant by 'unsettled hurry.' One would have thought Chnier was more moving than all Racine and Corneille. She has an ill-regulated mind; but she is fortunate in her teacher. I will give her a set of opinions; I will guide her feelings.\"\n\"Be sure you do, Hortense. Here she comes.\"\n\"Ah! She is half an hour early. -My child, what brings you here before I have breakfasted?\"\nThis question was addressed to a young girl who now entered the room, wrapped in a winter mantle which was gathered gracefully round a slender figure.\n\"I came in haste to see how you were, Hortense, and Robert too. I was sure you would both be grieved by what happened last night. My uncle told me about it at breakfast. He is very angry - but he was with Robert, was he not? Did he not go with you to Stilbro' Moor?\"\n\"Yes, we set out in martial style, Caroline; but the prisoners we went to rescue met us half-way.\"\n\"Nobody was hurt?\"\n\"Why, no.\"\n\"You were not with the wagons when they were attacked?\"\n\"No.\"\n\"Where are you going this morning?\" asked Caroline. \"I saw Murgatroyd saddling your horse in the yard.\"\n\"To Whinbury. It is market day.\"\n\"Mr. Yorke is going too. I met him in his gig. Come home with him. Two are better than one, and nobody dislikes Mr. Yorke.\"\n\"Therefore he would be a protection to me, who am hated?\" suggested Moore.\n\"Misunderstood, not hated. What time will you return, Robert?\"\n\"I generally return at seven.'\n\"Try to be back by six. By seven daylight is quite gone.\"\n\"And what danger do you foresee for me in darkness, Caroline?\"\n\"I am not sure, but we all feel anxious at present. My uncle calls these times dangerous. He says, too, that mill-owners are unpopular.\"\n\"And I am one of the most unpopular? Is not that the fact? You are reluctant to speak out plainly, but you think I may be attacked, like Pearson - who was shot in his own house, through the window.\"\n\"Anne Pearson showed me the bullet,\" said Caroline gravely. \"You will be back by six?\"\n\"Certainly he will,\" affirmed Hortense. \"And now, my child, prepare your lessons, while I put the peas to soak for dinner.\" She left the room.\n\"You suspect I have many enemies, then, Caroline,\" said Mr. Moore. \"Have I no friends?\"\n\"Your sister, and your brother Louis, whom I have never seen; and Mr. Yorke, and my uncle - besides, of course, many more.\"\nRobert smiled. \"You would be puzzled to name your 'many more,'\" said he. \"But show me your exercise-book. What careful handwriting! My sister wants to form you like a Flemish school-girl. What life are you destined for, Caroline? What will you do with your French, drawing, and other accomplishments, when they are acquired?\"\n\"You may well say, when they are acquired; for till Hortense began to teach me, I knew precious little. As to the life I am destined for, I cannot tell. I suppose to keep my uncle's house till - till events offer other occupations for me.\"\n\"A remarkably vague prospect! Are you content with it?\"\n\"I used to be. But there are moments now when I am not quite satisfied. I am earning nothing.\"\n\"You wish to make money, Lina?\"\n\"I do. I should like an occupation; and if I were a boy, it would not be so difficult to find one. I can see such an easy, pleasant way of learning a business, and making my way in life.\"\n\"Go on. Let us hear how.\"\n\"I could be apprenticed to your trade - the cloth-trade. I could learn it from you. I could keep the books and write the letters, while you went to market. I know you want to pay your father's debts; perhaps I could help you.\"\n\"Help me? You should think of yourself.\"\n\"I do think of myself; but must one think only of oneself?\"\n\"Of whom else dare I think? The poor need to have narrow sympathies. Poverty is selfish and anxious, and sympathy must be checked by Prudence, whose frosty breath is as nipping as any north wind. By poverty, I mean the embarrassed penury of the man in debt.\"\n\"Cherish hope, not anxiety,\" urged Caroline. \"I feel there is something wrong in your notions of the best way of attaining happiness, as there is in - in your manner to the Yorkshire workpeople.\"\n\"You have often wanted to tell me that, have you not?\"\n\"Yes; very often.\"\n\"The faults of my manner are, I think, only negative. I am not proud. I am only taciturn, and serious.\"\n\"As if your workmen were machines like your frames. In your own house you seem different.\"\n\"I am an alien to them. And for my part I find them irrational, perverse; they hinder me when I long to hurry forward. I don't expect them to love me.\"\n\"Ah!\" said Caroline, shaking her head and heaving a deep sigh.\n\"I suppose I am not an affectionate man, Caroline. The attachment of a very few people is enough for me.\"\n\"Please, Robert, will you mend my pen before you go?\"\n\"First let me rule your book, for you always manage to draw the lines aslant. There now. If I were a tutor like Louis I might stay and dedicate this morning to you and your studies, whereas I must spend it in Skyes's wool-warehouse.\"\n\"You will be making money.\"\n\"More likely losing it. There, my horse is ready; I must go. I'll take a look at the garden first.\"\nHe went out into the garden behind the mill. A sweet fringe of snowdrop, crocus and primrose bloomed in the sunshine under the hot wall of the factory. Moore plucked a little bouquet of flowers, returned to the parlour, and laid them on Caroline's desk.\n\"Thank you, Robert. It is pretty; it looks like sparkles of sunshine and blue sky. Good-morning.\"\nRobert went to the door, stopped as if about to speak; said nothing, and went out. But in a second he re-entered the cottage.\n\"I forgot my gloves,\" he said, and then asked, \"You have no binding engagement at home perhaps, Caroline?\"\n\"I never have. Some children's socks to knit for the Jew's basket; but they will keep.\"\n\"Forget the Jew's basket, and spend the day here for a change. Your uncle won't break his heart at your absence?\"\nShe smiled. \"No.\"\n\"Then stay and dine with Hortense; she will be glad of your company. When I return, we will have a little reading in the evening. The moon rises at half-past eight, and I will walk up to the rectory with you at nine. Do you agree?\"\nShe nodded her head, and her eyes lit up.\nMoore lingered for two more minutes. He bent over Caroline's desk and glanced at her grammar, he lifted her bouquet and played with it; his horse stamped impatiently; his groom coughed at the gate, as if he wondered what in the world his master was doing.\n\"Good-morning,\" again said Moore, and finally vanished.\nHortense, coming in ten minutes after, found, to her surprise, that Caroline had not yet begun her exercise.",
        "paragraph_chars": [
            [
                0,
                234
            ],
            [
                234,
                402
            ],
            [
                402,
                464
            ],
            [
                464,
                472
            ],
            [
                472,
                553
            ],
            [
                553,
                591
            ],
            [
                591,
                617
            ],
            [
                617,
                724
            ],
            [
                724,
                739
            ],
            [
                739,
                789
            ],
            [
                789,
                801
            ],
            [
                801,
                1038
            ],
            [
                1038,
                1176
            ],
            [
                1176,
                1207
            ],
            [
                1207,
                1460
            ],
            [
                1460,
                1528
            ],
            [
                1528,
                1803
            ],
            [
                1803,
                1848
            ],
            [
                1848,
                1949
            ],
            [
                1949,
                2370
            ],
            [
                2370,
                2679
            ],
            [
                2679,
                3135
            ],
            [
                3135,
                3500
            ],
            [
                3500,
                3835
            ],
            [
                3835,
                4538
            ],
            [
                4538,
                4729
            ],
            [
                4729,
                4768
            ],
            [
                4768,
                4846
            ],
            [
                4846,
                4878
            ],
            [
                4878,
                4923
            ],
            [
                4923,
                4946
            ],
            [
                4946,
                5196
            ],
            [
                5196,
                5555
            ],
            [
                5555,
                5808
            ],
            [
                5808,
                6194
            ],
            [
                6194,
                6790
            ],
            [
                6790,
                7018
            ],
            [
                7018,
                7150
            ],
            [
                7150,
                7205
            ],
            [
                7205,
                7554
            ],
            [
                7554,
                7613
            ],
            [
                7613,
                8127
            ],
            [
                8127,
                8219
            ],
            [
                8219,
                8545
            ],
            [
                8545,
                8796
            ],
            [
                8796,
                8901
            ],
            [
                8901,
                8972
            ],
            [
                8972,
                9107
            ],
            [
                9107,
                9156
            ],
            [
                9156,
                9199
            ],
            [
                9199,
                9248
            ],
            [
                9248,
                9426
            ],
            [
                9426,
                9462
            ],
            [
                9462,
                9692
            ],
            [
                9692,
                9792
            ],
            [
                9792,
                10188
            ],
            [
                10188,
                10249
            ],
            [
                10249,
                11199
            ],
            [
                11199,
                11243
            ],
            [
                11243,
                11335
            ],
            [
                11335,
                11486
            ],
            [
                11486,
                11753
            ],
            [
                11753,
                11852
            ],
            [
                11852,
                11871
            ],
            [
                11871,
                11882
            ],
            [
                11882,
                11938
            ],
            [
                11938,
                11944
            ],
            [
                11944,
                12048
            ],
            [
                12048,
                12081
            ],
            [
                12081,
                12205
            ],
            [
                12205,
                12280
            ],
            [
                12280,
                12343
            ],
            [
                12343,
                12374
            ],
            [
                12374,
                12432
            ],
            [
                12432,
                12495
            ],
            [
                12495,
                12632
            ],
            [
                12632,
                12831
            ],
            [
                12831,
                12918
            ],
            [
                12918,
                13061
            ],
            [
                13061,
                13149
            ],
            [
                13149,
                13273
            ],
            [
                13273,
                13599
            ],
            [
                13599,
                13839
            ],
            [
                13839,
                13895
            ],
            [
                13895,
                13990
            ],
            [
                13990,
                14022
            ],
            [
                14022,
                14210
            ],
            [
                14210,
                14236
            ],
            [
                14236,
                14463
            ],
            [
                14463,
                14504
            ],
            [
                14504,
                14564
            ],
            [
                14564,
                14823
            ],
            [
                14823,
                15019
            ],
            [
                15019,
                15074
            ],
            [
                15074,
                15093
            ],
            [
                15093,
                15197
            ],
            [
                15197,
                15288
            ],
            [
                15288,
                15440
            ],
            [
                15440,
                15503
            ],
            [
                15503,
                15609
            ],
            [
                15609,
                15663
            ],
            [
                15663,
                15897
            ],
            [
                15897,
                15925
            ],
            [
                15925,
                16025
            ],
            [
                16025,
                16279
            ],
            [
                16279,
                16377
            ],
            [
                16377,
                16503
            ],
            [
                16503,
                16610
            ],
            [
                16610,
                16698
            ],
            [
                16698,
                16812
            ],
            [
                16812,
                16830
            ],
            [
                16830,
                17062
            ],
            [
                17062,
                17104
            ],
            [
                17104,
                17360
            ],
            [
                17360,
                17416
            ],
            [
                17416,
                17524
            ]
        ],
        "segment_chars": [
            [
                0,
                59
            ],
            [
                59,
                151
            ],
            [
                151,
                234
            ],
            [
                234,
                336
            ],
            [
                336,
                366
            ],
            [
                366,
                402
            ],
            [
                402,
                419
            ],
            [
                419,
                431
            ],
            [
                431,
                464
            ],
            [
                464,
                472
            ],
            [
                472,
                514
            ],
            [
                514,
                553
            ],
            [
                553,
                569
            ],
            [
                569,
                591
            ],
            [
                591,
                617
            ],
            [
                617,
                630
            ],
            [
                630,
                724
            ],
            [
                724,
                739
            ],
            [
                739,
                789
            ],
            [
                789,
                801
            ],
            [
                801,
                832
            ],
            [
                832,
                894
            ],
            [
                894,
                921
            ],
            [
                921,
                1038
            ],
            [
                1038,
                1176
            ],
            [
                1176,
                1207
            ],
            [
                1207,
                1421
            ],
            [
                1421,
                1427
            ],
            [
                1427,
                1441
            ],
            [
                1441,
                1460
            ],
            [
                1460,
                1483
            ],
            [
                1483,
                1528
            ],
            [
                1528,
                1548
            ],
            [
                1548,
                1654
            ],
            [
                1654,
                1721
            ],
            [
                1721,
                1803
            ],
            [
                1803,
                1848
            ],
            [
                1848,
                1853
            ],
            [
                1853,
                1949
            ],
            [
                1949,
                2015
            ],
            [
                2015,
                2197
            ],
            [
                2197,
                2246
            ],
            [
                2246,
                2325
            ],
            [
                2325,
                2370
            ],
            [
                2370,
                2488
            ],
            [
                2488,
                2552
            ],
            [
                2552,
                2592
            ],
            [
                2592,
                2679
            ],
            [
                2679,
                2827
            ],
            [
                2827,
                2891
            ],
            [
                2891,
                3031
            ],
            [
                3031,
                3135
            ],
            [
                3135,
                3340
            ],
            [
                3340,
                3392
            ],
            [
                3392,
                3500
            ],
            [
                3500,
                3605
            ],
            [
                3605,
                3657
            ],
            [
                3657,
                3835
            ],
            [
                3835,
                3907
            ],
            [
                3907,
                4018
            ],
            [
                4018,
                4200
            ],
            [
                4200,
                4307
            ],
            [
                4307,
                4374
            ],
            [
                4374,
                4437
            ],
            [
                4437,
                4538
            ],
            [
                4538,
                4640
            ],
            [
                4640,
                4729
            ],
            [
                4729,
                4740
            ],
            [
                4740,
                4768
            ],
            [
                4768,
                4846
            ],
            [
                4846,
                4878
            ],
            [
                4878,
                4923
            ],
            [
                4923,
                4946
            ],
            [
                4946,
                4994
            ],
            [
                4994,
                5131
            ],
            [
                5131,
                5196
            ],
            [
                5196,
                5378
            ],
            [
                5378,
                5470
            ],
            [
                5470,
                5555
            ],
            [
                5555,
                5608
            ],
            [
                5608,
                5620
            ],
            [
                5620,
                5695
            ],
            [
                5695,
                5808
            ],
            [
                5808,
                6019
            ],
            [
                6019,
                6194
            ],
            [
                6194,
                6242
            ],
            [
                6242,
                6329
            ],
            [
                6329,
                6377
            ],
            [
                6377,
                6493
            ],
            [
                6493,
                6570
            ],
            [
                6570,
                6617
            ],
            [
                6617,
                6790
            ],
            [
                6790,
                7018
            ],
            [
                7018,
                7048
            ],
            [
                7048,
                7150
            ],
            [
                7150,
                7205
            ],
            [
                7205,
                7213
            ],
            [
                7213,
                7272
            ],
            [
                7272,
                7429
            ],
            [
                7429,
                7488
            ],
            [
                7488,
                7554
            ],
            [
                7554,
                7613
            ],
            [
                7613,
                7713
            ],
            [
                7713,
                7749
            ],
            [
                7749,
                7862
            ],
            [
                7862,
                7983
            ],
            [
                7983,
                8040
            ],
            [
                8040,
                8076
            ],
            [
                8076,
                8127
            ],
            [
                8127,
                8219
            ],
            [
                8219,
                8440
            ],
            [
                8440,
                8545
            ],
            [
                8545,
                8558
            ],
            [
                8558,
                8581
            ],
            [
                8581,
                8647
            ],
            [
                8647,
                8718
            ],
            [
                8718,
                8772
            ],
            [
                8772,
                8796
            ],
            [
                8796,
                8807
            ],
            [
                8807,
                8837
            ],
            [
                8837,
                8884
            ],
            [
                8884,
                8901
            ],
            [
                8901,
                8972
            ],
            [
                8972,
                9045
            ],
            [
                9045,
                9107
            ],
            [
                9107,
                9127
            ],
            [
                9127,
                9156
            ],
            [
                9156,
                9199
            ],
            [
                9199,
                9248
            ],
            [
                9248,
                9263
            ],
            [
                9263,
                9342
            ],
            [
                9342,
                9426
            ],
            [
                9426,
                9449
            ],
            [
                9449,
                9462
            ],
            [
                9462,
                9541
            ],
            [
                9541,
                9597
            ],
            [
                9597,
                9692
            ],
            [
                9692,
                9792
            ],
            [
                9792,
                9859
            ],
            [
                9859,
                10050
            ],
            [
                10050,
                10130
            ],
            [
                10130,
                10188
            ],
            [
                10188,
                10209
            ],
            [
                10209,
                10249
            ],
            [
                10249,
                10331
            ],
            [
                10331,
                10433
            ],
            [
                10433,
                10477
            ],
            [
                10477,
                10549
            ],
            [
                10549,
                10628
            ],
            [
                10628,
                10642
            ],
            [
                10642,
                10691
            ],
            [
                10691,
                10755
            ],
            [
                10755,
                10782
            ],
            [
                10782,
                10836
            ],
            [
                10836,
                10913
            ],
            [
                10913,
                10991
            ],
            [
                10991,
                11068
            ],
            [
                11068,
                11136
            ],
            [
                11136,
                11199
            ],
            [
                11199,
                11226
            ],
            [
                11226,
                11243
            ],
            [
                11243,
                11248
            ],
            [
                11248,
                11275
            ],
            [
                11275,
                11335
            ],
            [
                11335,
                11486
            ],
            [
                11486,
                11550
            ],
            [
                11550,
                11616
            ],
            [
                11616,
                11656
            ],
            [
                11656,
                11711
            ],
            [
                11711,
                11753
            ],
            [
                11753,
                11852
            ],
            [
                11852,
                11871
            ],
            [
                11871,
                11882
            ],
            [
                11882,
                11938
            ],
            [
                11938,
                11944
            ],
            [
                11944,
                11980
            ],
            [
                11980,
                11996
            ],
            [
                11996,
                12048
            ],
            [
                12048,
                12062
            ],
            [
                12062,
                12081
            ],
            [
                12081,
                12106
            ],
            [
                12106,
                12128
            ],
            [
                12128,
                12148
            ],
            [
                12148,
                12205
            ],
            [
                12205,
                12263
            ],
            [
                12263,
                12280
            ],
            [
                12280,
                12307
            ],
            [
                12307,
                12343
            ],
            [
                12343,
                12374
            ],
            [
                12374,
                12398
            ],
            [
                12398,
                12432
            ],
            [
                12432,
                12495
            ],
            [
                12495,
                12547
            ],
            [
                12547,
                12585
            ],
            [
                12585,
                12632
            ],
            [
                12632,
                12669
            ],
            [
                12669,
                12691
            ],
            [
                12691,
                12831
            ],
            [
                12831,
                12891
            ],
            [
                12891,
                12918
            ],
            [
                12918,
                12958
            ],
            [
                12958,
                13042
            ],
            [
                13042,
                13061
            ],
            [
                13061,
                13128
            ],
            [
                13128,
                13149
            ],
            [
                13149,
                13273
            ],
            [
                13273,
                13288
            ],
            [
                13288,
                13346
            ],
            [
                13346,
                13379
            ],
            [
                13379,
                13405
            ],
            [
                13405,
                13461
            ],
            [
                13461,
                13503
            ],
            [
                13503,
                13599
            ],
            [
                13599,
                13703
            ],
            [
                13703,
                13752
            ],
            [
                13752,
                13839
            ],
            [
                13839,
                13869
            ],
            [
                13869,
                13895
            ],
            [
                13895,
                13910
            ],
            [
                13910,
                13967
            ],
            [
                13967,
                13990
            ],
            [
                13990,
                14022
            ],
            [
                14022,
                14029
            ],
            [
                14029,
                14121
            ],
            [
                14121,
                14210
            ],
            [
                14210,
                14218
            ],
            [
                14218,
                14236
            ],
            [
                14236,
                14293
            ],
            [
                14293,
                14320
            ],
            [
                14320,
                14392
            ],
            [
                14392,
                14463
            ],
            [
                14463,
                14473
            ],
            [
                14473,
                14504
            ],
            [
                14504,
                14564
            ],
            [
                14564,
                14592
            ],
            [
                14592,
                14633
            ],
            [
                14633,
                14760
            ],
            [
                14760,
                14823
            ],
            [
                14823,
                14868
            ],
            [
                14868,
                15019
            ],
            [
                15019,
                15074
            ],
            [
                15074,
                15093
            ],
            [
                15093,
                15147
            ],
            [
                15147,
                15163
            ],
            [
                15163,
                15197
            ],
            [
                15197,
                15249
            ],
            [
                15249,
                15288
            ],
            [
                15288,
                15312
            ],
            [
                15312,
                15407
            ],
            [
                15407,
                15440
            ],
            [
                15440,
                15446
            ],
            [
                15446,
                15503
            ],
            [
                15503,
                15554
            ],
            [
                15554,
                15609
            ],
            [
                15609,
                15663
            ],
            [
                15663,
                15741
            ],
            [
                15741,
                15752
            ],
            [
                15752,
                15897
            ],
            [
                15897,
                15925
            ],
            [
                15925,
                15949
            ],
            [
                15949,
                15986
            ],
            [
                15986,
                16025
            ],
            [
                16025,
                16070
            ],
            [
                16070,
                16177
            ],
            [
                16177,
                16279
            ],
            [
                16279,
                16299
            ],
            [
                16299,
                16362
            ],
            [
                16362,
                16377
            ],
            [
                16377,
                16460
            ],
            [
                16460,
                16503
            ],
            [
                16503,
                16610
            ],
            [
                16610,
                16625
            ],
            [
                16625,
                16698
            ],
            [
                16698,
                16761
            ],
            [
                16761,
                16812
            ],
            [
                16812,
                16824
            ],
            [
                16824,
                16830
            ],
            [
                16830,
                16899
            ],
            [
                16899,
                16960
            ],
            [
                16960,
                17047
            ],
            [
                17047,
                17062
            ],
            [
                17062,
                17104
            ],
            [
                17104,
                17141
            ],
            [
                17141,
                17360
            ],
            [
                17360,
                17416
            ],
            [
                17416,
                17524
            ]
        ],
        "overlap_chars": [
            [
                0,
                5
            ],
            [
                10,
                15
            ],
            [
                19,
                31
            ],
            [
                32,
                59
            ],
            [
                59,
                79
            ],
            [
                80,
                108
            ],
            [
                127,
                133
            ],
            [
                134,
                151
            ],
            [
                151,
                161
            ],
            [
                162,
                168
            ],
            [
                169,
                174
            ],
            [
                174,
                175
            ],
            [
                180,
                224
            ],
            [
                232,
                234
            ],
            [
                235,
                241
            ],
            [
                249,
                260
            ],
            [
                266,
                328
            ],
            [
                329,
                336
            ],
            [
                336,
                364
            ],
            [
                364,
                366
            ],
            [
                366,
                402
            ],
            [
                402,
                406
            ],
            [
                419,
                423
            ],
            [
                424,
                431
            ],
            [
                431,
                433
            ],
            [
                434,
                464
            ],
            [
                464,
                472
            ],
            [
                472,
                481
            ],
            [
                496,
                514
            ],
            [
                514,
                547
            ],
            [
                548,
                551
            ],
            [
                551,
                553
            ],
            [
                553,
                569
            ],
            [
                569,
                591
            ],
            [
                591,
                603
            ],
            [
                609,
                617
            ],
            [
                617,
                618
            ],
            [
                620,
                630
            ],
            [
                643,
                653
            ],
            [
                659,
                724
            ],
            [
                724,
                725
            ],
            [
                730,
                739
            ],
            [
                740,
                789
            ],
            [
                789,
                801
            ],
            [
                801,
                832
            ],
            [
                832,
                853
            ],
            [
                853,
                854
            ],
            [
                862,
                873
            ],
            [
                878,
                892
            ],
            [
                894,
                919
            ],
            [
                919,
                921
            ],
            [
                921,
                942
            ],
            [
                967,
                973
            ],
            [
                974,
                983
            ],
            [
                984,
                1016
            ],
            [
                1021,
                1038
            ],
            [
                1038,
                1054
            ],
            [
                1060,
                1173
            ],
            [
                1173,
                1176
            ],
            [
                1176,
                1204
            ],
            [
                1207,
                1313
            ],
            [
                1314,
                1316
            ],
            [
                1316,
                1317
            ],
            [
                1318,
                1329
            ],
            [
                1330,
                1366
            ],
            [
                1370,
                1372
            ],
            [
                1377,
                1386
            ],
            [
                1393,
                1398
            ],
            [
                1403,
                1408
            ],
            [
                1409,
                1412
            ],
            [
                1412,
                1421
            ],
            [
                1421,
                1427
            ],
            [
                1427,
                1441
            ],
            [
                1441,
                1449
            ],
            [
                1456,
                1460
            ],
            [
                1460,
                1464
            ],
            [
                1465,
                1468
            ],
            [
                1469,
                1483
            ],
            [
                1483,
                1528
            ],
            [
                1528,
                1529
            ],
            [
                1529,
                1548
            ],
            [
                1548,
                1556
            ],
            [
                1557,
                1618
            ],
            [
                1619,
                1654
            ],
            [
                1654,
                1668
            ],
            [
                1673,
                1682
            ],
            [
                1683,
                1721
            ],
            [
                1721,
                1758
            ],
            [
                1764,
                1775
            ],
            [
                1775,
                1800
            ],
            [
                1803,
                1839
            ],
            [
                1840,
                1848
            ],
            [
                1848,
                1853
            ],
            [
                1853,
                1856
            ],
            [
                1864,
                1928
            ],
            [
                1933,
                1949
            ],
            [
                1949,
                1950
            ],
            [
                1950,
                1987
            ],
            [
                1988,
                2004
            ],
            [
                2008,
                2015
            ],
            [
                2015,
                2027
            ],
            [
                2028,
                2072
            ],
            [
                2073,
                2089
            ],
            [
                2090,
                2195
            ],
            [
                2195,
                2197
            ],
            [
                2209,
                2212
            ],
            [
                2223,
                2225
            ],
            [
                2236,
                2244
            ],
            [
                2244,
                2246
            ],
            [
                2246,
                2286
            ],
            [
                2300,
                2302
            ],
            [
                2307,
                2312
            ],
            [
                2313,
                2315
            ],
            [
                2323,
                2325
            ],
            [
                2325,
                2370
            ],
            [
                2370,
                2394
            ],
            [
                2395,
                2404
            ],
            [
                2405,
                2431
            ],
            [
                2432,
                2441
            ],
            [
                2442,
                2445
            ],
            [
                2446,
                2461
            ],
            [
                2462,
                2464
            ],
            [
                2465,
                2470
            ],
            [
                2471,
                2486
            ],
            [
                2486,
                2488
            ],
            [
                2488,
                2514
            ],
            [
                2518,
                2535
            ],
            [
                2536,
                2543
            ],
            [
                2550,
                2552
            ],
            [
                2552,
                2555
            ],
            [
                2556,
                2573
            ],
            [
                2573,
                2585
            ],
            [
                2590,
                2592
            ],
            [
                2592,
                2679
            ],
            [
                2679,
                2717
            ],
            [
                2718,
                2816
            ],
            [
                2817,
                2820
            ],
            [
                2825,
                2826
            ],
            [
                2827,
                2858
            ],
            [
                2869,
                2891
            ],
            [
                2891,
                2908
            ],
            [
                2909,
                3001
            ],
            [
                3007,
                3031
            ],
            [
                3031,
                3075
            ],
            [
                3075,
                3076
            ],
            [
                3086,
                3096
            ],
            [
                3105,
                3106
            ],
            [
                3113,
                3116
            ],
            [
                3129,
                3134
            ],
            [
                3135,
                3302
            ],
            [
                3306,
                3309
            ],
            [
                3310,
                3316
            ],
            [
                3317,
                3324
            ],
            [
                3325,
                3333
            ],
            [
                3334,
                3340
            ],
            [
                3353,
                3368
            ],
            [
                3372,
                3377
            ],
            [
                3378,
                3385
            ],
            [
                3390,
                3392
            ],
            [
                3392,
                3405
            ],
            [
                3406,
                3412
            ],
            [
                3413,
                3422
            ],
            [
                3423,
                3499
            ],
            [
                3500,
                3526
            ],
            [
                3526,
                3605
            ],
            [
                3605,
                3612
            ],
            [
                3613,
                3617
            ],
            [
                3618,
                3619
            ],
            [
                3620,
                3621
            ],
            [
                3622,
                3627
            ],
            [
                3628,
                3639
            ],
            [
                3643,
                3648
            ],
            [
                3649,
                3655
            ],
            [
                3655,
                3657
            ],
            [
                3660,
                3673
            ],
            [
                3674,
                3760
            ],
            [
                3768,
                3773
            ],
            [
                3774,
                3789
            ],
            [
                3793,
                3804
            ],
            [
                3805,
                3810
            ],
            [
                3811,
                3824
            ],
            [
                3825,
                3834
            ],
            [
                3835,
                3887
            ],
            [
                3893,
                3899
            ],
            [
                3900,
                3907
            ],
            [
                3907,
                3957
            ],
            [
                3958,
                3960
            ],
            [
                3972,
                4016
            ],
            [
                4016,
                4018
            ],
            [
                4018,
                4132
            ],
            [
                4133,
                4152
            ],
            [
                4152,
                4153
            ],
            [
                4165,
                4200
            ],
            [
                4200,
                4204
            ],
            [
                4205,
                4223
            ],
            [
                4228,
                4271
            ],
            [
                4271,
                4307
            ],
            [
                4307,
                4326
            ],
            [
                4326,
                4350
            ],
            [
                4356,
                4372
            ],
            [
                4372,
                4374
            ],
            [
                4374,
                4386
            ],
            [
                4387,
                4401
            ],
            [
                4410,
                4436
            ],
            [
                4440,
                4443
            ],
            [
                4444,
                4455
            ],
            [
                4455,
                4538
            ],
            [
                4538,
                4567
            ],
            [
                4579,
                4601
            ],
            [
                4602,
                4640
            ],
            [
                4640,
                4677
            ],
            [
                4677,
                4678
            ],
            [
                4685,
                4727
            ],
            [
                4729,
                4740
            ],
            [
                4740,
                4768
            ],
            [
                4772,
                4813
            ],
            [
                4814,
                4831
            ],
            [
                4832,
                4846
            ],
            [
                4846,
                4878
            ],
            [
                4878,
                4923
            ],
            [
                4923,
                4943
            ],
            [
                4946,
                4994
            ],
            [
                4994,
                5012
            ],
            [
                5017,
                5068
            ],
            [
                5070,
                5087
            ],
            [
                5088,
                5091
            ],
            [
                5092,
                5131
            ],
            [
                5131,
                5135
            ],
            [
                5146,
                5195
            ],
            [
                5196,
                5203
            ],
            [
                5204,
                5233
            ],
            [
                5236,
                5243
            ],
            [
                5244,
                5266
            ],
            [
                5267,
                5298
            ],
            [
                5299,
                5354
            ],
            [
                5359,
                5378
            ],
            [
                5378,
                5394
            ],
            [
                5395,
                5468
            ],
            [
                5468,
                5470
            ],
            [
                5470,
                5503
            ],
            [
                5506,
                5507
            ],
            [
                5514,
                5554
            ],
            [
                5555,
                5569
            ],
            [
                5577,
                5608
            ],
            [
                5608,
                5620
            ],
            [
                5620,
                5634
            ],
            [
                5636,
                5654
            ],
            [
                5656,
                5695
            ],
            [
                5695,
                5744
            ],
            [
                5751,
                5766
            ],
            [
                5768,
                5798
            ],
            [
                5806,
                5808
            ],
            [
                5808,
                5856
            ],
            [
                5859,
                5920
            ],
            [
                5921,
                5939
            ],
            [
                5940,
                5954
            ],
            [
                5970,
                5990
            ],
            [
                6003,
                6017
            ],
            [
                6017,
                6019
            ],
            [
                6019,
                6066
            ],
            [
                6067,
                6095
            ],
            [
                6095,
                6096
            ],
            [
                6102,
                6105
            ],
            [
                6126,
                6193
            ],
            [
                6194,
                6201
            ],
            [
                6201,
                6242
            ],
            [
                6242,
                6284
            ],
            [
                6285,
                6329
            ],
            [
                6332,
                6358
            ],
            [
                6364,
                6368
            ],
            [
                6369,
                6377
            ],
            [
                6377,
                6396
            ],
            [
                6397,
                6414
            ],
            [
                6415,
                6439
            ],
            [
                6449,
                6452
            ],
            [
                6453,
                6464
            ],
            [
                6465,
                6493
            ],
            [
                6493,
                6499
            ],
            [
                6507,
                6570
            ],
            [
                6570,
                6578
            ],
            [
                6590,
                6596
            ],
            [
                6597,
                6617
            ],
            [
                6617,
                6638
            ],
            [
                6639,
                6646
            ],
            [
                6657,
                6766
            ],
            [
                6772,
                6780
            ],
            [
                6788,
                6790
            ],
            [
                6790,
                6800
            ],
            [
                6801,
                6868
            ],
            [
                6874,
                6886
            ],
            [
                6887,
                6890
            ],
            [
                6891,
                6977
            ],
            [
                6978,
                6988
            ],
            [
                6991,
                7018
            ],
            [
                7018,
                7019
            ],
            [
                7046,
                7048
            ],
            [
                7097,
                7098
            ],
            [
                7133,
                7134
            ],
            [
                7138,
                7139
            ],
            [
                7147,
                7150
            ],
            [
                7150,
                7205
            ],
            [
                7205,
                7211
            ],
            [
                7213,
                7237
            ],
            [
                7238,
                7252
            ],
            [
                7261,
                7272
            ],
            [
                7272,
                7329
            ],
            [
                7330,
                7337
            ],
            [
                7338,
                7377
            ],
            [
                7378,
                7381
            ],
            [
                7382,
                7386
            ],
            [
                7396,
                7421
            ],
            [
                7422,
                7427
            ],
            [
                7427,
                7429
            ],
            [
                7429,
                7451
            ],
            [
                7452,
                7460
            ],
            [
                7461,
                7488
            ],
            [
                7488,
                7535
            ],
            [
                7551,
                7554
            ],
            [
                7554,
                7613
            ],
            [
                7613,
                7667
            ],
            [
                7668,
                7677
            ],
            [
                7685,
                7689
            ],
            [
                7697,
                7711
            ],
            [
                7711,
                7712
            ],
            [
                7727,
                7736
            ],
            [
                7737,
                7749
            ],
            [
                7749,
                7758
            ],
            [
                7764,
                7810
            ],
            [
                7817,
                7825
            ],
            [
                7826,
                7834
            ],
            [
                7835,
                7838
            ],
            [
                7850,
                7862
            ],
            [
                7862,
                7887
            ],
            [
                7888,
                7895
            ],
            [
                7896,
                7971
            ],
            [
                7972,
                7983
            ],
            [
                7983,
                7993
            ],
            [
                7994,
                7997
            ],
            [
                7998,
                8017
            ],
            [
                8017,
                8040
            ],
            [
                8040,
                8066
            ],
            [
                8067,
                8074
            ],
            [
                8074,
                8076
            ],
            [
                8076,
                8124
            ],
            [
                8124,
                8127
            ],
            [
                8127,
                8162
            ],
            [
                8166,
                8185
            ],
            [
                8203,
                8208
            ],
            [
                8212,
                8219
            ],
            [
                8220,
                8253
            ],
            [
                8265,
                8268
            ],
            [
                8269,
                8272
            ],
            [
                8272,
                8273
            ],
            [
                8274,
                8315
            ],
            [
                8331,
                8411
            ],
            [
                8427,
                8440
            ],
            [
                8440,
                8476
            ],
            [
                8477,
                8488
            ],
            [
                8489,
                8545
            ],
            [
                8545,
                8558
            ],
            [
                8558,
                8563
            ],
            [
                8574,
                8581
            ],
            [
                8581,
                8598
            ],
            [
                8599,
                8645
            ],
            [
                8647,
                8673
            ],
            [
                8683,
                8693
            ],
            [
                8694,
                8718
            ],
            [
                8718,
                8772
            ],
            [
                8772,
                8796
            ],
            [
                8796,
                8807
            ],
            [
                8807,
                8808
            ],
            [
                8809,
                8837
            ],
            [
                8837,
                8842
            ],
            [
                8843,
                8846
            ],
            [
                8847,
                8879
            ],
            [
                8880,
                8882
            ],
            [
                8884,
                8901
            ],
            [
                8901,
                8917
            ],
            [
                8920,
                8954
            ],
            [
                8955,
                8958
            ],
            [
                8959,
                8969
            ],
            [
                8969,
                8972
            ],
            [
                8972,
                8979
            ],
            [
                8980,
                8984
            ],
            [
                8985,
                8993
            ],
            [
                8994,
                9034
            ],
            [
                9034,
                9044
            ],
            [
                9045,
                9107
            ],
            [
                9107,
                9127
            ],
            [
                9127,
                9156
            ],
            [
                9156,
                9157
            ],
            [
                9157,
                9174
            ],
            [
                9179,
                9199
            ],
            [
                9199,
                9248
            ],
            [
                9248,
                9263
            ],
            [
                9263,
                9293
            ],
            [
                9301,
                9324
            ],
            [
                9330,
                9334
            ],
            [
                9335,
                9337
            ],
            [
                9338,
                9342
            ],
            [
                9342,
                9362
            ],
            [
                9367,
                9376
            ],
            [
                9381,
                9387
            ],
            [
                9391,
                9426
            ],
            [
                9426,
                9434
            ],
            [
                9435,
                9448
            ],
            [
                9462,
                9463
            ],
            [
                9463,
                9502
            ],
            [
                9503,
                9506
            ],
            [
                9507,
                9528
            ],
            [
                9529,
                9539
            ],
            [
                9541,
                9548
            ],
            [
                9553,
                9568
            ],
            [
                9569,
                9571
            ],
            [
                9572,
                9578
            ],
            [
                9588,
                9597
            ],
            [
                9597,
                9600
            ],
            [
                9601,
                9692
            ],
            [
                9692,
                9749
            ],
            [
                9751,
                9792
            ],
            [
                9793,
                9801
            ],
            [
                9802,
                9827
            ],
            [
                9828,
                9859
            ],
            [
                9867,
                9880
            ],
            [
                9881,
                9889
            ],
            [
                9890,
                10050
            ],
            [
                10050,
                10130
            ],
            [
                10130,
                10185
            ],
            [
                10188,
                10207
            ],
            [
                10207,
                10209
            ],
            [
                10209,
                10239
            ],
            [
                10246,
                10249
            ],
            [
                10249,
                10250
            ],
            [
                10254,
                10261
            ],
            [
                10261,
                10262
            ],
            [
                10268,
                10269
            ],
            [
                10274,
                10277
            ],
            [
                10281,
                10299
            ],
            [
                10303,
                10311
            ],
            [
                10316,
                10331
            ],
            [
                10331,
                10338
            ],
            [
                10339,
                10433
            ],
            [
                10433,
                10449
            ],
            [
                10456,
                10465
            ],
            [
                10466,
                10475
            ],
            [
                10475,
                10477
            ],
            [
                10477,
                10492
            ],
            [
                10498,
                10501
            ],
            [
                10502,
                10503
            ],
            [
                10509,
                10517
            ],
            [
                10518,
                10524
            ],
            [
                10547,
                10549
            ],
            [
                10549,
                10615
            ],
            [
                10616,
                10626
            ],
            [
                10626,
                10628
            ],
            [
                10628,
                10632
            ],
            [
                10637,
                10642
            ],
            [
                10642,
                10643
            ],
            [
                10643,
                10644
            ],
            [
                10649,
                10663
            ],
            [
                10755,
                10782
            ],
            [
                10782,
                10802
            ],
            [
                10808,
                10836
            ],
            [
                10836,
                10855
            ],
            [
                10856,
                10872
            ],
            [
                10873,
                10876
            ],
            [
                10889,
                10892
            ],
            [
                10895,
                10911
            ],
            [
                10913,
                10929
            ],
            [
                10933,
                10971
            ],
            [
                10972,
                10991
            ],
            [
                10991,
                11056
            ],
            [
                11057,
                11068
            ],
            [
                11076,
                11126
            ],
            [
                11134,
                11136
            ],
            [
                11136,
                11151
            ],
            [
                11152,
                11177
            ],
            [
                11184,
                11199
            ],
            [
                11199,
                11226
            ],
            [
                11226,
                11240
            ],
            [
                11243,
                11248
            ],
            [
                11248,
                11254
            ],
            [
                11255,
                11267
            ],
            [
                11268,
                11273
            ],
            [
                11276,
                11335
            ],
            [
                11335,
                11365
            ],
            [
                11366,
                11378
            ],
            [
                11379,
                11404
            ],
            [
                11405,
                11431
            ],
            [
                11432,
                11437
            ],
            [
                11442,
                11450
            ],
            [
                11451,
                11456
            ],
            [
                11462,
                11467
            ],
            [
                11470,
                11486
            ],
            [
                11486,
                11537
            ],
            [
                11538,
                11544
            ],
            [
                11545,
                11550
            ],
            [
                11550,
                11570
            ],
            [
                11571,
                11575
            ],
            [
                11576,
                11578
            ],
            [
                11579,
                11616
            ],
            [
                11616,
                11632
            ],
            [
                11642,
                11654
            ],
            [
                11659,
                11672
            ],
            [
                11675,
                11698
            ],
            [
                11699,
                11710
            ],
            [
                11711,
                11753
            ],
            [
                11753,
                11772
            ],
            [
                11773,
                11852
            ],
            [
                11852,
                11853
            ],
            [
                11860,
                11871
            ],
            [
                11871,
                11879
            ],
            [
                11879,
                11882
            ],
            [
                11883,
                11938
            ],
            [
                11938,
                11941
            ],
            [
                11944,
                11977
            ],
            [
                11997,
                12048
            ],
            [
                12048,
                12062
            ],
            [
                12062,
                12081
            ],
            [
                12081,
                12106
            ],
            [
                12106,
                12128
            ],
            [
                12128,
                12146
            ],
            [
                12148,
                12202
            ],
            [
                12202,
                12205
            ],
            [
                12205,
                12262
            ],
            [
                12280,
                12281
            ],
            [
                12281,
                12294
            ],
            [
                12294,
                12295
            ],
            [
                12305,
                12307
            ],
            [
                12307,
                12343
            ],
            [
                12343,
                12371
            ],
            [
                12374,
                12378
            ],
            [
                12379,
                12398
            ],
            [
                12398,
                12432
            ],
            [
                12432,
                12448
            ],
            [
                12449,
                12455
            ],
            [
                12464,
                12470
            ],
            [
                12474,
                12482
            ],
            [
                12482,
                12492
            ],
            [
                12492,
                12495
            ],
            [
                12495,
                12509
            ],
            [
                12509,
                12521
            ],
            [
                12535,
                12545
            ],
            [
                12545,
                12547
            ],
            [
                12547,
                12585
            ],
            [
                12585,
                12632
            ],
            [
                12632,
                12669
            ],
            [
                12669,
                12691
            ],
            [
                12691,
                12734
            ],
            [
                12735,
                12744
            ],
            [
                12762,
                12763
            ],
            [
                12769,
                12776
            ],
            [
                12779,
                12791
            ],
            [
                12792,
                12817
            ],
            [
                12822,
                12828
            ],
            [
                12828,
                12831
            ],
            [
                12831,
                12865
            ],
            [
                12865,
                12867
            ],
            [
                12873,
                12889
            ],
            [
                12889,
                12891
            ],
            [
                12891,
                12892
            ],
            [
                12892,
                12915
            ],
            [
                12915,
                12918
            ],
            [
                12918,
                12958
            ],
            [
                12958,
                12998
            ],
            [
                12998,
                13032
            ],
            [
                13033,
                13041
            ],
            [
                13042,
                13061
            ],
            [
                13061,
                13126
            ],
            [
                13128,
                13129
            ],
            [
                13139,
                13149
            ],
            [
                13150,
                13162
            ],
            [
                13167,
                13210
            ],
            [
                13215,
                13229
            ],
            [
                13230,
                13238
            ],
            [
                13248,
                13273
            ],
            [
                13273,
                13288
            ],
            [
                13288,
                13346
            ],
            [
                13346,
                13379
            ],
            [
                13379,
                13383
            ],
            [
                13403,
                13404
            ],
            [
                13405,
                13414
            ],
            [
                13415,
                13432
            ],
            [
                13438,
                13461
            ],
            [
                13461,
                13503
            ],
            [
                13503,
                13599
            ],
            [
                13599,
                13645
            ],
            [
                13646,
                13703
            ],
            [
                13703,
                13752
            ],
            [
                13752,
                13791
            ],
            [
                13792,
                13793
            ],
            [
                13794,
                13839
            ],
            [
                13839,
                13869
            ],
            [
                13869,
                13895
            ],
            [
                13895,
                13908
            ],
            [
                13908,
                13910
            ],
            [
                13914,
                13931
            ],
            [
                13932,
                13935
            ],
            [
                13936,
                13965
            ],
            [
                13967,
                13971
            ],
            [
                13980,
                13990
            ],
            [
                13990,
                13994
            ],
            [
                13995,
                14013
            ],
            [
                14013,
                14019
            ],
            [
                14019,
                14022
            ],
            [
                14022,
                14029
            ],
            [
                14029,
                14121
            ],
            [
                14121,
                14122
            ],
            [
                14127,
                14210
            ],
            [
                14210,
                14218
            ],
            [
                14218,
                14229
            ],
            [
                14233,
                14236
            ],
            [
                14236,
                14273
            ],
            [
                14276,
                14293
            ],
            [
                14293,
                14309
            ],
            [
                14315,
                14318
            ],
            [
                14318,
                14320
            ],
            [
                14320,
                14321
            ],
            [
                14328,
                14342
            ],
            [
                14343,
                14392
            ],
            [
                14392,
                14402
            ],
            [
                14408,
                14460
            ],
            [
                14460,
                14463
            ],
            [
                14463,
                14468
            ],
            [
                14469,
                14471
            ],
            [
                14471,
                14473
            ],
            [
                14473,
                14504
            ],
            [
                14504,
                14539
            ],
            [
                14540,
                14564
            ],
            [
                14565,
                14577
            ],
            [
                14583,
                14592
            ],
            [
                14592,
                14600
            ],
            [
                14606,
                14613
            ],
            [
                14614,
                14620
            ],
            [
                14621,
                14631
            ],
            [
                14633,
                14643
            ],
            [
                14644,
                14651
            ],
            [
                14652,
                14655
            ],
            [
                14656,
                14663
            ],
            [
                14663,
                14664
            ],
            [
                14665,
                14668
            ],
            [
                14678,
                14682
            ],
            [
                14697,
                14705
            ],
            [
                14705,
                14706
            ],
            [
                14713,
                14726
            ],
            [
                14727,
                14758
            ],
            [
                14758,
                14759
            ],
            [
                14763,
                14773
            ],
            [
                14774,
                14778
            ],
            [
                14779,
                14820
            ],
            [
                14823,
                14849
            ],
            [
                14866,
                14868
            ],
            [
                14868,
                14870
            ],
            [
                14876,
                14928
            ],
            [
                14933,
                14971
            ],
            [
                14974,
                14988
            ],
            [
                14989,
                14991
            ],
            [
                14992,
                14995
            ],
            [
                14996,
                15019
            ],
            [
                15019,
                15074
            ],
            [
                15074,
                15079
            ],
            [
                15080,
                15093
            ],
            [
                15093,
                15147
            ],
            [
                15147,
                15163
            ],
            [
                15163,
                15182
            ],
            [
                15183,
                15186
            ],
            [
                15194,
                15197
            ],
            [
                15197,
                15208
            ],
            [
                15217,
                15221
            ],
            [
                15222,
                15247
            ],
            [
                15247,
                15249
            ],
            [
                15249,
                15288
            ],
            [
                15288,
                15289
            ],
            [
                15289,
                15293
            ],
            [
                15297,
                15302
            ],
            [
                15303,
                15305
            ],
            [
                15310,
                15312
            ],
            [
                15328,
                15407
            ],
            [
                15409,
                15434
            ],
            [
                15437,
                15440
            ],
            [
                15440,
                15446
            ],
            [
                15446,
                15450
            ],
            [
                15459,
                15502
            ],
            [
                15503,
                15554
            ],
            [
                15554,
                15582
            ],
            [
                15604,
                15609
            ],
            [
                15609,
                15610
            ],
            [
                15610,
                15639
            ],
            [
                15643,
                15646
            ],
            [
                15647,
                15663
            ],
            [
                15663,
                15707
            ],
            [
                15715,
                15741
            ],
            [
                15741,
                15752
            ],
            [
                15752,
                15761
            ],
            [
                15775,
                15780
            ],
            [
                15781,
                15793
            ],
            [
                15794,
                15897
            ],
            [
                15897,
                15925
            ],
            [
                15925,
                15947
            ],
            [
                15949,
                15955
            ],
            [
                15959,
                15964
            ],
            [
                15965,
                15973
            ],
            [
                15973,
                15986
            ],
            [
                15986,
                15995
            ],
            [
                15998,
                16002
            ],
            [
                16006,
                16009
            ],
            [
                16017,
                16025
            ],
            [
                16025,
                16027
            ],
            [
                16028,
                16052
            ],
            [
                16053,
                16070
            ],
            [
                16070,
                16087
            ],
            [
                16092,
                16104
            ],
            [
                16105,
                16108
            ],
            [
                16109,
                16117
            ],
            [
                16123,
                16177
            ],
            [
                16177,
                16190
            ],
            [
                16191,
                16207
            ],
            [
                16208,
                16210
            ],
            [
                16211,
                16218
            ],
            [
                16218,
                16219
            ],
            [
                16220,
                16243
            ],
            [
                16243,
                16279
            ],
            [
                16279,
                16299
            ],
            [
                16299,
                16321
            ],
            [
                16322,
                16362
            ],
            [
                16362,
                16377
            ],
            [
                16384,
                16409
            ],
            [
                16410,
                16415
            ],
            [
                16422,
                16430
            ],
            [
                16432,
                16449
            ],
            [
                16458,
                16460
            ],
            [
                16464,
                16478
            ],
            [
                16479,
                16503
            ],
            [
                16503,
                16533
            ],
            [
                16538,
                16542
            ],
            [
                16548,
                16610
            ],
            [
                16610,
                16625
            ],
            [
                16625,
                16646
            ],
            [
                16647,
                16698
            ],
            [
                16699,
                16723
            ],
            [
                16724,
                16746
            ],
            [
                16751,
                16761
            ],
            [
                16761,
                16812
            ],
            [
                16812,
                16824
            ],
            [
                16824,
                16830
            ],
            [
                16830,
                16899
            ],
            [
                16904,
                16905
            ],
            [
                16906,
                16912
            ],
            [
                16914,
                16960
            ],
            [
                16960,
                17047
            ],
            [
                17047,
                17062
            ],
            [
                17062,
                17104
            ],
            [
                17104,
                17118
            ],
            [
                17123,
                17126
            ],
            [
                17132,
                17141
            ],
            [
                17141,
                17196
            ],
            [
                17196,
                17267
            ],
            [
                17269,
                17270
            ],
            [
                17281,
                17359
            ],
            [
                17360,
                17416
            ],
            [
                17416,
                17504
            ],
            [
                17511,
                17524
            ]
        ],
        "row_chars": [
            [
                0,
                59
            ],
            [
                59,
                151
            ],
            [
                151,
                234
            ],
            [
                234,
                234
            ],
            [
                234,
                234
            ],
            [
                234,
                234
            ],
            [
                234,
                336
            ],
            [
                336,
                366
            ],
            [
                366,
                402
            ],
            [
                402,
                419
            ],
            [
                419,
                431
            ],
            [
                431,
                464
            ],
            [
                464,
                472
            ],
            [
                472,
                514
            ],
            [
                514,
                553
            ],
            [
                553,
                569
            ],
            [
                569,
                591
            ],
            [
                591,
                617
            ],
            [
                617,
                630
            ],
            [
                630,
                724
            ],
            [
                724,
                739
            ],
            [
                739,
                739
            ],
            [
                739,
                789
            ],
            [
                789,
                801
            ],
            [
                801,
                832
            ],
            [
                832,
                832
            ],
            [
                832,
                894
            ],
            [
                894,
                921
            ],
            [
                921,
                921
            ],
            [
                921,
                1038
            ],
            [
                1038,
                1176
            ],
            [
                1176,
                1207
            ],
            [
                1207,
                1207
            ],
            [
                1207,
                1421
            ],
            [
                1421,
                1427
            ],
            [
                1427,
                1441
            ],
            [
                1441,
                1460
            ],
            [
                1460,
                1483
            ],
            [
                1483,
                1528
            ],
            [
                1528,
                1548
            ],
            [
                1548,
                1654
            ],
            [
                1654,
                1721
            ],
            [
                1721,
                1803
            ],
            [
                1803,
                1803
            ],
            [
                1803,
                1848
            ],
            [
                1848,
                1853
            ],
            [
                1853,
                1853
            ],
            [
                1853,
                1949
            ],
            [
                1949,
                2015
            ],
            [
                2015,
                2197
            ],
            [
                2197,
                2246
            ],
            [
                2246,
                2325
            ],
            [
                2325,
                2325
            ],
            [
                2325,
                2325
            ],
            [
                2325,
                2370
            ],
            [
                2370,
                2488
            ],
            [
                2488,
                2552
            ],
            [
                2552,
                2592
            ],
            [
                2592,
                2679
            ],
            [
                2679,
                2827
            ],
            [
                2827,
                2891
            ],
            [
                2891,
                3031
            ],
            [
                3031,
                3135
            ],
            [
                3135,
                3135
            ],
            [
                3135,
                3340
            ],
            [
                3340,
                3392
            ],
            [
                3392,
                3392
            ],
            [
                3392,
                3500
            ],
            [
                3500,
                3500
            ],
            [
                3500,
                3605
            ],
            [
                3605,
                3657
            ],
            [
                3657,
                3835
            ],
            [
                3835,
                3835
            ],
            [
                3835,
                3907
            ],
            [
                3907,
                4018
            ],
            [
                4018,
                4200
            ],
            [
                4200,
                4200
            ],
            [
                4200,
                4307
            ],
            [
                4307,
                4374
            ],
            [
                4374,
                4437
            ],
            [
                4437,
                4538
            ],
            [
                4538,
                4538
            ],
            [
                4538,
                4640
            ],
            [
                4640,
                4729
            ],
            [
                4729,
                4740
            ],
            [
                4740,
                4768
            ],
            [
                4768,
                4846
            ],
            [
                4846,
                4878
            ],
            [
                4878,
                4923
            ],
            [
                4923,
                4946
            ],
            [
                4946,
                4946
            ],
            [
                4946,
                4994
            ],
            [
                4994,
                5131
            ],
            [
                5131,
                5196
            ],
            [
                5196,
                5196
            ],
            [
                5196,
                5378
            ],
            [
                5378,
                5470
            ],
            [
                5470,
                5555
            ],
            [
                5555,
                5555
            ],
            [
                5555,
                5608
            ],
            [
                5608,
                5620
            ],
            [
                5620,
                5695
            ],
            [
                5695,
                5808
            ],
            [
                5808,
                6019
            ],
            [
                6019,
                6194
            ],
            [
                6194,
                6242
            ],
            [
                6242,
                6329
            ],
            [
                6329,
                6329
            ],
            [
                6329,
                6377
            ],
            [
                6377,
                6493
            ],
            [
                6493,
                6570
            ],
            [
                6570,
                6617
            ],
            [
                6617,
                6790
            ],
            [
                6790,
                7018
            ],
            [
                7018,
                7048
            ],
            [
                7048,
                7048
            ],
            [
                7048,
                7048
            ],
            [
                7048,
                7150
            ],
            [
                7150,
                7205
            ],
            [
                7205,
                7213
            ],
            [
                7213,
                7272
            ],
            [
                7272,
                7429
            ],
            [
                7429,
                7429
            ],
            [
                7429,
                7488
            ],
            [
                7488,
                7554
            ],
            [
                7554,
                7613
            ],
            [
                7613,
                7713
            ],
            [
                7713,
                7749
            ],
            [
                7749,
                7862
            ],
            [
                7862,
                7983
            ],
            [
                7983,
                8040
            ],
            [
                8040,
                8076
            ],
            [
                8076,
                8127
            ],
            [
                8127,
                8219
            ],
            [
                8219,
                8219
            ],
            [
                8219,
                8440
            ],
            [
                8440,
                8545
            ],
            [
                8545,
                8558
            ],
            [
                8558,
                8581
            ],
            [
                8581,
                8647
            ],
            [
                8647,
                8647
            ],
            [
                8647,
                8647
            ],
            [
                8647,
                8647
            ],
            [
                8647,
                8647
            ],
            [
                8647,
                8647
            ],
            [
                8647,
                8718
            ],
            [
                8718,
                8772
            ],
            [
                8772,
                8796
            ],
            [
                8796,
                8807
            ],
            [
                8807,
                8807
            ],
            [
                8807,
                8837
            ],
            [
                8837,
                8884
            ],
            [
                8884,
                8901
            ],
            [
                8901,
                8972
            ],
            [
                8972,
                9045
            ],
            [
                9045,
                9107
            ],
            [
                9107,
                9127
            ],
            [
                9127,
                9156
            ],
            [
                9156,
                9199
            ],
            [
                9199,
                9248
            ],
            [
                9248,
                9263
            ],
            [
                9263,
                9342
            ],
            [
                9342,
                9426
            ],
            [
                9426,
                9462
            ],
            [
                9462,
                9462
            ],
            [
                9462,
                9462
            ],
            [
                9462,
                9597
            ],
            [
                9597,
                9692
            ],
            [
                9692,
                9792
            ],
            [
                9792,
                9792
            ],
            [
                9792,
                9859
            ],
            [
                9859,
                10050
            ],
            [
                10050,
                10130
            ],
            [
                10130,
                10188
            ],
            [
                10188,
                10188
            ],
            [
                10188,
                10209
            ],
            [
                10209,
                10249
            ],
            [
                10249,
                10331
            ],
            [
                10331,
                10433
            ],
            [
                10433,
                10477
            ],
            [
                10477,
                10549
            ],
            [
                10549,
                10628
            ],
            [
                10628,
                10642
            ],
            [
                10642,
                10691
            ],
            [
                10691,
                10755
            ],
            [
                10755,
                10755
            ],
            [
                10755,
                10755
            ],
            [
                10755,
                10782
            ],
            [
                10782,
                10836
            ],
            [
                10836,
                10913
            ],
            [
                10913,
                10991
            ],
            [
                10991,
                11068
            ],
            [
                11068,
                11136
            ],
            [
                11136,
                11199
            ],
            [
                11199,
                11226
            ],
            [
                11226,
                11243
            ],
            [
                11243,
                11243
            ],
            [
                11243,
                11248
            ],
            [
                11248,
                11248
            ],
            [
                11248,
                11335
            ],
            [
                11335,
                11486
            ],
            [
                11486,
                11550
            ],
            [
                11550,
                11616
            ],
            [
                11616,
                11616
            ],
            [
                11616,
                11656
            ],
            [
                11656,
                11656
            ],
            [
                11656,
                11656
            ],
            [
                11656,
                11656
            ],
            [
                11656,
                11656
            ],
            [
                11656,
                11753
            ],
            [
                11753,
                11852
            ],
            [
                11852,
                11871
            ],
            [
                11871,
                11882
            ],
            [
                11882,
                11882
            ],
            [
                11882,
                11938
            ],
            [
                11938,
                11944
            ],
            [
                11944,
                11944
            ],
            [
                11944,
                11996
            ],
            [
                11996,
                12048
            ],
            [
                12048,
                12062
            ],
            [
                12062,
                12081
            ],
            [
                12081,
                12106
            ],
            [
                12106,
                12128
            ],
            [
                12128,
                12148
            ],
            [
                12148,
                12148
            ],
            [
                12148,
                12205
            ],
            [
                12205,
                12280
            ],
            [
                12280,
                12307
            ],
            [
                12307,
                12307
            ],
            [
                12307,
                12307
            ],
            [
                12307,
                12307
            ],
            [
                12307,
                12307
            ],
            [
                12307,
                12343
            ],
            [
                12343,
                12374
            ],
            [
                12374,
                12374
            ],
            [
                12374,
                12398
            ],
            [
                12398,
                12432
            ],
            [
                12432,
                12495
            ],
            [
                12495,
                12547
            ],
            [
                12547,
                12585
            ],
            [
                12585,
                12632
            ],
            [
                12632,
                12669
            ],
            [
                12669,
                12691
            ],
            [
                12691,
                12831
            ],
            [
                12831,
                12891
            ],
            [
                12891,
                12918
            ],
            [
                12918,
                12958
            ],
            [
                12958,
                13042
            ],
            [
                13042,
                13061
            ],
            [
                13061,
                13149
            ],
            [
                13149,
                13149
            ],
            [
                13149,
                13273
            ],
            [
                13273,
                13288
            ],
            [
                13288,
                13346
            ],
            [
                13346,
                13379
            ],
            [
                13379,
                13461
            ],
            [
                13461,
                13503
            ],
            [
                13503,
                13599
            ],
            [
                13599,
                13703
            ],
            [
                13703,
                13752
            ],
            [
                13752,
                13839
            ],
            [
                13839,
                13869
            ],
            [
                13869,
                13895
            ],
            [
                13895,
                13910
            ],
            [
                13910,
                13910
            ],
            [
                13910,
                13967
            ],
            [
                13967,
                13967
            ],
            [
                13967,
                13990
            ],
            [
                13990,
                14022
            ],
            [
                14022,
                14029
            ],
            [
                14029,
                14121
            ],
            [
                14121,
                14210
            ],
            [
                14210,
                14218
            ],
            [
                14218,
                14236
            ],
            [
                14236,
                14293
            ],
            [
                14293,
                14320
            ],
            [
                14320,
                14392
            ],
            [
                14392,
                14463
            ],
            [
                14463,
                14473
            ],
            [
                14473,
                14504
            ],
            [
                14504,
                14564
            ],
            [
                14564,
                14564
            ],
            [
                14564,
                14592
            ],
            [
                14592,
                14633
            ],
            [
                14633,
                14633
            ],
            [
                14633,
                14633
            ],
            [
                14633,
                14760
            ],
            [
                14760,
                14760
            ],
            [
                14760,
                14823
            ],
            [
                14823,
                14823
            ],
            [
                14823,
                14868
            ],
            [
                14868,
                14868
            ],
            [
                14868,
                15019
            ],
            [
                15019,
                15074
            ],
            [
                15074,
                15093
            ],
            [
                15093,
                15147
            ],
            [
                15147,
                15163
            ],
            [
                15163,
                15163
            ],
            [
                15163,
                15197
            ],
            [
                15197,
                15249
            ],
            [
                15249,
                15288
            ],
            [
                15288,
                15312
            ],
            [
                15312,
                15312
            ],
            [
                15312,
                15407
            ],
            [
                15407,
                15407
            ],
            [
                15407,
                15440
            ],
            [
                15440,
                15446
            ],
            [
                15446,
                15503
            ],
            [
                15503,
                15503
            ],
            [
                15503,
                15554
            ],
            [
                15554,
                15609
            ],
            [
                15609,
                15663
            ],
            [
                15663,
                15741
            ],
            [
                15741,
                15752
            ],
            [
                15752,
                15752
            ],
            [
                15752,
                15752
            ],
            [
                15752,
                15752
            ],
            [
                15752,
                15897
            ],
            [
                15897,
                15925
            ],
            [
                15925,
                15949
            ],
            [
                15949,
                15986
            ],
            [
                15986,
                16025
            ],
            [
                16025,
                16070
            ],
            [
                16070,
                16177
            ],
            [
                16177,
                16279
            ],
            [
                16279,
                16279
            ],
            [
                16279,
                16299
            ],
            [
                16299,
                16362
            ],
            [
                16362,
                16377
            ],
            [
                16377,
                16460
            ],
            [
                16460,
                16460
            ],
            [
                16460,
                16503
            ],
            [
                16503,
                16610
            ],
            [
                16610,
                16625
            ],
            [
                16625,
                16698
            ],
            [
                16698,
                16698
            ],
            [
                16698,
                16698
            ],
            [
                16698,
                16698
            ],
            [
                16698,
                16698
            ],
            [
                16698,
                16761
            ],
            [
                16761,
                16812
            ],
            [
                16812,
                16824
            ],
            [
                16824,
                16830
            ],
            [
                16830,
                16830
            ],
            [
                16830,
                16830
            ],
            [
                16830,
                16899
            ],
            [
                16899,
                16960
            ],
            [
                16960,
                17047
            ],
            [
                17047,
                17062
            ],
            [
                17062,
                17104
            ],
            [
                17104,
                17141
            ],
            [
                17141,
                17360
            ],
            [
                17360,
                17416
            ],
            [
                17416,
                17524
            ]
        ]
    }
}