{
    "original": {
        "text": "The next day Moore had risen before the sun, and had taken a ride to Whinbury and back ere his sister had made the caf au lait or cut the tartines for his breakfast. What business he transacted there he kept to himself. Hortense asked no questions: it was not her wont to comment on his movements, nor his to render an account of them. The secrets of business--complicated and often dismal mysteries--were buried in his breast, and never came out of their sepulchre save now and then to scare Joe Scott, or give a start to some foreign correspondent. Indeed, a general habit of reserve on whatever was important seemed bred in his mercantile blood.\nBreakfast over, he went to his counting-house. Henry, Joe Scott's boy, brought in the letters and the daily papers; Moore seated himself at his desk, broke the seals of the documents, and glanced them over. They were all short, but not, it seemed, sweet--probably rather sour, on the contrary, for as Moore laid down the last, his nostrils emitted a derisive and defiant snuff, and though he burst into no soliloquy, there was a glance in his eye which seemed to invoke the devil, and lay charges on him to sweep the whole concern to Gehenna. However, having chosen a pen and stripped away the feathered top in a brief spasm of finger-fury (only finger-fury--his face was placid), he dashed off a batch of answers, sealed them, and then went out and walked through the mill. On coming back he sat down to read his newspaper.\nThe contents seemed not absorbingly interesting; he more than once laid it across his knee, folded his arms, and gazed into the fire; he occasionally turned his head towards the window; he looked at intervals at his watch; in short, his mind appeared preoccupied. Perhaps he was thinking of the beauty of the weather--for it was a fine and mild morning for the season--and wishing to be out in the fields enjoying it. The door of his counting-house stood wide open. The breeze and sunshine entered freely; but the first visitant brought no spring perfume on its wings, only an occasional sulphur-puff from the soot-thick column of smoke rushing sable from the gaunt mill-chimney.\nA dark-blue apparition (that of Joe Scott, fresh from a dyeing vat) appeared momentarily at the open door, uttered the words \"He's comed, sir,\" and vanished.\nMr. Moore raised not his eyes from the paper. A large man, broad-shouldered and massive-limbed, clad in fustian garments and gray worsted stockings, entered, who was received with a nod, and desired to take a seat, which he did, making the remark, as he removed his hat (a very bad one), stowed it away under his chair, and wiped his forehead with a spotted cotton handkerchief extracted from the hat-crown, that it was \"raight dahn warm for Febewerry.\" Mr. Moore assented--at least he uttered some slight sound, which, though inarticulate, might pass for an assent. The visitor now carefully deposited in the corner beside him an official-looking staff which he bore in his hand; this done, he whistled, probably by way of appearing at his ease.\n\"You have what is necessary, I suppose?\" said Mr. Moore.\n\"Ay, ay! all's right.\"\nHe renewed his whistling, Mr. Moore his reading. The paper apparently had become more interesting. Presently, however, he turned to his cupboard, which was within reach of his long arm, opened it without rising, took out a black bottle--the same he had produced for Malone's benefit--a tumbler, and a jug, placed them on the table, and said to his guest,--\n\"Help yourself; there's water in that jar in the corner.\"\n\"I dunnut knaw that there's mich need, for all a body is dry (thirsty) in a morning,\" said the fustian gentleman, rising and doing as requested.\n\"Will you tak naught yourseln, Mr. Moore?\" he inquired, as with skilled hand he mixed a portion, and having tested it by a deep draught, sank back satisfied and bland in his seat. Moore, chary of words, replied by a negative movement and murmur.\n\"Yah'd as good,\" continued his visitor; \"it 'uld set ye up wald a sup o' this stuff. Uncommon good hollands. Ye get it fro' furrin parts, I'se think?\"\n\"Ay!\"\n\"Tak my advice and try a glass on't. Them lads 'at's coming 'll keep ye talking, nob'dy knows how long. Ye'll need propping.\"\n\"Have you seen Mr. Sykes this morning?\" inquired Moore.\n\"I seed him a hauf an hour--nay, happen a quarter of an hour sin', just afore I set off. He said he aimed to come here, and I sudn't wonder but ye'll have old Helstone too. I seed 'em saddling his little nag as I passed at back o' t' rectory.\"\nThe speaker was a true prophet, for the trot of a little nag's hoofs was, five minutes after, heard in the yard. It stopped, and a well-known nasal voice cried aloud, \"Boy\" (probably addressing Harry Scott, who usually hung about the premises from 9 a.m. to 5 p.m.), \"take my horse and lead him into the stable.\"\nHelstone came in marching nimbly and erect, looking browner, keener, and livelier than usual.\n\"Beautiful morning, Moore. How do, my boy? Ha! whom have we here?\" (turning to the personage with the staff). \"Sugden! What! you're going to work directly? On my word, you lose no time. But I come to ask explanations. Your message was delivered to me. Are you sure you are on the right scent? How do you mean to set about the business? Have you got a warrant?\"\n\"Sugden has.\"\n\"Then you are going to seek him now? I'll accompany you.\"\n\"You will be spared that trouble, sir; he is coming to seek me. I'm just now sitting in state waiting his arrival.\"\n\"And who is it? One of my parishioners?\"\nJoe Scott had entered unobserved. He now stood, a most sinister phantom, half his person being dyed of the deepest tint of indigo, leaning on the desk. His master's answer to the rector's question was a smile. Joe took the word. Putting on a quiet but pawky look, he said,--\n\"It's a friend of yours, Mr. Helstone, a gentleman you often speak of.\"\n\"Indeed! His name, Joe? You look well this morning.\"\n\"Only the Rev. Moses Barraclough; t' tub orator you call him sometimes, I think.\"\n\"Ah!\" said the rector, taking out his snuff-box, and administering to himself a very long pinch--\"ah! couldn't have supposed it. Why, the pious man never was a workman of yours, Moore. He's a tailor by trade.\"\n\"And so much the worse grudge I owe him, for interfering and setting my discarded men against me.\"\n\"And Moses was actually present at the battle of Stilbro' Moor? He went there, wooden leg and all?\"\n\"Ay, sir,\" said Joe; \"he went there on horseback, that his leg mightn't be noticed. He was the captain, and wore a mask. The rest only had their faces blackened.\"\n\"And how was he found out?\"\n\"I'll tell you, sir,\" said Joe. \"T' maister's not so fond of talking. I've no objections. He courted Sarah, Mr. Moore's sarvant lass, and so it seems she would have nothing to say to him; she either didn't like his wooden leg or she'd some notion about his being a hypocrite. Happen (for women is queer hands; we may say that amang werseln when there's none of 'em nigh) she'd have encouraged him, in spite of his leg and his deceit, just to pass time like. I've known some on 'em do as mich, and some o' t' bonniest and mimmest-looking, too--ay, I've seen clean, trim young things, that looked as denty and pure as daisies, and wi' time a body fun' 'em out to be nowt but stinging, venomed nettles.\"\n\"Joe's a sensible fellow,\" interjected Helstone.\n\"Howsiver, Sarah had another string to her bow. Fred Murgatroyd, one of our lads, is for her; and as women judge men by their faces--and Fred has a middling face, while Moses is none so handsome, as we all knaw--the lass took on wi' Fred. A two-three months sin', Murgatroyd and Moses chanced to meet one Sunday night; they'd both come lurking about these premises wi' the notion of counselling Sarah to tak a bit of a walk wi' them. They fell out, had a tussle, and Fred was worsted, for he's young and small, and Barraclough, for all he has only one leg, is almost as strong as Sugden there--indeed, anybody that hears him roaring at a revival or a love-feast may be sure he's no weakling.\"\n\"Joe, you're insupportable,\" here broke in Mr. Moore. \"You spin out your explanation as Moses spins out his sermons. The long and short of it is, Murgatroyd was jealous of Barraclough; and last night, as he and a friend took shelter in a barn from a shower, they heard and saw Moses conferring with some associates within. From their discourse it was plain he had been the leader, not only at Stilbro' Moor, but in the attack on Sykes's property. Moreover they planned a deputation to wait on me this morning, which the tailor is to head, and which, in the most religious and peaceful spirit, is to entreat me to put the accursed thing out of my tent. I rode over to Whinbury this morning, got a constable and a warrant, and I am now waiting to give my friend the reception he deserves. Here, meantime, comes Sykes. Mr. Helstone, you must spirit him up. He feels timid at the thoughts of prosecuting.\"\nA gig was heard to roll into the yard. Mr. Sykes entered--a tall stout man of about fifty, comely of feature, but feeble of physiognomy. He looked anxious.\n\"Have they been? Are they gone? Have you got him? Is it over?\" he asked.\n\"Not yet,\" returned Moore with phlegm. \"We are waiting for them.\"\n\"They'll not come; it's near noon. Better give it up. It will excite bad feeling--make a stir--cause perhaps fatal consequences.\"\n\"_You_ need not appear,\" said Moore. \"I shall meet them in the yard when they come; _you_ can stay here.\"\n\"But my name must be seen in the law proceedings. A wife and family, Mr. Moore--a wife and family make a man cautious.\"\nMoore looked disgusted. \"Give way, if you please,\" said he; \"leave me to myself. I have no objection to act alone; only be assured you will not find safety in submission. Your partner Pearson gave way, and conceded, and forbore. Well, that did not prevent them from attempting to shoot him in his own house.\"\n\"My dear sir, take a little wine and water,\" recommended Mr. Helstone. The wine and water was hollands and water, as Mr. Sykes discovered when he had compounded and swallowed a brimming tumbler thereof. It transfigured him in two minutes, brought the colour back to his face, and made him at least _word_-valiant. He now announced that he hoped he was above being trampled on by the common people; he was determined to endure the insolence of the working-classes no longer; he had considered of it, and made up his mind to go all lengths; if money and spirit could put down these rioters, they should be put down; Mr. Moore might do as he liked, but _he_--Christie Sykes--would spend his last penny in law before he would be beaten; he'd settle them, or he'd see.\n\"Take another glass,\" urged Moore.\nMr. Sykes didn't mind if he did. This was a cold morning (Sugden had found it a warm one); it was necessary to be careful at this season of the year--it was proper to take something to keep the damp out; he had a little cough already (here he coughed in attestation of the fact); something of this sort (lifting the black bottle) was excellent, taken medicinally (he poured the physic into his tumbler); he didn't make a practice of drinking spirits in a morning, but occasionally it really was prudent to take precautions.\n\"Quite prudent, and take them by all means,\" urged the host.\nMr. Sykes now addressed Mr. Helstone, who stood on the hearth, his shovel-hat on his head, watching him significantly with his little, keen eyes.\n\"You, sir, as a clergyman,\" said he, \"may feel it disagreeable to be present amidst scenes of hurry and flurry, and, I may say, peril. I dare say your nerves won't stand it. You're a man of peace, sir; but we manufacturers, living in the world, and always in turmoil, get quite belligerent. Really, there's an ardour excited by the thoughts of danger that makes my heart pant. When Mrs. Sykes is afraid of the house being attacked and broke open--as she is every night--I get quite excited. I couldn't describe to you, sir, my feelings. Really, if anybody was to come--thieves or anything--I believe I should enjoy it, such is my spirit.\"\nThe hardest of laughs, though brief and low, and by no means insulting, was the response of the rector. Moore would have pressed upon the heroic mill-owner a third tumbler, but the clergyman, who never transgressed, nor would suffer others in his presence to transgress, the bounds of decorum, checked him.\n\"Enough is as good as a feast, is it not, Mr. Sykes?\" he said; and Mr. Sykes assented, and then sat and watched Joe Scott remove the bottle at a sign from Helstone, with a self-satisfied simper on his lips and a regretful glisten in his eye. Moore looked as if he should have liked to fool him to the top of his bent. What would a certain young kinswoman of his have said could she have seen her dear, good, great Robert--her Coriolanus--just now? Would she have acknowledged in that mischievous, sardonic visage the same face to which she had looked up with such love, which had bent over her with such gentleness last night? Was that the man who had spent so quiet an evening with his sister and his cousin--so suave to one, so tender to the other--reading Shakespeare and listening to Chnier?\nYes, it was the same man, only seen on a different side--a side Caroline had not yet fairly beheld, though perhaps she had enough sagacity faintly to suspect its existence. Well, Caroline had, doubtless, her defective side too. She was human. She must, then, have been very imperfect; and had she seen Moore on his very worst side, she would probably have said this to herself and excused him. Love can excuse anything except meanness; but meanness kills love, cripples even natural affection; without esteem true love cannot exist. Moore, with all his faults, might be esteemed; for he had no moral scrofula in his mind, no hopeless polluting taint--such, for instance, as that of falsehood; neither was he the slave of his appetites. The active life to which he had been born and bred had given him something else to do than to join the futile chase of the pleasure-hunter. He was a man undegraded, the disciple of reason, _not_ the votary of sense. The same might be said of old Helstone. Neither of these two would look, think, or speak a lie; for neither of them had the wretched black bottle, which had just been put away, any charms. Both might boast a valid claim to the proud title of \"lord of the creation,\" for no animal vice was lord of them; they looked and were superior beings to poor Sykes.\nA sort of gathering and trampling sound was heard in the yard, and then a pause. Moore walked to the window; Helstone followed. Both stood on one side, the tall junior behind the under-sized senior, looking forth carefully, so that they might not be visible from without. Their sole comment on what they saw was a cynical smile flashed into each other's stern eyes.\nA flourishing oratorical cough was now heard, followed by the interjection \"Whisht!\" designed, as it seemed, to still the hum of several voices. Moore opened his casement an inch or two to admit sound more freely.\n\"Joseph Scott,\" began a snuffling voice--Scott was standing sentinel at the counting-house door--\"might we inquire if your master be within, and is to be spoken to?\"\n\"He's within, ay,\" said Joe nonchalantly.\n\"Would you then, if _you_ please\" (emphasis on \"you\"), \"have the goodness to tell _him_ that twelve gentlemen wants to see him.\"\n\"He'd happen ax what for,\" suggested Joe. \"I mught as weel tell him that at t' same time.\"\n\"For a purpose,\" was the answer. Joe entered.\n\"Please, sir, there's twelve gentlemen wants to see ye, 'for a purpose.'\"\n\"Good, Joe; I'm their man.--Sugden, come when I whistle.\"\nMoore went out, chuckling dryly. He advanced into the yard, one hand in his pocket, the other in his waistcoat, his cap brim over his eyes, shading in some measure their deep dancing ray of scorn. Twelve men waited in the yard, some in their shirt-sleeves, some in blue aprons. Two figured conspicuously in the van of the party. One, a little dapper strutting man with a turned-up nose; the other a broad-shouldered fellow, distinguished no less by his demure face and cat like, trustless eyes than by a wooden leg and stout crutch. There was a kind of leer about his lips; he seemed laughing in his sleeve at some person or thing; his whole air was anything but that of a true man.\n\"Good-morning, Mr. Barraclough,\" said Moore debonairly, for him.\n\"Peace be unto you!\" was the answer, Mr. Barraclough entirely closing his naturally half-shut eyes as he delivered it.\n\"I'm obliged to you. Peace is an excellent thing; there's nothing I more wish for myself. But that is not all you have to say to me, I suppose? I imagine peace is not your purpose?\"\n\"As to our purpose,\" began Barraclough, \"it's one that may sound strange and perhaps foolish to ears like yours, for the childer of this world is wiser in their generation than the childer of light.\"\n\"To the point, if you please, and let me hear what it is.\"\n\"Ye'se hear, sir. If I cannot get it off, there's eleven behint can help me. It is a grand purpose, and\" (changing his voice from a half-sneer to a whine) \"it's the Looard's own purpose, and that's better.\"\n\"Do you want a subscription to a new Ranter's chapel, Mr. Barraclough? Unless your errand be something of that sort, I cannot see what you have to do with it.\"\n\"I hadn't that duty on my mind, sir; but as Providence has led ye to mention the subject, I'll make it i' my way to tak ony trifle ye may have to spare; the smallest contribution will be acceptable.\"\nWith that he doffed his hat, and held it out as a begging-box, a brazen grin at the same time crossing his countenance.\n\"If I gave you sixpence you would drink it.\"\nBarraclough uplifted the palms of his hands and the whites of his eyes, evincing in the gesture a mere burlesque of hypocrisy.\n\"You seem a fine fellow,\" said Moore, quite coolly and dryly; \"you don't care for showing me that you are a double-dyed hypocrite, that your trade is fraud. You expect indeed to make me laugh at the cleverness with which you play your coarsely farcical part, while at the same time you think you are deceiving the men behind you.\"\nMoses' countenance lowered. He saw he had gone too far. He was going to answer, when the second leader, impatient of being hitherto kept in the background, stepped forward. This man did not look like a traitor, though he had an exceedingly self-confident and conceited air.\n\"Mr. Moore,\" commenced he, speaking also in his throat and nose, and enunciating each word very slowly, as if with a view to giving his audience time to appreciate fully the uncommon elegance of the phraseology, \"it might, perhaps, justly be said that reason rather than peace is our purpose. We come, in the first place, to request you to hear reason; and should _you_ refuse, it is my duty to warn _you_, in very decided terms, that measures will be had resort to\" (he meant recourse) \"which will probably terminate in--in bringing _you_ to a sense of the unwisdom, of the--the foolishness which seems to guide and guard your proceedings as a tradesman in this manufacturing part of the country. Hem! Sir, I would beg to allude that as a furriner, coming from a distant coast, another quarter and hemisphere of this globe, thrown, as I may say, a perfect outcast on these shores--the cliffs of Albion--you have not that understanding of huz and wer ways which might conduce to the benefit of the working-classes. If, to come at once to partic'lars, you'd consider to give up this here miln, and go without further protractions straight home to where you belong, it 'ud happen be as well. I can see naught ageean such a plan.--What hev ye to say tull't, lads?\" turning round to the other members of the deputation, who responded unanimously, \"Hear, hear!\"\n\"Brayvo, Noah o' Tim's!\" murmured Joe Scott, who stood behind Mr. Moore. \"Moses'll niver beat that. Cliffs o' Albion, and t' other hemisphere! My certy! Did ye come fro' th' Antarctic Zone, maister? Moses is dished.\"\nMoses, however, refused to be dished. He thought he would try again. Casting a somewhat ireful glance at \"Noah o' Tim's,\" he launched out in his turn; and now he spoke in a serious tone, relinquishing the sarcasm which he found had not answered.\n\"Or iver you set up the pole o' your tent amang us, Mr. Moore, we lived i' peace and quietness--yea, I may say, in all loving-kindness. I am not myself an aged person as yet, but I can remember as far back as maybe some twenty year, when hand-labour were encouraged and respected, and no mischief-maker had ventured to introduce these here machines which is so pernicious. Now, I'm not a cloth-dresser myself, but by trade a tailor. Howsiver, my heart is of a softish nature. I'm a very feeling man, and when I see my brethren oppressed, like my great namesake of old, I stand up for 'em; for which intent I this day speak with you face to face, and advises you to part wi' your infernal machinery, and tak on more hands.\"\n\"What if I don't follow your advice, Mr. Barraclough?\"\n\"The Looard pardon you! The Looard soften your heart, sir!\"\n\"Are you in connection with the Wesleyans now, Mr. Barraclough?\"\n\"Praise God! Bless His name! I'm a joined Methody!\"\n\"Which in no respect prevents you from being at the same time a drunkard and a swindler. I saw you one night a week ago laid dead-drunk by the roadside, as I returned from Stilbro' market; and while you preach peace, you make it the business of your life to stir up dissension. You no more sympathize with the poor who are in distress than you sympathize with me. You incite them to outrage for bad purposes of your own; so does the individual called Noah of Tim's. You two are restless, meddling, impudent scoundrels, whose chief motive-principle is a selfish ambition, as dangerous as it is puerile. The persons behind you are some of them honest though misguided men; but you two I count altogether bad.\"\nBarraclough was going to speak.\n\"Silence! You have had your say, and now I will have mine. As to being dictated to by you, or any Jack, Jem, or Jonathan on earth, I shall not suffer it for a moment. You desire me to quit the country; you request me to part with my machinery. In case I refuse, you threaten me. I _do_ refuse--point-blank! Here I stay, and by this mill I stand, and into it will I convey the best machinery inventors can furnish. What will you do? The utmost you _can_ do--and this you will never _dare_ to do--is to burn down my mill, destroy its contents, and shoot me. What then? Suppose that building was a ruin and I was a corpse--what then, you lads behind these two scamps? Would that stop invention or exhaust science? Not for the fraction of a second of time! Another and better gig-mill would rise on the ruins of this, and perhaps a more enterprising owner come in my place. Hear me! I'll make my cloth as I please, and according to the best lights I have. In its manufacture I will employ what means I choose. Whoever, after hearing this, shall dare to interfere with me may just take the consequences. An example shall prove I'm in earnest.\"\nHe whistled shrill and loud. Sugden, his staff and warrant, came on the scene.\nMoore turned sharply to Barraclough. \"You were at Stilbro',\" said he; \"I have proof of that. You were on the moor, you wore a mask, you knocked down one of my men with your own hand--you! a preacher of the gospel!--Sugden, arrest him!\"\nMoses was captured. There was a cry and a rush to rescue, but the right hand which all this while had lain hidden in Moore's breast, reappearing, held out a pistol.\n\"Both barrels are loaded,\" said he. \"I'm quite determined! Keep off!\"\nStepping backwards, facing the foe as he went, he guarded his prey to the counting-house. He ordered Joe Scott to pass in with Sugden and the prisoner, and to bolt the door inside. For himself, he walked backwards and forwards along the front of the mill, looking meditatively on the ground, his hand hanging carelessly by his side, but still holding the pistol. The eleven remaining deputies watched him some time, talking under their breath to each other. At length one of them approached. This man looked very different from either of the two who had previously spoken; he was hard-favoured, but modest and manly-looking.\n\"I've not much faith i' Moses Barraclough,\" said he, \"and I would speak a word to you myseln, Mr. Moore. It's out o' no ill-will that I'm here, for my part; it's just to mak a effort to get things straightened, for they're sorely a-crooked. Ye see we're ill off--varry ill off; wer families is poor and pined. We're thrown out o' work wi' these frames; we can get nought to do; we can earn nought. What is to be done? Mun we say, wisht! and lig us down and dee? Nay; I've no grand words at my tongue's end, Mr. Moore, but I feel that it wad be a low principle for a reasonable man to starve to death like a dumb cratur. I willn't do't. I'm not for shedding blood: I'd neither kill a man nor hurt a man; and I'm not for pulling down mills and breaking machines--for, as ye say, that way o' going on'll niver stop invention; but I'll talk--I'll mak as big a din as ever I can. Invention may be all right, but I know it isn't right for poor folks to starve. Them that governs mun find a way to help us; they mun make fresh orderations. Ye'll say that's hard to do. So mich louder mun we shout out then, for so much slacker will t' Parliament-men be to set on to a tough job.\"\n\"Worry the Parliament-men as much as you please,\" said Moore; \"but to worry the mill-owners is absurd, and I for one won't stand it.\"\n\"Ye're a raight hard un!\" returned the workman. \"Willn't ye gie us a bit o' time? Willn't ye consent to mak your changes rather more slowly?\"\n\"Am I the whole body of clothiers in Yorkshire? Answer me that.\"\n\"Ye're yourseln.\"\n\"And only myself. And if I stopped by the way an instant, while others are rushing on, I should be trodden down. If I did as you wish me to do, I should be bankrupt in a month; and would my bankruptcy put bread into your hungry children's mouths? William Farren, neither to your dictation nor to that of any other will I submit. Talk to me no more about machinery. I will have my own way. I shall get new frames in to-morrow. If you broke these, I would still get more. _I'll never give in._\"\nHere the mill-bell rang twelve o'clock. It was the dinner-hour. Moore abruptly turned from the deputation and re-entered his counting-house.\nHis last words had left a bad, harsh impression; he, at least, had \"failed in the disposing of a chance he was lord of.\" By speaking kindly to William Farren--who was a very honest man, without envy or hatred of those more happily circumstanced than himself, thinking it no hardship and no injustice to be forced to live by labour, disposed to be honourably content if he could but get work to do--Moore might have made a friend. It seemed wonderful how he could turn from such a man without a conciliatory or a sympathizing expression. The poor fellow's face looked haggard with want; he had the aspect of a man who had not known what it was to live in comfort and plenty for weeks, perhaps months, past, and yet there was no ferocity, no malignity in his countenance; it was worn, dejected, austere, but still patient. How could Moore leave him thus, with the words, \"I'll never give in,\" and not a whisper of good-will, or hope, or aid?\nFarren, as he went home to his cottage--once, in better times, a decent, clean, pleasant place, but now, though still clean, very dreary, because so poor--asked himself this question. He concluded that the foreign mill-owner was a selfish, an unfeeling, and, he thought, too, a foolish man. It appeared to him that emigration, had he only the means to emigrate, would be preferable to service under such a master. He felt much cast down--almost hopeless.\nOn his entrance his wife served out, in orderly sort, such dinner as she had to give him and the bairns. It was only porridge, and too little of that. Some of the younger children asked for more when they had done their portion--an application which disturbed William much. While his wife quieted them as well as she could, he left his seat and went to the door. He whistled a cheery stave, which did not, however, prevent a broad drop or two (much more like the \"first of a thunder-shower\" than those which oozed from the wound of the gladiator) from gathering on the lids of his gray eyes, and plashing thence to the threshold. He cleared his vision with his sleeve, and the melting mood over, a very stern one followed.\nHe still stood brooding in silence, when a gentleman in black came up--a clergyman, it might be seen at once, but neither Helstone, nor Malone, nor Donne, nor Sweeting. He might be forty years old; he was plain-looking, dark-complexioned, and already rather gray-haired. He stooped a little in walking. His countenance, as he came on, wore an abstracted and somewhat doleful air; but in approaching Farren he looked up, and then a hearty expression illuminated the preoccupied, serious face.\n\"Is it you, William? How are you?\" he asked.\n\"Middling, Mr. Hall. How are _ye_? Will ye step in and rest ye?\"\nMr. Hall, whose name the reader has seen mentioned before (and who, indeed, was vicar of Nunnely, of which parish Farren was a native, and from whence he had removed but three years ago to reside in Briarfield, for the convenience of being near Hollow's Mill, where he had obtained work), entered the cottage, and having greeted the good-wife and the children, sat down. He proceeded to talk very cheerfully about the length of time that had elapsed since the family quitted his parish, the changes which had occurred since; he answered questions touching his sister Margaret, who was inquired after with much interest; he asked questions in his turn, and at last, glancing hastily and anxiously round through his spectacles (he wore spectacles, for he was short-sighted) at the bare room, and at the meagre and wan faces of the circle about him--for the children had come round his knee, and the father and mother stood before him--he said abruptly,--\n\"And how are you all? How do you get on?\"\nMr. Hall, be it remarked, though an accomplished scholar, not only spoke with a strong northern accent, but, on occasion, used freely north-country expressions.\n\"We get on poorly,\" said William; \"we're all out of work. I've selled most o' t' household stuff, as ye may see; and what we're to do next, God knows.\"\n\"Has Mr. Moore turned you off?\"\n\"He has turned us off; and I've sich an opinion of him now that I think if he'd tak me on again to-morrow I wouldn't work for him.\"\n\"It is not like you to say so, William.\"\n\"I know it isn't; but I'm getting different to mysel'; I feel I am changing. I wadn't heed if t' bairns and t' wife had enough to live on; but they're pinched--they're pined----\"\n\"Well, my lad, and so are you; I see you are. These are grievous times; I see suffering wherever I turn. William, sit down. Grace, sit down. Let us talk it over.\"\nAnd in order the better to talk it over, Mr. Hall lifted the least of the children on to his knee, and placed his hand on the head of the next least; but when the small things began to chatter to him he bade them \"Whisht!\" and fixing his eyes on the grate, he regarded the handful of embers which burned there very gravely.\n\"Sad times,\" he said, \"and they last long. It is the will of God. His will be done. But He tries us to the utmost.\"\nAgain he reflected.\n\"You've no money, William, and you've nothing you could sell to raise a small sum?\"\n\"No. I've selled t' chest o' drawers, and t' clock, and t' bit of a mahogany stand, and t' wife's bonny tea-tray and set o' cheeney 'at she brought for a portion when we were wed.\"\n\"And if somebody lent you a pound or two, could you make any good use of it? Could you get into a new way of doing something?\"\nFarren did not answer, but his wife said quickly, \"Ay, I'm sure he could, sir. He's a very contriving chap is our William. If he'd two or three pounds he could begin selling stuff.\"\n\"Could you, William?\"\n\"Please God,\" returned William deliberately, \"I could buy groceries, and bits o' tapes, and thread, and what I thought would sell, and I could begin hawking at first.\"\n\"And you know, sir,\" interposed Grace, \"you're sure William would neither drink, nor idle, nor waste, in any way. He's my husband, and I shouldn't praise him; but I _will_ say there's not a soberer, honester man i' England nor he is.\"\n\"Well, I'll speak to one or two friends, and I think I can promise to let him have 5 in a day or two--as a loan, ye mind, not a gift. He must pay it back.\"\n\"I understand, sir. I'm quite agreeable to that.\"\n\"Meantime, there's a few shillings for you, Grace, just to keep the pot boiling till custom comes.--Now, bairns, stand up in a row and say your catechism, while your mother goes and buys some dinner; for you've not had much to-day, I'll be bound.--You begin, Ben. What is your name?\"\nMr. Hall stayed till Grace came back; then he hastily took his leave, shaking hands with both Farren and his wife. Just at the door he said to them a few brief but very earnest words of religious consolation and exhortation. With a mutual \"God bless you, sir!\" \"God bless you, my friends!\" they separated.",
        "paragraph_chars": [
            [
                0,
                649
            ],
            [
                649,
                1474
            ],
            [
                1474,
                2154
            ],
            [
                2154,
                2312
            ],
            [
                2312,
                3059
            ],
            [
                3059,
                3116
            ],
            [
                3116,
                3139
            ],
            [
                3139,
                3496
            ],
            [
                3496,
                3554
            ],
            [
                3554,
                3699
            ],
            [
                3699,
                3945
            ],
            [
                3945,
                4096
            ],
            [
                4096,
                4102
            ],
            [
                4102,
                4228
            ],
            [
                4228,
                4284
            ],
            [
                4284,
                4528
            ],
            [
                4528,
                4841
            ],
            [
                4841,
                4935
            ],
            [
                4935,
                5296
            ],
            [
                5296,
                5310
            ],
            [
                5310,
                5368
            ],
            [
                5368,
                5484
            ],
            [
                5484,
                5525
            ],
            [
                5525,
                5800
            ],
            [
                5800,
                5872
            ],
            [
                5872,
                5925
            ],
            [
                5925,
                6007
            ],
            [
                6007,
                6217
            ],
            [
                6217,
                6316
            ],
            [
                6316,
                6416
            ],
            [
                6416,
                6579
            ],
            [
                6579,
                6607
            ],
            [
                6607,
                7308
            ],
            [
                7308,
                7357
            ],
            [
                7357,
                8050
            ],
            [
                8050,
                8952
            ],
            [
                8952,
                9108
            ],
            [
                9108,
                9181
            ],
            [
                9181,
                9247
            ],
            [
                9247,
                9377
            ],
            [
                9377,
                9483
            ],
            [
                9483,
                9603
            ],
            [
                9603,
                9912
            ],
            [
                9912,
                10676
            ],
            [
                10676,
                10711
            ],
            [
                10711,
                11235
            ],
            [
                11235,
                11296
            ],
            [
                11296,
                11442
            ],
            [
                11442,
                12081
            ],
            [
                12081,
                12388
            ],
            [
                12388,
                13184
            ],
            [
                13184,
                14491
            ],
            [
                14491,
                14857
            ],
            [
                14857,
                15071
            ],
            [
                15071,
                15237
            ],
            [
                15237,
                15279
            ],
            [
                15279,
                15408
            ],
            [
                15408,
                15499
            ],
            [
                15499,
                15545
            ],
            [
                15545,
                15619
            ],
            [
                15619,
                15677
            ],
            [
                15677,
                16360
            ],
            [
                16360,
                16425
            ],
            [
                16425,
                16544
            ],
            [
                16544,
                16726
            ],
            [
                16726,
                16926
            ],
            [
                16926,
                16985
            ],
            [
                16985,
                17192
            ],
            [
                17192,
                17352
            ],
            [
                17352,
                17552
            ],
            [
                17552,
                17672
            ],
            [
                17672,
                17717
            ],
            [
                17717,
                17844
            ],
            [
                17844,
                18175
            ],
            [
                18175,
                18449
            ],
            [
                18449,
                19806
            ],
            [
                19806,
                20023
            ],
            [
                20023,
                20269
            ],
            [
                20269,
                20992
            ],
            [
                20992,
                21047
            ],
            [
                21047,
                21107
            ],
            [
                21107,
                21172
            ],
            [
                21172,
                21224
            ],
            [
                21224,
                21932
            ],
            [
                21932,
                21964
            ],
            [
                21964,
                23103
            ],
            [
                23103,
                23182
            ],
            [
                23182,
                23418
            ],
            [
                23418,
                23583
            ],
            [
                23583,
                23653
            ],
            [
                23653,
                24278
            ],
            [
                24278,
                25451
            ],
            [
                25451,
                25585
            ],
            [
                25585,
                25727
            ],
            [
                25727,
                25792
            ],
            [
                25792,
                25810
            ],
            [
                25810,
                26303
            ],
            [
                26303,
                26444
            ],
            [
                26444,
                27384
            ],
            [
                27384,
                27839
            ],
            [
                27839,
                28562
            ],
            [
                28562,
                29054
            ],
            [
                29054,
                29099
            ],
            [
                29099,
                29164
            ],
            [
                29164,
                30117
            ],
            [
                30117,
                30159
            ],
            [
                30159,
                30320
            ],
            [
                30320,
                30472
            ],
            [
                30472,
                30504
            ],
            [
                30504,
                30636
            ],
            [
                30636,
                30677
            ],
            [
                30677,
                30856
            ],
            [
                30856,
                31019
            ],
            [
                31019,
                31343
            ],
            [
                31343,
                31459
            ],
            [
                31459,
                31479
            ],
            [
                31479,
                31563
            ],
            [
                31563,
                31744
            ],
            [
                31744,
                31871
            ],
            [
                31871,
                32053
            ],
            [
                32053,
                32075
            ],
            [
                32075,
                32243
            ],
            [
                32243,
                32478
            ],
            [
                32478,
                32634
            ],
            [
                32634,
                32684
            ],
            [
                32684,
                32968
            ],
            [
                32968,
                33273
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                220
            ],
            [
                220,
                336
            ],
            [
                336,
                551
            ],
            [
                551,
                649
            ],
            [
                649,
                696
            ],
            [
                696,
                856
            ],
            [
                856,
                1192
            ],
            [
                1192,
                1424
            ],
            [
                1424,
                1474
            ],
            [
                1474,
                1738
            ],
            [
                1738,
                1892
            ],
            [
                1892,
                1940
            ],
            [
                1940,
                2154
            ],
            [
                2154,
                2312
            ],
            [
                2312,
                2358
            ],
            [
                2358,
                2766
            ],
            [
                2766,
                2879
            ],
            [
                2879,
                3059
            ],
            [
                3059,
                3100
            ],
            [
                3100,
                3116
            ],
            [
                3116,
                3125
            ],
            [
                3125,
                3139
            ],
            [
                3139,
                3188
            ],
            [
                3188,
                3238
            ],
            [
                3238,
                3496
            ],
            [
                3496,
                3554
            ],
            [
                3554,
                3699
            ],
            [
                3699,
                3742
            ],
            [
                3742,
                3879
            ],
            [
                3879,
                3945
            ],
            [
                3945,
                4030
            ],
            [
                4030,
                4054
            ],
            [
                4054,
                4096
            ],
            [
                4096,
                4102
            ],
            [
                4102,
                4139
            ],
            [
                4139,
                4206
            ],
            [
                4206,
                4228
            ],
            [
                4228,
                4268
            ],
            [
                4268,
                4284
            ],
            [
                4284,
                4373
            ],
            [
                4373,
                4457
            ],
            [
                4457,
                4528
            ],
            [
                4528,
                4641
            ],
            [
                4641,
                4841
            ],
            [
                4841,
                4935
            ],
            [
                4935,
                4962
            ],
            [
                4962,
                4978
            ],
            [
                4978,
                4982
            ],
            [
                4982,
                5002
            ],
            [
                5002,
                5045
            ],
            [
                5045,
                5054
            ],
            [
                5054,
                5060
            ],
            [
                5060,
                5091
            ],
            [
                5091,
                5121
            ],
            [
                5121,
                5153
            ],
            [
                5153,
                5187
            ],
            [
                5187,
                5228
            ],
            [
                5228,
                5271
            ],
            [
                5271,
                5296
            ],
            [
                5296,
                5310
            ],
            [
                5310,
                5347
            ],
            [
                5347,
                5368
            ],
            [
                5368,
                5432
            ],
            [
                5432,
                5484
            ],
            [
                5484,
                5500
            ],
            [
                5500,
                5525
            ],
            [
                5525,
                5559
            ],
            [
                5559,
                5677
            ],
            [
                5677,
                5735
            ],
            [
                5735,
                5754
            ],
            [
                5754,
                5800
            ],
            [
                5800,
                5872
            ],
            [
                5872,
                5881
            ],
            [
                5881,
                5896
            ],
            [
                5896,
                5925
            ],
            [
                5925,
                6007
            ],
            [
                6007,
                6013
            ],
            [
                6013,
                6109
            ],
            [
                6109,
                6136
            ],
            [
                6136,
                6192
            ],
            [
                6192,
                6217
            ],
            [
                6217,
                6316
            ],
            [
                6316,
                6380
            ],
            [
                6380,
                6416
            ],
            [
                6416,
                6500
            ],
            [
                6500,
                6537
            ],
            [
                6537,
                6579
            ],
            [
                6579,
                6607
            ],
            [
                6607,
                6639
            ],
            [
                6639,
                6677
            ],
            [
                6677,
                6697
            ],
            [
                6697,
                6883
            ],
            [
                6883,
                7065
            ],
            [
                7065,
                7308
            ],
            [
                7308,
                7357
            ],
            [
                7357,
                7405
            ],
            [
                7405,
                7596
            ],
            [
                7596,
                7791
            ],
            [
                7791,
                8050
            ],
            [
                8050,
                8104
            ],
            [
                8104,
                8167
            ],
            [
                8167,
                8373
            ],
            [
                8373,
                8497
            ],
            [
                8497,
                8702
            ],
            [
                8702,
                8837
            ],
            [
                8837,
                8866
            ],
            [
                8866,
                8904
            ],
            [
                8904,
                8952
            ],
            [
                8952,
                8991
            ],
            [
                8991,
                9089
            ],
            [
                9089,
                9108
            ],
            [
                9108,
                9125
            ],
            [
                9125,
                9140
            ],
            [
                9140,
                9158
            ],
            [
                9158,
                9171
            ],
            [
                9171,
                9181
            ],
            [
                9181,
                9220
            ],
            [
                9220,
                9247
            ],
            [
                9247,
                9282
            ],
            [
                9282,
                9301
            ],
            [
                9301,
                9377
            ],
            [
                9377,
                9414
            ],
            [
                9414,
                9483
            ],
            [
                9483,
                9533
            ],
            [
                9533,
                9603
            ],
            [
                9603,
                9627
            ],
            [
                9627,
                9684
            ],
            [
                9684,
                9774
            ],
            [
                9774,
                9832
            ],
            [
                9832,
                9912
            ],
            [
                9912,
                9983
            ],
            [
                9983,
                10115
            ],
            [
                10115,
                10226
            ],
            [
                10226,
                10676
            ],
            [
                10676,
                10711
            ],
            [
                10711,
                10744
            ],
            [
                10744,
                11235
            ],
            [
                11235,
                11296
            ],
            [
                11296,
                11442
            ],
            [
                11442,
                11577
            ],
            [
                11577,
                11616
            ],
            [
                11616,
                11733
            ],
            [
                11733,
                11819
            ],
            [
                11819,
                11933
            ],
            [
                11933,
                11979
            ],
            [
                11979,
                12081
            ],
            [
                12081,
                12185
            ],
            [
                12185,
                12388
            ],
            [
                12388,
                12442
            ],
            [
                12442,
                12630
            ],
            [
                12630,
                12706
            ],
            [
                12706,
                12836
            ],
            [
                12836,
                13015
            ],
            [
                13015,
                13184
            ],
            [
                13184,
                13357
            ],
            [
                13357,
                13412
            ],
            [
                13412,
                13427
            ],
            [
                13427,
                13578
            ],
            [
                13578,
                13717
            ],
            [
                13717,
                13920
            ],
            [
                13920,
                14060
            ],
            [
                14060,
                14136
            ],
            [
                14136,
                14176
            ],
            [
                14176,
                14325
            ],
            [
                14325,
                14491
            ],
            [
                14491,
                14572
            ],
            [
                14572,
                14619
            ],
            [
                14619,
                14763
            ],
            [
                14763,
                14857
            ],
            [
                14857,
                14942
            ],
            [
                14942,
                15002
            ],
            [
                15002,
                15071
            ],
            [
                15071,
                15237
            ],
            [
                15237,
                15279
            ],
            [
                15279,
                15408
            ],
            [
                15408,
                15450
            ],
            [
                15450,
                15499
            ],
            [
                15499,
                15532
            ],
            [
                15532,
                15545
            ],
            [
                15545,
                15619
            ],
            [
                15619,
                15677
            ],
            [
                15677,
                15710
            ],
            [
                15710,
                15874
            ],
            [
                15874,
                15955
            ],
            [
                15955,
                16006
            ],
            [
                16006,
                16210
            ],
            [
                16210,
                16360
            ],
            [
                16360,
                16425
            ],
            [
                16425,
                16446
            ],
            [
                16446,
                16544
            ],
            [
                16544,
                16565
            ],
            [
                16565,
                16634
            ],
            [
                16634,
                16688
            ],
            [
                16688,
                16726
            ],
            [
                16726,
                16926
            ],
            [
                16926,
                16985
            ],
            [
                16985,
                17003
            ],
            [
                17003,
                17062
            ],
            [
                17062,
                17192
            ],
            [
                17192,
                17263
            ],
            [
                17263,
                17352
            ],
            [
                17352,
                17552
            ],
            [
                17552,
                17672
            ],
            [
                17672,
                17717
            ],
            [
                17717,
                17844
            ],
            [
                17844,
                18001
            ],
            [
                18001,
                18175
            ],
            [
                18175,
                18203
            ],
            [
                18203,
                18231
            ],
            [
                18231,
                18348
            ],
            [
                18348,
                18449
            ],
            [
                18449,
                18742
            ],
            [
                18742,
                19147
            ],
            [
                19147,
                19152
            ],
            [
                19152,
                19464
            ],
            [
                19464,
                19639
            ],
            [
                19639,
                19711
            ],
            [
                19711,
                19806
            ],
            [
                19806,
                19831
            ],
            [
                19831,
                19879
            ],
            [
                19879,
                19906
            ],
            [
                19906,
                19949
            ],
            [
                19949,
                19959
            ],
            [
                19959,
                20005
            ],
            [
                20005,
                20023
            ],
            [
                20023,
                20061
            ],
            [
                20061,
                20092
            ],
            [
                20092,
                20269
            ],
            [
                20269,
                20405
            ],
            [
                20405,
                20642
            ],
            [
                20642,
                20702
            ],
            [
                20702,
                20745
            ],
            [
                20745,
                20992
            ],
            [
                20992,
                21047
            ],
            [
                21047,
                21071
            ],
            [
                21071,
                21107
            ],
            [
                21107,
                21172
            ],
            [
                21172,
                21185
            ],
            [
                21185,
                21201
            ],
            [
                21201,
                21224
            ],
            [
                21224,
                21313
            ],
            [
                21313,
                21502
            ],
            [
                21502,
                21588
            ],
            [
                21588,
                21690
            ],
            [
                21690,
                21826
            ],
            [
                21826,
                21932
            ],
            [
                21932,
                21964
            ],
            [
                21964,
                21974
            ],
            [
                21974,
                22023
            ],
            [
                22023,
                22131
            ],
            [
                22131,
                22208
            ],
            [
                22208,
                22243
            ],
            [
                22243,
                22271
            ],
            [
                22271,
                22378
            ],
            [
                22378,
                22396
            ],
            [
                22396,
                22520
            ],
            [
                22520,
                22531
            ],
            [
                22531,
                22629
            ],
            [
                22629,
                22675
            ],
            [
                22675,
                22717
            ],
            [
                22717,
                22834
            ],
            [
                22834,
                22843
            ],
            [
                22843,
                22916
            ],
            [
                22916,
                22970
            ],
            [
                22970,
                23063
            ],
            [
                23063,
                23103
            ],
            [
                23103,
                23132
            ],
            [
                23132,
                23182
            ],
            [
                23182,
                23219
            ],
            [
                23219,
                23275
            ],
            [
                23275,
                23370
            ],
            [
                23370,
                23418
            ],
            [
                23418,
                23438
            ],
            [
                23438,
                23583
            ],
            [
                23583,
                23619
            ],
            [
                23619,
                23642
            ],
            [
                23642,
                23653
            ],
            [
                23653,
                23743
            ],
            [
                23743,
                23834
            ],
            [
                23834,
                24016
            ],
            [
                24016,
                24111
            ],
            [
                24111,
                24145
            ],
            [
                24145,
                24278
            ],
            [
                24278,
                24383
            ],
            [
                24383,
                24519
            ],
            [
                24519,
                24588
            ],
            [
                24588,
                24676
            ],
            [
                24676,
                24696
            ],
            [
                24696,
                24715
            ],
            [
                24715,
                24740
            ],
            [
                24740,
                24898
            ],
            [
                24898,
                24914
            ],
            [
                24914,
                25153
            ],
            [
                25153,
                25233
            ],
            [
                25233,
                25311
            ],
            [
                25311,
                25340
            ],
            [
                25340,
                25451
            ],
            [
                25451,
                25585
            ],
            [
                25585,
                25611
            ],
            [
                25611,
                25633
            ],
            [
                25633,
                25667
            ],
            [
                25667,
                25727
            ],
            [
                25727,
                25775
            ],
            [
                25775,
                25792
            ],
            [
                25792,
                25810
            ],
            [
                25810,
                25828
            ],
            [
                25828,
                25923
            ],
            [
                25923,
                26057
            ],
            [
                26057,
                26139
            ],
            [
                26139,
                26175
            ],
            [
                26175,
                26199
            ],
            [
                26199,
                26236
            ],
            [
                26236,
                26280
            ],
            [
                26280,
                26303
            ],
            [
                26303,
                26343
            ],
            [
                26343,
                26367
            ],
            [
                26367,
                26444
            ],
            [
                26444,
                26565
            ],
            [
                26565,
                26874
            ],
            [
                26874,
                26981
            ],
            [
                26981,
                27265
            ],
            [
                27265,
                27384
            ],
            [
                27384,
                27568
            ],
            [
                27568,
                27675
            ],
            [
                27675,
                27798
            ],
            [
                27798,
                27839
            ],
            [
                27839,
                27944
            ],
            [
                27944,
                27990
            ],
            [
                27990,
                28113
            ],
            [
                28113,
                28202
            ],
            [
                28202,
                28469
            ],
            [
                28469,
                28562
            ],
            [
                28562,
                28731
            ],
            [
                28731,
                28833
            ],
            [
                28833,
                28865
            ],
            [
                28865,
                29054
            ],
            [
                29054,
                29075
            ],
            [
                29075,
                29089
            ],
            [
                29089,
                29099
            ],
            [
                29099,
                29120
            ],
            [
                29120,
                29134
            ],
            [
                29134,
                29164
            ],
            [
                29164,
                29535
            ],
            [
                29535,
                30117
            ],
            [
                30117,
                30139
            ],
            [
                30139,
                30159
            ],
            [
                30159,
                30320
            ],
            [
                30320,
                30378
            ],
            [
                30378,
                30472
            ],
            [
                30472,
                30504
            ],
            [
                30504,
                30636
            ],
            [
                30636,
                30677
            ],
            [
                30677,
                30754
            ],
            [
                30754,
                30856
            ],
            [
                30856,
                30902
            ],
            [
                30902,
                30961
            ],
            [
                30961,
                30980
            ],
            [
                30980,
                30997
            ],
            [
                30997,
                31019
            ],
            [
                31019,
                31242
            ],
            [
                31242,
                31343
            ],
            [
                31343,
                31386
            ],
            [
                31386,
                31409
            ],
            [
                31409,
                31427
            ],
            [
                31427,
                31459
            ],
            [
                31459,
                31479
            ],
            [
                31479,
                31563
            ],
            [
                31563,
                31568
            ],
            [
                31568,
                31744
            ],
            [
                31744,
                31821
            ],
            [
                31821,
                31871
            ],
            [
                31871,
                31950
            ],
            [
                31950,
                31994
            ],
            [
                31994,
                32053
            ],
            [
                32053,
                32075
            ],
            [
                32075,
                32243
            ],
            [
                32243,
                32357
            ],
            [
                32357,
                32478
            ],
            [
                32478,
                32612
            ],
            [
                32612,
                32634
            ],
            [
                32634,
                32654
            ],
            [
                32654,
                32684
            ],
            [
                32684,
                32948
            ],
            [
                32948,
                32968
            ],
            [
                32968,
                33083
            ],
            [
                33083,
                33193
            ],
            [
                33193,
                33229
            ],
            [
                33229,
                33258
            ],
            [
                33258,
                33273
            ]
        ],
        "overlap_chars": [
            [
                0,
                52
            ],
            [
                66,
                86
            ],
            [
                91,
                110
            ],
            [
                151,
                154
            ],
            [
                155,
                166
            ],
            [
                166,
                182
            ],
            [
                194,
                220
            ],
            [
                220,
                247
            ],
            [
                334,
                335
            ],
            [
                649,
                696
            ],
            [
                696,
                742
            ],
            [
                763,
                770
            ],
            [
                833,
                856
            ],
            [
                856,
                902
            ],
            [
                904,
                941
            ],
            [
                943,
                975
            ],
            [
                1038,
                1040
            ],
            [
                999,
                1002
            ],
            [
                1025,
                1030
            ],
            [
                1088,
                1095
            ],
            [
                1085,
                1087
            ],
            [
                1190,
                1192
            ],
            [
                1330,
                1390
            ],
            [
                1406,
                1424
            ],
            [
                1424,
                1474
            ],
            [
                1474,
                1497
            ],
            [
                1498,
                1504
            ],
            [
                1521,
                1525
            ],
            [
                1624,
                1672
            ],
            [
                1686,
                1695
            ],
            [
                1581,
                1586
            ],
            [
                1716,
                1738
            ],
            [
                1796,
                1809
            ],
            [
                1814,
                1826
            ],
            [
                1738,
                1748
            ],
            [
                1855,
                1878
            ],
            [
                1890,
                1892
            ],
            [
                1892,
                1938
            ],
            [
                2041,
                2042
            ],
            [
                1940,
                1978
            ],
            [
                2152,
                2154
            ],
            [
                2154,
                2176
            ],
            [
                2186,
                2220
            ],
            [
                2222,
                2230
            ],
            [
                2243,
                2312
            ],
            [
                2358,
                2436
            ],
            [
                2450,
                2469
            ],
            [
                2474,
                2502
            ],
            [
                2511,
                2525
            ],
            [
                2563,
                2689
            ],
            [
                2525,
                2526
            ],
            [
                2720,
                2765
            ],
            [
                2766,
                2775
            ],
            [
                2798,
                2823
            ],
            [
                2877,
                2879
            ],
            [
                2879,
                2890
            ],
            [
                2895,
                2914
            ],
            [
                2940,
                2965
            ],
            [
                2915,
                2928
            ],
            [
                2991,
                2992
            ],
            [
                2972,
                2974
            ],
            [
                3057,
                3059
            ],
            [
                3059,
                3100
            ],
            [
                3100,
                3116
            ],
            [
                3116,
                3125
            ],
            [
                3125,
                3139
            ],
            [
                3139,
                3188
            ],
            [
                3238,
                3257
            ],
            [
                3261,
                3283
            ],
            [
                3323,
                3374
            ],
            [
                3376,
                3421
            ],
            [
                3423,
                3479
            ],
            [
                3496,
                3537
            ],
            [
                3551,
                3554
            ],
            [
                3699,
                3742
            ],
            [
                3753,
                3757
            ],
            [
                3776,
                3795
            ],
            [
                3814,
                3816
            ],
            [
                3834,
                3835
            ],
            [
                3796,
                3799
            ],
            [
                3836,
                3855
            ],
            [
                3866,
                3879
            ],
            [
                3879,
                3884
            ],
            [
                3943,
                3945
            ],
            [
                3945,
                3988
            ],
            [
                3994,
                4003
            ],
            [
                4028,
                4030
            ],
            [
                4103,
                4132
            ],
            [
                4137,
                4139
            ],
            [
                4139,
                4148
            ],
            [
                4152,
                4181
            ],
            [
                4204,
                4206
            ],
            [
                4206,
                4228
            ],
            [
                4228,
                4268
            ],
            [
                4268,
                4284
            ],
            [
                4284,
                4295
            ],
            [
                4351,
                4373
            ],
            [
                4373,
                4457
            ],
            [
                4457,
                4503
            ],
            [
                4515,
                4528
            ],
            [
                4564,
                4575
            ],
            [
                4528,
                4531
            ],
            [
                4578,
                4641
            ],
            [
                4657,
                4699
            ],
            [
                4651,
                4652
            ],
            [
                4814,
                4818
            ],
            [
                4801,
                4809
            ],
            [
                4823,
                4840
            ],
            [
                4841,
                4854
            ],
            [
                4858,
                4866
            ],
            [
                4855,
                4857
            ],
            [
                4883,
                4892
            ],
            [
                4902,
                4908
            ],
            [
                4910,
                4935
            ],
            [
                4935,
                4962
            ],
            [
                4962,
                4968
            ],
            [
                4976,
                4978
            ],
            [
                4978,
                4982
            ],
            [
                4982,
                4999
            ],
            [
                5046,
                5054
            ],
            [
                5091,
                5121
            ],
            [
                5153,
                5185
            ],
            [
                5185,
                5187
            ],
            [
                5187,
                5228
            ],
            [
                5271,
                5296
            ],
            [
                5296,
                5310
            ],
            [
                5310,
                5347
            ],
            [
                5347,
                5368
            ],
            [
                5368,
                5432
            ],
            [
                5432,
                5435
            ],
            [
                5470,
                5484
            ],
            [
                5484,
                5498
            ],
            [
                5525,
                5546
            ],
            [
                5571,
                5572
            ],
            [
                5573,
                5574
            ],
            [
                5580,
                5588
            ],
            [
                5648,
                5654
            ],
            [
                5589,
                5596
            ],
            [
                5675,
                5677
            ],
            [
                5789,
                5796
            ],
            [
                5800,
                5837
            ],
            [
                5931,
                5934
            ],
            [
                5962,
                6007
            ],
            [
                6007,
                6013
            ],
            [
                6013,
                6059
            ],
            [
                6077,
                6084
            ],
            [
                6074,
                6076
            ],
            [
                6085,
                6086
            ],
            [
                6092,
                6102
            ],
            [
                6136,
                6140
            ],
            [
                6155,
                6192
            ],
            [
                6192,
                6205
            ],
            [
                6214,
                6217
            ],
            [
                6217,
                6288
            ],
            [
                6299,
                6316
            ],
            [
                6316,
                6378
            ],
            [
                6393,
                6416
            ],
            [
                6416,
                6464
            ],
            [
                6498,
                6500
            ],
            [
                6500,
                6535
            ],
            [
                6579,
                6607
            ],
            [
                6697,
                6739
            ],
            [
                6739,
                6740
            ],
            [
                6741,
                6744
            ],
            [
                6757,
                6793
            ],
            [
                6881,
                6883
            ],
            [
                6883,
                6889
            ],
            [
                6978,
                7065
            ],
            [
                7065,
                7093
            ],
            [
                7135,
                7136
            ],
            [
                7150,
                7163
            ],
            [
                7171,
                7181
            ],
            [
                7188,
                7204
            ],
            [
                7215,
                7231
            ],
            [
                7261,
                7288
            ],
            [
                7298,
                7308
            ],
            [
                7308,
                7309
            ],
            [
                7326,
                7334
            ],
            [
                7347,
                7357
            ],
            [
                7357,
                7405
            ],
            [
                7405,
                7454
            ],
            [
                7598,
                7614
            ],
            [
                7518,
                7519
            ],
            [
                7621,
                7674
            ],
            [
                7594,
                7595
            ],
            [
                7676,
                7692
            ],
            [
                7752,
                7764
            ],
            [
                7774,
                7791
            ],
            [
                7791,
                7949
            ],
            [
                8047,
                8050
            ],
            [
                8050,
                8051
            ],
            [
                8180,
                8185
            ],
            [
                8076,
                8078
            ],
            [
                8084,
                8102
            ],
            [
                8054,
                8055
            ],
            [
                8104,
                8105
            ],
            [
                8196,
                8318
            ],
            [
                8138,
                8143
            ],
            [
                8344,
                8373
            ],
            [
                8373,
                8383
            ],
            [
                8394,
                8497
            ],
            [
                8497,
                8518
            ],
            [
                8519,
                8534
            ],
            [
                8543,
                8565
            ],
            [
                8577,
                8662
            ],
            [
                8693,
                8695
            ],
            [
                8700,
                8702
            ],
            [
                8702,
                8791
            ],
            [
                8810,
                8813
            ],
            [
                8835,
                8837
            ],
            [
                8837,
                8841
            ],
            [
                8853,
                8864
            ],
            [
                8991,
                9008
            ],
            [
                9010,
                9042
            ],
            [
                9092,
                9108
            ],
            [
                9108,
                9125
            ],
            [
                9140,
                9158
            ],
            [
                9158,
                9171
            ],
            [
                9171,
                9181
            ],
            [
                9181,
                9206
            ],
            [
                9218,
                9220
            ],
            [
                9220,
                9247
            ],
            [
                9247,
                9282
            ],
            [
                9282,
                9301
            ],
            [
                9301,
                9308
            ],
            [
                9329,
                9340
            ],
            [
                9356,
                9377
            ],
            [
                9377,
                9378
            ],
            [
                9379,
                9382
            ],
            [
                9384,
                9414
            ],
            [
                9414,
                9444
            ],
            [
                9459,
                9460
            ],
            [
                9462,
                9465
            ],
            [
                9467,
                9483
            ],
            [
                9483,
                9495
            ],
            [
                9501,
                9533
            ],
            [
                9563,
                9603
            ],
            [
                9603,
                9627
            ],
            [
                9684,
                9716
            ],
            [
                9716,
                9717
            ],
            [
                9718,
                9722
            ],
            [
                9734,
                9761
            ],
            [
                9772,
                9774
            ],
            [
                9774,
                9804
            ],
            [
                9838,
                9868
            ],
            [
                9880,
                9912
            ],
            [
                9912,
                9983
            ],
            [
                10087,
                10105
            ],
            [
                10118,
                10130
            ],
            [
                10029,
                10038
            ],
            [
                10135,
                10149
            ],
            [
                10224,
                10226
            ],
            [
                10226,
                10250
            ],
            [
                10584,
                10589
            ],
            [
                10331,
                10392
            ],
            [
                10415,
                10434
            ],
            [
                10477,
                10480
            ],
            [
                10657,
                10661
            ],
            [
                10481,
                10485
            ],
            [
                10674,
                10676
            ],
            [
                10676,
                10711
            ],
            [
                10711,
                10742
            ],
            [
                10893,
                10936
            ],
            [
                10945,
                10961
            ],
            [
                10819,
                10821
            ],
            [
                10980,
                10988
            ],
            [
                11192,
                11235
            ],
            [
                11235,
                11296
            ],
            [
                11296,
                11343
            ],
            [
                11387,
                11399
            ],
            [
                11431,
                11435
            ],
            [
                11440,
                11442
            ],
            [
                11442,
                11535
            ],
            [
                11570,
                11577
            ],
            [
                11577,
                11616
            ],
            [
                11616,
                11733
            ],
            [
                11979,
                12004
            ],
            [
                12019,
                12030
            ],
            [
                12032,
                12081
            ],
            [
                12173,
                12183
            ],
            [
                12183,
                12185
            ],
            [
                12185,
                12209
            ],
            [
                12237,
                12252
            ],
            [
                12210,
                12236
            ],
            [
                12252,
                12257
            ],
            [
                12271,
                12272
            ],
            [
                12258,
                12261
            ],
            [
                12363,
                12374
            ],
            [
                12383,
                12388
            ],
            [
                12388,
                12442
            ],
            [
                12442,
                12473
            ],
            [
                12600,
                12606
            ],
            [
                12628,
                12630
            ],
            [
                12630,
                12642
            ],
            [
                12704,
                12706
            ],
            [
                12706,
                12759
            ],
            [
                12766,
                12769
            ],
            [
                12760,
                12765
            ],
            [
                12770,
                12808
            ],
            [
                12826,
                12835
            ],
            [
                13184,
                13239
            ],
            [
                13241,
                13268
            ],
            [
                13276,
                13302
            ],
            [
                13342,
                13357
            ],
            [
                13357,
                13412
            ],
            [
                13962,
                13965
            ],
            [
                13717,
                13753
            ],
            [
                13853,
                13857
            ],
            [
                14145,
                14150
            ],
            [
                14162,
                14176
            ],
            [
                14176,
                14231
            ],
            [
                14256,
                14281
            ],
            [
                14252,
                14255
            ],
            [
                14317,
                14323
            ],
            [
                14232,
                14235
            ],
            [
                14244,
                14251
            ],
            [
                14323,
                14325
            ],
            [
                14325,
                14329
            ],
            [
                14430,
                14437
            ],
            [
                14444,
                14491
            ],
            [
                14491,
                14492
            ],
            [
                14515,
                14552
            ],
            [
                14570,
                14572
            ],
            [
                14572,
                14619
            ],
            [
                14698,
                14753
            ],
            [
                14761,
                14762
            ],
            [
                14857,
                14914
            ],
            [
                14932,
                14942
            ],
            [
                15002,
                15018
            ],
            [
                15028,
                15057
            ],
            [
                15069,
                15071
            ],
            [
                15071,
                15110
            ],
            [
                15112,
                15166
            ],
            [
                15168,
                15210
            ],
            [
                15234,
                15237
            ],
            [
                15237,
                15264
            ],
            [
                15277,
                15279
            ],
            [
                15279,
                15298
            ],
            [
                15300,
                15303
            ],
            [
                15305,
                15311
            ],
            [
                15356,
                15360
            ],
            [
                15362,
                15365
            ],
            [
                15367,
                15408
            ],
            [
                15408,
                15449
            ],
            [
                15499,
                15531
            ],
            [
                15532,
                15544
            ],
            [
                15545,
                15619
            ],
            [
                15619,
                15624
            ],
            [
                15650,
                15676
            ],
            [
                15677,
                15710
            ],
            [
                15710,
                15824
            ],
            [
                15841,
                15873
            ],
            [
                15874,
                15904
            ],
            [
                15955,
                15958
            ],
            [
                15910,
                15912
            ],
            [
                16006,
                16100
            ],
            [
                16130,
                16136
            ],
            [
                15932,
                15933
            ],
            [
                16146,
                16170
            ],
            [
                16142,
                16145
            ],
            [
                16179,
                16195
            ],
            [
                16202,
                16210
            ],
            [
                16251,
                16307
            ],
            [
                16358,
                16360
            ],
            [
                16360,
                16403
            ],
            [
                16420,
                16425
            ],
            [
                16425,
                16446
            ],
            [
                16462,
                16477
            ],
            [
                16460,
                16461
            ],
            [
                16478,
                16523
            ],
            [
                16542,
                16544
            ],
            [
                16544,
                16565
            ],
            [
                16565,
                16593
            ],
            [
                16634,
                16637
            ],
            [
                16688,
                16726
            ],
            [
                16726,
                16926
            ],
            [
                16926,
                16954
            ],
            [
                16982,
                16985
            ],
            [
                16985,
                17003
            ],
            [
                17062,
                17109
            ],
            [
                17128,
                17170
            ],
            [
                17189,
                17192
            ],
            [
                17192,
                17261
            ],
            [
                17352,
                17392
            ],
            [
                17415,
                17417
            ],
            [
                17421,
                17446
            ],
            [
                17468,
                17475
            ],
            [
                17476,
                17503
            ],
            [
                17549,
                17552
            ],
            [
                17552,
                17613
            ],
            [
                17615,
                17628
            ],
            [
                17670,
                17672
            ],
            [
                17672,
                17714
            ],
            [
                17845,
                17880
            ],
            [
                17899,
                17916
            ],
            [
                17926,
                17936
            ],
            [
                17975,
                17993
            ],
            [
                17895,
                17898
            ],
            [
                17994,
                18001
            ],
            [
                18001,
                18011
            ],
            [
                18019,
                18038
            ],
            [
                18074,
                18078
            ],
            [
                18043,
                18053
            ],
            [
                18101,
                18175
            ],
            [
                18175,
                18180
            ],
            [
                18182,
                18203
            ],
            [
                18231,
                18277
            ],
            [
                18331,
                18346
            ],
            [
                18279,
                18288
            ],
            [
                18277,
                18278
            ],
            [
                18375,
                18376
            ],
            [
                18415,
                18449
            ],
            [
                18449,
                18475
            ],
            [
                18518,
                18552
            ],
            [
                18661,
                18680
            ],
            [
                18688,
                18742
            ],
            [
                18742,
                18812
            ],
            [
                18814,
                18817
            ],
            [
                18819,
                18848
            ],
            [
                18850,
                18853
            ],
            [
                18879,
                18914
            ],
            [
                18937,
                18947
            ],
            [
                18984,
                18987
            ],
            [
                18989,
                19002
            ],
            [
                19025,
                19061
            ],
            [
                19072,
                19103
            ],
            [
                19145,
                19147
            ],
            [
                19147,
                19152
            ],
            [
                19152,
                19220
            ],
            [
                19236,
                19243
            ],
            [
                19259,
                19322
            ],
            [
                19335,
                19351
            ],
            [
                19226,
                19227
            ],
            [
                19353,
                19387
            ],
            [
                19331,
                19334
            ],
            [
                19400,
                19464
            ],
            [
                19464,
                19466
            ],
            [
                19500,
                19535
            ],
            [
                19540,
                19548
            ],
            [
                19578,
                19637
            ],
            [
                19728,
                19763
            ],
            [
                19769,
                19778
            ],
            [
                19792,
                19806
            ],
            [
                19806,
                19819
            ],
            [
                19828,
                19831
            ],
            [
                19831,
                19879
            ],
            [
                19879,
                19906
            ],
            [
                19906,
                19922
            ],
            [
                19947,
                19949
            ],
            [
                20005,
                20023
            ],
            [
                20023,
                20061
            ],
            [
                20092,
                20127
            ],
            [
                20129,
                20133
            ],
            [
                20208,
                20209
            ],
            [
                20145,
                20163
            ],
            [
                20194,
                20195
            ],
            [
                20196,
                20208
            ],
            [
                20267,
                20269
            ],
            [
                20269,
                20270
            ],
            [
                20278,
                20288
            ],
            [
                20301,
                20310
            ],
            [
                20317,
                20363
            ],
            [
                20379,
                20383
            ],
            [
                20388,
                20405
            ],
            [
                20448,
                20462
            ],
            [
                20484,
                20500
            ],
            [
                20470,
                20474
            ],
            [
                20500,
                20523
            ],
            [
                20539,
                20617
            ],
            [
                20640,
                20642
            ],
            [
                20642,
                20650
            ],
            [
                20692,
                20700
            ],
            [
                20671,
                20677
            ],
            [
                20700,
                20702
            ],
            [
                20702,
                20745
            ],
            [
                20745,
                20806
            ],
            [
                20838,
                20856
            ],
            [
                20875,
                20876
            ],
            [
                20927,
                20992
            ],
            [
                20992,
                21047
            ],
            [
                21047,
                21069
            ],
            [
                21107,
                21115
            ],
            [
                21139,
                21145
            ],
            [
                21149,
                21172
            ],
            [
                21172,
                21185
            ],
            [
                21185,
                21201
            ],
            [
                21201,
                21224
            ],
            [
                21224,
                21230
            ],
            [
                21254,
                21268
            ],
            [
                21286,
                21313
            ],
            [
                21313,
                21322
            ],
            [
                21333,
                21444
            ],
            [
                21469,
                21478
            ],
            [
                21487,
                21502
            ],
            [
                21502,
                21538
            ],
            [
                21559,
                21567
            ],
            [
                21579,
                21588
            ],
            [
                21588,
                21652
            ],
            [
                21675,
                21679
            ],
            [
                21688,
                21690
            ],
            [
                21690,
                21748
            ],
            [
                21755,
                21761
            ],
            [
                21772,
                21774
            ],
            [
                21777,
                21793
            ],
            [
                21824,
                21826
            ],
            [
                21838,
                21857
            ],
            [
                21866,
                21932
            ],
            [
                21932,
                21964
            ],
            [
                21964,
                21974
            ],
            [
                21974,
                22023
            ],
            [
                22095,
                22096
            ],
            [
                22103,
                22106
            ],
            [
                22035,
                22053
            ],
            [
                22129,
                22131
            ],
            [
                22131,
                22134
            ],
            [
                22142,
                22164
            ],
            [
                22181,
                22208
            ],
            [
                22216,
                22243
            ],
            [
                22243,
                22244
            ],
            [
                22246,
                22248
            ],
            [
                22250,
                22256
            ],
            [
                22271,
                22354
            ],
            [
                22376,
                22378
            ],
            [
                22378,
                22396
            ],
            [
                22465,
                22482
            ],
            [
                22506,
                22518
            ],
            [
                22520,
                22531
            ],
            [
                22531,
                22582
            ],
            [
                22629,
                22654
            ],
            [
                22673,
                22675
            ],
            [
                22675,
                22682
            ],
            [
                22699,
                22707
            ],
            [
                22715,
                22717
            ],
            [
                22717,
                22724
            ],
            [
                22740,
                22834
            ],
            [
                22834,
                22843
            ],
            [
                22843,
                22878
            ],
            [
                22949,
                22970
            ],
            [
                22970,
                22977
            ],
            [
                23023,
                23034
            ],
            [
                23040,
                23063
            ],
            [
                23080,
                23103
            ],
            [
                23103,
                23118
            ],
            [
                23122,
                23132
            ],
            [
                23132,
                23138
            ],
            [
                23163,
                23167
            ],
            [
                23140,
                23161
            ],
            [
                23180,
                23182
            ],
            [
                23182,
                23219
            ],
            [
                23219,
                23228
            ],
            [
                23232,
                23239
            ],
            [
                23243,
                23275
            ],
            [
                23297,
                23363
            ],
            [
                23365,
                23370
            ],
            [
                23370,
                23394
            ],
            [
                23400,
                23418
            ],
            [
                23418,
                23438
            ],
            [
                23438,
                23474
            ],
            [
                23474,
                23479
            ],
            [
                23535,
                23542
            ],
            [
                23484,
                23494
            ],
            [
                23562,
                23563
            ],
            [
                23495,
                23500
            ],
            [
                23516,
                23534
            ],
            [
                23543,
                23556
            ],
            [
                23573,
                23583
            ],
            [
                23583,
                23619
            ],
            [
                23642,
                23653
            ],
            [
                23700,
                23743
            ],
            [
                23743,
                23766
            ],
            [
                23775,
                23825
            ],
            [
                23826,
                23834
            ],
            [
                23847,
                23944
            ],
            [
                23986,
                24015
            ],
            [
                24016,
                24057
            ],
            [
                24067,
                24111
            ],
            [
                24111,
                24144
            ],
            [
                24278,
                24383
            ],
            [
                24383,
                24420
            ],
            [
                24433,
                24447
            ],
            [
                24461,
                24487
            ],
            [
                24517,
                24519
            ],
            [
                24519,
                24539
            ],
            [
                24554,
                24555
            ],
            [
                24560,
                24588
            ],
            [
                24588,
                24637
            ],
            [
                24663,
                24676
            ],
            [
                24676,
                24696
            ],
            [
                24696,
                24702
            ],
            [
                24723,
                24740
            ],
            [
                24745,
                24764
            ],
            [
                24783,
                24811
            ],
            [
                24842,
                24858
            ],
            [
                24862,
                24877
            ],
            [
                24912,
                24914
            ],
            [
                24914,
                24940
            ],
            [
                25042,
                25043
            ],
            [
                24981,
                25037
            ],
            [
                25039,
                25042
            ],
            [
                25044,
                25059
            ],
            [
                25079,
                25084
            ],
            [
                25090,
                25104
            ],
            [
                25116,
                25153
            ],
            [
                25185,
                25233
            ],
            [
                25233,
                25276
            ],
            [
                25309,
                25311
            ],
            [
                25311,
                25340
            ],
            [
                25382,
                25389
            ],
            [
                25348,
                25377
            ],
            [
                25424,
                25430
            ],
            [
                25403,
                25420
            ],
            [
                25431,
                25436
            ],
            [
                25445,
                25451
            ],
            [
                25451,
                25559
            ],
            [
                25568,
                25585
            ],
            [
                25585,
                25611
            ],
            [
                25611,
                25633
            ],
            [
                25633,
                25634
            ],
            [
                25639,
                25667
            ],
            [
                25672,
                25677
            ],
            [
                25689,
                25705
            ],
            [
                25713,
                25727
            ],
            [
                25921,
                25923
            ],
            [
                25923,
                25931
            ],
            [
                25952,
                25996
            ],
            [
                26011,
                26057
            ],
            [
                26057,
                26072
            ],
            [
                26139,
                26175
            ],
            [
                26199,
                26224
            ],
            [
                26234,
                26236
            ],
            [
                26236,
                26280
            ],
            [
                26281,
                26299
            ],
            [
                26303,
                26343
            ],
            [
                26367,
                26388
            ],
            [
                26409,
                26444
            ],
            [
                26444,
                26469
            ],
            [
                26475,
                26491
            ],
            [
                26565,
                26601
            ],
            [
                26701,
                26702
            ],
            [
                26603,
                26624
            ],
            [
                26774,
                26775
            ],
            [
                26625,
                26629
            ],
            [
                26842,
                26874
            ],
            [
                26874,
                26883
            ],
            [
                26898,
                26935
            ],
            [
                26979,
                26981
            ],
            [
                26981,
                26996
            ],
            [
                27004,
                27028
            ],
            [
                27106,
                27109
            ],
            [
                27028,
                27029
            ],
            [
                27154,
                27167
            ],
            [
                27181,
                27200
            ],
            [
                26999,
                27003
            ],
            [
                27212,
                27236
            ],
            [
                27246,
                27265
            ],
            [
                27265,
                27369
            ],
            [
                27379,
                27384
            ],
            [
                27384,
                27422
            ],
            [
                27424,
                27428
            ],
            [
                27447,
                27455
            ],
            [
                27462,
                27537
            ],
            [
                27545,
                27568
            ],
            [
                27568,
                27623
            ],
            [
                27627,
                27641
            ],
            [
                27662,
                27675
            ],
            [
                27798,
                27805
            ],
            [
                27811,
                27820
            ],
            [
                27822,
                27839
            ],
            [
                27839,
                27874
            ],
            [
                27893,
                27944
            ],
            [
                27944,
                27990
            ],
            [
                27990,
                28033
            ],
            [
                28083,
                28113
            ],
            [
                28113,
                28165
            ],
            [
                28184,
                28195
            ],
            [
                28451,
                28453
            ],
            [
                28353,
                28357
            ],
            [
                28171,
                28174
            ],
            [
                28298,
                28301
            ],
            [
                28230,
                28235
            ],
            [
                28391,
                28400
            ],
            [
                28416,
                28419
            ],
            [
                28425,
                28429
            ],
            [
                28467,
                28469
            ],
            [
                28469,
                28562
            ],
            [
                28562,
                28564
            ],
            [
                28571,
                28631
            ],
            [
                28633,
                28645
            ],
            [
                28672,
                28675
            ],
            [
                28701,
                28704
            ],
            [
                28729,
                28731
            ],
            [
                28760,
                28766
            ],
            [
                28743,
                28759
            ],
            [
                28767,
                28781
            ],
            [
                28801,
                28804
            ],
            [
                28813,
                28819
            ],
            [
                28824,
                28833
            ],
            [
                28885,
                28887
            ],
            [
                28897,
                28945
            ],
            [
                28893,
                28895
            ],
            [
                28949,
                28980
            ],
            [
                28991,
                29010
            ],
            [
                29052,
                29054
            ],
            [
                29054,
                29075
            ],
            [
                29075,
                29089
            ],
            [
                29089,
                29099
            ],
            [
                29099,
                29120
            ],
            [
                29120,
                29127
            ],
            [
                29129,
                29131
            ],
            [
                29132,
                29134
            ],
            [
                29134,
                29164
            ],
            [
                29164,
                29172
            ],
            [
                29240,
                29261
            ],
            [
                29303,
                29307
            ],
            [
                29265,
                29284
            ],
            [
                29172,
                29173
            ],
            [
                29215,
                29221
            ],
            [
                29315,
                29321
            ],
            [
                29350,
                29352
            ],
            [
                29363,
                29373
            ],
            [
                29446,
                29450
            ],
            [
                29360,
                29362
            ],
            [
                29185,
                29188
            ],
            [
                29418,
                29422
            ],
            [
                29430,
                29432
            ],
            [
                29453,
                29496
            ],
            [
                29502,
                29510
            ],
            [
                29515,
                29535
            ],
            [
                29535,
                29537
            ],
            [
                29556,
                29577
            ],
            [
                29639,
                29649
            ],
            [
                29614,
                29630
            ],
            [
                29602,
                29605
            ],
            [
                29687,
                29710
            ],
            [
                30000,
                30005
            ],
            [
                29720,
                29739
            ],
            [
                29782,
                29837
            ],
            [
                29850,
                29865
            ],
            [
                29936,
                29964
            ],
            [
                29980,
                29992
            ],
            [
                30019,
                30027
            ],
            [
                30043,
                30052
            ],
            [
                30097,
                30113
            ],
            [
                30117,
                30118
            ],
            [
                30122,
                30139
            ],
            [
                30139,
                30159
            ],
            [
                30320,
                30378
            ],
            [
                30378,
                30472
            ],
            [
                30472,
                30504
            ],
            [
                30504,
                30530
            ],
            [
                30576,
                30599
            ],
            [
                30610,
                30636
            ],
            [
                30636,
                30637
            ],
            [
                30640,
                30655
            ],
            [
                30665,
                30677
            ],
            [
                30677,
                30684
            ],
            [
                30693,
                30698
            ],
            [
                30732,
                30754
            ],
            [
                30771,
                30792
            ],
            [
                30828,
                30835
            ],
            [
                30856,
                30885
            ],
            [
                30900,
                30902
            ],
            [
                30902,
                30961
            ],
            [
                30987,
                30995
            ],
            [
                30985,
                30986
            ],
            [
                30997,
                31019
            ],
            [
                31062,
                31079
            ],
            [
                31102,
                31161
            ],
            [
                31343,
                31386
            ],
            [
                31386,
                31409
            ],
            [
                31409,
                31427
            ],
            [
                31427,
                31459
            ],
            [
                31459,
                31479
            ],
            [
                31479,
                31548
            ],
            [
                31560,
                31563
            ],
            [
                31563,
                31568
            ],
            [
                31568,
                31618
            ],
            [
                31629,
                31686
            ],
            [
                31693,
                31694
            ],
            [
                31741,
                31744
            ],
            [
                31744,
                31745
            ],
            [
                31749,
                31821
            ],
            [
                31821,
                31871
            ],
            [
                31871,
                31950
            ],
            [
                31950,
                31977
            ],
            [
                31978,
                31994
            ],
            [
                31994,
                32053
            ],
            [
                32075,
                32178
            ],
            [
                32210,
                32243
            ],
            [
                32243,
                32283
            ],
            [
                32295,
                32357
            ],
            [
                32357,
                32407
            ],
            [
                32409,
                32413
            ],
            [
                32415,
                32465
            ],
            [
                32475,
                32478
            ],
            [
                32478,
                32560
            ],
            [
                32563,
                32578
            ],
            [
                32580,
                32590
            ],
            [
                32594,
                32612
            ],
            [
                32612,
                32634
            ],
            [
                32634,
                32654
            ],
            [
                32654,
                32684
            ],
            [
                32684,
                32763
            ],
            [
                32946,
                32947
            ],
            [
                32910,
                32911
            ],
            [
                32784,
                32802
            ],
            [
                32806,
                32907
            ],
            [
                32914,
                32929
            ],
            [
                32932,
                32946
            ],
            [
                32968,
                33013
            ],
            [
                33022,
                33081
            ],
            [
                33176,
                33179
            ],
            [
                33116,
                33175
            ],
            [
                33081,
                33082
            ],
            [
                33193,
                33229
            ],
            [
                33229,
                33258
            ],
            [
                33258,
                33273
            ]
        ],
        "row_chars": [
            [
                0,
                166
            ],
            [
                166,
                220
            ],
            [
                220,
                336
            ],
            [
                336,
                551
            ],
            [
                551,
                649
            ],
            [
                649,
                696
            ],
            [
                696,
                856
            ],
            [
                856,
                1192
            ],
            [
                1192,
                1424
            ],
            [
                1424,
                1474
            ],
            [
                1474,
                1738
            ],
            [
                1738,
                1892
            ],
            [
                1892,
                2154
            ],
            [
                2154,
                2312
            ],
            [
                2312,
                2358
            ],
            [
                2358,
                2766
            ],
            [
                2766,
                2879
            ],
            [
                2879,
                3059
            ],
            [
                3059,
                3100
            ],
            [
                3100,
                3116
            ],
            [
                3116,
                3125
            ],
            [
                3125,
                3139
            ],
            [
                3139,
                3188
            ],
            [
                3188,
                3238
            ],
            [
                3238,
                3496
            ],
            [
                3496,
                3554
            ],
            [
                3554,
                3699
            ],
            [
                3699,
                3742
            ],
            [
                3742,
                3879
            ],
            [
                3879,
                3945
            ],
            [
                3945,
                4030
            ],
            [
                4030,
                4054
            ],
            [
                4054,
                4096
            ],
            [
                4096,
                4102
            ],
            [
                4102,
                4139
            ],
            [
                4139,
                4206
            ],
            [
                4206,
                4228
            ],
            [
                4228,
                4268
            ],
            [
                4268,
                4284
            ],
            [
                4284,
                4373
            ],
            [
                4373,
                4457
            ],
            [
                4457,
                4528
            ],
            [
                4528,
                4641
            ],
            [
                4641,
                4841
            ],
            [
                4841,
                4935
            ],
            [
                4935,
                4962
            ],
            [
                4962,
                4978
            ],
            [
                4978,
                4982
            ],
            [
                4982,
                5002
            ],
            [
                5002,
                5045
            ],
            [
                5045,
                5054
            ],
            [
                5054,
                5060
            ],
            [
                5060,
                5091
            ],
            [
                5091,
                5121
            ],
            [
                5121,
                5153
            ],
            [
                5153,
                5187
            ],
            [
                5187,
                5228
            ],
            [
                5228,
                5271
            ],
            [
                5271,
                5296
            ],
            [
                5296,
                5310
            ],
            [
                5310,
                5347
            ],
            [
                5347,
                5368
            ],
            [
                5368,
                5432
            ],
            [
                5432,
                5484
            ],
            [
                5484,
                5500
            ],
            [
                5500,
                5525
            ],
            [
                5525,
                5677
            ],
            [
                5677,
                5735
            ],
            [
                5735,
                5754
            ],
            [
                5754,
                5800
            ],
            [
                5800,
                5872
            ],
            [
                5872,
                5881
            ],
            [
                5881,
                5896
            ],
            [
                5896,
                5925
            ],
            [
                5925,
                6007
            ],
            [
                6007,
                6013
            ],
            [
                6013,
                6109
            ],
            [
                6109,
                6136
            ],
            [
                6136,
                6192
            ],
            [
                6192,
                6217
            ],
            [
                6217,
                6316
            ],
            [
                6316,
                6416
            ],
            [
                6416,
                6500
            ],
            [
                6500,
                6537
            ],
            [
                6537,
                6579
            ],
            [
                6579,
                6607
            ],
            [
                6607,
                6639
            ],
            [
                6639,
                6677
            ],
            [
                6677,
                6697
            ],
            [
                6697,
                6883
            ],
            [
                6883,
                7065
            ],
            [
                7065,
                7308
            ],
            [
                7308,
                7357
            ],
            [
                7357,
                7405
            ],
            [
                7405,
                7791
            ],
            [
                7791,
                8050
            ],
            [
                8050,
                8373
            ],
            [
                8373,
                8497
            ],
            [
                8497,
                8702
            ],
            [
                8702,
                8837
            ],
            [
                8837,
                8866
            ],
            [
                8866,
                8904
            ],
            [
                8904,
                8952
            ],
            [
                8952,
                8991
            ],
            [
                8991,
                9108
            ],
            [
                9108,
                9125
            ],
            [
                9125,
                9140
            ],
            [
                9140,
                9158
            ],
            [
                9158,
                9171
            ],
            [
                9171,
                9181
            ],
            [
                9181,
                9220
            ],
            [
                9220,
                9247
            ],
            [
                9247,
                9282
            ],
            [
                9282,
                9301
            ],
            [
                9301,
                9377
            ],
            [
                9377,
                9414
            ],
            [
                9414,
                9483
            ],
            [
                9483,
                9533
            ],
            [
                9533,
                9603
            ],
            [
                9603,
                9627
            ],
            [
                9627,
                9684
            ],
            [
                9684,
                9774
            ],
            [
                9774,
                9912
            ],
            [
                9912,
                9983
            ],
            [
                9983,
                10226
            ],
            [
                10226,
                10676
            ],
            [
                10676,
                10711
            ],
            [
                10711,
                11235
            ],
            [
                11235,
                11296
            ],
            [
                11296,
                11442
            ],
            [
                11442,
                11577
            ],
            [
                11577,
                11616
            ],
            [
                11616,
                11733
            ],
            [
                11733,
                11819
            ],
            [
                11819,
                11933
            ],
            [
                11933,
                11979
            ],
            [
                11979,
                12081
            ],
            [
                12081,
                12185
            ],
            [
                12185,
                12388
            ],
            [
                12388,
                12442
            ],
            [
                12442,
                12630
            ],
            [
                12630,
                12706
            ],
            [
                12706,
                12836
            ],
            [
                12836,
                13015
            ],
            [
                13015,
                13184
            ],
            [
                13184,
                13357
            ],
            [
                13357,
                13412
            ],
            [
                13412,
                13427
            ],
            [
                13427,
                13578
            ],
            [
                13578,
                13717
            ],
            [
                13717,
                14176
            ],
            [
                14176,
                14325
            ],
            [
                14325,
                14491
            ],
            [
                14491,
                14572
            ],
            [
                14572,
                14619
            ],
            [
                14619,
                14763
            ],
            [
                14763,
                14857
            ],
            [
                14857,
                14942
            ],
            [
                14942,
                15002
            ],
            [
                15002,
                15071
            ],
            [
                15071,
                15237
            ],
            [
                15237,
                15279
            ],
            [
                15279,
                15408
            ],
            [
                15408,
                15450
            ],
            [
                15450,
                15499
            ],
            [
                15499,
                15532
            ],
            [
                15532,
                15545
            ],
            [
                15545,
                15619
            ],
            [
                15619,
                15677
            ],
            [
                15677,
                15710
            ],
            [
                15710,
                15874
            ],
            [
                15874,
                16210
            ],
            [
                16210,
                16360
            ],
            [
                16360,
                16425
            ],
            [
                16425,
                16446
            ],
            [
                16446,
                16544
            ],
            [
                16544,
                16565
            ],
            [
                16565,
                16726
            ],
            [
                16726,
                16926
            ],
            [
                16926,
                16985
            ],
            [
                16985,
                17003
            ],
            [
                17003,
                17062
            ],
            [
                17062,
                17192
            ],
            [
                17192,
                17263
            ],
            [
                17263,
                17352
            ],
            [
                17352,
                17552
            ],
            [
                17552,
                17672
            ],
            [
                17672,
                17717
            ],
            [
                17717,
                17844
            ],
            [
                17844,
                18001
            ],
            [
                18001,
                18175
            ],
            [
                18175,
                18203
            ],
            [
                18203,
                18231
            ],
            [
                18231,
                18449
            ],
            [
                18449,
                18742
            ],
            [
                18742,
                19147
            ],
            [
                19147,
                19152
            ],
            [
                19152,
                19464
            ],
            [
                19464,
                19639
            ],
            [
                19639,
                19711
            ],
            [
                19711,
                19806
            ],
            [
                19806,
                19831
            ],
            [
                19831,
                19879
            ],
            [
                19879,
                19906
            ],
            [
                19906,
                19949
            ],
            [
                19949,
                19959
            ],
            [
                19959,
                20005
            ],
            [
                20005,
                20023
            ],
            [
                20023,
                20061
            ],
            [
                20061,
                20092
            ],
            [
                20092,
                20269
            ],
            [
                20269,
                20405
            ],
            [
                20405,
                20642
            ],
            [
                20642,
                20702
            ],
            [
                20702,
                20745
            ],
            [
                20745,
                20992
            ],
            [
                20992,
                21047
            ],
            [
                21047,
                21071
            ],
            [
                21071,
                21107
            ],
            [
                21107,
                21172
            ],
            [
                21172,
                21185
            ],
            [
                21185,
                21201
            ],
            [
                21201,
                21224
            ],
            [
                21224,
                21313
            ],
            [
                21313,
                21502
            ],
            [
                21502,
                21588
            ],
            [
                21588,
                21690
            ],
            [
                21690,
                21826
            ],
            [
                21826,
                21932
            ],
            [
                21932,
                21964
            ],
            [
                21964,
                21974
            ],
            [
                21974,
                22023
            ],
            [
                22023,
                22131
            ],
            [
                22131,
                22208
            ],
            [
                22208,
                22243
            ],
            [
                22243,
                22271
            ],
            [
                22271,
                22378
            ],
            [
                22378,
                22396
            ],
            [
                22396,
                22520
            ],
            [
                22520,
                22531
            ],
            [
                22531,
                22675
            ],
            [
                22675,
                22717
            ],
            [
                22717,
                22834
            ],
            [
                22834,
                22843
            ],
            [
                22843,
                22970
            ],
            [
                22970,
                23063
            ],
            [
                23063,
                23103
            ],
            [
                23103,
                23132
            ],
            [
                23132,
                23182
            ],
            [
                23182,
                23219
            ],
            [
                23219,
                23275
            ],
            [
                23275,
                23370
            ],
            [
                23370,
                23418
            ],
            [
                23418,
                23438
            ],
            [
                23438,
                23583
            ],
            [
                23583,
                23619
            ],
            [
                23619,
                23642
            ],
            [
                23642,
                23653
            ],
            [
                23653,
                23743
            ],
            [
                23743,
                23834
            ],
            [
                23834,
                24016
            ],
            [
                24016,
                24111
            ],
            [
                24111,
                24145
            ],
            [
                24145,
                24278
            ],
            [
                24278,
                24383
            ],
            [
                24383,
                24519
            ],
            [
                24519,
                24588
            ],
            [
                24588,
                24676
            ],
            [
                24676,
                24696
            ],
            [
                24696,
                24740
            ],
            [
                24740,
                24914
            ],
            [
                24914,
                25153
            ],
            [
                25153,
                25233
            ],
            [
                25233,
                25311
            ],
            [
                25311,
                25340
            ],
            [
                25340,
                25451
            ],
            [
                25451,
                25585
            ],
            [
                25585,
                25611
            ],
            [
                25611,
                25633
            ],
            [
                25633,
                25667
            ],
            [
                25667,
                25727
            ],
            [
                25727,
                25775
            ],
            [
                25775,
                25792
            ],
            [
                25792,
                25810
            ],
            [
                25810,
                25828
            ],
            [
                25828,
                25923
            ],
            [
                25923,
                26057
            ],
            [
                26057,
                26175
            ],
            [
                26175,
                26199
            ],
            [
                26199,
                26236
            ],
            [
                26236,
                26280
            ],
            [
                26280,
                26303
            ],
            [
                26303,
                26343
            ],
            [
                26343,
                26367
            ],
            [
                26367,
                26444
            ],
            [
                26444,
                26565
            ],
            [
                26565,
                26874
            ],
            [
                26874,
                26981
            ],
            [
                26981,
                27265
            ],
            [
                27265,
                27384
            ],
            [
                27384,
                27568
            ],
            [
                27568,
                27675
            ],
            [
                27675,
                27798
            ],
            [
                27798,
                27839
            ],
            [
                27839,
                27944
            ],
            [
                27944,
                27990
            ],
            [
                27990,
                28113
            ],
            [
                28113,
                28469
            ],
            [
                28469,
                28562
            ],
            [
                28562,
                28731
            ],
            [
                28731,
                28833
            ],
            [
                28833,
                28865
            ],
            [
                28865,
                29054
            ],
            [
                29054,
                29075
            ],
            [
                29075,
                29089
            ],
            [
                29089,
                29099
            ],
            [
                29099,
                29120
            ],
            [
                29120,
                29134
            ],
            [
                29134,
                29164
            ],
            [
                29164,
                29535
            ],
            [
                29535,
                30117
            ],
            [
                30117,
                30139
            ],
            [
                30139,
                30159
            ],
            [
                30159,
                30320
            ],
            [
                30320,
                30378
            ],
            [
                30378,
                30472
            ],
            [
                30472,
                30504
            ],
            [
                30504,
                30636
            ],
            [
                30636,
                30677
            ],
            [
                30677,
                30754
            ],
            [
                30754,
                30856
            ],
            [
                30856,
                30902
            ],
            [
                30902,
                30961
            ],
            [
                30961,
                30980
            ],
            [
                30980,
                31019
            ],
            [
                31019,
                31242
            ],
            [
                31242,
                31343
            ],
            [
                31343,
                31386
            ],
            [
                31386,
                31409
            ],
            [
                31409,
                31427
            ],
            [
                31427,
                31459
            ],
            [
                31459,
                31479
            ],
            [
                31479,
                31563
            ],
            [
                31563,
                31568
            ],
            [
                31568,
                31744
            ],
            [
                31744,
                31821
            ],
            [
                31821,
                31871
            ],
            [
                31871,
                31950
            ],
            [
                31950,
                31994
            ],
            [
                31994,
                32053
            ],
            [
                32053,
                32075
            ],
            [
                32075,
                32243
            ],
            [
                32243,
                32357
            ],
            [
                32357,
                32478
            ],
            [
                32478,
                32612
            ],
            [
                32612,
                32634
            ],
            [
                32634,
                32654
            ],
            [
                32654,
                32684
            ],
            [
                32684,
                32948
            ],
            [
                32948,
                32968
            ],
            [
                32968,
                33193
            ],
            [
                33193,
                33229
            ],
            [
                33229,
                33258
            ],
            [
                33258,
                33273
            ]
        ]
    },
    "abridged": {
        "text": "The next day Moore had risen before the sun, and had ridden to Whinbury and back before his sister had made his coffee and breakfast. What business he did there he kept to himself. Hortense asked no questions.\nBreakfast over, he went to his counting-house. Henry, Joe Scott's boy, brought in the letters; Moore sat down and glanced them over. They were all short, but not, it seemed, sweet - probably rather sour, on the contrary; for as Moore laid down the last, he sniffed derisively, and his eye glittered in anger. He dashed off a batch of answers, sealed them, and then went to walk through the mill. On coming back he sat down to read his newspaper.\nThe contents seemed not to absorb him; he turned his head towards the window; he looked at his watch, and appeared preoccupied. It was a fine, mild morning; perhaps he wished to be out in the fields. The door of his counting-house stood wide open, and the breeze and sunshine entered freely.\nA dark-blue apparition - Joe Scott, fresh from a dyeing vat - appeared at the open door, uttered the words \"He's comed, sir,\" and vanished.\nA large man, broad-shouldered and massive-limbed, clad in fustian garments and grey woollen stockings, entered, was received with a nod, and told to take a seat. He removed his hat (a very bad one), stowed it away under his chair, and wiped his forehead with a spotted cotton handkerchief, saying that it was \"raight dahn warm for Febewerry.\"\nMr. Moore uttered some slight sound of agreement. The visitor carefully deposited an official-looking staff in the corner; then he began to whistle.\n\"You have what is necessary, I suppose?\" said Mr. Moore.\n\"Ay, ay! all's right.\"\nHe renewed his whistling, Mr. Moore his reading. Presently, however, Moore turned to his cupboard, opened it without rising, took out a black bottle - the same he had produced for Malone's benefit - a tumbler, and a jug, placed them on the table, and said:\n\"Help yourself; there's water in that jar over there.\"\n\"Will you tak naught yourseln, Mr. Moore?\" inquired his guest, as he mixed a portion, tasted it, and sank back satisfied in his seat. Moore shook his head.\n\"Yah'd as good,\" continued his visitor; \"it'd set ye up. Tak my advice and try a glass. Them lads that's coming 'll keep ye talking. Ye'll need propping.\"\n\"Have you seen Mr. Sykes this morning?\" inquired Moore.\n\"I seed him just afore I set off. He said he aimed to come here, and I sudn't wonder but ye'll have old Helstone too. I seed 'em saddling his little nag as I passed t' rectory.\"\nThe trot of the little nag's hoofs was, five minutes after, heard in the yard. A well-known nasal voice cried aloud, \"Boy, lead my horse into the stable.\" Then Helstone came marching in, looking keener and livelier than usual.\n\"Beautiful morning, Moore. How do? Ha! whom have we here? Sugden! On my word, you lose no time. Your message was delivered to me, Moore. Are you sure you are on the right scent? Have you got a warrant?\"\n\"Sugden has.\"\n\"Then you are going to seek him now? I'll accompany you.\"\n\"You will be spared that trouble, sir; he is coming to seek me. I'm awaiting his arrival.\"\n\"And who is it?\"\nJoe Scott had entered, like a sinister indigo phantom. He said:\n\"It's a friend of yours, Mr. Helstone: the Rev. Moses Barraclough. The tub orator you call him sometimes, I think.\"\n\"Ah!\" said the rector, taking out his snuff-box, and helping himself to a long pinch. \"Why, he never was a workman of yours, Moore. He's a tailor.\"\n\"And so much the worse grudge I owe him, for interfering and setting my men against me.\"\n\"And Moses was actually present at the battle of Stilbro' Moor, wooden leg and all?\"\n\"Ay, sir,\" said Joe; \"he went there on horseback. He was the captain, and wore a mask.\"\n\"And how was he found out?\"\n\"He courted Sarah, Mr. Moore's sarvant lass,\" said Joe, \"and she would have nothing to say to him. Happen she'd have encouraged him, in spite of his leg and his deceit, just to pass time like. I've known some on 'em do as much - ay, I've seen trim young women, that looked as pure as daisies, turn out to be nowt but stinging nettles.\"\n\"Sensible fellow,\" said Helstone.\n\"Howsiver, Sarah had another string to her bow. Fred Murgatroyd, one of our lads, is for her; and two-three months ago, Murgatroyd and Moses chanced to meet one Sunday night. They'd both come to ax Sarah to tak a walk wi' them. They fell out, had a tussle, and Fred was worsted, for he's young and small, and Barraclough, for all he has only one leg, is almost as strong as Sugden there.\"\n\"In short,\" broke in Mr. Moore, \"Murgatroyd was jealous of Barraclough; and last night, as he and a friend took shelter in a barn from a shower, they heard Moses talking with some associates within. From their talk it was plain he had been the leader, not only at Stilbro' Moor, but in the attack on Sykes's property. Moreover they planned to send a deputation to me this morning, which Barraclough is to head, and which, in the most religious and peaceful spirit, is to entreat me to give up my frames. I rode over to Whinbury this morning, got a constable and a warrant, and I am now waiting for the group. Here comes Sykes.\"\nMr. Sykes entered - a tall stout man of about fifty, who looked anxious.\n\"Have they been? Have you got him? Is it over?\" he asked.\n\"Not yet,\" returned Moore. \"We are waiting for them.\"\n\"They'll not come; it's near noon. Better give it up. It will make a stir - may have fatal consequences.\"\n\"You need not appear,\" said Moore. \"I shall meet them in the yard; you can stay here.\"\n\"But my name will be seen in the law proceedings. A wife and family make a man cautious.\"\nMoore looked disgusted. \"I have no objection to act alone,\" he said; \"only you will not find safety in yielding. Your partner Pearson gave way, but that did not prevent them from trying to shoot him in his own house.\"\n\"My dear sir, take a little wine and water,\" recommended Mr. Helstone. A brimming tumbler transfigured Mr. Sykes in two minutes. He now announced that he would endure the insolence of the working-classes no longer; he had made up his mind to put them down.\n\"Take another glass,\" urged Moore.\nMr. Sykes didn't mind if he did - just to keep the damp out; he had a little cough (here he coughed to prove the fact), and it really was prudent to take precautions.\n\"Quite prudent, and take them by all means,\" urged the host.\nMr. Sykes now addressed Mr. Helstone, who stood watching him keenly.\n\"You, sir, as a clergyman,\" said he, \"may feel it disagreeable to be present amidst scenes of peril. I dare say your nerves won't stand it. You're a man of peace, sir; but we manufacturers, living in the world, and always in turmoil, get quite belligerent. Really, if anybody was to attack my house - thieves or anything - I believe I should enjoy it, such is my spirit.\"\nThe rector laughed. Moore would have pressed a third tumbler upon the heroic mill-owner, but Helstone, for the sake of decorum, prevented him.\n\"Enough is as good as a feast, is it not, Mr. Sykes?\" he said; and Mr. Sykes assented regretfully. Moore looked mischievous and sardonic. What would a certain young kinswoman of his have said if she could have seen her dear, good, great Robert just now?\nYes, it was the same man, only seen on a different side - a side Caroline had not yet beheld, though perhaps she suspected its existence. Well, Caroline had, doubtless, her defective side too. And Moore, with all his faults, might be respected, as might old Helstone. Neither of these two would look, think, or speak a lie; the wretched black bottle had no charms for either of them. Both of them looked and were superior beings to poor Sykes.\nA trampling sound was heard in the yard. Moore walked to the window; Helstone followed. They looked forth carefully, so that they might not be visible from outside.\nA flourishing oratorical cough was now heard, followed by \"Whisht!\" Moore opened his window an inch or two to admit sound.\n\"Joseph Scott,\" began a snuffling voice - Scott was standing sentinel at the counting-house door - \"might we inquire if your master be within?\"\n\"He's within, ay,\" said Joe.\n\"Would you then, if you please, tell him that twelve gentlemen wants to see him.\"\n\"He'd happen ax what for,\" suggested Joe.\n\"For a purpose,\" was the answer.\nJoe entered. \"Please, sir, there's twelve gentlemen wants to see ye, 'for a purpose.'\"\n\"Good. Sugden, come when I whistle.\" Moore went out, chuckling dryly. He advanced into the yard, one hand in his pocket, the other in his waistcoat, his cap brim over his eyes, shading their deep dancing ray of scorn.\nTwelve men waited in the yard, with two in front: one, a little dapper strutting man with a turned-up nose; the other a broad-shouldered fellow, with demure, cat like, trustless eyes, and a wooden leg and crutch. He seemed laughing in his sleeve at some person or thing.\n\"Good-morning, Mr. Barraclough,\" said Moore to him.\n\"Peace be unto you!\" answered Mr. Barraclough, entirely closing his naturally half-shut eyes.\n\"I'm obliged to you. Peace is an excellent thing; but I imagine peace is not your purpose?\"\n\"As to our purpose,\" began Barraclough, \"it's one that may sound strange and perhaps foolish to ears like yours, for the childer of this world is wiser in their generation than the childer of light.\"\n\"To the point, if you please.\"\n\"Ye'se hear, sir. It is a grand purpose, and\" (changing his voice to a whine) \"it's the Looard's own purpose.\"\n\"Do you want a subscription to a new Ranter's chapel, Mr. Barraclough?\"\n\"I hadn't that duty on my mind, sir; but since ye mention the subject, I'll tak ony small trifle ye may have to spare.\"\nWith that he doffed his hat, and held it out as a begging-box with a brazen grin.\n\"If I gave you sixpence you would drink it. You seem a fine fellow,\" said Moore dryly; \"you don't mind showing me that your trade is hypocrisy and fraud. You expect to make me laugh at your cleverness, while at the same time you think you are deceiving the men behind you.\"\nMoses Barraclough's countenance lowered. He was going to answer, when the second leader stepped forward impatiently, with a self-confident and conceited air.\n\"Mr. Moore,\" commenced he, enunciating each word very slowly, \"it might, perhaps, be said that reason rather than peace is our purpose. We come, in the first place, to request you to hear reason; and should you refuse, it is my duty to warn you that measures will be had resort to which will bring you to a sense of the foolishness which seems to guide your proceedings as a tradesman. Hem! Sir, I would beg to allude that as a furriner, coming from a distant quarter of this globe, thrown, as I may say, a perfect outcast on these cliffs of Albion, you have not that understanding of the ways which might conduce to the benefit of the working-classes. If you'd consider to give up this here mill, and go straight home to where you belong, it 'ud happen be as well.\"\nThe other members of the deputation responded: \"Hear, hear!\"\n\"Brayvo, Noah!\" murmured Joe Scott, who stood behind Mr. Moore. \"Moses'll niver beat that. Cliffs o' Albion! Moses is dished.\"\nMoses, however, refused to be dished. Casting a somewhat ireful glance at Noah, he launched out in a more serious tone.\n\"Before you set up your tent among us, Mr. Moore, we lived i' peace and quietness - yea, in loving-kindness. I can remember some twenty year back, when hand-labour were respected, and no mischief-maker had ventured to introduce these here machines. Now, I'm a tailor myself. Howsiver, my heart is of a softish nature. I'm a very feeling man, and when I see my brethren oppressed, I stand up for 'em. Therefore I advise you to part wi' your infernal machinery, and tak on more hands.\"\n\"What if I don't follow your advice, Mr. Barraclough?\"\n\"The Looard pardon you!\"\n\"Are you a Wesleyan now, Mr. Barraclough?\"\n\"Praise God! Bless His name! I'm a joined Methody!\"\n\"Which does not prevent you from being a drunkard and a swindler. I saw you a week ago laid dead-drunk by the roadside, as I returned from Stilbro' market; and while you preach peace, you spend your life stirring up dissension. You no more sympathize with the poor than you do with me. You incite them to outrage for bad purposes of your own; so does this Noah. You two are restless, meddling, impudent scoundrels, whose motive is selfish ambition. Behind you are some honest though misguided men; but you two I count altogether bad.\"\nBarraclough was going to speak.\n\"Silence! You have had your say, and now I will have mine. I will not be dictated to by you. You want me to quit the country, and to part with my machinery. If I refuse, you threaten me. I do refuse. Here I stay, and by this mill I stand, and into it will I convey the best machinery invented. What will you do? Burn down my mill and shoot me? What then? Suppose that building was a ruin and I was a corpse - would that stop invention? Not for a second! Another mill would rise on the ruins of this, and perhaps a more enterprising owner come in my place. Hear me! I'll make my cloth as I please, and using what means I choose. Whoever interferes with me may take the consequences. I'll prove I'm in earnest.\"\nHe whistled shrilly and loud. Sugden came out with his staff and warrant.\nMoore turned sharply to Barraclough. \"You were on Stilbro' moor,\" said he; \"I have proof of that. You wore a mask, you knocked down one of my men with your own hand - you! a preacher of the gospel! Sugden, arrest him!\"\nMoses was captured. There was a cry and a rush to rescue him, but Moore's right hand, which had lain hidden in his breast, reappeared holding a pistol.\n\"Both barrels are loaded,\" said he. \"Keep off!\"\nHe guarded his prey to the counting-house. He ordered Joe Scott to enter with Sugden and the prisoner, and to bolt the door from inside. Then he walked backwards and forwards along the front of the mill, looking meditatively on the ground, but still holding the pistol.\nThe eleven remaining deputies watched him, talking under their breath to each other. At length one of them approached.\n\"I've not much faith i' Moses Barraclough,\" said he, \"and I would speak a word to you myseln, Mr. Moore. It's out o' no ill-will that I'm here; it's just to try to get things straightened. Ye see we're ill off; our families is poor and pined. We're thrown out o' work wi' these frames; we can earn nought. What is to be done? Mun we lay us down and dee? I've no grand words, Mr. Moore, but I feel that a reasonable man should not starve to death. I'm not for shedding blood, and I'm not for pulling down mills and breaking machines - for as ye say, that niver stops invention; but I'll mak as big a din as ever I can. I know it isn't right for poor folks to starve. Them that governs mun find a way to help us. Ye'll say that's hard to do. So much louder mun we shout out then, to set t' Parliament-men on to the job.\"\n\"Worry the Parliament-men as much as you please,\" said Moore; \"but to worry the mill-owners is absurd, and I won't stand it.\"\n\"Ye're a raight hard un!\" returned the workman. \"Won't ye gie us a bit o' time? Won't ye mak your changes more slowly?\"\n\"Others won't stop. If I did, I should be bankrupt in a month; and would that put bread into your hungry children's mouths? William Farren, talk to me no more about machinery. I shall get new frames in tomorrow. If you broke these, I would still get more. I'll never give in.\"\nHere the mill-bell rang twelve o'clock. Moore abruptly turned away and re-entered his counting-house.\nHis last words had left a harsh impression. By speaking kindly to William Farren, who was a very honest, hard-working man, Moore might have made a friend. It seemed extraordinary that he could turn from such a man without any sympathy. The poor fellow looked haggard with want and hunger; yet there was no malignity in his face; it was worn, dejected, but still patient. How could Moore leave him thus, with the words, \"I'll never give in,\" and not a whisper of good-will, or aid?\nFarren, as he went home to his cottage - once a decent, pleasant place, but now, though still clean, very dreary, because so poor - asked himself this question. He concluded that the foreign mill-owner was a selfish, unfeeling, and foolish man. He felt cast down - almost hopeless.\nOn his entrance his wife served out such dinner as she had to give him and the bairns. It was only porridge, and too little of that. Some of the younger children asked for more, which disturbed William much. While his wife quieted them as well as she could, he went to the doorway to conceal from his family the tears which were gathering in his grey eyes. He cleared his vision with his sleeve, and the melting mood over, a very stern one followed.\nHe stood brooding in silence, when a gentleman in black came up - a clergyman, but not one we have met before. He was about forty years old; plain-looking, and rather grey-haired. He wore an abstracted and somewhat doleful air; but on approaching Farren he looked up with a hearty expression.\n\"Is it you, William? How are you?\" he asked.\n\"Middling, Mr. Hall. How are ye? Will ye step in and rest ye?\"\nMr. Hall was vicar of Nunnely, from which parish Farren originally came, before he had moved to Briarfield to work in the mill. He entered the cottage, and having greeted the wife and children, sat down. He talked very cheerfully about events in his parish since the family had left; he answered questions about his sister Margaret; he asked questions in his turn, and at last, glancing anxiously round at the bare room, and at the faces of the children by his knee, he said abruptly:\n\"How are you all? How do you get on?\"\n\"We get on poorly,\" said William; \"we're all out of work. I've selled most o' t' household stuff, as ye may see; and what we're to do next, God knows.\"\n\"Has Mr. Moore turned you off?\"\n\"He has turned us off; and if he'd tak me on again tomorrow I wouldn't work for him.\"\n\"That is not like you, William.\"\n\"I know; but I feel I am changing. T' bairns and t' wife are that pinched-\"\n\"Well, my lad, and so are you. These are grievous times; I see suffering wherever I turn. Sit down, and let us talk it over.\"\nMr. Hall lifted the smallest child on to his knee, and placed his hand on the head of the next smallest.\n\"Sad times,\" he said, \"and they last long. It is the will of God. His will be done. But He tries us to the utmost.\"\nAgain he reflected.\n\"You've no money, William, and you've nothing you could sell to raise any?\"\n\"No. I've selled t' chest o' drawers, and t' clock, and a mahogany stand, and t' wife's bonny tea-tray and set o' wedding chiney.\"\n\"If somebody lent you a pound or two, could you make any good use of it? Could you get into a new way of doing something?\"\nFarren did not answer, but his wife said quickly, \"Ay, I'm sure he could, sir. He's a very contriving chap, is our William. If he'd two or three pounds he could begin selling stuff.\"\n\"Please God,\" returned William deliberately, \"I could buy groceries, and bits o' tapes, and thread, and I could begin hawking at first.\"\n\"And you know, sir,\" interposed Grace, \"William would neither drink, nor idle, nor waste, in any way. He's my husband, and I shouldn't praise him; but I will say there's not a soberer, honester man i' England.\"\n\"Well, I'll speak to one or two friends, and I think I can promise to let him have five pounds in a day or two - as a loan, mind, not a gift. He must pay it back.\"\n\"I understand, sir. I'm quite agreeable to that.\"\n\"Meantime, there's a few shillings for you, Grace, just to keep the pot boiling. - Now, bairns, stand in a row and say your catechism, while your mother goes and buys some dinner; for you've not had much today, I'll be bound. You begin, Ben.\"\nMr. Hall stayed till Grace came back; then he took his leave, shaking hands with both Farren and his wife, and saying a few brief but very earnest words of religious consolation.\nWith a mutual \"God bless you, sir!\" \"God bless you, my friends!\" they separated.",
        "paragraph_chars": [
            [
                0,
                210
            ],
            [
                210,
                656
            ],
            [
                656,
                948
            ],
            [
                948,
                1088
            ],
            [
                1088,
                1431
            ],
            [
                1431,
                1580
            ],
            [
                1580,
                1637
            ],
            [
                1637,
                1660
            ],
            [
                1660,
                1917
            ],
            [
                1917,
                1972
            ],
            [
                1972,
                2128
            ],
            [
                2128,
                2283
            ],
            [
                2283,
                2339
            ],
            [
                2339,
                2517
            ],
            [
                2517,
                2744
            ],
            [
                2744,
                2947
            ],
            [
                2947,
                2961
            ],
            [
                2961,
                3019
            ],
            [
                3019,
                3110
            ],
            [
                3110,
                3127
            ],
            [
                3127,
                3191
            ],
            [
                3191,
                3307
            ],
            [
                3307,
                3455
            ],
            [
                3455,
                3544
            ],
            [
                3544,
                3629
            ],
            [
                3629,
                3717
            ],
            [
                3717,
                3745
            ],
            [
                3745,
                4081
            ],
            [
                4081,
                4115
            ],
            [
                4115,
                4504
            ],
            [
                4504,
                5132
            ],
            [
                5132,
                5205
            ],
            [
                5205,
                5263
            ],
            [
                5263,
                5317
            ],
            [
                5317,
                5423
            ],
            [
                5423,
                5510
            ],
            [
                5510,
                5600
            ],
            [
                5600,
                5818
            ],
            [
                5818,
                6075
            ],
            [
                6075,
                6110
            ],
            [
                6110,
                6277
            ],
            [
                6277,
                6338
            ],
            [
                6338,
                6407
            ],
            [
                6407,
                6779
            ],
            [
                6779,
                6922
            ],
            [
                6922,
                7176
            ],
            [
                7176,
                7620
            ],
            [
                7620,
                7785
            ],
            [
                7785,
                7908
            ],
            [
                7908,
                8052
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8163
            ],
            [
                8163,
                8205
            ],
            [
                8205,
                8238
            ],
            [
                8238,
                8325
            ],
            [
                8325,
                8543
            ],
            [
                8543,
                8814
            ],
            [
                8814,
                8866
            ],
            [
                8866,
                8960
            ],
            [
                8960,
                9052
            ],
            [
                9052,
                9252
            ],
            [
                9252,
                9283
            ],
            [
                9283,
                9394
            ],
            [
                9394,
                9466
            ],
            [
                9466,
                9586
            ],
            [
                9586,
                9668
            ],
            [
                9668,
                9942
            ],
            [
                9942,
                10100
            ],
            [
                10100,
                10867
            ],
            [
                10867,
                10928
            ],
            [
                10928,
                11055
            ],
            [
                11055,
                11175
            ],
            [
                11175,
                11659
            ],
            [
                11659,
                11714
            ],
            [
                11714,
                11739
            ],
            [
                11739,
                11782
            ],
            [
                11782,
                11834
            ],
            [
                11834,
                12369
            ],
            [
                12369,
                12401
            ],
            [
                12401,
                13111
            ],
            [
                13111,
                13185
            ],
            [
                13185,
                13404
            ],
            [
                13404,
                13556
            ],
            [
                13556,
                13604
            ],
            [
                13604,
                13874
            ],
            [
                13874,
                13993
            ],
            [
                13993,
                14812
            ],
            [
                14812,
                14938
            ],
            [
                14938,
                15058
            ],
            [
                15058,
                15335
            ],
            [
                15335,
                15437
            ],
            [
                15437,
                15918
            ],
            [
                15918,
                16200
            ],
            [
                16200,
                16650
            ],
            [
                16650,
                16943
            ],
            [
                16943,
                16988
            ],
            [
                16988,
                17051
            ],
            [
                17051,
                17536
            ],
            [
                17536,
                17574
            ],
            [
                17574,
                17726
            ],
            [
                17726,
                17758
            ],
            [
                17758,
                17844
            ],
            [
                17844,
                17877
            ],
            [
                17877,
                17953
            ],
            [
                17953,
                18079
            ],
            [
                18079,
                18184
            ],
            [
                18184,
                18300
            ],
            [
                18300,
                18320
            ],
            [
                18320,
                18396
            ],
            [
                18396,
                18527
            ],
            [
                18527,
                18650
            ],
            [
                18650,
                18833
            ],
            [
                18833,
                18970
            ],
            [
                18970,
                19181
            ],
            [
                19181,
                19345
            ],
            [
                19345,
                19395
            ],
            [
                19395,
                19638
            ],
            [
                19638,
                19817
            ],
            [
                19817,
                19897
            ]
        ],
        "segment_chars": [
            [
                0,
                134
            ],
            [
                134,
                181
            ],
            [
                181,
                210
            ],
            [
                210,
                257
            ],
            [
                257,
                343
            ],
            [
                343,
                519
            ],
            [
                519,
                606
            ],
            [
                606,
                656
            ],
            [
                656,
                784
            ],
            [
                784,
                856
            ],
            [
                856,
                948
            ],
            [
                948,
                1088
            ],
            [
                1088,
                1250
            ],
            [
                1250,
                1431
            ],
            [
                1431,
                1481
            ],
            [
                1481,
                1580
            ],
            [
                1580,
                1621
            ],
            [
                1621,
                1637
            ],
            [
                1637,
                1646
            ],
            [
                1646,
                1660
            ],
            [
                1660,
                1709
            ],
            [
                1709,
                1917
            ],
            [
                1917,
                1972
            ],
            [
                1972,
                2015
            ],
            [
                2015,
                2106
            ],
            [
                2106,
                2128
            ],
            [
                2128,
                2185
            ],
            [
                2185,
                2216
            ],
            [
                2216,
                2261
            ],
            [
                2261,
                2283
            ],
            [
                2283,
                2323
            ],
            [
                2323,
                2339
            ],
            [
                2339,
                2373
            ],
            [
                2373,
                2457
            ],
            [
                2457,
                2517
            ],
            [
                2517,
                2596
            ],
            [
                2596,
                2672
            ],
            [
                2672,
                2744
            ],
            [
                2744,
                2771
            ],
            [
                2771,
                2779
            ],
            [
                2779,
                2783
            ],
            [
                2783,
                2802
            ],
            [
                2802,
                2810
            ],
            [
                2810,
                2840
            ],
            [
                2840,
                2881
            ],
            [
                2881,
                2922
            ],
            [
                2922,
                2947
            ],
            [
                2947,
                2961
            ],
            [
                2961,
                2998
            ],
            [
                2998,
                3019
            ],
            [
                3019,
                3083
            ],
            [
                3083,
                3110
            ],
            [
                3110,
                3127
            ],
            [
                3127,
                3182
            ],
            [
                3182,
                3191
            ],
            [
                3191,
                3258
            ],
            [
                3258,
                3307
            ],
            [
                3307,
                3313
            ],
            [
                3313,
                3393
            ],
            [
                3393,
                3439
            ],
            [
                3439,
                3455
            ],
            [
                3455,
                3544
            ],
            [
                3544,
                3629
            ],
            [
                3629,
                3679
            ],
            [
                3679,
                3717
            ],
            [
                3717,
                3745
            ],
            [
                3745,
                3844
            ],
            [
                3844,
                3938
            ],
            [
                3938,
                4081
            ],
            [
                4081,
                4115
            ],
            [
                4115,
                4163
            ],
            [
                4163,
                4290
            ],
            [
                4290,
                4343
            ],
            [
                4343,
                4504
            ],
            [
                4504,
                4703
            ],
            [
                4703,
                4822
            ],
            [
                4822,
                5008
            ],
            [
                5008,
                5113
            ],
            [
                5113,
                5132
            ],
            [
                5132,
                5205
            ],
            [
                5205,
                5222
            ],
            [
                5222,
                5240
            ],
            [
                5240,
                5253
            ],
            [
                5253,
                5263
            ],
            [
                5263,
                5290
            ],
            [
                5290,
                5317
            ],
            [
                5317,
                5352
            ],
            [
                5352,
                5371
            ],
            [
                5371,
                5423
            ],
            [
                5423,
                5458
            ],
            [
                5458,
                5510
            ],
            [
                5510,
                5560
            ],
            [
                5560,
                5600
            ],
            [
                5600,
                5624
            ],
            [
                5624,
                5713
            ],
            [
                5713,
                5818
            ],
            [
                5818,
                5889
            ],
            [
                5889,
                5947
            ],
            [
                5947,
                6075
            ],
            [
                6075,
                6110
            ],
            [
                6110,
                6277
            ],
            [
                6277,
                6338
            ],
            [
                6338,
                6407
            ],
            [
                6407,
                6508
            ],
            [
                6508,
                6547
            ],
            [
                6547,
                6664
            ],
            [
                6664,
                6779
            ],
            [
                6779,
                6799
            ],
            [
                6799,
                6922
            ],
            [
                6922,
                6976
            ],
            [
                6976,
                7021
            ],
            [
                7021,
                7060
            ],
            [
                7060,
                7176
            ],
            [
                7176,
                7314
            ],
            [
                7314,
                7369
            ],
            [
                7369,
                7444
            ],
            [
                7444,
                7560
            ],
            [
                7560,
                7620
            ],
            [
                7620,
                7661
            ],
            [
                7661,
                7708
            ],
            [
                7708,
                7785
            ],
            [
                7785,
                7853
            ],
            [
                7853,
                7908
            ],
            [
                7908,
                8052
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8163
            ],
            [
                8163,
                8205
            ],
            [
                8205,
                8238
            ],
            [
                8238,
                8251
            ],
            [
                8251,
                8325
            ],
            [
                8325,
                8332
            ],
            [
                8332,
                8362
            ],
            [
                8362,
                8395
            ],
            [
                8395,
                8543
            ],
            [
                8543,
                8756
            ],
            [
                8756,
                8814
            ],
            [
                8814,
                8866
            ],
            [
                8866,
                8887
            ],
            [
                8887,
                8960
            ],
            [
                8960,
                8981
            ],
            [
                8981,
                9052
            ],
            [
                9052,
                9252
            ],
            [
                9252,
                9283
            ],
            [
                9283,
                9301
            ],
            [
                9301,
                9394
            ],
            [
                9394,
                9466
            ],
            [
                9466,
                9586
            ],
            [
                9586,
                9668
            ],
            [
                9668,
                9712
            ],
            [
                9712,
                9822
            ],
            [
                9822,
                9942
            ],
            [
                9942,
                9983
            ],
            [
                9983,
                10100
            ],
            [
                10100,
                10236
            ],
            [
                10236,
                10486
            ],
            [
                10486,
                10491
            ],
            [
                10491,
                10753
            ],
            [
                10753,
                10867
            ],
            [
                10867,
                10928
            ],
            [
                10928,
                10944
            ],
            [
                10944,
                10992
            ],
            [
                10992,
                11019
            ],
            [
                11019,
                11037
            ],
            [
                11037,
                11055
            ],
            [
                11055,
                11093
            ],
            [
                11093,
                11175
            ],
            [
                11175,
                11284
            ],
            [
                11284,
                11424
            ],
            [
                11424,
                11450
            ],
            [
                11450,
                11493
            ],
            [
                11493,
                11575
            ],
            [
                11575,
                11659
            ],
            [
                11659,
                11714
            ],
            [
                11714,
                11739
            ],
            [
                11739,
                11782
            ],
            [
                11782,
                11795
            ],
            [
                11795,
                11811
            ],
            [
                11811,
                11834
            ],
            [
                11834,
                11900
            ],
            [
                11900,
                12062
            ],
            [
                12062,
                12120
            ],
            [
                12120,
                12196
            ],
            [
                12196,
                12283
            ],
            [
                12283,
                12369
            ],
            [
                12369,
                12401
            ],
            [
                12401,
                12411
            ],
            [
                12411,
                12460
            ],
            [
                12460,
                12494
            ],
            [
                12494,
                12558
            ],
            [
                12558,
                12588
            ],
            [
                12588,
                12601
            ],
            [
                12601,
                12695
            ],
            [
                12695,
                12713
            ],
            [
                12713,
                12745
            ],
            [
                12745,
                12756
            ],
            [
                12756,
                12837
            ],
            [
                12837,
                12855
            ],
            [
                12855,
                12957
            ],
            [
                12957,
                12966
            ],
            [
                12966,
                13029
            ],
            [
                13029,
                13083
            ],
            [
                13083,
                13111
            ],
            [
                13111,
                13141
            ],
            [
                13141,
                13185
            ],
            [
                13185,
                13222
            ],
            [
                13222,
                13283
            ],
            [
                13283,
                13357
            ],
            [
                13357,
                13383
            ],
            [
                13383,
                13404
            ],
            [
                13404,
                13424
            ],
            [
                13424,
                13556
            ],
            [
                13556,
                13592
            ],
            [
                13592,
                13604
            ],
            [
                13604,
                13647
            ],
            [
                13647,
                13741
            ],
            [
                13741,
                13874
            ],
            [
                13874,
                13959
            ],
            [
                13959,
                13993
            ],
            [
                13993,
                14098
            ],
            [
                14098,
                14182
            ],
            [
                14182,
                14236
            ],
            [
                14236,
                14299
            ],
            [
                14299,
                14319
            ],
            [
                14319,
                14347
            ],
            [
                14347,
                14440
            ],
            [
                14440,
                14611
            ],
            [
                14611,
                14659
            ],
            [
                14659,
                14704
            ],
            [
                14704,
                14733
            ],
            [
                14733,
                14812
            ],
            [
                14812,
                14938
            ],
            [
                14938,
                14964
            ],
            [
                14964,
                14986
            ],
            [
                14986,
                15018
            ],
            [
                15018,
                15058
            ],
            [
                15058,
                15078
            ],
            [
                15078,
                15182
            ],
            [
                15182,
                15234
            ],
            [
                15234,
                15270
            ],
            [
                15270,
                15314
            ],
            [
                15314,
                15335
            ],
            [
                15335,
                15375
            ],
            [
                15375,
                15437
            ],
            [
                15437,
                15481
            ],
            [
                15481,
                15592
            ],
            [
                15592,
                15673
            ],
            [
                15673,
                15808
            ],
            [
                15808,
                15918
            ],
            [
                15918,
                16079
            ],
            [
                16079,
                16163
            ],
            [
                16163,
                16200
            ],
            [
                16200,
                16287
            ],
            [
                16287,
                16333
            ],
            [
                16333,
                16408
            ],
            [
                16408,
                16557
            ],
            [
                16557,
                16650
            ],
            [
                16650,
                16761
            ],
            [
                16761,
                16830
            ],
            [
                16830,
                16943
            ],
            [
                16943,
                16964
            ],
            [
                16964,
                16978
            ],
            [
                16978,
                16988
            ],
            [
                16988,
                17009
            ],
            [
                17009,
                17021
            ],
            [
                17021,
                17051
            ],
            [
                17051,
                17179
            ],
            [
                17179,
                17255
            ],
            [
                17255,
                17536
            ],
            [
                17536,
                17554
            ],
            [
                17554,
                17574
            ],
            [
                17574,
                17632
            ],
            [
                17632,
                17726
            ],
            [
                17726,
                17758
            ],
            [
                17758,
                17844
            ],
            [
                17844,
                17877
            ],
            [
                17877,
                17912
            ],
            [
                17912,
                17953
            ],
            [
                17953,
                17984
            ],
            [
                17984,
                18043
            ],
            [
                18043,
                18079
            ],
            [
                18079,
                18184
            ],
            [
                18184,
                18227
            ],
            [
                18227,
                18250
            ],
            [
                18250,
                18268
            ],
            [
                18268,
                18300
            ],
            [
                18300,
                18320
            ],
            [
                18320,
                18396
            ],
            [
                18396,
                18401
            ],
            [
                18401,
                18527
            ],
            [
                18527,
                18600
            ],
            [
                18600,
                18650
            ],
            [
                18650,
                18729
            ],
            [
                18729,
                18774
            ],
            [
                18774,
                18833
            ],
            [
                18833,
                18970
            ],
            [
                18970,
                19072
            ],
            [
                19072,
                19181
            ],
            [
                19181,
                19323
            ],
            [
                19323,
                19345
            ],
            [
                19345,
                19365
            ],
            [
                19365,
                19395
            ],
            [
                19395,
                19476
            ],
            [
                19476,
                19621
            ],
            [
                19621,
                19638
            ],
            [
                19638,
                19817
            ],
            [
                19817,
                19853
            ],
            [
                19853,
                19882
            ],
            [
                19882,
                19897
            ]
        ],
        "overlap_chars": [
            [
                0,
                52
            ],
            [
                60,
                80
            ],
            [
                88,
                107
            ],
            [
                108,
                111
            ],
            [
                123,
                134
            ],
            [
                134,
                150
            ],
            [
                155,
                181
            ],
            [
                181,
                208
            ],
            [
                208,
                209
            ],
            [
                210,
                257
            ],
            [
                257,
                303
            ],
            [
                303,
                310
            ],
            [
                320,
                343
            ],
            [
                343,
                389
            ],
            [
                392,
                429
            ],
            [
                431,
                463
            ],
            [
                464,
                466
            ],
            [
                475,
                478
            ],
            [
                485,
                490
            ],
            [
                491,
                498
            ],
            [
                509,
                511
            ],
            [
                517,
                519
            ],
            [
                519,
                579
            ],
            [
                588,
                606
            ],
            [
                606,
                656
            ],
            [
                656,
                679
            ],
            [
                683,
                689
            ],
            [
                693,
                697
            ],
            [
                698,
                746
            ],
            [
                747,
                756
            ],
            [
                756,
                761
            ],
            [
                762,
                784
            ],
            [
                784,
                797
            ],
            [
                799,
                811
            ],
            [
                813,
                823
            ],
            [
                831,
                854
            ],
            [
                854,
                856
            ],
            [
                856,
                902
            ],
            [
                902,
                903
            ],
            [
                908,
                946
            ],
            [
                946,
                948
            ],
            [
                948,
                970
            ],
            [
                973,
                1007
            ],
            [
                1010,
                1018
            ],
            [
                1019,
                1088
            ],
            [
                1088,
                1166
            ],
            [
                1180,
                1199
            ],
            [
                1200,
                1228
            ],
            [
                1234,
                1248
            ],
            [
                1250,
                1376
            ],
            [
                1376,
                1377
            ],
            [
                1385,
                1430
            ],
            [
                1431,
                1440
            ],
            [
                1441,
                1466
            ],
            [
                1479,
                1481
            ],
            [
                1481,
                1492
            ],
            [
                1493,
                1512
            ],
            [
                1513,
                1538
            ],
            [
                1539,
                1552
            ],
            [
                1552,
                1553
            ],
            [
                1559,
                1561
            ],
            [
                1578,
                1580
            ],
            [
                1580,
                1621
            ],
            [
                1621,
                1637
            ],
            [
                1637,
                1646
            ],
            [
                1646,
                1660
            ],
            [
                1660,
                1709
            ],
            [
                1709,
                1728
            ],
            [
                1735,
                1757
            ],
            [
                1757,
                1808
            ],
            [
                1811,
                1856
            ],
            [
                1859,
                1915
            ],
            [
                1917,
                1958
            ],
            [
                1969,
                1972
            ],
            [
                1972,
                2015
            ],
            [
                2033,
                2037
            ],
            [
                2038,
                2057
            ],
            [
                2065,
                2067
            ],
            [
                2067,
                2068
            ],
            [
                2069,
                2072
            ],
            [
                2073,
                2092
            ],
            [
                2093,
                2106
            ],
            [
                2106,
                2111
            ],
            [
                2126,
                2128
            ],
            [
                2128,
                2171
            ],
            [
                2174,
                2183
            ],
            [
                2183,
                2185
            ],
            [
                2185,
                2214
            ],
            [
                2214,
                2216
            ],
            [
                2216,
                2225
            ],
            [
                2230,
                2259
            ],
            [
                2259,
                2261
            ],
            [
                2261,
                2283
            ],
            [
                2283,
                2323
            ],
            [
                2323,
                2339
            ],
            [
                2339,
                2350
            ],
            [
                2351,
                2373
            ],
            [
                2373,
                2457
            ],
            [
                2457,
                2503
            ],
            [
                2504,
                2517
            ],
            [
                2517,
                2528
            ],
            [
                2529,
                2532
            ],
            [
                2533,
                2596
            ],
            [
                2596,
                2638
            ],
            [
                2638,
                2639
            ],
            [
                2640,
                2644
            ],
            [
                2645,
                2653
            ],
            [
                2654,
                2671
            ],
            [
                2677,
                2690
            ],
            [
                2691,
                2699
            ],
            [
                2700,
                2702
            ],
            [
                2702,
                2711
            ],
            [
                2712,
                2718
            ],
            [
                2719,
                2744
            ],
            [
                2744,
                2771
            ],
            [
                2771,
                2777
            ],
            [
                2777,
                2779
            ],
            [
                2779,
                2783
            ],
            [
                2783,
                2800
            ],
            [
                2802,
                2810
            ],
            [
                2810,
                2840
            ],
            [
                2840,
                2872
            ],
            [
                2879,
                2881
            ],
            [
                2881,
                2922
            ],
            [
                2922,
                2947
            ],
            [
                2947,
                2961
            ],
            [
                2961,
                2998
            ],
            [
                2998,
                3019
            ],
            [
                3019,
                3083
            ],
            [
                3083,
                3086
            ],
            [
                3096,
                3110
            ],
            [
                3110,
                3124
            ],
            [
                3127,
                3148
            ],
            [
                3148,
                3149
            ],
            [
                3155,
                3156
            ],
            [
                3157,
                3165
            ],
            [
                3166,
                3172
            ],
            [
                3173,
                3180
            ],
            [
                3180,
                3182
            ],
            [
                3182,
                3189
            ],
            [
                3191,
                3228
            ],
            [
                3258,
                3261
            ],
            [
                3262,
                3307
            ],
            [
                3307,
                3313
            ],
            [
                3313,
                3359
            ],
            [
                3368,
                3375
            ],
            [
                3376,
                3378
            ],
            [
                3379,
                3380
            ],
            [
                3381,
                3391
            ],
            [
                3394,
                3398
            ],
            [
                3402,
                3439
            ],
            [
                3439,
                3452
            ],
            [
                3452,
                3455
            ],
            [
                3455,
                3526
            ],
            [
                3527,
                3544
            ],
            [
                3544,
                3606
            ],
            [
                3606,
                3629
            ],
            [
                3629,
                3677
            ],
            [
                3677,
                3679
            ],
            [
                3679,
                3714
            ],
            [
                3717,
                3745
            ],
            [
                3746,
                3788
            ],
            [
                3799,
                3800
            ],
            [
                3802,
                3805
            ],
            [
                3806,
                3842
            ],
            [
                3842,
                3844
            ],
            [
                3844,
                3850
            ],
            [
                3851,
                3938
            ],
            [
                3938,
                3966
            ],
            [
                3972,
                3973
            ],
            [
                3974,
                3987
            ],
            [
                3988,
                3998
            ],
            [
                4004,
                4020
            ],
            [
                4021,
                4037
            ],
            [
                4043,
                4070
            ],
            [
                4071,
                4081
            ],
            [
                4081,
                4082
            ],
            [
                4091,
                4099
            ],
            [
                4105,
                4115
            ],
            [
                4115,
                4163
            ],
            [
                4163,
                4212
            ],
            [
                4213,
                4229
            ],
            [
                4233,
                4234
            ],
            [
                4235,
                4288
            ],
            [
                4288,
                4289
            ],
            [
                4290,
                4306
            ],
            [
                4313,
                4325
            ],
            [
                4326,
                4343
            ],
            [
                4343,
                4501
            ],
            [
                4501,
                4504
            ],
            [
                4504,
                4505
            ],
            [
                4508,
                4513
            ],
            [
                4513,
                4515
            ],
            [
                4516,
                4534
            ],
            [
                4534,
                4535
            ],
            [
                4536,
                4537
            ],
            [
                4537,
                4659
            ],
            [
                4660,
                4665
            ],
            [
                4674,
                4703
            ],
            [
                4703,
                4713
            ],
            [
                4719,
                4822
            ],
            [
                4822,
                4843
            ],
            [
                4852,
                4867
            ],
            [
                4868,
                4890
            ],
            [
                4903,
                4988
            ],
            [
                4997,
                4999
            ],
            [
                5006,
                5008
            ],
            [
                5008,
                5097
            ],
            [
                5102,
                5105
            ],
            [
                5111,
                5113
            ],
            [
                5113,
                5117
            ],
            [
                5118,
                5129
            ],
            [
                5132,
                5149
            ],
            [
                5152,
                5184
            ],
            [
                5189,
                5205
            ],
            [
                5205,
                5222
            ],
            [
                5222,
                5240
            ],
            [
                5240,
                5253
            ],
            [
                5253,
                5263
            ],
            [
                5263,
                5288
            ],
            [
                5288,
                5290
            ],
            [
                5290,
                5317
            ],
            [
                5317,
                5352
            ],
            [
                5352,
                5371
            ],
            [
                5371,
                5378
            ],
            [
                5379,
                5390
            ],
            [
                5402,
                5423
            ],
            [
                5423,
                5424
            ],
            [
                5424,
                5427
            ],
            [
                5428,
                5458
            ],
            [
                5458,
                5488
            ],
            [
                5488,
                5489
            ],
            [
                5490,
                5493
            ],
            [
                5494,
                5510
            ],
            [
                5510,
                5522
            ],
            [
                5528,
                5560
            ],
            [
                5560,
                5600
            ],
            [
                5600,
                5624
            ],
            [
                5625,
                5657
            ],
            [
                5667,
                5668
            ],
            [
                5670,
                5674
            ],
            [
                5675,
                5702
            ],
            [
                5711,
                5713
            ],
            [
                5713,
                5743
            ],
            [
                5748,
                5778
            ],
            [
                5786,
                5818
            ],
            [
                5818,
                5889
            ],
            [
                5889,
                5907
            ],
            [
                5908,
                5920
            ],
            [
                5921,
                5930
            ],
            [
                5931,
                5945
            ],
            [
                5945,
                5947
            ],
            [
                5947,
                5971
            ],
            [
                5972,
                5977
            ],
            [
                5978,
                6039
            ],
            [
                6040,
                6059
            ],
            [
                6060,
                6063
            ],
            [
                6064,
                6068
            ],
            [
                6069,
                6073
            ],
            [
                6073,
                6075
            ],
            [
                6075,
                6110
            ],
            [
                6110,
                6141
            ],
            [
                6149,
                6192
            ],
            [
                6193,
                6209
            ],
            [
                6210,
                6212
            ],
            [
                6219,
                6227
            ],
            [
                6234,
                6277
            ],
            [
                6277,
                6338
            ],
            [
                6338,
                6385
            ],
            [
                6386,
                6398
            ],
            [
                6399,
                6403
            ],
            [
                6405,
                6407
            ],
            [
                6407,
                6500
            ],
            [
                6501,
                6508
            ],
            [
                6508,
                6547
            ],
            [
                6547,
                6664
            ],
            [
                6664,
                6689
            ],
            [
                6716,
                6727
            ],
            [
                6730,
                6779
            ],
            [
                6779,
                6789
            ],
            [
                6797,
                6799
            ],
            [
                6799,
                6823
            ],
            [
                6824,
                6839
            ],
            [
                6840,
                6866
            ],
            [
                6866,
                6871
            ],
            [
                6880,
                6881
            ],
            [
                6886,
                6889
            ],
            [
                6895,
                6906
            ],
            [
                6917,
                6922
            ],
            [
                6922,
                6976
            ],
            [
                6976,
                7007
            ],
            [
                7008,
                7014
            ],
            [
                7019,
                7021
            ],
            [
                7021,
                7033
            ],
            [
                7058,
                7060
            ],
            [
                7060,
                7113
            ],
            [
                7117,
                7120
            ],
            [
                7121,
                7126
            ],
            [
                7127,
                7165
            ],
            [
                7166,
                7175
            ],
            [
                7176,
                7231
            ],
            [
                7234,
                7261
            ],
            [
                7262,
                7288
            ],
            [
                7299,
                7314
            ],
            [
                7314,
                7369
            ],
            [
                7369,
                7372
            ],
            [
                7373,
                7409
            ],
            [
                7419,
                7423
            ],
            [
                7424,
                7429
            ],
            [
                7430,
                7444
            ],
            [
                7444,
                7499
            ],
            [
                7500,
                7525
            ],
            [
                7526,
                7529
            ],
            [
                7533,
                7539
            ],
            [
                7540,
                7543
            ],
            [
                7551,
                7558
            ],
            [
                7558,
                7560
            ],
            [
                7560,
                7564
            ],
            [
                7565,
                7572
            ],
            [
                7573,
                7620
            ],
            [
                7620,
                7621
            ],
            [
                7622,
                7659
            ],
            [
                7659,
                7661
            ],
            [
                7661,
                7708
            ],
            [
                7720,
                7775
            ],
            [
                7783,
                7784
            ],
            [
                7785,
                7842
            ],
            [
                7843,
                7853
            ],
            [
                7853,
                7869
            ],
            [
                7877,
                7906
            ],
            [
                7906,
                7908
            ],
            [
                7908,
                7947
            ],
            [
                7950,
                8004
            ],
            [
                8007,
                8049
            ],
            [
                8049,
                8052
            ],
            [
                8052,
                8079
            ],
            [
                8079,
                8081
            ],
            [
                8081,
                8100
            ],
            [
                8101,
                8104
            ],
            [
                8105,
                8111
            ],
            [
                8113,
                8117
            ],
            [
                8118,
                8121
            ],
            [
                8122,
                8163
            ],
            [
                8163,
                8204
            ],
            [
                8205,
                8237
            ],
            [
                8238,
                8250
            ],
            [
                8251,
                8325
            ],
            [
                8325,
                8330
            ],
            [
                8335,
                8361
            ],
            [
                8362,
                8395
            ],
            [
                8395,
                8509
            ],
            [
                8510,
                8542
            ],
            [
                8543,
                8573
            ],
            [
                8579,
                8582
            ],
            [
                8583,
                8585
            ],
            [
                8593,
                8687
            ],
            [
                8693,
                8699
            ],
            [
                8699,
                8700
            ],
            [
                8701,
                8725
            ],
            [
                8727,
                8730
            ],
            [
                8731,
                8747
            ],
            [
                8748,
                8756
            ],
            [
                8756,
                8812
            ],
            [
                8812,
                8814
            ],
            [
                8814,
                8857
            ],
            [
                8861,
                8866
            ],
            [
                8866,
                8887
            ],
            [
                8896,
                8911
            ],
            [
                8911,
                8912
            ],
            [
                8913,
                8958
            ],
            [
                8958,
                8960
            ],
            [
                8960,
                8981
            ],
            [
                8981,
                9009
            ],
            [
                9010,
                9013
            ],
            [
                9014,
                9052
            ],
            [
                9052,
                9252
            ],
            [
                9252,
                9280
            ],
            [
                9280,
                9283
            ],
            [
                9283,
                9301
            ],
            [
                9301,
                9348
            ],
            [
                9349,
                9391
            ],
            [
                9391,
                9394
            ],
            [
                9394,
                9463
            ],
            [
                9466,
                9506
            ],
            [
                9513,
                9515
            ],
            [
                9516,
                9541
            ],
            [
                9542,
                9549
            ],
            [
                9556,
                9583
            ],
            [
                9583,
                9586
            ],
            [
                9586,
                9647
            ],
            [
                9653,
                9666
            ],
            [
                9666,
                9668
            ],
            [
                9668,
                9710
            ],
            [
                9712,
                9747
            ],
            [
                9748,
                9765
            ],
            [
                9771,
                9781
            ],
            [
                9782,
                9800
            ],
            [
                9811,
                9814
            ],
            [
                9815,
                9822
            ],
            [
                9822,
                9832
            ],
            [
                9833,
                9852
            ],
            [
                9853,
                9857
            ],
            [
                9858,
                9868
            ],
            [
                9868,
                9942
            ],
            [
                9942,
                9947
            ],
            [
                9962,
                9983
            ],
            [
                9983,
                10029
            ],
            [
                10030,
                10045
            ],
            [
                10046,
                10055
            ],
            [
                10057,
                10058
            ],
            [
                10064,
                10065
            ],
            [
                10066,
                10100
            ],
            [
                10100,
                10126
            ],
            [
                10127,
                10161
            ],
            [
                10162,
                10181
            ],
            [
                10182,
                10236
            ],
            [
                10236,
                10306
            ],
            [
                10307,
                10310
            ],
            [
                10311,
                10340
            ],
            [
                10341,
                10344
            ],
            [
                10345,
                10380
            ],
            [
                10381,
                10391
            ],
            [
                10398,
                10401
            ],
            [
                10402,
                10415
            ],
            [
                10416,
                10452
            ],
            [
                10453,
                10484
            ],
            [
                10484,
                10486
            ],
            [
                10486,
                10491
            ],
            [
                10491,
                10559
            ],
            [
                10560,
                10567
            ],
            [
                10568,
                10631
            ],
            [
                10632,
                10648
            ],
            [
                10648,
                10649
            ],
            [
                10650,
                10684
            ],
            [
                10685,
                10688
            ],
            [
                10689,
                10753
            ],
            [
                10753,
                10755
            ],
            [
                10756,
                10791
            ],
            [
                10796,
                10804
            ],
            [
                10805,
                10864
            ],
            [
                10867,
                10902
            ],
            [
                10903,
                10912
            ],
            [
                10914,
                10928
            ],
            [
                10928,
                10941
            ],
            [
                10941,
                10944
            ],
            [
                10944,
                10992
            ],
            [
                10992,
                11019
            ],
            [
                11019,
                11035
            ],
            [
                11035,
                11037
            ],
            [
                11037,
                11055
            ],
            [
                11055,
                11093
            ],
            [
                11093,
                11128
            ],
            [
                11129,
                11133
            ],
            [
                11133,
                11134
            ],
            [
                11135,
                11153
            ],
            [
                11154,
                11155
            ],
            [
                11161,
                11173
            ],
            [
                11173,
                11175
            ],
            [
                11175,
                11176
            ],
            [
                11183,
                11193
            ],
            [
                11194,
                11203
            ],
            [
                11210,
                11256
            ],
            [
                11262,
                11266
            ],
            [
                11267,
                11284
            ],
            [
                11284,
                11298
            ],
            [
                11299,
                11315
            ],
            [
                11316,
                11320
            ],
            [
                11320,
                11343
            ],
            [
                11344,
                11422
            ],
            [
                11422,
                11424
            ],
            [
                11424,
                11432
            ],
            [
                11433,
                11441
            ],
            [
                11442,
                11448
            ],
            [
                11448,
                11450
            ],
            [
                11450,
                11493
            ],
            [
                11493,
                11554
            ],
            [
                11555,
                11573
            ],
            [
                11585,
                11586
            ],
            [
                11594,
                11659
            ],
            [
                11659,
                11714
            ],
            [
                11714,
                11736
            ],
            [
                11739,
                11747
            ],
            [
                11750,
                11756
            ],
            [
                11759,
                11782
            ],
            [
                11782,
                11795
            ],
            [
                11795,
                11811
            ],
            [
                11811,
                11834
            ],
            [
                11834,
                11840
            ],
            [
                11858,
                11872
            ],
            [
                11873,
                11900
            ],
            [
                11900,
                11909
            ],
            [
                11910,
                12021
            ],
            [
                12028,
                12037
            ],
            [
                12047,
                12062
            ],
            [
                12062,
                12098
            ],
            [
                12099,
                12107
            ],
            [
                12111,
                12120
            ],
            [
                12120,
                12184
            ],
            [
                12190,
                12194
            ],
            [
                12194,
                12196
            ],
            [
                12196,
                12254
            ],
            [
                12255,
                12261
            ],
            [
                12262,
                12264
            ],
            [
                12265,
                12281
            ],
            [
                12281,
                12283
            ],
            [
                12283,
                12302
            ],
            [
                12303,
                12369
            ],
            [
                12369,
                12401
            ],
            [
                12401,
                12411
            ],
            [
                12411,
                12460
            ],
            [
                12460,
                12461
            ],
            [
                12467,
                12470
            ],
            [
                12474,
                12492
            ],
            [
                12492,
                12494
            ],
            [
                12494,
                12497
            ],
            [
                12503,
                12525
            ],
            [
                12531,
                12558
            ],
            [
                12561,
                12588
            ],
            [
                12588,
                12589
            ],
            [
                12590,
                12592
            ],
            [
                12593,
                12599
            ],
            [
                12601,
                12684
            ],
            [
                12693,
                12695
            ],
            [
                12695,
                12713
            ],
            [
                12713,
                12730
            ],
            [
                12731,
                12743
            ],
            [
                12745,
                12756
            ],
            [
                12756,
                12807
            ],
            [
                12810,
                12835
            ],
            [
                12835,
                12837
            ],
            [
                12837,
                12844
            ],
            [
                12845,
                12853
            ],
            [
                12853,
                12855
            ],
            [
                12855,
                12862
            ],
            [
                12863,
                12957
            ],
            [
                12957,
                12966
            ],
            [
                12966,
                13001
            ],
            [
                13008,
                13029
            ],
            [
                13029,
                13036
            ],
            [
                13048,
                13059
            ],
            [
                13060,
                13083
            ],
            [
                13088,
                13111
            ],
            [
                13111,
                13126
            ],
            [
                13131,
                13141
            ],
            [
                13141,
                13147
            ],
            [
                13148,
                13152
            ],
            [
                13162,
                13183
            ],
            [
                13183,
                13185
            ],
            [
                13185,
                13222
            ],
            [
                13222,
                13231
            ],
            [
                13235,
                13242
            ],
            [
                13251,
                13283
            ],
            [
                13283,
                13349
            ],
            [
                13352,
                13357
            ],
            [
                13357,
                13381
            ],
            [
                13386,
                13404
            ],
            [
                13404,
                13424
            ],
            [
                13424,
                13460
            ],
            [
                13464,
                13469
            ],
            [
                13470,
                13477
            ],
            [
                13478,
                13488
            ],
            [
                13488,
                13489
            ],
            [
                13490,
                13495
            ],
            [
                13496,
                13514
            ],
            [
                13519,
                13532
            ],
            [
                13546,
                13556
            ],
            [
                13556,
                13592
            ],
            [
                13593,
                13604
            ],
            [
                13604,
                13647
            ],
            [
                13647,
                13670
            ],
            [
                13677,
                13727
            ],
            [
                13733,
                13741
            ],
            [
                13746,
                13843
            ],
            [
                13844,
                13873
            ],
            [
                13874,
                13915
            ],
            [
                13915,
                13959
            ],
            [
                13959,
                13992
            ],
            [
                13993,
                14098
            ],
            [
                14098,
                14135
            ],
            [
                14135,
                14149
            ],
            [
                14154,
                14180
            ],
            [
                14180,
                14182
            ],
            [
                14182,
                14202
            ],
            [
                14202,
                14203
            ],
            [
                14208,
                14236
            ],
            [
                14236,
                14285
            ],
            [
                14286,
                14299
            ],
            [
                14299,
                14319
            ],
            [
                14319,
                14325
            ],
            [
                14330,
                14347
            ],
            [
                14347,
                14366
            ],
            [
                14366,
                14394
            ],
            [
                14395,
                14411
            ],
            [
                14423,
                14438
            ],
            [
                14438,
                14440
            ],
            [
                14440,
                14466
            ],
            [
                14466,
                14467
            ],
            [
                14468,
                14524
            ],
            [
                14527,
                14530
            ],
            [
                14531,
                14546
            ],
            [
                14547,
                14552
            ],
            [
                14559,
                14573
            ],
            [
                14574,
                14611
            ],
            [
                14611,
                14659
            ],
            [
                14659,
                14702
            ],
            [
                14702,
                14704
            ],
            [
                14704,
                14733
            ],
            [
                14733,
                14740
            ],
            [
                14741,
                14770
            ],
            [
                14771,
                14777
            ],
            [
                14778,
                14795
            ],
            [
                14796,
                14801
            ],
            [
                14806,
                14812
            ],
            [
                14812,
                14920
            ],
            [
                14921,
                14938
            ],
            [
                14938,
                14964
            ],
            [
                14964,
                14986
            ],
            [
                14986,
                14987
            ],
            [
                14990,
                15018
            ],
            [
                15021,
                15026
            ],
            [
                15027,
                15043
            ],
            [
                15044,
                15058
            ],
            [
                15076,
                15078
            ],
            [
                15078,
                15086
            ],
            [
                15086,
                15130
            ],
            [
                15136,
                15182
            ],
            [
                15182,
                15197
            ],
            [
                15198,
                15234
            ],
            [
                15234,
                15259
            ],
            [
                15268,
                15270
            ],
            [
                15270,
                15314
            ],
            [
                15314,
                15332
            ],
            [
                15335,
                15375
            ],
            [
                15375,
                15396
            ],
            [
                15402,
                15437
            ],
            [
                15437,
                15462
            ],
            [
                15463,
                15479
            ],
            [
                15481,
                15517
            ],
            [
                15517,
                15518
            ],
            [
                15519,
                15540
            ],
            [
                15540,
                15541
            ],
            [
                15555,
                15559
            ],
            [
                15560,
                15592
            ],
            [
                15592,
                15601
            ],
            [
                15621,
                15658
            ],
            [
                15671,
                15673
            ],
            [
                15673,
                15688
            ],
            [
                15689,
                15713
            ],
            [
                15714,
                15717
            ],
            [
                15724,
                15725
            ],
            [
                15726,
                15739
            ],
            [
                15740,
                15759
            ],
            [
                15760,
                15764
            ],
            [
                15764,
                15788
            ],
            [
                15789,
                15808
            ],
            [
                15808,
                15912
            ],
            [
                15913,
                15918
            ],
            [
                15918,
                15956
            ],
            [
                15959,
                15963
            ],
            [
                15964,
                15972
            ],
            [
                15972,
                16047
            ],
            [
                16056,
                16079
            ],
            [
                16079,
                16134
            ],
            [
                16135,
                16149
            ],
            [
                16150,
                16163
            ],
            [
                16163,
                16170
            ],
            [
                16171,
                16180
            ],
            [
                16183,
                16200
            ],
            [
                16200,
                16235
            ],
            [
                16236,
                16287
            ],
            [
                16287,
                16333
            ],
            [
                16333,
                16376
            ],
            [
                16378,
                16408
            ],
            [
                16408,
                16460
            ],
            [
                16461,
                16472
            ],
            [
                16481,
                16483
            ],
            [
                16492,
                16496
            ],
            [
                16497,
                16500
            ],
            [
                16508,
                16511
            ],
            [
                16518,
                16523
            ],
            [
                16529,
                16538
            ],
            [
                16542,
                16545
            ],
            [
                16551,
                16555
            ],
            [
                16555,
                16557
            ],
            [
                16557,
                16650
            ],
            [
                16650,
                16652
            ],
            [
                16653,
                16713
            ],
            [
                16716,
                16728
            ],
            [
                16729,
                16732
            ],
            [
                16737,
                16740
            ],
            [
                16759,
                16761
            ],
            [
                16761,
                16767
            ],
            [
                16774,
                16790
            ],
            [
                16791,
                16805
            ],
            [
                16806,
                16809
            ],
            [
                16810,
                16816
            ],
            [
                16821,
                16830
            ],
            [
                16830,
                16832
            ],
            [
                16833,
                16881
            ],
            [
                16882,
                16884
            ],
            [
                16885,
                16916
            ],
            [
                16922,
                16941
            ],
            [
                16941,
                16943
            ],
            [
                16943,
                16964
            ],
            [
                16964,
                16978
            ],
            [
                16978,
                16988
            ],
            [
                16988,
                17009
            ],
            [
                17009,
                17016
            ],
            [
                17017,
                17019
            ],
            [
                17019,
                17021
            ],
            [
                17021,
                17051
            ],
            [
                17051,
                17059
            ],
            [
                17060,
                17081
            ],
            [
                17082,
                17086
            ],
            [
                17087,
                17106
            ],
            [
                17122,
                17123
            ],
            [
                17124,
                17130
            ],
            [
                17131,
                17137
            ],
            [
                17144,
                17146
            ],
            [
                17147,
                17157
            ],
            [
                17161,
                17165
            ],
            [
                17166,
                17168
            ],
            [
                17169,
                17172
            ],
            [
                17173,
                17177
            ],
            [
                17179,
                17181
            ],
            [
                17182,
                17225
            ],
            [
                17226,
                17234
            ],
            [
                17235,
                17255
            ],
            [
                17255,
                17257
            ],
            [
                17265,
                17286
            ],
            [
                17297,
                17307
            ],
            [
                17308,
                17324
            ],
            [
                17325,
                17328
            ],
            [
                17333,
                17356
            ],
            [
                17357,
                17362
            ],
            [
                17363,
                17382
            ],
            [
                17382,
                17437
            ],
            [
                17438,
                17453
            ],
            [
                17454,
                17482
            ],
            [
                17483,
                17495
            ],
            [
                17496,
                17504
            ],
            [
                17508,
                17517
            ],
            [
                17518,
                17534
            ],
            [
                17536,
                17537
            ],
            [
                17537,
                17554
            ],
            [
                17554,
                17574
            ],
            [
                17574,
                17632
            ],
            [
                17632,
                17726
            ],
            [
                17726,
                17758
            ],
            [
                17758,
                17784
            ],
            [
                17785,
                17808
            ],
            [
                17818,
                17844
            ],
            [
                17844,
                17845
            ],
            [
                17850,
                17865
            ],
            [
                17865,
                17877
            ],
            [
                17877,
                17884
            ],
            [
                17884,
                17889
            ],
            [
                17890,
                17912
            ],
            [
                17912,
                17933
            ],
            [
                17943,
                17950
            ],
            [
                17953,
                17982
            ],
            [
                17982,
                17984
            ],
            [
                17984,
                18043
            ],
            [
                18043,
                18051
            ],
            [
                18051,
                18052
            ],
            [
                18057,
                18079
            ],
            [
                18081,
                18098
            ],
            [
                18114,
                18173
            ],
            [
                18184,
                18227
            ],
            [
                18227,
                18250
            ],
            [
                18250,
                18268
            ],
            [
                18268,
                18300
            ],
            [
                18300,
                18320
            ],
            [
                18320,
                18389
            ],
            [
                18393,
                18396
            ],
            [
                18396,
                18401
            ],
            [
                18401,
                18451
            ],
            [
                18452,
                18509
            ],
            [
                18523,
                18524
            ],
            [
                18524,
                18527
            ],
            [
                18527,
                18528
            ],
            [
                18528,
                18600
            ],
            [
                18600,
                18650
            ],
            [
                18650,
                18729
            ],
            [
                18729,
                18756
            ],
            [
                18758,
                18774
            ],
            [
                18774,
                18833
            ],
            [
                18833,
                18936
            ],
            [
                18937,
                18970
            ],
            [
                18970,
                19010
            ],
            [
                19010,
                19072
            ],
            [
                19072,
                19122
            ],
            [
                19123,
                19127
            ],
            [
                19128,
                19178
            ],
            [
                19178,
                19181
            ],
            [
                19181,
                19263
            ],
            [
                19276,
                19291
            ],
            [
                19294,
                19304
            ],
            [
                19305,
                19323
            ],
            [
                19323,
                19345
            ],
            [
                19345,
                19365
            ],
            [
                19365,
                19395
            ],
            [
                19395,
                19474
            ],
            [
                19474,
                19475
            ],
            [
                19476,
                19477
            ],
            [
                19478,
                19496
            ],
            [
                19497,
                19598
            ],
            [
                19604,
                19619
            ],
            [
                19621,
                19635
            ],
            [
                19638,
                19683
            ],
            [
                19684,
                19743
            ],
            [
                19745,
                19748
            ],
            [
                19756,
                19815
            ],
            [
                19815,
                19816
            ],
            [
                19817,
                19853
            ],
            [
                19853,
                19882
            ],
            [
                19882,
                19897
            ]
        ],
        "row_chars": [
            [
                0,
                134
            ],
            [
                134,
                181
            ],
            [
                181,
                210
            ],
            [
                210,
                210
            ],
            [
                210,
                210
            ],
            [
                210,
                257
            ],
            [
                257,
                343
            ],
            [
                343,
                519
            ],
            [
                519,
                606
            ],
            [
                606,
                656
            ],
            [
                656,
                784
            ],
            [
                784,
                856
            ],
            [
                856,
                948
            ],
            [
                948,
                1088
            ],
            [
                1088,
                1088
            ],
            [
                1088,
                1431
            ],
            [
                1431,
                1481
            ],
            [
                1481,
                1580
            ],
            [
                1580,
                1621
            ],
            [
                1621,
                1637
            ],
            [
                1637,
                1646
            ],
            [
                1646,
                1660
            ],
            [
                1660,
                1709
            ],
            [
                1709,
                1709
            ],
            [
                1709,
                1917
            ],
            [
                1917,
                1972
            ],
            [
                1972,
                1972
            ],
            [
                1972,
                2015
            ],
            [
                2015,
                2106
            ],
            [
                2106,
                2128
            ],
            [
                2128,
                2185
            ],
            [
                2185,
                2185
            ],
            [
                2185,
                2185
            ],
            [
                2185,
                2185
            ],
            [
                2185,
                2216
            ],
            [
                2216,
                2261
            ],
            [
                2261,
                2283
            ],
            [
                2283,
                2323
            ],
            [
                2323,
                2339
            ],
            [
                2339,
                2373
            ],
            [
                2373,
                2457
            ],
            [
                2457,
                2517
            ],
            [
                2517,
                2596
            ],
            [
                2596,
                2672
            ],
            [
                2672,
                2744
            ],
            [
                2744,
                2771
            ],
            [
                2771,
                2779
            ],
            [
                2779,
                2783
            ],
            [
                2783,
                2802
            ],
            [
                2802,
                2802
            ],
            [
                2802,
                2810
            ],
            [
                2810,
                2810
            ],
            [
                2810,
                2810
            ],
            [
                2810,
                2840
            ],
            [
                2840,
                2840
            ],
            [
                2840,
                2881
            ],
            [
                2881,
                2922
            ],
            [
                2922,
                2922
            ],
            [
                2922,
                2947
            ],
            [
                2947,
                2961
            ],
            [
                2961,
                2998
            ],
            [
                2998,
                3019
            ],
            [
                3019,
                3083
            ],
            [
                3083,
                3110
            ],
            [
                3110,
                3127
            ],
            [
                3127,
                3127
            ],
            [
                3127,
                3182
            ],
            [
                3182,
                3182
            ],
            [
                3182,
                3182
            ],
            [
                3182,
                3191
            ],
            [
                3191,
                3258
            ],
            [
                3258,
                3258
            ],
            [
                3258,
                3258
            ],
            [
                3258,
                3258
            ],
            [
                3258,
                3307
            ],
            [
                3307,
                3313
            ],
            [
                3313,
                3393
            ],
            [
                3393,
                3393
            ],
            [
                3393,
                3439
            ],
            [
                3439,
                3455
            ],
            [
                3455,
                3544
            ],
            [
                3544,
                3629
            ],
            [
                3629,
                3679
            ],
            [
                3679,
                3717
            ],
            [
                3717,
                3717
            ],
            [
                3717,
                3745
            ],
            [
                3745,
                3745
            ],
            [
                3745,
                3745
            ],
            [
                3745,
                3745
            ],
            [
                3745,
                3844
            ],
            [
                3844,
                3938
            ],
            [
                3938,
                4081
            ],
            [
                4081,
                4115
            ],
            [
                4115,
                4163
            ],
            [
                4163,
                4343
            ],
            [
                4343,
                4504
            ],
            [
                4504,
                4703
            ],
            [
                4703,
                4822
            ],
            [
                4822,
                5008
            ],
            [
                5008,
                5113
            ],
            [
                5113,
                5132
            ],
            [
                5132,
                5132
            ],
            [
                5132,
                5132
            ],
            [
                5132,
                5132
            ],
            [
                5132,
                5205
            ],
            [
                5205,
                5222
            ],
            [
                5222,
                5222
            ],
            [
                5222,
                5240
            ],
            [
                5240,
                5253
            ],
            [
                5253,
                5263
            ],
            [
                5263,
                5290
            ],
            [
                5290,
                5317
            ],
            [
                5317,
                5352
            ],
            [
                5352,
                5371
            ],
            [
                5371,
                5423
            ],
            [
                5423,
                5458
            ],
            [
                5458,
                5510
            ],
            [
                5510,
                5560
            ],
            [
                5560,
                5600
            ],
            [
                5600,
                5624
            ],
            [
                5624,
                5624
            ],
            [
                5624,
                5713
            ],
            [
                5713,
                5818
            ],
            [
                5818,
                5889
            ],
            [
                5889,
                5947
            ],
            [
                5947,
                6075
            ],
            [
                6075,
                6110
            ],
            [
                6110,
                6277
            ],
            [
                6277,
                6338
            ],
            [
                6338,
                6407
            ],
            [
                6407,
                6508
            ],
            [
                6508,
                6547
            ],
            [
                6547,
                6664
            ],
            [
                6664,
                6664
            ],
            [
                6664,
                6664
            ],
            [
                6664,
                6664
            ],
            [
                6664,
                6779
            ],
            [
                6779,
                6799
            ],
            [
                6799,
                6922
            ],
            [
                6922,
                6976
            ],
            [
                6976,
                7021
            ],
            [
                7021,
                7060
            ],
            [
                7060,
                7176
            ],
            [
                7176,
                7176
            ],
            [
                7176,
                7176
            ],
            [
                7176,
                7314
            ],
            [
                7314,
                7369
            ],
            [
                7369,
                7369
            ],
            [
                7369,
                7369
            ],
            [
                7369,
                7369
            ],
            [
                7369,
                7444
            ],
            [
                7444,
                7560
            ],
            [
                7560,
                7620
            ],
            [
                7620,
                7661
            ],
            [
                7661,
                7708
            ],
            [
                7708,
                7785
            ],
            [
                7785,
                7785
            ],
            [
                7785,
                7853
            ],
            [
                7853,
                7853
            ],
            [
                7853,
                7908
            ],
            [
                7908,
                8052
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8163
            ],
            [
                8163,
                8205
            ],
            [
                8205,
                8205
            ],
            [
                8205,
                8238
            ],
            [
                8238,
                8251
            ],
            [
                8251,
                8325
            ],
            [
                8325,
                8362
            ],
            [
                8362,
                8395
            ],
            [
                8395,
                8543
            ],
            [
                8543,
                8756
            ],
            [
                8756,
                8814
            ],
            [
                8814,
                8866
            ],
            [
                8866,
                8887
            ],
            [
                8887,
                8960
            ],
            [
                8960,
                8981
            ],
            [
                8981,
                9052
            ],
            [
                9052,
                9252
            ],
            [
                9252,
                9283
            ],
            [
                9283,
                9301
            ],
            [
                9301,
                9301
            ],
            [
                9301,
                9394
            ],
            [
                9394,
                9466
            ],
            [
                9466,
                9466
            ],
            [
                9466,
                9586
            ],
            [
                9586,
                9668
            ],
            [
                9668,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9822
            ],
            [
                9822,
                9942
            ],
            [
                9942,
                9983
            ],
            [
                9983,
                9983
            ],
            [
                9983,
                10100
            ],
            [
                10100,
                10236
            ],
            [
                10236,
                10486
            ],
            [
                10486,
                10491
            ],
            [
                10491,
                10753
            ],
            [
                10753,
                10867
            ],
            [
                10867,
                10867
            ],
            [
                10867,
                10928
            ],
            [
                10928,
                10944
            ],
            [
                10944,
                10992
            ],
            [
                10992,
                11019
            ],
            [
                11019,
                11037
            ],
            [
                11037,
                11037
            ],
            [
                11037,
                11037
            ],
            [
                11037,
                11055
            ],
            [
                11055,
                11093
            ],
            [
                11093,
                11093
            ],
            [
                11093,
                11175
            ],
            [
                11175,
                11284
            ],
            [
                11284,
                11424
            ],
            [
                11424,
                11450
            ],
            [
                11450,
                11493
            ],
            [
                11493,
                11659
            ],
            [
                11659,
                11714
            ],
            [
                11714,
                11739
            ],
            [
                11739,
                11739
            ],
            [
                11739,
                11782
            ],
            [
                11782,
                11795
            ],
            [
                11795,
                11811
            ],
            [
                11811,
                11834
            ],
            [
                11834,
                11900
            ],
            [
                11900,
                12062
            ],
            [
                12062,
                12120
            ],
            [
                12120,
                12196
            ],
            [
                12196,
                12283
            ],
            [
                12283,
                12369
            ],
            [
                12369,
                12401
            ],
            [
                12401,
                12411
            ],
            [
                12411,
                12460
            ],
            [
                12460,
                12494
            ],
            [
                12494,
                12558
            ],
            [
                12558,
                12588
            ],
            [
                12588,
                12601
            ],
            [
                12601,
                12695
            ],
            [
                12695,
                12713
            ],
            [
                12713,
                12745
            ],
            [
                12745,
                12756
            ],
            [
                12756,
                12837
            ],
            [
                12837,
                12855
            ],
            [
                12855,
                12957
            ],
            [
                12957,
                12966
            ],
            [
                12966,
                13029
            ],
            [
                13029,
                13083
            ],
            [
                13083,
                13111
            ],
            [
                13111,
                13141
            ],
            [
                13141,
                13185
            ],
            [
                13185,
                13222
            ],
            [
                13222,
                13283
            ],
            [
                13283,
                13357
            ],
            [
                13357,
                13404
            ],
            [
                13404,
                13424
            ],
            [
                13424,
                13556
            ],
            [
                13556,
                13592
            ],
            [
                13592,
                13592
            ],
            [
                13592,
                13604
            ],
            [
                13604,
                13647
            ],
            [
                13647,
                13741
            ],
            [
                13741,
                13874
            ],
            [
                13874,
                13959
            ],
            [
                13959,
                13993
            ],
            [
                13993,
                13993
            ],
            [
                13993,
                14098
            ],
            [
                14098,
                14182
            ],
            [
                14182,
                14236
            ],
            [
                14236,
                14299
            ],
            [
                14299,
                14319
            ],
            [
                14319,
                14347
            ],
            [
                14347,
                14440
            ],
            [
                14440,
                14611
            ],
            [
                14611,
                14659
            ],
            [
                14659,
                14704
            ],
            [
                14704,
                14733
            ],
            [
                14733,
                14812
            ],
            [
                14812,
                14938
            ],
            [
                14938,
                14964
            ],
            [
                14964,
                14986
            ],
            [
                14986,
                15018
            ],
            [
                15018,
                15058
            ],
            [
                15058,
                15058
            ],
            [
                15058,
                15058
            ],
            [
                15058,
                15058
            ],
            [
                15058,
                15058
            ],
            [
                15058,
                15078
            ],
            [
                15078,
                15182
            ],
            [
                15182,
                15234
            ],
            [
                15234,
                15234
            ],
            [
                15234,
                15270
            ],
            [
                15270,
                15314
            ],
            [
                15314,
                15335
            ],
            [
                15335,
                15375
            ],
            [
                15375,
                15375
            ],
            [
                15375,
                15437
            ],
            [
                15437,
                15481
            ],
            [
                15481,
                15592
            ],
            [
                15592,
                15673
            ],
            [
                15673,
                15808
            ],
            [
                15808,
                15918
            ],
            [
                15918,
                16079
            ],
            [
                16079,
                16163
            ],
            [
                16163,
                16163
            ],
            [
                16163,
                16200
            ],
            [
                16200,
                16287
            ],
            [
                16287,
                16333
            ],
            [
                16333,
                16408
            ],
            [
                16408,
                16557
            ],
            [
                16557,
                16650
            ],
            [
                16650,
                16761
            ],
            [
                16761,
                16830
            ],
            [
                16830,
                16830
            ],
            [
                16830,
                16943
            ],
            [
                16943,
                16964
            ],
            [
                16964,
                16978
            ],
            [
                16978,
                16988
            ],
            [
                16988,
                17009
            ],
            [
                17009,
                17021
            ],
            [
                17021,
                17051
            ],
            [
                17051,
                17255
            ],
            [
                17255,
                17536
            ],
            [
                17536,
                17554
            ],
            [
                17554,
                17574
            ],
            [
                17574,
                17574
            ],
            [
                17574,
                17632
            ],
            [
                17632,
                17726
            ],
            [
                17726,
                17758
            ],
            [
                17758,
                17844
            ],
            [
                17844,
                17877
            ],
            [
                17877,
                17912
            ],
            [
                17912,
                17953
            ],
            [
                17953,
                17984
            ],
            [
                17984,
                18043
            ],
            [
                18043,
                18043
            ],
            [
                18043,
                18079
            ],
            [
                18079,
                18184
            ],
            [
                18184,
                18184
            ],
            [
                18184,
                18227
            ],
            [
                18227,
                18250
            ],
            [
                18250,
                18268
            ],
            [
                18268,
                18300
            ],
            [
                18300,
                18320
            ],
            [
                18320,
                18396
            ],
            [
                18396,
                18401
            ],
            [
                18401,
                18527
            ],
            [
                18527,
                18600
            ],
            [
                18600,
                18650
            ],
            [
                18650,
                18729
            ],
            [
                18729,
                18774
            ],
            [
                18774,
                18833
            ],
            [
                18833,
                18833
            ],
            [
                18833,
                18970
            ],
            [
                18970,
                19072
            ],
            [
                19072,
                19181
            ],
            [
                19181,
                19323
            ],
            [
                19323,
                19345
            ],
            [
                19345,
                19365
            ],
            [
                19365,
                19395
            ],
            [
                19395,
                19638
            ],
            [
                19638,
                19638
            ],
            [
                19638,
                19817
            ],
            [
                19817,
                19853
            ],
            [
                19853,
                19882
            ],
            [
                19882,
                19897
            ]
        ]
    }
}