{
    "original": {
        "text": "1801-I have just returned from a visit to my landlord-the solitary neighbour that I shall be troubled with. This is certainly a beautiful country! In all England, I do not believe that I could have fixed on a situation so completely removed from the stir of society. A perfect misanthropist's Heaven-and Mr. Heathcliff and I are such a suitable pair to divide the desolation between us. A capital fellow! He little imagined how my heart warmed towards him when I beheld his black eyes withdraw so suspiciously under their brows, as I rode up, and when his fingers sheltered themselves, with a jealous resolution, still further in his waistcoat, as I announced my name.\n\"Mr. Heathcliff?\" I said.\nA nod was the answer.\n\"Mr. Lockwood, your new tenant, sir. I do myself the honour of calling as soon as possible after my arrival, to express the hope that I have not inconvenienced you by my perseverance in soliciting the occupation of Thrushcross Grange: I heard yesterday you had had some thoughts-\"\n\"Thrushcross Grange is my own, sir,\" he interrupted, wincing. \"I should not allow any one to inconvenience me, if I could hinder it-walk in!\"\nThe \"walk in\" was uttered with closed teeth, and expressed the sentiment, \"Go to the Deuce!\" even the gate over which he leant manifested no sympathising movement to the words; and I think that circumstance determined me to accept the invitation: I felt interested in a man who seemed more exaggeratedly reserved than myself.\nWhen he saw my horse's breast fairly pushing the barrier, he did put out his hand to unchain it, and then sullenly preceded me up the causeway, calling, as we entered the court,-\"Joseph, take Mr. Lockwood's horse; and bring up some wine.\"\n\"Here we have the whole establishment of domestics, I suppose,\" was the reflection suggested by this compound order. \"No wonder the grass grows up between the flags, and cattle are the only hedge-cutters.\"\nJoseph was an elderly, nay, an old man, very old, perhaps, though hale and sinewy. \"The Lord help us!\" he soliloquised in an undertone of peevish displeasure, while relieving me of my horse: looking, meantime, in my face so sourly that I charitably conjectured he must have need of divine aid to digest his dinner, and his pious ejaculation had no reference to my unexpected advent.\nWuthering Heights is the name of Mr. Heathcliff's dwelling. \"Wuthering\" being a significant provincial adjective, descriptive of the atmospheric tumult to which its station is exposed in stormy weather. Pure, bracing ventilation they must have up there at all times, indeed: one may guess the power of the north wind, blowing over the edge, by the excessive slant of a few stunted firs at the end of the house; and by a range of gaunt thorns all stretching their limbs one way, as if craving alms of the sun. Happily, the architect had foresight to build it strong: the narrow windows are deeply set in the wall, and the corners defended with large jutting stones.\nBefore passing the threshold, I paused to admire a quantity of grotesque carving lavished over the front, and especially about the principal door; above which, among a wilderness of crumbling griffins and shameless little boys, I detected the date \"1500,\" and the name \"Hareton Earnshaw.\" I would have made a few comments, and requested a short history of the place from the surly owner; but his attitude at the door appeared to demand my speedy entrance, or complete departure, and I had no desire to aggravate his impatience previous to inspecting the penetralium.\nOne stop brought us into the family sitting-room, without any introductory lobby or passage: they call it here \"the house\" pre-eminently. It includes kitchen and parlour, generally; but I believe at Wuthering Heights the kitchen is forced to retreat altogether into another quarter: at least I distinguished a chatter of tongues, and a clatter of culinary utensils, deep within; and I observed no signs of roasting, boiling, or baking, about the huge fireplace; nor any glitter of copper saucepans and tin cullenders on the walls. One end, indeed, reflected splendidly both light and heat from ranks of immense pewter dishes, interspersed with silver jugs and tankards, towering row after row, on a vast oak dresser, to the very roof. The latter had never been under-drawn: its entire anatomy lay bare to an inquiring eye, except where a frame of wood laden with oatcakes and clusters of legs of beef, mutton, and ham, concealed it. Above the chimney were sundry villainous old guns, and a couple of horse-pistols: and, by way of ornament, three gaudily-painted canisters disposed along its ledge. The floor was of smooth, white stone; the chairs, high-backed, primitive structures, painted green: one or two heavy black ones lurking in the shade. In an arch under the dresser reposed a huge, liver-coloured bitch pointer, surrounded by a swarm of squealing puppies; and other dogs haunted other recesses.\nThe apartment and furniture would have been nothing extraordinary as belonging to a homely, northern farmer, with a stubborn countenance, and stalwart limbs set out to advantage in knee-breeches and gaiters. Such an individual seated in his arm-chair, his mug of ale frothing on the round table before him, is to be seen in any circuit of five or six miles among these hills, if you go at the right time after dinner. But Mr. Heathcliff forms a singular contrast to his abode and style of living. He is a dark-skinned gipsy in aspect, in dress and manners a gentleman: that is, as much a gentleman as many a country squire: rather slovenly, perhaps, yet not looking amiss with his negligence, because he has an erect and handsome figure; and rather morose. Possibly, some people might suspect him of a degree of under-bred pride; I have a sympathetic chord within that tells me it is nothing of the sort: I know, by instinct, his reserve springs from an aversion to showy displays of feeling-to manifestations of mutual kindliness. He'll love and hate equally under cover, and esteem it a species of impertinence to be loved or hated again. No, I'm running on too fast: I bestow my own attributes over-liberally on him. Mr. Heathcliff may have entirely dissimilar reasons for keeping his hand out of the way when he meets a would-be acquaintance, to those which actuate me. Let me hope my constitution is almost peculiar: my dear mother used to say I should never have a comfortable home; and only last summer I proved myself perfectly unworthy of one.\nWhile enjoying a month of fine weather at the sea-coast, I was thrown into the company of a most fascinating creature: a real goddess in my eyes, as long as she took no notice of me. I \"never told my love\" vocally; still, if looks have language, the merest idiot might have guessed I was over head and ears: she understood me at last, and looked a return-the sweetest of all imaginable looks. And what did I do? I confess it with shame-shrunk icily into myself, like a snail; at every glance retired colder and farther; till finally the poor innocent was led to doubt her own senses, and, overwhelmed with confusion at her supposed mistake, persuaded her mamma to decamp.\nBy this curious turn of disposition I have gained the reputation of deliberate heartlessness; how undeserved, I alone can appreciate.\nI took a seat at the end of the hearthstone opposite that towards which my landlord advanced, and filled up an interval of silence by attempting to caress the canine mother, who had left her nursery, and was sneaking wolfishly to the back of my legs, her lip curled up, and her white teeth watering for a snatch. My caress provoked a long, guttural gnarl.\n\"You'd better let the dog alone,\" growled Mr. Heathcliff in unison, checking fiercer demonstrations with a punch of his foot. \"She's not accustomed to be spoiled-not kept for a pet.\" Then, striding to a side door, he shouted again, \"Joseph!\"\nJoseph mumbled indistinctly in the depths of the cellar, but gave no intimation of ascending; so his master dived down to him, leaving me _vis--vis_ the ruffianly bitch and a pair of grim shaggy sheep-dogs, who shared with her a jealous guardianship over all my movements. Not anxious to come in contact with their fangs, I sat still; but, imagining they would scarcely understand tacit insults, I unfortunately indulged in winking and making faces at the trio, and some turn of my physiognomy so irritated madam, that she suddenly broke into a fury and leapt on my knees. I flung her back, and hastened to interpose the table between us. This proceeding aroused the whole hive: half-a-dozen four-footed fiends, of various sizes and ages, issued from hidden dens to the common centre. I felt my heels and coat-laps peculiar subjects of assault; and parrying off the larger combatants as effectually as I could with the poker, I was constrained to demand, aloud, assistance from some of the household in re-establishing peace.\nMr. Heathcliff and his man climbed the cellar steps with vexatious phlegm: I don't think they moved one second faster than usual, though the hearth was an absolute tempest of worrying and yelping. Happily, an inhabitant of the kitchen made more dispatch; a lusty dame, with tucked-up gown, bare arms, and fire-flushed cheeks, rushed into the midst of us flourishing a frying-pan: and used that weapon, and her tongue, to such purpose, that the storm subsided magically, and she only remained, heaving like a sea after a high wind, when her master entered on the scene.\n\"What the devil is the matter?\" he asked, eyeing me in a manner that I could ill endure, after this inhospitable treatment.\n\"What the devil, indeed!\" I muttered. \"The herd of possessed swine could have had no worse spirits in them than those animals of yours, sir. You might as well leave a stranger with a brood of tigers!\"\n\"They won't meddle with persons who touch nothing,\" he remarked, putting the bottle before me, and restoring the displaced table. \"The dogs do right to be vigilant. Take a glass of wine?\"\n\"No, thank you.\"\n\"Not bitten, are you?\"\n\"If I had been, I would have set my signet on the biter.\" Heathcliff's countenance relaxed into a grin.\n\"Come, come,\" he said, \"you are flurried, Mr. Lockwood. Here, take a little wine. Guests are so exceedingly rare in this house that I and my dogs, I am willing to own, hardly know how to receive them. Your health, sir?\"\nI bowed and returned the pledge; beginning to perceive that it would be foolish to sit sulking for the misbehaviour of a pack of curs; besides, I felt loth to yield the fellow further amusement at my expense; since his humour took that turn. He-probably swayed by prudential consideration of the folly of offending a good tenant-relaxed a little in the laconic style of chipping off his pronouns and auxiliary verbs, and introduced what he supposed would be a subject of interest to me,-a discourse on the advantages and disadvantages of my present place of retirement. I found him very intelligent on the topics we touched; and before I went home, I was encouraged so far as to volunteer another visit to-morrow. He evidently wished no repetition of my intrusion. I shall go, notwithstanding. It is astonishing how sociable I feel myself compared with him.",
        "paragraph_chars": [
            [
                0,
                669
            ],
            [
                669,
                695
            ],
            [
                695,
                717
            ],
            [
                717,
                998
            ],
            [
                998,
                1140
            ],
            [
                1140,
                1466
            ],
            [
                1466,
                1705
            ],
            [
                1705,
                1911
            ],
            [
                1911,
                2294
            ],
            [
                2294,
                2959
            ],
            [
                2959,
                3526
            ],
            [
                3526,
                4932
            ],
            [
                4932,
                6485
            ],
            [
                6485,
                7157
            ],
            [
                7157,
                7291
            ],
            [
                7291,
                7647
            ],
            [
                7647,
                7889
            ],
            [
                7889,
                8915
            ],
            [
                8915,
                9484
            ],
            [
                9484,
                9608
            ],
            [
                9608,
                9809
            ],
            [
                9809,
                9997
            ],
            [
                9997,
                10014
            ],
            [
                10014,
                10037
            ],
            [
                10037,
                10141
            ],
            [
                10141,
                10361
            ],
            [
                10361,
                11218
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                147
            ],
            [
                147,
                267
            ],
            [
                267,
                387
            ],
            [
                387,
                405
            ],
            [
                405,
                669
            ],
            [
                669,
                687
            ],
            [
                687,
                695
            ],
            [
                695,
                717
            ],
            [
                717,
                754
            ],
            [
                754,
                998
            ],
            [
                998,
                1060
            ],
            [
                1060,
                1140
            ],
            [
                1140,
                1233
            ],
            [
                1233,
                1466
            ],
            [
                1466,
                1705
            ],
            [
                1705,
                1822
            ],
            [
                1822,
                1911
            ],
            [
                1911,
                1994
            ],
            [
                1994,
                2014
            ],
            [
                2014,
                2294
            ],
            [
                2294,
                2354
            ],
            [
                2354,
                2497
            ],
            [
                2497,
                2803
            ],
            [
                2803,
                2959
            ],
            [
                2959,
                3248
            ],
            [
                3248,
                3526
            ],
            [
                3526,
                3664
            ],
            [
                3664,
                4057
            ],
            [
                4057,
                4261
            ],
            [
                4261,
                4459
            ],
            [
                4459,
                4624
            ],
            [
                4624,
                4774
            ],
            [
                4774,
                4932
            ],
            [
                4932,
                5140
            ],
            [
                5140,
                5350
            ],
            [
                5350,
                5429
            ],
            [
                5429,
                5689
            ],
            [
                5689,
                5964
            ],
            [
                5964,
                6073
            ],
            [
                6073,
                6152
            ],
            [
                6152,
                6306
            ],
            [
                6306,
                6485
            ],
            [
                6485,
                6668
            ],
            [
                6668,
                6878
            ],
            [
                6878,
                6897
            ],
            [
                6897,
                7157
            ],
            [
                7157,
                7291
            ],
            [
                7291,
                7604
            ],
            [
                7604,
                7647
            ],
            [
                7647,
                7773
            ],
            [
                7773,
                7830
            ],
            [
                7830,
                7889
            ],
            [
                7889,
                8162
            ],
            [
                8162,
                8462
            ],
            [
                8462,
                8528
            ],
            [
                8528,
                8674
            ],
            [
                8674,
                8915
            ],
            [
                8915,
                9112
            ],
            [
                9112,
                9484
            ],
            [
                9484,
                9516
            ],
            [
                9516,
                9608
            ],
            [
                9608,
                9634
            ],
            [
                9634,
                9646
            ],
            [
                9646,
                9749
            ],
            [
                9749,
                9809
            ],
            [
                9809,
                9939
            ],
            [
                9939,
                9974
            ],
            [
                9974,
                9997
            ],
            [
                9997,
                10014
            ],
            [
                10014,
                10037
            ],
            [
                10037,
                10095
            ],
            [
                10095,
                10141
            ],
            [
                10141,
                10197
            ],
            [
                10197,
                10223
            ],
            [
                10223,
                10342
            ],
            [
                10342,
                10361
            ],
            [
                10361,
                10603
            ],
            [
                10603,
                10931
            ],
            [
                10931,
                11075
            ],
            [
                11075,
                11126
            ],
            [
                11126,
                11155
            ],
            [
                11155,
                11218
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                5,
                54
            ],
            [
                58,
                76
            ],
            [
                106,
                108
            ],
            [
                108,
                147
            ],
            [
                147,
                197
            ],
            [
                207,
                208
            ],
            [
                219,
                245
            ],
            [
                258,
                267
            ],
            [
                267,
                299
            ],
            [
                304,
                328
            ],
            [
                385,
                387
            ],
            [
                387,
                405
            ],
            [
                405,
                462
            ],
            [
                470,
                528
            ],
            [
                543,
                546
            ],
            [
                552,
                563
            ],
            [
                574,
                584
            ],
            [
                627,
                649
            ],
            [
                534,
                541
            ],
            [
                667,
                669
            ],
            [
                672,
                684
            ],
            [
                687,
                695
            ],
            [
                715,
                717
            ],
            [
                720,
                754
            ],
            [
                754,
                755
            ],
            [
                826,
                883
            ],
            [
                932,
                950
            ],
            [
                1005,
                1032
            ],
            [
                1035,
                1037
            ],
            [
                1049,
                1060
            ],
            [
                1061,
                1079
            ],
            [
                1088,
                1129
            ],
            [
                1130,
                1137
            ],
            [
                1140,
                1143
            ],
            [
                1145,
                1152
            ],
            [
                1154,
                1184
            ],
            [
                1212,
                1213
            ],
            [
                1215,
                1224
            ],
            [
                1321,
                1322
            ],
            [
                1361,
                1413
            ],
            [
                1233,
                1237
            ],
            [
                1425,
                1466
            ],
            [
                1471,
                1473
            ],
            [
                1511,
                1514
            ],
            [
                1563,
                1580
            ],
            [
                1590,
                1599
            ],
            [
                1608,
                1636
            ],
            [
                1522,
                1523
            ],
            [
                1645,
                1702
            ],
            [
                1706,
                1710
            ],
            [
                1719,
                1728
            ],
            [
                1743,
                1745
            ],
            [
                1755,
                1766
            ],
            [
                1820,
                1822
            ],
            [
                1823,
                1863
            ],
            [
                1911,
                1924
            ],
            [
                1942,
                1949
            ],
            [
                1951,
                1994
            ],
            [
                1999,
                2011
            ],
            [
                2014,
                2016
            ],
            [
                2030,
                2032
            ],
            [
                2049,
                2056
            ],
            [
                2036,
                2045
            ],
            [
                2068,
                2069
            ],
            [
                2092,
                2100
            ],
            [
                2226,
                2229
            ],
            [
                2102,
                2109
            ],
            [
                2086,
                2088
            ],
            [
                2135,
                2141
            ],
            [
                2292,
                2294
            ],
            [
                2294,
                2343
            ],
            [
                2355,
                2364
            ],
            [
                2366,
                2373
            ],
            [
                2406,
                2407
            ],
            [
                2423,
                2426
            ],
            [
                2488,
                2495
            ],
            [
                2446,
                2454
            ],
            [
                2467,
                2477
            ],
            [
                2495,
                2497
            ],
            [
                2497,
                2546
            ],
            [
                2559,
                2610
            ],
            [
                2635,
                2641
            ],
            [
                2652,
                2803
            ],
            [
                2807,
                2815
            ],
            [
                2905,
                2906
            ],
            [
                2932,
                2936
            ],
            [
                2864,
                2878
            ],
            [
                2883,
                2900
            ],
            [
                2957,
                2959
            ],
            [
                2959,
                2965
            ],
            [
                2987,
                3007
            ],
            [
                2974,
                2977
            ],
            [
                3022,
                3031
            ],
            [
                3049,
                3057
            ],
            [
                3100,
                3105
            ],
            [
                3141,
                3206
            ],
            [
                3208,
                3212
            ],
            [
                3215,
                3227
            ],
            [
                3229,
                3245
            ],
            [
                3248,
                3260
            ],
            [
                3330,
                3345
            ],
            [
                3315,
                3324
            ],
            [
                3304,
                3311
            ],
            [
                3280,
                3281
            ],
            [
                3347,
                3350
            ],
            [
                3436,
                3460
            ],
            [
                3524,
                3526
            ],
            [
                3546,
                3574
            ],
            [
                3576,
                3636
            ],
            [
                3638,
                3647
            ],
            [
                3664,
                3666
            ],
            [
                3667,
                3695
            ],
            [
                3706,
                3711
            ],
            [
                3722,
                3775
            ],
            [
                3787,
                3807
            ],
            [
                3920,
                3931
            ],
            [
                3968,
                3987
            ],
            [
                3996,
                4023
            ],
            [
                4043,
                4057
            ],
            [
                4057,
                4073
            ],
            [
                4120,
                4151
            ],
            [
                4170,
                4261
            ],
            [
                4261,
                4264
            ],
            [
                4323,
                4327
            ],
            [
                4347,
                4355
            ],
            [
                4362,
                4363
            ],
            [
                4364,
                4369
            ],
            [
                4378,
                4401
            ],
            [
                4414,
                4443
            ],
            [
                4457,
                4458
            ],
            [
                4459,
                4481
            ],
            [
                4489,
                4508
            ],
            [
                4622,
                4624
            ],
            [
                4624,
                4672
            ],
            [
                4674,
                4685
            ],
            [
                4687,
                4696
            ],
            [
                4772,
                4774
            ],
            [
                4791,
                4802
            ],
            [
                4811,
                4817
            ],
            [
                4840,
                4932
            ],
            [
                4932,
                4935
            ],
            [
                4946,
                4959
            ],
            [
                5046,
                5047
            ],
            [
                5011,
                5039
            ],
            [
                5110,
                5126
            ],
            [
                5138,
                5140
            ],
            [
                5140,
                5144
            ],
            [
                5182,
                5183
            ],
            [
                5159,
                5182
            ],
            [
                5184,
                5198
            ],
            [
                5237,
                5238
            ],
            [
                5245,
                5252
            ],
            [
                5295,
                5306
            ],
            [
                5348,
                5349
            ],
            [
                5350,
                5401
            ],
            [
                5408,
                5429
            ],
            [
                5429,
                5487
            ],
            [
                5510,
                5512
            ],
            [
                5490,
                5499
            ],
            [
                5530,
                5585
            ],
            [
                5609,
                5624
            ],
            [
                5604,
                5608
            ],
            [
                5640,
                5689
            ],
            [
                5689,
                5731
            ],
            [
                5755,
                5763
            ],
            [
                5858,
                5869
            ],
            [
                5813,
                5835
            ],
            [
                5843,
                5844
            ],
            [
                5870,
                5923
            ],
            [
                5962,
                5964
            ],
            [
                5964,
                6003
            ],
            [
                6071,
                6072
            ],
            [
                6073,
                6117
            ],
            [
                6144,
                6152
            ],
            [
                6152,
                6184
            ],
            [
                6196,
                6207
            ],
            [
                6216,
                6219
            ],
            [
                6304,
                6306
            ],
            [
                6306,
                6320
            ],
            [
                6334,
                6336
            ],
            [
                6352,
                6457
            ],
            [
                6468,
                6485
            ],
            [
                6485,
                6576
            ],
            [
                6582,
                6593
            ],
            [
                6602,
                6605
            ],
            [
                6611,
                6668
            ],
            [
                6668,
                6669
            ],
            [
                6671,
                6689
            ],
            [
                6700,
                6705
            ],
            [
                6729,
                6766
            ],
            [
                6710,
                6715
            ],
            [
                6767,
                6772
            ],
            [
                6778,
                6782
            ],
            [
                6773,
                6777
            ],
            [
                6793,
                6810
            ],
            [
                6818,
                6859
            ],
            [
                6871,
                6878
            ],
            [
                6878,
                6897
            ],
            [
                6897,
                6921
            ],
            [
                6928,
                7148
            ],
            [
                7155,
                7156
            ],
            [
                7160,
                7164
            ],
            [
                7193,
                7224
            ],
            [
                7236,
                7278
            ],
            [
                7289,
                7291
            ],
            [
                7291,
                7304
            ],
            [
                7319,
                7329
            ],
            [
                7383,
                7395
            ],
            [
                7308,
                7311
            ],
            [
                7414,
                7449
            ],
            [
                7463,
                7468
            ],
            [
                7495,
                7560
            ],
            [
                7602,
                7604
            ],
            [
                7604,
                7639
            ],
            [
                7642,
                7647
            ],
            [
                7661,
                7678
            ],
            [
                7681,
                7703
            ],
            [
                7713,
                7714
            ],
            [
                7752,
                7753
            ],
            [
                7771,
                7773
            ],
            [
                7777,
                7783
            ],
            [
                7822,
                7827
            ],
            [
                7830,
                7871
            ],
            [
                7877,
                7878
            ],
            [
                7880,
                7886
            ],
            [
                7889,
                7903
            ],
            [
                7917,
                7949
            ],
            [
                7981,
                8026
            ],
            [
                8107,
                8111
            ],
            [
                8038,
                8094
            ],
            [
                8160,
                8162
            ],
            [
                8162,
                8176
            ],
            [
                8198,
                8227
            ],
            [
                8285,
                8340
            ],
            [
                8349,
                8354
            ],
            [
                8383,
                8401
            ],
            [
                8403,
                8461
            ],
            [
                8462,
                8483
            ],
            [
                8506,
                8528
            ],
            [
                8528,
                8532
            ],
            [
                8544,
                8617
            ],
            [
                8626,
                8627
            ],
            [
                8635,
                8654
            ],
            [
                8618,
                8621
            ],
            [
                8672,
                8674
            ],
            [
                8747,
                8750
            ],
            [
                8773,
                8775
            ],
            [
                8791,
                8820
            ],
            [
                8833,
                8835
            ],
            [
                8913,
                8915
            ],
            [
                8915,
                8966
            ],
            [
                8990,
                9112
            ],
            [
                9112,
                9159
            ],
            [
                9170,
                9188
            ],
            [
                9205,
                9214
            ],
            [
                9216,
                9247
            ],
            [
                9269,
                9315
            ],
            [
                9333,
                9383
            ],
            [
                9253,
                9256
            ],
            [
                9451,
                9484
            ],
            [
                9485,
                9513
            ],
            [
                9516,
                9524
            ],
            [
                9606,
                9608
            ],
            [
                9609,
                9631
            ],
            [
                9634,
                9646
            ],
            [
                9749,
                9806
            ],
            [
                9720,
                9733
            ],
            [
                9742,
                9747
            ],
            [
                9815,
                9832
            ],
            [
                9841,
                9858
            ],
            [
                9861,
                9881
            ],
            [
                9886,
                9902
            ],
            [
                9937,
                9939
            ],
            [
                9944,
                9974
            ],
            [
                9979,
                9994
            ],
            [
                9998,
                10011
            ],
            [
                10015,
                10034
            ],
            [
                10038,
                10072
            ],
            [
                10080,
                10092
            ],
            [
                10095,
                10107
            ],
            [
                10120,
                10141
            ],
            [
                10142,
                10152
            ],
            [
                10155,
                10163
            ],
            [
                10203,
                10223
            ],
            [
                10223,
                10236
            ],
            [
                10249,
                10286
            ],
            [
                10309,
                10342
            ],
            [
                10342,
                10358
            ],
            [
                10361,
                10368
            ],
            [
                10503,
                10504
            ],
            [
                10416,
                10443
            ],
            [
                10601,
                10603
            ],
            [
                10606,
                10614
            ],
            [
                10841,
                10843
            ],
            [
                10676,
                10689
            ],
            [
                10776,
                10777
            ],
            [
                10603,
                10605
            ],
            [
                10863,
                10901
            ],
            [
                10929,
                10931
            ],
            [
                10931,
                10962
            ],
            [
                10967,
                10973
            ],
            [
                10984,
                11011
            ],
            [
                11037,
                11039
            ],
            [
                11058,
                11063
            ],
            [
                11073,
                11075
            ],
            [
                11075,
                11077
            ],
            [
                11124,
                11126
            ],
            [
                11126,
                11137
            ],
            [
                11153,
                11155
            ],
            [
                11155,
                11192
            ],
            [
                11200,
                11218
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                147
            ],
            [
                147,
                267
            ],
            [
                267,
                387
            ],
            [
                387,
                405
            ],
            [
                405,
                669
            ],
            [
                669,
                687
            ],
            [
                687,
                695
            ],
            [
                695,
                717
            ],
            [
                717,
                754
            ],
            [
                754,
                998
            ],
            [
                998,
                1060
            ],
            [
                1060,
                1140
            ],
            [
                1140,
                1233
            ],
            [
                1233,
                1466
            ],
            [
                1466,
                1705
            ],
            [
                1705,
                1822
            ],
            [
                1822,
                1911
            ],
            [
                1911,
                1994
            ],
            [
                1994,
                2014
            ],
            [
                2014,
                2294
            ],
            [
                2294,
                2497
            ],
            [
                2497,
                2803
            ],
            [
                2803,
                2959
            ],
            [
                2959,
                3248
            ],
            [
                3248,
                3526
            ],
            [
                3526,
                3664
            ],
            [
                3664,
                4057
            ],
            [
                4057,
                4261
            ],
            [
                4261,
                4459
            ],
            [
                4459,
                4624
            ],
            [
                4624,
                4774
            ],
            [
                4774,
                4932
            ],
            [
                4932,
                5140
            ],
            [
                5140,
                5350
            ],
            [
                5350,
                5429
            ],
            [
                5429,
                5689
            ],
            [
                5689,
                5964
            ],
            [
                5964,
                6073
            ],
            [
                6073,
                6152
            ],
            [
                6152,
                6306
            ],
            [
                6306,
                6485
            ],
            [
                6485,
                6668
            ],
            [
                6668,
                6878
            ],
            [
                6878,
                6897
            ],
            [
                6897,
                7157
            ],
            [
                7157,
                7291
            ],
            [
                7291,
                7604
            ],
            [
                7604,
                7647
            ],
            [
                7647,
                7773
            ],
            [
                7773,
                7830
            ],
            [
                7830,
                7889
            ],
            [
                7889,
                8162
            ],
            [
                8162,
                8462
            ],
            [
                8462,
                8528
            ],
            [
                8528,
                8674
            ],
            [
                8674,
                8915
            ],
            [
                8915,
                9112
            ],
            [
                9112,
                9484
            ],
            [
                9484,
                9516
            ],
            [
                9516,
                9608
            ],
            [
                9608,
                9634
            ],
            [
                9634,
                9646
            ],
            [
                9646,
                9809
            ],
            [
                9809,
                9939
            ],
            [
                9939,
                9974
            ],
            [
                9974,
                9997
            ],
            [
                9997,
                10014
            ],
            [
                10014,
                10037
            ],
            [
                10037,
                10095
            ],
            [
                10095,
                10141
            ],
            [
                10141,
                10223
            ],
            [
                10223,
                10342
            ],
            [
                10342,
                10361
            ],
            [
                10361,
                10603
            ],
            [
                10603,
                10931
            ],
            [
                10931,
                11075
            ],
            [
                11075,
                11126
            ],
            [
                11126,
                11155
            ],
            [
                11155,
                11218
            ]
        ]
    },
    "abridged": {
        "text": "1801. I have just returned from a visit to my landlord - my solitary neighbour. This is certainly a beautiful country! In all England, I do not believe that I could have found a place so completely removed from society. A perfect misanthropist's heaven: for which Mr. Heathcliff and I are equally suited. A capital fellow! He little imagined how my heart warmed towards him when I saw his black eyes withdraw so suspiciously under their brows, and his fingers shelter themselves jealously in his waistcoat, as I rode up.\n'Mr. Heathcliff?' I said.\nHe nodded.\n'Mr. Lockwood, your new tenant, sir. I called to express the hope that I have not inconvenienced you by renting Thrushcross Grange.'\n'Thrushcross Grange is my own, sir,' he answered, wincing. 'I should not allow anyone to inconvenience me, if I could hinder it. Walk in!'\nThe 'walk in' was uttered with closed teeth, meaning, 'Go to the Devil.' However, I decided to accept the invitation: I felt interested in a man even more exaggeratedly reserved than myself.\nHe unchained the gate and then sullenly led me up the driveway, calling, as we entered the courtyard, 'Joseph, take Mr. Lockwood's horse; and bring up some wine.'\n'Here is the whole set of servants, I suppose,' I reflected. 'No wonder the grass grows up between the flagstones.'\nJoseph was an old man: very old, perhaps, though hale and sinewy. 'The Lord help us!' he muttered in a peevish undertone, taking my horse and looking at me sourly.\nWuthering Heights is the name of Mr. Heathcliff's house: 'wuthering' being a local word, describing the tumultuous weather to which the place is exposed. Pure, bracing ventilation they must have up there, indeed: one may guess the power of the north wind by the steep slant of a few stunted firs at the end of the house; and by a range of gaunt thorns all stretching their limbs one way, as if craving alms of the sun. Luckily, the house is strongly built, with narrow windows deeply set in the walls.\nBefore entering, I paused to admire the grotesque carvings over the door; where amongst crumbling griffins and shameless little boys, I detected the date '1500,' and the name 'Hareton Earnshaw.' I would have asked the surly owner about the place's history, but he seemed impatient, and I had no desire to annoy him.\nWe walked into the family sitting-room without any introductory lobby or passage: they call it here 'the house.' It usually includes kitchen and parlour; but at Wuthering Heights the kitchen is forced to retreat into another quarter. There were no signs of cooking around the huge fireplace; no glitter of copper saucepans on the walls. At one end, indeed, were ranks of immense pewter dishes, silver jugs and tankards, towering row after row, on a vast oak dresser, to the very roof. The roof beams were bare, except for a wooden frame laden with oatcakes and legs of beef, mutton, and ham.\nAbove the chimney were several villainous old guns. The floor was of smooth, white stone; the chairs were high-backed and primitive. By the dresser lay a huge pointer, surrounded by a swarm of squealing puppies; and other dogs haunted other recesses.\nThe house and furniture were of a type that might belong to a homely, northern farmer in knee-breeches. Such a person, seated in his arm-chair with his mug of ale, may be seen everywhere amongst these hills.\nBut Mr. Heathcliff forms a singular contrast to his home and style of living. He is a dark-skinned gipsy in aspect, in dress and manners as gentlemanly as many a country squire: rather slovenly, perhaps, yet despite his negligence, with an erect and handsome figure; and rather morose. Possibly, some people might suspect him of pride; I feel instinctively his reserve is nothing of the sort, but springs from an aversion to showy displays of feeling. He'll love and hate equally under cover.\nNo, I'm running on too fast: I bestow my own feelings on him. Mr. Heathcliff may have entirely different reasons for his reserve from mine. Let me hope my nature is unique: my dear mother used to say I should never have a comfortable home; and only last summer I proved myself unworthy of one.\nWhile enjoying a month of fine weather at the sea-coast, I was thrown into the company of a fascinating girl: a goddess in my eyes, as long as she took no notice of me. I 'never told my love'; still, the merest idiot might have guessed from my looks that I was head over heels. She understood me, and looked a return - the sweetest of all looks. And what did I do? I confess it with shame - shrunk icily into myself, like a snail; at every glance retired colder and farther; till finally the poor innocent was led to doubt her own senses, and, overwhelmed with confusion at her supposed mistake, persuaded her mamma to leave. Through this reserve I have gained the reputation of heartlessness; how undeserved, I alone can know.\nI took a seat by the hearth, and filled the silence by attempting to caress the dog, who was sneaking wolfishly to the back of my legs, her lip curled up, ready to bite. My caress provoked a long, guttural snarl.\n'Let the dog alone,' growled Mr. Heathcliff, aiming a kick at her. 'She's not a pet.' Then, striding to a side door, he shouted, 'Joseph!'\nJoseph mumbled in the depths of the cellar, but did not appear; so his master dived down to him, leaving me with the ruffianly bitch and a pair of grim shaggy sheep-dogs. Not anxious to feel their fangs, I sat still; but I unfortunately indulged in winking and making faces at them, and so irritated madam that she suddenly broke into a fury and leapt on my knees.\nI flung her back, and quickly put the table between us. This aroused the whole hive: half-a-dozen four-footed fiends, of various sizes, ran out from hidden dens to attack my heels and coat-hems. Keeping them off as best I could with the poker, I was obliged to call for help.\nMr. Heathcliff and his man climbed the cellar steps without hurry; I don't think they moved one second faster than usual, though the hearth was an absolute tempest of worrying and yelping. Happily, an inhabitant of the kitchen made more haste: a lusty dame, with bare arms and fire-flushed cheeks, rushed in flourishing a frying-pan: and used that weapon to such purpose, that the storm subsided magically by the time her master entered on the scene.\n'What the devil is the matter?' he asked.\n'What the devil, indeed!' I muttered. 'You might as well leave a stranger with a brood of tigers as with those animals, sir!'\n'They won't meddle with people who touch nothing,' he remarked, putting a bottle before me. 'The dogs do right to be vigilant. A glass of wine?'\n'No, thank you.'\n'Not bitten, are you?'\n'If I had been, I would have set my mark on the biter.'\nHeathcliff's face relaxed into a grin.\n'Come, come,' he said, 'take a little wine. Guests are so rare in this house that I and my dogs hardly know how to receive them. Your health, sir!'\nI bowed, seeing that it would be foolish to sulk. Probably not wishing to offend a good tenant, he began to talk less curtly, discussing the advantages and disadvantages of my new house. I found him very intelligent on these topics; and before I went home, I offered to visit him tomorrow. He did not seem to wish for it. I shall go, all the same. It is astonishing how sociable I feel compared with him.",
        "paragraph_chars": [
            [
                0,
                521
            ],
            [
                521,
                547
            ],
            [
                547,
                558
            ],
            [
                558,
                691
            ],
            [
                691,
                830
            ],
            [
                830,
                1021
            ],
            [
                1021,
                1184
            ],
            [
                1184,
                1300
            ],
            [
                1300,
                1464
            ],
            [
                1464,
                1966
            ],
            [
                1966,
                2282
            ],
            [
                2282,
                2874
            ],
            [
                2874,
                3125
            ],
            [
                3125,
                3333
            ],
            [
                3333,
                3826
            ],
            [
                3826,
                4120
            ],
            [
                4120,
                4848
            ],
            [
                4848,
                5061
            ],
            [
                5061,
                5200
            ],
            [
                5200,
                5565
            ],
            [
                5565,
                5841
            ],
            [
                5841,
                6292
            ],
            [
                6292,
                6334
            ],
            [
                6334,
                6460
            ],
            [
                6460,
                6605
            ],
            [
                6605,
                6622
            ],
            [
                6622,
                6645
            ],
            [
                6645,
                6701
            ],
            [
                6701,
                6740
            ],
            [
                6740,
                6888
            ],
            [
                6888,
                7292
            ]
        ],
        "segment_chars": [
            [
                0,
                6
            ],
            [
                6,
                80
            ],
            [
                80,
                119
            ],
            [
                119,
                220
            ],
            [
                220,
                305
            ],
            [
                305,
                323
            ],
            [
                323,
                521
            ],
            [
                521,
                539
            ],
            [
                539,
                547
            ],
            [
                547,
                558
            ],
            [
                558,
                595
            ],
            [
                595,
                691
            ],
            [
                691,
                750
            ],
            [
                750,
                820
            ],
            [
                820,
                830
            ],
            [
                830,
                903
            ],
            [
                903,
                1021
            ],
            [
                1021,
                1184
            ],
            [
                1184,
                1245
            ],
            [
                1245,
                1300
            ],
            [
                1300,
                1366
            ],
            [
                1366,
                1386
            ],
            [
                1386,
                1464
            ],
            [
                1464,
                1618
            ],
            [
                1618,
                1883
            ],
            [
                1883,
                1966
            ],
            [
                1966,
                2161
            ],
            [
                2161,
                2282
            ],
            [
                2282,
                2395
            ],
            [
                2395,
                2516
            ],
            [
                2516,
                2619
            ],
            [
                2619,
                2767
            ],
            [
                2767,
                2874
            ],
            [
                2874,
                2926
            ],
            [
                2926,
                3007
            ],
            [
                3007,
                3125
            ],
            [
                3125,
                3229
            ],
            [
                3229,
                3333
            ],
            [
                3333,
                3411
            ],
            [
                3411,
                3619
            ],
            [
                3619,
                3785
            ],
            [
                3785,
                3826
            ],
            [
                3826,
                3888
            ],
            [
                3888,
                3966
            ],
            [
                3966,
                4120
            ],
            [
                4120,
                4289
            ],
            [
                4289,
                4398
            ],
            [
                4398,
                4466
            ],
            [
                4466,
                4485
            ],
            [
                4485,
                4746
            ],
            [
                4746,
                4848
            ],
            [
                4848,
                5018
            ],
            [
                5018,
                5061
            ],
            [
                5061,
                5128
            ],
            [
                5128,
                5147
            ],
            [
                5147,
                5200
            ],
            [
                5200,
                5371
            ],
            [
                5371,
                5565
            ],
            [
                5565,
                5621
            ],
            [
                5621,
                5760
            ],
            [
                5760,
                5841
            ],
            [
                5841,
                6030
            ],
            [
                6030,
                6292
            ],
            [
                6292,
                6324
            ],
            [
                6324,
                6334
            ],
            [
                6334,
                6360
            ],
            [
                6360,
                6372
            ],
            [
                6372,
                6460
            ],
            [
                6460,
                6552
            ],
            [
                6552,
                6587
            ],
            [
                6587,
                6605
            ],
            [
                6605,
                6622
            ],
            [
                6622,
                6645
            ],
            [
                6645,
                6701
            ],
            [
                6701,
                6740
            ],
            [
                6740,
                6784
            ],
            [
                6784,
                6869
            ],
            [
                6869,
                6888
            ],
            [
                6888,
                6938
            ],
            [
                6938,
                7075
            ],
            [
                7075,
                7178
            ],
            [
                7178,
                7210
            ],
            [
                7210,
                7236
            ],
            [
                7236,
                7292
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                6,
                56
            ],
            [
                60,
                78
            ],
            [
                78,
                80
            ],
            [
                80,
                119
            ],
            [
                119,
                169
            ],
            [
                176,
                177
            ],
            [
                184,
                210
            ],
            [
                211,
                220
            ],
            [
                220,
                252
            ],
            [
                264,
                288
            ],
            [
                303,
                305
            ],
            [
                305,
                323
            ],
            [
                323,
                380
            ],
            [
                385,
                443
            ],
            [
                444,
                447
            ],
            [
                448,
                459
            ],
            [
                468,
                478
            ],
            [
                489,
                511
            ],
            [
                512,
                519
            ],
            [
                519,
                521
            ],
            [
                524,
                536
            ],
            [
                539,
                547
            ],
            [
                556,
                558
            ],
            [
                561,
                595
            ],
            [
                595,
                596
            ],
            [
                604,
                661
            ],
            [
                670,
                688
            ],
            [
                698,
                725
            ],
            [
                728,
                730
            ],
            [
                739,
                750
            ],
            [
                751,
                769
            ],
            [
                777,
                818
            ],
            [
                820,
                827
            ],
            [
                830,
                833
            ],
            [
                835,
                842
            ],
            [
                844,
                874
            ],
            [
                882,
                883
            ],
            [
                885,
                894
            ],
            [
                912,
                913
            ],
            [
                922,
                974
            ],
            [
                975,
                979
            ],
            [
                980,
                1021
            ],
            [
                1021,
                1023
            ],
            [
                1034,
                1037
            ],
            [
                1043,
                1060
            ],
            [
                1065,
                1074
            ],
            [
                1083,
                1111
            ],
            [
                1121,
                1122
            ],
            [
                1124,
                1181
            ],
            [
                1185,
                1189
            ],
            [
                1193,
                1202
            ],
            [
                1207,
                1209
            ],
            [
                1218,
                1229
            ],
            [
                1243,
                1245
            ],
            [
                1246,
                1286
            ],
            [
                1300,
                1313
            ],
            [
                1314,
                1321
            ],
            [
                1323,
                1366
            ],
            [
                1371,
                1383
            ],
            [
                1386,
                1388
            ],
            [
                1398,
                1400
            ],
            [
                1403,
                1410
            ],
            [
                1411,
                1420
            ],
            [
                1420,
                1421
            ],
            [
                1429,
                1437
            ],
            [
                1438,
                1441
            ],
            [
                1442,
                1449
            ],
            [
                1453,
                1455
            ],
            [
                1456,
                1462
            ],
            [
                1462,
                1464
            ],
            [
                1464,
                1513
            ],
            [
                1522,
                1531
            ],
            [
                1533,
                1540
            ],
            [
                1551,
                1552
            ],
            [
                1564,
                1567
            ],
            [
                1579,
                1586
            ],
            [
                1587,
                1595
            ],
            [
                1606,
                1616
            ],
            [
                1616,
                1618
            ],
            [
                1618,
                1667
            ],
            [
                1667,
                1718
            ],
            [
                1719,
                1725
            ],
            [
                1732,
                1883
            ],
            [
                1887,
                1895
            ],
            [
                1919,
                1920
            ],
            [
                1921,
                1925
            ],
            [
                1926,
                1940
            ],
            [
                1941,
                1958
            ],
            [
                1964,
                1966
            ],
            [
                1966,
                1972
            ],
            [
                1981,
                2001
            ],
            [
                2002,
                2005
            ],
            [
                2006,
                2015
            ],
            [
                2025,
                2033
            ],
            [
                2034,
                2039
            ],
            [
                2054,
                2119
            ],
            [
                2121,
                2125
            ],
            [
                2128,
                2140
            ],
            [
                2142,
                2158
            ],
            [
                2161,
                2173
            ],
            [
                2180,
                2195
            ],
            [
                2202,
                2211
            ],
            [
                2214,
                2221
            ],
            [
                2221,
                2222
            ],
            [
                2223,
                2226
            ],
            [
                2246,
                2270
            ],
            [
                2280,
                2282
            ],
            [
                2292,
                2320
            ],
            [
                2321,
                2381
            ],
            [
                2383,
                2392
            ],
            [
                2395,
                2397
            ],
            [
                2406,
                2434
            ],
            [
                2434,
                2439
            ],
            [
                2440,
                2493
            ],
            [
                2494,
                2514
            ],
            [
                2527,
                2538
            ],
            [
                2554,
                2573
            ],
            [
                2577,
                2604
            ],
            [
                2605,
                2619
            ],
            [
                2622,
                2638
            ],
            [
                2644,
                2675
            ],
            [
                2676,
                2767
            ],
            [
                2767,
                2770
            ],
            [
                2787,
                2791
            ],
            [
                2791,
                2799
            ],
            [
                2804,
                2805
            ],
            [
                2813,
                2818
            ],
            [
                2819,
                2842
            ],
            [
                2843,
                2872
            ],
            [
                2872,
                2873
            ],
            [
                2874,
                2896
            ],
            [
                2905,
                2924
            ],
            [
                2924,
                2926
            ],
            [
                2926,
                2974
            ],
            [
                2980,
                2991
            ],
            [
                2996,
                3005
            ],
            [
                3005,
                3007
            ],
            [
                3010,
                3021
            ],
            [
                3026,
                3032
            ],
            [
                3033,
                3125
            ],
            [
                3125,
                3128
            ],
            [
                3135,
                3148
            ],
            [
                3157,
                3158
            ],
            [
                3182,
                3210
            ],
            [
                3211,
                3227
            ],
            [
                3227,
                3229
            ],
            [
                3229,
                3233
            ],
            [
                3242,
                3243
            ],
            [
                3244,
                3267
            ],
            [
                3273,
                3287
            ],
            [
                3287,
                3288
            ],
            [
                3293,
                3300
            ],
            [
                3320,
                3331
            ],
            [
                3331,
                3332
            ],
            [
                3333,
                3384
            ],
            [
                3390,
                3411
            ],
            [
                3411,
                3469
            ],
            [
                3470,
                3472
            ],
            [
                3473,
                3482
            ],
            [
                3485,
                3540
            ],
            [
                3549,
                3564
            ],
            [
                3565,
                3569
            ],
            [
                3570,
                3619
            ],
            [
                3619,
                3661
            ],
            [
                3662,
                3670
            ],
            [
                3690,
                3701
            ],
            [
                3702,
                3724
            ],
            [
                3724,
                3725
            ],
            [
                3730,
                3783
            ],
            [
                3783,
                3785
            ],
            [
                3785,
                3824
            ],
            [
                3824,
                3825
            ],
            [
                3826,
                3870
            ],
            [
                3880,
                3888
            ],
            [
                3888,
                3920
            ],
            [
                3931,
                3942
            ],
            [
                3943,
                3946
            ],
            [
                3964,
                3966
            ],
            [
                3966,
                3980
            ],
            [
                3988,
                3990
            ],
            [
                3997,
                4102
            ],
            [
                4103,
                4120
            ],
            [
                4120,
                4211
            ],
            [
                4212,
                4223
            ],
            [
                4228,
                4231
            ],
            [
                4232,
                4289
            ],
            [
                4289,
                4290
            ],
            [
                4292,
                4310
            ],
            [
                4313,
                4318
            ],
            [
                4318,
                4355
            ],
            [
                4364,
                4369
            ],
            [
                4375,
                4380
            ],
            [
                4381,
                4385
            ],
            [
                4386,
                4390
            ],
            [
                4398,
                4415
            ],
            [
                4415,
                4458
            ],
            [
                4459,
                4466
            ],
            [
                4466,
                4485
            ],
            [
                4485,
                4510
            ],
            [
                4518,
                4738
            ],
            [
                4744,
                4745
            ],
            [
                4754,
                4758
            ],
            [
                4767,
                4798
            ],
            [
                4799,
                4841
            ],
            [
                4846,
                4848
            ],
            [
                4848,
                4861
            ],
            [
                4865,
                4875
            ],
            [
                4875,
                4887
            ],
            [
                4888,
                4891
            ],
            [
                4892,
                4927
            ],
            [
                4931,
                4936
            ],
            [
                4937,
                5002
            ],
            [
                5016,
                5018
            ],
            [
                5018,
                5053
            ],
            [
                5056,
                5061
            ],
            [
                5062,
                5079
            ],
            [
                5082,
                5104
            ],
            [
                5104,
                5105
            ],
            [
                5113,
                5114
            ],
            [
                5126,
                5128
            ],
            [
                5132,
                5138
            ],
            [
                5139,
                5144
            ],
            [
                5147,
                5188
            ],
            [
                5188,
                5189
            ],
            [
                5191,
                5197
            ],
            [
                5200,
                5214
            ],
            [
                5215,
                5247
            ],
            [
                5262,
                5307
            ],
            [
                5308,
                5312
            ],
            [
                5313,
                5369
            ],
            [
                5369,
                5371
            ],
            [
                5371,
                5385
            ],
            [
                5391,
                5420
            ],
            [
                5421,
                5476
            ],
            [
                5481,
                5486
            ],
            [
                5487,
                5505
            ],
            [
                5506,
                5564
            ],
            [
                5565,
                5586
            ],
            [
                5599,
                5621
            ],
            [
                5621,
                5625
            ],
            [
                5626,
                5699
            ],
            [
                5699,
                5700
            ],
            [
                5709,
                5728
            ],
            [
                5745,
                5748
            ],
            [
                5758,
                5760
            ],
            [
                5773,
                5776
            ],
            [
                5777,
                5779
            ],
            [
                5785,
                5814
            ],
            [
                5823,
                5825
            ],
            [
                5839,
                5841
            ],
            [
                5841,
                5892
            ],
            [
                5908,
                6030
            ],
            [
                6030,
                6077
            ],
            [
                6085,
                6103
            ],
            [
                6104,
                6113
            ],
            [
                6114,
                6145
            ],
            [
                6149,
                6195
            ],
            [
                6196,
                6246
            ],
            [
                6250,
                6253
            ],
            [
                6259,
                6292
            ],
            [
                6293,
                6321
            ],
            [
                6324,
                6332
            ],
            [
                6332,
                6334
            ],
            [
                6335,
                6357
            ],
            [
                6360,
                6372
            ],
            [
                6373,
                6430
            ],
            [
                6439,
                6452
            ],
            [
                6452,
                6457
            ],
            [
                6466,
                6483
            ],
            [
                6491,
                6508
            ],
            [
                6511,
                6531
            ],
            [
                6534,
                6550
            ],
            [
                6550,
                6552
            ],
            [
                6557,
                6587
            ],
            [
                6587,
                6602
            ],
            [
                6606,
                6619
            ],
            [
                6623,
                6642
            ],
            [
                6646,
                6680
            ],
            [
                6686,
                6698
            ],
            [
                6701,
                6713
            ],
            [
                6719,
                6740
            ],
            [
                6741,
                6751
            ],
            [
                6754,
                6762
            ],
            [
                6764,
                6784
            ],
            [
                6784,
                6797
            ],
            [
                6798,
                6835
            ],
            [
                6836,
                6869
            ],
            [
                6869,
                6885
            ],
            [
                6888,
                6895
            ],
            [
                6895,
                6896
            ],
            [
                6904,
                6931
            ],
            [
                6936,
                6938
            ],
            [
                6938,
                6946
            ],
            [
                6959,
                6961
            ],
            [
                6969,
                6982
            ],
            [
                6982,
                6983
            ],
            [
                6984,
                6986
            ],
            [
                7025,
                7063
            ],
            [
                7073,
                7075
            ],
            [
                7075,
                7106
            ],
            [
                7113,
                7119
            ],
            [
                7119,
                7146
            ],
            [
                7155,
                7157
            ],
            [
                7158,
                7163
            ],
            [
                7176,
                7178
            ],
            [
                7178,
                7180
            ],
            [
                7208,
                7210
            ],
            [
                7210,
                7221
            ],
            [
                7234,
                7236
            ],
            [
                7236,
                7273
            ],
            [
                7274,
                7292
            ]
        ],
        "row_chars": [
            [
                0,
                80
            ],
            [
                80,
                119
            ],
            [
                119,
                220
            ],
            [
                220,
                305
            ],
            [
                305,
                323
            ],
            [
                323,
                521
            ],
            [
                521,
                539
            ],
            [
                539,
                547
            ],
            [
                547,
                558
            ],
            [
                558,
                595
            ],
            [
                595,
                691
            ],
            [
                691,
                750
            ],
            [
                750,
                830
            ],
            [
                830,
                903
            ],
            [
                903,
                1021
            ],
            [
                1021,
                1184
            ],
            [
                1184,
                1245
            ],
            [
                1245,
                1300
            ],
            [
                1300,
                1366
            ],
            [
                1366,
                1386
            ],
            [
                1386,
                1464
            ],
            [
                1464,
                1618
            ],
            [
                1618,
                1883
            ],
            [
                1883,
                1966
            ],
            [
                1966,
                2161
            ],
            [
                2161,
                2282
            ],
            [
                2282,
                2395
            ],
            [
                2395,
                2619
            ],
            [
                2619,
                2767
            ],
            [
                2767,
                2874
            ],
            [
                2874,
                2926
            ],
            [
                2926,
                3007
            ],
            [
                3007,
                3125
            ],
            [
                3125,
                3229
            ],
            [
                3229,
                3333
            ],
            [
                3333,
                3411
            ],
            [
                3411,
                3619
            ],
            [
                3619,
                3785
            ],
            [
                3785,
                3826
            ],
            [
                3826,
                3888
            ],
            [
                3888,
                3966
            ],
            [
                3966,
                4120
            ],
            [
                4120,
                4289
            ],
            [
                4289,
                4466
            ],
            [
                4466,
                4485
            ],
            [
                4485,
                4746
            ],
            [
                4746,
                4848
            ],
            [
                4848,
                5018
            ],
            [
                5018,
                5061
            ],
            [
                5061,
                5128
            ],
            [
                5128,
                5147
            ],
            [
                5147,
                5200
            ],
            [
                5200,
                5371
            ],
            [
                5371,
                5565
            ],
            [
                5565,
                5621
            ],
            [
                5621,
                5760
            ],
            [
                5760,
                5841
            ],
            [
                5841,
                6030
            ],
            [
                6030,
                6292
            ],
            [
                6292,
                6324
            ],
            [
                6324,
                6334
            ],
            [
                6334,
                6360
            ],
            [
                6360,
                6372
            ],
            [
                6372,
                6460
            ],
            [
                6460,
                6552
            ],
            [
                6552,
                6587
            ],
            [
                6587,
                6605
            ],
            [
                6605,
                6622
            ],
            [
                6622,
                6645
            ],
            [
                6645,
                6701
            ],
            [
                6701,
                6740
            ],
            [
                6740,
                6784
            ],
            [
                6784,
                6869
            ],
            [
                6869,
                6888
            ],
            [
                6888,
                6938
            ],
            [
                6938,
                7075
            ],
            [
                7075,
                7178
            ],
            [
                7178,
                7210
            ],
            [
                7210,
                7236
            ],
            [
                7236,
                7292
            ]
        ]
    }
}