{
    "original": {
        "text": "Yesterday afternoon set in misty and cold. I had half a mind to spend it by my study fire, instead of wading through heath and mud to Wuthering Heights. On coming up from dinner, however, (N.B.-I dine between twelve and one o'clock; the housekeeper, a matronly lady, taken as a fixture along with the house, could not, or would not, comprehend my request that I might be served at five)-on mounting the stairs with this lazy intention, and stepping into the room, I saw a servant-girl on her knees surrounded by brushes and coal-scuttles, and raising an infernal dust as she extinguished the flames with heaps of cinders. This spectacle drove me back immediately; I took my hat, and, after a four-miles' walk, arrived at Heathcliff's garden-gate just in time to escape the first feathery flakes of a snow shower.\nOn that bleak hill top the earth was hard with a black frost, and the air made me shiver through every limb. Being unable to remove the chain, I jumped over, and, running up the flagged causeway bordered with straggling gooseberry-bushes, knocked vainly for admittance, till my knuckles tingled and the dogs howled.\n\"Wretched inmates!\" I ejaculated, mentally, \"you deserve perpetual isolation from your species for your churlish inhospitality. At least, I would not keep my doors barred in the day-time. I don't care-I will get in!\" So resolved, I grasped the latch and shook it vehemently. Vinegar-faced Joseph projected his head from a round window of the barn.\n\"What are ye for?\" he shouted. \"T' maister's down i' t' fowld. Go round by th' end o' t' laith, if ye went to spake to him.\"\n\"Is there nobody inside to open the door?\" I hallooed, responsively.\n\"There's nobbut t' missis; and shoo'll not oppen 't an ye mak' yer flaysome dins till neeght.\"\n\"Why? Cannot you tell her whom I am, eh, Joseph?\"\n\"Nor-ne me! I'll hae no hend wi't,\" muttered the head, vanishing.\nThe snow began to drive thickly. I seized the handle to essay another trial; when a young man without coat, and shouldering a pitchfork, appeared in the yard behind. He hailed me to follow him, and, after marching through a wash-house, and a paved area containing a coal-shed, pump, and pigeon-cot, we at length arrived in the huge, warm, cheerful apartment where I was formerly received. It glowed delightfully in the radiance of an immense fire, compounded of coal, peat, and wood; and near the table, laid for a plentiful evening meal, I was pleased to observe the \"missis,\" an individual whose existence I had never previously suspected. I bowed and waited, thinking she would bid me take a seat. She looked at me, leaning back in her chair, and remained motionless and mute.\n\"Rough weather!\" I remarked. \"I'm afraid, Mrs. Heathcliff, the door must bear the consequence of your servants' leisure attendance: I had hard work to make them hear me.\"\nShe never opened her mouth. I stared-she stared also: at any rate, she kept her eyes on me in a cool, regardless manner, exceedingly embarrassing and disagreeable.\n\"Sit down,\" said the young man, gruffly. \"He'll be in soon.\"\nI obeyed; and hemmed, and called the villain Juno, who deigned, at this second interview, to move the extreme tip of her tail, in token of owning my acquaintance.\n\"A beautiful animal!\" I commenced again. \"Do you intend parting with the little ones, madam?\"\n\"They are not mine,\" said the amiable hostess, more repellingly than Heathcliff himself could have replied.\n\"Ah, your favourites are among these?\" I continued, turning to an obscure cushion full of something like cats.\n\"A strange choice of favourites!\" she observed scornfully.\nUnluckily, it was a heap of dead rabbits. I hemmed once more, and drew closer to the hearth, repeating my comment on the wildness of the evening.\n\"You should not have come out,\" she said, rising and reaching from the chimney-piece two of the painted canisters.\nHer position before was sheltered from the light; now, I had a distinct view of her whole figure and countenance. She was slender, and apparently scarcely past girlhood: an admirable form, and the most exquisite little face that I have ever had the pleasure of beholding; small features, very fair; flaxen ringlets, or rather golden, hanging loose on her delicate neck; and eyes, had they been agreeable in expression, that would have been irresistible: fortunately for my susceptible heart, the only sentiment they evinced hovered between scorn and a kind of desperation, singularly unnatural to be detected there. The canisters were almost out of her reach; I made a motion to aid her; she turned upon me as a miser might turn if any one attempted to assist him in counting his gold.\n\"I don't want your help,\" she snapped; \"I can get them for myself.\"\n\"I beg your pardon!\" I hastened to reply.\n\"Were you asked to tea?\" she demanded, tying an apron over her neat black frock, and standing with a spoonful of the leaf poised over the pot.\n\"I shall be glad to have a cup,\" I answered.\n\"Were you asked?\" she repeated.\n\"No,\" I said, half smiling. \"You are the proper person to ask me.\"\nShe flung the tea back, spoon and all, and resumed her chair in a pet; her forehead corrugated, and her red under-lip pushed out, like a child's ready to cry.\nMeanwhile, the young man had slung on to his person a decidedly shabby upper garment, and, erecting himself before the blaze, looked down on me from the corner of his eyes, for all the world as if there were some mortal feud unavenged between us. I began to doubt whether he were a servant or not: his dress and speech were both rude, entirely devoid of the superiority observable in Mr. and Mrs. Heathcliff; his thick brown curls were rough and uncultivated, his whiskers encroached bearishly over his cheeks, and his hands were embrowned like those of a common labourer: still his bearing was free, almost haughty, and he showed none of a domestic's assiduity in attending on the lady of the house. In the absence of clear proofs of his condition, I deemed it best to abstain from noticing his curious conduct; and, five minutes afterwards, the entrance of Heathcliff relieved me, in some measure, from my uncomfortable state.\n\"You see, sir, I am come, according to promise!\" I exclaimed, assuming the cheerful; \"and I fear I shall be weather-bound for half an hour, if you can afford me shelter during that space.\"\n\"Half an hour?\" he said, shaking the white flakes from his clothes; \"I wonder you should select the thick of a snow-storm to ramble about in. Do you know that you run a risk of being lost in the marshes? People familiar with these moors often miss their road on such evenings; and I can tell you there is no chance of a change at present.\"\n\"Perhaps I can get a guide among your lads, and he might stay at the Grange till morning-could you spare me one?\"\n\"No, I could not.\"\n\"Oh, indeed! Well, then, I must trust to my own sagacity.\"\n\"Umph!\"\n\"Are you going to mak' the tea?\" demanded he of the shabby coat, shifting his ferocious gaze from me to the young lady.\n\"Is _he_ to have any?\" she asked, appealing to Heathcliff.\n\"Get it ready, will you?\" was the answer, uttered so savagely that I started. The tone in which the words were said revealed a genuine bad nature. I no longer felt inclined to call Heathcliff a capital fellow. When the preparations were finished, he invited me with-\"Now, sir, bring forward your chair.\" And we all, including the rustic youth, drew round the table: an austere silence prevailing while we discussed our meal.\nI thought, if I had caused the cloud, it was my duty to make an effort to dispel it. They could not every day sit so grim and taciturn; and it was impossible, however ill-tempered they might be, that the universal scowl they wore was their every-day countenance.\n\"It is strange,\" I began, in the interval of swallowing one cup of tea and receiving another-\"it is strange how custom can mould our tastes and ideas: many could not imagine the existence of happiness in a life of such complete exile from the world as you spend, Mr. Heathcliff; yet, I'll venture to say, that, surrounded by your family, and with your amiable lady as the presiding genius over your home and heart-\"\n\"My amiable lady!\" he interrupted, with an almost diabolical sneer on his face. \"Where is she-my amiable lady?\"\n\"Mrs. Heathcliff, your wife, I mean.\"\n\"Well, yes-oh, you would intimate that her spirit has taken the post of ministering angel, and guards the fortunes of Wuthering Heights, even when her body is gone. Is that it?\"\nPerceiving myself in a blunder, I attempted to correct it. I might have seen there was too great a disparity between the ages of the parties to make it likely that they were man and wife. One was about forty: a period of mental vigour at which men seldom cherish the delusion of being married for love by girls: that dream is reserved for the solace of our declining years. The other did not look seventeen.\nThen it flashed upon me-\"The clown at my elbow, who is drinking his tea out of a basin and eating his bread with unwashed hands, may be her husband: Heathcliff junior, of course. Here is the consequence of being buried alive: she has thrown herself away upon that boor from sheer ignorance that better individuals existed! A sad pity-I must beware how I cause her to regret her choice.\" The last reflection may seem conceited; it was not. My neighbour struck me as bordering on repulsive; I knew, through experience, that I was tolerably attractive.\n\"Mrs. Heathcliff is my daughter-in-law,\" said Heathcliff, corroborating my surmise. He turned, as he spoke, a peculiar look in her direction: a look of hatred; unless he has a most perverse set of facial muscles that will not, like those of other people, interpret the language of his soul.\n\"Ah, certainly-I see now: you are the favoured possessor of the beneficent fairy,\" I remarked, turning to my neighbour.\nThis was worse than before: the youth grew crimson, and clenched his fist, with every appearance of a meditated assault. But he seemed to recollect himself presently, and smothered the storm in a brutal curse, muttered on my behalf: which, however, I took care not to notice.\n\"Unhappy in your conjectures, sir,\" observed my host; \"we neither of us have the privilege of owning your good fairy; her mate is dead. I said she was my daughter-in-law: therefore, she must have married my son.\"\n\"And this young man is-\"\n\"Not my son, assuredly.\"\nHeathcliff smiled again, as if it were rather too bold a jest to attribute the paternity of that bear to him.\n\"My name is Hareton Earnshaw,\" growled the other; \"and I'd counsel you to respect it!\"\n\"I've shown no disrespect,\" was my reply, laughing internally at the dignity with which he announced himself.\nHe fixed his eye on me longer than I cared to return the stare, for fear I might be tempted either to box his ears or render my hilarity audible. I began to feel unmistakably out of place in that pleasant family circle. The dismal spiritual atmosphere overcame, and more than neutralised, the glowing physical comforts round me; and I resolved to be cautious how I ventured under those rafters a third time.\nThe business of eating being concluded, and no one uttering a word of sociable conversation, I approached a window to examine the weather. A sorrowful sight I saw: dark night coming down prematurely, and sky and hills mingled in one bitter whirl of wind and suffocating snow.\n\"I don't think it possible for me to get home now without a guide,\" I could not help exclaiming. \"The roads will be buried already; and, if they were bare, I could scarcely distinguish a foot in advance.\"\n\"Hareton, drive those dozen sheep into the barn porch. They'll be covered if left in the fold all night: and put a plank before them,\" said Heathcliff.\n\"How must I do?\" I continued, with rising irritation.\nThere was no reply to my question; and on looking round I saw only Joseph bringing in a pail of porridge for the dogs, and Mrs. Heathcliff leaning over the fire, diverting herself with burning a bundle of matches which had fallen from the chimney-piece as she restored the tea-canister to its place. The former, when he had deposited his burden, took a critical survey of the room, and in cracked tones grated out-\"Aw wonder how yah can faishion to stand thear i' idleness un war, when all on 'ems goan out! Bud yah're a nowt, and it's no use talking-yah'll niver mend o'yer ill ways, but goa raight to t' divil, like yer mother afore ye!\"\nI imagined, for a moment, that this piece of eloquence was addressed to me; and, sufficiently enraged, stepped towards the aged rascal with an intention of kicking him out of the door. Mrs. Heathcliff, however, checked me by her answer.\n\"You scandalous old hypocrite!\" she replied. \"Are you not afraid of being carried away bodily, whenever you mention the devil's name? I warn you to refrain from provoking me, or I'll ask your abduction as a special favour! Stop! look here, Joseph,\" she continued, taking a long, dark book from a shelf; \"I'll show you how far I've progressed in the Black Art: I shall soon be competent to make a clear house of it. The red cow didn't die by chance; and your rheumatism can hardly be reckoned among providential visitations!\"\n\"Oh, wicked, wicked!\" gasped the elder; \"may the Lord deliver us from evil!\"\n\"No, reprobate! you are a castaway-be off, or I'll hurt you seriously! I'll have you all modelled in wax and clay! and the first who passes the limits I fix shall-I'll not say what he shall be done to-but, you'll see! Go, I'm looking at you!\"\nThe little witch put a mock malignity into her beautiful eyes, and Joseph, trembling with sincere horror, hurried out, praying, and ejaculating \"wicked\" as he went. I thought her conduct must be prompted by a species of dreary fun; and, now that we were alone, I endeavoured to interest her in my distress.\n\"Mrs. Heathcliff,\" I said earnestly, \"you must excuse me for troubling you. I presume, because, with that face, I'm sure you cannot help being good-hearted. Do point out some landmarks by which I may know my way home: I have no more idea how to get there than you would have how to get to London!\"\n\"Take the road you came,\" she answered, ensconcing herself in a chair, with a candle, and the long book open before her. \"It is brief advice, but as sound as I can give.\"\n\"Then, if you hear of me being discovered dead in a bog or a pit full of snow, your conscience won't whisper that it is partly your fault?\"\n\"How so? I cannot escort you. They wouldn't let me go to the end of the garden wall.\"\n\"_You_! I should be sorry to ask you to cross the threshold, for my convenience, on such a night,\" I cried. \"I want you to tell me my way, not to _show_ it: or else to persuade Mr. Heathcliff to give me a guide.\"\n\"Who? There is himself, Earnshaw, Zillah, Joseph and I. Which would you have?\"\n\"Are there no boys at the farm?\"\n\"No; those are all.\"\n\"Then, it follows that I am compelled to stay.\"\n\"That you may settle with your host. I have nothing to do with it.\"\n\"I hope it will be a lesson to you to make no more rash journeys on these hills,\" cried Heathcliff's stern voice from the kitchen entrance. \"As to staying here, I don't keep accommodations for visitors: you must share a bed with Hareton or Joseph, if you do.\"\n\"I can sleep on a chair in this room,\" I replied.\n\"No, no! A stranger is a stranger, be he rich or poor: it will not suit me to permit any one the range of the place while I am off guard!\" said the unmannerly wretch.\nWith this insult my patience was at an end. I uttered an expression of disgust, and pushed past him into the yard, running against Earnshaw in my haste. It was so dark that I could not see the means of exit; and, as I wandered round, I heard another specimen of their civil behaviour amongst each other. At first the young man appeared about to befriend me.\n\"I'll go with him as far as the park,\" he said.\n\"You'll go with him to hell!\" exclaimed his master, or whatever relation he bore. \"And who is to look after the horses, eh?\"\n\"A man's life is of more consequence than one evening's neglect of the horses: somebody must go,\" murmured Mrs. Heathcliff, more kindly than I expected.\n\"Not at your command!\" retorted Hareton. \"If you set store on him, you'd better be quiet.\"\n\"Then I hope his ghost will haunt you; and I hope Mr. Heathcliff will never get another tenant till the Grange is a ruin,\" she answered, sharply.\n\"Hearken, hearken, shoo's cursing on 'em!\" muttered Joseph, towards whom I had been steering.\nHe sat within earshot, milking the cows by the light of a lantern, which I seized unceremoniously, and, calling out that I would send it back on the morrow, rushed to the nearest postern.\n\"Maister, maister, he's staling t' lanthern!\" shouted the ancient, pursuing my retreat. \"Hey, Gnasher! Hey, dog! Hey Wolf, holld him, holld him!\"\nOn opening the little door, two hairy monsters flew at my throat, bearing me down, and extinguishing the light; while a mingled guffaw from Heathcliff and Hareton put the copestone on my rage and humiliation. Fortunately, the beasts seemed more bent on stretching their paws, and yawning, and flourishing their tails, than devouring me alive; but they would suffer no resurrection, and I was forced to lie till their malignant masters pleased to deliver me: then, hatless and trembling with wrath, I ordered the miscreants to let me out-on their peril to keep me one minute longer-with several incoherent threats of retaliation that, in their indefinite depth of virulency, smacked of King Lear.\nThe vehemence of my agitation brought on a copious bleeding at the nose, and still Heathcliff laughed, and still I scolded. I don't know what would have concluded the scene, had there not been one person at hand rather more rational than myself, and more benevolent than my entertainer. This was Zillah, the stout housewife; who at length issued forth to inquire into the nature of the uproar. She thought that some of them had been laying violent hands on me; and, not daring to attack her master, she turned her vocal artillery against the younger scoundrel.\n\"Well, Mr. Earnshaw,\" she cried, \"I wonder what you'll have agait next? Are we going to murder folk on our very door-stones? I see this house will never do for me-look at t' poor lad, he's fair choking! Wisht, wisht; you mun'n't go on so. Come in, and I'll cure that: there now, hold ye still.\"\nWith these words she suddenly splashed a pint of icy water down my neck, and pulled me into the kitchen. Mr. Heathcliff followed, his accidental merriment expiring quickly in his habitual moroseness.\nI was sick exceedingly, and dizzy, and faint; and thus compelled perforce to accept lodgings under his roof. He told Zillah to give me a glass of brandy, and then passed on to the inner room; while she condoled with me on my sorry predicament, and having obeyed his orders, whereby I was somewhat revived, ushered me to bed.",
        "paragraph_chars": [
            [
                0,
                813
            ],
            [
                813,
                1129
            ],
            [
                1129,
                1477
            ],
            [
                1477,
                1602
            ],
            [
                1602,
                1671
            ],
            [
                1671,
                1766
            ],
            [
                1766,
                1816
            ],
            [
                1816,
                1882
            ],
            [
                1882,
                2662
            ],
            [
                2662,
                2833
            ],
            [
                2833,
                2997
            ],
            [
                2997,
                3058
            ],
            [
                3058,
                3221
            ],
            [
                3221,
                3315
            ],
            [
                3315,
                3423
            ],
            [
                3423,
                3534
            ],
            [
                3534,
                3593
            ],
            [
                3593,
                3739
            ],
            [
                3739,
                3854
            ],
            [
                3854,
                4640
            ],
            [
                4640,
                4708
            ],
            [
                4708,
                4750
            ],
            [
                4750,
                4893
            ],
            [
                4893,
                4938
            ],
            [
                4938,
                4970
            ],
            [
                4970,
                5037
            ],
            [
                5037,
                5196
            ],
            [
                5196,
                6125
            ],
            [
                6125,
                6314
            ],
            [
                6314,
                6654
            ],
            [
                6654,
                6768
            ],
            [
                6768,
                6787
            ],
            [
                6787,
                6846
            ],
            [
                6846,
                6854
            ],
            [
                6854,
                6974
            ],
            [
                6974,
                7033
            ],
            [
                7033,
                7458
            ],
            [
                7458,
                7721
            ],
            [
                7721,
                8137
            ],
            [
                8137,
                8249
            ],
            [
                8249,
                8287
            ],
            [
                8287,
                8465
            ],
            [
                8465,
                8873
            ],
            [
                8873,
                9423
            ],
            [
                9423,
                9714
            ],
            [
                9714,
                9834
            ],
            [
                9834,
                10110
            ],
            [
                10110,
                10323
            ],
            [
                10323,
                10348
            ],
            [
                10348,
                10373
            ],
            [
                10373,
                10483
            ],
            [
                10483,
                10570
            ],
            [
                10570,
                10680
            ],
            [
                10680,
                11088
            ],
            [
                11088,
                11364
            ],
            [
                11364,
                11569
            ],
            [
                11569,
                11721
            ],
            [
                11721,
                11775
            ],
            [
                11775,
                12415
            ],
            [
                12415,
                12652
            ],
            [
                12652,
                13177
            ],
            [
                13177,
                13254
            ],
            [
                13254,
                13497
            ],
            [
                13497,
                13804
            ],
            [
                13804,
                14102
            ],
            [
                14102,
                14273
            ],
            [
                14273,
                14413
            ],
            [
                14413,
                14499
            ],
            [
                14499,
                14712
            ],
            [
                14712,
                14791
            ],
            [
                14791,
                14824
            ],
            [
                14824,
                14845
            ],
            [
                14845,
                14893
            ],
            [
                14893,
                14961
            ],
            [
                14961,
                15221
            ],
            [
                15221,
                15271
            ],
            [
                15271,
                15438
            ],
            [
                15438,
                15796
            ],
            [
                15796,
                15844
            ],
            [
                15844,
                15969
            ],
            [
                15969,
                16122
            ],
            [
                16122,
                16213
            ],
            [
                16213,
                16359
            ],
            [
                16359,
                16453
            ],
            [
                16453,
                16641
            ],
            [
                16641,
                16787
            ],
            [
                16787,
                17483
            ],
            [
                17483,
                18044
            ],
            [
                18044,
                18339
            ],
            [
                18339,
                18539
            ],
            [
                18539,
                18863
            ]
        ],
        "segment_chars": [
            [
                0,
                43
            ],
            [
                43,
                153
            ],
            [
                153,
                622
            ],
            [
                622,
                813
            ],
            [
                813,
                922
            ],
            [
                922,
                1129
            ],
            [
                1129,
                1149
            ],
            [
                1149,
                1257
            ],
            [
                1257,
                1317
            ],
            [
                1317,
                1346
            ],
            [
                1346,
                1404
            ],
            [
                1404,
                1477
            ],
            [
                1477,
                1496
            ],
            [
                1496,
                1508
            ],
            [
                1508,
                1540
            ],
            [
                1540,
                1602
            ],
            [
                1602,
                1645
            ],
            [
                1645,
                1671
            ],
            [
                1671,
                1766
            ],
            [
                1766,
                1772
            ],
            [
                1772,
                1816
            ],
            [
                1816,
                1828
            ],
            [
                1828,
                1882
            ],
            [
                1882,
                1915
            ],
            [
                1915,
                2048
            ],
            [
                2048,
                2271
            ],
            [
                2271,
                2524
            ],
            [
                2524,
                2583
            ],
            [
                2583,
                2662
            ],
            [
                2662,
                2679
            ],
            [
                2679,
                2691
            ],
            [
                2691,
                2833
            ],
            [
                2833,
                2861
            ],
            [
                2861,
                2997
            ],
            [
                2997,
                3038
            ],
            [
                3038,
                3058
            ],
            [
                3058,
                3221
            ],
            [
                3221,
                3243
            ],
            [
                3243,
                3262
            ],
            [
                3262,
                3315
            ],
            [
                3315,
                3423
            ],
            [
                3423,
                3462
            ],
            [
                3462,
                3534
            ],
            [
                3534,
                3568
            ],
            [
                3568,
                3593
            ],
            [
                3593,
                3635
            ],
            [
                3635,
                3739
            ],
            [
                3739,
                3854
            ],
            [
                3854,
                3968
            ],
            [
                3968,
                4470
            ],
            [
                4470,
                4640
            ],
            [
                4640,
                4708
            ],
            [
                4708,
                4729
            ],
            [
                4729,
                4750
            ],
            [
                4750,
                4775
            ],
            [
                4775,
                4893
            ],
            [
                4893,
                4938
            ],
            [
                4938,
                4956
            ],
            [
                4956,
                4970
            ],
            [
                4970,
                4998
            ],
            [
                4998,
                5037
            ],
            [
                5037,
                5196
            ],
            [
                5196,
                5443
            ],
            [
                5443,
                5897
            ],
            [
                5897,
                6125
            ],
            [
                6125,
                6174
            ],
            [
                6174,
                6314
            ],
            [
                6314,
                6330
            ],
            [
                6330,
                6456
            ],
            [
                6456,
                6518
            ],
            [
                6518,
                6654
            ],
            [
                6654,
                6768
            ],
            [
                6768,
                6787
            ],
            [
                6787,
                6800
            ],
            [
                6800,
                6846
            ],
            [
                6846,
                6854
            ],
            [
                6854,
                6887
            ],
            [
                6887,
                6974
            ],
            [
                6974,
                6997
            ],
            [
                6997,
                7033
            ],
            [
                7033,
                7059
            ],
            [
                7059,
                7111
            ],
            [
                7111,
                7180
            ],
            [
                7180,
                7243
            ],
            [
                7243,
                7337
            ],
            [
                7337,
                7458
            ],
            [
                7458,
                7543
            ],
            [
                7543,
                7721
            ],
            [
                7721,
                8137
            ],
            [
                8137,
                8156
            ],
            [
                8156,
                8217
            ],
            [
                8217,
                8249
            ],
            [
                8249,
                8287
            ],
            [
                8287,
                8452
            ],
            [
                8452,
                8465
            ],
            [
                8465,
                8524
            ],
            [
                8524,
                8653
            ],
            [
                8653,
                8839
            ],
            [
                8839,
                8873
            ],
            [
                8873,
                9052
            ],
            [
                9052,
                9196
            ],
            [
                9196,
                9260
            ],
            [
                9260,
                9312
            ],
            [
                9312,
                9423
            ],
            [
                9423,
                9507
            ],
            [
                9507,
                9714
            ],
            [
                9714,
                9834
            ],
            [
                9834,
                9955
            ],
            [
                9955,
                10110
            ],
            [
                10110,
                10246
            ],
            [
                10246,
                10323
            ],
            [
                10323,
                10348
            ],
            [
                10348,
                10373
            ],
            [
                10373,
                10483
            ],
            [
                10483,
                10570
            ],
            [
                10570,
                10680
            ],
            [
                10680,
                10826
            ],
            [
                10826,
                10900
            ],
            [
                10900,
                11088
            ],
            [
                11088,
                11227
            ],
            [
                11227,
                11364
            ],
            [
                11364,
                11461
            ],
            [
                11461,
                11569
            ],
            [
                11569,
                11624
            ],
            [
                11624,
                11721
            ],
            [
                11721,
                11738
            ],
            [
                11738,
                11775
            ],
            [
                11775,
                12075
            ],
            [
                12075,
                12283
            ],
            [
                12283,
                12415
            ],
            [
                12415,
                12600
            ],
            [
                12600,
                12652
            ],
            [
                12652,
                12684
            ],
            [
                12684,
                12697
            ],
            [
                12697,
                12786
            ],
            [
                12786,
                12875
            ],
            [
                12875,
                12881
            ],
            [
                12881,
                13067
            ],
            [
                13067,
                13177
            ],
            [
                13177,
                13199
            ],
            [
                13199,
                13254
            ],
            [
                13254,
                13270
            ],
            [
                13270,
                13325
            ],
            [
                13325,
                13369
            ],
            [
                13369,
                13472
            ],
            [
                13472,
                13497
            ],
            [
                13497,
                13662
            ],
            [
                13662,
                13804
            ],
            [
                13804,
                13880
            ],
            [
                13880,
                13961
            ],
            [
                13961,
                14102
            ],
            [
                14102,
                14223
            ],
            [
                14223,
                14273
            ],
            [
                14273,
                14413
            ],
            [
                14413,
                14422
            ],
            [
                14422,
                14443
            ],
            [
                14443,
                14499
            ],
            [
                14499,
                14507
            ],
            [
                14507,
                14607
            ],
            [
                14607,
                14712
            ],
            [
                14712,
                14718
            ],
            [
                14718,
                14768
            ],
            [
                14768,
                14791
            ],
            [
                14791,
                14824
            ],
            [
                14824,
                14845
            ],
            [
                14845,
                14893
            ],
            [
                14893,
                14930
            ],
            [
                14930,
                14961
            ],
            [
                14961,
                15101
            ],
            [
                15101,
                15221
            ],
            [
                15221,
                15271
            ],
            [
                15271,
                15280
            ],
            [
                15280,
                15410
            ],
            [
                15410,
                15438
            ],
            [
                15438,
                15482
            ],
            [
                15482,
                15591
            ],
            [
                15591,
                15742
            ],
            [
                15742,
                15796
            ],
            [
                15796,
                15844
            ],
            [
                15844,
                15874
            ],
            [
                15874,
                15926
            ],
            [
                15926,
                15969
            ],
            [
                15969,
                16122
            ],
            [
                16122,
                16145
            ],
            [
                16145,
                16163
            ],
            [
                16163,
                16213
            ],
            [
                16213,
                16359
            ],
            [
                16359,
                16402
            ],
            [
                16402,
                16453
            ],
            [
                16453,
                16641
            ],
            [
                16641,
                16687
            ],
            [
                16687,
                16729
            ],
            [
                16729,
                16744
            ],
            [
                16744,
                16754
            ],
            [
                16754,
                16787
            ],
            [
                16787,
                16996
            ],
            [
                16996,
                17483
            ],
            [
                17483,
                17607
            ],
            [
                17607,
                17770
            ],
            [
                17770,
                17877
            ],
            [
                17877,
                18044
            ],
            [
                18044,
                18116
            ],
            [
                18116,
                18169
            ],
            [
                18169,
                18247
            ],
            [
                18247,
                18283
            ],
            [
                18283,
                18339
            ],
            [
                18339,
                18444
            ],
            [
                18444,
                18539
            ],
            [
                18539,
                18648
            ],
            [
                18648,
                18863
            ]
        ],
        "overlap_chars": [
            [
                0,
                43
            ],
            [
                43,
                153
            ],
            [
                171,
                186
            ],
            [
                188,
                189
            ],
            [
                194,
                231
            ],
            [
                186,
                187
            ],
            [
                233,
                248
            ],
            [
                333,
                354
            ],
            [
                368,
                385
            ],
            [
                360,
                361
            ],
            [
                449,
                453
            ],
            [
                470,
                567
            ],
            [
                620,
                622
            ],
            [
                664,
                804
            ],
            [
                811,
                813
            ],
            [
                813,
                831
            ],
            [
                832,
                922
            ],
            [
                956,
                969
            ],
            [
                945,
                948
            ],
            [
                969,
                990
            ],
            [
                1043,
                1044
            ],
            [
                1050,
                1129
            ],
            [
                1130,
                1138
            ],
            [
                1161,
                1162
            ],
            [
                1139,
                1146
            ],
            [
                1149,
                1150
            ],
            [
                1267,
                1317
            ],
            [
                1330,
                1343
            ],
            [
                1359,
                1391
            ],
            [
                1402,
                1404
            ],
            [
                1404,
                1424
            ],
            [
                1435,
                1443
            ],
            [
                1444,
                1477
            ],
            [
                1478,
                1482
            ],
            [
                1487,
                1489
            ],
            [
                1496,
                1508
            ],
            [
                1528,
                1529
            ],
            [
                1519,
                1526
            ],
            [
                1509,
                1511
            ],
            [
                1538,
                1540
            ],
            [
                1540,
                1551
            ],
            [
                1563,
                1565
            ],
            [
                1571,
                1578
            ],
            [
                1584,
                1586
            ],
            [
                1593,
                1599
            ],
            [
                1603,
                1642
            ],
            [
                1645,
                1646
            ],
            [
                1669,
                1671
            ],
            [
                1677,
                1701
            ],
            [
                1706,
                1713
            ],
            [
                1726,
                1728
            ],
            [
                1767,
                1772
            ],
            [
                1779,
                1791
            ],
            [
                1797,
                1801
            ],
            [
                1805,
                1813
            ],
            [
                1826,
                1828
            ],
            [
                1828,
                1832
            ],
            [
                1837,
                1839
            ],
            [
                1852,
                1882
            ],
            [
                1882,
                1915
            ],
            [
                1915,
                1937
            ],
            [
                1957,
                1975
            ],
            [
                1994,
                2017
            ],
            [
                2019,
                2039
            ],
            [
                2046,
                2048
            ],
            [
                2048,
                2050
            ],
            [
                2058,
                2157
            ],
            [
                2165,
                2168
            ],
            [
                2159,
                2163
            ],
            [
                2179,
                2229
            ],
            [
                2240,
                2270
            ],
            [
                2271,
                2328
            ],
            [
                2370,
                2449
            ],
            [
                2451,
                2457
            ],
            [
                2474,
                2495
            ],
            [
                2513,
                2524
            ],
            [
                2524,
                2583
            ],
            [
                2583,
                2631
            ],
            [
                2660,
                2662
            ],
            [
                2663,
                2676
            ],
            [
                2679,
                2691
            ],
            [
                2772,
                2773
            ],
            [
                2692,
                2720
            ],
            [
                2794,
                2817
            ],
            [
                2759,
                2772
            ],
            [
                2823,
                2830
            ],
            [
                2833,
                2861
            ],
            [
                2861,
                2885
            ],
            [
                2898,
                2899
            ],
            [
                2924,
                2933
            ],
            [
                2946,
                2997
            ],
            [
                3002,
                3006
            ],
            [
                3009,
                3038
            ],
            [
                3039,
                3055
            ],
            [
                3058,
                3071
            ],
            [
                3084,
                3102
            ],
            [
                3078,
                3079
            ],
            [
                3103,
                3136
            ],
            [
                3146,
                3183
            ],
            [
                3185,
                3187
            ],
            [
                3219,
                3221
            ],
            [
                3222,
                3240
            ],
            [
                3243,
                3244
            ],
            [
                3260,
                3262
            ],
            [
                3266,
                3293
            ],
            [
                3305,
                3312
            ],
            [
                3321,
                3333
            ],
            [
                3336,
                3360
            ],
            [
                3367,
                3378
            ],
            [
                3421,
                3423
            ],
            [
                3424,
                3447
            ],
            [
                3454,
                3459
            ],
            [
                3462,
                3485
            ],
            [
                3497,
                3534
            ],
            [
                3535,
                3565
            ],
            [
                3568,
                3571
            ],
            [
                3581,
                3593
            ],
            [
                3593,
                3635
            ],
            [
                3635,
                3636
            ],
            [
                3653,
                3739
            ],
            [
                3740,
                3768
            ],
            [
                3771,
                3787
            ],
            [
                3843,
                3846
            ],
            [
                3801,
                3823
            ],
            [
                3852,
                3854
            ],
            [
                3904,
                3907
            ],
            [
                3909,
                3916
            ],
            [
                3926,
                3937
            ],
            [
                3951,
                3954
            ],
            [
                3944,
                3950
            ],
            [
                3966,
                3968
            ],
            [
                3968,
                3988
            ],
            [
                4000,
                4023
            ],
            [
                4024,
                4089
            ],
            [
                4124,
                4152
            ],
            [
                4180,
                4186
            ],
            [
                4160,
                4168
            ],
            [
                4188,
                4232
            ],
            [
                4278,
                4306
            ],
            [
                4261,
                4271
            ],
            [
                4095,
                4098
            ],
            [
                4243,
                4247
            ],
            [
                4248,
                4257
            ],
            [
                4308,
                4354
            ],
            [
                4238,
                4242
            ],
            [
                4394,
                4425
            ],
            [
                4468,
                4470
            ],
            [
                4470,
                4477
            ],
            [
                4489,
                4515
            ],
            [
                4530,
                4540
            ],
            [
                4542,
                4552
            ],
            [
                4558,
                4560
            ],
            [
                4638,
                4640
            ],
            [
                4641,
                4663
            ],
            [
                4666,
                4677
            ],
            [
                4709,
                4726
            ],
            [
                4751,
                4772
            ],
            [
                4775,
                4856
            ],
            [
                4872,
                4893
            ],
            [
                4894,
                4923
            ],
            [
                4926,
                4938
            ],
            [
                4939,
                4953
            ],
            [
                4956,
                4970
            ],
            [
                4971,
                4973
            ],
            [
                4976,
                4998
            ],
            [
                4999,
                5034
            ],
            [
                5037,
                5079
            ],
            [
                5103,
                5106
            ],
            [
                5106,
                5196
            ],
            [
                5196,
                5233
            ],
            [
                5248,
                5249
            ],
            [
                5260,
                5266
            ],
            [
                5280,
                5285
            ],
            [
                5322,
                5328
            ],
            [
                5337,
                5339
            ],
            [
                5387,
                5420
            ],
            [
                5431,
                5443
            ],
            [
                5443,
                5444
            ],
            [
                5460,
                5524
            ],
            [
                5632,
                5637
            ],
            [
                5529,
                5539
            ],
            [
                5580,
                5603
            ],
            [
                5845,
                5847
            ],
            [
                5603,
                5631
            ],
            [
                5654,
                5659
            ],
            [
                5699,
                5705
            ],
            [
                5705,
                5720
            ],
            [
                5736,
                5740
            ],
            [
                5750,
                5767
            ],
            [
                5769,
                5778
            ],
            [
                5787,
                5790
            ],
            [
                5797,
                5836
            ],
            [
                5451,
                5453
            ],
            [
                5871,
                5873
            ],
            [
                5895,
                5897
            ],
            [
                5946,
                5947
            ],
            [
                5955,
                5965
            ],
            [
                5988,
                6077
            ],
            [
                6123,
                6125
            ],
            [
                6126,
                6141
            ],
            [
                6145,
                6150
            ],
            [
                6174,
                6185
            ],
            [
                6215,
                6275
            ],
            [
                6283,
                6293
            ],
            [
                6301,
                6305
            ],
            [
                6315,
                6327
            ],
            [
                6330,
                6381
            ],
            [
                6383,
                6402
            ],
            [
                6423,
                6456
            ],
            [
                6459,
                6462
            ],
            [
                6483,
                6487
            ],
            [
                6491,
                6516
            ],
            [
                6518,
                6594
            ],
            [
                6610,
                6651
            ],
            [
                6655,
                6662
            ],
            [
                6762,
                6765
            ],
            [
                6687,
                6696
            ],
            [
                6665,
                6668
            ],
            [
                6675,
                6680
            ],
            [
                6759,
                6761
            ],
            [
                6742,
                6758
            ],
            [
                6769,
                6784
            ],
            [
                6788,
                6800
            ],
            [
                6800,
                6834
            ],
            [
                6847,
                6851
            ],
            [
                6875,
                6876
            ],
            [
                6855,
                6871
            ],
            [
                6877,
                6884
            ],
            [
                6887,
                6974
            ],
            [
                6975,
                6977
            ],
            [
                6979,
                6981
            ],
            [
                6983,
                6994
            ],
            [
                6997,
                7033
            ],
            [
                7034,
                7056
            ],
            [
                7073,
                7074
            ],
            [
                7083,
                7101
            ],
            [
                7059,
                7062
            ],
            [
                7109,
                7111
            ],
            [
                7180,
                7242
            ],
            [
                7300,
                7334
            ],
            [
                7280,
                7282
            ],
            [
                7341,
                7347
            ],
            [
                7377,
                7397
            ],
            [
                7337,
                7340
            ],
            [
                7448,
                7456
            ],
            [
                7410,
                7417
            ],
            [
                7456,
                7458
            ],
            [
                7458,
                7513
            ],
            [
                7532,
                7543
            ],
            [
                7543,
                7592
            ],
            [
                7594,
                7597
            ],
            [
                7672,
                7674
            ],
            [
                7719,
                7721
            ],
            [
                7722,
                7735
            ],
            [
                7738,
                7746
            ],
            [
                7829,
                7860
            ],
            [
                7870,
                7894
            ],
            [
                7912,
                7972
            ],
            [
                7982,
                8085
            ],
            [
                8093,
                8102
            ],
            [
                8110,
                8137
            ],
            [
                8141,
                8153
            ],
            [
                8156,
                8217
            ],
            [
                8218,
                8230
            ],
            [
                8251,
                8254
            ],
            [
                8255,
                8284
            ],
            [
                8298,
                8305
            ],
            [
                8321,
                8336
            ],
            [
                8382,
                8388
            ],
            [
                8405,
                8428
            ],
            [
                8443,
                8445
            ],
            [
                8450,
                8452
            ],
            [
                8452,
                8462
            ],
            [
                8465,
                8475
            ],
            [
                8488,
                8498
            ],
            [
                8509,
                8524
            ],
            [
                8524,
                8563
            ],
            [
                8586,
                8590
            ],
            [
                8606,
                8653
            ],
            [
                8657,
                8673
            ],
            [
                8849,
                8873
            ],
            [
                8873,
                8896
            ],
            [
                8898,
                8959
            ],
            [
                9000,
                9052
            ],
            [
                9052,
                9174
            ],
            [
                9187,
                9196
            ],
            [
                9196,
                9257
            ],
            [
                9260,
                9312
            ],
            [
                9312,
                9337
            ],
            [
                9351,
                9368
            ],
            [
                9390,
                9423
            ],
            [
                9425,
                9428
            ],
            [
                9429,
                9461
            ],
            [
                9464,
                9497
            ],
            [
                9505,
                9507
            ],
            [
                9518,
                9530
            ],
            [
                9507,
                9509
            ],
            [
                9550,
                9553
            ],
            [
                9597,
                9603
            ],
            [
                9533,
                9541
            ],
            [
                9567,
                9581
            ],
            [
                9712,
                9714
            ],
            [
                9715,
                9718
            ],
            [
                9729,
                9777
            ],
            [
                9789,
                9794
            ],
            [
                9797,
                9834
            ],
            [
                9834,
                9907
            ],
            [
                9969,
                9971
            ],
            [
                9907,
                9908
            ],
            [
                10005,
                10007
            ],
            [
                10015,
                10042
            ],
            [
                10108,
                10110
            ],
            [
                10138,
                10143
            ],
            [
                10155,
                10163
            ],
            [
                10165,
                10181
            ],
            [
                10211,
                10246
            ],
            [
                10246,
                10320
            ],
            [
                10324,
                10345
            ],
            [
                10349,
                10370
            ],
            [
                10373,
                10396
            ],
            [
                10481,
                10483
            ],
            [
                10487,
                10511
            ],
            [
                10514,
                10532
            ],
            [
                10534,
                10567
            ],
            [
                10571,
                10595
            ],
            [
                10610,
                10634
            ],
            [
                10639,
                10646
            ],
            [
                10678,
                10680
            ],
            [
                10680,
                10702
            ],
            [
                10715,
                10716
            ],
            [
                10753,
                10797
            ],
            [
                10723,
                10725
            ],
            [
                10824,
                10826
            ],
            [
                10826,
                10841
            ],
            [
                10855,
                10900
            ],
            [
                10900,
                10910
            ],
            [
                10921,
                10940
            ],
            [
                10969,
                10980
            ],
            [
                11007,
                11038
            ],
            [
                11074,
                11088
            ],
            [
                11088,
                11091
            ],
            [
                11126,
                11127
            ],
            [
                11148,
                11157
            ],
            [
                11167,
                11227
            ],
            [
                11227,
                11274
            ],
            [
                11286,
                11364
            ],
            [
                11365,
                11381
            ],
            [
                11382,
                11429
            ],
            [
                11432,
                11433
            ],
            [
                11459,
                11461
            ],
            [
                11466,
                11486
            ],
            [
                11570,
                11590
            ],
            [
                11597,
                11624
            ],
            [
                11624,
                11672
            ],
            [
                11704,
                11721
            ],
            [
                11726,
                11735
            ],
            [
                11738,
                11755
            ],
            [
                11763,
                11775
            ],
            [
                11775,
                11793
            ],
            [
                11808,
                11967
            ],
            [
                11980,
                11987
            ],
            [
                12073,
                12075
            ],
            [
                12085,
                12086
            ],
            [
                12161,
                12177
            ],
            [
                12119,
                12120
            ],
            [
                12178,
                12188
            ],
            [
                12155,
                12156
            ],
            [
                12268,
                12269
            ],
            [
                12193,
                12211
            ],
            [
                12224,
                12229
            ],
            [
                12236,
                12247
            ],
            [
                12254,
                12264
            ],
            [
                12278,
                12283
            ],
            [
                12287,
                12326
            ],
            [
                12329,
                12332
            ],
            [
                12339,
                12343
            ],
            [
                12350,
                12366
            ],
            [
                12375,
                12380
            ],
            [
                12386,
                12412
            ],
            [
                12415,
                12450
            ],
            [
                12470,
                12495
            ],
            [
                12509,
                12549
            ],
            [
                12579,
                12600
            ],
            [
                12600,
                12625
            ],
            [
                12650,
                12652
            ],
            [
                12653,
                12681
            ],
            [
                12684,
                12697
            ],
            [
                12823,
                12838
            ],
            [
                12797,
                12799
            ],
            [
                12793,
                12796
            ],
            [
                12873,
                12875
            ],
            [
                12881,
                12898
            ],
            [
                12901,
                12954
            ],
            [
                12956,
                13010
            ],
            [
                13065,
                13067
            ],
            [
                13067,
                13120
            ],
            [
                13178,
                13196
            ],
            [
                13199,
                13209
            ],
            [
                13215,
                13216
            ],
            [
                13218,
                13251
            ],
            [
                13289,
                13295
            ],
            [
                13295,
                13304
            ],
            [
                13330,
                13338
            ],
            [
                13343,
                13358
            ],
            [
                13367,
                13369
            ],
            [
                13369,
                13372
            ],
            [
                13405,
                13406
            ],
            [
                13411,
                13434
            ],
            [
                13454,
                13472
            ],
            [
                13472,
                13494
            ],
            [
                13497,
                13586
            ],
            [
                13595,
                13628
            ],
            [
                13642,
                13648
            ],
            [
                13650,
                13662
            ],
            [
                13662,
                13671
            ],
            [
                13684,
                13705
            ],
            [
                13714,
                13759
            ],
            [
                13772,
                13804
            ],
            [
                13806,
                13809
            ],
            [
                13810,
                13820
            ],
            [
                13823,
                13840
            ],
            [
                13900,
                13961
            ],
            [
                13961,
                14020
            ],
            [
                14108,
                14125
            ],
            [
                14128,
                14141
            ],
            [
                14161,
                14195
            ],
            [
                14201,
                14223
            ],
            [
                14236,
                14242
            ],
            [
                14260,
                14270
            ],
            [
                14278,
                14303
            ],
            [
                14315,
                14322
            ],
            [
                14332,
                14351
            ],
            [
                14368,
                14373
            ],
            [
                14382,
                14392
            ],
            [
                14400,
                14410
            ],
            [
                14414,
                14422
            ],
            [
                14422,
                14443
            ],
            [
                14443,
                14491
            ],
            [
                14608,
                14644
            ],
            [
                14646,
                14650
            ],
            [
                14652,
                14654
            ],
            [
                14656,
                14709
            ],
            [
                14713,
                14718
            ],
            [
                14718,
                14726
            ],
            [
                14734,
                14768
            ],
            [
                14768,
                14788
            ],
            [
                14792,
                14821
            ],
            [
                14825,
                14827
            ],
            [
                14868,
                14890
            ],
            [
                14899,
                14928
            ],
            [
                14928,
                14930
            ],
            [
                14930,
                14958
            ],
            [
                14962,
                15040
            ],
            [
                15043,
                15082
            ],
            [
                15091,
                15101
            ],
            [
                15102,
                15134
            ],
            [
                15150,
                15207
            ],
            [
                15222,
                15257
            ],
            [
                15260,
                15271
            ],
            [
                15272,
                15280
            ],
            [
                15329,
                15337
            ],
            [
                15349,
                15367
            ],
            [
                15374,
                15397
            ],
            [
                15410,
                15438
            ],
            [
                15438,
                15454
            ],
            [
                15455,
                15482
            ],
            [
                15509,
                15517
            ],
            [
                15482,
                15483
            ],
            [
                15522,
                15560
            ],
            [
                15569,
                15591
            ],
            [
                15591,
                15630
            ],
            [
                15740,
                15741
            ],
            [
                15742,
                15795
            ],
            [
                15797,
                15813
            ],
            [
                15824,
                15832
            ],
            [
                15835,
                15844
            ],
            [
                15845,
                15871
            ],
            [
                15874,
                15883
            ],
            [
                15917,
                15919
            ],
            [
                15924,
                15926
            ],
            [
                15927,
                15966
            ],
            [
                15970,
                15982
            ],
            [
                15989,
                15993
            ],
            [
                16006,
                16064
            ],
            [
                16067,
                16122
            ],
            [
                16123,
                16142
            ],
            [
                16145,
                16163
            ],
            [
                16189,
                16210
            ],
            [
                16219,
                16333
            ],
            [
                16336,
                16348
            ],
            [
                16350,
                16359
            ],
            [
                16360,
                16377
            ],
            [
                16382,
                16392
            ],
            [
                16396,
                16399
            ],
            [
                16402,
                16417
            ],
            [
                16451,
                16452
            ],
            [
                16453,
                16534
            ],
            [
                16557,
                16609
            ],
            [
                16610,
                16623
            ],
            [
                16639,
                16641
            ],
            [
                16649,
                16650
            ],
            [
                16658,
                16664
            ],
            [
                16673,
                16684
            ],
            [
                16687,
                16694
            ],
            [
                16727,
                16729
            ],
            [
                16730,
                16744
            ],
            [
                16754,
                16763
            ],
            [
                16770,
                16774
            ],
            [
                16781,
                16784
            ],
            [
                16815,
                16957
            ],
            [
                16968,
                16996
            ],
            [
                16996,
                17039
            ],
            [
                17067,
                17074
            ],
            [
                17105,
                17144
            ],
            [
                17241,
                17243
            ],
            [
                17167,
                17203
            ],
            [
                17214,
                17221
            ],
            [
                17245,
                17277
            ],
            [
                17283,
                17298
            ],
            [
                17310,
                17372
            ],
            [
                17381,
                17399
            ],
            [
                17481,
                17483
            ],
            [
                17500,
                17533
            ],
            [
                17550,
                17554
            ],
            [
                17554,
                17607
            ],
            [
                17607,
                17619
            ],
            [
                17625,
                17635
            ],
            [
                17655,
                17660
            ],
            [
                17667,
                17670
            ],
            [
                17779,
                17790
            ],
            [
                17797,
                17802
            ],
            [
                17727,
                17728
            ],
            [
                17835,
                17837
            ],
            [
                17620,
                17624
            ],
            [
                17775,
                17778
            ],
            [
                17875,
                17877
            ],
            [
                17877,
                17893
            ],
            [
                17907,
                17947
            ],
            [
                17949,
                17992
            ],
            [
                18021,
                18044
            ],
            [
                18045,
                18063
            ],
            [
                18066,
                18076
            ],
            [
                18116,
                18169
            ],
            [
                18207,
                18247
            ],
            [
                18259,
                18260
            ],
            [
                18270,
                18283
            ],
            [
                18283,
                18311
            ],
            [
                18318,
                18321
            ],
            [
                18323,
                18327
            ],
            [
                18331,
                18336
            ],
            [
                18339,
                18359
            ],
            [
                18369,
                18444
            ],
            [
                18444,
                18468
            ],
            [
                18514,
                18539
            ],
            [
                18539,
                18549
            ],
            [
                18574,
                18588
            ],
            [
                18589,
                18603
            ],
            [
                18613,
                18648
            ],
            [
                18648,
                18740
            ],
            [
                18845,
                18863
            ]
        ],
        "row_chars": [
            [
                0,
                43
            ],
            [
                43,
                153
            ],
            [
                153,
                622
            ],
            [
                622,
                813
            ],
            [
                813,
                922
            ],
            [
                922,
                1129
            ],
            [
                1129,
                1317
            ],
            [
                1317,
                1346
            ],
            [
                1346,
                1404
            ],
            [
                1404,
                1477
            ],
            [
                1477,
                1496
            ],
            [
                1496,
                1508
            ],
            [
                1508,
                1540
            ],
            [
                1540,
                1602
            ],
            [
                1602,
                1645
            ],
            [
                1645,
                1671
            ],
            [
                1671,
                1766
            ],
            [
                1766,
                1772
            ],
            [
                1772,
                1816
            ],
            [
                1816,
                1828
            ],
            [
                1828,
                1882
            ],
            [
                1882,
                1915
            ],
            [
                1915,
                2048
            ],
            [
                2048,
                2271
            ],
            [
                2271,
                2524
            ],
            [
                2524,
                2583
            ],
            [
                2583,
                2662
            ],
            [
                2662,
                2679
            ],
            [
                2679,
                2691
            ],
            [
                2691,
                2833
            ],
            [
                2833,
                2861
            ],
            [
                2861,
                2997
            ],
            [
                2997,
                3038
            ],
            [
                3038,
                3058
            ],
            [
                3058,
                3221
            ],
            [
                3221,
                3243
            ],
            [
                3243,
                3262
            ],
            [
                3262,
                3315
            ],
            [
                3315,
                3423
            ],
            [
                3423,
                3462
            ],
            [
                3462,
                3534
            ],
            [
                3534,
                3568
            ],
            [
                3568,
                3593
            ],
            [
                3593,
                3635
            ],
            [
                3635,
                3739
            ],
            [
                3739,
                3854
            ],
            [
                3854,
                3968
            ],
            [
                3968,
                4470
            ],
            [
                4470,
                4640
            ],
            [
                4640,
                4708
            ],
            [
                4708,
                4729
            ],
            [
                4729,
                4750
            ],
            [
                4750,
                4775
            ],
            [
                4775,
                4893
            ],
            [
                4893,
                4938
            ],
            [
                4938,
                4956
            ],
            [
                4956,
                4970
            ],
            [
                4970,
                4998
            ],
            [
                4998,
                5037
            ],
            [
                5037,
                5196
            ],
            [
                5196,
                5443
            ],
            [
                5443,
                5897
            ],
            [
                5897,
                6125
            ],
            [
                6125,
                6174
            ],
            [
                6174,
                6314
            ],
            [
                6314,
                6330
            ],
            [
                6330,
                6456
            ],
            [
                6456,
                6518
            ],
            [
                6518,
                6654
            ],
            [
                6654,
                6768
            ],
            [
                6768,
                6787
            ],
            [
                6787,
                6800
            ],
            [
                6800,
                6846
            ],
            [
                6846,
                6854
            ],
            [
                6854,
                6887
            ],
            [
                6887,
                6974
            ],
            [
                6974,
                6997
            ],
            [
                6997,
                7033
            ],
            [
                7033,
                7059
            ],
            [
                7059,
                7111
            ],
            [
                7111,
                7180
            ],
            [
                7180,
                7243
            ],
            [
                7243,
                7337
            ],
            [
                7337,
                7458
            ],
            [
                7458,
                7543
            ],
            [
                7543,
                7721
            ],
            [
                7721,
                8137
            ],
            [
                8137,
                8156
            ],
            [
                8156,
                8217
            ],
            [
                8217,
                8249
            ],
            [
                8249,
                8287
            ],
            [
                8287,
                8452
            ],
            [
                8452,
                8465
            ],
            [
                8465,
                8524
            ],
            [
                8524,
                8653
            ],
            [
                8653,
                8873
            ],
            [
                8873,
                9052
            ],
            [
                9052,
                9196
            ],
            [
                9196,
                9260
            ],
            [
                9260,
                9312
            ],
            [
                9312,
                9423
            ],
            [
                9423,
                9507
            ],
            [
                9507,
                9714
            ],
            [
                9714,
                9834
            ],
            [
                9834,
                10110
            ],
            [
                10110,
                10246
            ],
            [
                10246,
                10323
            ],
            [
                10323,
                10348
            ],
            [
                10348,
                10373
            ],
            [
                10373,
                10483
            ],
            [
                10483,
                10570
            ],
            [
                10570,
                10680
            ],
            [
                10680,
                10826
            ],
            [
                10826,
                10900
            ],
            [
                10900,
                11088
            ],
            [
                11088,
                11227
            ],
            [
                11227,
                11364
            ],
            [
                11364,
                11461
            ],
            [
                11461,
                11569
            ],
            [
                11569,
                11624
            ],
            [
                11624,
                11721
            ],
            [
                11721,
                11738
            ],
            [
                11738,
                11775
            ],
            [
                11775,
                12075
            ],
            [
                12075,
                12283
            ],
            [
                12283,
                12415
            ],
            [
                12415,
                12600
            ],
            [
                12600,
                12652
            ],
            [
                12652,
                12684
            ],
            [
                12684,
                12697
            ],
            [
                12697,
                12786
            ],
            [
                12786,
                12875
            ],
            [
                12875,
                12881
            ],
            [
                12881,
                13067
            ],
            [
                13067,
                13177
            ],
            [
                13177,
                13199
            ],
            [
                13199,
                13254
            ],
            [
                13254,
                13270
            ],
            [
                13270,
                13369
            ],
            [
                13369,
                13472
            ],
            [
                13472,
                13497
            ],
            [
                13497,
                13662
            ],
            [
                13662,
                13804
            ],
            [
                13804,
                13961
            ],
            [
                13961,
                14102
            ],
            [
                14102,
                14223
            ],
            [
                14223,
                14273
            ],
            [
                14273,
                14413
            ],
            [
                14413,
                14422
            ],
            [
                14422,
                14443
            ],
            [
                14443,
                14499
            ],
            [
                14499,
                14507
            ],
            [
                14507,
                14607
            ],
            [
                14607,
                14712
            ],
            [
                14712,
                14718
            ],
            [
                14718,
                14768
            ],
            [
                14768,
                14791
            ],
            [
                14791,
                14824
            ],
            [
                14824,
                14845
            ],
            [
                14845,
                14893
            ],
            [
                14893,
                14930
            ],
            [
                14930,
                14961
            ],
            [
                14961,
                15101
            ],
            [
                15101,
                15221
            ],
            [
                15221,
                15271
            ],
            [
                15271,
                15280
            ],
            [
                15280,
                15410
            ],
            [
                15410,
                15438
            ],
            [
                15438,
                15482
            ],
            [
                15482,
                15591
            ],
            [
                15591,
                15742
            ],
            [
                15742,
                15796
            ],
            [
                15796,
                15844
            ],
            [
                15844,
                15874
            ],
            [
                15874,
                15926
            ],
            [
                15926,
                15969
            ],
            [
                15969,
                16122
            ],
            [
                16122,
                16145
            ],
            [
                16145,
                16163
            ],
            [
                16163,
                16213
            ],
            [
                16213,
                16359
            ],
            [
                16359,
                16402
            ],
            [
                16402,
                16453
            ],
            [
                16453,
                16641
            ],
            [
                16641,
                16687
            ],
            [
                16687,
                16729
            ],
            [
                16729,
                16744
            ],
            [
                16744,
                16754
            ],
            [
                16754,
                16787
            ],
            [
                16787,
                16996
            ],
            [
                16996,
                17483
            ],
            [
                17483,
                17607
            ],
            [
                17607,
                17877
            ],
            [
                17877,
                18044
            ],
            [
                18044,
                18169
            ],
            [
                18169,
                18247
            ],
            [
                18247,
                18283
            ],
            [
                18283,
                18339
            ],
            [
                18339,
                18444
            ],
            [
                18444,
                18539
            ],
            [
                18539,
                18648
            ],
            [
                18648,
                18863
            ]
        ]
    },
    "abridged": {
        "text": "Yesterday afternoon set in misty and cold. I had half a mind to spend it by my study fire, instead of wading through heath and mud to Wuthering Heights. After dinner, however - (I dine between twelve and one o'clock, since the housekeeper cannot comprehend my request to be served at five) - I stepped into my study to see a servant-girl on her knees surrounded by brushes and coal-scuttles, and raising an infernal dust. So I took my hat, and, after a four-miles' walk, arrived at Heathcliff's garden-gate just in time to escape the first feathery flakes of a snow-shower.\nOn that bleak hill-top the earth was hard with a black frost, and the air made me shiver through every limb. I jumped over the gate, and, running up the flag-stoned path, knocked vainly for admittance, till my knuckles tingled and the dogs howled.\n'Wretched, unwelcoming inmates!' I thought; 'I would not keep my doors barred in the day-time. I will get in!'\nI grasped the latch and shook it. Vinegar-faced Joseph put his head out from a round window of the barn.\n'What do ye want?' he shouted. 'T' master's down in t' fold. Go round by t' barn, if ye want to speak to him.'\n'Is there nobody inside to open the door?' I cried.\n'There's nobbut t' missis; and she'll not open it for ye.'\n'Why? Can't you tell her who I am, Joseph?'\n'No! I'll have no hand in it,' muttered the head, vanishing.\nThe snow began to drive thickly. I seized the handle to try again; when a young man shouldering a pitchfork appeared in the yard. He called me to follow him, and, after marching through a wash-house, and a paved area containing a coal-shed and pump, we at length arrived in the huge, warm, cheerful room where I was formerly received.\nIt glowed delightfully in the radiance of an immense fire. Near the table, laid for a plentiful evening meal, I was pleased to observe the 'missis,' a person whose existence I had not suspected. I bowed and waited, thinking she would bid me take a seat. She looked at me, leaning back in her chair, and said nothing.\n'Rough weather!' I remarked. 'I'm afraid, Mrs. Heathcliff, I had hard work to make your servants hear me.'\nShe never opened her mouth. I stared - she stared also, in a cool manner, exceedingly embarrassing and disagreeable.\n'Sit down,' said the young man, gruffly. 'He'll be in soon.'\nI obeyed; and called the villainous dog, Juno, who deigned, at this second meeting, to move the extreme tip of her tail in acknowledgment.\n'A beautiful animal!' I said. 'Do you intend parting with the pups, madam?'\n'They are not mine,' said the amiable hostess repellingly.\n'Ah, your favourites are these?' I continued, turning to a cushion full of something like cats.\n'A strange choice of favourites!' she said scornfully.\nUnluckily, it was a heap of dead rabbits. I coughed, and drew closer to the hearth, repeating my comment on the wildness of the evening.\n'You should not have come out,' she said, rising to take a canister from the chimney-piece.\nNow I had a clear view of her face and figure. She was slender, and scarcely past girlhood: with an admirable form, and the most exquisite little face that I have seen; small features, very fair; golden ringlets hanging loose on her delicate neck; and eyes which would have been irresistible if their expression had been more agreeable. Fortunately for my susceptible heart, the only emotions they showed were scorn and a kind of desperation. The canister was almost out of her reach; I rose to aid her, and she turned on me.\n'I don't want your help,' she snapped.\n'I beg your pardon!'\n'Were you asked to tea?' she demanded, tying an apron over her neat black frock, and standing with a spoon poised over the pot.\n'I shall be glad to have a cup,' I answered.\n'Were you asked?' she repeated.\n'No,' I said, half smiling. 'You are the proper person to ask me.'\nShe flung the tea back, spoon and all, and sat down again petulantly; her forehead corrugated, and her red under-lip pushed out, like a child's ready to cry.\nMeanwhile, the young man had slung on a shabby coat, and looked at me sidelong as if there were some mortal feud between us. I could not be sure whether he were a servant or not: his dress and speech were both rough, entirely unlike Mr. and Mrs. Heathcliff's; his thick brown curls were uncombed, his cheeks unshaven, and his hands tanned like a common labourer's. Still his attitude was almost haughty, and he showed none of a servant's haste to attend on Mrs Heathcliff. I thought it best to ignore his curious conduct; and, five minutes afterwards, the entrance of Heathcliff relieved me.\n'You see, sir, I have come, as I promised!' I exclaimed with pretended cheerfulness. 'I fear I shall be weather-bound for half an hour, if you can give me shelter for that time.'\n'Half an hour?' he said, shaking the white flakes from his clothes; 'I wonder you should choose a snow-storm to ramble about in. You risk being lost in the marshes. Even people familiar with these moors often miss their road on such evenings; and there is no chance of a change at present.'\n'Perhaps one of your lads can guide me - could you spare one?'\n'No, I could not.'\n'Oh, indeed! Well, then, I must trust to my own judgement.'\n'Umph!'\n'Are you going to make the tea?' demanded he of the shabby coat, shifting his ferocious gaze from me to the young lady.\n'Is he to have any?' she asked, appealing to Heathcliff.\n'Get it ready, will you?' he answered, so savagely that I was startled. I no longer felt inclined to call Heathcliff a capital fellow.\n'Now, sir, bring forward your chair,' he said. We all drew round the table and began our meal in silence.\nI thought, if I had caused the cloud, it was my duty to dispel it. They could not every day sit so grim and taciturn and scowling.\n'It is strange,' I began, 'how custom can mould our tastes: many could not imagine any happiness in a life of such complete exile from the world as this, Mr. Heathcliff; yet, I'll venture to say, that, surrounded by your family, and with your amiable lady presiding over your home and heart-\"\n'My amiable lady!' he interrupted, with an almost diabolical sneer on his face. 'Where is she?'\n'Mrs. Heathcliff, your wife, I mean.'\n'Oh, you mean that her spirit guards Wuthering Heights, even though she is dead. Is that it?'\nPerceiving my blunder, I tried to correct it. I might have seen there was too great a difference in their ages to make it likely that they were man and wife. He was about forty: she did not look seventeen.\nThen it flashed upon me - 'The clown at my elbow, who is drinking his tea out of a basin, may be her husband: Heathcliff junior, of course. Here is the consequence of being buried alive: she has thrown herself away upon that boor from sheer ignorance that better people existed! A sad pity-I must beware how I cause her to regret her choice.' The last reflection may seem conceited; it was not. My neighbour struck me as repulsive; I knew that I was tolerably attractive.\n'Mrs. Heathcliff is my daughter-in-law,' said Heathcliff, corroborating my guess. As he spoke, he gave her a most peculiar look of hatred.\n'Ah, I see now: you are the favoured possessor of the good fairy,' I remarked, turning to my neighbour.\nThis was worse than before: the youth grew crimson, and clenched his fist as if to strike me, before smothering the storm in a brutal curse.\n'An unhappy guess, sir,' said my host; 'we neither of us own your good fairy; her mate is dead. I said she was my daughter-in-law: therefore, she must have married my son.'\n'And this young man is-'\n'Not my son, assuredly.' Heathcliff smiled again.\n'My name is Hareton Earnshaw,' growled the other; 'and I'd counsel you to respect it!'\n'I've shown no disrespect,' I replied, laughing internally at his dignity.\nHe fixed his eye on me until I feared I might be tempted either to box his ears or to laugh aloud. I began to feel out of place in that pleasant family circle. The dismal atmosphere overcame the glowing comfort of the fire; and I resolved to be cautious about visiting a third time.\nThe meal eaten, without a word of conversation, I approached a window to examine the weather. A sorrowful sight I saw: dark night coming down, and sky and hills mingled in one bitter whirl of wind and suffocating snow.\n'I don't think it's possible for me to get home now without a guide,' I exclaimed. 'The roads will be buried.'\n'Hareton, drive those sheep into the barn porch. They'll be covered if left in the fold all night,' said Heathcliff.\n'What must I do?' I continued, with irritation.\nThere was no reply; and on looking round I saw only Joseph bringing in a pail of porridge for the dogs, and Mrs. Heathcliff leaning over the fire, diverting herself with burning matches. Joseph, in cracked tones, grated out, 'I wonder how yah can stand there i' idleness, when all them's gone out! But yah're a nowt, and it's no use talking - yah'll never mend yer ill ways, but go right to t' devil, like yer mother afore ye!'\nI imagined, for a moment, that this speech was addressed to me; and, enraged, stepped towards the aged rascal intending to kick him out of the door. Mrs. Heathcliff, however, answered.\n'You scandalous old hypocrite!' she replied. 'Don't provoke me, or I'll ask the devil to carry you away! Look here, Joseph,' she continued, taking a long, dark book from a shelf; 'I'll show you how far I've progressed in the Black Art. The red cow didn't die by chance; and your rheumatism isn't caused by bad luck either!'\n'Oh, wicked, wicked!' gasped the old man; 'may the Lord deliver us from evil!'\n'Be off, scoundrel, or I'll have you modelled in wax! and I shall - I'll not say what - but, you'll see! Go, I'm looking at you!'\nThe little witch put a mock malignity into her beautiful eyes, and Joseph, trembling with horror, hurried out, praying, and crying 'wicked' as he went. I thought she must be prompted by a sort of dreary fun; and, now that we were alone, I tried to interest her in my distress.\n'Mrs. Heathcliff,' I said earnestly, 'with that face, I'm sure you cannot help being good-hearted. Do point out some landmarks by which I may know my way home!'\n'Take the road you came,' she answered, sitting in a chair, with a candle, and the book open before her. 'That's the best advice I can give.'\n'Then, if you hear of me being found dead in a pit full of snow, you won't feel that it is your fault?'\n'How so? I cannot escort you. They wouldn't let me go to the end of the garden.'\n'I want you to tell me my way, not to show it,' I cried; 'or else to persuade Mr. Heathcliff to give me a guide.'\n'Who? There is him, Earnshaw, Zillah, Joseph and I. Which would you have?'\n'Are there no boys at the farm?'\n'No.'\n'Then I am compelled to stay.'\n'That you may settle with your host,' she said. 'I have nothing to do with it.'\n'I hope it will be a lesson to you to make no more rash journeys on these hills,' cried Heathcliff's stern voice from the entrance. 'As to staying here, I don't keep rooms for visitors: you must share a bed with Hareton or Joseph.'\n'I can sleep on a chair in this room,' I replied.\n'No, no! I will not permit any one the run of the place while I am asleep!' said the unmannerly wretch.\nWith this insult, my patience was at an end. In disgust, I pushed past him into the yard, running into Earnshaw in my haste. It was so dark that I could not see the gate.\nAt first the young man appeared about to befriend me. 'I'll go with him to the park,' he said.\n'You'll go with him to hell!' exclaimed Heathcliff. 'And who is to look after the horses, eh?'\n'A man's life matters more than one evening's neglect of the horses: somebody must go,' murmured Mrs. Heathcliff, more kindly than I expected.\n'Not at your command!' retorted Hareton. 'You'd better be quiet.'\n'Then I hope his ghost will haunt you; and I hope Mr. Heathcliff will never get another tenant till the Grange is a ruin,' she answered sharply.\n'Hearken, hearken, she's cursing 'em!' muttered Joseph. He sat within earshot, milking the cows by the light of a lantern, which I seized. Calling out that I would send it back on the morrow, I rushed to the gate.\n'Master, master, he's stealing t' lanthern!' shouted Joseph. 'Hey, Gnasher! Hey Wolf, hold him, hold him!'\nTwo hairy monsters flew at my throat, bearing me down, and extinguishing the light; while a mingled guffaw from Heathcliff and Hareton put the lid on my rage and humiliation. Fortunately, the beasts seemed more bent on yawning than devouring me alive; but they would not let me up, and I was forced to lie till their masters freed me. Then, hatless and trembling with anger, I ordered the rascals to let me out - on their peril to keep me one minute longer - with incoherent threats.\nMy agitation brought on a copious nosebleed, and still Heathcliff laughed, and still I scolded. I don't know how it would have ended, had not Zillah, the housekeeper, come out to see what was happening. She thought that they had been laying violent hands on me; and not daring to attack her master, she turned on the younger scoundrel.\n'Well, Mr. Earnshaw,' she cried, 'Are we going to murder folk on our very door-stones? Look at t' poor lad, he's fair choking! Hush; don't go on so. Come in, and I'll cure that: now hold still.'\nWith these words she splashed a pint of icy water down my neck, and pulled me into the kitchen. Mr. Heathcliff followed, lapsing into his habitual moroseness.\nI was sick and faint; and was thus compelled to accept lodgings under his roof. He told Zillah to give me a glass of brandy, and then passed on to the inner room; while she ushered me to bed.",
        "paragraph_chars": [
            [
                0,
                574
            ],
            [
                574,
                822
            ],
            [
                822,
                933
            ],
            [
                933,
                1038
            ],
            [
                1038,
                1149
            ],
            [
                1149,
                1201
            ],
            [
                1201,
                1260
            ],
            [
                1260,
                1304
            ],
            [
                1304,
                1365
            ],
            [
                1365,
                1700
            ],
            [
                1700,
                2017
            ],
            [
                2017,
                2124
            ],
            [
                2124,
                2241
            ],
            [
                2241,
                2302
            ],
            [
                2302,
                2441
            ],
            [
                2441,
                2517
            ],
            [
                2517,
                2576
            ],
            [
                2576,
                2672
            ],
            [
                2672,
                2727
            ],
            [
                2727,
                2864
            ],
            [
                2864,
                2956
            ],
            [
                2956,
                3482
            ],
            [
                3482,
                3521
            ],
            [
                3521,
                3542
            ],
            [
                3542,
                3670
            ],
            [
                3670,
                3715
            ],
            [
                3715,
                3747
            ],
            [
                3747,
                3814
            ],
            [
                3814,
                3972
            ],
            [
                3972,
                4564
            ],
            [
                4564,
                4743
            ],
            [
                4743,
                5034
            ],
            [
                5034,
                5097
            ],
            [
                5097,
                5116
            ],
            [
                5116,
                5176
            ],
            [
                5176,
                5184
            ],
            [
                5184,
                5304
            ],
            [
                5304,
                5361
            ],
            [
                5361,
                5496
            ],
            [
                5496,
                5602
            ],
            [
                5602,
                5733
            ],
            [
                5733,
                6026
            ],
            [
                6026,
                6122
            ],
            [
                6122,
                6160
            ],
            [
                6160,
                6254
            ],
            [
                6254,
                6460
            ],
            [
                6460,
                6932
            ],
            [
                6932,
                7071
            ],
            [
                7071,
                7175
            ],
            [
                7175,
                7316
            ],
            [
                7316,
                7489
            ],
            [
                7489,
                7514
            ],
            [
                7514,
                7564
            ],
            [
                7564,
                7651
            ],
            [
                7651,
                7726
            ],
            [
                7726,
                8009
            ],
            [
                8009,
                8228
            ],
            [
                8228,
                8339
            ],
            [
                8339,
                8456
            ],
            [
                8456,
                8504
            ],
            [
                8504,
                8932
            ],
            [
                8932,
                9117
            ],
            [
                9117,
                9441
            ],
            [
                9441,
                9520
            ],
            [
                9520,
                9650
            ],
            [
                9650,
                9927
            ],
            [
                9927,
                10088
            ],
            [
                10088,
                10230
            ],
            [
                10230,
                10334
            ],
            [
                10334,
                10415
            ],
            [
                10415,
                10529
            ],
            [
                10529,
                10604
            ],
            [
                10604,
                10637
            ],
            [
                10637,
                10643
            ],
            [
                10643,
                10674
            ],
            [
                10674,
                10754
            ],
            [
                10754,
                10986
            ],
            [
                10986,
                11036
            ],
            [
                11036,
                11140
            ],
            [
                11140,
                11311
            ],
            [
                11311,
                11406
            ],
            [
                11406,
                11501
            ],
            [
                11501,
                11644
            ],
            [
                11644,
                11710
            ],
            [
                11710,
                11855
            ],
            [
                11855,
                12069
            ],
            [
                12069,
                12176
            ],
            [
                12176,
                12660
            ],
            [
                12660,
                12996
            ],
            [
                12996,
                13191
            ],
            [
                13191,
                13350
            ],
            [
                13350,
                13541
            ]
        ],
        "segment_chars": [
            [
                0,
                43
            ],
            [
                43,
                153
            ],
            [
                153,
                422
            ],
            [
                422,
                574
            ],
            [
                574,
                683
            ],
            [
                683,
                822
            ],
            [
                822,
                855
            ],
            [
                855,
                917
            ],
            [
                917,
                933
            ],
            [
                933,
                967
            ],
            [
                967,
                1038
            ],
            [
                1038,
                1057
            ],
            [
                1057,
                1069
            ],
            [
                1069,
                1099
            ],
            [
                1099,
                1149
            ],
            [
                1149,
                1192
            ],
            [
                1192,
                1201
            ],
            [
                1201,
                1260
            ],
            [
                1260,
                1266
            ],
            [
                1266,
                1304
            ],
            [
                1304,
                1309
            ],
            [
                1309,
                1365
            ],
            [
                1365,
                1398
            ],
            [
                1398,
                1495
            ],
            [
                1495,
                1700
            ],
            [
                1700,
                1759
            ],
            [
                1759,
                1895
            ],
            [
                1895,
                1954
            ],
            [
                1954,
                2017
            ],
            [
                2017,
                2034
            ],
            [
                2034,
                2046
            ],
            [
                2046,
                2124
            ],
            [
                2124,
                2152
            ],
            [
                2152,
                2241
            ],
            [
                2241,
                2282
            ],
            [
                2282,
                2302
            ],
            [
                2302,
                2441
            ],
            [
                2441,
                2463
            ],
            [
                2463,
                2471
            ],
            [
                2471,
                2517
            ],
            [
                2517,
                2576
            ],
            [
                2576,
                2609
            ],
            [
                2609,
                2672
            ],
            [
                2672,
                2706
            ],
            [
                2706,
                2727
            ],
            [
                2727,
                2769
            ],
            [
                2769,
                2864
            ],
            [
                2864,
                2956
            ],
            [
                2956,
                3003
            ],
            [
                3003,
                3293
            ],
            [
                3293,
                3399
            ],
            [
                3399,
                3482
            ],
            [
                3482,
                3521
            ],
            [
                3521,
                3542
            ],
            [
                3542,
                3567
            ],
            [
                3567,
                3670
            ],
            [
                3670,
                3715
            ],
            [
                3715,
                3733
            ],
            [
                3733,
                3747
            ],
            [
                3747,
                3775
            ],
            [
                3775,
                3814
            ],
            [
                3814,
                3972
            ],
            [
                3972,
                4097
            ],
            [
                4097,
                4337
            ],
            [
                4337,
                4445
            ],
            [
                4445,
                4564
            ],
            [
                4564,
                4608
            ],
            [
                4608,
                4649
            ],
            [
                4649,
                4743
            ],
            [
                4743,
                4759
            ],
            [
                4759,
                4872
            ],
            [
                4872,
                4908
            ],
            [
                4908,
                5034
            ],
            [
                5034,
                5097
            ],
            [
                5097,
                5116
            ],
            [
                5116,
                5129
            ],
            [
                5129,
                5176
            ],
            [
                5176,
                5184
            ],
            [
                5184,
                5217
            ],
            [
                5217,
                5304
            ],
            [
                5304,
                5325
            ],
            [
                5325,
                5361
            ],
            [
                5361,
                5387
            ],
            [
                5387,
                5433
            ],
            [
                5433,
                5496
            ],
            [
                5496,
                5543
            ],
            [
                5543,
                5602
            ],
            [
                5602,
                5669
            ],
            [
                5669,
                5733
            ],
            [
                5733,
                6026
            ],
            [
                6026,
                6045
            ],
            [
                6045,
                6106
            ],
            [
                6106,
                6122
            ],
            [
                6122,
                6128
            ],
            [
                6128,
                6160
            ],
            [
                6160,
                6241
            ],
            [
                6241,
                6254
            ],
            [
                6254,
                6300
            ],
            [
                6300,
                6412
            ],
            [
                6412,
                6460
            ],
            [
                6460,
                6600
            ],
            [
                6600,
                6739
            ],
            [
                6739,
                6803
            ],
            [
                6803,
                6855
            ],
            [
                6855,
                6932
            ],
            [
                6932,
                6938
            ],
            [
                6938,
                7014
            ],
            [
                7014,
                7071
            ],
            [
                7071,
                7175
            ],
            [
                7175,
                7316
            ],
            [
                7316,
                7412
            ],
            [
                7412,
                7489
            ],
            [
                7489,
                7514
            ],
            [
                7514,
                7539
            ],
            [
                7539,
                7564
            ],
            [
                7564,
                7651
            ],
            [
                7651,
                7726
            ],
            [
                7726,
                7825
            ],
            [
                7825,
                7886
            ],
            [
                7886,
                8009
            ],
            [
                8009,
                8103
            ],
            [
                8103,
                8228
            ],
            [
                8228,
                8311
            ],
            [
                8311,
                8339
            ],
            [
                8339,
                8388
            ],
            [
                8388,
                8456
            ],
            [
                8456,
                8474
            ],
            [
                8474,
                8504
            ],
            [
                8504,
                8691
            ],
            [
                8691,
                8802
            ],
            [
                8802,
                8932
            ],
            [
                8932,
                9081
            ],
            [
                9081,
                9117
            ],
            [
                9117,
                9149
            ],
            [
                9149,
                9162
            ],
            [
                9162,
                9222
            ],
            [
                9222,
                9353
            ],
            [
                9353,
                9441
            ],
            [
                9441,
                9463
            ],
            [
                9463,
                9520
            ],
            [
                9520,
                9574
            ],
            [
                9574,
                9625
            ],
            [
                9625,
                9650
            ],
            [
                9650,
                9802
            ],
            [
                9802,
                9927
            ],
            [
                9927,
                9933
            ],
            [
                9933,
                10026
            ],
            [
                10026,
                10088
            ],
            [
                10088,
                10193
            ],
            [
                10193,
                10230
            ],
            [
                10230,
                10334
            ],
            [
                10334,
                10343
            ],
            [
                10343,
                10364
            ],
            [
                10364,
                10415
            ],
            [
                10415,
                10529
            ],
            [
                10529,
                10535
            ],
            [
                10535,
                10581
            ],
            [
                10581,
                10604
            ],
            [
                10604,
                10637
            ],
            [
                10637,
                10643
            ],
            [
                10643,
                10674
            ],
            [
                10674,
                10722
            ],
            [
                10722,
                10754
            ],
            [
                10754,
                10886
            ],
            [
                10886,
                10986
            ],
            [
                10986,
                11036
            ],
            [
                11036,
                11045
            ],
            [
                11045,
                11112
            ],
            [
                11112,
                11140
            ],
            [
                11140,
                11185
            ],
            [
                11185,
                11265
            ],
            [
                11265,
                11311
            ],
            [
                11311,
                11365
            ],
            [
                11365,
                11406
            ],
            [
                11406,
                11436
            ],
            [
                11436,
                11458
            ],
            [
                11458,
                11501
            ],
            [
                11501,
                11644
            ],
            [
                11644,
                11667
            ],
            [
                11667,
                11685
            ],
            [
                11685,
                11710
            ],
            [
                11710,
                11855
            ],
            [
                11855,
                11894
            ],
            [
                11894,
                11911
            ],
            [
                11911,
                11994
            ],
            [
                11994,
                12069
            ],
            [
                12069,
                12114
            ],
            [
                12114,
                12130
            ],
            [
                12130,
                12145
            ],
            [
                12145,
                12176
            ],
            [
                12176,
                12351
            ],
            [
                12351,
                12511
            ],
            [
                12511,
                12660
            ],
            [
                12660,
                12756
            ],
            [
                12756,
                12863
            ],
            [
                12863,
                12996
            ],
            [
                12996,
                13083
            ],
            [
                13083,
                13123
            ],
            [
                13123,
                13145
            ],
            [
                13145,
                13191
            ],
            [
                13191,
                13287
            ],
            [
                13287,
                13350
            ],
            [
                13350,
                13430
            ],
            [
                13430,
                13541
            ]
        ],
        "overlap_chars": [
            [
                0,
                43
            ],
            [
                43,
                153
            ],
            [
                159,
                174
            ],
            [
                177,
                178
            ],
            [
                178,
                215
            ],
            [
                215,
                216
            ],
            [
                223,
                238
            ],
            [
                246,
                267
            ],
            [
                271,
                288
            ],
            [
                292,
                293
            ],
            [
                302,
                306
            ],
            [
                323,
                420
            ],
            [
                420,
                422
            ],
            [
                425,
                565
            ],
            [
                572,
                574
            ],
            [
                574,
                592
            ],
            [
                593,
                683
            ],
            [
                683,
                696
            ],
            [
                697,
                700
            ],
            [
                705,
                726
            ],
            [
                731,
                732
            ],
            [
                743,
                822
            ],
            [
                823,
                831
            ],
            [
                831,
                832
            ],
            [
                845,
                852
            ],
            [
                855,
                856
            ],
            [
                867,
                917
            ],
            [
                917,
                930
            ],
            [
                933,
                965
            ],
            [
                965,
                967
            ],
            [
                967,
                987
            ],
            [
                992,
                1000
            ],
            [
                1005,
                1038
            ],
            [
                1039,
                1043
            ],
            [
                1047,
                1049
            ],
            [
                1057,
                1069
            ],
            [
                1071,
                1072
            ],
            [
                1079,
                1086
            ],
            [
                1090,
                1092
            ],
            [
                1097,
                1099
            ],
            [
                1099,
                1110
            ],
            [
                1111,
                1113
            ],
            [
                1118,
                1125
            ],
            [
                1131,
                1133
            ],
            [
                1140,
                1146
            ],
            [
                1150,
                1189
            ],
            [
                1192,
                1193
            ],
            [
                1199,
                1201
            ],
            [
                1207,
                1231
            ],
            [
                1235,
                1242
            ],
            [
                1255,
                1257
            ],
            [
                1261,
                1266
            ],
            [
                1272,
                1284
            ],
            [
                1289,
                1293
            ],
            [
                1293,
                1301
            ],
            [
                1307,
                1309
            ],
            [
                1309,
                1313
            ],
            [
                1319,
                1321
            ],
            [
                1335,
                1365
            ],
            [
                1365,
                1398
            ],
            [
                1398,
                1420
            ],
            [
                1430,
                1448
            ],
            [
                1449,
                1472
            ],
            [
                1473,
                1493
            ],
            [
                1493,
                1495
            ],
            [
                1495,
                1497
            ],
            [
                1505,
                1604
            ],
            [
                1605,
                1608
            ],
            [
                1609,
                1613
            ],
            [
                1613,
                1663
            ],
            [
                1669,
                1699
            ],
            [
                1700,
                1757
            ],
            [
                1759,
                1838
            ],
            [
                1840,
                1846
            ],
            [
                1858,
                1879
            ],
            [
                1884,
                1895
            ],
            [
                1895,
                1954
            ],
            [
                1954,
                2002
            ],
            [
                2015,
                2017
            ],
            [
                2018,
                2031
            ],
            [
                2034,
                2046
            ],
            [
                2046,
                2047
            ],
            [
                2047,
                2075
            ],
            [
                2076,
                2099
            ],
            [
                2100,
                2113
            ],
            [
                2114,
                2121
            ],
            [
                2124,
                2152
            ],
            [
                2152,
                2178
            ],
            [
                2178,
                2179
            ],
            [
                2180,
                2189
            ],
            [
                2190,
                2241
            ],
            [
                2246,
                2250
            ],
            [
                2253,
                2282
            ],
            [
                2283,
                2299
            ],
            [
                2302,
                2315
            ],
            [
                2316,
                2334
            ],
            [
                2341,
                2342
            ],
            [
                2343,
                2376
            ],
            [
                2384,
                2421
            ],
            [
                2422,
                2424
            ],
            [
                2439,
                2441
            ],
            [
                2442,
                2460
            ],
            [
                2463,
                2464
            ],
            [
                2469,
                2471
            ],
            [
                2475,
                2502
            ],
            [
                2507,
                2514
            ],
            [
                2523,
                2535
            ],
            [
                2538,
                2562
            ],
            [
                2563,
                2574
            ],
            [
                2574,
                2576
            ],
            [
                2577,
                2600
            ],
            [
                2601,
                2606
            ],
            [
                2609,
                2632
            ],
            [
                2635,
                2672
            ],
            [
                2673,
                2703
            ],
            [
                2706,
                2709
            ],
            [
                2715,
                2727
            ],
            [
                2727,
                2769
            ],
            [
                2769,
                2770
            ],
            [
                2778,
                2864
            ],
            [
                2865,
                2893
            ],
            [
                2896,
                2912
            ],
            [
                2923,
                2926
            ],
            [
                2932,
                2954
            ],
            [
                2954,
                2956
            ],
            [
                2956,
                2959
            ],
            [
                2960,
                2967
            ],
            [
                2974,
                2985
            ],
            [
                2991,
                2994
            ],
            [
                2995,
                3001
            ],
            [
                3001,
                3003
            ],
            [
                3003,
                3023
            ],
            [
                3024,
                3047
            ],
            [
                3053,
                3118
            ],
            [
                3123,
                3151
            ],
            [
                3152,
                3158
            ],
            [
                3159,
                3167
            ],
            [
                3168,
                3212
            ],
            [
                3219,
                3247
            ],
            [
                3257,
                3267
            ],
            [
                3268,
                3271
            ],
            [
                3272,
                3276
            ],
            [
                3282,
                3291
            ],
            [
                3293,
                3339
            ],
            [
                3349,
                3353
            ],
            [
                3366,
                3397
            ],
            [
                3397,
                3399
            ],
            [
                3399,
                3406
            ],
            [
                3416,
                3442
            ],
            [
                3448,
                3458
            ],
            [
                3464,
                3474
            ],
            [
                3478,
                3480
            ],
            [
                3480,
                3482
            ],
            [
                3483,
                3505
            ],
            [
                3508,
                3519
            ],
            [
                3522,
                3539
            ],
            [
                3543,
                3564
            ],
            [
                3567,
                3648
            ],
            [
                3649,
                3670
            ],
            [
                3671,
                3700
            ],
            [
                3703,
                3715
            ],
            [
                3716,
                3730
            ],
            [
                3733,
                3747
            ],
            [
                3748,
                3750
            ],
            [
                3753,
                3775
            ],
            [
                3776,
                3811
            ],
            [
                3814,
                3856
            ],
            [
                3872,
                3875
            ],
            [
                3882,
                3972
            ],
            [
                3972,
                4009
            ],
            [
                4010,
                4011
            ],
            [
                4012,
                4018
            ],
            [
                4023,
                4028
            ],
            [
                4029,
                4035
            ],
            [
                4039,
                4041
            ],
            [
                4051,
                4084
            ],
            [
                4085,
                4097
            ],
            [
                4097,
                4098
            ],
            [
                4117,
                4181
            ],
            [
                4182,
                4187
            ],
            [
                4187,
                4197
            ],
            [
                4205,
                4228
            ],
            [
                4228,
                4230
            ],
            [
                4230,
                4258
            ],
            [
                4267,
                4272
            ],
            [
                4273,
                4279
            ],
            [
                4288,
                4303
            ],
            [
                4311,
                4315
            ],
            [
                4316,
                4333
            ],
            [
                4337,
                4346
            ],
            [
                4356,
                4359
            ],
            [
                4360,
                4399
            ],
            [
                4416,
                4418
            ],
            [
                4426,
                4428
            ],
            [
                4443,
                4445
            ],
            [
                4445,
                4446
            ],
            [
                4455,
                4465
            ],
            [
                4473,
                4562
            ],
            [
                4562,
                4564
            ],
            [
                4565,
                4580
            ],
            [
                4586,
                4591
            ],
            [
                4608,
                4619
            ],
            [
                4650,
                4710
            ],
            [
                4716,
                4726
            ],
            [
                4731,
                4735
            ],
            [
                4744,
                4756
            ],
            [
                4759,
                4810
            ],
            [
                4812,
                4831
            ],
            [
                4839,
                4872
            ],
            [
                4872,
                4875
            ],
            [
                4876,
                4880
            ],
            [
                4881,
                4906
            ],
            [
                4913,
                4989
            ],
            [
                4990,
                5031
            ],
            [
                5035,
                5042
            ],
            [
                5043,
                5046
            ],
            [
                5050,
                5059
            ],
            [
                5060,
                5063
            ],
            [
                5064,
                5069
            ],
            [
                5070,
                5072
            ],
            [
                5073,
                5090
            ],
            [
                5098,
                5113
            ],
            [
                5117,
                5129
            ],
            [
                5129,
                5163
            ],
            [
                5177,
                5181
            ],
            [
                5184,
                5185
            ],
            [
                5185,
                5201
            ],
            [
                5207,
                5214
            ],
            [
                5217,
                5304
            ],
            [
                5305,
                5307
            ],
            [
                5308,
                5310
            ],
            [
                5311,
                5322
            ],
            [
                5325,
                5361
            ],
            [
                5362,
                5384
            ],
            [
                5398,
                5399
            ],
            [
                5400,
                5418
            ],
            [
                5419,
                5422
            ],
            [
                5431,
                5433
            ],
            [
                5433,
                5495
            ],
            [
                5497,
                5531
            ],
            [
                5534,
                5536
            ],
            [
                5543,
                5549
            ],
            [
                5550,
                5570
            ],
            [
                5571,
                5574
            ],
            [
                5581,
                5589
            ],
            [
                5593,
                5600
            ],
            [
                5600,
                5602
            ],
            [
                5602,
                5657
            ],
            [
                5658,
                5669
            ],
            [
                5669,
                5718
            ],
            [
                5719,
                5722
            ],
            [
                5723,
                5725
            ],
            [
                5731,
                5733
            ],
            [
                5734,
                5747
            ],
            [
                5750,
                5758
            ],
            [
                5760,
                5791
            ],
            [
                5791,
                5815
            ],
            [
                5820,
                5880
            ],
            [
                5885,
                5988
            ],
            [
                5989,
                5998
            ],
            [
                5999,
                6026
            ],
            [
                6030,
                6042
            ],
            [
                6045,
                6106
            ],
            [
                6107,
                6119
            ],
            [
                6124,
                6127
            ],
            [
                6128,
                6157
            ],
            [
                6161,
                6168
            ],
            [
                6174,
                6189
            ],
            [
                6190,
                6196
            ],
            [
                6197,
                6220
            ],
            [
                6232,
                6234
            ],
            [
                6239,
                6241
            ],
            [
                6241,
                6251
            ],
            [
                6254,
                6264
            ],
            [
                6268,
                6278
            ],
            [
                6285,
                6300
            ],
            [
                6300,
                6339
            ],
            [
                6360,
                6364
            ],
            [
                6365,
                6412
            ],
            [
                6415,
                6431
            ],
            [
                6436,
                6460
            ],
            [
                6460,
                6483
            ],
            [
                6487,
                6548
            ],
            [
                6548,
                6600
            ],
            [
                6600,
                6722
            ],
            [
                6730,
                6739
            ],
            [
                6739,
                6800
            ],
            [
                6803,
                6855
            ],
            [
                6855,
                6880
            ],
            [
                6881,
                6898
            ],
            [
                6899,
                6932
            ],
            [
                6934,
                6937
            ],
            [
                6938,
                6970
            ],
            [
                6973,
                7006
            ],
            [
                7012,
                7014
            ],
            [
                7014,
                7026
            ],
            [
                7027,
                7029
            ],
            [
                7035,
                7038
            ],
            [
                7039,
                7045
            ],
            [
                7046,
                7054
            ],
            [
                7055,
                7069
            ],
            [
                7069,
                7071
            ],
            [
                7072,
                7075
            ],
            [
                7076,
                7124
            ],
            [
                7130,
                7135
            ],
            [
                7138,
                7175
            ],
            [
                7175,
                7248
            ],
            [
                7255,
                7257
            ],
            [
                7267,
                7268
            ],
            [
                7276,
                7278
            ],
            [
                7287,
                7314
            ],
            [
                7314,
                7316
            ],
            [
                7333,
                7338
            ],
            [
                7346,
                7354
            ],
            [
                7356,
                7372
            ],
            [
                7377,
                7412
            ],
            [
                7412,
                7486
            ],
            [
                7490,
                7511
            ],
            [
                7515,
                7536
            ],
            [
                7539,
                7562
            ],
            [
                7562,
                7564
            ],
            [
                7568,
                7592
            ],
            [
                7595,
                7613
            ],
            [
                7615,
                7648
            ],
            [
                7652,
                7676
            ],
            [
                7688,
                7712
            ],
            [
                7717,
                7724
            ],
            [
                7724,
                7726
            ],
            [
                7726,
                7748
            ],
            [
                7755,
                7756
            ],
            [
                7764,
                7808
            ],
            [
                7809,
                7811
            ],
            [
                7823,
                7825
            ],
            [
                7825,
                7840
            ],
            [
                7841,
                7886
            ],
            [
                7886,
                7896
            ],
            [
                7897,
                7916
            ],
            [
                7917,
                7928
            ],
            [
                7948,
                7979
            ],
            [
                7995,
                8009
            ],
            [
                8009,
                8012
            ],
            [
                8023,
                8024
            ],
            [
                8033,
                8042
            ],
            [
                8043,
                8103
            ],
            [
                8103,
                8150
            ],
            [
                8150,
                8228
            ],
            [
                8229,
                8245
            ],
            [
                8248,
                8295
            ],
            [
                8298,
                8299
            ],
            [
                8309,
                8311
            ],
            [
                8316,
                8336
            ],
            [
                8340,
                8360
            ],
            [
                8361,
                8388
            ],
            [
                8388,
                8436
            ],
            [
                8439,
                8456
            ],
            [
                8462,
                8471
            ],
            [
                8474,
                8491
            ],
            [
                8492,
                8504
            ],
            [
                8504,
                8522
            ],
            [
                8522,
                8681
            ],
            [
                8682,
                8689
            ],
            [
                8689,
                8691
            ],
            [
                8697,
                8698
            ],
            [
                8699,
                8715
            ],
            [
                8715,
                8716
            ],
            [
                8717,
                8727
            ],
            [
                8727,
                8728
            ],
            [
                8729,
                8730
            ],
            [
                8732,
                8750
            ],
            [
                8751,
                8756
            ],
            [
                8763,
                8774
            ],
            [
                8774,
                8784
            ],
            [
                8797,
                8802
            ],
            [
                8806,
                8846
            ],
            [
                8850,
                8853
            ],
            [
                8860,
                8864
            ],
            [
                8869,
                8885
            ],
            [
                8892,
                8897
            ],
            [
                8903,
                8929
            ],
            [
                8932,
                8967
            ],
            [
                8975,
                9000
            ],
            [
                9001,
                9041
            ],
            [
                9060,
                9081
            ],
            [
                9081,
                9106
            ],
            [
                9115,
                9117
            ],
            [
                9118,
                9146
            ],
            [
                9149,
                9162
            ],
            [
                9177,
                9192
            ],
            [
                9203,
                9205
            ],
            [
                9212,
                9215
            ],
            [
                9220,
                9222
            ],
            [
                9222,
                9239
            ],
            [
                9242,
                9295
            ],
            [
                9297,
                9351
            ],
            [
                9351,
                9353
            ],
            [
                9353,
                9406
            ],
            [
                9442,
                9460
            ],
            [
                9463,
                9473
            ],
            [
                9481,
                9482
            ],
            [
                9484,
                9517
            ],
            [
                9521,
                9527
            ],
            [
                9538,
                9547
            ],
            [
                9548,
                9556
            ],
            [
                9557,
                9572
            ],
            [
                9572,
                9574
            ],
            [
                9574,
                9577
            ],
            [
                9578,
                9579
            ],
            [
                9580,
                9605
            ],
            [
                9606,
                9625
            ],
            [
                9625,
                9647
            ],
            [
                9650,
                9739
            ],
            [
                9740,
                9773
            ],
            [
                9782,
                9788
            ],
            [
                9790,
                9802
            ],
            [
                9802,
                9811
            ],
            [
                9816,
                9837
            ],
            [
                9843,
                9888
            ],
            [
                9895,
                9927
            ],
            [
                9929,
                9932
            ],
            [
                9933,
                9943
            ],
            [
                9946,
                9963
            ],
            [
                9965,
                10026
            ],
            [
                10026,
                10085
            ],
            [
                10094,
                10111
            ],
            [
                10114,
                10127
            ],
            [
                10136,
                10170
            ],
            [
                10171,
                10193
            ],
            [
                10210,
                10216
            ],
            [
                10217,
                10227
            ],
            [
                10235,
                10260
            ],
            [
                10267,
                10274
            ],
            [
                10275,
                10294
            ],
            [
                10299,
                10304
            ],
            [
                10310,
                10320
            ],
            [
                10321,
                10331
            ],
            [
                10335,
                10343
            ],
            [
                10343,
                10364
            ],
            [
                10364,
                10412
            ],
            [
                10416,
                10452
            ],
            [
                10453,
                10457
            ],
            [
                10458,
                10460
            ],
            [
                10473,
                10526
            ],
            [
                10530,
                10535
            ],
            [
                10535,
                10543
            ],
            [
                10547,
                10581
            ],
            [
                10581,
                10601
            ],
            [
                10605,
                10634
            ],
            [
                10638,
                10640
            ],
            [
                10649,
                10671
            ],
            [
                10680,
                10709
            ],
            [
                10720,
                10722
            ],
            [
                10723,
                10751
            ],
            [
                10755,
                10833
            ],
            [
                10836,
                10875
            ],
            [
                10876,
                10886
            ],
            [
                10887,
                10919
            ],
            [
                10926,
                10983
            ],
            [
                10987,
                11022
            ],
            [
                11025,
                11036
            ],
            [
                11037,
                11045
            ],
            [
                11047,
                11055
            ],
            [
                11056,
                11074
            ],
            [
                11079,
                11102
            ],
            [
                11112,
                11140
            ],
            [
                11140,
                11156
            ],
            [
                11158,
                11185
            ],
            [
                11188,
                11196
            ],
            [
                11197,
                11198
            ],
            [
                11199,
                11237
            ],
            [
                11243,
                11265
            ],
            [
                11265,
                11304
            ],
            [
                11309,
                11310
            ],
            [
                11311,
                11364
            ],
            [
                11366,
                11382
            ],
            [
                11386,
                11394
            ],
            [
                11397,
                11406
            ],
            [
                11407,
                11433
            ],
            [
                11436,
                11445
            ],
            [
                11446,
                11448
            ],
            [
                11456,
                11458
            ],
            [
                11459,
                11498
            ],
            [
                11502,
                11514
            ],
            [
                11523,
                11527
            ],
            [
                11528,
                11586
            ],
            [
                11589,
                11644
            ],
            [
                11645,
                11664
            ],
            [
                11667,
                11685
            ],
            [
                11686,
                11707
            ],
            [
                11716,
                11830
            ],
            [
                11833,
                11845
            ],
            [
                11846,
                11855
            ],
            [
                11856,
                11873
            ],
            [
                11877,
                11887
            ],
            [
                11888,
                11891
            ],
            [
                11894,
                11909
            ],
            [
                11909,
                11910
            ],
            [
                11911,
                11992
            ],
            [
                11994,
                12046
            ],
            [
                12049,
                12062
            ],
            [
                12067,
                12069
            ],
            [
                12076,
                12077
            ],
            [
                12084,
                12090
            ],
            [
                12100,
                12111
            ],
            [
                12114,
                12121
            ],
            [
                12128,
                12130
            ],
            [
                12131,
                12145
            ],
            [
                12145,
                12154
            ],
            [
                12160,
                12164
            ],
            [
                12170,
                12173
            ],
            [
                12176,
                12318
            ],
            [
                12323,
                12351
            ],
            [
                12351,
                12394
            ],
            [
                12395,
                12402
            ],
            [
                12403,
                12442
            ],
            [
                12451,
                12453
            ],
            [
                12456,
                12492
            ],
            [
                12493,
                12500
            ],
            [
                12511,
                12543
            ],
            [
                12549,
                12564
            ],
            [
                12573,
                12639
            ],
            [
                12640,
                12658
            ],
            [
                12658,
                12660
            ],
            [
                12660,
                12693
            ],
            [
                12694,
                12698
            ],
            [
                12703,
                12756
            ],
            [
                12756,
                12768
            ],
            [
                12776,
                12786
            ],
            [
                12792,
                12797
            ],
            [
                12798,
                12801
            ],
            [
                12802,
                12813
            ],
            [
                12814,
                12819
            ],
            [
                12825,
                12826
            ],
            [
                12836,
                12838
            ],
            [
                12843,
                12847
            ],
            [
                12848,
                12851
            ],
            [
                12861,
                12863
            ],
            [
                12863,
                12879
            ],
            [
                12885,
                12925
            ],
            [
                12926,
                12969
            ],
            [
                12973,
                12996
            ],
            [
                12997,
                13015
            ],
            [
                13018,
                13028
            ],
            [
                13030,
                13083
            ],
            [
                13083,
                13123
            ],
            [
                13127,
                13128
            ],
            [
                13132,
                13145
            ],
            [
                13145,
                13173
            ],
            [
                13174,
                13177
            ],
            [
                13178,
                13182
            ],
            [
                13183,
                13188
            ],
            [
                13191,
                13211
            ],
            [
                13212,
                13287
            ],
            [
                13287,
                13311
            ],
            [
                13325,
                13350
            ],
            [
                13350,
                13360
            ],
            [
                13361,
                13375
            ],
            [
                13380,
                13394
            ],
            [
                13395,
                13430
            ],
            [
                13430,
                13522
            ],
            [
                13523,
                13541
            ]
        ],
        "row_chars": [
            [
                0,
                43
            ],
            [
                43,
                153
            ],
            [
                153,
                422
            ],
            [
                422,
                574
            ],
            [
                574,
                683
            ],
            [
                683,
                822
            ],
            [
                822,
                917
            ],
            [
                917,
                933
            ],
            [
                933,
                967
            ],
            [
                967,
                1038
            ],
            [
                1038,
                1057
            ],
            [
                1057,
                1069
            ],
            [
                1069,
                1099
            ],
            [
                1099,
                1149
            ],
            [
                1149,
                1192
            ],
            [
                1192,
                1201
            ],
            [
                1201,
                1260
            ],
            [
                1260,
                1266
            ],
            [
                1266,
                1304
            ],
            [
                1304,
                1309
            ],
            [
                1309,
                1365
            ],
            [
                1365,
                1398
            ],
            [
                1398,
                1495
            ],
            [
                1495,
                1700
            ],
            [
                1700,
                1895
            ],
            [
                1895,
                1954
            ],
            [
                1954,
                2017
            ],
            [
                2017,
                2034
            ],
            [
                2034,
                2046
            ],
            [
                2046,
                2124
            ],
            [
                2124,
                2152
            ],
            [
                2152,
                2241
            ],
            [
                2241,
                2282
            ],
            [
                2282,
                2302
            ],
            [
                2302,
                2441
            ],
            [
                2441,
                2463
            ],
            [
                2463,
                2471
            ],
            [
                2471,
                2517
            ],
            [
                2517,
                2576
            ],
            [
                2576,
                2609
            ],
            [
                2609,
                2672
            ],
            [
                2672,
                2706
            ],
            [
                2706,
                2727
            ],
            [
                2727,
                2769
            ],
            [
                2769,
                2864
            ],
            [
                2864,
                2956
            ],
            [
                2956,
                3003
            ],
            [
                3003,
                3399
            ],
            [
                3399,
                3482
            ],
            [
                3482,
                3521
            ],
            [
                3521,
                3542
            ],
            [
                3542,
                3542
            ],
            [
                3542,
                3567
            ],
            [
                3567,
                3670
            ],
            [
                3670,
                3715
            ],
            [
                3715,
                3733
            ],
            [
                3733,
                3747
            ],
            [
                3747,
                3775
            ],
            [
                3775,
                3814
            ],
            [
                3814,
                3972
            ],
            [
                3972,
                4097
            ],
            [
                4097,
                4445
            ],
            [
                4445,
                4564
            ],
            [
                4564,
                4608
            ],
            [
                4608,
                4743
            ],
            [
                4743,
                4759
            ],
            [
                4759,
                4872
            ],
            [
                4872,
                4908
            ],
            [
                4908,
                5034
            ],
            [
                5034,
                5097
            ],
            [
                5097,
                5116
            ],
            [
                5116,
                5129
            ],
            [
                5129,
                5176
            ],
            [
                5176,
                5184
            ],
            [
                5184,
                5217
            ],
            [
                5217,
                5304
            ],
            [
                5304,
                5325
            ],
            [
                5325,
                5361
            ],
            [
                5361,
                5387
            ],
            [
                5387,
                5433
            ],
            [
                5433,
                5433
            ],
            [
                5433,
                5496
            ],
            [
                5496,
                5543
            ],
            [
                5543,
                5602
            ],
            [
                5602,
                5669
            ],
            [
                5669,
                5733
            ],
            [
                5733,
                6026
            ],
            [
                6026,
                6045
            ],
            [
                6045,
                6106
            ],
            [
                6106,
                6122
            ],
            [
                6122,
                6160
            ],
            [
                6160,
                6241
            ],
            [
                6241,
                6254
            ],
            [
                6254,
                6300
            ],
            [
                6300,
                6412
            ],
            [
                6412,
                6460
            ],
            [
                6460,
                6600
            ],
            [
                6600,
                6739
            ],
            [
                6739,
                6803
            ],
            [
                6803,
                6855
            ],
            [
                6855,
                6932
            ],
            [
                6932,
                7014
            ],
            [
                7014,
                7071
            ],
            [
                7071,
                7175
            ],
            [
                7175,
                7316
            ],
            [
                7316,
                7412
            ],
            [
                7412,
                7489
            ],
            [
                7489,
                7514
            ],
            [
                7514,
                7539
            ],
            [
                7539,
                7564
            ],
            [
                7564,
                7651
            ],
            [
                7651,
                7726
            ],
            [
                7726,
                7825
            ],
            [
                7825,
                7886
            ],
            [
                7886,
                8009
            ],
            [
                8009,
                8103
            ],
            [
                8103,
                8228
            ],
            [
                8228,
                8311
            ],
            [
                8311,
                8339
            ],
            [
                8339,
                8388
            ],
            [
                8388,
                8456
            ],
            [
                8456,
                8474
            ],
            [
                8474,
                8504
            ],
            [
                8504,
                8691
            ],
            [
                8691,
                8802
            ],
            [
                8802,
                8932
            ],
            [
                8932,
                9081
            ],
            [
                9081,
                9117
            ],
            [
                9117,
                9149
            ],
            [
                9149,
                9162
            ],
            [
                9162,
                9162
            ],
            [
                9162,
                9222
            ],
            [
                9222,
                9222
            ],
            [
                9222,
                9353
            ],
            [
                9353,
                9441
            ],
            [
                9441,
                9463
            ],
            [
                9463,
                9520
            ],
            [
                9520,
                9520
            ],
            [
                9520,
                9574
            ],
            [
                9574,
                9625
            ],
            [
                9625,
                9650
            ],
            [
                9650,
                9802
            ],
            [
                9802,
                9927
            ],
            [
                9927,
                10026
            ],
            [
                10026,
                10088
            ],
            [
                10088,
                10193
            ],
            [
                10193,
                10230
            ],
            [
                10230,
                10334
            ],
            [
                10334,
                10343
            ],
            [
                10343,
                10364
            ],
            [
                10364,
                10415
            ],
            [
                10415,
                10415
            ],
            [
                10415,
                10415
            ],
            [
                10415,
                10529
            ],
            [
                10529,
                10535
            ],
            [
                10535,
                10581
            ],
            [
                10581,
                10604
            ],
            [
                10604,
                10637
            ],
            [
                10637,
                10643
            ],
            [
                10643,
                10674
            ],
            [
                10674,
                10722
            ],
            [
                10722,
                10754
            ],
            [
                10754,
                10886
            ],
            [
                10886,
                10986
            ],
            [
                10986,
                11036
            ],
            [
                11036,
                11045
            ],
            [
                11045,
                11112
            ],
            [
                11112,
                11140
            ],
            [
                11140,
                11185
            ],
            [
                11185,
                11265
            ],
            [
                11265,
                11311
            ],
            [
                11311,
                11365
            ],
            [
                11365,
                11406
            ],
            [
                11406,
                11436
            ],
            [
                11436,
                11458
            ],
            [
                11458,
                11501
            ],
            [
                11501,
                11644
            ],
            [
                11644,
                11667
            ],
            [
                11667,
                11685
            ],
            [
                11685,
                11710
            ],
            [
                11710,
                11855
            ],
            [
                11855,
                11894
            ],
            [
                11894,
                11911
            ],
            [
                11911,
                12069
            ],
            [
                12069,
                12114
            ],
            [
                12114,
                12130
            ],
            [
                12130,
                12145
            ],
            [
                12145,
                12145
            ],
            [
                12145,
                12176
            ],
            [
                12176,
                12351
            ],
            [
                12351,
                12660
            ],
            [
                12660,
                12756
            ],
            [
                12756,
                12863
            ],
            [
                12863,
                12996
            ],
            [
                12996,
                13083
            ],
            [
                13083,
                13123
            ],
            [
                13123,
                13145
            ],
            [
                13145,
                13191
            ],
            [
                13191,
                13287
            ],
            [
                13287,
                13350
            ],
            [
                13350,
                13430
            ],
            [
                13430,
                13541
            ]
        ]
    }
}