{
    "original": {
        "text": "Sometimes, while meditating on these things in solitude, I've got up in a sudden terror, and put on my bonnet to go see how all was at the farm. I've persuaded my conscience that it was a duty to warn him how people talked regarding his ways; and then I've recollected his confirmed bad habits, and, hopeless of benefiting him, have flinched from re-entering the dismal house, doubting if I could bear to be taken at my word.\nOne time I passed the old gate, going out of my way, on a journey to Gimmerton. It was about the period that my narrative has reached: a bright frosty afternoon; the ground bare, and the road hard and dry. I came to a stone where the highway branches off on to the moor at your left hand; a rough sand-pillar, with the letters W. H. cut on its north side, on the east, G., and on the south-west, T. G. It serves as a guide-post to the Grange, the Heights, and village. The sun shone yellow on its grey head, reminding me of summer; and I cannot say why, but all at once a gush of child's sensations flowed into my heart. Hindley and I held it a favourite spot twenty years before. I gazed long at the weather-worn block; and, stooping down, perceived a hole near the bottom still full of snail-shells and pebbles, which we were fond of storing there with more perishable things; and, as fresh as reality, it appeared that I beheld my early playmate seated on the withered turf: his dark, square head bent forward, and his little hand scooping out the earth with a piece of slate. \"Poor Hindley!\" I exclaimed, involuntarily. I started: my bodily eye was cheated into a momentary belief that the child lifted its face and stared straight into mine! It vanished in a twinkling; but immediately I felt an irresistible yearning to be at the Heights. Superstition urged me to comply with this impulse: supposing he should be dead! I thought-or should die soon!-supposing it were a sign of death! The nearer I got to the house the more agitated I grew; and on catching sight of it I trembled in every limb. The apparition had outstripped me: it stood looking through the gate. That was my first idea on observing an elf-locked, brown-eyed boy setting his ruddy countenance against the bars. Further reflection suggested this must be Hareton, _my_ Hareton, not altered greatly since I left him, ten months since.\n\"God bless thee, darling!\" I cried, forgetting instantaneously my foolish fears. \"Hareton, it's Nelly! Nelly, thy nurse.\"\nHe retreated out of arm's length, and picked up a large flint.\n\"I am come to see thy father, Hareton,\" I added, guessing from the action that Nelly, if she lived in his memory at all, was not recognised as one with me.\nHe raised his missile to hurl it; I commenced a soothing speech, but could not stay his hand: the stone struck my bonnet; and then ensued, from the stammering lips of the little fellow, a string of curses, which, whether he comprehended them or not, were delivered with practised emphasis, and distorted his baby features into a shocking expression of malignity. You may be certain this grieved more than angered me. Fit to cry, I took an orange from my pocket, and offered it to propitiate him. He hesitated, and then snatched it from my hold; as if he fancied I only intended to tempt and disappoint him. I showed another, keeping it out of his reach.\n\"Who has taught you those fine words, my bairn?\" I inquired. \"The curate?\"\n\"Damn the curate, and thee! Gie me that,\" he replied.\n\"Tell us where you got your lessons, and you shall have it,\" said I. \"Who's your master?\"\n\"Devil daddy,\" was his answer.\n\"And what do you learn from daddy?\" I continued.\nHe jumped at the fruit; I raised it higher. \"What does he teach you?\" I asked.\n\"Naught,\" said he, \"but to keep out of his gait. Daddy cannot bide me, because I swear at him.\"\n\"Ah! and the devil teaches you to swear at daddy?\" I observed.\n\"Ay-nay,\" he drawled.\n\"Who, then?\"\n\"Heathcliff.\"\n\"I asked if he liked Mr. Heathcliff.\"\n\"Ay!\" he answered again.\nDesiring to have his reasons for liking him, I could only gather the sentences-\"I known't: he pays dad back what he gies to me-he curses daddy for cursing me. He says I mun do as I will.\"\n\"And the curate does not teach you to read and write, then?\" I pursued.\n\"No, I was told the curate should have his -- teeth dashed down his -- throat, if he stepped over the threshold-Heathcliff had promised that!\"\nI put the orange in his hand, and bade him tell his father that a woman called Nelly Dean was waiting to speak with him, by the garden gate. He went up the walk, and entered the house; but, instead of Hindley, Heathcliff appeared on the door-stones; and I turned directly and ran down the road as hard as ever I could race, making no halt till I gained the guide-post, and feeling as scared as if I had raised a goblin. This is not much connected with Miss Isabella's affair: except that it urged me to resolve further on mounting vigilant guard, and doing my utmost to check the spread of such bad influence at the Grange: even though I should wake a domestic storm, by thwarting Mrs. Linton's pleasure.\nThe next time Heathcliff came my young lady chanced to be feeding some pigeons in the court. She had never spoken a word to her sister-in-law for three days; but she had likewise dropped her fretful complaining, and we found it a great comfort. Heathcliff had not the habit of bestowing a single unnecessary civility on Miss Linton, I knew. Now, as soon as he beheld her, his first precaution was to take a sweeping survey of the house-front. I was standing by the kitchen-window, but I drew out of sight. He then stepped across the pavement to her, and said something: she seemed embarrassed, and desirous of getting away; to prevent it, he laid his hand on her arm. She averted her face: he apparently put some question which she had no mind to answer. There was another rapid glance at the house, and supposing himself unseen, the scoundrel had the impudence to embrace her.\n\"Judas! Traitor!\" I ejaculated. \"You are a hypocrite, too, are you? A deliberate deceiver.\"\n\"Who is, Nelly?\" said Catherine's voice at my elbow: I had been over-intent on watching the pair outside to mark her entrance.\n\"Your worthless friend!\" I answered, warmly: \"the sneaking rascal yonder. Ah, he has caught a glimpse of us-he is coming in! I wonder will he have the heart to find a plausible excuse for making love to Miss, when he told you he hated her?\"\nMrs. Linton saw Isabella tear herself free, and run into the garden; and a minute after, Heathcliff opened the door. I couldn't withhold giving some loose to my indignation; but Catherine angrily insisted on silence, and threatened to order me out of the kitchen, if I dared to be so presumptuous as to put in my insolent tongue.\n\"To hear you, people might think you were the mistress!\" she cried. \"You want setting down in your right place! Heathcliff, what are you about, raising this stir? I said you must let Isabella alone!-I beg you will, unless you are tired of being received here, and wish Linton to draw the bolts against you!\"\n\"God forbid that he should try!\" answered the black villain. I detested him just then. \"God keep him meek and patient! Every day I grow madder after sending him to heaven!\"\n\"Hush!\" said Catherine, shutting the inner door. \"Don't vex me. Why have you disregarded my request? Did she come across you on purpose?\"\n\"What is it to you?\" he growled. \"I have a right to kiss her, if she chooses; and you have no right to object. I am not _your_ husband: _you_ needn't be jealous of me!\"\n\"I'm not jealous of you,\" replied the mistress; \"I'm jealous for you. Clear your face: you sha'n't scowl at me! If you like Isabella, you shall marry her. But do you like her? Tell the truth, Heathcliff! There, you won't answer. I'm certain you don't.\"\n\"And would Mr. Linton approve of his sister marrying that man?\" I inquired.\n\"Mr. Linton should approve,\" returned my lady, decisively.\n\"He might spare himself the trouble,\" said Heathcliff: \"I could do as well without his approbation. And as to you, Catherine, I have a mind to speak a few words now, while we are at it. I want you to be aware that I _know_ you have treated me infernally-infernally! Do you hear? And if you flatter yourself that I don't perceive it, you are a fool; and if you think I can be consoled by sweet words, you are an idiot: and if you fancy I'll suffer unrevenged, I'll convince you of the contrary, in a very little while! Meantime, thank you for telling me your sister-in-law's secret: I swear I'll make the most of it. And stand you aside!\"\n\"What new phase of his character is this?\" exclaimed Mrs. Linton, in amazement. \"I've treated you infernally-and you'll take your revenge! How will you take it, ungrateful brute? How have I treated you infernally?\"\n\"I seek no revenge on you,\" replied Heathcliff, less vehemently. \"That's not the plan. The tyrant grinds down his slaves and they don't turn against him; they crush those beneath them. You are welcome to torture me to death for your amusement, only allow me to amuse myself a little in the same style, and refrain from insult as much as you are able. Having levelled my palace, don't erect a hovel and complacently admire your own charity in giving me that for a home. If I imagined you really wished me to marry Isabel, I'd cut my throat!\"\n\"Oh, the evil is that I am _not_ jealous, is it?\" cried Catherine. \"Well, I won't repeat my offer of a wife: it is as bad as offering Satan a lost soul. Your bliss lies, like his, in inflicting misery. You prove it. Edgar is restored from the ill-temper he gave way to at your coming; I begin to be secure and tranquil; and you, restless to know us at peace, appear resolved on exciting a quarrel. Quarrel with Edgar, if you please, Heathcliff, and deceive his sister: you'll hit on exactly the most efficient method of revenging yourself on me.\"\nThe conversation ceased. Mrs. Linton sat down by the fire, flushed and gloomy. The spirit which served her was growing intractable: she could neither lay nor control it. He stood on the hearth with folded arms, brooding on his evil thoughts; and in this position I left them to seek the master, who was wondering what kept Catherine below so long.\n\"Ellen,\" said he, when I entered, \"have you seen your mistress?\"\n\"Yes; she's in the kitchen, sir,\" I answered. \"She's sadly put out by Mr. Heathcliff's behaviour: and, indeed, I do think it's time to arrange his visits on another footing. There's harm in being too soft, and now it's come to this-.\" And I related the scene in the court, and, as near as I dared, the whole subsequent dispute. I fancied it could not be very prejudicial to Mrs. Linton; unless she made it so afterwards, by assuming the defensive for her guest. Edgar Linton had difficulty in hearing me to the close. His first words revealed that he did not clear his wife of blame.\n\"This is insufferable!\" he exclaimed. \"It is disgraceful that she should own him for a friend, and force his company on me! Call me two men out of the hall, Ellen. Catherine shall linger no longer to argue with the low ruffian-I have humoured her enough.\"\nHe descended, and bidding the servants wait in the passage, went, followed by me, to the kitchen. Its occupants had recommenced their angry discussion: Mrs. Linton, at least, was scolding with renewed vigour; Heathcliff had moved to the window, and hung his head, somewhat cowed by her violent rating apparently. He saw the master first, and made a hasty motion that she should be silent; which she obeyed, abruptly, on discovering the reason of his intimation.\n\"How is this?\" said Linton, addressing her; \"what notion of propriety must you have to remain here, after the language which has been held to you by that blackguard? I suppose, because it is his ordinary talk you think nothing of it: you are habituated to his baseness, and, perhaps, imagine I can get used to it too!\"\n\"Have you been listening at the door, Edgar?\" asked the mistress, in a tone particularly calculated to provoke her husband, implying both carelessness and contempt of his irritation. Heathcliff, who had raised his eyes at the former speech, gave a sneering laugh at the latter; on purpose, it seemed, to draw Mr. Linton's attention to him. He succeeded; but Edgar did not mean to entertain him with any high flights of passion.\n\"I've been so far forbearing with you, sir,\" he said quietly; \"not that I was ignorant of your miserable, degraded character, but I felt you were only partly responsible for that; and Catherine wishing to keep up your acquaintance, I acquiesced-foolishly. Your presence is a moral poison that would contaminate the most virtuous: for that cause, and to prevent worse consequences, I shall deny you hereafter admission into this house, and give notice now that I require your instant departure. Three minutes' delay will render it involuntary and ignominious.'\nHeathcliff measured the height and breadth of the speaker with an eye full of derision.\n\"Cathy, this lamb of yours threatens like a bull!\" he said. \"It is in danger of splitting its skull against my knuckles. By God! Mr. Linton, I'm mortally sorry that you are not worth knocking down!\"\nMy master glanced towards the passage, and signed me to fetch the men: he had no intention of hazarding a personal encounter. I obeyed the hint; but Mrs. Linton, suspecting something, followed; and when I attempted to call them, she pulled me back, slammed the door to, and locked it.\n\"Fair means!\" she said, in answer to her husband's look of angry surprise. \"If you have not courage to attack him, make an apology, or allow yourself to be beaten. It will correct you of feigning more valour than you possess. No, I'll swallow the key before you shall get it! I'm delightfully rewarded for my kindness to each! After constant indulgence of one's weak nature, and the other's bad one, I earn for thanks two samples of blind ingratitude, stupid to absurdity! Edgar, I was defending you and yours; and I wish Heathcliff may flog you sick, for daring to think an evil thought of me!\"\nIt did not need the medium of a flogging to produce that effect on the master. He tried to wrest the key from Catherine's grasp, and for safety she flung it into the hottest part of the fire; whereupon Mr. Edgar was taken with a nervous trembling, and his countenance grew deadly pale. For his life he could not avert that excess of emotion: mingled anguish and humiliation overcame him completely. He leant on the back of a chair, and covered his face.\n\"Oh, heavens! In old days this would win you knighthood!\" exclaimed Mrs. Linton. \"We are vanquished! we are vanquished! Heathcliff would as soon lift a finger at you as the king would march his army against a colony of mice. Cheer up! you sha'n't be hurt! Your type is not a lamb, it's a sucking leveret.\"\n\"I wish you joy of the milk-blooded coward, Cathy!\" said her friend. \"I compliment you on your taste. And that is the slavering, shivering thing you preferred to me! I would not strike him with my fist, but I'd kick him with my foot, and experience considerable satisfaction. Is he weeping, or is he going to faint for fear?\"\nThe fellow approached and gave the chair on which Linton rested a push. He'd better have kept his distance: my master quickly sprang erect, and struck him full on the throat a blow that would have levelled a slighter man. It took his breath for a minute; and while he choked, Mr. Linton walked out by the back door into the yard, and from thence to the front entrance.\n\"There! you've done with coming here,\" cried Catherine. \"Get away, now; he'll return with a brace of pistols and half-a-dozen assistants. If he did overhear us, of course he'd never forgive you. You've played me an ill turn, Heathcliff! But go-make haste! I'd rather see Edgar at bay than you.\"\n\"Do you suppose I'm going with that blow burning in my gullet?\" he thundered. \"By hell, no! I'll crush his ribs in like a rotten hazel-nut before I cross the threshold! If I don't floor him now, I shall murder him some time; so, as you value his existence, let me get at him!\"\n\"He is not coming,\" I interposed, framing a bit of a lie. \"There's the coachman and the two gardeners; you'll surely not wait to be thrust into the road by them! Each has a bludgeon; and master will, very likely, be watching from the parlour-windows to see that they fulfil his orders.\"\nThe gardeners and coachman were there: but Linton was with them. They had already entered the court. Heathcliff, on the second thoughts, resolved to avoid a struggle against three underlings: he seized the poker, smashed the lock from the inner door, and made his escape as they tramped in.\nMrs. Linton, who was very much excited, bade me accompany her upstairs. She did not know my share in contributing to the disturbance, and I was anxious to keep her in ignorance.\n\"I'm nearly distracted, Nelly!\" she exclaimed, throwing herself on the sofa. \"A thousand smiths' hammers are beating in my head! Tell Isabella to shun me; this uproar is owing to her; and should she or any one else aggravate my anger at present, I shall get wild. And, Nelly, say to Edgar, if you see him again to-night, that I'm in danger of being seriously ill. I wish it may prove true. He has startled and distressed me shockingly! I want to frighten him. Besides, he might come and begin a string of abuse or complainings; I'm certain I should recriminate, and God knows where we should end! Will you do so, my good Nelly? You are aware that I am no way blamable in this matter. What possessed him to turn listener? Heathcliff's talk was outrageous, after you left us; but I could soon have diverted him from Isabella, and the rest meant nothing. Now all is dashed wrong; by the fool's craving to hear evil of self, that haunts some people like a demon! Had Edgar never gathered our conversation, he would never have been the worse for it. Really, when he opened on me in that unreasonable tone of displeasure after I had scolded Heathcliff till I was hoarse for him, I did not care hardly what they did to each other; especially as I felt that, however the scene closed, we should all be driven asunder for nobody knows how long! Well, if I cannot keep Heathcliff for my friend-if Edgar will be mean and jealous, I'll try to break their hearts by breaking my own. That will be a prompt way of finishing all, when I am pushed to extremity! But it's a deed to be reserved for a forlorn hope; I'd not take Linton by surprise with it. To this point he has been discreet in dreading to provoke me; you must represent the peril of quitting that policy, and remind him of my passionate temper, verging, when kindled, on frenzy. I wish you could dismiss that apathy out of that countenance, and look rather more anxious about me.\"\nThe stolidity with which I received these instructions was, no doubt, rather exasperating: for they were delivered in perfect sincerity; but I believed a person who could plan the turning of her fits of passion to account, beforehand, might, by exerting her will, manage to control herself tolerably, even while under their influence; and I did not wish to \"frighten\" her husband, as she said, and multiply his annoyances for the purpose of serving her selfishness. Therefore I said nothing when I met the master coming towards the parlour; but I took the liberty of turning back to listen whether they would resume their quarrel together. He began to speak first.\n\"Remain where you are, Catherine,\" he said; without any anger in his voice, but with much sorrowful despondency. \"I shall not stay. I am neither come to wrangle nor be reconciled; but I wish just to learn whether, after this evening's events, you intend to continue your intimacy with-\"\n\"Oh, for mercy's sake,\" interrupted the mistress, stamping her foot, \"for mercy's sake, let us hear no more of it now! Your cold blood cannot be worked into a fever: your veins are full of ice-water; but mine are boiling, and the sight of such chillness makes them dance.\"\n\"To get rid of me, answer my question,\" persevered Mr. Linton. \"You must answer it; and that violence does not alarm me. I have found that you can be as stoical as anyone, when you please. Will you give up Heathcliff hereafter, or will you give up me? It is impossible for you to be _my_ friend and _his_ at the same time; and I absolutely _require_ to know which you choose.\"\n\"I require to be let alone!\" exclaimed Catherine, furiously. \"I demand it! Don't you see I can scarcely stand? Edgar, you-you leave me!\"\nShe rang the bell till it broke with a twang; I entered leisurely. It was enough to try the temper of a saint, such senseless, wicked rages! There she lay dashing her head against the arm of the sofa, and grinding her teeth, so that you might fancy she would crash them to splinters! Mr. Linton stood looking at her in sudden compunction and fear. He told me to fetch some water. She had no breath for speaking. I brought a glass full; and as she would not drink, I sprinkled it on her face. In a few seconds she stretched herself out stiff, and turned up her eyes, while her cheeks, at once blanched and livid, assumed the aspect of death. Linton looked terrified.\n\"There is nothing in the world the matter,\" I whispered. I did not want him to yield, though I could not help being afraid in my heart.\n\"She has blood on her lips!\" he said, shuddering.\n\"Never mind!\" I answered, tartly. And I told him how she had resolved, previous to his coming, on exhibiting a fit of frenzy. I incautiously gave the account aloud, and she heard me; for she started up-her hair flying over her shoulders, her eyes flashing, the muscles of her neck and arms standing out preternaturally. I made up my mind for broken bones, at least; but she only glared about her for an instant, and then rushed from the room. The master directed me to follow; I did, to her chamber-door: she hindered me from going further by securing it against me.\nAs she never offered to descend to breakfast next morning, I went to ask whether she would have some carried up. \"No!\" she replied, peremptorily. The same question was repeated at dinner and tea; and again on the morrow after, and received the same answer. Mr. Linton, on his part, spent his time in the library, and did not inquire concerning his wife's occupations. Isabella and he had had an hour's interview, during which he tried to elicit from her some sentiment of proper horror for Heathcliff's advances: but he could make nothing of her evasive replies, and was obliged to close the examination unsatisfactorily; adding, however, a solemn warning, that if she were so insane as to encourage that worthless suitor, it would dissolve all bonds of relationship between herself and him.",
        "paragraph_chars": [
            [
                0,
                426
            ],
            [
                426,
                2331
            ],
            [
                2331,
                2453
            ],
            [
                2453,
                2516
            ],
            [
                2516,
                2672
            ],
            [
                2672,
                3326
            ],
            [
                3326,
                3401
            ],
            [
                3401,
                3455
            ],
            [
                3455,
                3545
            ],
            [
                3545,
                3576
            ],
            [
                3576,
                3625
            ],
            [
                3625,
                3704
            ],
            [
                3704,
                3800
            ],
            [
                3800,
                3863
            ],
            [
                3863,
                3885
            ],
            [
                3885,
                3898
            ],
            [
                3898,
                3912
            ],
            [
                3912,
                3950
            ],
            [
                3950,
                3975
            ],
            [
                3975,
                4163
            ],
            [
                4163,
                4235
            ],
            [
                4235,
                4378
            ],
            [
                4378,
                5083
            ],
            [
                5083,
                5961
            ],
            [
                5961,
                6053
            ],
            [
                6053,
                6180
            ],
            [
                6180,
                6421
            ],
            [
                6421,
                6751
            ],
            [
                6751,
                7059
            ],
            [
                7059,
                7232
            ],
            [
                7232,
                7370
            ],
            [
                7370,
                7539
            ],
            [
                7539,
                7792
            ],
            [
                7792,
                7868
            ],
            [
                7868,
                7927
            ],
            [
                7927,
                8565
            ],
            [
                8565,
                8780
            ],
            [
                8780,
                9321
            ],
            [
                9321,
                9868
            ],
            [
                9868,
                10216
            ],
            [
                10216,
                10281
            ],
            [
                10281,
                10865
            ],
            [
                10865,
                11121
            ],
            [
                11121,
                11583
            ],
            [
                11583,
                11902
            ],
            [
                11902,
                12330
            ],
            [
                12330,
                12890
            ],
            [
                12890,
                12978
            ],
            [
                12978,
                13177
            ],
            [
                13177,
                13462
            ],
            [
                13462,
                14058
            ],
            [
                14058,
                14512
            ],
            [
                14512,
                14818
            ],
            [
                14818,
                15144
            ],
            [
                15144,
                15513
            ],
            [
                15513,
                15808
            ],
            [
                15808,
                16085
            ],
            [
                16085,
                16372
            ],
            [
                16372,
                16663
            ],
            [
                16663,
                16841
            ],
            [
                16841,
                18770
            ],
            [
                18770,
                19435
            ],
            [
                19435,
                19722
            ],
            [
                19722,
                19995
            ],
            [
                19995,
                20372
            ],
            [
                20372,
                20509
            ],
            [
                20509,
                21175
            ],
            [
                21175,
                21311
            ],
            [
                21311,
                21361
            ],
            [
                21361,
                21928
            ],
            [
                21928,
                22719
            ]
        ],
        "segment_chars": [
            [
                0,
                145
            ],
            [
                145,
                426
            ],
            [
                426,
                506
            ],
            [
                506,
                632
            ],
            [
                632,
                895
            ],
            [
                895,
                1047
            ],
            [
                1047,
                1107
            ],
            [
                1107,
                1506
            ],
            [
                1506,
                1522
            ],
            [
                1522,
                1550
            ],
            [
                1550,
                1673
            ],
            [
                1673,
                1771
            ],
            [
                1771,
                1851
            ],
            [
                1851,
                1916
            ],
            [
                1916,
                2026
            ],
            [
                2026,
                2096
            ],
            [
                2096,
                2210
            ],
            [
                2210,
                2331
            ],
            [
                2331,
                2358
            ],
            [
                2358,
                2412
            ],
            [
                2412,
                2434
            ],
            [
                2434,
                2453
            ],
            [
                2453,
                2516
            ],
            [
                2516,
                2672
            ],
            [
                2672,
                3035
            ],
            [
                3035,
                3089
            ],
            [
                3089,
                3168
            ],
            [
                3168,
                3279
            ],
            [
                3279,
                3326
            ],
            [
                3326,
                3375
            ],
            [
                3375,
                3387
            ],
            [
                3387,
                3401
            ],
            [
                3401,
                3429
            ],
            [
                3429,
                3455
            ],
            [
                3455,
                3524
            ],
            [
                3524,
                3545
            ],
            [
                3545,
                3576
            ],
            [
                3576,
                3612
            ],
            [
                3612,
                3625
            ],
            [
                3625,
                3669
            ],
            [
                3669,
                3695
            ],
            [
                3695,
                3704
            ],
            [
                3704,
                3753
            ],
            [
                3753,
                3800
            ],
            [
                3800,
                3805
            ],
            [
                3805,
                3851
            ],
            [
                3851,
                3863
            ],
            [
                3863,
                3885
            ],
            [
                3885,
                3898
            ],
            [
                3898,
                3912
            ],
            [
                3912,
                3950
            ],
            [
                3950,
                3956
            ],
            [
                3956,
                3975
            ],
            [
                3975,
                4134
            ],
            [
                4134,
                4163
            ],
            [
                4163,
                4224
            ],
            [
                4224,
                4235
            ],
            [
                4235,
                4378
            ],
            [
                4378,
                4519
            ],
            [
                4519,
                4798
            ],
            [
                4798,
                5083
            ],
            [
                5083,
                5176
            ],
            [
                5176,
                5328
            ],
            [
                5328,
                5424
            ],
            [
                5424,
                5526
            ],
            [
                5526,
                5589
            ],
            [
                5589,
                5751
            ],
            [
                5751,
                5838
            ],
            [
                5838,
                5961
            ],
            [
                5961,
                5969
            ],
            [
                5969,
                5979
            ],
            [
                5979,
                5993
            ],
            [
                5993,
                6029
            ],
            [
                6029,
                6053
            ],
            [
                6053,
                6070
            ],
            [
                6070,
                6180
            ],
            [
                6180,
                6205
            ],
            [
                6205,
                6254
            ],
            [
                6254,
                6305
            ],
            [
                6305,
                6421
            ],
            [
                6421,
                6538
            ],
            [
                6538,
                6751
            ],
            [
                6751,
                6808
            ],
            [
                6808,
                6819
            ],
            [
                6819,
                6863
            ],
            [
                6863,
                6914
            ],
            [
                6914,
                7059
            ],
            [
                7059,
                7092
            ],
            [
                7092,
                7120
            ],
            [
                7120,
                7146
            ],
            [
                7146,
                7178
            ],
            [
                7178,
                7232
            ],
            [
                7232,
                7240
            ],
            [
                7240,
                7281
            ],
            [
                7281,
                7296
            ],
            [
                7296,
                7333
            ],
            [
                7333,
                7370
            ],
            [
                7370,
                7391
            ],
            [
                7391,
                7403
            ],
            [
                7403,
                7481
            ],
            [
                7481,
                7539
            ],
            [
                7539,
                7609
            ],
            [
                7609,
                7651
            ],
            [
                7651,
                7694
            ],
            [
                7694,
                7715
            ],
            [
                7715,
                7743
            ],
            [
                7743,
                7768
            ],
            [
                7768,
                7792
            ],
            [
                7792,
                7856
            ],
            [
                7856,
                7868
            ],
            [
                7868,
                7927
            ],
            [
                7927,
                8027
            ],
            [
                8027,
                8113
            ],
            [
                8113,
                8193
            ],
            [
                8193,
                8206
            ],
            [
                8206,
                8445
            ],
            [
                8445,
                8543
            ],
            [
                8543,
                8565
            ],
            [
                8565,
                8608
            ],
            [
                8608,
                8645
            ],
            [
                8645,
                8704
            ],
            [
                8704,
                8744
            ],
            [
                8744,
                8780
            ],
            [
                8780,
                8845
            ],
            [
                8845,
                8867
            ],
            [
                8867,
                8965
            ],
            [
                8965,
                9131
            ],
            [
                9131,
                9249
            ],
            [
                9249,
                9321
            ],
            [
                9321,
                9371
            ],
            [
                9371,
                9388
            ],
            [
                9388,
                9474
            ],
            [
                9474,
                9523
            ],
            [
                9523,
                9537
            ],
            [
                9537,
                9719
            ],
            [
                9719,
                9868
            ],
            [
                9868,
                9893
            ],
            [
                9893,
                9947
            ],
            [
                9947,
                10038
            ],
            [
                10038,
                10216
            ],
            [
                10216,
                10281
            ],
            [
                10281,
                10327
            ],
            [
                10327,
                10455
            ],
            [
                10455,
                10516
            ],
            [
                10516,
                10609
            ],
            [
                10609,
                10743
            ],
            [
                10743,
                10799
            ],
            [
                10799,
                10865
            ],
            [
                10865,
                10889
            ],
            [
                10889,
                10903
            ],
            [
                10903,
                10989
            ],
            [
                10989,
                11029
            ],
            [
                11029,
                11121
            ],
            [
                11121,
                11219
            ],
            [
                11219,
                11434
            ],
            [
                11434,
                11583
            ],
            [
                11583,
                11598
            ],
            [
                11598,
                11749
            ],
            [
                11749,
                11902
            ],
            [
                11902,
                11948
            ],
            [
                11948,
                12085
            ],
            [
                12085,
                12242
            ],
            [
                12242,
                12330
            ],
            [
                12330,
                12586
            ],
            [
                12586,
                12824
            ],
            [
                12824,
                12890
            ],
            [
                12890,
                12978
            ],
            [
                12978,
                13029
            ],
            [
                13029,
                13038
            ],
            [
                13038,
                13099
            ],
            [
                13099,
                13107
            ],
            [
                13107,
                13177
            ],
            [
                13177,
                13303
            ],
            [
                13303,
                13462
            ],
            [
                13462,
                13476
            ],
            [
                13476,
                13537
            ],
            [
                13537,
                13626
            ],
            [
                13626,
                13688
            ],
            [
                13688,
                13738
            ],
            [
                13738,
                13789
            ],
            [
                13789,
                13935
            ],
            [
                13935,
                14058
            ],
            [
                14058,
                14137
            ],
            [
                14137,
                14344
            ],
            [
                14344,
                14457
            ],
            [
                14457,
                14512
            ],
            [
                14512,
                14526
            ],
            [
                14526,
                14570
            ],
            [
                14570,
                14593
            ],
            [
                14593,
                14613
            ],
            [
                14613,
                14632
            ],
            [
                14632,
                14737
            ],
            [
                14737,
                14747
            ],
            [
                14747,
                14768
            ],
            [
                14768,
                14818
            ],
            [
                14818,
                14870
            ],
            [
                14870,
                14887
            ],
            [
                14887,
                14920
            ],
            [
                14920,
                14984
            ],
            [
                14984,
                15094
            ],
            [
                15094,
                15144
            ],
            [
                15144,
                15216
            ],
            [
                15216,
                15366
            ],
            [
                15366,
                15513
            ],
            [
                15513,
                15521
            ],
            [
                15521,
                15569
            ],
            [
                15569,
                15651
            ],
            [
                15651,
                15708
            ],
            [
                15708,
                15750
            ],
            [
                15750,
                15769
            ],
            [
                15769,
                15808
            ],
            [
                15808,
                15872
            ],
            [
                15872,
                15886
            ],
            [
                15886,
                15900
            ],
            [
                15900,
                15977
            ],
            [
                15977,
                16085
            ],
            [
                16085,
                16143
            ],
            [
                16143,
                16247
            ],
            [
                16247,
                16372
            ],
            [
                16372,
                16437
            ],
            [
                16437,
                16473
            ],
            [
                16473,
                16663
            ],
            [
                16663,
                16735
            ],
            [
                16735,
                16841
            ],
            [
                16841,
                16873
            ],
            [
                16873,
                16918
            ],
            [
                16918,
                16970
            ],
            [
                16970,
                17105
            ],
            [
                17105,
                17205
            ],
            [
                17205,
                17231
            ],
            [
                17231,
                17277
            ],
            [
                17277,
                17301
            ],
            [
                17301,
                17438
            ],
            [
                17438,
                17469
            ],
            [
                17469,
                17525
            ],
            [
                17525,
                17562
            ],
            [
                17562,
                17693
            ],
            [
                17693,
                17800
            ],
            [
                17800,
                17886
            ],
            [
                17886,
                18177
            ],
            [
                18177,
                18311
            ],
            [
                18311,
                18386
            ],
            [
                18386,
                18478
            ],
            [
                18478,
                18668
            ],
            [
                18668,
                18770
            ],
            [
                18770,
                19236
            ],
            [
                19236,
                19410
            ],
            [
                19410,
                19435
            ],
            [
                19435,
                19548
            ],
            [
                19548,
                19567
            ],
            [
                19567,
                19722
            ],
            [
                19722,
                19841
            ],
            [
                19841,
                19995
            ],
            [
                19995,
                20058
            ],
            [
                20058,
                20116
            ],
            [
                20116,
                20184
            ],
            [
                20184,
                20247
            ],
            [
                20247,
                20372
            ],
            [
                20372,
                20401
            ],
            [
                20401,
                20433
            ],
            [
                20433,
                20447
            ],
            [
                20447,
                20483
            ],
            [
                20483,
                20509
            ],
            [
                20509,
                20576
            ],
            [
                20576,
                20650
            ],
            [
                20650,
                20793
            ],
            [
                20793,
                20857
            ],
            [
                20857,
                20889
            ],
            [
                20889,
                20921
            ],
            [
                20921,
                21001
            ],
            [
                21001,
                21150
            ],
            [
                21150,
                21175
            ],
            [
                21175,
                21232
            ],
            [
                21232,
                21311
            ],
            [
                21311,
                21340
            ],
            [
                21340,
                21361
            ],
            [
                21361,
                21375
            ],
            [
                21375,
                21395
            ],
            [
                21395,
                21487
            ],
            [
                21487,
                21681
            ],
            [
                21681,
                21804
            ],
            [
                21804,
                21928
            ],
            [
                21928,
                22041
            ],
            [
                22041,
                22047
            ],
            [
                22047,
                22074
            ],
            [
                22074,
                22185
            ],
            [
                22185,
                22296
            ],
            [
                22296,
                22719
            ]
        ],
        "overlap_chars": [
            [
                145,
                146
            ],
            [
                174,
                185
            ],
            [
                160,
                162
            ],
            [
                188,
                200
            ],
            [
                205,
                236
            ],
            [
                283,
                293
            ],
            [
                241,
                242
            ],
            [
                252,
                253
            ],
            [
                333,
                358
            ],
            [
                269,
                272
            ],
            [
                363,
                375
            ],
            [
                424,
                426
            ],
            [
                426,
                429
            ],
            [
                456,
                457
            ],
            [
                435,
                443
            ],
            [
                479,
                481
            ],
            [
                444,
                447
            ],
            [
                474,
                477
            ],
            [
                492,
                506
            ],
            [
                632,
                649
            ],
            [
                848,
                853
            ],
            [
                656,
                659
            ],
            [
                684,
                686
            ],
            [
                869,
                881
            ],
            [
                996,
                1047
            ],
            [
                1066,
                1068
            ],
            [
                1069,
                1085
            ],
            [
                1051,
                1060
            ],
            [
                1086,
                1107
            ],
            [
                1107,
                1114
            ],
            [
                1120,
                1150
            ],
            [
                1357,
                1459
            ],
            [
                1504,
                1505
            ],
            [
                1507,
                1519
            ],
            [
                1522,
                1550
            ],
            [
                1616,
                1673
            ],
            [
                1673,
                1723
            ],
            [
                1740,
                1771
            ],
            [
                1771,
                1795
            ],
            [
                1820,
                1821
            ],
            [
                1881,
                1915
            ],
            [
                1927,
                1932
            ],
            [
                1920,
                1926
            ],
            [
                1933,
                1945
            ],
            [
                2000,
                2024
            ],
            [
                2026,
                2040
            ],
            [
                2064,
                2069
            ],
            [
                2070,
                2094
            ],
            [
                2132,
                2139
            ],
            [
                2145,
                2161
            ],
            [
                2170,
                2173
            ],
            [
                2192,
                2210
            ],
            [
                2252,
                2260
            ],
            [
                2262,
                2264
            ],
            [
                2266,
                2331
            ],
            [
                2332,
                2355
            ],
            [
                2358,
                2365
            ],
            [
                2410,
                2412
            ],
            [
                2413,
                2432
            ],
            [
                2439,
                2450
            ],
            [
                2453,
                2465
            ],
            [
                2485,
                2508
            ],
            [
                2514,
                2516
            ],
            [
                2517,
                2553
            ],
            [
                2556,
                2573
            ],
            [
                2590,
                2594
            ],
            [
                2641,
                2644
            ],
            [
                2668,
                2672
            ],
            [
                2672,
                2674
            ],
            [
                2682,
                2693
            ],
            [
                3033,
                3034
            ],
            [
                2702,
                2704
            ],
            [
                2776,
                2802
            ],
            [
                2811,
                2856
            ],
            [
                2858,
                2883
            ],
            [
                3059,
                3089
            ],
            [
                3101,
                3151
            ],
            [
                3163,
                3167
            ],
            [
                3327,
                3366
            ],
            [
                3375,
                3387
            ],
            [
                3392,
                3398
            ],
            [
                3407,
                3429
            ],
            [
                3429,
                3440
            ],
            [
                3443,
                3455
            ],
            [
                3461,
                3513
            ],
            [
                3516,
                3524
            ],
            [
                3525,
                3542
            ],
            [
                3552,
                3557
            ],
            [
                3560,
                3576
            ],
            [
                3577,
                3609
            ],
            [
                3612,
                3625
            ],
            [
                3625,
                3669
            ],
            [
                3670,
                3692
            ],
            [
                3695,
                3704
            ],
            [
                3705,
                3711
            ],
            [
                3714,
                3722
            ],
            [
                3724,
                3746
            ],
            [
                3751,
                3753
            ],
            [
                3753,
                3797
            ],
            [
                3801,
                3805
            ],
            [
                3805,
                3848
            ],
            [
                3851,
                3863
            ],
            [
                3864,
                3870
            ],
            [
                3873,
                3885
            ],
            [
                3886,
                3895
            ],
            [
                3899,
                3909
            ],
            [
                3913,
                3947
            ],
            [
                3951,
                3953
            ],
            [
                3956,
                3967
            ],
            [
                3973,
                3974
            ],
            [
                4102,
                4134
            ],
            [
                4134,
                4143
            ],
            [
                4148,
                4160
            ],
            [
                4164,
                4221
            ],
            [
                4236,
                4239
            ],
            [
                4347,
                4357
            ],
            [
                4251,
                4277
            ],
            [
                4281,
                4302
            ],
            [
                4306,
                4319
            ],
            [
                4378,
                4441
            ],
            [
                4457,
                4497
            ],
            [
                4517,
                4519
            ],
            [
                4519,
                4521
            ],
            [
                4544,
                4607
            ],
            [
                4611,
                4619
            ],
            [
                4626,
                4640
            ],
            [
                4650,
                4682
            ],
            [
                4688,
                4695
            ],
            [
                4538,
                4539
            ],
            [
                4717,
                4723
            ],
            [
                4731,
                4745
            ],
            [
                4796,
                4797
            ],
            [
                5083,
                5112
            ],
            [
                5135,
                5137
            ],
            [
                5141,
                5148
            ],
            [
                5154,
                5168
            ],
            [
                5174,
                5176
            ],
            [
                5450,
                5454
            ],
            [
                5440,
                5442
            ],
            [
                5509,
                5526
            ],
            [
                5526,
                5588
            ],
            [
                5589,
                5680
            ],
            [
                5707,
                5709
            ],
            [
                5701,
                5705
            ],
            [
                5720,
                5721
            ],
            [
                5722,
                5751
            ],
            [
                5751,
                5775
            ],
            [
                5787,
                5804
            ],
            [
                5848,
                5961
            ],
            [
                5962,
                5969
            ],
            [
                5979,
                5980
            ],
            [
                5991,
                5992
            ],
            [
                6054,
                6057
            ],
            [
                6060,
                6067
            ],
            [
                6070,
                6084
            ],
            [
                6093,
                6104
            ],
            [
                6178,
                6180
            ],
            [
                6181,
                6202
            ],
            [
                6205,
                6215
            ],
            [
                6252,
                6254
            ],
            [
                6254,
                6264
            ],
            [
                6285,
                6305
            ],
            [
                6305,
                6313
            ],
            [
                6319,
                6321
            ],
            [
                6314,
                6318
            ],
            [
                6337,
                6344
            ],
            [
                6357,
                6388
            ],
            [
                6394,
                6418
            ],
            [
                6433,
                6488
            ],
            [
                6424,
                6425
            ],
            [
                6494,
                6502
            ],
            [
                6508,
                6538
            ],
            [
                6538,
                6539
            ],
            [
                6576,
                6578
            ],
            [
                6579,
                6616
            ],
            [
                6642,
                6655
            ],
            [
                6662,
                6689
            ],
            [
                6731,
                6733
            ],
            [
                6743,
                6751
            ],
            [
                6772,
                6805
            ],
            [
                6808,
                6819
            ],
            [
                6863,
                6893
            ],
            [
                6912,
                6914
            ],
            [
                6930,
                6949
            ],
            [
                6949,
                6950
            ],
            [
                6966,
                6976
            ],
            [
                7015,
                7029
            ],
            [
                7035,
                7038
            ],
            [
                7045,
                7056
            ],
            [
                7060,
                7089
            ],
            [
                7092,
                7120
            ],
            [
                7120,
                7146
            ],
            [
                7178,
                7201
            ],
            [
                7216,
                7229
            ],
            [
                7233,
                7237
            ],
            [
                7240,
                7268
            ],
            [
                7275,
                7281
            ],
            [
                7285,
                7296
            ],
            [
                7296,
                7299
            ],
            [
                7333,
                7336
            ],
            [
                7305,
                7308
            ],
            [
                7371,
                7388
            ],
            [
                7391,
                7403
            ],
            [
                7404,
                7481
            ],
            [
                7481,
                7489
            ],
            [
                7491,
                7495
            ],
            [
                7497,
                7505
            ],
            [
                7507,
                7510
            ],
            [
                7512,
                7536
            ],
            [
                7540,
                7562
            ],
            [
                7565,
                7586
            ],
            [
                7588,
                7609
            ],
            [
                7635,
                7651
            ],
            [
                7651,
                7694
            ],
            [
                7694,
                7715
            ],
            [
                7715,
                7743
            ],
            [
                7768,
                7789
            ],
            [
                8150,
                8191
            ],
            [
                8196,
                8206
            ],
            [
                8206,
                8216
            ],
            [
                8239,
                8246
            ],
            [
                8256,
                8419
            ],
            [
                8443,
                8445
            ],
            [
                8445,
                8479
            ],
            [
                8498,
                8508
            ],
            [
                8517,
                8543
            ],
            [
                8543,
                8562
            ],
            [
                8566,
                8570
            ],
            [
                8601,
                8605
            ],
            [
                8608,
                8645
            ],
            [
                8646,
                8674
            ],
            [
                8704,
                8721
            ],
            [
                8724,
                8742
            ],
            [
                8781,
                8805
            ],
            [
                8808,
                8826
            ],
            [
                8843,
                8845
            ],
            [
                8850,
                8867
            ],
            [
                8867,
                8900
            ],
            [
                8905,
                8909
            ],
            [
                8916,
                8920
            ],
            [
                8939,
                8965
            ],
            [
                8965,
                9080
            ],
            [
                9129,
                9131
            ],
            [
                9249,
                9295
            ],
            [
                9299,
                9318
            ],
            [
                9322,
                9347
            ],
            [
                9349,
                9352
            ],
            [
                9354,
                9368
            ],
            [
                9371,
                9388
            ],
            [
                9645,
                9648
            ],
            [
                9537,
                9542
            ],
            [
                9641,
                9644
            ],
            [
                9606,
                9607
            ],
            [
                9670,
                9679
            ],
            [
                9620,
                9639
            ],
            [
                9648,
                9649
            ],
            [
                9687,
                9695
            ],
            [
                9587,
                9589
            ],
            [
                9708,
                9719
            ],
            [
                9719,
                9865
            ],
            [
                9893,
                9947
            ],
            [
                10038,
                10040
            ],
            [
                10041,
                10108
            ],
            [
                10131,
                10142
            ],
            [
                10110,
                10113
            ],
            [
                10143,
                10145
            ],
            [
                10151,
                10200
            ],
            [
                10207,
                10216
            ],
            [
                10217,
                10222
            ],
            [
                10225,
                10233
            ],
            [
                10251,
                10278
            ],
            [
                10282,
                10312
            ],
            [
                10315,
                10327
            ],
            [
                10331,
                10393
            ],
            [
                10397,
                10415
            ],
            [
                10424,
                10434
            ],
            [
                10516,
                10546
            ],
            [
                10607,
                10609
            ],
            [
                10743,
                10791
            ],
            [
                10797,
                10798
            ],
            [
                10871,
                10886
            ],
            [
                10889,
                10903
            ],
            [
                10904,
                10937
            ],
            [
                10942,
                10989
            ],
            [
                10989,
                11000
            ],
            [
                11005,
                11029
            ],
            [
                11092,
                11107
            ],
            [
                11029,
                11038
            ],
            [
                11112,
                11118
            ],
            [
                11121,
                11123
            ],
            [
                11181,
                11185
            ],
            [
                11203,
                11219
            ],
            [
                11273,
                11284
            ],
            [
                11296,
                11308
            ],
            [
                11332,
                11340
            ],
            [
                11309,
                11332
            ],
            [
                11341,
                11383
            ],
            [
                11432,
                11434
            ],
            [
                11434,
                11536
            ],
            [
                11581,
                11583
            ],
            [
                11584,
                11595
            ],
            [
                11598,
                11626
            ],
            [
                11658,
                11661
            ],
            [
                11670,
                11707
            ],
            [
                11732,
                11747
            ],
            [
                11708,
                11711
            ],
            [
                11747,
                11749
            ],
            [
                11749,
                11758
            ],
            [
                11817,
                11824
            ],
            [
                11836,
                11851
            ],
            [
                11903,
                11945
            ],
            [
                11948,
                11977
            ],
            [
                12066,
                12068
            ],
            [
                12040,
                12065
            ],
            [
                12083,
                12085
            ],
            [
                12085,
                12095
            ],
            [
                12143,
                12164
            ],
            [
                12254,
                12265
            ],
            [
                12328,
                12330
            ],
            [
                12331,
                12340
            ],
            [
                12348,
                12372
            ],
            [
                12375,
                12391
            ],
            [
                12460,
                12503
            ],
            [
                12420,
                12424
            ],
            [
                12436,
                12454
            ],
            [
                12508,
                12513
            ],
            [
                12514,
                12523
            ],
            [
                12532,
                12563
            ],
            [
                12574,
                12575
            ],
            [
                12584,
                12586
            ],
            [
                12586,
                12617
            ],
            [
                12676,
                12679
            ],
            [
                12711,
                12712
            ],
            [
                12719,
                12727
            ],
            [
                12738,
                12768
            ],
            [
                12800,
                12822
            ],
            [
                12890,
                12900
            ],
            [
                12948,
                12952
            ],
            [
                12968,
                12978
            ],
            [
                12979,
                13026
            ],
            [
                13029,
                13038
            ],
            [
                13039,
                13099
            ],
            [
                13099,
                13107
            ],
            [
                13107,
                13122
            ],
            [
                13132,
                13174
            ],
            [
                13177,
                13186
            ],
            [
                13220,
                13242
            ],
            [
                13301,
                13303
            ],
            [
                13326,
                13338
            ],
            [
                13359,
                13360
            ],
            [
                13410,
                13442
            ],
            [
                13445,
                13462
            ],
            [
                13463,
                13473
            ],
            [
                13476,
                13537
            ],
            [
                13538,
                13576
            ],
            [
                13592,
                13626
            ],
            [
                13688,
                13738
            ],
            [
                13804,
                13809
            ],
            [
                13824,
                13840
            ],
            [
                13850,
                13861
            ],
            [
                13862,
                13879
            ],
            [
                13895,
                13900
            ],
            [
                13912,
                13920
            ],
            [
                13901,
                13912
            ],
            [
                13933,
                13935
            ],
            [
                13935,
                14055
            ],
            [
                14262,
                14269
            ],
            [
                14140,
                14167
            ],
            [
                14180,
                14185
            ],
            [
                14202,
                14223
            ],
            [
                14244,
                14259
            ],
            [
                14137,
                14139
            ],
            [
                14270,
                14309
            ],
            [
                14326,
                14344
            ],
            [
                14416,
                14457
            ],
            [
                14457,
                14468
            ],
            [
                14481,
                14512
            ],
            [
                14513,
                14526
            ],
            [
                14594,
                14611
            ],
            [
                14580,
                14592
            ],
            [
                14632,
                14737
            ],
            [
                14737,
                14747
            ],
            [
                14747,
                14753
            ],
            [
                14756,
                14766
            ],
            [
                14819,
                14867
            ],
            [
                14870,
                14874
            ],
            [
                14885,
                14887
            ],
            [
                14929,
                14935
            ],
            [
                14947,
                14984
            ],
            [
                15025,
                15028
            ],
            [
                15029,
                15037
            ],
            [
                15092,
                15094
            ],
            [
                15094,
                15132
            ],
            [
                15137,
                15141
            ],
            [
                15170,
                15174
            ],
            [
                15194,
                15200
            ],
            [
                15179,
                15184
            ],
            [
                15208,
                15216
            ],
            [
                15216,
                15218
            ],
            [
                15221,
                15276
            ],
            [
                15282,
                15366
            ],
            [
                15366,
                15373
            ],
            [
                15378,
                15384
            ],
            [
                15472,
                15473
            ],
            [
                15399,
                15458
            ],
            [
                15511,
                15513
            ],
            [
                15552,
                15569
            ],
            [
                15585,
                15638
            ],
            [
                15649,
                15651
            ],
            [
                15708,
                15714
            ],
            [
                15722,
                15750
            ],
            [
                15750,
                15753
            ],
            [
                15757,
                15769
            ],
            [
                15769,
                15805
            ],
            [
                15812,
                15869
            ],
            [
                15872,
                15886
            ],
            [
                15887,
                15900
            ],
            [
                15900,
                15919
            ],
            [
                15923,
                15946
            ],
            [
                15975,
                15977
            ],
            [
                15977,
                16035
            ],
            [
                16065,
                16082
            ],
            [
                16086,
                16102
            ],
            [
                16105,
                16118
            ],
            [
                16136,
                16143
            ],
            [
                16149,
                16186
            ],
            [
                16283,
                16284
            ],
            [
                16247,
                16251
            ],
            [
                16256,
                16283
            ],
            [
                16298,
                16341
            ],
            [
                16241,
                16245
            ],
            [
                16188,
                16191
            ],
            [
                16372,
                16409
            ],
            [
                16411,
                16437
            ],
            [
                16473,
                16487
            ],
            [
                16492,
                16537
            ],
            [
                16562,
                16663
            ],
            [
                16663,
                16674
            ],
            [
                16694,
                16701
            ],
            [
                16703,
                16710
            ],
            [
                16721,
                16735
            ],
            [
                16735,
                16751
            ],
            [
                16795,
                16841
            ],
            [
                16842,
                16870
            ],
            [
                16873,
                16886
            ],
            [
                16916,
                16918
            ],
            [
                16936,
                16937
            ],
            [
                16919,
                16929
            ],
            [
                16938,
                16970
            ],
            [
                16970,
                17023
            ],
            [
                17103,
                17105
            ],
            [
                17105,
                17129
            ],
            [
                17162,
                17205
            ],
            [
                17205,
                17231
            ],
            [
                17231,
                17237
            ],
            [
                17251,
                17277
            ],
            [
                17277,
                17301
            ],
            [
                17438,
                17469
            ],
            [
                17488,
                17499
            ],
            [
                17509,
                17525
            ],
            [
                17804,
                17809
            ],
            [
                17800,
                17803
            ],
            [
                17825,
                17886
            ],
            [
                17886,
                17901
            ],
            [
                17918,
                17940
            ],
            [
                17956,
                17986
            ],
            [
                18005,
                18028
            ],
            [
                18036,
                18063
            ],
            [
                18175,
                18177
            ],
            [
                18177,
                18194
            ],
            [
                18200,
                18214
            ],
            [
                18218,
                18264
            ],
            [
                18272,
                18311
            ],
            [
                18311,
                18320
            ],
            [
                18384,
                18386
            ],
            [
                18540,
                18548
            ],
            [
                18598,
                18604
            ],
            [
                18609,
                18632
            ],
            [
                18666,
                18668
            ],
            [
                18668,
                18684
            ],
            [
                18734,
                18738
            ],
            [
                18746,
                18767
            ],
            [
                18770,
                18864
            ],
            [
                19154,
                19157
            ],
            [
                18905,
                18945
            ],
            [
                18961,
                18980
            ],
            [
                19005,
                19010
            ],
            [
                19034,
                19059
            ],
            [
                18991,
                18992
            ],
            [
                19105,
                19126
            ],
            [
                19134,
                19136
            ],
            [
                19138,
                19149
            ],
            [
                18981,
                18983
            ],
            [
                19219,
                19236
            ],
            [
                19236,
                19265
            ],
            [
                19272,
                19282
            ],
            [
                19350,
                19352
            ],
            [
                19408,
                19409
            ],
            [
                19443,
                19467
            ],
            [
                19470,
                19486
            ],
            [
                19491,
                19496
            ],
            [
                19509,
                19531
            ],
            [
                19546,
                19548
            ],
            [
                19549,
                19567
            ],
            [
                19619,
                19625
            ],
            [
                19631,
                19719
            ],
            [
                19723,
                19743
            ],
            [
                19746,
                19790
            ],
            [
                19810,
                19841
            ],
            [
                19888,
                19960
            ],
            [
                19841,
                19845
            ],
            [
                19966,
                19992
            ],
            [
                20014,
                20032
            ],
            [
                20035,
                20058
            ],
            [
                20184,
                20211
            ],
            [
                20221,
                20225
            ],
            [
                20243,
                20247
            ],
            [
                20247,
                20277
            ],
            [
                20279,
                20281
            ],
            [
                20283,
                20293
            ],
            [
                20295,
                20298
            ],
            [
                20316,
                20323
            ],
            [
                20336,
                20343
            ],
            [
                20345,
                20369
            ],
            [
                20373,
                20398
            ],
            [
                20401,
                20433
            ],
            [
                20434,
                20447
            ],
            [
                20447,
                20483
            ],
            [
                20498,
                20506
            ],
            [
                20509,
                20576
            ],
            [
                20576,
                20596
            ],
            [
                20611,
                20650
            ],
            [
                20656,
                20733
            ],
            [
                20758,
                20792
            ],
            [
                20793,
                20834
            ],
            [
                20851,
                20857
            ],
            [
                20857,
                20889
            ],
            [
                20921,
                21001
            ],
            [
                21018,
                21073
            ],
            [
                21148,
                21150
            ],
            [
                21150,
                21175
            ],
            [
                21182,
                21192
            ],
            [
                21206,
                21216
            ],
            [
                21219,
                21231
            ],
            [
                21316,
                21337
            ],
            [
                21340,
                21361
            ],
            [
                21362,
                21372
            ],
            [
                21375,
                21395
            ],
            [
                21395,
                21430
            ],
            [
                21456,
                21487
            ],
            [
                21530,
                21543
            ],
            [
                21548,
                21562
            ],
            [
                21599,
                21617
            ],
            [
                21740,
                21756
            ],
            [
                21771,
                21804
            ],
            [
                21804,
                21814
            ],
            [
                21824,
                21837
            ],
            [
                21866,
                21869
            ],
            [
                21848,
                21864
            ],
            [
                21916,
                21928
            ],
            [
                21928,
                21940
            ],
            [
                21960,
                22040
            ],
            [
                22042,
                22044
            ],
            [
                22047,
                22058
            ],
            [
                22072,
                22074
            ],
            [
                22074,
                22140
            ],
            [
                22148,
                22184
            ],
            [
                22185,
                22195
            ],
            [
                22210,
                22260
            ],
            [
                22272,
                22280
            ],
            [
                22294,
                22296
            ],
            [
                22309,
                22311
            ],
            [
                22363,
                22365
            ],
            [
                22296,
                22304
            ],
            [
                22418,
                22509
            ],
            [
                22378,
                22381
            ],
            [
                22567,
                22650
            ],
            [
                22354,
                22356
            ],
            [
                22654,
                22659
            ],
            [
                22718,
                22719
            ]
        ],
        "row_chars": [
            [
                0,
                145
            ],
            [
                145,
                426
            ],
            [
                426,
                506
            ],
            [
                506,
                632
            ],
            [
                632,
                1047
            ],
            [
                1047,
                1107
            ],
            [
                1107,
                1506
            ],
            [
                1506,
                1522
            ],
            [
                1522,
                1550
            ],
            [
                1550,
                1673
            ],
            [
                1673,
                1771
            ],
            [
                1771,
                1916
            ],
            [
                1916,
                2210
            ],
            [
                2210,
                2331
            ],
            [
                2331,
                2358
            ],
            [
                2358,
                2412
            ],
            [
                2412,
                2453
            ],
            [
                2453,
                2516
            ],
            [
                2516,
                2672
            ],
            [
                2672,
                3089
            ],
            [
                3089,
                3168
            ],
            [
                3168,
                3279
            ],
            [
                3279,
                3326
            ],
            [
                3326,
                3375
            ],
            [
                3375,
                3387
            ],
            [
                3387,
                3401
            ],
            [
                3401,
                3429
            ],
            [
                3429,
                3455
            ],
            [
                3455,
                3524
            ],
            [
                3524,
                3545
            ],
            [
                3545,
                3576
            ],
            [
                3576,
                3612
            ],
            [
                3612,
                3625
            ],
            [
                3625,
                3669
            ],
            [
                3669,
                3695
            ],
            [
                3695,
                3704
            ],
            [
                3704,
                3753
            ],
            [
                3753,
                3800
            ],
            [
                3800,
                3805
            ],
            [
                3805,
                3851
            ],
            [
                3851,
                3863
            ],
            [
                3863,
                3885
            ],
            [
                3885,
                3898
            ],
            [
                3898,
                3912
            ],
            [
                3912,
                3950
            ],
            [
                3950,
                3956
            ],
            [
                3956,
                3975
            ],
            [
                3975,
                4134
            ],
            [
                4134,
                4163
            ],
            [
                4163,
                4224
            ],
            [
                4224,
                4235
            ],
            [
                4235,
                4378
            ],
            [
                4378,
                4519
            ],
            [
                4519,
                4798
            ],
            [
                4798,
                5083
            ],
            [
                5083,
                5176
            ],
            [
                5176,
                5328
            ],
            [
                5328,
                5424
            ],
            [
                5424,
                5526
            ],
            [
                5526,
                5589
            ],
            [
                5589,
                5751
            ],
            [
                5751,
                5961
            ],
            [
                5961,
                5969
            ],
            [
                5969,
                5979
            ],
            [
                5979,
                6053
            ],
            [
                6053,
                6070
            ],
            [
                6070,
                6180
            ],
            [
                6180,
                6205
            ],
            [
                6205,
                6254
            ],
            [
                6254,
                6305
            ],
            [
                6305,
                6421
            ],
            [
                6421,
                6538
            ],
            [
                6538,
                6751
            ],
            [
                6751,
                6808
            ],
            [
                6808,
                6819
            ],
            [
                6819,
                6863
            ],
            [
                6863,
                6914
            ],
            [
                6914,
                7059
            ],
            [
                7059,
                7092
            ],
            [
                7092,
                7120
            ],
            [
                7120,
                7146
            ],
            [
                7146,
                7178
            ],
            [
                7178,
                7232
            ],
            [
                7232,
                7240
            ],
            [
                7240,
                7281
            ],
            [
                7281,
                7296
            ],
            [
                7296,
                7370
            ],
            [
                7370,
                7391
            ],
            [
                7391,
                7403
            ],
            [
                7403,
                7481
            ],
            [
                7481,
                7539
            ],
            [
                7539,
                7609
            ],
            [
                7609,
                7651
            ],
            [
                7651,
                7694
            ],
            [
                7694,
                7715
            ],
            [
                7715,
                7743
            ],
            [
                7743,
                7768
            ],
            [
                7768,
                7792
            ],
            [
                7792,
                7856
            ],
            [
                7856,
                7868
            ],
            [
                7868,
                7927
            ],
            [
                7927,
                8027
            ],
            [
                8027,
                8113
            ],
            [
                8113,
                8193
            ],
            [
                8193,
                8206
            ],
            [
                8206,
                8445
            ],
            [
                8445,
                8543
            ],
            [
                8543,
                8565
            ],
            [
                8565,
                8608
            ],
            [
                8608,
                8645
            ],
            [
                8645,
                8704
            ],
            [
                8704,
                8744
            ],
            [
                8744,
                8780
            ],
            [
                8780,
                8845
            ],
            [
                8845,
                8867
            ],
            [
                8867,
                8965
            ],
            [
                8965,
                9131
            ],
            [
                9131,
                9249
            ],
            [
                9249,
                9321
            ],
            [
                9321,
                9371
            ],
            [
                9371,
                9388
            ],
            [
                9388,
                9474
            ],
            [
                9474,
                9523
            ],
            [
                9523,
                9537
            ],
            [
                9537,
                9719
            ],
            [
                9719,
                9868
            ],
            [
                9868,
                9893
            ],
            [
                9893,
                9947
            ],
            [
                9947,
                10038
            ],
            [
                10038,
                10216
            ],
            [
                10216,
                10281
            ],
            [
                10281,
                10327
            ],
            [
                10327,
                10455
            ],
            [
                10455,
                10516
            ],
            [
                10516,
                10609
            ],
            [
                10609,
                10743
            ],
            [
                10743,
                10799
            ],
            [
                10799,
                10865
            ],
            [
                10865,
                10889
            ],
            [
                10889,
                10903
            ],
            [
                10903,
                10989
            ],
            [
                10989,
                11029
            ],
            [
                11029,
                11121
            ],
            [
                11121,
                11219
            ],
            [
                11219,
                11434
            ],
            [
                11434,
                11583
            ],
            [
                11583,
                11598
            ],
            [
                11598,
                11749
            ],
            [
                11749,
                11902
            ],
            [
                11902,
                11948
            ],
            [
                11948,
                12085
            ],
            [
                12085,
                12330
            ],
            [
                12330,
                12586
            ],
            [
                12586,
                12824
            ],
            [
                12824,
                12890
            ],
            [
                12890,
                12978
            ],
            [
                12978,
                13029
            ],
            [
                13029,
                13038
            ],
            [
                13038,
                13099
            ],
            [
                13099,
                13107
            ],
            [
                13107,
                13177
            ],
            [
                13177,
                13303
            ],
            [
                13303,
                13462
            ],
            [
                13462,
                13476
            ],
            [
                13476,
                13537
            ],
            [
                13537,
                13626
            ],
            [
                13626,
                13688
            ],
            [
                13688,
                13738
            ],
            [
                13738,
                13789
            ],
            [
                13789,
                13935
            ],
            [
                13935,
                14058
            ],
            [
                14058,
                14137
            ],
            [
                14137,
                14344
            ],
            [
                14344,
                14457
            ],
            [
                14457,
                14512
            ],
            [
                14512,
                14526
            ],
            [
                14526,
                14570
            ],
            [
                14570,
                14613
            ],
            [
                14613,
                14632
            ],
            [
                14632,
                14737
            ],
            [
                14737,
                14747
            ],
            [
                14747,
                14768
            ],
            [
                14768,
                14818
            ],
            [
                14818,
                14870
            ],
            [
                14870,
                14887
            ],
            [
                14887,
                14920
            ],
            [
                14920,
                14984
            ],
            [
                14984,
                15094
            ],
            [
                15094,
                15144
            ],
            [
                15144,
                15216
            ],
            [
                15216,
                15366
            ],
            [
                15366,
                15513
            ],
            [
                15513,
                15521
            ],
            [
                15521,
                15569
            ],
            [
                15569,
                15651
            ],
            [
                15651,
                15708
            ],
            [
                15708,
                15750
            ],
            [
                15750,
                15769
            ],
            [
                15769,
                15808
            ],
            [
                15808,
                15872
            ],
            [
                15872,
                15886
            ],
            [
                15886,
                15900
            ],
            [
                15900,
                15977
            ],
            [
                15977,
                16085
            ],
            [
                16085,
                16143
            ],
            [
                16143,
                16372
            ],
            [
                16372,
                16437
            ],
            [
                16437,
                16473
            ],
            [
                16473,
                16663
            ],
            [
                16663,
                16735
            ],
            [
                16735,
                16841
            ],
            [
                16841,
                16873
            ],
            [
                16873,
                16918
            ],
            [
                16918,
                16970
            ],
            [
                16970,
                17105
            ],
            [
                17105,
                17205
            ],
            [
                17205,
                17231
            ],
            [
                17231,
                17277
            ],
            [
                17277,
                17301
            ],
            [
                17301,
                17438
            ],
            [
                17438,
                17469
            ],
            [
                17469,
                17525
            ],
            [
                17525,
                17562
            ],
            [
                17562,
                17693
            ],
            [
                17693,
                17800
            ],
            [
                17800,
                17886
            ],
            [
                17886,
                18177
            ],
            [
                18177,
                18311
            ],
            [
                18311,
                18386
            ],
            [
                18386,
                18478
            ],
            [
                18478,
                18668
            ],
            [
                18668,
                18770
            ],
            [
                18770,
                19236
            ],
            [
                19236,
                19410
            ],
            [
                19410,
                19435
            ],
            [
                19435,
                19548
            ],
            [
                19548,
                19567
            ],
            [
                19567,
                19722
            ],
            [
                19722,
                19841
            ],
            [
                19841,
                19995
            ],
            [
                19995,
                20058
            ],
            [
                20058,
                20116
            ],
            [
                20116,
                20184
            ],
            [
                20184,
                20247
            ],
            [
                20247,
                20372
            ],
            [
                20372,
                20401
            ],
            [
                20401,
                20433
            ],
            [
                20433,
                20447
            ],
            [
                20447,
                20483
            ],
            [
                20483,
                20509
            ],
            [
                20509,
                20576
            ],
            [
                20576,
                20650
            ],
            [
                20650,
                20793
            ],
            [
                20793,
                20857
            ],
            [
                20857,
                20889
            ],
            [
                20889,
                20921
            ],
            [
                20921,
                21001
            ],
            [
                21001,
                21150
            ],
            [
                21150,
                21175
            ],
            [
                21175,
                21232
            ],
            [
                21232,
                21311
            ],
            [
                21311,
                21340
            ],
            [
                21340,
                21361
            ],
            [
                21361,
                21375
            ],
            [
                21375,
                21395
            ],
            [
                21395,
                21487
            ],
            [
                21487,
                21804
            ],
            [
                21804,
                21928
            ],
            [
                21928,
                22041
            ],
            [
                22041,
                22047
            ],
            [
                22047,
                22074
            ],
            [
                22074,
                22185
            ],
            [
                22185,
                22296
            ],
            [
                22296,
                22719
            ]
        ]
    },
    "abridged": {
        "text": "I decided that it was my duty to warn Hindley how people talked regarding his bad habits; but I flinched from re-entering his dismal house.\nOne bright, frosty afternoon I passed it on the way to Gimmerton. When I came to a stone sign-post showing the path to the Heights, a gush of child's sensations flowed into my heart. It had been a favourite spot for Hindley and I twenty years before. I gazed at the weather-worn block; and seemed to behold my early playmate seated on the withered turf: his dark, square head bent forward, and his little hand digging.\n'Poor Hindley!' I exclaimed, involuntarily. The child lifted its face and stared straight into mine! It vanished in a twinkling; but immediately I felt a yearning to be at the Heights. Superstition urged me to go: supposing it were a sign of death!\nAs I got nearer to the house I trembled in every limb, for the apparition stood there again, looking through the gate, an elf-haired, brown-eyed boy pressing his face against the bars. Then I realised it was Hareton, my Hareton, not altered greatly since I left him, ten months since.\n'God bless thee, darling!' I cried. 'Hareton, it's Nelly, thy nurse.'\nHe retreated, and picked up a large stone.\n'I am come to see thy father, Hareton,' I added, guessing that he did not remember me.\nHe hurled his missile. It struck my bonnet; and then from the stammering lips of the little fellow came a string of curses, which grieved more than angered me. I took an orange from my pocket, and offered it to him.\n'Who has taught you those fine words, my child?' I inquired. 'The curate?'\n'Damn the curate, and thee! Gie me that,' he replied.\n'Tell us where you got your lessons, and you shall have it,' said I. 'Who's your master?'\n'Devil daddy,' was his answer.\n'And what do you learn from daddy?' I continued.\nHe jumped at the fruit; I raised it higher. 'What does he teach you?' I asked.\n'Naught,' said he, 'but to keep out of his way. Daddy cannot bide me, because I swear at him.'\n'Ah! and the devil teaches you to swear at daddy?' I observed.\n'Ay - nay,' he drawled.\n'Who, then?'\n'Heathcliff.'\nI asked if he liked Mr. Heathcliff.\n'Ay!' he answered. 'He curses daddy for cursing me. He says I can do as I will.'\n'And the curate does not teach you to read and write, then?'\n'No, Heathcliff said the curate should have his ___ teeth dashed down his ___ throat, if he came here!'\nI put the orange in his hand, and bade him tell his father that Nelly Dean was waiting to speak with him. He entered the house; but, instead of Hindley, Heathcliff appeared at the door; and I turned and ran down the road as hard as I could, not stopping till I reached the guide-post.\nThe next time Heathcliff came to the Grange, Isabella was feeding pigeons in the courtyard. On seeing her, he surveyed the house-front. I was standing by the kitchen-window, but I drew out of sight.\nHe then stepped across the pavement to her, and said something: she seemed embarrassed, and wanted to get away, but he laid his hand on her arm. She averted her face: he put some question; and then, after another rapid glance at the house, and supposing himself unseen, the scoundrel had the impudence to embrace her.\n'Judas! Deceiver!' I cried.\n'Who, Nelly?' said Catherine at my elbow.\n'Your worthless friend!' I answered. 'Ah, he has seen us - he is coming in! I wonder if he will try to find an excuse for making love to Miss, after he told you he hated her?'\nWe saw Isabella tear herself free, and run into the garden. A minute later, Heathcliff opened the door. I began to express my indignation; but Catherine angrily threatened to send me out of the kitchen, if I did not hold my tongue.\n'One might think you were the mistress!' she cried. 'Heathcliff, what are you about? Let Isabella alone! - unless you wish Linton to lock the door against you!'\n'God forbid that he should try!' answered the black villain. I detested him just then. 'Every day I grow madder wanting to send him to heaven!'\n'Hush!' said Catherine, shutting the door. 'Don't vex me. Why did you do it?'\n'What is it to you?' he growled. 'I have a right to kiss her, if she chooses; and you have no right to object. I am not your husband: you needn't be jealous of me!'\n'I'm not jealous of you,' replied the mistress; 'I'm jealous for you. Don't scowl at me! If you like Isabella, you shall marry her. But do you like her? Tell the truth, Heathcliff! I'm certain you don't.'\n'You have treated me infernally - infernally!' said Heathcliff. 'Do you hear? And if you think I don't know it, you are a fool; and if you think I can be consoled by sweet words, you are an idiot: and if you fancy I'll suffer unrevenged, I'll convince you of the contrary! Meantime, thank you for telling me Isabella's secret: I'll make the most of it. And stand you aside!'\n'What this?' exclaimed Mrs. Linton, in amazement. 'I've treated you infernally - how? And how will you take revenge, ungrateful brute?'\n'I seek no revenge on you,' replied Heathcliff. 'That's not the plan. The tyrant grinds down his slaves, but they in turn crush those beneath them. You are welcome to torture me to death for your amusement, only allow me to amuse myself a little in the same style. If I imagined you really wished me to marry Isabella, I'd cut my throat!'\n'Oh, the evil is that I am not jealous, is it?' cried Catherine. 'Because you see Edgar and I at peace, secure and tranquil, you are resolved to start a quarrel. Quarrel with Edgar, if you please, Heathcliff, and deceive his sister: you'll hit on exactly the most efficient method of revenging yourself on me.'\nMrs. Linton sat down by the fire, flushed and gloomy. Heathcliff stood on the hearth with folded arms, brooding on his evil thoughts. I left them and went to the master, who was wondering what kept Catherine downstairs so long.\n'Ellen,' said he, 'have you seen your mistress?'\n'Yes; she's in the kitchen, sir,' I answered. 'She's sadly put out by Mr. Heathcliff's behaviour: and, indeed, I think it's time to stop his visits.' And I related the scene in the courtyard. Edgar Linton had difficulty in hearing me to the end.\n'This is insufferable!' he exclaimed. 'It is disgraceful that she should have him for a friend, and force his company on me! Call me two servants out of the hall, Ellen. I have humoured Catherine enough.'\nHe went to the kitchen. Mrs. Linton was scolding Heathcliff with renewed vigour; he had moved to the window, and hung his head. He saw the master first, and made a hasty motion that she should be silent; which she obeyed, abruptly.\n'How is this?' said Linton, addressing her; 'how can you remain here, after the language which that blackguard has used? I suppose you are accustomed to his baseness!'\n'Have you been listening at the door, Edgar?' asked the mistress, in a tone of carelessness and contempt. Heathcliff gave a sneering laugh; but Edgar remained calm.\n'I've been forbearing with you, sir,' he said quietly; 'because I felt you were only partly responsible for your degraded character; and since Catherine wished to keep up your acquaintance, I agreed - foolishly. Your presence is a moral poison; and I deny you admission into this house, and request your instant departure.'\nHeathcliff surveyed him with derision.\n'Cathy, this lamb of yours threatens like a bull!' he said. 'It is in danger of splitting its skull against my knuckles. By God! Mr. Linton, I'm sorry that you are not worth knocking down!'\nMy master signed me to fetch the servants. Mrs. Linton, however, pulled me back, slammed the door, and locked it.\n'Fair means!' she said, in answer to her husband's look of angry surprise. 'If you have not courage to attack him, apologise, or allow yourself to be beaten. No, I'll swallow the key before you shall get it! I have indulged your weak nature, and Heathcliff's bad one, and I earn for thanks blind, stupid ingratitude! Edgar, I was defending you and yours; and I wish Heathcliff may flog you sick, for daring to think an evil thought of me!'\nMr. Edgar tried to wrest the key from her grasp. She flung it into the fire; whereupon he was taken with a nervous trembling, and grew deadly pale. Anguish and humiliation overcame him completely. He leant on a chair, and covered his face.\n'Oh, heavens! We are vanquished!' exclaimed Mrs. Linton. 'Heathcliff would as soon lift a finger at you as the king would march his army against a colony of mice. Cheer up! you shan't be hurt!'\n'I wish you joy of the milk-blooded coward, Cathy!' said Heathcliff. 'That is the shivering thing you preferred to me! I'd like to kick him. Is he weeping, or is he going to faint with fear?'\nHe gave Linton's chair a push. He had better have kept his distance: my master quickly sprang up, and struck him full on the throat a blow that would have levelled a slighter man. It took Heathcliff's breath away, and while he choked, Mr. Linton walked out by the back door.\n'Get away now,' cried Catherine. 'He'll return with a brace of pistols and half-a-dozen men. You've done me an ill turn, Heathcliff! But make haste! I'd rather see Edgar at bay than you.'\n'Do you suppose I'm going with that blow burning in my gullet?' he thundered. 'By hell, no! I'll crush his ribs like a rotten hazel-nut! If I don't floor him now, I shall murder him some time; so let me get at him!'\n'He is not coming,' I interposed, although I was telling a lie. 'There's the coachman and the two gardeners, each with a bludgeon; and master will be watching from the parlour-windows to see them throw you out.'\nThe gardeners and coachman were there, but Linton was with them. Heathcliff, on second thoughts, resolved to avoid a struggle: he seized the poker, smashed the lock from the inner door, and made his escape as they tramped in.\nMrs. Linton excitedly bade me come with her upstairs. She did not know what I had told her husband, and I was anxious to keep her in ignorance.\n'I'm nearly distracted, Nelly!' she exclaimed. 'A thousand hammers are beating in my head! Tell Isabella to shun me; this uproar is owing to her. And, Nelly, say to Edgar that I'm in danger of being seriously ill. I wish it may prove true. He has distressed me shockingly! I want to frighten him. Will you do so, my good Nelly? I am no way to blame in this matter. If Edgar had not listened to our conversation, he would never have been the worse for it. Really, when he used that unreasonable tone after I had scolded Heathcliff for him, I did not care what they did to each other! Well, if I cannot have Heathcliff for a friend - if Edgar will be mean and jealous, I'll break their hearts by breaking my own. That will show them! You must remind Edgar of my passionate temper. I wish you could look more anxious about me.'\nThe stolidity with which I received these instructions was, no doubt, rather exasperating: for she was perfectly sincere; but I believed a person who could plan her fits of passion might manage to control herself, and I did not wish to frighten her husband just to serve her selfishness. Therefore I said nothing when the master came to speak to her.\n'Remain where you are, Catherine,' he said; without anger, but with much sorrow. 'I shall not stay. I wish only to learn whether, after this evening's events, you intend to continue your intimacy with-'\n'Oh, for mercy's sake,' interrupted the mistress, stamping her foot, 'let us hear no more of it now! Your veins are full of ice-water; but mine are boiling, and the sight of your chillness makes them dance.'\n'Answer my question,' persevered Mr. Linton. 'Will you give up Heathcliff, or me? It is impossible for you to be my friend and his; and I require to know which you choose.'\n'I require to be let alone!' exclaimed Catherine, furiously. 'I demand it! Don't you see I can scarcely stand? Leave me!'\nShe rang the bell till it broke with a twang; I entered leisurely. It was enough to try a saint, such senseless, wicked rages! She lay dashing her head against the arm of the sofa, and grinding her teeth, as if she would crash them to splinters!\nMr. Linton stood looking at her in sudden fear. He told me to fetch some water. I brought a glass full; and as she would not drink, I sprinkled it on her face. She stretched herself out stiff, and turned up her eyes like one dead. Linton looked terrified.\n'There is nothing the matter,' I whispered.\n'She has blood on her lips!' he said, shuddering.\n'Never mind!' I answered, tartly. And I told him how she had resolved on exhibiting a fit of frenzy. She heard me; she started up with her eyes flashing, glared about her, and then rushed from the room. The master told me to follow; but she locked her chamber-door against me.\nAs she never came down to breakfast next morning, I went to ask whether she would have some carried up.\n'No!' she replied. The same question was repeated at dinner and tea; and again on the day after, and received the same answer.\nMr. Linton spent his time in the library, and did not inquire about his wife. He spoke to Isabella about Heathcliff's advances: but he could make nothing of her evasive replies, and was obliged to give her a solemn warning, that if she were so insane as to encourage that worthless suitor, he would disown her.",
        "paragraph_chars": [
            [
                0,
                140
            ],
            [
                140,
                559
            ],
            [
                559,
                808
            ],
            [
                808,
                1093
            ],
            [
                1093,
                1163
            ],
            [
                1163,
                1206
            ],
            [
                1206,
                1293
            ],
            [
                1293,
                1509
            ],
            [
                1509,
                1584
            ],
            [
                1584,
                1638
            ],
            [
                1638,
                1728
            ],
            [
                1728,
                1759
            ],
            [
                1759,
                1808
            ],
            [
                1808,
                1887
            ],
            [
                1887,
                1982
            ],
            [
                1982,
                2045
            ],
            [
                2045,
                2069
            ],
            [
                2069,
                2082
            ],
            [
                2082,
                2096
            ],
            [
                2096,
                2132
            ],
            [
                2132,
                2213
            ],
            [
                2213,
                2274
            ],
            [
                2274,
                2378
            ],
            [
                2378,
                2663
            ],
            [
                2663,
                2862
            ],
            [
                2862,
                3180
            ],
            [
                3180,
                3208
            ],
            [
                3208,
                3250
            ],
            [
                3250,
                3426
            ],
            [
                3426,
                3658
            ],
            [
                3658,
                3819
            ],
            [
                3819,
                3963
            ],
            [
                3963,
                4041
            ],
            [
                4041,
                4206
            ],
            [
                4206,
                4411
            ],
            [
                4411,
                4786
            ],
            [
                4786,
                4922
            ],
            [
                4922,
                5261
            ],
            [
                5261,
                5572
            ],
            [
                5572,
                5800
            ],
            [
                5800,
                5849
            ],
            [
                5849,
                6095
            ],
            [
                6095,
                6300
            ],
            [
                6300,
                6532
            ],
            [
                6532,
                6700
            ],
            [
                6700,
                6865
            ],
            [
                6865,
                7189
            ],
            [
                7189,
                7228
            ],
            [
                7228,
                7418
            ],
            [
                7418,
                7532
            ],
            [
                7532,
                7972
            ],
            [
                7972,
                8212
            ],
            [
                8212,
                8406
            ],
            [
                8406,
                8598
            ],
            [
                8598,
                8873
            ],
            [
                8873,
                9061
            ],
            [
                9061,
                9277
            ],
            [
                9277,
                9489
            ],
            [
                9489,
                9715
            ],
            [
                9715,
                9859
            ],
            [
                9859,
                10684
            ],
            [
                10684,
                11035
            ],
            [
                11035,
                11238
            ],
            [
                11238,
                11446
            ],
            [
                11446,
                11619
            ],
            [
                11619,
                11741
            ],
            [
                11741,
                11987
            ],
            [
                11987,
                12243
            ],
            [
                12243,
                12287
            ],
            [
                12287,
                12337
            ],
            [
                12337,
                12614
            ],
            [
                12614,
                12718
            ],
            [
                12718,
                12845
            ],
            [
                12845,
                13155
            ]
        ],
        "segment_chars": [
            [
                0,
                140
            ],
            [
                140,
                206
            ],
            [
                206,
                323
            ],
            [
                323,
                391
            ],
            [
                391,
                559
            ],
            [
                559,
                575
            ],
            [
                575,
                603
            ],
            [
                603,
                660
            ],
            [
                660,
                744
            ],
            [
                744,
                808
            ],
            [
                808,
                993
            ],
            [
                993,
                1093
            ],
            [
                1093,
                1120
            ],
            [
                1120,
                1129
            ],
            [
                1129,
                1163
            ],
            [
                1163,
                1206
            ],
            [
                1206,
                1293
            ],
            [
                1293,
                1316
            ],
            [
                1316,
                1453
            ],
            [
                1453,
                1509
            ],
            [
                1509,
                1558
            ],
            [
                1558,
                1570
            ],
            [
                1570,
                1584
            ],
            [
                1584,
                1612
            ],
            [
                1612,
                1638
            ],
            [
                1638,
                1707
            ],
            [
                1707,
                1728
            ],
            [
                1728,
                1759
            ],
            [
                1759,
                1795
            ],
            [
                1795,
                1808
            ],
            [
                1808,
                1852
            ],
            [
                1852,
                1878
            ],
            [
                1878,
                1887
            ],
            [
                1887,
                1935
            ],
            [
                1935,
                1982
            ],
            [
                1982,
                1987
            ],
            [
                1987,
                2033
            ],
            [
                2033,
                2045
            ],
            [
                2045,
                2069
            ],
            [
                2069,
                2082
            ],
            [
                2082,
                2096
            ],
            [
                2096,
                2132
            ],
            [
                2132,
                2138
            ],
            [
                2138,
                2151
            ],
            [
                2151,
                2184
            ],
            [
                2184,
                2213
            ],
            [
                2213,
                2274
            ],
            [
                2274,
                2378
            ],
            [
                2378,
                2484
            ],
            [
                2484,
                2663
            ],
            [
                2663,
                2755
            ],
            [
                2755,
                2799
            ],
            [
                2799,
                2862
            ],
            [
                2862,
                3007
            ],
            [
                3007,
                3180
            ],
            [
                3180,
                3188
            ],
            [
                3188,
                3199
            ],
            [
                3199,
                3208
            ],
            [
                3208,
                3222
            ],
            [
                3222,
                3250
            ],
            [
                3250,
                3275
            ],
            [
                3275,
                3287
            ],
            [
                3287,
                3326
            ],
            [
                3326,
                3426
            ],
            [
                3426,
                3486
            ],
            [
                3486,
                3530
            ],
            [
                3530,
                3658
            ],
            [
                3658,
                3699
            ],
            [
                3699,
                3710
            ],
            [
                3710,
                3743
            ],
            [
                3743,
                3763
            ],
            [
                3763,
                3819
            ],
            [
                3819,
                3852
            ],
            [
                3852,
                3880
            ],
            [
                3880,
                3906
            ],
            [
                3906,
                3963
            ],
            [
                3963,
                3971
            ],
            [
                3971,
                4006
            ],
            [
                4006,
                4021
            ],
            [
                4021,
                4041
            ],
            [
                4041,
                4062
            ],
            [
                4062,
                4074
            ],
            [
                4074,
                4152
            ],
            [
                4152,
                4206
            ],
            [
                4206,
                4276
            ],
            [
                4276,
                4295
            ],
            [
                4295,
                4338
            ],
            [
                4338,
                4359
            ],
            [
                4359,
                4387
            ],
            [
                4387,
                4411
            ],
            [
                4411,
                4458
            ],
            [
                4458,
                4475
            ],
            [
                4475,
                4489
            ],
            [
                4489,
                4684
            ],
            [
                4684,
                4764
            ],
            [
                4764,
                4786
            ],
            [
                4786,
                4799
            ],
            [
                4799,
                4836
            ],
            [
                4836,
                4872
            ],
            [
                4872,
                4922
            ],
            [
                4922,
                4970
            ],
            [
                4970,
                4992
            ],
            [
                4992,
                5070
            ],
            [
                5070,
                5187
            ],
            [
                5187,
                5261
            ],
            [
                5261,
                5309
            ],
            [
                5309,
                5326
            ],
            [
                5326,
                5423
            ],
            [
                5423,
                5572
            ],
            [
                5572,
                5626
            ],
            [
                5626,
                5706
            ],
            [
                5706,
                5800
            ],
            [
                5800,
                5849
            ],
            [
                5849,
                5895
            ],
            [
                5895,
                5999
            ],
            [
                5999,
                6041
            ],
            [
                6041,
                6095
            ],
            [
                6095,
                6119
            ],
            [
                6119,
                6133
            ],
            [
                6133,
                6220
            ],
            [
                6220,
                6265
            ],
            [
                6265,
                6300
            ],
            [
                6300,
                6324
            ],
            [
                6324,
                6428
            ],
            [
                6428,
                6532
            ],
            [
                6532,
                6547
            ],
            [
                6547,
                6653
            ],
            [
                6653,
                6700
            ],
            [
                6700,
                6746
            ],
            [
                6746,
                6806
            ],
            [
                6806,
                6865
            ],
            [
                6865,
                7077
            ],
            [
                7077,
                7189
            ],
            [
                7189,
                7228
            ],
            [
                7228,
                7279
            ],
            [
                7279,
                7288
            ],
            [
                7288,
                7349
            ],
            [
                7349,
                7357
            ],
            [
                7357,
                7418
            ],
            [
                7418,
                7461
            ],
            [
                7461,
                7532
            ],
            [
                7532,
                7546
            ],
            [
                7546,
                7607
            ],
            [
                7607,
                7690
            ],
            [
                7690,
                7740
            ],
            [
                7740,
                7849
            ],
            [
                7849,
                7972
            ],
            [
                7972,
                8021
            ],
            [
                8021,
                8120
            ],
            [
                8120,
                8169
            ],
            [
                8169,
                8212
            ],
            [
                8212,
                8226
            ],
            [
                8226,
                8246
            ],
            [
                8246,
                8269
            ],
            [
                8269,
                8375
            ],
            [
                8375,
                8385
            ],
            [
                8385,
                8406
            ],
            [
                8406,
                8458
            ],
            [
                8458,
                8475
            ],
            [
                8475,
                8525
            ],
            [
                8525,
                8547
            ],
            [
                8547,
                8598
            ],
            [
                8598,
                8629
            ],
            [
                8629,
                8778
            ],
            [
                8778,
                8873
            ],
            [
                8873,
                8906
            ],
            [
                8906,
                8966
            ],
            [
                8966,
                9006
            ],
            [
                9006,
                9022
            ],
            [
                9022,
                9061
            ],
            [
                9061,
                9125
            ],
            [
                9125,
                9139
            ],
            [
                9139,
                9153
            ],
            [
                9153,
                9198
            ],
            [
                9198,
                9277
            ],
            [
                9277,
                9341
            ],
            [
                9341,
                9489
            ],
            [
                9489,
                9554
            ],
            [
                9554,
                9715
            ],
            [
                9715,
                9769
            ],
            [
                9769,
                9859
            ],
            [
                9859,
                9891
            ],
            [
                9891,
                9906
            ],
            [
                9906,
                9950
            ],
            [
                9950,
                10005
            ],
            [
                10005,
                10073
            ],
            [
                10073,
                10099
            ],
            [
                10099,
                10132
            ],
            [
                10132,
                10156
            ],
            [
                10156,
                10187
            ],
            [
                10187,
                10224
            ],
            [
                10224,
                10314
            ],
            [
                10314,
                10442
            ],
            [
                10442,
                10570
            ],
            [
                10570,
                10591
            ],
            [
                10591,
                10638
            ],
            [
                10638,
                10684
            ],
            [
                10684,
                10972
            ],
            [
                10972,
                11035
            ],
            [
                11035,
                11116
            ],
            [
                11116,
                11135
            ],
            [
                11135,
                11238
            ],
            [
                11238,
                11339
            ],
            [
                11339,
                11446
            ],
            [
                11446,
                11491
            ],
            [
                11491,
                11528
            ],
            [
                11528,
                11619
            ],
            [
                11619,
                11648
            ],
            [
                11648,
                11680
            ],
            [
                11680,
                11694
            ],
            [
                11694,
                11730
            ],
            [
                11730,
                11741
            ],
            [
                11741,
                11808
            ],
            [
                11808,
                11868
            ],
            [
                11868,
                11987
            ],
            [
                11987,
                12035
            ],
            [
                12035,
                12067
            ],
            [
                12067,
                12147
            ],
            [
                12147,
                12218
            ],
            [
                12218,
                12243
            ],
            [
                12243,
                12287
            ],
            [
                12287,
                12316
            ],
            [
                12316,
                12337
            ],
            [
                12337,
                12351
            ],
            [
                12351,
                12371
            ],
            [
                12371,
                12438
            ],
            [
                12438,
                12540
            ],
            [
                12540,
                12614
            ],
            [
                12614,
                12718
            ],
            [
                12718,
                12724
            ],
            [
                12724,
                12737
            ],
            [
                12737,
                12845
            ],
            [
                12845,
                12923
            ],
            [
                12923,
                13155
            ]
        ],
        "overlap_chars": [
            [
                0,
                1
            ],
            [
                10,
                21
            ],
            [
                22,
                24
            ],
            [
                25,
                37
            ],
            [
                46,
                77
            ],
            [
                78,
                88
            ],
            [
                88,
                89
            ],
            [
                94,
                95
            ],
            [
                96,
                121
            ],
            [
                122,
                125
            ],
            [
                126,
                138
            ],
            [
                138,
                140
            ],
            [
                140,
                143
            ],
            [
                150,
                151
            ],
            [
                169,
                177
            ],
            [
                181,
                183
            ],
            [
                184,
                187
            ],
            [
                188,
                191
            ],
            [
                192,
                206
            ],
            [
                211,
                228
            ],
            [
                233,
                238
            ],
            [
                247,
                250
            ],
            [
                256,
                258
            ],
            [
                259,
                271
            ],
            [
                272,
                323
            ],
            [
                323,
                325
            ],
            [
                335,
                351
            ],
            [
                360,
                369
            ],
            [
                370,
                391
            ],
            [
                391,
                398
            ],
            [
                399,
                429
            ],
            [
                447,
                549
            ],
            [
                557,
                558
            ],
            [
                560,
                572
            ],
            [
                575,
                603
            ],
            [
                603,
                660
            ],
            [
                660,
                710
            ],
            [
                713,
                744
            ],
            [
                744,
                768
            ],
            [
                771,
                772
            ],
            [
                773,
                807
            ],
            [
                811,
                816
            ],
            [
                817,
                823
            ],
            [
                824,
                836
            ],
            [
                837,
                861
            ],
            [
                867,
                881
            ],
            [
                882,
                887
            ],
            [
                901,
                925
            ],
            [
                927,
                934
            ],
            [
                940,
                956
            ],
            [
                966,
                969
            ],
            [
                975,
                993
            ],
            [
                1016,
                1024
            ],
            [
                1025,
                1027
            ],
            [
                1028,
                1093
            ],
            [
                1094,
                1117
            ],
            [
                1120,
                1127
            ],
            [
                1127,
                1129
            ],
            [
                1130,
                1149
            ],
            [
                1149,
                1160
            ],
            [
                1163,
                1175
            ],
            [
                1175,
                1198
            ],
            [
                1204,
                1206
            ],
            [
                1207,
                1243
            ],
            [
                1246,
                1263
            ],
            [
                1264,
                1268
            ],
            [
                1276,
                1279
            ],
            [
                1289,
                1293
            ],
            [
                1293,
                1295
            ],
            [
                1303,
                1314
            ],
            [
                1314,
                1315
            ],
            [
                1316,
                1318
            ],
            [
                1319,
                1345
            ],
            [
                1346,
                1391
            ],
            [
                1397,
                1422
            ],
            [
                1423,
                1453
            ],
            [
                1453,
                1503
            ],
            [
                1504,
                1508
            ],
            [
                1510,
                1549
            ],
            [
                1558,
                1570
            ],
            [
                1575,
                1581
            ],
            [
                1590,
                1612
            ],
            [
                1612,
                1623
            ],
            [
                1626,
                1638
            ],
            [
                1644,
                1696
            ],
            [
                1699,
                1707
            ],
            [
                1708,
                1725
            ],
            [
                1735,
                1740
            ],
            [
                1743,
                1759
            ],
            [
                1760,
                1792
            ],
            [
                1795,
                1808
            ],
            [
                1808,
                1852
            ],
            [
                1853,
                1875
            ],
            [
                1878,
                1887
            ],
            [
                1888,
                1894
            ],
            [
                1897,
                1905
            ],
            [
                1907,
                1929
            ],
            [
                1933,
                1935
            ],
            [
                1935,
                1979
            ],
            [
                1983,
                1987
            ],
            [
                1987,
                2030
            ],
            [
                2033,
                2045
            ],
            [
                2046,
                2054
            ],
            [
                2057,
                2069
            ],
            [
                2070,
                2079
            ],
            [
                2083,
                2093
            ],
            [
                2096,
                2130
            ],
            [
                2133,
                2135
            ],
            [
                2138,
                2149
            ],
            [
                2149,
                2150
            ],
            [
                2152,
                2184
            ],
            [
                2184,
                2193
            ],
            [
                2198,
                2210
            ],
            [
                2214,
                2271
            ],
            [
                2275,
                2278
            ],
            [
                2279,
                2289
            ],
            [
                2295,
                2321
            ],
            [
                2326,
                2347
            ],
            [
                2352,
                2365
            ],
            [
                2378,
                2441
            ],
            [
                2442,
                2482
            ],
            [
                2482,
                2484
            ],
            [
                2484,
                2486
            ],
            [
                2487,
                2550
            ],
            [
                2554,
                2562
            ],
            [
                2562,
                2576
            ],
            [
                2577,
                2609
            ],
            [
                2610,
                2617
            ],
            [
                2617,
                2618
            ],
            [
                2632,
                2638
            ],
            [
                2647,
                2661
            ],
            [
                2661,
                2662
            ],
            [
                2663,
                2692
            ],
            [
                2693,
                2695
            ],
            [
                2721,
                2728
            ],
            [
                2729,
                2743
            ],
            [
                2753,
                2755
            ],
            [
                2765,
                2769
            ],
            [
                2770,
                2772
            ],
            [
                2782,
                2799
            ],
            [
                2799,
                2861
            ],
            [
                2862,
                2953
            ],
            [
                2961,
                2963
            ],
            [
                2968,
                2972
            ],
            [
                2972,
                2973
            ],
            [
                2978,
                3007
            ],
            [
                3007,
                3031
            ],
            [
                3032,
                3049
            ],
            [
                3067,
                3180
            ],
            [
                3181,
                3188
            ],
            [
                3199,
                3200
            ],
            [
                3206,
                3207
            ],
            [
                3209,
                3212
            ],
            [
                3212,
                3219
            ],
            [
                3222,
                3236
            ],
            [
                3237,
                3248
            ],
            [
                3248,
                3250
            ],
            [
                3251,
                3272
            ],
            [
                3275,
                3285
            ],
            [
                3285,
                3287
            ],
            [
                3288,
                3298
            ],
            [
                3304,
                3326
            ],
            [
                3326,
                3334
            ],
            [
                3338,
                3340
            ],
            [
                3341,
                3345
            ],
            [
                3350,
                3357
            ],
            [
                3361,
                3392
            ],
            [
                3399,
                3423
            ],
            [
                3429,
                3484
            ],
            [
                3484,
                3485
            ],
            [
                3486,
                3494
            ],
            [
                3500,
                3530
            ],
            [
                3530,
                3531
            ],
            [
                3538,
                3540
            ],
            [
                3549,
                3586
            ],
            [
                3587,
                3600
            ],
            [
                3606,
                3633
            ],
            [
                3647,
                3649
            ],
            [
                3650,
                3658
            ],
            [
                3663,
                3696
            ],
            [
                3699,
                3710
            ],
            [
                3711,
                3741
            ],
            [
                3741,
                3743
            ],
            [
                3743,
                3762
            ],
            [
                3763,
                3764
            ],
            [
                3765,
                3775
            ],
            [
                3776,
                3790
            ],
            [
                3796,
                3799
            ],
            [
                3805,
                3816
            ],
            [
                3820,
                3849
            ],
            [
                3852,
                3880
            ],
            [
                3880,
                3906
            ],
            [
                3907,
                3930
            ],
            [
                3947,
                3960
            ],
            [
                3964,
                3968
            ],
            [
                3971,
                3999
            ],
            [
                4000,
                4006
            ],
            [
                4010,
                4021
            ],
            [
                4021,
                4024
            ],
            [
                4025,
                4028
            ],
            [
                4029,
                4032
            ],
            [
                4042,
                4059
            ],
            [
                4062,
                4074
            ],
            [
                4075,
                4152
            ],
            [
                4152,
                4160
            ],
            [
                4161,
                4165
            ],
            [
                4166,
                4174
            ],
            [
                4175,
                4178
            ],
            [
                4179,
                4203
            ],
            [
                4207,
                4229
            ],
            [
                4232,
                4253
            ],
            [
                4255,
                4276
            ],
            [
                4279,
                4295
            ],
            [
                4295,
                4338
            ],
            [
                4338,
                4359
            ],
            [
                4359,
                4387
            ],
            [
                4387,
                4408
            ],
            [
                4412,
                4455
            ],
            [
                4479,
                4489
            ],
            [
                4489,
                4499
            ],
            [
                4506,
                4513
            ],
            [
                4519,
                4682
            ],
            [
                4682,
                4684
            ],
            [
                4684,
                4718
            ],
            [
                4727,
                4737
            ],
            [
                4738,
                4764
            ],
            [
                4764,
                4783
            ],
            [
                4787,
                4791
            ],
            [
                4792,
                4796
            ],
            [
                4799,
                4836
            ],
            [
                4837,
                4866
            ],
            [
                4876,
                4893
            ],
            [
                4901,
                4919
            ],
            [
                4923,
                4947
            ],
            [
                4950,
                4968
            ],
            [
                4968,
                4970
            ],
            [
                4975,
                4992
            ],
            [
                4992,
                5025
            ],
            [
                5031,
                5035
            ],
            [
                5039,
                5043
            ],
            [
                5044,
                5070
            ],
            [
                5070,
                5185
            ],
            [
                5185,
                5187
            ],
            [
                5187,
                5233
            ],
            [
                5239,
                5258
            ],
            [
                5262,
                5287
            ],
            [
                5288,
                5291
            ],
            [
                5292,
                5306
            ],
            [
                5309,
                5326
            ],
            [
                5335,
                5338
            ],
            [
                5343,
                5348
            ],
            [
                5349,
                5352
            ],
            [
                5353,
                5354
            ],
            [
                5355,
                5364
            ],
            [
                5365,
                5384
            ],
            [
                5384,
                5385
            ],
            [
                5394,
                5402
            ],
            [
                5403,
                5405
            ],
            [
                5412,
                5423
            ],
            [
                5423,
                5569
            ],
            [
                5572,
                5626
            ],
            [
                5626,
                5628
            ],
            [
                5637,
                5704
            ],
            [
                5706,
                5717
            ],
            [
                5718,
                5721
            ],
            [
                5727,
                5729
            ],
            [
                5730,
                5779
            ],
            [
                5791,
                5800
            ],
            [
                5801,
                5806
            ],
            [
                5809,
                5817
            ],
            [
                5819,
                5846
            ],
            [
                5850,
                5880
            ],
            [
                5883,
                5895
            ],
            [
                5899,
                5961
            ],
            [
                5962,
                5980
            ],
            [
                5986,
                5996
            ],
            [
                5999,
                6029
            ],
            [
                6039,
                6041
            ],
            [
                6041,
                6089
            ],
            [
                6093,
                6094
            ],
            [
                6101,
                6116
            ],
            [
                6119,
                6133
            ],
            [
                6134,
                6167
            ],
            [
                6173,
                6220
            ],
            [
                6220,
                6231
            ],
            [
                6241,
                6265
            ],
            [
                6265,
                6280
            ],
            [
                6281,
                6290
            ],
            [
                6291,
                6297
            ],
            [
                6300,
                6302
            ],
            [
                6303,
                6307
            ],
            [
                6308,
                6324
            ],
            [
                6324,
                6335
            ],
            [
                6336,
                6348
            ],
            [
                6351,
                6359
            ],
            [
                6360,
                6383
            ],
            [
                6384,
                6426
            ],
            [
                6426,
                6428
            ],
            [
                6428,
                6530
            ],
            [
                6530,
                6532
            ],
            [
                6533,
                6544
            ],
            [
                6547,
                6575
            ],
            [
                6585,
                6588
            ],
            [
                6589,
                6626
            ],
            [
                6627,
                6642
            ],
            [
                6643,
                6646
            ],
            [
                6651,
                6653
            ],
            [
                6653,
                6662
            ],
            [
                6663,
                6670
            ],
            [
                6682,
                6697
            ],
            [
                6701,
                6743
            ],
            [
                6746,
                6775
            ],
            [
                6776,
                6778
            ],
            [
                6779,
                6804
            ],
            [
                6804,
                6806
            ],
            [
                6806,
                6816
            ],
            [
                6817,
                6838
            ],
            [
                6838,
                6849
            ],
            [
                6863,
                6865
            ],
            [
                6866,
                6875
            ],
            [
                6876,
                6900
            ],
            [
                6903,
                6919
            ],
            [
                6929,
                6972
            ],
            [
                6973,
                6977
            ],
            [
                6978,
                6996
            ],
            [
                6996,
                7001
            ],
            [
                7008,
                7017
            ],
            [
                7025,
                7056
            ],
            [
                7064,
                7065
            ],
            [
                7075,
                7077
            ],
            [
                7077,
                7108
            ],
            [
                7110,
                7113
            ],
            [
                7114,
                7115
            ],
            [
                7116,
                7124
            ],
            [
                7125,
                7155
            ],
            [
                7164,
                7186
            ],
            [
                7189,
                7199
            ],
            [
                7213,
                7217
            ],
            [
                7218,
                7228
            ],
            [
                7229,
                7276
            ],
            [
                7279,
                7288
            ],
            [
                7289,
                7349
            ],
            [
                7349,
                7357
            ],
            [
                7357,
                7372
            ],
            [
                7373,
                7415
            ],
            [
                7418,
                7427
            ],
            [
                7428,
                7450
            ],
            [
                7459,
                7461
            ],
            [
                7461,
                7473
            ],
            [
                7481,
                7482
            ],
            [
                7483,
                7515
            ],
            [
                7515,
                7532
            ],
            [
                7533,
                7543
            ],
            [
                7546,
                7607
            ],
            [
                7608,
                7646
            ],
            [
                7656,
                7690
            ],
            [
                7690,
                7740
            ],
            [
                7747,
                7752
            ],
            [
                7761,
                7777
            ],
            [
                7788,
                7799
            ],
            [
                7804,
                7821
            ],
            [
                7822,
                7827
            ],
            [
                7827,
                7835
            ],
            [
                7836,
                7847
            ],
            [
                7847,
                7849
            ],
            [
                7849,
                7969
            ],
            [
                7974,
                7981
            ],
            [
                7982,
                8009
            ],
            [
                8014,
                8019
            ],
            [
                8021,
                8042
            ],
            [
                8043,
                8058
            ],
            [
                8059,
                8061
            ],
            [
                8062,
                8101
            ],
            [
                8102,
                8120
            ],
            [
                8128,
                8169
            ],
            [
                8169,
                8180
            ],
            [
                8181,
                8212
            ],
            [
                8213,
                8226
            ],
            [
                8226,
                8243
            ],
            [
                8256,
                8268
            ],
            [
                8270,
                8375
            ],
            [
                8375,
                8385
            ],
            [
                8385,
                8391
            ],
            [
                8393,
                8403
            ],
            [
                8407,
                8455
            ],
            [
                8458,
                8462
            ],
            [
                8473,
                8475
            ],
            [
                8481,
                8487
            ],
            [
                8488,
                8525
            ],
            [
                8525,
                8528
            ],
            [
                8537,
                8545
            ],
            [
                8545,
                8547
            ],
            [
                8547,
                8585
            ],
            [
                8591,
                8595
            ],
            [
                8601,
                8605
            ],
            [
                8606,
                8612
            ],
            [
                8615,
                8620
            ],
            [
                8621,
                8629
            ],
            [
                8629,
                8631
            ],
            [
                8636,
                8691
            ],
            [
                8694,
                8778
            ],
            [
                8778,
                8785
            ],
            [
                8799,
                8805
            ],
            [
                8810,
                8811
            ],
            [
                8812,
                8871
            ],
            [
                8871,
                8873
            ],
            [
                8889,
                8906
            ],
            [
                8907,
                8960
            ],
            [
                8964,
                8966
            ],
            [
                8966,
                8972
            ],
            [
                8978,
                9006
            ],
            [
                9006,
                9009
            ],
            [
                9010,
                9022
            ],
            [
                9022,
                9058
            ],
            [
                9065,
                9122
            ],
            [
                9125,
                9139
            ],
            [
                9140,
                9153
            ],
            [
                9153,
                9172
            ],
            [
                9173,
                9196
            ],
            [
                9196,
                9198
            ],
            [
                9198,
                9256
            ],
            [
                9257,
                9274
            ],
            [
                9278,
                9294
            ],
            [
                9297,
                9310
            ],
            [
                9334,
                9341
            ],
            [
                9347,
                9384
            ],
            [
                9384,
                9385
            ],
            [
                9386,
                9390
            ],
            [
                9396,
                9423
            ],
            [
                9424,
                9467
            ],
            [
                9468,
                9472
            ],
            [
                9479,
                9482
            ],
            [
                9489,
                9526
            ],
            [
                9528,
                9554
            ],
            [
                9554,
                9568
            ],
            [
                9569,
                9614
            ],
            [
                9614,
                9715
            ],
            [
                9715,
                9726
            ],
            [
                9727,
                9734
            ],
            [
                9737,
                9744
            ],
            [
                9755,
                9769
            ],
            [
                9769,
                9785
            ],
            [
                9813,
                9859
            ],
            [
                9860,
                9888
            ],
            [
                9891,
                9904
            ],
            [
                9904,
                9906
            ],
            [
                9906,
                9907
            ],
            [
                9907,
                9917
            ],
            [
                9918,
                9950
            ],
            [
                9950,
                10003
            ],
            [
                10003,
                10005
            ],
            [
                10005,
                10029
            ],
            [
                10030,
                10073
            ],
            [
                10073,
                10099
            ],
            [
                10099,
                10105
            ],
            [
                10106,
                10132
            ],
            [
                10132,
                10156
            ],
            [
                10156,
                10187
            ],
            [
                10187,
                10198
            ],
            [
                10208,
                10224
            ],
            [
                10227,
                10232
            ],
            [
                10233,
                10236
            ],
            [
                10253,
                10314
            ],
            [
                10314,
                10329
            ],
            [
                10335,
                10357
            ],
            [
                10358,
                10388
            ],
            [
                10389,
                10412
            ],
            [
                10413,
                10440
            ],
            [
                10440,
                10442
            ],
            [
                10442,
                10459
            ],
            [
                10465,
                10479
            ],
            [
                10482,
                10530
            ],
            [
                10531,
                10570
            ],
            [
                10570,
                10579
            ],
            [
                10589,
                10591
            ],
            [
                10591,
                10599
            ],
            [
                10600,
                10606
            ],
            [
                10613,
                10636
            ],
            [
                10636,
                10638
            ],
            [
                10638,
                10654
            ],
            [
                10655,
                10659
            ],
            [
                10660,
                10681
            ],
            [
                10684,
                10778
            ],
            [
                10779,
                10782
            ],
            [
                10804,
                10844
            ],
            [
                10845,
                10864
            ],
            [
                10865,
                10870
            ],
            [
                10871,
                10896
            ],
            [
                10896,
                10897
            ],
            [
                10898,
                10919
            ],
            [
                10926,
                10928
            ],
            [
                10929,
                10940
            ],
            [
                10946,
                10948
            ],
            [
                10955,
                10972
            ],
            [
                10972,
                11001
            ],
            [
                11002,
                11012
            ],
            [
                11018,
                11020
            ],
            [
                11033,
                11034
            ],
            [
                11043,
                11067
            ],
            [
                11070,
                11086
            ],
            [
                11087,
                11092
            ],
            [
                11092,
                11114
            ],
            [
                11114,
                11116
            ],
            [
                11117,
                11135
            ],
            [
                11135,
                11141
            ],
            [
                11147,
                11235
            ],
            [
                11239,
                11259
            ],
            [
                11262,
                11306
            ],
            [
                11308,
                11339
            ],
            [
                11339,
                11411
            ],
            [
                11412,
                11416
            ],
            [
                11417,
                11443
            ],
            [
                11447,
                11465
            ],
            [
                11468,
                11491
            ],
            [
                11492,
                11519
            ],
            [
                11519,
                11523
            ],
            [
                11524,
                11528
            ],
            [
                11528,
                11558
            ],
            [
                11559,
                11561
            ],
            [
                11562,
                11572
            ],
            [
                11573,
                11576
            ],
            [
                11576,
                11583
            ],
            [
                11584,
                11591
            ],
            [
                11592,
                11616
            ],
            [
                11620,
                11645
            ],
            [
                11648,
                11680
            ],
            [
                11681,
                11694
            ],
            [
                11694,
                11730
            ],
            [
                11730,
                11738
            ],
            [
                11741,
                11808
            ],
            [
                11808,
                11828
            ],
            [
                11829,
                11868
            ],
            [
                11868,
                11945
            ],
            [
                11952,
                11986
            ],
            [
                11987,
                12028
            ],
            [
                12029,
                12035
            ],
            [
                12035,
                12067
            ],
            [
                12067,
                12147
            ],
            [
                12147,
                12202
            ],
            [
                12216,
                12218
            ],
            [
                12218,
                12243
            ],
            [
                12250,
                12260
            ],
            [
                12261,
                12271
            ],
            [
                12274,
                12286
            ],
            [
                12292,
                12313
            ],
            [
                12316,
                12337
            ],
            [
                12338,
                12348
            ],
            [
                12351,
                12371
            ],
            [
                12371,
                12406
            ],
            [
                12407,
                12438
            ],
            [
                12438,
                12451
            ],
            [
                12452,
                12466
            ],
            [
                12472,
                12490
            ],
            [
                12491,
                12507
            ],
            [
                12507,
                12540
            ],
            [
                12540,
                12550
            ],
            [
                12556,
                12569
            ],
            [
                12574,
                12577
            ],
            [
                12585,
                12601
            ],
            [
                12602,
                12614
            ],
            [
                12614,
                12626
            ],
            [
                12637,
                12717
            ],
            [
                12719,
                12721
            ],
            [
                12724,
                12735
            ],
            [
                12735,
                12737
            ],
            [
                12737,
                12803
            ],
            [
                12808,
                12844
            ],
            [
                12845,
                12855
            ],
            [
                12856,
                12906
            ],
            [
                12913,
                12921
            ],
            [
                12921,
                12923
            ],
            [
                12923,
                12925
            ],
            [
                12932,
                12934
            ],
            [
                12935,
                12943
            ],
            [
                12950,
                13041
            ],
            [
                13047,
                13050
            ],
            [
                13051,
                13134
            ],
            [
                13135,
                13137
            ],
            [
                13138,
                13143
            ],
            [
                13154,
                13155
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                140
            ],
            [
                140,
                206
            ],
            [
                206,
                206
            ],
            [
                206,
                323
            ],
            [
                323,
                391
            ],
            [
                391,
                559
            ],
            [
                559,
                575
            ],
            [
                575,
                603
            ],
            [
                603,
                660
            ],
            [
                660,
                744
            ],
            [
                744,
                808
            ],
            [
                808,
                993
            ],
            [
                993,
                1093
            ],
            [
                1093,
                1120
            ],
            [
                1120,
                1129
            ],
            [
                1129,
                1163
            ],
            [
                1163,
                1206
            ],
            [
                1206,
                1293
            ],
            [
                1293,
                1453
            ],
            [
                1453,
                1509
            ],
            [
                1509,
                1509
            ],
            [
                1509,
                1509
            ],
            [
                1509,
                1558
            ],
            [
                1558,
                1570
            ],
            [
                1570,
                1584
            ],
            [
                1584,
                1612
            ],
            [
                1612,
                1638
            ],
            [
                1638,
                1707
            ],
            [
                1707,
                1728
            ],
            [
                1728,
                1759
            ],
            [
                1759,
                1795
            ],
            [
                1795,
                1808
            ],
            [
                1808,
                1852
            ],
            [
                1852,
                1878
            ],
            [
                1878,
                1887
            ],
            [
                1887,
                1935
            ],
            [
                1935,
                1982
            ],
            [
                1982,
                1987
            ],
            [
                1987,
                2033
            ],
            [
                2033,
                2045
            ],
            [
                2045,
                2069
            ],
            [
                2069,
                2082
            ],
            [
                2082,
                2096
            ],
            [
                2096,
                2132
            ],
            [
                2132,
                2138
            ],
            [
                2138,
                2151
            ],
            [
                2151,
                2184
            ],
            [
                2184,
                2213
            ],
            [
                2213,
                2274
            ],
            [
                2274,
                2274
            ],
            [
                2274,
                2378
            ],
            [
                2378,
                2484
            ],
            [
                2484,
                2663
            ],
            [
                2663,
                2663
            ],
            [
                2663,
                2755
            ],
            [
                2755,
                2755
            ],
            [
                2755,
                2755
            ],
            [
                2755,
                2799
            ],
            [
                2799,
                2862
            ],
            [
                2862,
                3007
            ],
            [
                3007,
                3180
            ],
            [
                3180,
                3188
            ],
            [
                3188,
                3188
            ],
            [
                3188,
                3208
            ],
            [
                3208,
                3222
            ],
            [
                3222,
                3250
            ],
            [
                3250,
                3275
            ],
            [
                3275,
                3287
            ],
            [
                3287,
                3326
            ],
            [
                3326,
                3426
            ],
            [
                3426,
                3530
            ],
            [
                3530,
                3658
            ],
            [
                3658,
                3699
            ],
            [
                3699,
                3710
            ],
            [
                3710,
                3710
            ],
            [
                3710,
                3743
            ],
            [
                3743,
                3819
            ],
            [
                3819,
                3852
            ],
            [
                3852,
                3880
            ],
            [
                3880,
                3906
            ],
            [
                3906,
                3906
            ],
            [
                3906,
                3963
            ],
            [
                3963,
                3971
            ],
            [
                3971,
                4006
            ],
            [
                4006,
                4021
            ],
            [
                4021,
                4041
            ],
            [
                4041,
                4062
            ],
            [
                4062,
                4074
            ],
            [
                4074,
                4152
            ],
            [
                4152,
                4206
            ],
            [
                4206,
                4276
            ],
            [
                4276,
                4295
            ],
            [
                4295,
                4338
            ],
            [
                4338,
                4359
            ],
            [
                4359,
                4387
            ],
            [
                4387,
                4387
            ],
            [
                4387,
                4411
            ],
            [
                4411,
                4411
            ],
            [
                4411,
                4411
            ],
            [
                4411,
                4411
            ],
            [
                4411,
                4411
            ],
            [
                4411,
                4411
            ],
            [
                4411,
                4475
            ],
            [
                4475,
                4489
            ],
            [
                4489,
                4684
            ],
            [
                4684,
                4764
            ],
            [
                4764,
                4786
            ],
            [
                4786,
                4799
            ],
            [
                4799,
                4836
            ],
            [
                4836,
                4872
            ],
            [
                4872,
                4922
            ],
            [
                4922,
                4922
            ],
            [
                4922,
                4970
            ],
            [
                4970,
                4992
            ],
            [
                4992,
                5070
            ],
            [
                5070,
                5187
            ],
            [
                5187,
                5187
            ],
            [
                5187,
                5261
            ],
            [
                5261,
                5309
            ],
            [
                5309,
                5326
            ],
            [
                5326,
                5326
            ],
            [
                5326,
                5326
            ],
            [
                5326,
                5326
            ],
            [
                5326,
                5423
            ],
            [
                5423,
                5572
            ],
            [
                5572,
                5572
            ],
            [
                5572,
                5626
            ],
            [
                5626,
                5626
            ],
            [
                5626,
                5800
            ],
            [
                5800,
                5849
            ],
            [
                5849,
                5895
            ],
            [
                5895,
                5999
            ],
            [
                5999,
                5999
            ],
            [
                5999,
                6041
            ],
            [
                6041,
                6041
            ],
            [
                6041,
                6095
            ],
            [
                6095,
                6095
            ],
            [
                6095,
                6119
            ],
            [
                6119,
                6133
            ],
            [
                6133,
                6220
            ],
            [
                6220,
                6265
            ],
            [
                6265,
                6300
            ],
            [
                6300,
                6324
            ],
            [
                6324,
                6428
            ],
            [
                6428,
                6532
            ],
            [
                6532,
                6547
            ],
            [
                6547,
                6653
            ],
            [
                6653,
                6700
            ],
            [
                6700,
                6746
            ],
            [
                6746,
                6806
            ],
            [
                6806,
                6865
            ],
            [
                6865,
                7077
            ],
            [
                7077,
                7189
            ],
            [
                7189,
                7189
            ],
            [
                7189,
                7228
            ],
            [
                7228,
                7279
            ],
            [
                7279,
                7288
            ],
            [
                7288,
                7349
            ],
            [
                7349,
                7357
            ],
            [
                7357,
                7418
            ],
            [
                7418,
                7461
            ],
            [
                7461,
                7532
            ],
            [
                7532,
                7546
            ],
            [
                7546,
                7607
            ],
            [
                7607,
                7690
            ],
            [
                7690,
                7690
            ],
            [
                7690,
                7740
            ],
            [
                7740,
                7740
            ],
            [
                7740,
                7849
            ],
            [
                7849,
                7972
            ],
            [
                7972,
                7972
            ],
            [
                7972,
                8120
            ],
            [
                8120,
                8169
            ],
            [
                8169,
                8212
            ],
            [
                8212,
                8226
            ],
            [
                8226,
                8226
            ],
            [
                8226,
                8269
            ],
            [
                8269,
                8269
            ],
            [
                8269,
                8375
            ],
            [
                8375,
                8385
            ],
            [
                8385,
                8406
            ],
            [
                8406,
                8406
            ],
            [
                8406,
                8458
            ],
            [
                8458,
                8475
            ],
            [
                8475,
                8475
            ],
            [
                8475,
                8525
            ],
            [
                8525,
                8547
            ],
            [
                8547,
                8598
            ],
            [
                8598,
                8629
            ],
            [
                8629,
                8778
            ],
            [
                8778,
                8873
            ],
            [
                8873,
                8873
            ],
            [
                8873,
                8906
            ],
            [
                8906,
                8966
            ],
            [
                8966,
                8966
            ],
            [
                8966,
                9006
            ],
            [
                9006,
                9022
            ],
            [
                9022,
                9061
            ],
            [
                9061,
                9125
            ],
            [
                9125,
                9139
            ],
            [
                9139,
                9153
            ],
            [
                9153,
                9198
            ],
            [
                9198,
                9277
            ],
            [
                9277,
                9341
            ],
            [
                9341,
                9489
            ],
            [
                9489,
                9554
            ],
            [
                9554,
                9554
            ],
            [
                9554,
                9715
            ],
            [
                9715,
                9769
            ],
            [
                9769,
                9859
            ],
            [
                9859,
                9891
            ],
            [
                9891,
                9906
            ],
            [
                9906,
                9950
            ],
            [
                9950,
                10005
            ],
            [
                10005,
                10073
            ],
            [
                10073,
                10099
            ],
            [
                10099,
                10132
            ],
            [
                10132,
                10156
            ],
            [
                10156,
                10156
            ],
            [
                10156,
                10187
            ],
            [
                10187,
                10224
            ],
            [
                10224,
                10224
            ],
            [
                10224,
                10224
            ],
            [
                10224,
                10224
            ],
            [
                10224,
                10314
            ],
            [
                10314,
                10442
            ],
            [
                10442,
                10570
            ],
            [
                10570,
                10591
            ],
            [
                10591,
                10591
            ],
            [
                10591,
                10638
            ],
            [
                10638,
                10684
            ],
            [
                10684,
                10972
            ],
            [
                10972,
                11035
            ],
            [
                11035,
                11035
            ],
            [
                11035,
                11116
            ],
            [
                11116,
                11135
            ],
            [
                11135,
                11238
            ],
            [
                11238,
                11339
            ],
            [
                11339,
                11446
            ],
            [
                11446,
                11491
            ],
            [
                11491,
                11491
            ],
            [
                11491,
                11491
            ],
            [
                11491,
                11528
            ],
            [
                11528,
                11619
            ],
            [
                11619,
                11648
            ],
            [
                11648,
                11680
            ],
            [
                11680,
                11694
            ],
            [
                11694,
                11730
            ],
            [
                11730,
                11741
            ],
            [
                11741,
                11808
            ],
            [
                11808,
                11868
            ],
            [
                11868,
                11987
            ],
            [
                11987,
                12035
            ],
            [
                12035,
                12067
            ],
            [
                12067,
                12067
            ],
            [
                12067,
                12147
            ],
            [
                12147,
                12218
            ],
            [
                12218,
                12243
            ],
            [
                12243,
                12287
            ],
            [
                12287,
                12287
            ],
            [
                12287,
                12316
            ],
            [
                12316,
                12337
            ],
            [
                12337,
                12351
            ],
            [
                12351,
                12371
            ],
            [
                12371,
                12438
            ],
            [
                12438,
                12540
            ],
            [
                12540,
                12614
            ],
            [
                12614,
                12718
            ],
            [
                12718,
                12724
            ],
            [
                12724,
                12737
            ],
            [
                12737,
                12845
            ],
            [
                12845,
                12923
            ],
            [
                12923,
                13155
            ]
        ]
    }
}