{
    "original": {
        "text": "While Miss Linton moped about the park and garden, always silent, and almost always in tears; and her brother shut himself up among books that he never opened-wearying, I guessed, with a continual vague expectation that Catherine, repenting her conduct, would come of her own accord to ask pardon, and seek a reconciliation-and _she_ fasted pertinaciously, under the idea, probably, that at every meal Edgar was ready to choke for her absence, and pride alone held him from running to cast himself at her feet; I went about my household duties, convinced that the Grange had but one sensible soul in its walls, and that lodged in my body. I wasted no condolences on Miss, nor any expostulations on my mistress; nor did I pay much attention to the sighs of my master, who yearned to hear his lady's name, since he might not hear her voice. I determined they should come about as they pleased for me; and though it was a tiresomely slow process, I began to rejoice at length in a faint dawn of its progress: as I thought at first.\nMrs. Linton, on the third day, unbarred her door, and having finished the water in her pitcher and decanter, desired a renewed supply, and a basin of gruel, for she believed she was dying. That I set down as a speech meant for Edgar's ears; I believed no such thing, so I kept it to myself and brought her some tea and dry toast. She ate and drank eagerly, and sank back on her pillow again, clenching her hands and groaning. \"Oh, I will die,\" she exclaimed, \"since no one cares anything about me. I wish I had not taken that.\" Then a good while after I heard her murmur, \"No, I'll not die-he'd be glad-he does not love me at all-he would never miss me!\"\n\"Did you want anything, ma'am?\" I inquired, still preserving my external composure, in spite of her ghastly countenance and strange, exaggerated manner.\n\"What is that apathetic being doing?\" she demanded, pushing the thick entangled locks from her wasted face. \"Has he fallen into a lethargy, or is he dead?\"\n\"Neither,\" replied I; \"if you mean Mr. Linton. He's tolerably well, I think, though his studies occupy him rather more than they ought: he is continually among his books, since he has no other society.\"\nI should not have spoken so if I had known her true condition, but I could not get rid of the notion that she acted a part of her disorder.\n\"Among his books!\" she cried, confounded. \"And I dying! I on the brink of the grave! My God! does he know how I'm altered?\" continued she, staring at her reflection in a mirror hanging against the opposite wall. \"Is that Catherine Linton? He imagines me in a pet-in play, perhaps. Cannot you inform him that it is frightful earnest? Nelly, if it be not too late, as soon as I learn how he feels, I'll choose between these two: either to starve at once-that would be no punishment unless he had a heart-or to recover, and leave the country. Are you speaking the truth about him now? Take care. Is he actually so utterly indifferent for my life?\"\n\"Why, ma'am,\" I answered, \"the master has no idea of your being deranged; and of course he does not fear that you will let yourself die of hunger.\"\n\"You think not? Cannot you tell him I will?\" she returned. \"Persuade him! speak of your own mind: say you are certain I will!\"\n\"No, you forget, Mrs. Linton,\" I suggested, \"that you have eaten some food with a relish this evening, and to-morrow you will perceive its good effects.\"\n\"If I were only sure it would kill him,\" she interrupted, \"I'd kill myself directly! These three awful nights I've never closed my lids-and oh, I've been tormented! I've been haunted, Nelly! But I begin to fancy you don't like me. How strange! I thought, though everybody hated and despised each other, they could not avoid loving me. And they have all turned to enemies in a few hours: they have, I'm positive; the people here. How dreary to meet death, surrounded by their cold faces! Isabella, terrified and repelled, afraid to enter the room, it would be so dreadful to watch Catherine go. And Edgar standing solemnly by to see it over; then offering prayers of thanks to God for restoring peace to his house, and going back to his _books_! What in the name of all that feels has he to do with _books_, when I am dying?\"\nShe could not bear the notion which I had put into her head of Mr. Linton's philosophical resignation. Tossing about, she increased her feverish bewilderment to madness, and tore the pillow with her teeth; then raising herself up all burning, desired that I would open the window. We were in the middle of winter, the wind blew strong from the north-east, and I objected. Both the expressions flitting over her face, and the changes of her moods, began to alarm me terribly; and brought to my recollection her former illness, and the doctor's injunction that she should not be crossed. A minute previously she was violent; now, supported on one arm, and not noticing my refusal to obey her, she seemed to find childish diversion in pulling the feathers from the rents she had just made, and ranging them on the sheet according to their different species: her mind had strayed to other associations.\n\"That's a turkey's,\" she murmured to herself; \"and this is a wild duck's; and this is a pigeon's. Ah, they put pigeons' feathers in the pillows-no wonder I couldn't die! Let me take care to throw it on the floor when I lie down. And here is a moor-cock's; and this-I should know it among a thousand-it's a lapwing's. Bonny bird; wheeling over our heads in the middle of the moor. It wanted to get to its nest, for the clouds had touched the swells, and it felt rain coming. This feather was picked up from the heath, the bird was not shot: we saw its nest in the winter, full of little skeletons. Heathcliff set a trap over it, and the old ones dared not come. I made him promise he'd never shoot a lapwing after that, and he didn't. Yes, here are more! Did he shoot my lapwings, Nelly? Are they red, any of them? Let me look.\"\n\"Give over with that baby-work!\" I interrupted, dragging the pillow away, and turning the holes towards the mattress, for she was removing its contents by handfuls. \"Lie down and shut your eyes: you're wandering. There's a mess! The down is flying about like snow.\"\nI went here and there collecting it.\n\"I see in you, Nelly,\" she continued dreamily, \"an aged woman: you have grey hair and bent shoulders. This bed is the fairy cave under Penistone Crags, and you are gathering elf-bolts to hurt our heifers; pretending, while I am near, that they are only locks of wool. That's what you'll come to fifty years hence: I know you are not so now. I'm not wandering: you're mistaken, or else I should believe you really _were_ that withered hag, and I should think I _was_ under Penistone Crags; and I'm conscious it's night, and there are two candles on the table making the black press shine like jet.\"\n\"The black press? where is that?\" I asked. \"You are talking in your sleep!\"\n\"It's against the wall, as it always is,\" she replied. \"It _does_ appear odd-I see a face in it!\"\n\"There's no press in the room, and never was,\" said I, resuming my seat, and looping up the curtain that I might watch her.\n\"Don't _you_ see that face?\" she inquired, gazing earnestly at the mirror.\nAnd say what I could, I was incapable of making her comprehend it to be her own; so I rose and covered it with a shawl.\n\"It's behind there still!\" she pursued, anxiously. \"And it stirred. Who is it? I hope it will not come out when you are gone! Oh! Nelly, the room is haunted! I'm afraid of being alone!\"\nI took her hand in mine, and bid her be composed; for a succession of shudders convulsed her frame, and she would keep straining her gaze towards the glass.\n\"There's nobody here!\" I insisted. \"It was _yourself_, Mrs. Linton: you knew it a while since.\"\n\"Myself!\" she gasped, \"and the clock is striking twelve! It's true, then! that's dreadful!\"\nHer fingers clutched the clothes, and gathered them over her eyes. I attempted to steal to the door with an intention of calling her husband; but I was summoned back by a piercing shriek-the shawl had dropped from the frame.\n\"Why, what is the matter?\" cried I. \"Who is coward now? Wake up! That is the glass-the mirror, Mrs. Linton; and you see yourself in it, and there am I too by your side.\"\nTrembling and bewildered, she held me fast, but the horror gradually passed from her countenance; its paleness gave place to a glow of shame.\n\"Oh, dear! I thought I was at home,\" she sighed. \"I thought I was lying in my chamber at Wuthering Heights. Because I'm weak, my brain got confused, and I screamed unconsciously. Don't say anything; but stay with me. I dread sleeping: my dreams appal me.\"\n\"A sound sleep would do you good, ma'am,\" I answered: \"and I hope this suffering will prevent your trying starving again.\"\n\"Oh, if I were but in my own bed in the old house!\" she went on bitterly, wringing her hands. \"And that wind sounding in the firs by the lattice. Do let me feel it-it comes straight down the moor-do let me have one breath!\" To pacify her I held the casement ajar a few seconds. A cold blast rushed through; I closed it, and returned to my post. She lay still now, her face bathed in tears. Exhaustion of body had entirely subdued her spirit: our fiery Catherine was no better than a wailing child.\n\"How long is it since I shut myself in here?\" she asked, suddenly reviving.\n\"It was Monday evening,\" I replied, \"and this is Thursday night, or rather Friday morning, at present.\"\n\"What! of the same week?\" she exclaimed. \"Only that brief time?\"\n\"Long enough to live on nothing but cold water and ill-temper,\" observed I.\n\"Well, it seems a weary number of hours,\" she muttered doubtfully: \"it must be more. I remember being in the parlour after they had quarrelled, and Edgar being cruelly provoking, and me running into this room desperate. As soon as ever I had barred the door, utter blackness overwhelmed me, and I fell on the floor. I couldn't explain to Edgar how certain I felt of having a fit, or going raging mad, if he persisted in teasing me! I had no command of tongue, or brain, and he did not guess my agony, perhaps: it barely left me sense to try to escape from him and his voice. Before I recovered sufficiently to see and hear, it began to be dawn, and, Nelly, I'll tell you what I thought, and what has kept recurring and recurring till I feared for my reason. I thought as I lay there, with my head against that table leg, and my eyes dimly discerning the grey square of the window, that I was enclosed in the oak-panelled bed at home; and my heart ached with some great grief which, just waking, I could not recollect. I pondered, and worried myself to discover what it could be, and, most strangely, the whole last seven years of my life grew a blank! I did not recall that they had been at all. I was a child; my father was just buried, and my misery arose from the separation that Hindley had ordered between me and Heathcliff. I was laid alone, for the first time; and, rousing from a dismal doze after a night of weeping, I lifted my hand to push the panels aside: it struck the table-top! I swept it along the carpet, and then memory burst in: my late anguish was swallowed in a paroxysm of despair. I cannot say why I felt so wildly wretched: it must have been temporary derangement; for there is scarcely cause. But, supposing at twelve years old I had been wrenched from the Heights, and every early association, and my all in all, as Heathcliff was at that time, and been converted at a stroke into Mrs. Linton, the lady of Thrushcross Grange, and the wife of a stranger: an exile, and outcast, thenceforth, from what had been my world. You may fancy a glimpse of the abyss where I grovelled! Shake your head as you will, Nelly, you have helped to unsettle me! You should have spoken to Edgar, indeed you should, and compelled him to leave me quiet! Oh, I'm burning! I wish I were out of doors! I wish I were a girl again, half savage and hardy, and free; and laughing at injuries, not maddening under them! Why am I so changed? why does my blood rush into a hell of tumult at a few words? I'm sure I should be myself were I once among the heather on those hills. Open the window again wide: fasten it open! Quick, why don't you move?\"\n\"Because I won't give you your death of cold,\" I answered.\n\"You won't give me a chance of life, you mean,\" she said, sullenly. \"However, I'm not helpless yet; I'll open it myself.\"\nAnd sliding from the bed before I could hinder her, she crossed the room, walking very uncertainly, threw it back, and bent out, careless of the frosty air that cut about her shoulders as keen as a knife. I entreated, and finally attempted to force her to retire. But I soon found her delirious strength much surpassed mine (she was delirious, I became convinced by her subsequent actions and ravings). There was no moon, and everything beneath lay in misty darkness: not a light gleamed from any house, far or near all had been extinguished long ago: and those at Wuthering Heights were never visible-still she asserted she caught their shining.\n\"Look!\" she cried eagerly, \"that's my room with the candle in it, and the trees swaying before it; and the other candle is in Joseph's garret. Joseph sits up late, doesn't he? He's waiting till I come home that he may lock the gate. Well, he'll wait a while yet. It's a rough journey, and a sad heart to travel it; and we must pass by Gimmerton Kirk to go that journey! We've braved its ghosts often together, and dared each other to stand among the graves and ask them to come. But, Heathcliff, if I dare you now, will you venture? If you do, I'll keep you. I'll not lie there by myself: they may bury me twelve feet deep, and throw the church down over me, but I won't rest till you are with me. I never will!\"\nShe paused, and resumed with a strange smile. \"He's considering-he'd rather I'd come to him! Find a way, then! not through that kirkyard. You are slow! Be content, you always followed me!\"\nPerceiving it vain to argue against her insanity, I was planning how I could reach something to wrap about her, without quitting my hold of herself (for I could not trust her alone by the gaping lattice), when, to my consternation, I heard the rattle of the door-handle, and Mr. Linton entered. He had only then come from the library; and, in passing through the lobby, had noticed our talking and been attracted by curiosity, or fear, to examine what it signified, at that late hour.\n\"Oh, sir!\" I cried, checking the exclamation risen to his lips at the sight which met him, and the bleak atmosphere of the chamber. \"My poor mistress is ill, and she quite masters me: I cannot manage her at all; pray, come and persuade her to go to bed. Forget your anger, for she's hard to guide any way but her own.\"\n\"Catherine ill?\" he said, hastening to us. \"Shut the window, Ellen! Catherine! why-\"\nHe was silent. The haggardness of Mrs. Linton's appearance smote him speechless, and he could only glance from her to me in horrified astonishment.\n\"She's been fretting here,\" I continued, \"and eating scarcely anything, and never complaining: she would admit none of us till this evening, and so we couldn't inform you of her state, as we were not aware of it ourselves; but it is nothing.\"\nI felt I uttered my explanations awkwardly; the master frowned. \"It is nothing, is it, Ellen Dean?\" he said sternly. \"You shall account more clearly for keeping me ignorant of this!\" And he took his wife in his arms, and looked at her with anguish.\nAt first she gave him no glance of recognition: he was invisible to her abstracted gaze. The delirium was not fixed, however; having weaned her eyes from contemplating the outer darkness, by degrees she centred her attention on him, and discovered who it was that held her.\n\"Ah! you are come, are you, Edgar Linton?\" she said, with angry animation. \"You are one of those things that are ever found when least wanted, and when you are wanted, never! I suppose we shall have plenty of lamentations now-I see we shall-but they can't keep me from my narrow home out yonder: my resting-place, where I'm bound before spring is over! There it is: not among the Lintons, mind, under the chapel-roof, but in the open air, with a head-stone; and you may please yourself whether you go to them or come to me!\"\n\"Catherine, what have you done?\" commenced the master. \"Am I nothing to you any more? Do you love that wretch Heath-\"\n\"Hush!\" cried Mrs. Linton. \"Hush, this moment! You mention that name and I end the matter instantly by a spring from the window! What you touch at present you may have; but my soul will be on that hill top before you lay hands on me again. I don't want you, Edgar: I'm past wanting you. Return to your books. I'm glad you possess a consolation, for all you had in me is gone.\"\n\"Her mind wanders, sir,\" I interposed. \"She has been talking nonsense the whole evening; but let her have quiet, and proper attendance, and she'll rally. Hereafter, we must be cautious how we vex her.\"\n\"I desire no further advice from you,\" answered Mr. Linton. \"You knew your mistress's nature, and you encouraged me to harass her. And not to give me one hint of how she has been these three days! It was heartless! Months of sickness could not cause such a change!\"\nI began to defend myself, thinking it too bad to be blamed for another's wicked waywardness. \"I knew Mrs. Linton's nature to be headstrong and domineering,\" cried I: \"but I didn't know that you wished to foster her fierce temper! I didn't know that, to humour her, I should wink at Mr. Heathcliff. I performed the duty of a faithful servant in telling you, and I have got a faithful servant's wages! Well, it will teach me to be careful next time. Next time you may gather intelligence for yourself!\"\n\"The next time you bring a tale to me you shall quit my service, Ellen Dean,\" he replied.\n\"You'd rather hear nothing about it, I suppose, then, Mr. Linton?\" said I. \"Heathcliff has your permission to come a-courting to Miss, and to drop in at every opportunity your absence offers, on purpose to poison the mistress against you?\"\nConfused as Catherine was, her wits were alert at applying our conversation.\n\"Ah! Nelly has played traitor,\" she exclaimed, passionately. \"Nelly is my hidden enemy. You witch! So you do seek elf-bolts to hurt us! Let me go, and I'll make her rue! I'll make her howl a recantation!\"\nA maniac's fury kindled under her brows; she struggled desperately to disengage herself from Linton's arms. I felt no inclination to tarry the event; and, resolving to seek medical aid on my own responsibility, I quitted the chamber.\nIn passing the garden to reach the road, at a place where a bridle hook is driven into the wall, I saw something white moved irregularly, evidently by another agent than the wind. Notwithstanding my hurry, I stayed to examine it, lest ever after I should have the conviction impressed on my imagination that it was a creature of the other world. My surprise and perplexity were great on discovering, by touch more than vision, Miss Isabella's springer, Fanny, suspended by a handkerchief, and nearly at its last gasp. I quickly released the animal, and lifted it into the garden. I had seen it follow its mistress upstairs when she went to bed; and wondered much how it could have got out there, and what mischievous person had treated it so. While untying the knot round the hook, it seemed to me that I repeatedly caught the beat of horses' feet galloping at some distance; but there were such a number of things to occupy my reflections that I hardly gave the circumstance a thought: though it was a strange sound, in that place, at two o'clock in the morning.\nMr. Kenneth was fortunately just issuing from his house to see a patient in the village as I came up the street; and my account of Catherine Linton's malady induced him to accompany me back immediately. He was a plain rough man; and he made no scruple to speak his doubts of her surviving this second attack; unless she were more submissive to his directions than she had shown herself before.\n\"Nelly Dean,\" said he, \"I can't help fancying there's an extra cause for this. What has there been to do at the Grange? We've odd reports up here. A stout, hearty lass like Catherine does not fall ill for a trifle; and that sort of people should not either. It's hard work bringing them through fevers, and such things. How did it begin?\"\n\"The master will inform you,\" I answered; \"but you are acquainted with the Earnshaws' violent dispositions, and Mrs. Linton caps them all. I may say this; it commenced in a quarrel. She was struck during a tempest of passion with a kind of fit. That's her account, at least: for she flew off in the height of it, and locked herself up. Afterwards, she refused to eat, and now she alternately raves and remains in a half dream; knowing those about her, but having her mind filled with all sorts of strange ideas and illusions.\"\n\"Mr. Linton will be sorry?\" observed Kenneth, interrogatively.\n\"Sorry? he'll break his heart should anything happen!\" I replied. \"Don't alarm him more than necessary.\"\n\"Well, I told him to beware,\" said my companion; \"and he must bide the consequences of neglecting my warning! Hasn't he been intimate with Mr. Heathcliff lately?\"\n\"Heathcliff frequently visits at the Grange,\" answered I, \"though more on the strength of the mistress having known him when a boy, than because the master likes his company. At present he's discharged from the trouble of calling; owing to some presumptuous aspirations after Miss Linton which he manifested. I hardly think he'll be taken in again.\"\n\"And does Miss Linton turn a cold shoulder on him?\" was the doctor's next question.\n\"I'm not in her confidence,\" returned I, reluctant to continue the subject.\n\"No, she's a sly one,\" he remarked, shaking his head. \"She keeps her own counsel! But she's a real little fool. I have it from good authority that last night (and a pretty night it was!) she and Heathcliff were walking in the plantation at the back of your house above two hours; and he pressed her not to go in again, but just mount his horse and away with him! My informant said she could only put him off by pledging her word of honour to be prepared on their first meeting after that: when it was to be he didn't hear; but you urge Mr. Linton to look sharp!\"\nThis news filled me with fresh fears; I outstripped Kenneth, and ran most of the way back. The little dog was yelping in the garden yet. I spared a minute to open the gate for it, but instead of going to the house door, it coursed up and down snuffing the grass, and would have escaped to the road, had I not seized it and conveyed it in with me. On ascending to Isabella's room, my suspicions were confirmed: it was empty. Had I been a few hours sooner Mrs. Linton's illness might have arrested her rash step. But what could be done now? There was a bare possibility of overtaking them if pursued instantly. _I_ could not pursue them, however; and I dared not rouse the family, and fill the place with confusion; still less unfold the business to my master, absorbed as he was in his present calamity, and having no heart to spare for a second grief! I saw nothing for it but to hold my tongue, and suffer matters to take their course; and Kenneth being arrived, I went with a badly composed countenance to announce him. Catherine lay in a troubled sleep: her husband had succeeded in soothing the excess of frenzy; he now hung over her pillow, watching every shade and every change of her painfully expressive features.\nThe doctor, on examining the case for himself, spoke hopefully to him of its having a favourable termination, if we could only preserve around her perfect and constant tranquillity. To me, he signified the threatening danger was not so much death, as permanent alienation of intellect.\nI did not close my eyes that night, nor did Mr. Linton: indeed, we never went to bed; and the servants were all up long before the usual hour, moving through the house with stealthy tread, and exchanging whispers as they encountered each other in their vocations. Every one was active but Miss Isabella; and they began to remark how sound she slept: her brother, too, asked if she had risen, and seemed impatient for her presence, and hurt that she showed so little anxiety for her sister-in-law. I trembled lest he should send me to call her; but I was spared the pain of being the first proclaimant of her flight. One of the maids, a thoughtless girl, who had been on an early errand to Gimmerton, came panting upstairs, open-mouthed, and dashed into the chamber, crying: \"Oh, dear, dear! What mun we have next? Master, master, our young lady-\"\n\"Hold your noise!\" cried I hastily, enraged at her clamorous manner.\n\"Speak lower, Mary-What is the matter?\" said Mr. Linton. \"What ails your young lady?\"\n\"She's gone, she's gone! Yon' Heathcliff's run off wi' her!\" gasped the girl.\n\"That is not true!\" exclaimed Linton, rising in agitation. \"It cannot be: how has the idea entered your head? Ellen Dean, go and seek her. It is incredible: it cannot be.\"\nAs he spoke he took the servant to the door, and then repeated his demand to know her reasons for such an assertion.\n\"Why, I met on the road a lad that fetches milk here,\" she stammered, \"and he asked whether we weren't in trouble at the Grange. I thought he meant for missis's sickness, so I answered, yes. Then says he, 'There's somebody gone after 'em, I guess?' I stared. He saw I knew nought about it, and he told how a gentleman and lady had stopped to have a horse's shoe fastened at a blacksmith's shop, two miles out of Gimmerton, not very long after midnight! and how the blacksmith's lass had got up to spy who they were: she knew them both directly. And she noticed the man-Heathcliff it was, she felt certain: nob'dy could mistake him, besides-put a sovereign in her father's hand for payment. The lady had a cloak about her face; but having desired a sup of water, while she drank it fell back, and she saw her very plain. Heathcliff held both bridles as they rode on, and they set their faces from the village, and went as fast as the rough roads would let them. The lass said nothing to her father, but she told it all over Gimmerton this morning.\"\nI ran and peeped, for form's sake, into Isabella's room; confirming, when I returned, the servant's statement. Mr. Linton had resumed his seat by the bed; on my re-entrance, he raised his eyes, read the meaning of my blank aspect, and dropped them without giving an order, or uttering a word.\n\"Are we to try any measures for overtaking and bringing her back,\" I inquired. \"How should we do?\"\n\"She went of her own accord,\" answered the master; \"she had a right to go if she pleased. Trouble me no more about her. Hereafter she is only my sister in name: not because I disown her, but because she has disowned me.\"\nAnd that was all he said on the subject: he did not make single inquiry further, or mention her in any way, except directing me to send what property she had in the house to her fresh home, wherever it was, when I knew it.",
        "paragraph_chars": [
            [
                0,
                1029
            ],
            [
                1029,
                1684
            ],
            [
                1684,
                1837
            ],
            [
                1837,
                1993
            ],
            [
                1993,
                2196
            ],
            [
                2196,
                2336
            ],
            [
                2336,
                2981
            ],
            [
                2981,
                3129
            ],
            [
                3129,
                3256
            ],
            [
                3256,
                3410
            ],
            [
                3410,
                4235
            ],
            [
                4235,
                5134
            ],
            [
                5134,
                5962
            ],
            [
                5962,
                6228
            ],
            [
                6228,
                6265
            ],
            [
                6265,
                6863
            ],
            [
                6863,
                6939
            ],
            [
                6939,
                7037
            ],
            [
                7037,
                7161
            ],
            [
                7161,
                7236
            ],
            [
                7236,
                7356
            ],
            [
                7356,
                7542
            ],
            [
                7542,
                7699
            ],
            [
                7699,
                7795
            ],
            [
                7795,
                7887
            ],
            [
                7887,
                8112
            ],
            [
                8112,
                8282
            ],
            [
                8282,
                8424
            ],
            [
                8424,
                8680
            ],
            [
                8680,
                8803
            ],
            [
                8803,
                9301
            ],
            [
                9301,
                9377
            ],
            [
                9377,
                9481
            ],
            [
                9481,
                9546
            ],
            [
                9546,
                9622
            ],
            [
                9622,
                12267
            ],
            [
                12267,
                12326
            ],
            [
                12326,
                12448
            ],
            [
                12448,
                13095
            ],
            [
                13095,
                13808
            ],
            [
                13808,
                13997
            ],
            [
                13997,
                14482
            ],
            [
                14482,
                14801
            ],
            [
                14801,
                14886
            ],
            [
                14886,
                15034
            ],
            [
                15034,
                15277
            ],
            [
                15277,
                15526
            ],
            [
                15526,
                15800
            ],
            [
                15800,
                16325
            ],
            [
                16325,
                16443
            ],
            [
                16443,
                16820
            ],
            [
                16820,
                17022
            ],
            [
                17022,
                17288
            ],
            [
                17288,
                17789
            ],
            [
                17789,
                17879
            ],
            [
                17879,
                18119
            ],
            [
                18119,
                18196
            ],
            [
                18196,
                18401
            ],
            [
                18401,
                18635
            ],
            [
                18635,
                19699
            ],
            [
                19699,
                20093
            ],
            [
                20093,
                20432
            ],
            [
                20432,
                20959
            ],
            [
                20959,
                21022
            ],
            [
                21022,
                21127
            ],
            [
                21127,
                21290
            ],
            [
                21290,
                21640
            ],
            [
                21640,
                21724
            ],
            [
                21724,
                21800
            ],
            [
                21800,
                22363
            ],
            [
                22363,
                23585
            ],
            [
                23585,
                23871
            ],
            [
                23871,
                24718
            ],
            [
                24718,
                24787
            ],
            [
                24787,
                24873
            ],
            [
                24873,
                24951
            ],
            [
                24951,
                25123
            ],
            [
                25123,
                25240
            ],
            [
                25240,
                26288
            ],
            [
                26288,
                26581
            ],
            [
                26581,
                26680
            ],
            [
                26680,
                26901
            ],
            [
                26901,
                27123
            ]
        ],
        "segment_chars": [
            [
                0,
                639
            ],
            [
                639,
                839
            ],
            [
                839,
                1029
            ],
            [
                1029,
                1218
            ],
            [
                1218,
                1359
            ],
            [
                1359,
                1455
            ],
            [
                1455,
                1527
            ],
            [
                1527,
                1557
            ],
            [
                1557,
                1684
            ],
            [
                1684,
                1716
            ],
            [
                1716,
                1837
            ],
            [
                1837,
                1875
            ],
            [
                1875,
                1945
            ],
            [
                1945,
                1993
            ],
            [
                1993,
                2040
            ],
            [
                2040,
                2196
            ],
            [
                2196,
                2336
            ],
            [
                2336,
                2355
            ],
            [
                2355,
                2378
            ],
            [
                2378,
                2392
            ],
            [
                2392,
                2421
            ],
            [
                2421,
                2429
            ],
            [
                2429,
                2460
            ],
            [
                2460,
                2548
            ],
            [
                2548,
                2575
            ],
            [
                2575,
                2617
            ],
            [
                2617,
                2669
            ],
            [
                2669,
                2876
            ],
            [
                2876,
                2918
            ],
            [
                2918,
                2929
            ],
            [
                2929,
                2981
            ],
            [
                2981,
                3129
            ],
            [
                3129,
                3145
            ],
            [
                3145,
                3174
            ],
            [
                3174,
                3188
            ],
            [
                3188,
                3203
            ],
            [
                3203,
                3256
            ],
            [
                3256,
                3410
            ],
            [
                3410,
                3495
            ],
            [
                3495,
                3575
            ],
            [
                3575,
                3601
            ],
            [
                3601,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3745
            ],
            [
                3745,
                3839
            ],
            [
                3839,
                3897
            ],
            [
                3897,
                4004
            ],
            [
                4004,
                4155
            ],
            [
                4155,
                4235
            ],
            [
                4235,
                4338
            ],
            [
                4338,
                4516
            ],
            [
                4516,
                4607
            ],
            [
                4607,
                4821
            ],
            [
                4821,
                5134
            ],
            [
                5134,
                5232
            ],
            [
                5232,
                5304
            ],
            [
                5304,
                5363
            ],
            [
                5363,
                5451
            ],
            [
                5451,
                5514
            ],
            [
                5514,
                5608
            ],
            [
                5608,
                5731
            ],
            [
                5731,
                5795
            ],
            [
                5795,
                5868
            ],
            [
                5868,
                5888
            ],
            [
                5888,
                5921
            ],
            [
                5921,
                5948
            ],
            [
                5948,
                5962
            ],
            [
                5962,
                5995
            ],
            [
                5995,
                6127
            ],
            [
                6127,
                6175
            ],
            [
                6175,
                6191
            ],
            [
                6191,
                6228
            ],
            [
                6228,
                6265
            ],
            [
                6265,
                6367
            ],
            [
                6367,
                6533
            ],
            [
                6533,
                6606
            ],
            [
                6606,
                6863
            ],
            [
                6863,
                6881
            ],
            [
                6881,
                6897
            ],
            [
                6897,
                6906
            ],
            [
                6906,
                6939
            ],
            [
                6939,
                6994
            ],
            [
                6994,
                7037
            ],
            [
                7037,
                7161
            ],
            [
                7161,
                7190
            ],
            [
                7190,
                7236
            ],
            [
                7236,
                7356
            ],
            [
                7356,
                7383
            ],
            [
                7383,
                7407
            ],
            [
                7407,
                7424
            ],
            [
                7424,
                7435
            ],
            [
                7435,
                7482
            ],
            [
                7482,
                7486
            ],
            [
                7486,
                7514
            ],
            [
                7514,
                7542
            ],
            [
                7542,
                7699
            ],
            [
                7699,
                7722
            ],
            [
                7722,
                7734
            ],
            [
                7734,
                7795
            ],
            [
                7795,
                7805
            ],
            [
                7805,
                7852
            ],
            [
                7852,
                7869
            ],
            [
                7869,
                7887
            ],
            [
                7887,
                7954
            ],
            [
                7954,
                8112
            ],
            [
                8112,
                8139
            ],
            [
                8139,
                8148
            ],
            [
                8148,
                8168
            ],
            [
                8168,
                8177
            ],
            [
                8177,
                8282
            ],
            [
                8282,
                8424
            ],
            [
                8424,
                8435
            ],
            [
                8435,
                8473
            ],
            [
                8473,
                8532
            ],
            [
                8532,
                8603
            ],
            [
                8603,
                8641
            ],
            [
                8641,
                8680
            ],
            [
                8680,
                8803
            ],
            [
                8803,
                8855
            ],
            [
                8855,
                8897
            ],
            [
                8897,
                8949
            ],
            [
                8949,
                9027
            ],
            [
                9027,
                9081
            ],
            [
                9081,
                9148
            ],
            [
                9148,
                9193
            ],
            [
                9193,
                9301
            ],
            [
                9301,
                9347
            ],
            [
                9347,
                9377
            ],
            [
                9377,
                9481
            ],
            [
                9481,
                9488
            ],
            [
                9488,
                9507
            ],
            [
                9507,
                9522
            ],
            [
                9522,
                9546
            ],
            [
                9546,
                9622
            ],
            [
                9622,
                9707
            ],
            [
                9707,
                9842
            ],
            [
                9842,
                9938
            ],
            [
                9938,
                10054
            ],
            [
                10054,
                10197
            ],
            [
                10197,
                10380
            ],
            [
                10380,
                10640
            ],
            [
                10640,
                10774
            ],
            [
                10774,
                10818
            ],
            [
                10818,
                10952
            ],
            [
                10952,
                11116
            ],
            [
                11116,
                11227
            ],
            [
                11227,
                11341
            ],
            [
                11341,
                11668
            ],
            [
                11668,
                11724
            ],
            [
                11724,
                11792
            ],
            [
                11792,
                11881
            ],
            [
                11881,
                11898
            ],
            [
                11898,
                11926
            ],
            [
                11926,
                12039
            ],
            [
                12039,
                12060
            ],
            [
                12060,
                12121
            ],
            [
                12121,
                12195
            ],
            [
                12195,
                12239
            ],
            [
                12239,
                12267
            ],
            [
                12267,
                12326
            ],
            [
                12326,
                12394
            ],
            [
                12394,
                12448
            ],
            [
                12448,
                12653
            ],
            [
                12653,
                12712
            ],
            [
                12712,
                12851
            ],
            [
                12851,
                13095
            ],
            [
                13095,
                13103
            ],
            [
                13103,
                13238
            ],
            [
                13238,
                13271
            ],
            [
                13271,
                13328
            ],
            [
                13328,
                13358
            ],
            [
                13358,
                13465
            ],
            [
                13465,
                13574
            ],
            [
                13574,
                13628
            ],
            [
                13628,
                13654
            ],
            [
                13654,
                13793
            ],
            [
                13793,
                13808
            ],
            [
                13808,
                13854
            ],
            [
                13854,
                13901
            ],
            [
                13901,
                13919
            ],
            [
                13919,
                13946
            ],
            [
                13946,
                13960
            ],
            [
                13960,
                13997
            ],
            [
                13997,
                14292
            ],
            [
                14292,
                14482
            ],
            [
                14482,
                14493
            ],
            [
                14493,
                14614
            ],
            [
                14614,
                14736
            ],
            [
                14736,
                14801
            ],
            [
                14801,
                14818
            ],
            [
                14818,
                14844
            ],
            [
                14844,
                14869
            ],
            [
                14869,
                14880
            ],
            [
                14880,
                14886
            ],
            [
                14886,
                14901
            ],
            [
                14901,
                15034
            ],
            [
                15034,
                15277
            ],
            [
                15277,
                15341
            ],
            [
                15341,
                15377
            ],
            [
                15377,
                15394
            ],
            [
                15394,
                15460
            ],
            [
                15460,
                15526
            ],
            [
                15526,
                15615
            ],
            [
                15615,
                15800
            ],
            [
                15800,
                15805
            ],
            [
                15805,
                15843
            ],
            [
                15843,
                15875
            ],
            [
                15875,
                15975
            ],
            [
                15975,
                16153
            ],
            [
                16153,
                16325
            ],
            [
                16325,
                16358
            ],
            [
                16358,
                16380
            ],
            [
                16380,
                16411
            ],
            [
                16411,
                16443
            ],
            [
                16443,
                16451
            ],
            [
                16451,
                16470
            ],
            [
                16470,
                16490
            ],
            [
                16490,
                16572
            ],
            [
                16572,
                16683
            ],
            [
                16683,
                16730
            ],
            [
                16730,
                16752
            ],
            [
                16752,
                16820
            ],
            [
                16820,
                16859
            ],
            [
                16859,
                16974
            ],
            [
                16974,
                17022
            ],
            [
                17022,
                17082
            ],
            [
                17082,
                17153
            ],
            [
                17153,
                17219
            ],
            [
                17219,
                17237
            ],
            [
                17237,
                17288
            ],
            [
                17288,
                17381
            ],
            [
                17381,
                17518
            ],
            [
                17518,
                17586
            ],
            [
                17586,
                17688
            ],
            [
                17688,
                17736
            ],
            [
                17736,
                17789
            ],
            [
                17789,
                17879
            ],
            [
                17879,
                17946
            ],
            [
                17946,
                17954
            ],
            [
                17954,
                18119
            ],
            [
                18119,
                18196
            ],
            [
                18196,
                18201
            ],
            [
                18201,
                18257
            ],
            [
                18257,
                18284
            ],
            [
                18284,
                18295
            ],
            [
                18295,
                18332
            ],
            [
                18332,
                18366
            ],
            [
                18366,
                18401
            ],
            [
                18401,
                18509
            ],
            [
                18509,
                18635
            ],
            [
                18635,
                18815
            ],
            [
                18815,
                18981
            ],
            [
                18981,
                19153
            ],
            [
                19153,
                19215
            ],
            [
                19215,
                19378
            ],
            [
                19378,
                19699
            ],
            [
                19699,
                19902
            ],
            [
                19902,
                20093
            ],
            [
                20093,
                20172
            ],
            [
                20172,
                20213
            ],
            [
                20213,
                20240
            ],
            [
                20240,
                20351
            ],
            [
                20351,
                20413
            ],
            [
                20413,
                20432
            ],
            [
                20432,
                20571
            ],
            [
                20571,
                20614
            ],
            [
                20614,
                20677
            ],
            [
                20677,
                20768
            ],
            [
                20768,
                20959
            ],
            [
                20959,
                20987
            ],
            [
                20987,
                21022
            ],
            [
                21022,
                21030
            ],
            [
                21030,
                21077
            ],
            [
                21077,
                21088
            ],
            [
                21088,
                21127
            ],
            [
                21127,
                21237
            ],
            [
                21237,
                21290
            ],
            [
                21290,
                21465
            ],
            [
                21465,
                21599
            ],
            [
                21599,
                21640
            ],
            [
                21640,
                21692
            ],
            [
                21692,
                21724
            ],
            [
                21724,
                21800
            ],
            [
                21800,
                21854
            ],
            [
                21854,
                21882
            ],
            [
                21882,
                21912
            ],
            [
                21912,
                21987
            ],
            [
                21987,
                22163
            ],
            [
                22163,
                22363
            ],
            [
                22363,
                22454
            ],
            [
                22454,
                22500
            ],
            [
                22500,
                22710
            ],
            [
                22710,
                22787
            ],
            [
                22787,
                22874
            ],
            [
                22874,
                22902
            ],
            [
                22902,
                22972
            ],
            [
                22972,
                23215
            ],
            [
                23215,
                23385
            ],
            [
                23385,
                23585
            ],
            [
                23585,
                23767
            ],
            [
                23767,
                23871
            ],
            [
                23871,
                24135
            ],
            [
                24135,
                24368
            ],
            [
                24368,
                24487
            ],
            [
                24487,
                24662
            ],
            [
                24662,
                24685
            ],
            [
                24685,
                24718
            ],
            [
                24718,
                24737
            ],
            [
                24737,
                24787
            ],
            [
                24787,
                24827
            ],
            [
                24827,
                24844
            ],
            [
                24844,
                24873
            ],
            [
                24873,
                24898
            ],
            [
                24898,
                24934
            ],
            [
                24934,
                24951
            ],
            [
                24951,
                24971
            ],
            [
                24971,
                25010
            ],
            [
                25010,
                25061
            ],
            [
                25061,
                25090
            ],
            [
                25090,
                25123
            ],
            [
                25123,
                25240
            ],
            [
                25240,
                25369
            ],
            [
                25369,
                25431
            ],
            [
                25431,
                25489
            ],
            [
                25489,
                25499
            ],
            [
                25499,
                25693
            ],
            [
                25693,
                25785
            ],
            [
                25785,
                25930
            ],
            [
                25930,
                26060
            ],
            [
                26060,
                26201
            ],
            [
                26201,
                26288
            ],
            [
                26288,
                26399
            ],
            [
                26399,
                26581
            ],
            [
                26581,
                26660
            ],
            [
                26660,
                26680
            ],
            [
                26680,
                26770
            ],
            [
                26770,
                26800
            ],
            [
                26800,
                26901
            ],
            [
                26901,
                27123
            ]
        ],
        "overlap_chars": [
            [
                6,
                10
            ],
            [
                18,
                50
            ],
            [
                58,
                64
            ],
            [
                66,
                69
            ],
            [
                84,
                159
            ],
            [
                215,
                229
            ],
            [
                254,
                259
            ],
            [
                231,
                237
            ],
            [
                298,
                301
            ],
            [
                260,
                264
            ],
            [
                283,
                289
            ],
            [
                290,
                296
            ],
            [
                637,
                638
            ],
            [
                64,
                65
            ],
            [
                329,
                332
            ],
            [
                334,
                340
            ],
            [
                167,
                168
            ],
            [
                383,
                407
            ],
            [
                431,
                447
            ],
            [
                555,
                559
            ],
            [
                448,
                459
            ],
            [
                465,
                473
            ],
            [
                490,
                509
            ],
            [
                639,
                640
            ],
            [
                698,
                700
            ],
            [
                670,
                671
            ],
            [
                719,
                720
            ],
            [
                743,
                746
            ],
            [
                837,
                839
            ],
            [
                839,
                840
            ],
            [
                989,
                991
            ],
            [
                942,
                943
            ],
            [
                841,
                863
            ],
            [
                875,
                890
            ],
            [
                897,
                916
            ],
            [
                919,
                934
            ],
            [
                963,
                965
            ],
            [
                944,
                945
            ],
            [
                996,
                1004
            ],
            [
                1027,
                1029
            ],
            [
                1029,
                1082
            ],
            [
                1103,
                1108
            ],
            [
                1164,
                1218
            ],
            [
                1270,
                1359
            ],
            [
                1359,
                1413
            ],
            [
                1419,
                1420
            ],
            [
                1445,
                1454
            ],
            [
                1456,
                1470
            ],
            [
                1473,
                1487
            ],
            [
                1489,
                1507
            ],
            [
                1517,
                1525
            ],
            [
                1557,
                1561
            ],
            [
                1599,
                1600
            ],
            [
                1602,
                1634
            ],
            [
                1662,
                1681
            ],
            [
                1689,
                1713
            ],
            [
                1716,
                1733
            ],
            [
                1745,
                1747
            ],
            [
                1757,
                1791
            ],
            [
                1804,
                1815
            ],
            [
                1829,
                1837
            ],
            [
                1838,
                1872
            ],
            [
                1875,
                1900
            ],
            [
                1923,
                1944
            ],
            [
                2016,
                2038
            ],
            [
                2068,
                2069
            ],
            [
                2040,
                2068
            ],
            [
                2038,
                2039
            ],
            [
                2129,
                2185
            ],
            [
                2196,
                2264
            ],
            [
                2297,
                2305
            ],
            [
                2334,
                2336
            ],
            [
                2337,
                2352
            ],
            [
                2355,
                2364
            ],
            [
                2376,
                2378
            ],
            [
                2379,
                2392
            ],
            [
                2421,
                2429
            ],
            [
                2429,
                2457
            ],
            [
                2617,
                2669
            ],
            [
                2669,
                2675
            ],
            [
                2876,
                2912
            ],
            [
                2916,
                2918
            ],
            [
                2929,
                2978
            ],
            [
                2982,
                2992
            ],
            [
                2995,
                3006
            ],
            [
                3059,
                3068
            ],
            [
                3008,
                3018
            ],
            [
                3072,
                3126
            ],
            [
                3130,
                3145
            ],
            [
                3161,
                3164
            ],
            [
                3174,
                3188
            ],
            [
                3231,
                3253
            ],
            [
                3257,
                3284
            ],
            [
                3287,
                3299
            ],
            [
                3301,
                3330
            ],
            [
                3345,
                3362
            ],
            [
                3373,
                3407
            ],
            [
                3411,
                3448
            ],
            [
                3451,
                3467
            ],
            [
                3469,
                3495
            ],
            [
                3495,
                3540
            ],
            [
                3545,
                3575
            ],
            [
                3575,
                3601
            ],
            [
                3601,
                3615
            ],
            [
                3622,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3745
            ],
            [
                3745,
                3780
            ],
            [
                3837,
                3839
            ],
            [
                3839,
                3897
            ],
            [
                3897,
                3905
            ],
            [
                3929,
                3956
            ],
            [
                3981,
                4004
            ],
            [
                4004,
                4064
            ],
            [
                4076,
                4145
            ],
            [
                4147,
                4152
            ],
            [
                4153,
                4155
            ],
            [
                4155,
                4159
            ],
            [
                4190,
                4207
            ],
            [
                4209,
                4214
            ],
            [
                4215,
                4232
            ],
            [
                4235,
                4257
            ],
            [
                4295,
                4338
            ],
            [
                4338,
                4351
            ],
            [
                4371,
                4376
            ],
            [
                4351,
                4356
            ],
            [
                4409,
                4516
            ],
            [
                4516,
                4548
            ],
            [
                4591,
                4607
            ],
            [
                4642,
                4650
            ],
            [
                4652,
                4655
            ],
            [
                4671,
                4674
            ],
            [
                4675,
                4680
            ],
            [
                4682,
                4708
            ],
            [
                4819,
                4820
            ],
            [
                4876,
                4879
            ],
            [
                4823,
                4829
            ],
            [
                4841,
                4857
            ],
            [
                4924,
                4929
            ],
            [
                4967,
                5020
            ],
            [
                4964,
                4966
            ],
            [
                4883,
                4888
            ],
            [
                5034,
                5070
            ],
            [
                5081,
                5088
            ],
            [
                5132,
                5134
            ],
            [
                5139,
                5152
            ],
            [
                5155,
                5179
            ],
            [
                5181,
                5232
            ],
            [
                5232,
                5304
            ],
            [
                5304,
                5363
            ],
            [
                5363,
                5451
            ],
            [
                5451,
                5514
            ],
            [
                5674,
                5731
            ],
            [
                5731,
                5795
            ],
            [
                5795,
                5868
            ],
            [
                5868,
                5888
            ],
            [
                5888,
                5921
            ],
            [
                5921,
                5948
            ],
            [
                5948,
                5959
            ],
            [
                5963,
                5992
            ],
            [
                5995,
                6034
            ],
            [
                6078,
                6127
            ],
            [
                6128,
                6175
            ],
            [
                6175,
                6191
            ],
            [
                6191,
                6225
            ],
            [
                6228,
                6229
            ],
            [
                6261,
                6263
            ],
            [
                6263,
                6265
            ],
            [
                6266,
                6285
            ],
            [
                6288,
                6311
            ],
            [
                6313,
                6326
            ],
            [
                6337,
                6367
            ],
            [
                6367,
                6460
            ],
            [
                6468,
                6480
            ],
            [
                6499,
                6533
            ],
            [
                6533,
                6606
            ],
            [
                6606,
                6624
            ],
            [
                6650,
                6651
            ],
            [
                6772,
                6860
            ],
            [
                6868,
                6881
            ],
            [
                6881,
                6894
            ],
            [
                6897,
                6906
            ],
            [
                6907,
                6936
            ],
            [
                6940,
                6978
            ],
            [
                6981,
                6994
            ],
            [
                6995,
                6997
            ],
            [
                6999,
                7003
            ],
            [
                7005,
                7034
            ],
            [
                7043,
                7081
            ],
            [
                7084,
                7090
            ],
            [
                7159,
                7161
            ],
            [
                7165,
                7167
            ],
            [
                7169,
                7172
            ],
            [
                7174,
                7187
            ],
            [
                7190,
                7236
            ],
            [
                7240,
                7259
            ],
            [
                7284,
                7301
            ],
            [
                7260,
                7263
            ],
            [
                7308,
                7321
            ],
            [
                7331,
                7356
            ],
            [
                7357,
                7380
            ],
            [
                7383,
                7386
            ],
            [
                7396,
                7407
            ],
            [
                7424,
                7435
            ],
            [
                7435,
                7482
            ],
            [
                7482,
                7486
            ],
            [
                7486,
                7514
            ],
            [
                7514,
                7539
            ],
            [
                7542,
                7557
            ],
            [
                7565,
                7581
            ],
            [
                7590,
                7595
            ],
            [
                7646,
                7649
            ],
            [
                7612,
                7617
            ],
            [
                7640,
                7645
            ],
            [
                7661,
                7699
            ],
            [
                7705,
                7719
            ],
            [
                7722,
                7734
            ],
            [
                7735,
                7741
            ],
            [
                7752,
                7765
            ],
            [
                7798,
                7802
            ],
            [
                7805,
                7816
            ],
            [
                7818,
                7852
            ],
            [
                7852,
                7869
            ],
            [
                7869,
                7884
            ],
            [
                7908,
                7911
            ],
            [
                7939,
                7954
            ],
            [
                7954,
                7986
            ],
            [
                8016,
                8104
            ],
            [
                8110,
                8112
            ],
            [
                8113,
                8136
            ],
            [
                8139,
                8148
            ],
            [
                8168,
                8177
            ],
            [
                8177,
                8184
            ],
            [
                8195,
                8279
            ],
            [
                8308,
                8311
            ],
            [
                8292,
                8306
            ],
            [
                8378,
                8379
            ],
            [
                8326,
                8366
            ],
            [
                8393,
                8397
            ],
            [
                8404,
                8424
            ],
            [
                8425,
                8435
            ],
            [
                8435,
                8450
            ],
            [
                8510,
                8530
            ],
            [
                8461,
                8472
            ],
            [
                8532,
                8571
            ],
            [
                8601,
                8603
            ],
            [
                8627,
                8641
            ],
            [
                8641,
                8677
            ],
            [
                8681,
                8719
            ],
            [
                8722,
                8733
            ],
            [
                8735,
                8745
            ],
            [
                8761,
                8765
            ],
            [
                8786,
                8800
            ],
            [
                8804,
                8852
            ],
            [
                8855,
                8897
            ],
            [
                8898,
                8932
            ],
            [
                8947,
                8949
            ],
            [
                8949,
                9024
            ],
            [
                9027,
                9051
            ],
            [
                9066,
                9081
            ],
            [
                9081,
                9148
            ],
            [
                9148,
                9193
            ],
            [
                9193,
                9203
            ],
            [
                9212,
                9236
            ],
            [
                9243,
                9301
            ],
            [
                9302,
                9344
            ],
            [
                9347,
                9356
            ],
            [
                9375,
                9377
            ],
            [
                9402,
                9411
            ],
            [
                9482,
                9488
            ],
            [
                9523,
                9543
            ],
            [
                9547,
                9607
            ],
            [
                9610,
                9622
            ],
            [
                9623,
                9661
            ],
            [
                9664,
                9688
            ],
            [
                9690,
                9707
            ],
            [
                9707,
                9717
            ],
            [
                9808,
                9840
            ],
            [
                9739,
                9749
            ],
            [
                9754,
                9764
            ],
            [
                9840,
                9842
            ],
            [
                9881,
                9938
            ],
            [
                9978,
                9984
            ],
            [
                9985,
                10021
            ],
            [
                10197,
                10215
            ],
            [
                10244,
                10336
            ],
            [
                10351,
                10379
            ],
            [
                10380,
                10460
            ],
            [
                10472,
                10602
            ],
            [
                10617,
                10640
            ],
            [
                10640,
                10774
            ],
            [
                10774,
                10790
            ],
            [
                10810,
                10818
            ],
            [
                10818,
                10863
            ],
            [
                10880,
                10884
            ],
            [
                10940,
                10950
            ],
            [
                10885,
                10888
            ],
            [
                10950,
                10952
            ],
            [
                11003,
                11064
            ],
            [
                11089,
                11114
            ],
            [
                11143,
                11169
            ],
            [
                10968,
                10969
            ],
            [
                11201,
                11226
            ],
            [
                11227,
                11269
            ],
            [
                11341,
                11417
            ],
            [
                11639,
                11643
            ],
            [
                11465,
                11475
            ],
            [
                11492,
                11574
            ],
            [
                11579,
                11601
            ],
            [
                11666,
                11668
            ],
            [
                11668,
                11675
            ],
            [
                11695,
                11724
            ],
            [
                11792,
                11842
            ],
            [
                11879,
                11881
            ],
            [
                11881,
                11898
            ],
            [
                11898,
                11926
            ],
            [
                11926,
                11985
            ],
            [
                12037,
                12039
            ],
            [
                12039,
                12060
            ],
            [
                12121,
                12155
            ],
            [
                12161,
                12195
            ],
            [
                12195,
                12216
            ],
            [
                12237,
                12239
            ],
            [
                12239,
                12264
            ],
            [
                12268,
                12311
            ],
            [
                12314,
                12326
            ],
            [
                12327,
                12371
            ],
            [
                12374,
                12394
            ],
            [
                12426,
                12445
            ],
            [
                12448,
                12451
            ],
            [
                12473,
                12487
            ],
            [
                12495,
                12553
            ],
            [
                12465,
                12468
            ],
            [
                12563,
                12653
            ],
            [
                12653,
                12654
            ],
            [
                12688,
                12690
            ],
            [
                12697,
                12700
            ],
            [
                12704,
                12710
            ],
            [
                12712,
                12715
            ],
            [
                12729,
                12751
            ],
            [
                12757,
                12771
            ],
            [
                12710,
                12711
            ],
            [
                12851,
                12884
            ],
            [
                12893,
                12963
            ],
            [
                13000,
                13095
            ],
            [
                13096,
                13100
            ],
            [
                13103,
                13121
            ],
            [
                13123,
                13153
            ],
            [
                13159,
                13238
            ],
            [
                13238,
                13271
            ],
            [
                13271,
                13300
            ],
            [
                13301,
                13328
            ],
            [
                13328,
                13358
            ],
            [
                13414,
                13455
            ],
            [
                13365,
                13370
            ],
            [
                13456,
                13465
            ],
            [
                13465,
                13551
            ],
            [
                13572,
                13574
            ],
            [
                13574,
                13628
            ],
            [
                13628,
                13654
            ],
            [
                13654,
                13718
            ],
            [
                13754,
                13791
            ],
            [
                13808,
                13854
            ],
            [
                13855,
                13901
            ],
            [
                13901,
                13919
            ],
            [
                13919,
                13935
            ],
            [
                13944,
                13946
            ],
            [
                13946,
                13960
            ],
            [
                13960,
                13994
            ],
            [
                13997,
                14065
            ],
            [
                14090,
                14097
            ],
            [
                14080,
                14089
            ],
            [
                14104,
                14116
            ],
            [
                14134,
                14136
            ],
            [
                14145,
                14191
            ],
            [
                14199,
                14228
            ],
            [
                14272,
                14292
            ],
            [
                14292,
                14298
            ],
            [
                14309,
                14330
            ],
            [
                14335,
                14336
            ],
            [
                14332,
                14335
            ],
            [
                14367,
                14370
            ],
            [
                14379,
                14390
            ],
            [
                14480,
                14482
            ],
            [
                14483,
                14490
            ],
            [
                14615,
                14643
            ],
            [
                14666,
                14699
            ],
            [
                14709,
                14734
            ],
            [
                14802,
                14815
            ],
            [
                14818,
                14836
            ],
            [
                14837,
                14844
            ],
            [
                14850,
                14869
            ],
            [
                14869,
                14878
            ],
            [
                14920,
                14933
            ],
            [
                14905,
                14912
            ],
            [
                14934,
                15034
            ],
            [
                15038,
                15059
            ],
            [
                15062,
                15074
            ],
            [
                15076,
                15138
            ],
            [
                15156,
                15274
            ],
            [
                15342,
                15374
            ],
            [
                15377,
                15394
            ],
            [
                15395,
                15412
            ],
            [
                15426,
                15457
            ],
            [
                15464,
                15526
            ],
            [
                15526,
                15573
            ],
            [
                15714,
                15728
            ],
            [
                15737,
                15750
            ],
            [
                15675,
                15679
            ],
            [
                15694,
                15712
            ],
            [
                15759,
                15762
            ],
            [
                15729,
                15736
            ],
            [
                15778,
                15780
            ],
            [
                15751,
                15757
            ],
            [
                15798,
                15800
            ],
            [
                15801,
                15805
            ],
            [
                15805,
                15840
            ],
            [
                15843,
                15851
            ],
            [
                15873,
                15875
            ],
            [
                15876,
                15883
            ],
            [
                15918,
                15975
            ],
            [
                15975,
                16025
            ],
            [
                16040,
                16153
            ],
            [
                16166,
                16322
            ],
            [
                16326,
                16355
            ],
            [
                16368,
                16380
            ],
            [
                16381,
                16411
            ],
            [
                16411,
                16440
            ],
            [
                16444,
                16448
            ],
            [
                16451,
                16470
            ],
            [
                16471,
                16490
            ],
            [
                16490,
                16517
            ],
            [
                16555,
                16572
            ],
            [
                16616,
                16644
            ],
            [
                16645,
                16683
            ],
            [
                16683,
                16730
            ],
            [
                16730,
                16750
            ],
            [
                16821,
                16842
            ],
            [
                16845,
                16846
            ],
            [
                16857,
                16859
            ],
            [
                16864,
                16936
            ],
            [
                16960,
                16974
            ],
            [
                16985,
                17004
            ],
            [
                17012,
                17019
            ],
            [
                17023,
                17058
            ],
            [
                17061,
                17082
            ],
            [
                17083,
                17153
            ],
            [
                17153,
                17219
            ],
            [
                17219,
                17237
            ],
            [
                17237,
                17285
            ],
            [
                17288,
                17381
            ],
            [
                17382,
                17400
            ],
            [
                17410,
                17426
            ],
            [
                17445,
                17453
            ],
            [
                17455,
                17518
            ],
            [
                17518,
                17586
            ],
            [
                17586,
                17587
            ],
            [
                17610,
                17643
            ],
            [
                17686,
                17688
            ],
            [
                17736,
                17786
            ],
            [
                17794,
                17864
            ],
            [
                17867,
                17879
            ],
            [
                17880,
                17943
            ],
            [
                17946,
                17954
            ],
            [
                17955,
                18049
            ],
            [
                18082,
                18116
            ],
            [
                18119,
                18165
            ],
            [
                18194,
                18196
            ],
            [
                18197,
                18201
            ],
            [
                18201,
                18225
            ],
            [
                18228,
                18257
            ],
            [
                18258,
                18284
            ],
            [
                18284,
                18295
            ],
            [
                18332,
                18360
            ],
            [
                18380,
                18384
            ],
            [
                18442,
                18455
            ],
            [
                18468,
                18470
            ],
            [
                18481,
                18509
            ],
            [
                18566,
                18585
            ],
            [
                18610,
                18613
            ],
            [
                18540,
                18543
            ],
            [
                18633,
                18635
            ],
            [
                18635,
                18645
            ],
            [
                18646,
                18675
            ],
            [
                18732,
                18753
            ],
            [
                18813,
                18815
            ],
            [
                18831,
                18842
            ],
            [
                18850,
                18889
            ],
            [
                18938,
                18981
            ],
            [
                18981,
                19033
            ],
            [
                19062,
                19077
            ],
            [
                19095,
                19153
            ],
            [
                19215,
                19216
            ],
            [
                19298,
                19319
            ],
            [
                19324,
                19334
            ],
            [
                19359,
                19378
            ],
            [
                19378,
                19391
            ],
            [
                19417,
                19419
            ],
            [
                19415,
                19416
            ],
            [
                19438,
                19439
            ],
            [
                19613,
                19620
            ],
            [
                19580,
                19581
            ],
            [
                19451,
                19510
            ],
            [
                19636,
                19651
            ],
            [
                19668,
                19699
            ],
            [
                19701,
                19714
            ],
            [
                19727,
                19731
            ],
            [
                19775,
                19778
            ],
            [
                19749,
                19754
            ],
            [
                19787,
                19848
            ],
            [
                19856,
                19902
            ],
            [
                19902,
                19926
            ],
            [
                19928,
                19931
            ],
            [
                19960,
                19963
            ],
            [
                19971,
                20006
            ],
            [
                20091,
                20093
            ],
            [
                20094,
                20104
            ],
            [
                20107,
                20115
            ],
            [
                20117,
                20172
            ],
            [
                20172,
                20180
            ],
            [
                20187,
                20191
            ],
            [
                20198,
                20213
            ],
            [
                20213,
                20240
            ],
            [
                20240,
                20306
            ],
            [
                20349,
                20351
            ],
            [
                20413,
                20429
            ],
            [
                20437,
                20448
            ],
            [
                20456,
                20459
            ],
            [
                20462,
                20473
            ],
            [
                20475,
                20482
            ],
            [
                20503,
                20571
            ],
            [
                20571,
                20589
            ],
            [
                20600,
                20614
            ],
            [
                20614,
                20677
            ],
            [
                20677,
                20723
            ],
            [
                20745,
                20768
            ],
            [
                20768,
                20857
            ],
            [
                20882,
                20883
            ],
            [
                20895,
                20942
            ],
            [
                20962,
                20963
            ],
            [
                20964,
                20984
            ],
            [
                20996,
                21003
            ],
            [
                21020,
                21022
            ],
            [
                21028,
                21030
            ],
            [
                21030,
                21074
            ],
            [
                21077,
                21088
            ],
            [
                21092,
                21124
            ],
            [
                21128,
                21154
            ],
            [
                21157,
                21174
            ],
            [
                21237,
                21287
            ],
            [
                21291,
                21333
            ],
            [
                21336,
                21347
            ],
            [
                21349,
                21360
            ],
            [
                21380,
                21392
            ],
            [
                21406,
                21465
            ],
            [
                21465,
                21480
            ],
            [
                21492,
                21496
            ],
            [
                21512,
                21519
            ],
            [
                21535,
                21541
            ],
            [
                21527,
                21529
            ],
            [
                21560,
                21577
            ],
            [
                21641,
                21689
            ],
            [
                21725,
                21750
            ],
            [
                21801,
                21820
            ],
            [
                21823,
                21854
            ],
            [
                21859,
                21882
            ],
            [
                21882,
                21912
            ],
            [
                21912,
                21957
            ],
            [
                21987,
                22062
            ],
            [
                22069,
                22147
            ],
            [
                22148,
                22163
            ],
            [
                22181,
                22184
            ],
            [
                22239,
                22262
            ],
            [
                22269,
                22276
            ],
            [
                22321,
                22322
            ],
            [
                22327,
                22360
            ],
            [
                22363,
                22399
            ],
            [
                22422,
                22427
            ],
            [
                22401,
                22402
            ],
            [
                22428,
                22454
            ],
            [
                22454,
                22494
            ],
            [
                22500,
                22501
            ],
            [
                22672,
                22685
            ],
            [
                22695,
                22709
            ],
            [
                22710,
                22787
            ],
            [
                22878,
                22896
            ],
            [
                22900,
                22902
            ],
            [
                22902,
                22913
            ],
            [
                22919,
                22972
            ],
            [
                22973,
                22974
            ],
            [
                22976,
                23023
            ],
            [
                23111,
                23215
            ],
            [
                23215,
                23257
            ],
            [
                23583,
                23585
            ],
            [
                23383,
                23384
            ],
            [
                23304,
                23311
            ],
            [
                23318,
                23326
            ],
            [
                23385,
                23418
            ],
            [
                23420,
                23431
            ],
            [
                23487,
                23523
            ],
            [
                23540,
                23553
            ],
            [
                23575,
                23583
            ],
            [
                23585,
                23595
            ],
            [
                23632,
                23647
            ],
            [
                23655,
                23657
            ],
            [
                23728,
                23731
            ],
            [
                23695,
                23711
            ],
            [
                23765,
                23767
            ],
            [
                23767,
                23776
            ],
            [
                23787,
                23790
            ],
            [
                23803,
                23835
            ],
            [
                23857,
                23859
            ],
            [
                23869,
                23871
            ],
            [
                23871,
                23926
            ],
            [
                23957,
                24020
            ],
            [
                24044,
                24051
            ],
            [
                24021,
                24038
            ],
            [
                24058,
                24083
            ],
            [
                24133,
                24135
            ],
            [
                24145,
                24173
            ],
            [
                24366,
                24367
            ],
            [
                24221,
                24232
            ],
            [
                24239,
                24266
            ],
            [
                24368,
                24431
            ],
            [
                24311,
                24315
            ],
            [
                24485,
                24487
            ],
            [
                24487,
                24524
            ],
            [
                24571,
                24583
            ],
            [
                24619,
                24644
            ],
            [
                24646,
                24662
            ],
            [
                24662,
                24666
            ],
            [
                24679,
                24685
            ],
            [
                24685,
                24715
            ],
            [
                24719,
                24734
            ],
            [
                24743,
                24744
            ],
            [
                24745,
                24752
            ],
            [
                24785,
                24787
            ],
            [
                24794,
                24805
            ],
            [
                24806,
                24824
            ],
            [
                24827,
                24844
            ],
            [
                24845,
                24870
            ],
            [
                24877,
                24879
            ],
            [
                24889,
                24898
            ],
            [
                24903,
                24931
            ],
            [
                24934,
                24951
            ],
            [
                25011,
                25023
            ],
            [
                24971,
                24987
            ],
            [
                25008,
                25009
            ],
            [
                25241,
                25251
            ],
            [
                25264,
                25274
            ],
            [
                25283,
                25292
            ],
            [
                25295,
                25309
            ],
            [
                25311,
                25369
            ],
            [
                25534,
                25541
            ],
            [
                25542,
                25578
            ],
            [
                25611,
                25628
            ],
            [
                25633,
                25666
            ],
            [
                25672,
                25693
            ],
            [
                25693,
                25696
            ],
            [
                25701,
                25717
            ],
            [
                25765,
                25769
            ],
            [
                25783,
                25785
            ],
            [
                25801,
                25808
            ],
            [
                25823,
                25826
            ],
            [
                25809,
                25819
            ],
            [
                25826,
                25845
            ],
            [
                25930,
                25970
            ],
            [
                25789,
                25792
            ],
            [
                25884,
                25885
            ],
            [
                25992,
                26000
            ],
            [
                26036,
                26060
            ],
            [
                26092,
                26104
            ],
            [
                26131,
                26147
            ],
            [
                26199,
                26201
            ],
            [
                26201,
                26209
            ],
            [
                26246,
                26285
            ],
            [
                26582,
                26595
            ],
            [
                26624,
                26627
            ],
            [
                26637,
                26645
            ],
            [
                26648,
                26649
            ],
            [
                26658,
                26660
            ],
            [
                26665,
                26677
            ],
            [
                26685,
                26707
            ],
            [
                26710,
                26730
            ],
            [
                26732,
                26770
            ],
            [
                26770,
                26800
            ],
            [
                26800,
                26898
            ],
            [
                26901,
                26940
            ],
            [
                27122,
                27123
            ],
            [
                26942,
                26952
            ],
            [
                26985,
                27015
            ],
            [
                27026,
                27036
            ],
            [
                27072,
                27078
            ],
            [
                27085,
                27089
            ],
            [
                27106,
                27119
            ],
            [
                27100,
                27106
            ]
        ],
        "row_chars": [
            [
                0,
                639
            ],
            [
                639,
                839
            ],
            [
                839,
                1029
            ],
            [
                1029,
                1218
            ],
            [
                1218,
                1359
            ],
            [
                1359,
                1455
            ],
            [
                1455,
                1527
            ],
            [
                1527,
                1557
            ],
            [
                1557,
                1684
            ],
            [
                1684,
                1716
            ],
            [
                1716,
                1837
            ],
            [
                1837,
                1875
            ],
            [
                1875,
                1945
            ],
            [
                1945,
                1993
            ],
            [
                1993,
                2196
            ],
            [
                2196,
                2336
            ],
            [
                2336,
                2355
            ],
            [
                2355,
                2378
            ],
            [
                2378,
                2392
            ],
            [
                2392,
                2421
            ],
            [
                2421,
                2429
            ],
            [
                2429,
                2460
            ],
            [
                2460,
                2548
            ],
            [
                2548,
                2575
            ],
            [
                2575,
                2617
            ],
            [
                2617,
                2669
            ],
            [
                2669,
                2918
            ],
            [
                2918,
                2929
            ],
            [
                2929,
                2981
            ],
            [
                2981,
                3129
            ],
            [
                3129,
                3145
            ],
            [
                3145,
                3174
            ],
            [
                3174,
                3188
            ],
            [
                3188,
                3203
            ],
            [
                3203,
                3256
            ],
            [
                3256,
                3410
            ],
            [
                3410,
                3495
            ],
            [
                3495,
                3575
            ],
            [
                3575,
                3601
            ],
            [
                3601,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3745
            ],
            [
                3745,
                3839
            ],
            [
                3839,
                3897
            ],
            [
                3897,
                4004
            ],
            [
                4004,
                4155
            ],
            [
                4155,
                4235
            ],
            [
                4235,
                4338
            ],
            [
                4338,
                4516
            ],
            [
                4516,
                4607
            ],
            [
                4607,
                4821
            ],
            [
                4821,
                5134
            ],
            [
                5134,
                5232
            ],
            [
                5232,
                5304
            ],
            [
                5304,
                5363
            ],
            [
                5363,
                5451
            ],
            [
                5451,
                5514
            ],
            [
                5514,
                5608
            ],
            [
                5608,
                5731
            ],
            [
                5731,
                5795
            ],
            [
                5795,
                5868
            ],
            [
                5868,
                5888
            ],
            [
                5888,
                5921
            ],
            [
                5921,
                5948
            ],
            [
                5948,
                5962
            ],
            [
                5962,
                5995
            ],
            [
                5995,
                6127
            ],
            [
                6127,
                6175
            ],
            [
                6175,
                6191
            ],
            [
                6191,
                6228
            ],
            [
                6228,
                6265
            ],
            [
                6265,
                6367
            ],
            [
                6367,
                6533
            ],
            [
                6533,
                6606
            ],
            [
                6606,
                6863
            ],
            [
                6863,
                6881
            ],
            [
                6881,
                6897
            ],
            [
                6897,
                6906
            ],
            [
                6906,
                6939
            ],
            [
                6939,
                6994
            ],
            [
                6994,
                7037
            ],
            [
                7037,
                7161
            ],
            [
                7161,
                7190
            ],
            [
                7190,
                7236
            ],
            [
                7236,
                7356
            ],
            [
                7356,
                7383
            ],
            [
                7383,
                7407
            ],
            [
                7407,
                7424
            ],
            [
                7424,
                7435
            ],
            [
                7435,
                7482
            ],
            [
                7482,
                7486
            ],
            [
                7486,
                7514
            ],
            [
                7514,
                7542
            ],
            [
                7542,
                7699
            ],
            [
                7699,
                7722
            ],
            [
                7722,
                7734
            ],
            [
                7734,
                7795
            ],
            [
                7795,
                7805
            ],
            [
                7805,
                7852
            ],
            [
                7852,
                7869
            ],
            [
                7869,
                7887
            ],
            [
                7887,
                7954
            ],
            [
                7954,
                8112
            ],
            [
                8112,
                8139
            ],
            [
                8139,
                8148
            ],
            [
                8148,
                8168
            ],
            [
                8168,
                8177
            ],
            [
                8177,
                8282
            ],
            [
                8282,
                8424
            ],
            [
                8424,
                8435
            ],
            [
                8435,
                8532
            ],
            [
                8532,
                8603
            ],
            [
                8603,
                8641
            ],
            [
                8641,
                8680
            ],
            [
                8680,
                8803
            ],
            [
                8803,
                8855
            ],
            [
                8855,
                8897
            ],
            [
                8897,
                8949
            ],
            [
                8949,
                9027
            ],
            [
                9027,
                9081
            ],
            [
                9081,
                9148
            ],
            [
                9148,
                9193
            ],
            [
                9193,
                9301
            ],
            [
                9301,
                9347
            ],
            [
                9347,
                9377
            ],
            [
                9377,
                9481
            ],
            [
                9481,
                9488
            ],
            [
                9488,
                9507
            ],
            [
                9507,
                9522
            ],
            [
                9522,
                9546
            ],
            [
                9546,
                9622
            ],
            [
                9622,
                9707
            ],
            [
                9707,
                9842
            ],
            [
                9842,
                9938
            ],
            [
                9938,
                10054
            ],
            [
                10054,
                10197
            ],
            [
                10197,
                10380
            ],
            [
                10380,
                10640
            ],
            [
                10640,
                10774
            ],
            [
                10774,
                10818
            ],
            [
                10818,
                10952
            ],
            [
                10952,
                11227
            ],
            [
                11227,
                11668
            ],
            [
                11668,
                11724
            ],
            [
                11724,
                11792
            ],
            [
                11792,
                11881
            ],
            [
                11881,
                11898
            ],
            [
                11898,
                11926
            ],
            [
                11926,
                12039
            ],
            [
                12039,
                12060
            ],
            [
                12060,
                12121
            ],
            [
                12121,
                12195
            ],
            [
                12195,
                12239
            ],
            [
                12239,
                12267
            ],
            [
                12267,
                12326
            ],
            [
                12326,
                12394
            ],
            [
                12394,
                12448
            ],
            [
                12448,
                12653
            ],
            [
                12653,
                12851
            ],
            [
                12851,
                13095
            ],
            [
                13095,
                13103
            ],
            [
                13103,
                13238
            ],
            [
                13238,
                13271
            ],
            [
                13271,
                13328
            ],
            [
                13328,
                13358
            ],
            [
                13358,
                13465
            ],
            [
                13465,
                13574
            ],
            [
                13574,
                13628
            ],
            [
                13628,
                13654
            ],
            [
                13654,
                13793
            ],
            [
                13793,
                13808
            ],
            [
                13808,
                13854
            ],
            [
                13854,
                13901
            ],
            [
                13901,
                13919
            ],
            [
                13919,
                13946
            ],
            [
                13946,
                13960
            ],
            [
                13960,
                13997
            ],
            [
                13997,
                14292
            ],
            [
                14292,
                14482
            ],
            [
                14482,
                14493
            ],
            [
                14493,
                14614
            ],
            [
                14614,
                14736
            ],
            [
                14736,
                14801
            ],
            [
                14801,
                14818
            ],
            [
                14818,
                14844
            ],
            [
                14844,
                14869
            ],
            [
                14869,
                14880
            ],
            [
                14880,
                14886
            ],
            [
                14886,
                14901
            ],
            [
                14901,
                15034
            ],
            [
                15034,
                15277
            ],
            [
                15277,
                15341
            ],
            [
                15341,
                15377
            ],
            [
                15377,
                15394
            ],
            [
                15394,
                15460
            ],
            [
                15460,
                15526
            ],
            [
                15526,
                15800
            ],
            [
                15800,
                15805
            ],
            [
                15805,
                15843
            ],
            [
                15843,
                15875
            ],
            [
                15875,
                15975
            ],
            [
                15975,
                16153
            ],
            [
                16153,
                16325
            ],
            [
                16325,
                16358
            ],
            [
                16358,
                16380
            ],
            [
                16380,
                16411
            ],
            [
                16411,
                16443
            ],
            [
                16443,
                16451
            ],
            [
                16451,
                16470
            ],
            [
                16470,
                16490
            ],
            [
                16490,
                16572
            ],
            [
                16572,
                16683
            ],
            [
                16683,
                16730
            ],
            [
                16730,
                16752
            ],
            [
                16752,
                16820
            ],
            [
                16820,
                16859
            ],
            [
                16859,
                16974
            ],
            [
                16974,
                17022
            ],
            [
                17022,
                17082
            ],
            [
                17082,
                17153
            ],
            [
                17153,
                17219
            ],
            [
                17219,
                17237
            ],
            [
                17237,
                17288
            ],
            [
                17288,
                17381
            ],
            [
                17381,
                17518
            ],
            [
                17518,
                17586
            ],
            [
                17586,
                17688
            ],
            [
                17688,
                17736
            ],
            [
                17736,
                17789
            ],
            [
                17789,
                17879
            ],
            [
                17879,
                17946
            ],
            [
                17946,
                17954
            ],
            [
                17954,
                18119
            ],
            [
                18119,
                18196
            ],
            [
                18196,
                18201
            ],
            [
                18201,
                18257
            ],
            [
                18257,
                18284
            ],
            [
                18284,
                18295
            ],
            [
                18295,
                18332
            ],
            [
                18332,
                18401
            ],
            [
                18401,
                18509
            ],
            [
                18509,
                18635
            ],
            [
                18635,
                18815
            ],
            [
                18815,
                18981
            ],
            [
                18981,
                19153
            ],
            [
                19153,
                19215
            ],
            [
                19215,
                19378
            ],
            [
                19378,
                19699
            ],
            [
                19699,
                19902
            ],
            [
                19902,
                20093
            ],
            [
                20093,
                20172
            ],
            [
                20172,
                20213
            ],
            [
                20213,
                20240
            ],
            [
                20240,
                20351
            ],
            [
                20351,
                20413
            ],
            [
                20413,
                20432
            ],
            [
                20432,
                20571
            ],
            [
                20571,
                20614
            ],
            [
                20614,
                20677
            ],
            [
                20677,
                20768
            ],
            [
                20768,
                20959
            ],
            [
                20959,
                20987
            ],
            [
                20987,
                21022
            ],
            [
                21022,
                21030
            ],
            [
                21030,
                21077
            ],
            [
                21077,
                21088
            ],
            [
                21088,
                21127
            ],
            [
                21127,
                21237
            ],
            [
                21237,
                21290
            ],
            [
                21290,
                21465
            ],
            [
                21465,
                21599
            ],
            [
                21599,
                21640
            ],
            [
                21640,
                21692
            ],
            [
                21692,
                21724
            ],
            [
                21724,
                21800
            ],
            [
                21800,
                21854
            ],
            [
                21854,
                21882
            ],
            [
                21882,
                21912
            ],
            [
                21912,
                22163
            ],
            [
                22163,
                22363
            ],
            [
                22363,
                22454
            ],
            [
                22454,
                22710
            ],
            [
                22710,
                22787
            ],
            [
                22787,
                22874
            ],
            [
                22874,
                22902
            ],
            [
                22902,
                22972
            ],
            [
                22972,
                23215
            ],
            [
                23215,
                23585
            ],
            [
                23585,
                23767
            ],
            [
                23767,
                23871
            ],
            [
                23871,
                24135
            ],
            [
                24135,
                24487
            ],
            [
                24487,
                24662
            ],
            [
                24662,
                24685
            ],
            [
                24685,
                24718
            ],
            [
                24718,
                24737
            ],
            [
                24737,
                24787
            ],
            [
                24787,
                24827
            ],
            [
                24827,
                24844
            ],
            [
                24844,
                24873
            ],
            [
                24873,
                24898
            ],
            [
                24898,
                24934
            ],
            [
                24934,
                24951
            ],
            [
                24951,
                25061
            ],
            [
                25061,
                25090
            ],
            [
                25090,
                25123
            ],
            [
                25123,
                25240
            ],
            [
                25240,
                25369
            ],
            [
                25369,
                25431
            ],
            [
                25431,
                25489
            ],
            [
                25489,
                25499
            ],
            [
                25499,
                25693
            ],
            [
                25693,
                25785
            ],
            [
                25785,
                26060
            ],
            [
                26060,
                26201
            ],
            [
                26201,
                26288
            ],
            [
                26288,
                26399
            ],
            [
                26399,
                26581
            ],
            [
                26581,
                26660
            ],
            [
                26660,
                26680
            ],
            [
                26680,
                26770
            ],
            [
                26770,
                26800
            ],
            [
                26800,
                26901
            ],
            [
                26901,
                27123
            ]
        ]
    },
    "abridged": {
        "text": "Miss Isabella moped about the park and garden, silent and in tears; and her brother shut himself up among books that he never opened - expecting that Catherine would repent and come to ask his pardon. Meanwhile, she fasted, thinking that at every meal Edgar regretted her absence, and that pride alone stopped him from throwing himself at her feet.\nI went about my household duties, convinced that I was the only sensible soul in the place. I wasted no pity on any of them, but determined they should recover as they pleased; and though it was tiresomely slow, at last I saw some progress.\nMrs. Linton, on the third day, unbarred her door, and asked for water and a basin of gruel, for she believed she was dying. I believed no such thing, so I kept it to myself and brought her some tea and dry toast. She ate and drank eagerly, and sank back on her pillow, groaning.\n'Oh, I will die,' she exclaimed, 'since no one cares about me.' Then she murmured, 'No, I'll not die - he'd be glad - he would never miss me!'\n'Did you want anything, ma'am?' I inquired, still keeping my composure, in spite of her ghastly looks and strange manner.\n'What is that apathetic being doing?' she demanded, pushing the tangled hair from her wasted face.\n'If you mean Mr. Linton, he's tolerably well, I think. He is continually among his books, since he has no other company.'\nI should not have spoken so if I had known her true condition, but I believed that she was acting illness.\n'Among his books!' she cried. 'And I dying! My God! does he know how I'm altered? Cannot you inform him that it is frightful earnest? Nelly, are you speaking the truth about him? Is he actually so utterly indifferent for my life?'\n'Why, ma'am,' I answered, 'of course the master does not fear that you will let yourself die of hunger.'\n'You think not? Persuade him!' she returned. 'Say you are certain I will!'\n'No, you forget, Mrs. Linton,' I suggested, 'that you have eaten some food this evening, and tomorrow you will perceive its good effects.'\n'If I were only sure it would kill him,' she interrupted, 'I'd kill myself directly! These three awful nights I've never closed my eyes - and oh, I've been tormented! I've been haunted, Nelly! But I begin to think you don't like me. How strange! I thought, though everybody hated and despised each other, they could not avoid loving me. And they have all turned to enemies. How dreary to meet death, surrounded by their cold faces! Isabella, afraid to enter the room, dreading to watch Catherine go. And Edgar standing solemnly by to see it over; then offering thanks to God for restoring peace to his house, and going back to his books! What has he to do with books, when I am dying?'\nShe could not bear the idea of Mr. Linton's philosophical resignation. Tossing about feverishly, she tore the pillow with her teeth; then raising herself up all burning, desired that I would open the window. We were in the middle of winter, and I objected. But her face and her changing moods began to alarm me terribly.\nOne minute she was violent; the next, she was pulling the feathers from the rents she had just made in the pillow, and arranging them on the sheet according to their species.\n'That's a turkey's,' she murmured to herself; 'and this is a wild duck's; and this is a pigeon's. Ah, they put pigeons' feathers in the pillows - no wonder I couldn't die! Let me take care to throw it on the floor when I lie down. And here is a moor-cock's; and this - I should know it among a thousand - it's a lapwing's. Bonny bird; wheeling over our heads in the middle of the moor. We saw its nest in the winter, full of little skeletons. Heathcliff set a trap over it, and the old ones dared not come. I made him promise he'd never shoot a lapwing after that, and he didn't. Yes, here are more! Did he shoot my lapwings, Nelly? Are they red, any of them? Let me look.'\n'Give over with that baby-work!' I interrupted, dragging the pillow away, for she was removing its contents by handfuls. 'Lie down and shut your eyes: you're wandering. There's a mess! The down is flying about like snow.' I began to gather it up.\n'I see in you, Nelly,' she continued dreamily, 'an aged woman, with grey hair and bent shoulders. This bed is the fairy cave under Penistone crags, and you are gathering elf-bolts to hurt our cattle; pretending that they are only locks of wool. That's what you'll come to fifty years hence: I know you are not so now. I'm not wandering: I know it's night, and there are two candles on the table making the black press shine like jet.'\n'The black press? where is that?' I asked. 'You are talking in your sleep!'\n'It's against the wall, as it always is,' she replied. 'It does appear odd - I see a face in it!'\n'There's no press in the room, and never was,' said I.\n'Don't you see that face?' she inquired, gazing earnestly at the mirror.\nSay what I could, I could not make her comprehend it was her own; so I covered it with a shawl.\n'It's behind there still!' she said anxiously. 'Who is it? I hope it will not come out when you are gone! Oh! Nelly, the room is haunted! I'm afraid of being alone!'\nI took her hand, and bid her be still; for she shuddered, and kept straining her gaze towards the glass.\n'There's nobody here!' I insisted. 'It was yourself, Mrs. Linton.'\n'Myself!' she gasped, 'and the clock is striking twelve! It's true, then! that's dreadful!'\nShe pulled the bed-clothes over her eyes. I attempted to steal to the door to call her husband; but I was summoned back by a piercing shriek - the shawl had dropped from the mirror.\n'Why, what is the matter?' cried I. 'Wake up! That is the mirror, Mrs. Linton; and you see yourself in it, and there am I too by your side.'\nShe was trembling and bewildered; but the horror gradually passed from her face and gave way to a glow of shame.\n'Oh, dear! I thought I was back at Wuthering Heights,' she sighed. 'Because I'm weak, my brain got confused. Stay with me. I dread sleeping: my dreams appal me.'\n'A sound sleep would do you good, ma'am,' I answered: 'and I hope you will not try starving again.'\n'Oh, if I were but in my own bed in the old house!' she went on bitterly, wringing her hands. 'And that wind sounding in the firs. Do let me feel it - it comes straight down the moor - do let me have one breath!'\nTo pacify her I held the window open a few seconds. A cold blast rushed through; I closed it, and returned to my post. She lay still now, her face bathed in tears. Exhaustion had entirely subdued her: our fiery Catherine was no better than a wailing child.\n'How long is it since I shut myself in here?' she asked.\n'Three days,' I replied.\n'What! Only that brief time?'\n'Long enough to live on nothing but cold water and ill-temper,' observed I.\n'Well, it seems a weary number of hours,' she muttered doubtfully: 'it must be more. I remember running into this room desperate after they quarrelled. Then utter blackness overwhelmed me, and I fell on the floor. I felt sure of having a fit, or going raging mad. Before I recovered, it began to be dawn, and, Nelly, I'll tell you what I thought, and what has kept recurring till I feared for my reason.\n'I thought as I lay there, with my head against that table leg, and my eyes dimly seeing the grey square of the window, that I was enclosed in the oak-panelled bed at home; and my heart ached with some great grief which I could not recollect. I pondered, and worried myself to discover what it could be, and, most strangely, the whole last seven years of my life grew a blank! I did not recall them at all. I was a child; my father was just buried, and I was separated from Heathcliff for the first time. Rousing from a dismal doze after a night of weeping, I lifted my hand: it struck the table-top, and then memory burst in, in a paroxysm of despair.\n'I cannot say why I felt so wildly wretched - but, supposing at twelve years old I had been wrenched from the Heights, and from Heathcliff, and been converted at a stroke into Mrs. Linton, the lady of Thrushcross Grange, the wife of a stranger. You may imagine the abyss where I grovelled! You should have spoken to Edgar, indeed you should! Oh, I'm burning! I wish I were out of doors! I wish I were a girl again, half savage and hardy, and free! Why am I so changed? I'm sure I should be myself were I among the heather on those hills. Open the window again! Quick, why don't you move?'\n'Because I won't give you your death of cold,' I answered.\n'You won't give me a chance of life, you mean,' she said, sullenly. 'I'll open it myself.'\nAnd before I could stop her, she crossed the room, walking very uncertainly, threw open the window and bent out, careless of the frosty air that cut about her shoulders as keen as a knife. I tried to make her retire; but her delirious strength surpassed mine.\nThere was no moon, and everything lay in misty darkness: not a light gleamed from any house, far or near; and those at Wuthering Heights were never visible - still she asserted she caught their shining.\n'Look!' she cried eagerly, 'that's my room with the candle, and the trees swaying before it; and the other candle is in Joseph's garret. Joseph sits up late, doesn't he? He's waiting till I come home so that he may lock the gate. Well, he'll wait a while yet. We must pass by Gimmerton Kirk to go that rough journey! We've braved its ghosts often together, and dared each other to stand among the graves. But, Heathcliff, if I dare you now, will you venture? If you do, I'll keep you. I'll not lie there by myself: they may bury me twelve feet deep, but I won't rest till you are with me!'\nShe paused, and resumed with a strange smile. 'He's considering - he'd rather I'd come to him! Find a way, then! not through that churchyard. You are slow! Be content, you always followed me!'\nPerceiving it vain to argue against her insanity, I was planning how to wrap something around her, without letting go of her (for I could not trust her alone by the gaping window), when, to my consternation, Mr. Linton entered. He had just come from the library, and had heard our talking.\n'Oh, sir!' I cried, 'My poor mistress is ill, and I cannot manage her at all; pray, persuade her to go to bed.'\n'Catherine ill?' he said, hastening over to us. 'Shut the window, Ellen! Catherine!'\nMrs. Linton's haggard appearance smote him speechless, and he could only glance from her to me in horrified astonishment.\n'She's been fretting here,' I continued, 'and eating scarcely anything, and never complaining: she would let no-one in till this evening, and so we couldn't inform you of her state, as we were not aware of it ourselves; but it is nothing.'\n'It is nothing, is it, Ellen Dean?' he said sternly. 'You shall account for keeping me ignorant of this!' He took his wife in his arms, and looked at her with anguish.\nAt first she gave him no glance of recognition: but by degrees she shifted her attention from the outer darkness and centred it on him.\n'Ah! you are come, are you, Edgar Linton?' she said angrily. 'You are always found when least wanted, and when you are wanted, never! I suppose we shall have plenty of lamentations now - but they can't keep me from my narrow home out yonder: my resting-place, where I'm bound before spring is over! Not among the Lintons, mind, under the chapel-roof, but in the open air, with a head-stone; and you may please yourself whether you go to them or come to me!'\n'Catherine, what have you done?' began the master. 'Am I nothing to you any more? Do you love that wretch Heath-'\n'Hush!' cried Mrs. Linton. 'Hush, this moment! You mention that name and I will leap from the window! My soul will be on that hill-top before you lay hands on me again. I don't want you, Edgar: I'm past wanting you. Return to your books.'\n'Her mind wanders, sir,' I said. 'She has been talking nonsense the whole evening; but let her have quiet, and she'll rally. We must be cautious not to vex her.'\n'I desire no further advice from you,' answered Mr. Linton. 'You knew your mistress's nature, and you encouraged me to harass her. And not to give me one hint of how she has been these three days! It was heartless! Months of sickness could not cause such a change!'\nI began to defend myself, thinking it too bad to be blamed for another's wicked waywardness. 'I knew Mrs. Linton to be headstrong,' cried I: 'but I didn't know that you wished to foster her fierce temper! I didn't know that, to humour her, I should wink at Mr. Heathcliff. I was a faithful servant in telling you! Well, next time you may gather intelligence for yourself!'\n'The next time you bring a tale to me you shall quit my service, Ellen Dean,' he replied.\n'You'd rather hear nothing about it, I suppose, then, Mr. Linton?' said I. 'Heathcliff has your permission to come a-courting to Miss, and to drop in at every opportunity to poison the mistress against you?'\nConfused as Catherine was, her wits were alert.\n'Ah! Nelly has played traitor,' she exclaimed, passionately. 'Nelly is my hidden enemy. You witch! Let me go, and I'll make her howl!'\nShe struggled furiously to free herself from Linton's arms. Resolving to seek medical aid, I left the room.\nIn passing through the garden to reach the road, I saw something white moving. Despite my hurry, I stopped to examine it, lest ever after I should imagine that it was a creature of the other world. My surprise and perplexity were great on discovering Miss Isabella's spaniel suspended by a handkerchief, and nearly at its last gasp. I quickly released the dog, wondering how it could have got there, and who had treated it so. While untying it, I thought I caught the beat of horses' feet galloping at some distance; a strange sound at two o'clock in the morning.\nDr. Kenneth was just leaving the house as I came up the street; and my account of Catherine Linton's illness induced him to accompany me back immediately. He was a plain rough man, and bluntly spoke his doubt of her surviving this second attack.\n'Nelly Dean,' said he, 'I can't help fancying there's an extra cause for this. What has been happening at the Grange? We've odd reports up here. A stout, hearty lass like Catherine does not fall ill for a trifle. How did it begin?'\n'The master will tell you,' I answered; 'but you know the Earnshaws' violent dispositions, and Mrs. Linton caps them all. I may say this; it began in a quarrel. She was struck during a tempest of passion with a kind of fit. That's her account, at least: for she flew off and locked herself up. Afterwards, she refused to eat, and now she alternately raves and remains in a half dream, with her mind filled with all sorts of strange ideas.'\n'Mr. Linton will be sorry?' asked Kenneth.\n'Sorry? he'll break his heart should anything happen!' I replied. 'Don't alarm him more than necessary.'\n'Well, I told him to beware,' said my companion. 'Hasn't he been intimate with Mr. Heathcliff lately?'\n'Heathcliff frequently visits at the Grange,' answered I, 'though more because the mistress knew him when a boy, than because the master likes his company. At present he's banned from calling, after presuming to aspire after Miss Linton.'\n'And does Miss Linton turn a cold shoulder on him?'\n'I'm not in her confidence.'\n'No, she's a sly one,' he remarked, shaking his head. 'She keeps her own counsel! But she's a real little fool. I have it from good authority that last night she and Heathcliff were walking in the plantation at the back of your house for two hours; and he pressed her not to go in again, but just mount his horse and ride away with him! She promised to be prepared on their next meeting; so you urge Mr. Linton to look sharp!'\nThis news filled me with fresh fears, and I ran most of the way back. The little dog was yelping in the garden; I seized it and carried it in with me.\nOn ascending to Isabella's room, my suspicions were confirmed: it was empty. What could be done? There was a possibility of overtaking them if pursued instantly. I could not pursue them, however; and I dared not tell my master, absorbed as he was in his present calamity, and having no heart to spare for a second grief! I saw nothing for it but to hold my tongue.\nWhen Dr. Kenneth arrived, Catherine lay in a troubled sleep. Her husband hung over her pillow, watching every change of her features. The doctor spoke hopefully of her recovery if we could only keep her perfectly tranquil. To me, he said the danger was not so much death, as the loss of her wits.\nI did not close my eyes that night, nor did Mr. Linton: and the servants were all up long before the usual hour, moving stealthily through the house, and exchanging whispers. Everyone was active but Miss Isabella. Her brother asked if she had risen, and I trembled lest he should send me to call her; but I was spared that. One of the maids, a thoughtless girl, came panting into the chamber, crying: 'Oh, dear, dear! What next? Master, master, our young lady-'\n'Hold your noise!' I cried hastily.\n'Speak lower, Mary. What is the matter?' said Mr. Linton. 'What ails your young lady?'\n'She's gone! Heathcliff's run off wi' her!' gasped the girl.\n'No! It cannot be!' exclaimed Linton.\n'Why, I met a lad that brings milk here,' she stammered, 'and he asked whether we weren't in trouble at the Grange. Then he told me how a gentleman and lady had stopped at a blacksmith's, two miles out of Gimmerton, not long after midnight! and the blacksmith's daughter recognised them. The man was Heathcliff, she felt certain: the lady had a cloak about her face; but when she took a drink of water she saw her very plain. They rode on away from the village. The lass told it all over Gimmerton this morning.'\n'Are we to try and bring her back?' I asked him. 'What should we do?'\n'She went of her own accord,' answered the master; 'she had a right to go if she pleased. Trouble me no more about her. Hereafter she is only my sister in name: not because I disown her, but because she has disowned me.'\nAnd that was all he said on the subject. He did not mention her in any way, except to tell me to send her things to her new home, when I knew where it was.",
        "paragraph_chars": [
            [
                0,
                349
            ],
            [
                349,
                590
            ],
            [
                590,
                869
            ],
            [
                869,
                1012
            ],
            [
                1012,
                1134
            ],
            [
                1134,
                1233
            ],
            [
                1233,
                1355
            ],
            [
                1355,
                1462
            ],
            [
                1462,
                1693
            ],
            [
                1693,
                1798
            ],
            [
                1798,
                1873
            ],
            [
                1873,
                2012
            ],
            [
                2012,
                2698
            ],
            [
                2698,
                3019
            ],
            [
                3019,
                3194
            ],
            [
                3194,
                3868
            ],
            [
                3868,
                4115
            ],
            [
                4115,
                4550
            ],
            [
                4550,
                4626
            ],
            [
                4626,
                4724
            ],
            [
                4724,
                4779
            ],
            [
                4779,
                4852
            ],
            [
                4852,
                4948
            ],
            [
                4948,
                5114
            ],
            [
                5114,
                5219
            ],
            [
                5219,
                5286
            ],
            [
                5286,
                5378
            ],
            [
                5378,
                5560
            ],
            [
                5560,
                5701
            ],
            [
                5701,
                5814
            ],
            [
                5814,
                5976
            ],
            [
                5976,
                6076
            ],
            [
                6076,
                6289
            ],
            [
                6289,
                6546
            ],
            [
                6546,
                6603
            ],
            [
                6603,
                6628
            ],
            [
                6628,
                6658
            ],
            [
                6658,
                6734
            ],
            [
                6734,
                7138
            ],
            [
                7138,
                7791
            ],
            [
                7791,
                8380
            ],
            [
                8380,
                8439
            ],
            [
                8439,
                8530
            ],
            [
                8530,
                8790
            ],
            [
                8790,
                8993
            ],
            [
                8993,
                9583
            ],
            [
                9583,
                9776
            ],
            [
                9776,
                10066
            ],
            [
                10066,
                10178
            ],
            [
                10178,
                10263
            ],
            [
                10263,
                10385
            ],
            [
                10385,
                10625
            ],
            [
                10625,
                10793
            ],
            [
                10793,
                10929
            ],
            [
                10929,
                11387
            ],
            [
                11387,
                11501
            ],
            [
                11501,
                11740
            ],
            [
                11740,
                11902
            ],
            [
                11902,
                12168
            ],
            [
                12168,
                12541
            ],
            [
                12541,
                12631
            ],
            [
                12631,
                12839
            ],
            [
                12839,
                12887
            ],
            [
                12887,
                13022
            ],
            [
                13022,
                13130
            ],
            [
                13130,
                13694
            ],
            [
                13694,
                13940
            ],
            [
                13940,
                14172
            ],
            [
                14172,
                14612
            ],
            [
                14612,
                14655
            ],
            [
                14655,
                14760
            ],
            [
                14760,
                14863
            ],
            [
                14863,
                15102
            ],
            [
                15102,
                15154
            ],
            [
                15154,
                15183
            ],
            [
                15183,
                15610
            ],
            [
                15610,
                15761
            ],
            [
                15761,
                16126
            ],
            [
                16126,
                16423
            ],
            [
                16423,
                16885
            ],
            [
                16885,
                16921
            ],
            [
                16921,
                17008
            ],
            [
                17008,
                17069
            ],
            [
                17069,
                17107
            ],
            [
                17107,
                17620
            ],
            [
                17620,
                17690
            ],
            [
                17690,
                17911
            ],
            [
                17911,
                18066
            ]
        ],
        "segment_chars": [
            [
                0,
                201
            ],
            [
                201,
                349
            ],
            [
                349,
                441
            ],
            [
                441,
                590
            ],
            [
                590,
                714
            ],
            [
                714,
                803
            ],
            [
                803,
                869
            ],
            [
                869,
                933
            ],
            [
                933,
                1012
            ],
            [
                1012,
                1044
            ],
            [
                1044,
                1134
            ],
            [
                1134,
                1172
            ],
            [
                1172,
                1233
            ],
            [
                1233,
                1288
            ],
            [
                1288,
                1355
            ],
            [
                1355,
                1462
            ],
            [
                1462,
                1481
            ],
            [
                1481,
                1492
            ],
            [
                1492,
                1506
            ],
            [
                1506,
                1514
            ],
            [
                1514,
                1544
            ],
            [
                1544,
                1596
            ],
            [
                1596,
                1641
            ],
            [
                1641,
                1693
            ],
            [
                1693,
                1798
            ],
            [
                1798,
                1814
            ],
            [
                1814,
                1829
            ],
            [
                1829,
                1843
            ],
            [
                1843,
                1873
            ],
            [
                1873,
                2012
            ],
            [
                2012,
                2097
            ],
            [
                2097,
                2179
            ],
            [
                2179,
                2205
            ],
            [
                2205,
                2245
            ],
            [
                2245,
                2258
            ],
            [
                2258,
                2349
            ],
            [
                2349,
                2386
            ],
            [
                2386,
                2444
            ],
            [
                2444,
                2512
            ],
            [
                2512,
                2650
            ],
            [
                2650,
                2698
            ],
            [
                2698,
                2769
            ],
            [
                2769,
                2906
            ],
            [
                2906,
                2955
            ],
            [
                2955,
                3019
            ],
            [
                3019,
                3194
            ],
            [
                3194,
                3292
            ],
            [
                3292,
                3366
            ],
            [
                3366,
                3425
            ],
            [
                3425,
                3517
            ],
            [
                3517,
                3580
            ],
            [
                3580,
                3637
            ],
            [
                3637,
                3701
            ],
            [
                3701,
                3774
            ],
            [
                3774,
                3794
            ],
            [
                3794,
                3827
            ],
            [
                3827,
                3854
            ],
            [
                3854,
                3868
            ],
            [
                3868,
                3901
            ],
            [
                3901,
                3989
            ],
            [
                3989,
                4037
            ],
            [
                4037,
                4053
            ],
            [
                4053,
                4090
            ],
            [
                4090,
                4115
            ],
            [
                4115,
                4213
            ],
            [
                4213,
                4360
            ],
            [
                4360,
                4433
            ],
            [
                4433,
                4550
            ],
            [
                4550,
                4568
            ],
            [
                4568,
                4584
            ],
            [
                4584,
                4593
            ],
            [
                4593,
                4626
            ],
            [
                4626,
                4681
            ],
            [
                4681,
                4724
            ],
            [
                4724,
                4779
            ],
            [
                4779,
                4806
            ],
            [
                4806,
                4852
            ],
            [
                4852,
                4948
            ],
            [
                4948,
                4975
            ],
            [
                4975,
                4995
            ],
            [
                4995,
                5007
            ],
            [
                5007,
                5054
            ],
            [
                5054,
                5058
            ],
            [
                5058,
                5086
            ],
            [
                5086,
                5114
            ],
            [
                5114,
                5219
            ],
            [
                5219,
                5242
            ],
            [
                5242,
                5254
            ],
            [
                5254,
                5286
            ],
            [
                5286,
                5296
            ],
            [
                5296,
                5343
            ],
            [
                5343,
                5360
            ],
            [
                5360,
                5378
            ],
            [
                5378,
                5420
            ],
            [
                5420,
                5560
            ],
            [
                5560,
                5587
            ],
            [
                5587,
                5596
            ],
            [
                5596,
                5606
            ],
            [
                5606,
                5701
            ],
            [
                5701,
                5814
            ],
            [
                5814,
                5825
            ],
            [
                5825,
                5881
            ],
            [
                5881,
                5923
            ],
            [
                5923,
                5937
            ],
            [
                5937,
                5976
            ],
            [
                5976,
                6076
            ],
            [
                6076,
                6128
            ],
            [
                6128,
                6170
            ],
            [
                6170,
                6207
            ],
            [
                6207,
                6289
            ],
            [
                6289,
                6341
            ],
            [
                6341,
                6408
            ],
            [
                6408,
                6453
            ],
            [
                6453,
                6546
            ],
            [
                6546,
                6592
            ],
            [
                6592,
                6603
            ],
            [
                6603,
                6628
            ],
            [
                6628,
                6635
            ],
            [
                6635,
                6658
            ],
            [
                6658,
                6734
            ],
            [
                6734,
                6819
            ],
            [
                6819,
                6886
            ],
            [
                6886,
                6948
            ],
            [
                6948,
                6998
            ],
            [
                6998,
                7138
            ],
            [
                7138,
                7381
            ],
            [
                7381,
                7515
            ],
            [
                7515,
                7545
            ],
            [
                7545,
                7643
            ],
            [
                7643,
                7791
            ],
            [
                7791,
                8036
            ],
            [
                8036,
                8081
            ],
            [
                8081,
                8133
            ],
            [
                8133,
                8150
            ],
            [
                8150,
                8178
            ],
            [
                8178,
                8239
            ],
            [
                8239,
                8260
            ],
            [
                8260,
                8329
            ],
            [
                8329,
                8352
            ],
            [
                8352,
                8380
            ],
            [
                8380,
                8439
            ],
            [
                8439,
                8507
            ],
            [
                8507,
                8530
            ],
            [
                8530,
                8719
            ],
            [
                8719,
                8790
            ],
            [
                8790,
                8993
            ],
            [
                8993,
                9001
            ],
            [
                9001,
                9130
            ],
            [
                9130,
                9163
            ],
            [
                9163,
                9223
            ],
            [
                9223,
                9253
            ],
            [
                9253,
                9310
            ],
            [
                9310,
                9398
            ],
            [
                9398,
                9452
            ],
            [
                9452,
                9478
            ],
            [
                9478,
                9583
            ],
            [
                9583,
                9629
            ],
            [
                9629,
                9678
            ],
            [
                9678,
                9696
            ],
            [
                9696,
                9725
            ],
            [
                9725,
                9739
            ],
            [
                9739,
                9776
            ],
            [
                9776,
                10004
            ],
            [
                10004,
                10066
            ],
            [
                10066,
                10077
            ],
            [
                10077,
                10178
            ],
            [
                10178,
                10195
            ],
            [
                10195,
                10226
            ],
            [
                10226,
                10251
            ],
            [
                10251,
                10263
            ],
            [
                10263,
                10385
            ],
            [
                10385,
                10625
            ],
            [
                10625,
                10661
            ],
            [
                10661,
                10678
            ],
            [
                10678,
                10731
            ],
            [
                10731,
                10793
            ],
            [
                10793,
                10929
            ],
            [
                10929,
                10934
            ],
            [
                10934,
                10972
            ],
            [
                10972,
                10990
            ],
            [
                10990,
                11063
            ],
            [
                11063,
                11228
            ],
            [
                11228,
                11387
            ],
            [
                11387,
                11420
            ],
            [
                11420,
                11438
            ],
            [
                11438,
                11469
            ],
            [
                11469,
                11501
            ],
            [
                11501,
                11509
            ],
            [
                11509,
                11528
            ],
            [
                11528,
                11548
            ],
            [
                11548,
                11603
            ],
            [
                11603,
                11670
            ],
            [
                11670,
                11717
            ],
            [
                11717,
                11740
            ],
            [
                11740,
                11773
            ],
            [
                11773,
                11865
            ],
            [
                11865,
                11902
            ],
            [
                11902,
                11962
            ],
            [
                11962,
                12033
            ],
            [
                12033,
                12099
            ],
            [
                12099,
                12117
            ],
            [
                12117,
                12168
            ],
            [
                12168,
                12261
            ],
            [
                12261,
                12373
            ],
            [
                12373,
                12441
            ],
            [
                12441,
                12482
            ],
            [
                12482,
                12541
            ],
            [
                12541,
                12631
            ],
            [
                12631,
                12698
            ],
            [
                12698,
                12706
            ],
            [
                12706,
                12839
            ],
            [
                12839,
                12887
            ],
            [
                12887,
                12892
            ],
            [
                12892,
                12948
            ],
            [
                12948,
                12975
            ],
            [
                12975,
                12986
            ],
            [
                12986,
                13022
            ],
            [
                13022,
                13082
            ],
            [
                13082,
                13130
            ],
            [
                13130,
                13209
            ],
            [
                13209,
                13328
            ],
            [
                13328,
                13463
            ],
            [
                13463,
                13557
            ],
            [
                13557,
                13694
            ],
            [
                13694,
                13849
            ],
            [
                13849,
                13940
            ],
            [
                13940,
                14019
            ],
            [
                14019,
                14058
            ],
            [
                14058,
                14085
            ],
            [
                14085,
                14153
            ],
            [
                14153,
                14172
            ],
            [
                14172,
                14294
            ],
            [
                14294,
                14333
            ],
            [
                14333,
                14396
            ],
            [
                14396,
                14466
            ],
            [
                14466,
                14612
            ],
            [
                14612,
                14617
            ],
            [
                14617,
                14640
            ],
            [
                14640,
                14655
            ],
            [
                14655,
                14663
            ],
            [
                14663,
                14710
            ],
            [
                14710,
                14721
            ],
            [
                14721,
                14760
            ],
            [
                14760,
                14809
            ],
            [
                14809,
                14863
            ],
            [
                14863,
                15019
            ],
            [
                15019,
                15102
            ],
            [
                15102,
                15154
            ],
            [
                15154,
                15183
            ],
            [
                15183,
                15237
            ],
            [
                15237,
                15265
            ],
            [
                15265,
                15295
            ],
            [
                15295,
                15520
            ],
            [
                15520,
                15610
            ],
            [
                15610,
                15680
            ],
            [
                15680,
                15761
            ],
            [
                15761,
                15838
            ],
            [
                15838,
                15858
            ],
            [
                15858,
                15923
            ],
            [
                15923,
                16082
            ],
            [
                16082,
                16126
            ],
            [
                16126,
                16187
            ],
            [
                16187,
                16260
            ],
            [
                16260,
                16349
            ],
            [
                16349,
                16423
            ],
            [
                16423,
                16598
            ],
            [
                16598,
                16637
            ],
            [
                16637,
                16747
            ],
            [
                16747,
                16841
            ],
            [
                16841,
                16852
            ],
            [
                16852,
                16885
            ],
            [
                16885,
                16904
            ],
            [
                16904,
                16921
            ],
            [
                16921,
                16941
            ],
            [
                16941,
                16962
            ],
            [
                16962,
                16979
            ],
            [
                16979,
                17008
            ],
            [
                17008,
                17021
            ],
            [
                17021,
                17052
            ],
            [
                17052,
                17069
            ],
            [
                17069,
                17074
            ],
            [
                17074,
                17089
            ],
            [
                17089,
                17107
            ],
            [
                17107,
                17223
            ],
            [
                17223,
                17348
            ],
            [
                17348,
                17395
            ],
            [
                17395,
                17533
            ],
            [
                17533,
                17569
            ],
            [
                17569,
                17620
            ],
            [
                17620,
                17656
            ],
            [
                17656,
                17669
            ],
            [
                17669,
                17690
            ],
            [
                17690,
                17780
            ],
            [
                17780,
                17810
            ],
            [
                17810,
                17911
            ],
            [
                17911,
                17952
            ],
            [
                17952,
                18066
            ]
        ],
        "overlap_chars": [
            [
                0,
                4
            ],
            [
                14,
                46
            ],
            [
                47,
                53
            ],
            [
                54,
                57
            ],
            [
                58,
                134
            ],
            [
                145,
                159
            ],
            [
                160,
                165
            ],
            [
                166,
                172
            ],
            [
                173,
                176
            ],
            [
                177,
                181
            ],
            [
                182,
                188
            ],
            [
                193,
                199
            ],
            [
                199,
                200
            ],
            [
                210,
                211
            ],
            [
                212,
                215
            ],
            [
                216,
                222
            ],
            [
                222,
                223
            ],
            [
                233,
                257
            ],
            [
                268,
                284
            ],
            [
                285,
                289
            ],
            [
                290,
                301
            ],
            [
                310,
                318
            ],
            [
                328,
                347
            ],
            [
                349,
                350
            ],
            [
                362,
                364
            ],
            [
                381,
                382
            ],
            [
                398,
                399
            ],
            [
                404,
                407
            ],
            [
                439,
                441
            ],
            [
                441,
                442
            ],
            [
                465,
                467
            ],
            [
                472,
                473
            ],
            [
                478,
                500
            ],
            [
                509,
                524
            ],
            [
                524,
                543
            ],
            [
                544,
                559
            ],
            [
                561,
                563
            ],
            [
                569,
                570
            ],
            [
                580,
                588
            ],
            [
                588,
                590
            ],
            [
                590,
                643
            ],
            [
                654,
                659
            ],
            [
                660,
                714
            ],
            [
                714,
                803
            ],
            [
                803,
                857
            ],
            [
                857,
                858
            ],
            [
                859,
                868
            ],
            [
                870,
                884
            ],
            [
                887,
                901
            ],
            [
                903,
                921
            ],
            [
                922,
                930
            ],
            [
                933,
                937
            ],
            [
                950,
                951
            ],
            [
                953,
                989
            ],
            [
                990,
                1009
            ],
            [
                1017,
                1041
            ],
            [
                1044,
                1061
            ],
            [
                1070,
                1072
            ],
            [
                1073,
                1107
            ],
            [
                1114,
                1125
            ],
            [
                1126,
                1134
            ],
            [
                1135,
                1169
            ],
            [
                1172,
                1197
            ],
            [
                1211,
                1232
            ],
            [
                1234,
                1256
            ],
            [
                1256,
                1257
            ],
            [
                1258,
                1286
            ],
            [
                1286,
                1287
            ],
            [
                1288,
                1344
            ],
            [
                1355,
                1423
            ],
            [
                1433,
                1441
            ],
            [
                1460,
                1462
            ],
            [
                1463,
                1478
            ],
            [
                1481,
                1490
            ],
            [
                1490,
                1492
            ],
            [
                1493,
                1506
            ],
            [
                1506,
                1514
            ],
            [
                1514,
                1542
            ],
            [
                1544,
                1596
            ],
            [
                1596,
                1602
            ],
            [
                1603,
                1639
            ],
            [
                1639,
                1641
            ],
            [
                1641,
                1690
            ],
            [
                1694,
                1704
            ],
            [
                1707,
                1718
            ],
            [
                1720,
                1729
            ],
            [
                1730,
                1740
            ],
            [
                1741,
                1795
            ],
            [
                1799,
                1814
            ],
            [
                1823,
                1826
            ],
            [
                1829,
                1843
            ],
            [
                1848,
                1870
            ],
            [
                1874,
                1901
            ],
            [
                1904,
                1916
            ],
            [
                1918,
                1947
            ],
            [
                1948,
                1965
            ],
            [
                1975,
                2009
            ],
            [
                2013,
                2050
            ],
            [
                2053,
                2069
            ],
            [
                2071,
                2097
            ],
            [
                2097,
                2142
            ],
            [
                2148,
                2179
            ],
            [
                2179,
                2205
            ],
            [
                2205,
                2219
            ],
            [
                2226,
                2245
            ],
            [
                2245,
                2258
            ],
            [
                2258,
                2349
            ],
            [
                2349,
                2384
            ],
            [
                2384,
                2386
            ],
            [
                2386,
                2444
            ],
            [
                2444,
                2452
            ],
            [
                2452,
                2479
            ],
            [
                2489,
                2512
            ],
            [
                2512,
                2572
            ],
            [
                2573,
                2642
            ],
            [
                2643,
                2648
            ],
            [
                2648,
                2650
            ],
            [
                2650,
                2654
            ],
            [
                2655,
                2672
            ],
            [
                2673,
                2678
            ],
            [
                2678,
                2695
            ],
            [
                2698,
                2720
            ],
            [
                2726,
                2769
            ],
            [
                2769,
                2782
            ],
            [
                2783,
                2788
            ],
            [
                2793,
                2798
            ],
            [
                2799,
                2906
            ],
            [
                2906,
                2938
            ],
            [
                2939,
                2955
            ],
            [
                2959,
                2967
            ],
            [
                2968,
                2971
            ],
            [
                2972,
                2975
            ],
            [
                2985,
                2990
            ],
            [
                2991,
                3017
            ],
            [
                3017,
                3018
            ],
            [
                3019,
                3022
            ],
            [
                3023,
                3029
            ],
            [
                3030,
                3046
            ],
            [
                3055,
                3060
            ],
            [
                3065,
                3118
            ],
            [
                3119,
                3121
            ],
            [
                3132,
                3137
            ],
            [
                3148,
                3184
            ],
            [
                3185,
                3192
            ],
            [
                3192,
                3194
            ],
            [
                3199,
                3212
            ],
            [
                3215,
                3239
            ],
            [
                3241,
                3292
            ],
            [
                3292,
                3366
            ],
            [
                3366,
                3425
            ],
            [
                3425,
                3517
            ],
            [
                3517,
                3580
            ],
            [
                3580,
                3637
            ],
            [
                3637,
                3701
            ],
            [
                3701,
                3774
            ],
            [
                3774,
                3794
            ],
            [
                3794,
                3827
            ],
            [
                3827,
                3854
            ],
            [
                3854,
                3865
            ],
            [
                3869,
                3898
            ],
            [
                3901,
                3940
            ],
            [
                3940,
                3989
            ],
            [
                3990,
                4037
            ],
            [
                4037,
                4053
            ],
            [
                4053,
                4087
            ],
            [
                4090,
                4091
            ],
            [
                4108,
                4110
            ],
            [
                4113,
                4115
            ],
            [
                4116,
                4135
            ],
            [
                4138,
                4161
            ],
            [
                4163,
                4176
            ],
            [
                4183,
                4213
            ],
            [
                4213,
                4306
            ],
            [
                4313,
                4325
            ],
            [
                4326,
                4360
            ],
            [
                4360,
                4433
            ],
            [
                4433,
                4451
            ],
            [
                4452,
                4453
            ],
            [
                4459,
                4547
            ],
            [
                4555,
                4568
            ],
            [
                4568,
                4581
            ],
            [
                4584,
                4593
            ],
            [
                4594,
                4623
            ],
            [
                4627,
                4665
            ],
            [
                4668,
                4681
            ],
            [
                4682,
                4684
            ],
            [
                4685,
                4689
            ],
            [
                4690,
                4721
            ],
            [
                4730,
                4768
            ],
            [
                4771,
                4777
            ],
            [
                4777,
                4779
            ],
            [
                4783,
                4785
            ],
            [
                4786,
                4789
            ],
            [
                4790,
                4803
            ],
            [
                4806,
                4852
            ],
            [
                4852,
                4871
            ],
            [
                4887,
                4904
            ],
            [
                4905,
                4908
            ],
            [
                4909,
                4922
            ],
            [
                4923,
                4948
            ],
            [
                4949,
                4972
            ],
            [
                4975,
                4978
            ],
            [
                4984,
                4995
            ],
            [
                4996,
                5007
            ],
            [
                5007,
                5054
            ],
            [
                5054,
                5058
            ],
            [
                5058,
                5086
            ],
            [
                5086,
                5111
            ],
            [
                5114,
                5129
            ],
            [
                5129,
                5145
            ],
            [
                5151,
                5156
            ],
            [
                5157,
                5160
            ],
            [
                5161,
                5166
            ],
            [
                5170,
                5175
            ],
            [
                5181,
                5219
            ],
            [
                5225,
                5239
            ],
            [
                5242,
                5254
            ],
            [
                5255,
                5261
            ],
            [
                5270,
                5283
            ],
            [
                5289,
                5293
            ],
            [
                5296,
                5307
            ],
            [
                5309,
                5343
            ],
            [
                5343,
                5360
            ],
            [
                5360,
                5375
            ],
            [
                5389,
                5392
            ],
            [
                5405,
                5420
            ],
            [
                5420,
                5452
            ],
            [
                5461,
                5551
            ],
            [
                5558,
                5560
            ],
            [
                5561,
                5584
            ],
            [
                5587,
                5596
            ],
            [
                5597,
                5606
            ],
            [
                5606,
                5613
            ],
            [
                5614,
                5698
            ],
            [
                5701,
                5704
            ],
            [
                5719,
                5733
            ],
            [
                5733,
                5734
            ],
            [
                5735,
                5775
            ],
            [
                5785,
                5789
            ],
            [
                5794,
                5814
            ],
            [
                5815,
                5825
            ],
            [
                5825,
                5840
            ],
            [
                5846,
                5866
            ],
            [
                5869,
                5880
            ],
            [
                5882,
                5921
            ],
            [
                5921,
                5923
            ],
            [
                5923,
                5937
            ],
            [
                5937,
                5973
            ],
            [
                5977,
                6015
            ],
            [
                6018,
                6029
            ],
            [
                6031,
                6041
            ],
            [
                6046,
                6050
            ],
            [
                6059,
                6073
            ],
            [
                6077,
                6125
            ],
            [
                6128,
                6170
            ],
            [
                6171,
                6205
            ],
            [
                6205,
                6207
            ],
            [
                6207,
                6286
            ],
            [
                6289,
                6313
            ],
            [
                6326,
                6341
            ],
            [
                6341,
                6408
            ],
            [
                6408,
                6453
            ],
            [
                6453,
                6463
            ],
            [
                6464,
                6488
            ],
            [
                6488,
                6546
            ],
            [
                6547,
                6589
            ],
            [
                6592,
                6601
            ],
            [
                6601,
                6603
            ],
            [
                6617,
                6626
            ],
            [
                6629,
                6635
            ],
            [
                6635,
                6655
            ],
            [
                6659,
                6719
            ],
            [
                6722,
                6734
            ],
            [
                6735,
                6773
            ],
            [
                6776,
                6800
            ],
            [
                6802,
                6819
            ],
            [
                6819,
                6829
            ],
            [
                6830,
                6862
            ],
            [
                6863,
                6873
            ],
            [
                6874,
                6884
            ],
            [
                6884,
                6886
            ],
            [
                6891,
                6948
            ],
            [
                6948,
                6954
            ],
            [
                6960,
                6996
            ],
            [
                6998,
                7016
            ],
            [
                7016,
                7108
            ],
            [
                7109,
                7137
            ],
            [
                7139,
                7219
            ],
            [
                7227,
                7357
            ],
            [
                7358,
                7381
            ],
            [
                7381,
                7515
            ],
            [
                7515,
                7531
            ],
            [
                7537,
                7545
            ],
            [
                7545,
                7590
            ],
            [
                7607,
                7611
            ],
            [
                7612,
                7622
            ],
            [
                7627,
                7630
            ],
            [
                7641,
                7643
            ],
            [
                7651,
                7712
            ],
            [
                7712,
                7737
            ],
            [
                7737,
                7763
            ],
            [
                7763,
                7764
            ],
            [
                7765,
                7790
            ],
            [
                7792,
                7834
            ],
            [
                7837,
                7913
            ],
            [
                7914,
                7918
            ],
            [
                7919,
                7929
            ],
            [
                7929,
                8011
            ],
            [
                8012,
                8034
            ],
            [
                8034,
                8036
            ],
            [
                8036,
                8043
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8131
            ],
            [
                8131,
                8133
            ],
            [
                8133,
                8150
            ],
            [
                8150,
                8178
            ],
            [
                8178,
                8237
            ],
            [
                8237,
                8239
            ],
            [
                8239,
                8260
            ],
            [
                8260,
                8294
            ],
            [
                8295,
                8329
            ],
            [
                8329,
                8350
            ],
            [
                8350,
                8352
            ],
            [
                8352,
                8377
            ],
            [
                8381,
                8424
            ],
            [
                8427,
                8439
            ],
            [
                8440,
                8484
            ],
            [
                8487,
                8507
            ],
            [
                8508,
                8527
            ],
            [
                8530,
                8533
            ],
            [
                8534,
                8548
            ],
            [
                8554,
                8612
            ],
            [
                8618,
                8621
            ],
            [
                8629,
                8719
            ],
            [
                8719,
                8720
            ],
            [
                8727,
                8729
            ],
            [
                8735,
                8738
            ],
            [
                8739,
                8745
            ],
            [
                8747,
                8750
            ],
            [
                8751,
                8773
            ],
            [
                8774,
                8788
            ],
            [
                8788,
                8789
            ],
            [
                8790,
                8823
            ],
            [
                8824,
                8894
            ],
            [
                8896,
                8993
            ],
            [
                8994,
                8998
            ],
            [
                9001,
                9019
            ],
            [
                9021,
                9051
            ],
            [
                9051,
                9130
            ],
            [
                9130,
                9163
            ],
            [
                9163,
                9192
            ],
            [
                9196,
                9223
            ],
            [
                9223,
                9253
            ],
            [
                9253,
                9294
            ],
            [
                9295,
                9300
            ],
            [
                9301,
                9310
            ],
            [
                9310,
                9396
            ],
            [
                9396,
                9398
            ],
            [
                9398,
                9452
            ],
            [
                9452,
                9478
            ],
            [
                9478,
                9542
            ],
            [
                9543,
                9580
            ],
            [
                9583,
                9629
            ],
            [
                9630,
                9678
            ],
            [
                9678,
                9696
            ],
            [
                9696,
                9712
            ],
            [
                9723,
                9725
            ],
            [
                9725,
                9739
            ],
            [
                9739,
                9773
            ],
            [
                9776,
                9844
            ],
            [
                9845,
                9852
            ],
            [
                9853,
                9862
            ],
            [
                9870,
                9882
            ],
            [
                9894,
                9896
            ],
            [
                9901,
                9947
            ],
            [
                9954,
                9983
            ],
            [
                9984,
                10004
            ],
            [
                10004,
                10010
            ],
            [
                10016,
                10037
            ],
            [
                10037,
                10038
            ],
            [
                10039,
                10042
            ],
            [
                10043,
                10046
            ],
            [
                10053,
                10064
            ],
            [
                10064,
                10066
            ],
            [
                10067,
                10074
            ],
            [
                10087,
                10115
            ],
            [
                10116,
                10149
            ],
            [
                10150,
                10175
            ],
            [
                10179,
                10192
            ],
            [
                10195,
                10213
            ],
            [
                10219,
                10226
            ],
            [
                10232,
                10251
            ],
            [
                10251,
                10260
            ],
            [
                10263,
                10276
            ],
            [
                10277,
                10284
            ],
            [
                10285,
                10385
            ],
            [
                10389,
                10410
            ],
            [
                10413,
                10425
            ],
            [
                10427,
                10489
            ],
            [
                10504,
                10622
            ],
            [
                10626,
                10658
            ],
            [
                10661,
                10678
            ],
            [
                10679,
                10696
            ],
            [
                10697,
                10728
            ],
            [
                10731,
                10793
            ],
            [
                10793,
                10840
            ],
            [
                10845,
                10859
            ],
            [
                10868,
                10881
            ],
            [
                10882,
                10886
            ],
            [
                10887,
                10905
            ],
            [
                10906,
                10909
            ],
            [
                10910,
                10917
            ],
            [
                10918,
                10920
            ],
            [
                10921,
                10927
            ],
            [
                10927,
                10929
            ],
            [
                10930,
                10934
            ],
            [
                10934,
                10969
            ],
            [
                10972,
                10980
            ],
            [
                10988,
                10990
            ],
            [
                10991,
                10998
            ],
            [
                11006,
                11063
            ],
            [
                11063,
                11113
            ],
            [
                11114,
                11228
            ],
            [
                11228,
                11384
            ],
            [
                11388,
                11417
            ],
            [
                11426,
                11438
            ],
            [
                11439,
                11469
            ],
            [
                11469,
                11498
            ],
            [
                11502,
                11506
            ],
            [
                11509,
                11528
            ],
            [
                11529,
                11548
            ],
            [
                11548,
                11575
            ],
            [
                11586,
                11603
            ],
            [
                11603,
                11631
            ],
            [
                11632,
                11670
            ],
            [
                11670,
                11717
            ],
            [
                11717,
                11737
            ],
            [
                11741,
                11762
            ],
            [
                11765,
                11766
            ],
            [
                11771,
                11773
            ],
            [
                11778,
                11850
            ],
            [
                11851,
                11865
            ],
            [
                11865,
                11884
            ],
            [
                11892,
                11899
            ],
            [
                11903,
                11938
            ],
            [
                11941,
                11962
            ],
            [
                11963,
                12033
            ],
            [
                12033,
                12099
            ],
            [
                12099,
                12117
            ],
            [
                12117,
                12165
            ],
            [
                12168,
                12261
            ],
            [
                12262,
                12280
            ],
            [
                12281,
                12297
            ],
            [
                12300,
                12308
            ],
            [
                12310,
                12373
            ],
            [
                12373,
                12441
            ],
            [
                12441,
                12442
            ],
            [
                12447,
                12480
            ],
            [
                12480,
                12482
            ],
            [
                12488,
                12538
            ],
            [
                12546,
                12616
            ],
            [
                12619,
                12631
            ],
            [
                12632,
                12695
            ],
            [
                12698,
                12706
            ],
            [
                12707,
                12801
            ],
            [
                12802,
                12836
            ],
            [
                12839,
                12885
            ],
            [
                12885,
                12887
            ],
            [
                12888,
                12892
            ],
            [
                12892,
                12916
            ],
            [
                12919,
                12948
            ],
            [
                12949,
                12975
            ],
            [
                12975,
                12986
            ],
            [
                12986,
                13014
            ],
            [
                13015,
                13019
            ],
            [
                13022,
                13035
            ],
            [
                13046,
                13048
            ],
            [
                13054,
                13082
            ],
            [
                13092,
                13111
            ],
            [
                13111,
                13114
            ],
            [
                13120,
                13123
            ],
            [
                13128,
                13130
            ],
            [
                13130,
                13140
            ],
            [
                13149,
                13178
            ],
            [
                13179,
                13200
            ],
            [
                13207,
                13209
            ],
            [
                13217,
                13228
            ],
            [
                13237,
                13276
            ],
            [
                13285,
                13328
            ],
            [
                13328,
                13380
            ],
            [
                13381,
                13396
            ],
            [
                13405,
                13463
            ],
            [
                13463,
                13464
            ],
            [
                13501,
                13522
            ],
            [
                13523,
                13533
            ],
            [
                13538,
                13557
            ],
            [
                13557,
                13570
            ],
            [
                13571,
                13573
            ],
            [
                13573,
                13574
            ],
            [
                13575,
                13576
            ],
            [
                13577,
                13584
            ],
            [
                13585,
                13586
            ],
            [
                13587,
                13646
            ],
            [
                13647,
                13662
            ],
            [
                13663,
                13694
            ],
            [
                13696,
                13709
            ],
            [
                13710,
                13714
            ],
            [
                13723,
                13726
            ],
            [
                13727,
                13732
            ],
            [
                13733,
                13794
            ],
            [
                13803,
                13849
            ],
            [
                13849,
                13873
            ],
            [
                13875,
                13878
            ],
            [
                13893,
                13896
            ],
            [
                13903,
                13938
            ],
            [
                13938,
                13940
            ],
            [
                13941,
                13951
            ],
            [
                13954,
                13962
            ],
            [
                13964,
                14019
            ],
            [
                14019,
                14027
            ],
            [
                14028,
                14032
            ],
            [
                14043,
                14058
            ],
            [
                14058,
                14085
            ],
            [
                14085,
                14151
            ],
            [
                14151,
                14153
            ],
            [
                14153,
                14169
            ],
            [
                14177,
                14188
            ],
            [
                14194,
                14197
            ],
            [
                14200,
                14211
            ],
            [
                14213,
                14220
            ],
            [
                14226,
                14294
            ],
            [
                14294,
                14312
            ],
            [
                14319,
                14333
            ],
            [
                14333,
                14396
            ],
            [
                14396,
                14442
            ],
            [
                14443,
                14466
            ],
            [
                14466,
                14555
            ],
            [
                14555,
                14556
            ],
            [
                14562,
                14609
            ],
            [
                14615,
                14616
            ],
            [
                14617,
                14637
            ],
            [
                14646,
                14653
            ],
            [
                14653,
                14655
            ],
            [
                14661,
                14663
            ],
            [
                14663,
                14707
            ],
            [
                14710,
                14721
            ],
            [
                14725,
                14757
            ],
            [
                14761,
                14787
            ],
            [
                14790,
                14807
            ],
            [
                14810,
                14860
            ],
            [
                14864,
                14906
            ],
            [
                14909,
                14920
            ],
            [
                14922,
                14933
            ],
            [
                14942,
                14954
            ],
            [
                14960,
                15019
            ],
            [
                15019,
                15034
            ],
            [
                15042,
                15046
            ],
            [
                15047,
                15054
            ],
            [
                15062,
                15068
            ],
            [
                15072,
                15074
            ],
            [
                15082,
                15099
            ],
            [
                15103,
                15151
            ],
            [
                15155,
                15180
            ],
            [
                15184,
                15203
            ],
            [
                15206,
                15237
            ],
            [
                15242,
                15265
            ],
            [
                15265,
                15295
            ],
            [
                15295,
                15340
            ],
            [
                15341,
                15416
            ],
            [
                15421,
                15499
            ],
            [
                15505,
                15520
            ],
            [
                15520,
                15523
            ],
            [
                15533,
                15556
            ],
            [
                15562,
                15569
            ],
            [
                15569,
                15570
            ],
            [
                15574,
                15607
            ],
            [
                15610,
                15646
            ],
            [
                15646,
                15651
            ],
            [
                15652,
                15653
            ],
            [
                15654,
                15680
            ],
            [
                15680,
                15720
            ],
            [
                15722,
                15723
            ],
            [
                15724,
                15737
            ],
            [
                15746,
                15760
            ],
            [
                15761,
                15838
            ],
            [
                15838,
                15856
            ],
            [
                15856,
                15858
            ],
            [
                15858,
                15869
            ],
            [
                15870,
                15923
            ],
            [
                15923,
                15924
            ],
            [
                15925,
                15972
            ],
            [
                15978,
                16082
            ],
            [
                16082,
                16124
            ],
            [
                16124,
                16126
            ],
            [
                16133,
                16134
            ],
            [
                16135,
                16142
            ],
            [
                16143,
                16151
            ],
            [
                16152,
                16185
            ],
            [
                16187,
                16198
            ],
            [
                16199,
                16235
            ],
            [
                16236,
                16249
            ],
            [
                16250,
                16258
            ],
            [
                16260,
                16270
            ],
            [
                16271,
                16286
            ],
            [
                16287,
                16289
            ],
            [
                16290,
                16293
            ],
            [
                16303,
                16319
            ],
            [
                16347,
                16349
            ],
            [
                16349,
                16358
            ],
            [
                16364,
                16367
            ],
            [
                16368,
                16400
            ],
            [
                16410,
                16412
            ],
            [
                16421,
                16423
            ],
            [
                16423,
                16478
            ],
            [
                16479,
                16542
            ],
            [
                16543,
                16550
            ],
            [
                16554,
                16571
            ],
            [
                16571,
                16596
            ],
            [
                16596,
                16598
            ],
            [
                16607,
                16635
            ],
            [
                16635,
                16636
            ],
            [
                16637,
                16648
            ],
            [
                16649,
                16676
            ],
            [
                16677,
                16740
            ],
            [
                16741,
                16745
            ],
            [
                16745,
                16747
            ],
            [
                16747,
                16784
            ],
            [
                16785,
                16797
            ],
            [
                16798,
                16823
            ],
            [
                16825,
                16841
            ],
            [
                16841,
                16845
            ],
            [
                16846,
                16852
            ],
            [
                16852,
                16882
            ],
            [
                16886,
                16901
            ],
            [
                16904,
                16905
            ],
            [
                16912,
                16919
            ],
            [
                16919,
                16921
            ],
            [
                16928,
                16939
            ],
            [
                16941,
                16959
            ],
            [
                16962,
                16979
            ],
            [
                16980,
                17005
            ],
            [
                17008,
                17010
            ],
            [
                17012,
                17021
            ],
            [
                17021,
                17049
            ],
            [
                17052,
                17069
            ],
            [
                17074,
                17086
            ],
            [
                17089,
                17105
            ],
            [
                17105,
                17106
            ],
            [
                17108,
                17118
            ],
            [
                17119,
                17129
            ],
            [
                17137,
                17146
            ],
            [
                17149,
                17163
            ],
            [
                17165,
                17223
            ],
            [
                17228,
                17235
            ],
            [
                17239,
                17275
            ],
            [
                17276,
                17293
            ],
            [
                17293,
                17326
            ],
            [
                17327,
                17348
            ],
            [
                17348,
                17351
            ],
            [
                17352,
                17368
            ],
            [
                17389,
                17393
            ],
            [
                17393,
                17395
            ],
            [
                17395,
                17402
            ],
            [
                17403,
                17406
            ],
            [
                17407,
                17417
            ],
            [
                17417,
                17436
            ],
            [
                17437,
                17477
            ],
            [
                17483,
                17486
            ],
            [
                17492,
                17493
            ],
            [
                17500,
                17508
            ],
            [
                17509,
                17533
            ],
            [
                17533,
                17545
            ],
            [
                17551,
                17567
            ],
            [
                17567,
                17569
            ],
            [
                17569,
                17577
            ],
            [
                17578,
                17617
            ],
            [
                17621,
                17634
            ],
            [
                17635,
                17638
            ],
            [
                17645,
                17653
            ],
            [
                17656,
                17657
            ],
            [
                17667,
                17669
            ],
            [
                17675,
                17687
            ],
            [
                17695,
                17717
            ],
            [
                17720,
                17740
            ],
            [
                17742,
                17780
            ],
            [
                17780,
                17810
            ],
            [
                17810,
                17908
            ],
            [
                17911,
                17950
            ],
            [
                17950,
                17951
            ],
            [
                17952,
                17962
            ],
            [
                17963,
                17993
            ],
            [
                18002,
                18012
            ],
            [
                18024,
                18030
            ],
            [
                18035,
                18039
            ],
            [
                18039,
                18052
            ],
            [
                18059,
                18065
            ]
        ],
        "row_chars": [
            [
                0,
                349
            ],
            [
                349,
                441
            ],
            [
                441,
                590
            ],
            [
                590,
                714
            ],
            [
                714,
                803
            ],
            [
                803,
                869
            ],
            [
                869,
                933
            ],
            [
                933,
                933
            ],
            [
                933,
                1012
            ],
            [
                1012,
                1044
            ],
            [
                1044,
                1134
            ],
            [
                1134,
                1172
            ],
            [
                1172,
                1233
            ],
            [
                1233,
                1233
            ],
            [
                1233,
                1355
            ],
            [
                1355,
                1462
            ],
            [
                1462,
                1481
            ],
            [
                1481,
                1492
            ],
            [
                1492,
                1506
            ],
            [
                1506,
                1506
            ],
            [
                1506,
                1514
            ],
            [
                1514,
                1544
            ],
            [
                1544,
                1544
            ],
            [
                1544,
                1544
            ],
            [
                1544,
                1544
            ],
            [
                1544,
                1596
            ],
            [
                1596,
                1641
            ],
            [
                1641,
                1641
            ],
            [
                1641,
                1693
            ],
            [
                1693,
                1798
            ],
            [
                1798,
                1814
            ],
            [
                1814,
                1829
            ],
            [
                1829,
                1843
            ],
            [
                1843,
                1843
            ],
            [
                1843,
                1873
            ],
            [
                1873,
                2012
            ],
            [
                2012,
                2097
            ],
            [
                2097,
                2179
            ],
            [
                2179,
                2205
            ],
            [
                2205,
                2245
            ],
            [
                2245,
                2258
            ],
            [
                2258,
                2349
            ],
            [
                2349,
                2386
            ],
            [
                2386,
                2444
            ],
            [
                2444,
                2512
            ],
            [
                2512,
                2650
            ],
            [
                2650,
                2698
            ],
            [
                2698,
                2769
            ],
            [
                2769,
                2906
            ],
            [
                2906,
                2955
            ],
            [
                2955,
                3019
            ],
            [
                3019,
                3194
            ],
            [
                3194,
                3292
            ],
            [
                3292,
                3366
            ],
            [
                3366,
                3425
            ],
            [
                3425,
                3517
            ],
            [
                3517,
                3580
            ],
            [
                3580,
                3580
            ],
            [
                3580,
                3637
            ],
            [
                3637,
                3701
            ],
            [
                3701,
                3774
            ],
            [
                3774,
                3794
            ],
            [
                3794,
                3827
            ],
            [
                3827,
                3854
            ],
            [
                3854,
                3868
            ],
            [
                3868,
                3901
            ],
            [
                3901,
                3989
            ],
            [
                3989,
                4037
            ],
            [
                4037,
                4053
            ],
            [
                4053,
                4090
            ],
            [
                4090,
                4115
            ],
            [
                4115,
                4213
            ],
            [
                4213,
                4360
            ],
            [
                4360,
                4433
            ],
            [
                4433,
                4550
            ],
            [
                4550,
                4568
            ],
            [
                4568,
                4584
            ],
            [
                4584,
                4593
            ],
            [
                4593,
                4626
            ],
            [
                4626,
                4681
            ],
            [
                4681,
                4724
            ],
            [
                4724,
                4779
            ],
            [
                4779,
                4806
            ],
            [
                4806,
                4852
            ],
            [
                4852,
                4948
            ],
            [
                4948,
                4975
            ],
            [
                4975,
                4995
            ],
            [
                4995,
                4995
            ],
            [
                4995,
                5007
            ],
            [
                5007,
                5054
            ],
            [
                5054,
                5058
            ],
            [
                5058,
                5086
            ],
            [
                5086,
                5114
            ],
            [
                5114,
                5219
            ],
            [
                5219,
                5242
            ],
            [
                5242,
                5254
            ],
            [
                5254,
                5286
            ],
            [
                5286,
                5296
            ],
            [
                5296,
                5343
            ],
            [
                5343,
                5360
            ],
            [
                5360,
                5378
            ],
            [
                5378,
                5420
            ],
            [
                5420,
                5560
            ],
            [
                5560,
                5587
            ],
            [
                5587,
                5596
            ],
            [
                5596,
                5596
            ],
            [
                5596,
                5606
            ],
            [
                5606,
                5701
            ],
            [
                5701,
                5814
            ],
            [
                5814,
                5825
            ],
            [
                5825,
                5881
            ],
            [
                5881,
                5923
            ],
            [
                5923,
                5937
            ],
            [
                5937,
                5976
            ],
            [
                5976,
                6076
            ],
            [
                6076,
                6128
            ],
            [
                6128,
                6170
            ],
            [
                6170,
                6207
            ],
            [
                6207,
                6289
            ],
            [
                6289,
                6341
            ],
            [
                6341,
                6408
            ],
            [
                6408,
                6453
            ],
            [
                6453,
                6546
            ],
            [
                6546,
                6592
            ],
            [
                6592,
                6603
            ],
            [
                6603,
                6628
            ],
            [
                6628,
                6635
            ],
            [
                6635,
                6635
            ],
            [
                6635,
                6635
            ],
            [
                6635,
                6658
            ],
            [
                6658,
                6734
            ],
            [
                6734,
                6819
            ],
            [
                6819,
                6886
            ],
            [
                6886,
                6948
            ],
            [
                6948,
                6998
            ],
            [
                6998,
                6998
            ],
            [
                6998,
                7138
            ],
            [
                7138,
                7381
            ],
            [
                7381,
                7515
            ],
            [
                7515,
                7545
            ],
            [
                7545,
                7643
            ],
            [
                7643,
                7791
            ],
            [
                7791,
                8036
            ],
            [
                8036,
                8081
            ],
            [
                8081,
                8081
            ],
            [
                8081,
                8133
            ],
            [
                8133,
                8150
            ],
            [
                8150,
                8178
            ],
            [
                8178,
                8239
            ],
            [
                8239,
                8260
            ],
            [
                8260,
                8260
            ],
            [
                8260,
                8329
            ],
            [
                8329,
                8352
            ],
            [
                8352,
                8380
            ],
            [
                8380,
                8439
            ],
            [
                8439,
                8507
            ],
            [
                8507,
                8530
            ],
            [
                8530,
                8719
            ],
            [
                8719,
                8790
            ],
            [
                8790,
                8993
            ],
            [
                8993,
                9001
            ],
            [
                9001,
                9130
            ],
            [
                9130,
                9163
            ],
            [
                9163,
                9223
            ],
            [
                9223,
                9253
            ],
            [
                9253,
                9310
            ],
            [
                9310,
                9398
            ],
            [
                9398,
                9452
            ],
            [
                9452,
                9478
            ],
            [
                9478,
                9583
            ],
            [
                9583,
                9583
            ],
            [
                9583,
                9629
            ],
            [
                9629,
                9678
            ],
            [
                9678,
                9696
            ],
            [
                9696,
                9725
            ],
            [
                9725,
                9739
            ],
            [
                9739,
                9776
            ],
            [
                9776,
                10004
            ],
            [
                10004,
                10066
            ],
            [
                10066,
                10077
            ],
            [
                10077,
                10077
            ],
            [
                10077,
                10178
            ],
            [
                10178,
                10178
            ],
            [
                10178,
                10195
            ],
            [
                10195,
                10226
            ],
            [
                10226,
                10251
            ],
            [
                10251,
                10263
            ],
            [
                10263,
                10263
            ],
            [
                10263,
                10263
            ],
            [
                10263,
                10385
            ],
            [
                10385,
                10625
            ],
            [
                10625,
                10625
            ],
            [
                10625,
                10661
            ],
            [
                10661,
                10678
            ],
            [
                10678,
                10731
            ],
            [
                10731,
                10793
            ],
            [
                10793,
                10929
            ],
            [
                10929,
                10934
            ],
            [
                10934,
                10972
            ],
            [
                10972,
                10990
            ],
            [
                10990,
                11063
            ],
            [
                11063,
                11228
            ],
            [
                11228,
                11387
            ],
            [
                11387,
                11420
            ],
            [
                11420,
                11438
            ],
            [
                11438,
                11469
            ],
            [
                11469,
                11501
            ],
            [
                11501,
                11509
            ],
            [
                11509,
                11528
            ],
            [
                11528,
                11548
            ],
            [
                11548,
                11603
            ],
            [
                11603,
                11670
            ],
            [
                11670,
                11717
            ],
            [
                11717,
                11740
            ],
            [
                11740,
                11740
            ],
            [
                11740,
                11773
            ],
            [
                11773,
                11865
            ],
            [
                11865,
                11902
            ],
            [
                11902,
                11962
            ],
            [
                11962,
                12033
            ],
            [
                12033,
                12099
            ],
            [
                12099,
                12117
            ],
            [
                12117,
                12168
            ],
            [
                12168,
                12261
            ],
            [
                12261,
                12373
            ],
            [
                12373,
                12441
            ],
            [
                12441,
                12482
            ],
            [
                12482,
                12482
            ],
            [
                12482,
                12541
            ],
            [
                12541,
                12631
            ],
            [
                12631,
                12698
            ],
            [
                12698,
                12706
            ],
            [
                12706,
                12839
            ],
            [
                12839,
                12887
            ],
            [
                12887,
                12892
            ],
            [
                12892,
                12948
            ],
            [
                12948,
                12975
            ],
            [
                12975,
                12986
            ],
            [
                12986,
                12986
            ],
            [
                12986,
                13022
            ],
            [
                13022,
                13082
            ],
            [
                13082,
                13130
            ],
            [
                13130,
                13209
            ],
            [
                13209,
                13328
            ],
            [
                13328,
                13463
            ],
            [
                13463,
                13463
            ],
            [
                13463,
                13557
            ],
            [
                13557,
                13694
            ],
            [
                13694,
                13849
            ],
            [
                13849,
                13940
            ],
            [
                13940,
                14019
            ],
            [
                14019,
                14058
            ],
            [
                14058,
                14085
            ],
            [
                14085,
                14153
            ],
            [
                14153,
                14153
            ],
            [
                14153,
                14172
            ],
            [
                14172,
                14294
            ],
            [
                14294,
                14333
            ],
            [
                14333,
                14396
            ],
            [
                14396,
                14466
            ],
            [
                14466,
                14612
            ],
            [
                14612,
                14640
            ],
            [
                14640,
                14655
            ],
            [
                14655,
                14663
            ],
            [
                14663,
                14710
            ],
            [
                14710,
                14721
            ],
            [
                14721,
                14760
            ],
            [
                14760,
                14809
            ],
            [
                14809,
                14863
            ],
            [
                14863,
                15019
            ],
            [
                15019,
                15102
            ],
            [
                15102,
                15102
            ],
            [
                15102,
                15154
            ],
            [
                15154,
                15154
            ],
            [
                15154,
                15183
            ],
            [
                15183,
                15237
            ],
            [
                15237,
                15265
            ],
            [
                15265,
                15295
            ],
            [
                15295,
                15520
            ],
            [
                15520,
                15610
            ],
            [
                15610,
                15680
            ],
            [
                15680,
                15761
            ],
            [
                15761,
                15838
            ],
            [
                15838,
                15838
            ],
            [
                15838,
                15858
            ],
            [
                15858,
                15923
            ],
            [
                15923,
                16082
            ],
            [
                16082,
                16260
            ],
            [
                16260,
                16349
            ],
            [
                16349,
                16423
            ],
            [
                16423,
                16598
            ],
            [
                16598,
                16747
            ],
            [
                16747,
                16841
            ],
            [
                16841,
                16852
            ],
            [
                16852,
                16885
            ],
            [
                16885,
                16904
            ],
            [
                16904,
                16921
            ],
            [
                16921,
                16962
            ],
            [
                16962,
                16979
            ],
            [
                16979,
                17008
            ],
            [
                17008,
                17021
            ],
            [
                17021,
                17052
            ],
            [
                17052,
                17069
            ],
            [
                17069,
                17107
            ],
            [
                17107,
                17107
            ],
            [
                17107,
                17107
            ],
            [
                17107,
                17107
            ],
            [
                17107,
                17223
            ],
            [
                17223,
                17223
            ],
            [
                17223,
                17223
            ],
            [
                17223,
                17223
            ],
            [
                17223,
                17348
            ],
            [
                17348,
                17395
            ],
            [
                17395,
                17533
            ],
            [
                17533,
                17569
            ],
            [
                17569,
                17620
            ],
            [
                17620,
                17620
            ],
            [
                17620,
                17620
            ],
            [
                17620,
                17669
            ],
            [
                17669,
                17690
            ],
            [
                17690,
                17780
            ],
            [
                17780,
                17810
            ],
            [
                17810,
                17911
            ],
            [
                17911,
                18066
            ]
        ]
    }
}