{
    "original": {
        "text": "For two months the fugitives remained absent; in those two months, Mrs. Linton encountered and conquered the worst shock of what was denominated a brain fever. No mother could have nursed an only child more devotedly than Edgar tended her. Day and night he was watching, and patiently enduring all the annoyances that irritable nerves and a shaken reason could inflict; and, though Kenneth remarked that what he saved from the grave would only recompense his care by forming the source of constant future anxiety-in fact, that his health and strength were being sacrificed to preserve a mere ruin of humanity-he knew no limits in gratitude and joy when Catherine's life was declared out of danger; and hour after hour he would sit beside her, tracing the gradual return to bodily health, and flattering his too sanguine hopes with the illusion that her mind would settle back to its right balance also, and she would soon be entirely her former self.\nThe first time she left her chamber was at the commencement of the following March. Mr. Linton had put on her pillow, in the morning, a handful of golden crocuses; her eye, long stranger to any gleam of pleasure, caught them in waking, and shone delighted as she gathered them eagerly together.\n\"These are the earliest flowers at the Heights,\" she exclaimed. \"They remind me of soft thaw winds, and warm sunshine, and nearly melted snow. Edgar, is there not a south wind, and is not the snow almost gone?\"\n\"The snow is quite gone down here, darling,\" replied her husband; \"and I only see two white spots on the whole range of moors: the sky is blue, and the larks are singing, and the becks and brooks are all brim full. Catherine, last spring at this time, I was longing to have you under this roof; now, I wish you were a mile or two up those hills: the air blows so sweetly, I feel that it would cure you.\"\n\"I shall never be there but once more,\" said the invalid; \"and then you'll leave me, and I shall remain for ever. Next spring you'll long again to have me under this roof, and you'll look back and think you were happy to-day.\"\nLinton lavished on her the kindest caresses, and tried to cheer her by the fondest words; but, vaguely regarding the flowers, she let the tears collect on her lashes and stream down her cheeks unheeding. We knew she was really better, and, therefore, decided that long confinement to a single place produced much of this despondency, and it might be partially removed by a change of scene. The master told me to light a fire in the many-weeks' deserted parlour, and to set an easy-chair in the sunshine by the window; and then he brought her down, and she sat a long while enjoying the genial heat, and, as we expected, revived by the objects round her: which, though familiar, were free from the dreary associations investing her hated sick chamber. By evening she seemed greatly exhausted; yet no arguments could persuade her to return to that apartment, and I had to arrange the parlour sofa for her bed, till another room could be prepared. To obviate the fatigue of mounting and descending the stairs, we fitted up this, where you lie at present-on the same floor with the parlour; and she was soon strong enough to move from one to the other, leaning on Edgar's arm. Ah, I thought myself, she might recover, so waited on as she was. And there was double cause to desire it, for on her existence depended that of another: we cherished the hope that in a little while Mr. Linton's heart would be gladdened, and his lands secured from a stranger's grip, by the birth of an heir.\nI should mention that Isabella sent to her brother, some six weeks from her departure, a short note, announcing her marriage with Heathcliff. It appeared dry and cold; but at the bottom was dotted in with pencil an obscure apology, and an entreaty for kind remembrance and reconciliation, if her proceeding had offended him: asserting that she could not help it then, and being done, she had now no power to repeal it. Linton did not reply to this, I believe; and, in a fortnight more, I got a long letter, which I considered odd, coming from the pen of a bride just out of the honeymoon. I'll read it: for I keep it yet. Any relic of the dead is precious, if they were valued living.\n* * * * *\nDEAR ELLEN, it begins,-I came last night to Wuthering Heights, and heard, for the first time, that Catherine has been, and is yet, very ill. I must not write to her, I suppose, and my brother is either too angry or too distressed to answer what I sent him. Still, I must write to somebody, and the only choice left me is you.\nInform Edgar that I'd give the world to see his face again-that my heart returned to Thrushcross Grange in twenty-four hours after I left it, and is there at this moment, full of warm feelings for him, and Catherine! _I can't follow it though_-(these words are underlined)-they need not expect me, and they may draw what conclusions they please; taking care, however, to lay nothing at the door of my weak will or deficient affection.\nThe remainder of the letter is for yourself alone. I want to ask you two questions: the first is,-How did you contrive to preserve the common sympathies of human nature when you resided here? I cannot recognise any sentiment which those around share with me.\nThe second question I have great interest in; it is this-Is Mr. Heathcliff a man? If so, is he mad? And if not, is he a devil? I sha'n't tell my reasons for making this inquiry; but I beseech you to explain, if you can, what I have married: that is, when you call to see me; and you must call, Ellen, very soon. Don't write, but come, and bring me something from Edgar.\nNow, you shall hear how I have been received in my new home, as I am led to imagine the Heights will be. It is to amuse myself that I dwell on such subjects as the lack of external comforts: they never occupy my thoughts, except at the moment when I miss them. I should laugh and dance for joy, if I found their absence was the total of my miseries, and the rest was an unnatural dream!\nThe sun set behind the Grange as we turned on to the moors; by that, I judged it to be six o'clock; and my companion halted half an hour, to inspect the park, and the gardens, and, probably, the place itself, as well as he could; so it was dark when we dismounted in the paved yard of the farm-house, and your old fellow-servant, Joseph, issued out to receive us by the light of a dip candle. He did it with a courtesy that redounded to his credit. His first act was to elevate his torch to a level with my face, squint malignantly, project his under-lip, and turn away. Then he took the two horses, and led them into the stables; reappearing for the purpose of locking the outer gate, as if we lived in an ancient castle.\nHeathcliff stayed to speak to him, and I entered the kitchen-a dingy, untidy hole; I daresay you would not know it, it is so changed since it was in your charge. By the fire stood a ruffianly child, strong in limb and dirty in garb, with a look of Catherine in his eyes and about his mouth.\n\"This is Edgar's legal nephew,\" I reflected-\"mine in a manner; I must shake hands, and-yes-I must kiss him. It is right to establish a good understanding at the beginning.\"\nI approached, and, attempting to take his chubby fist, said-\"How do you do, my dear?\"\nHe replied in a jargon I did not comprehend.\n\"Shall you and I be friends, Hareton?\" was my next essay at conversation.\nAn oath, and a threat to set Throttler on me if I did not \"frame off\" rewarded my perseverance.\n\"Hey, Throttler, lad!\" whispered the little wretch, rousing a half-bred bull-dog from its lair in a corner. \"Now, wilt thou be ganging?\" he asked authoritatively.\nLove for my life urged a compliance; I stepped over the threshold to wait till the others should enter. Mr. Heathcliff was nowhere visible; and Joseph, whom I followed to the stables, and requested to accompany me in, after staring and muttering to himself, screwed up his nose and replied-\"Mim! mim! mim! Did iver Christian body hear aught like it? Mincing un' munching! How can I tell whet ye say?\"\n\"I say, I wish you to come with me into the house!\" I cried, thinking him deaf, yet highly disgusted at his rudeness.\n\"None o' me! I getten summut else to do,\" he answered, and continued his work; moving his lantern jaws meanwhile, and surveying my dress and countenance (the former a great deal too fine, but the latter, I'm sure, as sad as he could desire) with sovereign contempt.\nI walked round the yard, and through a wicket, to another door, at which I took the liberty of knocking, in hopes some more civil servant might show himself. After a short suspense, it was opened by a tall, gaunt man, without neckerchief, and otherwise extremely slovenly; his features were lost in masses of shaggy hair that hung on his shoulders; and _his_ eyes, too, were like a ghostly Catherine's with all their beauty annihilated.\n\"What's your business here?\" he demanded, grimly. \"Who are you?\"\n\"My name was Isabella Linton,\" I replied. \"You've seen me before, sir. I'm lately married to Mr. Heathcliff, and he has brought me here-I suppose, by your permission.\"\n\"Is he come back, then?\" asked the hermit, glaring like a hungry wolf.\n\"Yes-we came just now,\" I said; \"but he left me by the kitchen door; and when I would have gone in, your little boy played sentinel over the place, and frightened me off by the help of a bull-dog.\"\n\"It's well the hellish villain has kept his word!\" growled my future host, searching the darkness beyond me in expectation of discovering Heathcliff; and then he indulged in a soliloquy of execrations, and threats of what he would have done had the \"fiend\" deceived him.\nI repented having tried this second entrance, and was almost inclined to slip away before he finished cursing, but ere I could execute that intention, he ordered me in, and shut and re-fastened the door. There was a great fire, and that was all the light in the huge apartment, whose floor had grown a uniform grey; and the once brilliant pewter-dishes, which used to attract my gaze when I was a girl, partook of a similar obscurity, created by tarnish and dust. I inquired whether I might call the maid, and be conducted to a bedroom! Mr. Earnshaw vouchsafed no answer. He walked up and down, with his hands in his pockets, apparently quite forgetting my presence; and his abstraction was evidently so deep, and his whole aspect so misanthropical, that I shrank from disturbing him again.\nYou'll not be surprised, Ellen, at my feeling particularly cheerless, seated in worse than solitude on that inhospitable hearth, and remembering that four miles distant lay my delightful home, containing the only people I loved on earth; and there might as well be the Atlantic to part us, instead of those four miles: I could not overpass them! I questioned with myself-where must I turn for comfort? and-mind you don't tell Edgar, or Catherine-above every sorrow beside, this rose pre-eminent: despair at finding nobody who could or would be my ally against Heathcliff! I had sought shelter at Wuthering Heights, almost gladly, because I was secured by that arrangement from living alone with him; but he knew the people we were coming amongst, and he did not fear their intermeddling.\nI sat and thought a doleful time: the clock struck eight, and nine, and still my companion paced to and fro, his head bent on his breast, and perfectly silent, unless a groan or a bitter ejaculation forced itself out at intervals. I listened to detect a woman's voice in the house, and filled the interim with wild regrets and dismal anticipations, which, at last, spoke audibly in irrepressible sighing and weeping. I was not aware how openly I grieved, till Earnshaw halted opposite, in his measured walk, and gave me a stare of newly-awakened surprise. Taking advantage of his recovered attention, I exclaimed-\"I'm tired with my journey, and I want to go to bed! Where is the maid-servant? Direct me to her, as she won't come to me!\"\n\"We have none,\" he answered; \"you must wait on yourself!\"\n\"Where must I sleep, then?\" I sobbed; I was beyond regarding self-respect, weighed down by fatigue and wretchedness.\n\"Joseph will show you Heathcliff's chamber,\" said he; \"open that door-he's in there.\"\nI was going to obey, but he suddenly arrested me, and added in the strangest tone-\"Be so good as to turn your lock, and draw your bolt-don't omit it!\"\n\"Well!\" I said. \"But why, Mr. Earnshaw?\" I did not relish the notion of deliberately fastening myself in with Heathcliff.\n\"Look here!\" he replied, pulling from his waistcoat a curiously-constructed pistol, having a double-edged spring knife attached to the barrel. \"That's a great tempter to a desperate man, is it not? I cannot resist going up with this every night, and trying his door. If once I find it open he's done for; I do it invariably, even though the minute before I have been recalling a hundred reasons that should make me refrain: it is some devil that urges me to thwart my own schemes by killing him. You fight against that devil for love as long as you may; when the time comes, not all the angels in heaven shall save him!\"\nI surveyed the weapon inquisitively. A hideous notion struck me: how powerful I should be possessing such an instrument! I took it from his hand, and touched the blade. He looked astonished at the expression my face assumed during a brief second: it was not horror, it was covetousness. He snatched the pistol back, jealously; shut the knife, and returned it to its concealment.\n\"I don't care if you tell him,\" said he. \"Put him on his guard, and watch for him. You know the terms we are on, I see: his danger does not shock you.\"\n\"What has Heathcliff done to you?\" I asked. \"In what has he wronged you, to warrant this appalling hatred? Wouldn't it be wiser to bid him quit the house?\"\n\"No!\" thundered Earnshaw; \"should he offer to leave me, he's a dead man: persuade him to attempt it, and you are a murderess! Am I to lose _all_, without a chance of retrieval? Is Hareton to be a beggar? Oh, damnation! I _will_ have it back; and I'll have _his_ gold too; and then his blood; and hell shall have his soul! It will be ten times blacker with that guest than ever it was before!\"\nYou've acquainted me, Ellen, with your old master's habits. He is clearly on the verge of madness: he was so last night at least. I shuddered to be near him, and thought on the servant's ill-bred moroseness as comparatively agreeable. He now recommenced his moody walk, and I raised the latch, and escaped into the kitchen. Joseph was bending over the fire, peering into a large pan that swung above it; and a wooden bowl of oatmeal stood on the settle close by. The contents of the pan began to boil, and he turned to plunge his hand into the bowl; I conjectured that this preparation was probably for our supper, and, being hungry, I resolved it should be eatable; so, crying out sharply, \"_I'll_ make the porridge!\" I removed the vessel out of his reach, and proceeded to take off my hat and riding-habit. \"Mr. Earnshaw,\" I continued, \"directs me to wait on myself: I will. I'm not going to act the lady among you, for fear I should starve.\"\n\"Gooid Lord!\" he muttered, sitting down, and stroking his ribbed stockings from the knee to the ankle. \"If there's to be fresh ortherings-just when I getten used to two maisters, if I mun hev' a _mistress_ set o'er my heead, it's like time to be flitting. I niver _did_ think to see t' day that I mud lave th' owld place-but I doubt it's nigh at hand!\"\nThis lamentation drew no notice from me: I went briskly to work, sighing to remember a period when it would have been all merry fun; but compelled speedily to drive off the remembrance. It racked me to recall past happiness and the greater peril there was of conjuring up its apparition, the quicker the thible ran round, and the faster the handfuls of meal fell into the water. Joseph beheld my style of cookery with growing indignation.\n\"Thear!\" he ejaculated. \"Hareton, thou willn't sup thy porridge to-neeght; they'll be naught but lumps as big as my neive. Thear, agean! I'd fling in bowl un' all, if I wer ye! There, pale t' guilp off, un' then ye'll hae done wi't. Bang, bang. It's a mercy t' bothom isn't deaved out!\"\nIt _was_ rather a rough mess, I own, when poured into the basins; four had been provided, and a gallon pitcher of new milk was brought from the dairy, which Hareton seized and commenced drinking and spilling from the expansive lip. I expostulated, and desired that he should have his in a mug; affirming that I could not taste the liquid treated so dirtily. The old cynic chose to be vastly offended at this nicety; assuring me, repeatedly, that \"the barn was every bit as good\" as I, \"and every bit as wollsome,\" and wondering how I could fashion to be so conceited. Meanwhile, the infant ruffian continued sucking; and glowered up at me defyingly, as he slavered into the jug.\n\"I shall have my supper in another room,\" I said. \"Have you no place you call a parlour?\"\n\"_Parlour_!\" he echoed, sneeringly, \"_parlour_! Nay, we've noa _parlours_. If yah dunnut loike wer company, there's maister's; un' if yah dunnut loike maister, there's us.\"\n\"Then I shall go upstairs,\" I answered; \"show me a chamber.\"\nI put my basin on a tray, and went myself to fetch some more milk. With great grumblings, the fellow rose, and preceded me in my ascent: we mounted to the garrets; he opened a door, now and then, to look into the apartments we passed.\n\"Here's a rahm,\" he said, at last, flinging back a cranky board on hinges. \"It's weel eneugh to ate a few porridge in. There's a pack o' corn i' t' corner, thear, meeterly clane; if ye're feared o' muckying yer grand silk cloes, spread yer hankerchir o' t' top on't.\"\nThe \"rahm\" was a kind of lumber-hole smelling strong of malt and grain; various sacks of which articles were piled around, leaving a wide, bare space in the middle.\n\"Why, man,\" I exclaimed, facing him angrily, \"this is not a place to sleep in. I wish to see my bed-room.\"\n\"_Bed-rume_!\" he repeated, in a tone of mockery. \"Yah's see all t' _bed-rumes_ thear is-yon's mine.\"\nHe pointed into the second garret, only differing from the first in being more naked about the walls, and having a large, low, curtainless bed, with an indigo-coloured quilt, at one end.\n\"What do I want with yours?\" I retorted. \"I suppose Mr. Heathcliff does not lodge at the top of the house, does he?\"\n\"Oh! it's Maister _Hathecliff's_ ye're wanting?\" cried he, as if making a new discovery. \"Couldn't ye ha' said soa, at onst? un' then, I mud ha' telled ye, baht all this wark, that that's just one ye cannut see-he allas keeps it locked, un' nob'dy iver mells on't but hisseln.\"\n\"You've a nice house, Joseph,\" I could not refrain from observing, \"and pleasant inmates; and I think the concentrated essence of all the madness in the world took up its abode in my brain the day I linked my fate with theirs! However, that is not to the present purpose-there are other rooms. For heaven's sake be quick, and let me settle somewhere!\"\nHe made no reply to this adjuration; only plodding doggedly down the wooden steps, and halting, before an apartment which, from that halt and the superior quality of its furniture, I conjectured to be the best one. There was a carpet-a good one, but the pattern was obliterated by dust; a fireplace hung with cut-paper, dropping to pieces; a handsome oak-bedstead with ample crimson curtains of rather expensive material and modern make; but they had evidently experienced rough usage: the vallances hung in festoons, wrenched from their rings, and the iron rod supporting them was bent in an arc on one side, causing the drapery to trail upon the floor. The chairs were also damaged, many of them severely; and deep indentations deformed the panels of the walls. I was endeavouring to gather resolution for entering and taking possession, when my fool of a guide announced,-\"This here is t' maister's.\" My supper by this time was cold, my appetite gone, and my patience exhausted. I insisted on being provided instantly with a place of refuge, and means of repose.\n\"Whear the divil?\" began the religious elder. \"The Lord bless us! The Lord forgie us! Whear the _hell_ wold ye gang? ye marred, wearisome nowt! Ye've seen all but Hareton's bit of a cham'er. There's not another hoile to lig down in i' th' hahse!\"\nI was so vexed, I flung my tray and its contents on the ground; and then seated myself at the stairs'-head, hid my face in my hands, and cried.\n\"Ech! ech!\" exclaimed Joseph. \"Weel done, Miss Cathy! weel done, Miss Cathy! Howsiver, t' maister sall just tum'le o'er them brooken pots; un' then we's hear summut; we's hear how it's to be. Gooid-for-naught madling! ye desarve pining fro' this to Chrustmas, flinging t' precious gifts o'God under fooit i' yer flaysome rages! But I'm mista'en if ye shew yer sperrit lang. Will Hathecliff bide sich bonny ways, think ye? I nobbut wish he may catch ye i' that plisky. I nobbut wish he may.\"\nAnd so he went on scolding to his den beneath, taking the candle with him; and I remained in the dark. The period of reflection succeeding this silly action compelled me to admit the necessity of smothering my pride and choking my wrath, and bestirring myself to remove its effects. An unexpected aid presently appeared in the shape of Throttler, whom I now recognised as a son of our old Skulker: it had spent its whelphood at the Grange, and was given by my father to Mr. Hindley. I fancy it knew me: it pushed its nose against mine by way of salute, and then hastened to devour the porridge; while I groped from step to step, collecting the shattered earthenware, and drying the spatters of milk from the banister with my pocket-handkerchief. Our labours were scarcely over when I heard Earnshaw's tread in the passage; my assistant tucked in his tail, and pressed to the wall; I stole into the nearest doorway. The dog's endeavour to avoid him was unsuccessful; as I guessed by a scutter downstairs, and a prolonged, piteous yelping. I had better luck: he passed on, entered his chamber, and shut the door. Directly after Joseph came up with Hareton, to put him to bed. I had found shelter in Hareton's room, and the old man, on seeing me, said,-\"They's rahm for boath ye un' yer pride, now, I sud think i' the hahse. It's empty; ye may hev' it all to yerseln, un' Him as allus maks a third, i' sich ill company!\"\nGladly did I take advantage of this intimation; and the minute I flung myself into a chair, by the fire, I nodded, and slept. My slumber was deep and sweet, though over far too soon. Mr. Heathcliff awoke me; he had just come in, and demanded, in his loving manner, what I was doing there? I told him the cause of my staying up so late-that he had the key of our room in his pocket. The adjective _our_ gave mortal offence. He swore it was not, nor ever should be, mine; and he'd-but I'll not repeat his language, nor describe his habitual conduct: he is ingenious and unresting in seeking to gain my abhorrence! I sometimes wonder at him with an intensity that deadens my fear: yet, I assure you, a tiger or a venomous serpent could not rouse terror in me equal to that which he wakens. He told me of Catherine's illness, and accused my brother of causing it promising that I should be Edgar's proxy in suffering, till he could get hold of him.\nI do hate him-I am wretched-I have been a fool! Beware of uttering one breath of this to any one at the Grange. I shall expect you every day-don't disappoint me!-ISABELLA.",
        "paragraph_chars": [
            [
                0,
                951
            ],
            [
                951,
                1246
            ],
            [
                1246,
                1457
            ],
            [
                1457,
                1861
            ],
            [
                1861,
                2088
            ],
            [
                2088,
                3570
            ],
            [
                3570,
                4255
            ],
            [
                4255,
                4265
            ],
            [
                4265,
                4591
            ],
            [
                4591,
                5026
            ],
            [
                5026,
                5285
            ],
            [
                5285,
                5655
            ],
            [
                5655,
                6042
            ],
            [
                6042,
                6765
            ],
            [
                6765,
                7056
            ],
            [
                7056,
                7229
            ],
            [
                7229,
                7315
            ],
            [
                7315,
                7360
            ],
            [
                7360,
                7434
            ],
            [
                7434,
                7530
            ],
            [
                7530,
                7693
            ],
            [
                7693,
                8094
            ],
            [
                8094,
                8212
            ],
            [
                8212,
                8478
            ],
            [
                8478,
                8915
            ],
            [
                8915,
                8980
            ],
            [
                8980,
                9148
            ],
            [
                9148,
                9219
            ],
            [
                9219,
                9417
            ],
            [
                9417,
                9688
            ],
            [
                9688,
                10479
            ],
            [
                10479,
                11267
            ],
            [
                11267,
                12004
            ],
            [
                12004,
                12062
            ],
            [
                12062,
                12179
            ],
            [
                12179,
                12265
            ],
            [
                12265,
                12416
            ],
            [
                12416,
                12538
            ],
            [
                12538,
                13159
            ],
            [
                13159,
                13538
            ],
            [
                13538,
                13690
            ],
            [
                13690,
                13846
            ],
            [
                13846,
                14239
            ],
            [
                14239,
                15184
            ],
            [
                15184,
                15537
            ],
            [
                15537,
                15976
            ],
            [
                15976,
                16263
            ],
            [
                16263,
                16942
            ],
            [
                16942,
                17032
            ],
            [
                17032,
                17205
            ],
            [
                17205,
                17266
            ],
            [
                17266,
                17501
            ],
            [
                17501,
                17769
            ],
            [
                17769,
                17934
            ],
            [
                17934,
                18041
            ],
            [
                18041,
                18142
            ],
            [
                18142,
                18329
            ],
            [
                18329,
                18446
            ],
            [
                18446,
                18724
            ],
            [
                18724,
                19076
            ],
            [
                19076,
                20142
            ],
            [
                20142,
                20389
            ],
            [
                20389,
                20533
            ],
            [
                20533,
                21024
            ],
            [
                21024,
                22442
            ],
            [
                22442,
                23387
            ],
            [
                23387,
                23558
            ]
        ],
        "segment_chars": [
            [
                0,
                160
            ],
            [
                160,
                240
            ],
            [
                240,
                951
            ],
            [
                951,
                1035
            ],
            [
                1035,
                1246
            ],
            [
                1246,
                1310
            ],
            [
                1310,
                1389
            ],
            [
                1389,
                1457
            ],
            [
                1457,
                1672
            ],
            [
                1672,
                1861
            ],
            [
                1861,
                1975
            ],
            [
                1975,
                2088
            ],
            [
                2088,
                2292
            ],
            [
                2292,
                2478
            ],
            [
                2478,
                2839
            ],
            [
                2839,
                3033
            ],
            [
                3033,
                3261
            ],
            [
                3261,
                3327
            ],
            [
                3327,
                3570
            ],
            [
                3570,
                3712
            ],
            [
                3712,
                3989
            ],
            [
                3989,
                4159
            ],
            [
                4159,
                4192
            ],
            [
                4192,
                4255
            ],
            [
                4255,
                4265
            ],
            [
                4265,
                4406
            ],
            [
                4406,
                4522
            ],
            [
                4522,
                4591
            ],
            [
                4591,
                4808
            ],
            [
                4808,
                5026
            ],
            [
                5026,
                5077
            ],
            [
                5077,
                5218
            ],
            [
                5218,
                5285
            ],
            [
                5285,
                5367
            ],
            [
                5367,
                5385
            ],
            [
                5385,
                5412
            ],
            [
                5412,
                5597
            ],
            [
                5597,
                5655
            ],
            [
                5655,
                5760
            ],
            [
                5760,
                5916
            ],
            [
                5916,
                6042
            ],
            [
                6042,
                6435
            ],
            [
                6435,
                6491
            ],
            [
                6491,
                6613
            ],
            [
                6613,
                6765
            ],
            [
                6765,
                6927
            ],
            [
                6927,
                7056
            ],
            [
                7056,
                7164
            ],
            [
                7164,
                7229
            ],
            [
                7229,
                7315
            ],
            [
                7315,
                7360
            ],
            [
                7360,
                7399
            ],
            [
                7399,
                7434
            ],
            [
                7434,
                7530
            ],
            [
                7530,
                7553
            ],
            [
                7553,
                7638
            ],
            [
                7638,
                7667
            ],
            [
                7667,
                7693
            ],
            [
                7693,
                7797
            ],
            [
                7797,
                7989
            ],
            [
                7989,
                7994
            ],
            [
                7994,
                7999
            ],
            [
                7999,
                8043
            ],
            [
                8043,
                8065
            ],
            [
                8065,
                8094
            ],
            [
                8094,
                8146
            ],
            [
                8146,
                8212
            ],
            [
                8212,
                8225
            ],
            [
                8225,
                8478
            ],
            [
                8478,
                8636
            ],
            [
                8636,
                8915
            ],
            [
                8915,
                8944
            ],
            [
                8944,
                8965
            ],
            [
                8965,
                8980
            ],
            [
                8980,
                9022
            ],
            [
                9022,
                9051
            ],
            [
                9051,
                9148
            ],
            [
                9148,
                9173
            ],
            [
                9173,
                9219
            ],
            [
                9219,
                9417
            ],
            [
                9417,
                9468
            ],
            [
                9468,
                9688
            ],
            [
                9688,
                9892
            ],
            [
                9892,
                10152
            ],
            [
                10152,
                10225
            ],
            [
                10225,
                10260
            ],
            [
                10260,
                10479
            ],
            [
                10479,
                10825
            ],
            [
                10825,
                10881
            ],
            [
                10881,
                11051
            ],
            [
                11051,
                11267
            ],
            [
                11267,
                11498
            ],
            [
                11498,
                11684
            ],
            [
                11684,
                11823
            ],
            [
                11823,
                11933
            ],
            [
                11933,
                11960
            ],
            [
                11960,
                12004
            ],
            [
                12004,
                12062
            ],
            [
                12062,
                12090
            ],
            [
                12090,
                12179
            ],
            [
                12179,
                12265
            ],
            [
                12265,
                12416
            ],
            [
                12416,
                12424
            ],
            [
                12424,
                12432
            ],
            [
                12432,
                12457
            ],
            [
                12457,
                12538
            ],
            [
                12538,
                12551
            ],
            [
                12551,
                12681
            ],
            [
                12681,
                12736
            ],
            [
                12736,
                12805
            ],
            [
                12805,
                13034
            ],
            [
                13034,
                13159
            ],
            [
                13159,
                13196
            ],
            [
                13196,
                13280
            ],
            [
                13280,
                13328
            ],
            [
                13328,
                13446
            ],
            [
                13446,
                13538
            ],
            [
                13538,
                13579
            ],
            [
                13579,
                13621
            ],
            [
                13621,
                13690
            ],
            [
                13690,
                13725
            ],
            [
                13725,
                13734
            ],
            [
                13734,
                13797
            ],
            [
                13797,
                13846
            ],
            [
                13846,
                13852
            ],
            [
                13852,
                13972
            ],
            [
                13972,
                14023
            ],
            [
                14023,
                14050
            ],
            [
                14050,
                14065
            ],
            [
                14065,
                14168
            ],
            [
                14168,
                14239
            ],
            [
                14239,
                14299
            ],
            [
                14299,
                14369
            ],
            [
                14369,
                14474
            ],
            [
                14474,
                14563
            ],
            [
                14563,
                14702
            ],
            [
                14702,
                14958
            ],
            [
                14958,
                15048
            ],
            [
                15048,
                15116
            ],
            [
                15116,
                15184
            ],
            [
                15184,
                15198
            ],
            [
                15198,
                15287
            ],
            [
                15287,
                15440
            ],
            [
                15440,
                15537
            ],
            [
                15537,
                15723
            ],
            [
                15723,
                15916
            ],
            [
                15916,
                15976
            ],
            [
                15976,
                15985
            ],
            [
                15985,
                16000
            ],
            [
                16000,
                16099
            ],
            [
                16099,
                16113
            ],
            [
                16113,
                16153
            ],
            [
                16153,
                16209
            ],
            [
                16209,
                16221
            ],
            [
                16221,
                16263
            ],
            [
                16263,
                16495
            ],
            [
                16495,
                16621
            ],
            [
                16621,
                16831
            ],
            [
                16831,
                16942
            ],
            [
                16942,
                16992
            ],
            [
                16992,
                17032
            ],
            [
                17032,
                17045
            ],
            [
                17045,
                17080
            ],
            [
                17080,
                17107
            ],
            [
                17107,
                17205
            ],
            [
                17205,
                17266
            ],
            [
                17266,
                17333
            ],
            [
                17333,
                17501
            ],
            [
                17501,
                17576
            ],
            [
                17576,
                17620
            ],
            [
                17620,
                17769
            ],
            [
                17769,
                17934
            ],
            [
                17934,
                18013
            ],
            [
                18013,
                18041
            ],
            [
                18041,
                18055
            ],
            [
                18055,
                18090
            ],
            [
                18090,
                18142
            ],
            [
                18142,
                18329
            ],
            [
                18329,
                18358
            ],
            [
                18358,
                18370
            ],
            [
                18370,
                18446
            ],
            [
                18446,
                18451
            ],
            [
                18451,
                18495
            ],
            [
                18495,
                18535
            ],
            [
                18535,
                18571
            ],
            [
                18571,
                18724
            ],
            [
                18724,
                18951
            ],
            [
                18951,
                19018
            ],
            [
                19018,
                19076
            ],
            [
                19076,
                19291
            ],
            [
                19291,
                19731
            ],
            [
                19731,
                19840
            ],
            [
                19840,
                19980
            ],
            [
                19980,
                20058
            ],
            [
                20058,
                20142
            ],
            [
                20142,
                20161
            ],
            [
                20161,
                20188
            ],
            [
                20188,
                20208
            ],
            [
                20208,
                20228
            ],
            [
                20228,
                20259
            ],
            [
                20259,
                20286
            ],
            [
                20286,
                20333
            ],
            [
                20333,
                20389
            ],
            [
                20389,
                20533
            ],
            [
                20533,
                20539
            ],
            [
                20539,
                20545
            ],
            [
                20545,
                20563
            ],
            [
                20563,
                20587
            ],
            [
                20587,
                20610
            ],
            [
                20610,
                20725
            ],
            [
                20725,
                20751
            ],
            [
                20751,
                20861
            ],
            [
                20861,
                20907
            ],
            [
                20907,
                20955
            ],
            [
                20955,
                21001
            ],
            [
                21001,
                21024
            ],
            [
                21024,
                21127
            ],
            [
                21127,
                21307
            ],
            [
                21307,
                21507
            ],
            [
                21507,
                21770
            ],
            [
                21770,
                21939
            ],
            [
                21939,
                22062
            ],
            [
                22062,
                22135
            ],
            [
                22135,
                22198
            ],
            [
                22198,
                22346
            ],
            [
                22346,
                22442
            ],
            [
                22442,
                22568
            ],
            [
                22568,
                22625
            ],
            [
                22625,
                22731
            ],
            [
                22731,
                22824
            ],
            [
                22824,
                22865
            ],
            [
                22865,
                23054
            ],
            [
                23054,
                23229
            ],
            [
                23229,
                23387
            ],
            [
                23387,
                23435
            ],
            [
                23435,
                23499
            ],
            [
                23499,
                23558
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                46,
                78
            ],
            [
                105,
                114
            ],
            [
                121,
                123
            ],
            [
                145,
                160
            ],
            [
                160,
                240
            ],
            [
                240,
                256
            ],
            [
                934,
                937
            ],
            [
                269,
                270
            ],
            [
                275,
                293
            ],
            [
                318,
                338
            ],
            [
                341,
                354
            ],
            [
                368,
                381
            ],
            [
                382,
                403
            ],
            [
                907,
                910
            ],
            [
                412,
                432
            ],
            [
                439,
                443
            ],
            [
                573,
                575
            ],
            [
                489,
                512
            ],
            [
                520,
                521
            ],
            [
                257,
                260
            ],
            [
                486,
                488
            ],
            [
                630,
                696
            ],
            [
                702,
                742
            ],
            [
                831,
                848
            ],
            [
                770,
                787
            ],
            [
                849,
                901
            ],
            [
                949,
                951
            ],
            [
                951,
                997
            ],
            [
                1011,
                1013
            ],
            [
                1028,
                1035
            ],
            [
                1035,
                1067
            ],
            [
                1085,
                1122
            ],
            [
                1164,
                1246
            ],
            [
                1253,
                1292
            ],
            [
                1295,
                1310
            ],
            [
                1316,
                1333
            ],
            [
                1339,
                1389
            ],
            [
                1389,
                1454
            ],
            [
                1462,
                1480
            ],
            [
                1490,
                1499
            ],
            [
                1502,
                1522
            ],
            [
                1584,
                1672
            ],
            [
                1757,
                1772
            ],
            [
                1787,
                1858
            ],
            [
                1862,
                1869
            ],
            [
                1876,
                1884
            ],
            [
                1889,
                1898
            ],
            [
                1901,
                1905
            ],
            [
                1917,
                1918
            ],
            [
                1920,
                1928
            ],
            [
                1950,
                1975
            ],
            [
                1975,
                1986
            ],
            [
                2037,
                2078
            ],
            [
                2088,
                2094
            ],
            [
                2137,
                2155
            ],
            [
                2176,
                2181
            ],
            [
                2214,
                2231
            ],
            [
                2258,
                2280
            ],
            [
                2290,
                2292
            ],
            [
                2292,
                2351
            ],
            [
                2404,
                2408
            ],
            [
                2429,
                2437
            ],
            [
                2448,
                2478
            ],
            [
                2478,
                2519
            ],
            [
                2541,
                2604
            ],
            [
                2837,
                2838
            ],
            [
                2610,
                2647
            ],
            [
                2661,
                2673
            ],
            [
                2681,
                2690
            ],
            [
                2708,
                2722
            ],
            [
                2756,
                2764
            ],
            [
                2723,
                2740
            ],
            [
                2839,
                2860
            ],
            [
                2869,
                2883
            ],
            [
                2919,
                2928
            ],
            [
                2912,
                2915
            ],
            [
                2943,
                2994
            ],
            [
                3031,
                3033
            ],
            [
                3095,
                3112
            ],
            [
                3112,
                3138
            ],
            [
                3093,
                3094
            ],
            [
                3175,
                3218
            ],
            [
                3033,
                3035
            ],
            [
                3162,
                3173
            ],
            [
                3235,
                3260
            ],
            [
                3265,
                3274
            ],
            [
                3283,
                3300
            ],
            [
                3327,
                3413
            ],
            [
                3325,
                3326
            ],
            [
                3415,
                3417
            ],
            [
                3437,
                3520
            ],
            [
                3543,
                3570
            ],
            [
                3570,
                3600
            ],
            [
                3620,
                3621
            ],
            [
                3627,
                3636
            ],
            [
                3642,
                3656
            ],
            [
                3601,
                3605
            ],
            [
                3609,
                3620
            ],
            [
                3657,
                3712
            ],
            [
                3712,
                3759
            ],
            [
                3782,
                3801
            ],
            [
                3895,
                3931
            ],
            [
                3987,
                3988
            ],
            [
                3989,
                4017
            ],
            [
                4035,
                4082
            ],
            [
                4096,
                4099
            ],
            [
                4101,
                4125
            ],
            [
                4126,
                4131
            ],
            [
                4157,
                4159
            ],
            [
                4159,
                4186
            ],
            [
                4190,
                4191
            ],
            [
                4265,
                4286
            ],
            [
                4382,
                4383
            ],
            [
                4288,
                4382
            ],
            [
                4396,
                4406
            ],
            [
                4406,
                4504
            ],
            [
                4520,
                4522
            ],
            [
                4522,
                4591
            ],
            [
                4598,
                4694
            ],
            [
                4698,
                4739
            ],
            [
                4762,
                4808
            ],
            [
                4864,
                4888
            ],
            [
                4986,
                4988
            ],
            [
                5015,
                5024
            ],
            [
                5024,
                5026
            ],
            [
                5077,
                5122
            ],
            [
                5124,
                5135
            ],
            [
                5145,
                5203
            ],
            [
                5212,
                5218
            ],
            [
                5218,
                5240
            ],
            [
                5251,
                5269
            ],
            [
                5270,
                5285
            ],
            [
                5285,
                5304
            ],
            [
                5334,
                5367
            ],
            [
                5367,
                5385
            ],
            [
                5385,
                5412
            ],
            [
                5484,
                5524
            ],
            [
                5564,
                5572
            ],
            [
                5544,
                5558
            ],
            [
                5577,
                5597
            ],
            [
                5597,
                5655
            ],
            [
                5655,
                5714
            ],
            [
                5758,
                5760
            ],
            [
                6003,
                6004
            ],
            [
                5916,
                5924
            ],
            [
                5935,
                5952
            ],
            [
                5961,
                6003
            ],
            [
                6040,
                6042
            ],
            [
                6275,
                6294
            ],
            [
                6327,
                6379
            ],
            [
                6387,
                6422
            ],
            [
                6427,
                6435
            ],
            [
                6618,
                6620
            ],
            [
                6520,
                6532
            ],
            [
                6546,
                6561
            ],
            [
                6562,
                6574
            ],
            [
                6598,
                6601
            ],
            [
                6607,
                6611
            ],
            [
                6509,
                6511
            ],
            [
                6626,
                6629
            ],
            [
                6634,
                6640
            ],
            [
                6655,
                6671
            ],
            [
                6763,
                6765
            ],
            [
                6765,
                6847
            ],
            [
                6881,
                6886
            ],
            [
                6890,
                6927
            ],
            [
                6927,
                6946
            ],
            [
                6964,
                6970
            ],
            [
                6947,
                6963
            ],
            [
                6971,
                6973
            ],
            [
                6983,
                6988
            ],
            [
                6996,
                7022
            ],
            [
                7039,
                7044
            ],
            [
                7026,
                7038
            ],
            [
                7049,
                7056
            ],
            [
                7062,
                7072
            ],
            [
                7079,
                7085
            ],
            [
                7088,
                7099
            ],
            [
                7162,
                7163
            ],
            [
                7119,
                7142
            ],
            [
                7154,
                7162
            ],
            [
                7229,
                7288
            ],
            [
                7290,
                7312
            ],
            [
                7361,
                7396
            ],
            [
                7434,
                7491
            ],
            [
                7493,
                7502
            ],
            [
                7504,
                7512
            ],
            [
                7528,
                7530
            ],
            [
                7531,
                7550
            ],
            [
                7553,
                7591
            ],
            [
                7602,
                7638
            ],
            [
                7639,
                7664
            ],
            [
                7667,
                7669
            ],
            [
                7691,
                7693
            ],
            [
                7702,
                7709
            ],
            [
                7730,
                7739
            ],
            [
                7759,
                7766
            ],
            [
                7698,
                7701
            ],
            [
                7772,
                7782
            ],
            [
                7795,
                7797
            ],
            [
                7797,
                7851
            ],
            [
                7891,
                7909
            ],
            [
                7949,
                7982
            ],
            [
                7984,
                7989
            ],
            [
                7989,
                7994
            ],
            [
                7994,
                7999
            ],
            [
                7999,
                8002
            ],
            [
                8008,
                8043
            ],
            [
                8043,
                8065
            ],
            [
                8065,
                8079
            ],
            [
                8085,
                8091
            ],
            [
                8095,
                8143
            ],
            [
                8146,
                8154
            ],
            [
                8178,
                8212
            ],
            [
                8219,
                8220
            ],
            [
                8221,
                8225
            ],
            [
                8225,
                8226
            ],
            [
                8234,
                8251
            ],
            [
                8254,
                8265
            ],
            [
                8453,
                8457
            ],
            [
                8468,
                8476
            ],
            [
                8265,
                8289
            ],
            [
                8476,
                8478
            ],
            [
                8478,
                8501
            ],
            [
                8525,
                8552
            ],
            [
                8634,
                8636
            ],
            [
                8660,
                8690
            ],
            [
                8658,
                8659
            ],
            [
                8691,
                8694
            ],
            [
                8749,
                8750
            ],
            [
                8777,
                8798
            ],
            [
                8804,
                8830
            ],
            [
                8751,
                8754
            ],
            [
                8837,
                8915
            ],
            [
                8916,
                8941
            ],
            [
                8944,
                8946
            ],
            [
                8957,
                8965
            ],
            [
                8966,
                8977
            ],
            [
                8984,
                9008
            ],
            [
                9011,
                9022
            ],
            [
                9051,
                9054
            ],
            [
                9062,
                9115
            ],
            [
                9149,
                9170
            ],
            [
                9189,
                9219
            ],
            [
                9220,
                9224
            ],
            [
                9232,
                9240
            ],
            [
                9243,
                9250
            ],
            [
                9252,
                9266
            ],
            [
                9365,
                9370
            ],
            [
                9297,
                9298
            ],
            [
                9371,
                9381
            ],
            [
                9401,
                9403
            ],
            [
                9270,
                9273
            ],
            [
                9406,
                9414
            ],
            [
                9315,
                9317
            ],
            [
                9319,
                9323
            ],
            [
                9274,
                9281
            ],
            [
                9418,
                9465
            ],
            [
                9468,
                9478
            ],
            [
                9486,
                9490
            ],
            [
                9686,
                9687
            ],
            [
                9688,
                9689
            ],
            [
                9758,
                9770
            ],
            [
                9797,
                9802
            ],
            [
                9839,
                9865
            ],
            [
                9882,
                9891
            ],
            [
                9892,
                9928
            ],
            [
                9933,
                9936
            ],
            [
                9937,
                9964
            ],
            [
                9972,
                9981
            ],
            [
                9998,
                10003
            ],
            [
                10008,
                10041
            ],
            [
                10134,
                10152
            ],
            [
                10152,
                10153
            ],
            [
                10171,
                10183
            ],
            [
                10214,
                10215
            ],
            [
                10188,
                10192
            ],
            [
                10353,
                10354
            ],
            [
                10225,
                10228
            ],
            [
                10229,
                10237
            ],
            [
                10263,
                10313
            ],
            [
                10325,
                10353
            ],
            [
                10477,
                10479
            ],
            [
                10479,
                10524
            ],
            [
                10538,
                10548
            ],
            [
                10612,
                10756
            ],
            [
                10765,
                10796
            ],
            [
                10823,
                10825
            ],
            [
                10975,
                10982
            ],
            [
                10986,
                11004
            ],
            [
                11014,
                11051
            ],
            [
                11051,
                11092
            ],
            [
                11094,
                11116
            ],
            [
                11119,
                11122
            ],
            [
                11156,
                11182
            ],
            [
                11191,
                11201
            ],
            [
                11237,
                11240
            ],
            [
                11265,
                11267
            ],
            [
                11301,
                11317
            ],
            [
                11329,
                11375
            ],
            [
                11436,
                11439
            ],
            [
                11273,
                11276
            ],
            [
                11496,
                11498
            ],
            [
                11684,
                11685
            ],
            [
                11690,
                11693
            ],
            [
                11720,
                11742
            ],
            [
                11773,
                11822
            ],
            [
                11868,
                11879
            ],
            [
                11881,
                11933
            ],
            [
                11933,
                11958
            ],
            [
                12005,
                12017
            ],
            [
                12020,
                12032
            ],
            [
                12034,
                12059
            ],
            [
                12063,
                12087
            ],
            [
                12090,
                12098
            ],
            [
                12177,
                12179
            ],
            [
                12180,
                12221
            ],
            [
                12224,
                12231
            ],
            [
                12290,
                12292
            ],
            [
                12319,
                12346
            ],
            [
                12399,
                12400
            ],
            [
                12348,
                12364
            ],
            [
                12375,
                12379
            ],
            [
                12370,
                12374
            ],
            [
                12315,
                12318
            ],
            [
                12395,
                12399
            ],
            [
                12411,
                12413
            ],
            [
                12437,
                12454
            ],
            [
                12539,
                12548
            ],
            [
                12551,
                12570
            ],
            [
                12590,
                12591
            ],
            [
                12614,
                12620
            ],
            [
                12629,
                12630
            ],
            [
                12651,
                12681
            ],
            [
                12686,
                12736
            ],
            [
                12736,
                12805
            ],
            [
                12805,
                12841
            ],
            [
                13032,
                13034
            ],
            [
                13092,
                13156
            ],
            [
                13159,
                13194
            ],
            [
                13224,
                13248
            ],
            [
                13260,
                13280
            ],
            [
                13280,
                13303
            ],
            [
                13305,
                13328
            ],
            [
                13328,
                13355
            ],
            [
                13432,
                13440
            ],
            [
                13356,
                13366
            ],
            [
                13367,
                13374
            ],
            [
                13444,
                13446
            ],
            [
                13469,
                13474
            ],
            [
                13446,
                13448
            ],
            [
                13506,
                13524
            ],
            [
                13536,
                13538
            ],
            [
                13539,
                13567
            ],
            [
                13570,
                13578
            ],
            [
                13691,
                13722
            ],
            [
                13725,
                13734
            ],
            [
                13743,
                13761
            ],
            [
                13795,
                13797
            ],
            [
                13803,
                13805
            ],
            [
                13825,
                13828
            ],
            [
                13818,
                13820
            ],
            [
                13847,
                13849
            ],
            [
                13852,
                13871
            ],
            [
                13880,
                13882
            ],
            [
                13889,
                13917
            ],
            [
                13970,
                13972
            ],
            [
                13972,
                13984
            ],
            [
                13986,
                13989
            ],
            [
                13990,
                14023
            ],
            [
                14023,
                14050
            ],
            [
                14050,
                14065
            ],
            [
                14092,
                14101
            ],
            [
                14103,
                14106
            ],
            [
                14108,
                14112
            ],
            [
                14118,
                14166
            ],
            [
                14273,
                14288
            ],
            [
                14302,
                14336
            ],
            [
                14259,
                14266
            ],
            [
                14367,
                14369
            ],
            [
                14371,
                14373
            ],
            [
                14395,
                14396
            ],
            [
                14369,
                14370
            ],
            [
                14537,
                14563
            ],
            [
                14563,
                14621
            ],
            [
                14641,
                14642
            ],
            [
                14647,
                14648
            ],
            [
                14656,
                14677
            ],
            [
                14692,
                14702
            ],
            [
                14789,
                14790
            ],
            [
                14803,
                14807
            ],
            [
                14718,
                14725
            ],
            [
                14842,
                14920
            ],
            [
                14739,
                14740
            ],
            [
                14932,
                14936
            ],
            [
                14938,
                14955
            ],
            [
                14958,
                14967
            ],
            [
                15044,
                15046
            ],
            [
                14979,
                14995
            ],
            [
                15046,
                15048
            ],
            [
                15114,
                15116
            ],
            [
                15116,
                15117
            ],
            [
                15155,
                15156
            ],
            [
                15130,
                15132
            ],
            [
                15166,
                15167
            ],
            [
                15175,
                15181
            ],
            [
                15191,
                15195
            ],
            [
                15198,
                15223
            ],
            [
                15285,
                15287
            ],
            [
                15375,
                15376
            ],
            [
                15363,
                15367
            ],
            [
                15377,
                15378
            ],
            [
                15390,
                15401
            ],
            [
                15407,
                15413
            ],
            [
                15419,
                15438
            ],
            [
                15578,
                15579
            ],
            [
                15559,
                15568
            ],
            [
                15600,
                15601
            ],
            [
                15670,
                15673
            ],
            [
                15580,
                15600
            ],
            [
                15721,
                15723
            ],
            [
                15916,
                15922
            ],
            [
                15950,
                15976
            ],
            [
                15985,
                15987
            ],
            [
                15998,
                16000
            ],
            [
                16001,
                16014
            ],
            [
                16020,
                16039
            ],
            [
                16049,
                16078
            ],
            [
                16263,
                16265
            ],
            [
                16267,
                16270
            ],
            [
                16272,
                16320
            ],
            [
                16420,
                16434
            ],
            [
                16403,
                16406
            ],
            [
                16374,
                16376
            ],
            [
                16381,
                16385
            ],
            [
                16353,
                16356
            ],
            [
                16398,
                16402
            ],
            [
                16493,
                16495
            ],
            [
                16495,
                16496
            ],
            [
                16528,
                16537
            ],
            [
                16547,
                16555
            ],
            [
                16509,
                16510
            ],
            [
                16916,
                16918
            ],
            [
                16880,
                16892
            ],
            [
                16896,
                16911
            ],
            [
                16940,
                16942
            ],
            [
                16943,
                16981
            ],
            [
                16984,
                16992
            ],
            [
                16993,
                17004
            ],
            [
                17022,
                17029
            ],
            [
                17034,
                17041
            ],
            [
                17056,
                17059
            ],
            [
                17080,
                17093
            ],
            [
                17096,
                17104
            ],
            [
                17107,
                17113
            ],
            [
                17131,
                17147
            ],
            [
                17155,
                17158
            ],
            [
                17161,
                17169
            ],
            [
                17190,
                17202
            ],
            [
                17211,
                17230
            ],
            [
                17233,
                17244
            ],
            [
                17246,
                17255
            ],
            [
                17266,
                17267
            ],
            [
                17272,
                17274
            ],
            [
                17331,
                17333
            ],
            [
                17333,
                17376
            ],
            [
                17403,
                17428
            ],
            [
                17499,
                17501
            ],
            [
                17502,
                17510
            ],
            [
                17518,
                17525
            ],
            [
                17534,
                17558
            ],
            [
                17574,
                17576
            ],
            [
                17577,
                17581
            ],
            [
                17594,
                17596
            ],
            [
                17607,
                17618
            ],
            [
                17769,
                17772
            ],
            [
                17780,
                17785
            ],
            [
                17794,
                17814
            ],
            [
                17822,
                17839
            ],
            [
                17890,
                17891
            ],
            [
                17858,
                17863
            ],
            [
                17873,
                17890
            ],
            [
                17919,
                17921
            ],
            [
                17849,
                17854
            ],
            [
                17932,
                17934
            ],
            [
                17935,
                17943
            ],
            [
                17946,
                17957
            ],
            [
                17970,
                17978
            ],
            [
                17980,
                18013
            ],
            [
                18013,
                18029
            ],
            [
                18043,
                18047
            ],
            [
                18055,
                18090
            ],
            [
                18091,
                18094
            ],
            [
                18097,
                18107
            ],
            [
                18126,
                18129
            ],
            [
                18132,
                18139
            ],
            [
                18142,
                18175
            ],
            [
                18327,
                18329
            ],
            [
                18330,
                18355
            ],
            [
                18383,
                18404
            ],
            [
                18434,
                18443
            ],
            [
                18447,
                18451
            ],
            [
                18451,
                18455
            ],
            [
                18465,
                18477
            ],
            [
                18479,
                18492
            ],
            [
                18495,
                18535
            ],
            [
                18550,
                18551
            ],
            [
                18536,
                18547
            ],
            [
                18552,
                18559
            ],
            [
                18569,
                18571
            ],
            [
                18657,
                18671
            ],
            [
                18675,
                18682
            ],
            [
                18573,
                18574
            ],
            [
                18710,
                18717
            ],
            [
                18958,
                18959
            ],
            [
                18995,
                19018
            ],
            [
                19018,
                19035
            ],
            [
                19044,
                19045
            ],
            [
                19050,
                19073
            ],
            [
                19076,
                19092
            ],
            [
                19118,
                19126
            ],
            [
                19136,
                19158
            ],
            [
                19179,
                19203
            ],
            [
                19218,
                19258
            ],
            [
                19271,
                19291
            ],
            [
                19291,
                19309
            ],
            [
                19320,
                19321
            ],
            [
                19330,
                19337
            ],
            [
                19354,
                19415
            ],
            [
                19497,
                19500
            ],
            [
                19416,
                19430
            ],
            [
                19431,
                19444
            ],
            [
                19451,
                19467
            ],
            [
                19592,
                19593
            ],
            [
                19523,
                19526
            ],
            [
                19594,
                19602
            ],
            [
                19603,
                19620
            ],
            [
                19518,
                19522
            ],
            [
                19715,
                19731
            ],
            [
                19731,
                19760
            ],
            [
                19815,
                19839
            ],
            [
                19957,
                19967
            ],
            [
                19975,
                19977
            ],
            [
                19940,
                19949
            ],
            [
                19921,
                19923
            ],
            [
                19934,
                19939
            ],
            [
                19980,
                20012
            ],
            [
                20031,
                20058
            ],
            [
                20058,
                20103
            ],
            [
                20121,
                20124
            ],
            [
                20140,
                20142
            ],
            [
                20149,
                20152
            ],
            [
                20186,
                20188
            ],
            [
                20193,
                20208
            ],
            [
                20286,
                20323
            ],
            [
                20331,
                20333
            ],
            [
                20333,
                20352
            ],
            [
                20359,
                20361
            ],
            [
                20366,
                20380
            ],
            [
                20389,
                20415
            ],
            [
                20438,
                20461
            ],
            [
                20479,
                20489
            ],
            [
                20522,
                20533
            ],
            [
                20534,
                20539
            ],
            [
                20539,
                20542
            ],
            [
                20545,
                20563
            ],
            [
                20621,
                20622
            ],
            [
                20653,
                20657
            ],
            [
                20666,
                20671
            ],
            [
                20674,
                20683
            ],
            [
                20686,
                20697
            ],
            [
                20907,
                20927
            ],
            [
                20933,
                20953
            ],
            [
                21031,
                21038
            ],
            [
                21042,
                21061
            ],
            [
                21069,
                21127
            ],
            [
                21307,
                21324
            ],
            [
                21335,
                21369
            ],
            [
                21505,
                21507
            ],
            [
                21728,
                21731
            ],
            [
                21530,
                21585
            ],
            [
                21598,
                21601
            ],
            [
                21605,
                21617
            ],
            [
                21651,
                21652
            ],
            [
                21619,
                21626
            ],
            [
                21664,
                21694
            ],
            [
                21702,
                21722
            ],
            [
                21741,
                21748
            ],
            [
                21756,
                21769
            ],
            [
                21806,
                21824
            ],
            [
                21878,
                21883
            ],
            [
                21907,
                21939
            ],
            [
                21939,
                21946
            ],
            [
                21962,
                21971
            ],
            [
                22026,
                22027
            ],
            [
                21990,
                22007
            ],
            [
                22045,
                22062
            ],
            [
                22075,
                22079
            ],
            [
                22081,
                22090
            ],
            [
                22093,
                22134
            ],
            [
                22150,
                22177
            ],
            [
                22179,
                22198
            ],
            [
                22228,
                22235
            ],
            [
                22287,
                22290
            ],
            [
                22297,
                22299
            ],
            [
                22302,
                22313
            ],
            [
                22313,
                22318
            ],
            [
                22268,
                22272
            ],
            [
                22344,
                22346
            ],
            [
                22368,
                22369
            ],
            [
                22358,
                22364
            ],
            [
                22370,
                22383
            ],
            [
                22442,
                22477
            ],
            [
                22505,
                22532
            ],
            [
                22534,
                22545
            ],
            [
                22555,
                22568
            ],
            [
                22568,
                22582
            ],
            [
                22606,
                22610
            ],
            [
                22615,
                22625
            ],
            [
                22625,
                22731
            ],
            [
                22731,
                22741
            ],
            [
                22777,
                22823
            ],
            [
                22824,
                22837
            ],
            [
                22839,
                22842
            ],
            [
                22844,
                22865
            ],
            [
                22865,
                22910
            ],
            [
                22920,
                22953
            ],
            [
                23052,
                23054
            ],
            [
                23054,
                23123
            ],
            [
                23139,
                23229
            ],
            [
                23229,
                23300
            ],
            [
                23354,
                23355
            ],
            [
                23301,
                23324
            ],
            [
                23342,
                23344
            ],
            [
                23328,
                23335
            ],
            [
                23385,
                23387
            ],
            [
                23387,
                23388
            ],
            [
                23392,
                23435
            ],
            [
                23445,
                23450
            ],
            [
                23454,
                23475
            ],
            [
                23484,
                23499
            ],
            [
                23499,
                23548
            ],
            [
                23549,
                23558
            ]
        ],
        "row_chars": [
            [
                0,
                160
            ],
            [
                160,
                240
            ],
            [
                240,
                951
            ],
            [
                951,
                1035
            ],
            [
                1035,
                1246
            ],
            [
                1246,
                1310
            ],
            [
                1310,
                1389
            ],
            [
                1389,
                1457
            ],
            [
                1457,
                1672
            ],
            [
                1672,
                1861
            ],
            [
                1861,
                1975
            ],
            [
                1975,
                2088
            ],
            [
                2088,
                2292
            ],
            [
                2292,
                2478
            ],
            [
                2478,
                2839
            ],
            [
                2839,
                3033
            ],
            [
                3033,
                3261
            ],
            [
                3261,
                3570
            ],
            [
                3570,
                3712
            ],
            [
                3712,
                3989
            ],
            [
                3989,
                4159
            ],
            [
                4159,
                4192
            ],
            [
                4192,
                4255
            ],
            [
                4255,
                4265
            ],
            [
                4265,
                4406
            ],
            [
                4406,
                4522
            ],
            [
                4522,
                4591
            ],
            [
                4591,
                4808
            ],
            [
                4808,
                5026
            ],
            [
                5026,
                5077
            ],
            [
                5077,
                5218
            ],
            [
                5218,
                5285
            ],
            [
                5285,
                5367
            ],
            [
                5367,
                5385
            ],
            [
                5385,
                5412
            ],
            [
                5412,
                5597
            ],
            [
                5597,
                5655
            ],
            [
                5655,
                5760
            ],
            [
                5760,
                5916
            ],
            [
                5916,
                6042
            ],
            [
                6042,
                6435
            ],
            [
                6435,
                6491
            ],
            [
                6491,
                6765
            ],
            [
                6765,
                6927
            ],
            [
                6927,
                7056
            ],
            [
                7056,
                7164
            ],
            [
                7164,
                7229
            ],
            [
                7229,
                7315
            ],
            [
                7315,
                7360
            ],
            [
                7360,
                7399
            ],
            [
                7399,
                7434
            ],
            [
                7434,
                7530
            ],
            [
                7530,
                7553
            ],
            [
                7553,
                7638
            ],
            [
                7638,
                7667
            ],
            [
                7667,
                7693
            ],
            [
                7693,
                7797
            ],
            [
                7797,
                7989
            ],
            [
                7989,
                7994
            ],
            [
                7994,
                7999
            ],
            [
                7999,
                8043
            ],
            [
                8043,
                8065
            ],
            [
                8065,
                8094
            ],
            [
                8094,
                8146
            ],
            [
                8146,
                8212
            ],
            [
                8212,
                8225
            ],
            [
                8225,
                8478
            ],
            [
                8478,
                8636
            ],
            [
                8636,
                8915
            ],
            [
                8915,
                8944
            ],
            [
                8944,
                8965
            ],
            [
                8965,
                8980
            ],
            [
                8980,
                9022
            ],
            [
                9022,
                9051
            ],
            [
                9051,
                9148
            ],
            [
                9148,
                9173
            ],
            [
                9173,
                9219
            ],
            [
                9219,
                9417
            ],
            [
                9417,
                9468
            ],
            [
                9468,
                9688
            ],
            [
                9688,
                9892
            ],
            [
                9892,
                10152
            ],
            [
                10152,
                10479
            ],
            [
                10479,
                10825
            ],
            [
                10825,
                10881
            ],
            [
                10881,
                11051
            ],
            [
                11051,
                11267
            ],
            [
                11267,
                11498
            ],
            [
                11498,
                11684
            ],
            [
                11684,
                11823
            ],
            [
                11823,
                11933
            ],
            [
                11933,
                11960
            ],
            [
                11960,
                12004
            ],
            [
                12004,
                12062
            ],
            [
                12062,
                12090
            ],
            [
                12090,
                12179
            ],
            [
                12179,
                12265
            ],
            [
                12265,
                12416
            ],
            [
                12416,
                12424
            ],
            [
                12424,
                12432
            ],
            [
                12432,
                12457
            ],
            [
                12457,
                12538
            ],
            [
                12538,
                12551
            ],
            [
                12551,
                12681
            ],
            [
                12681,
                12736
            ],
            [
                12736,
                12805
            ],
            [
                12805,
                13034
            ],
            [
                13034,
                13159
            ],
            [
                13159,
                13280
            ],
            [
                13280,
                13328
            ],
            [
                13328,
                13446
            ],
            [
                13446,
                13538
            ],
            [
                13538,
                13579
            ],
            [
                13579,
                13621
            ],
            [
                13621,
                13690
            ],
            [
                13690,
                13725
            ],
            [
                13725,
                13734
            ],
            [
                13734,
                13797
            ],
            [
                13797,
                13846
            ],
            [
                13846,
                13852
            ],
            [
                13852,
                13972
            ],
            [
                13972,
                14023
            ],
            [
                14023,
                14050
            ],
            [
                14050,
                14065
            ],
            [
                14065,
                14168
            ],
            [
                14168,
                14239
            ],
            [
                14239,
                14369
            ],
            [
                14369,
                14563
            ],
            [
                14563,
                14702
            ],
            [
                14702,
                14958
            ],
            [
                14958,
                15048
            ],
            [
                15048,
                15116
            ],
            [
                15116,
                15184
            ],
            [
                15184,
                15198
            ],
            [
                15198,
                15287
            ],
            [
                15287,
                15440
            ],
            [
                15440,
                15537
            ],
            [
                15537,
                15723
            ],
            [
                15723,
                15916
            ],
            [
                15916,
                15976
            ],
            [
                15976,
                15985
            ],
            [
                15985,
                16000
            ],
            [
                16000,
                16099
            ],
            [
                16099,
                16113
            ],
            [
                16113,
                16153
            ],
            [
                16153,
                16209
            ],
            [
                16209,
                16221
            ],
            [
                16221,
                16263
            ],
            [
                16263,
                16495
            ],
            [
                16495,
                16942
            ],
            [
                16942,
                16992
            ],
            [
                16992,
                17032
            ],
            [
                17032,
                17045
            ],
            [
                17045,
                17080
            ],
            [
                17080,
                17107
            ],
            [
                17107,
                17205
            ],
            [
                17205,
                17266
            ],
            [
                17266,
                17333
            ],
            [
                17333,
                17501
            ],
            [
                17501,
                17576
            ],
            [
                17576,
                17620
            ],
            [
                17620,
                17769
            ],
            [
                17769,
                17934
            ],
            [
                17934,
                18013
            ],
            [
                18013,
                18041
            ],
            [
                18041,
                18055
            ],
            [
                18055,
                18090
            ],
            [
                18090,
                18142
            ],
            [
                18142,
                18329
            ],
            [
                18329,
                18358
            ],
            [
                18358,
                18370
            ],
            [
                18370,
                18446
            ],
            [
                18446,
                18451
            ],
            [
                18451,
                18495
            ],
            [
                18495,
                18535
            ],
            [
                18535,
                18571
            ],
            [
                18571,
                18724
            ],
            [
                18724,
                18951
            ],
            [
                18951,
                19018
            ],
            [
                19018,
                19076
            ],
            [
                19076,
                19291
            ],
            [
                19291,
                19731
            ],
            [
                19731,
                19840
            ],
            [
                19840,
                19980
            ],
            [
                19980,
                20058
            ],
            [
                20058,
                20142
            ],
            [
                20142,
                20161
            ],
            [
                20161,
                20188
            ],
            [
                20188,
                20208
            ],
            [
                20208,
                20228
            ],
            [
                20228,
                20259
            ],
            [
                20259,
                20286
            ],
            [
                20286,
                20333
            ],
            [
                20333,
                20389
            ],
            [
                20389,
                20533
            ],
            [
                20533,
                20539
            ],
            [
                20539,
                20545
            ],
            [
                20545,
                20563
            ],
            [
                20563,
                20587
            ],
            [
                20587,
                20610
            ],
            [
                20610,
                20725
            ],
            [
                20725,
                20751
            ],
            [
                20751,
                20861
            ],
            [
                20861,
                20907
            ],
            [
                20907,
                20955
            ],
            [
                20955,
                21001
            ],
            [
                21001,
                21024
            ],
            [
                21024,
                21127
            ],
            [
                21127,
                21307
            ],
            [
                21307,
                21507
            ],
            [
                21507,
                21770
            ],
            [
                21770,
                21939
            ],
            [
                21939,
                22062
            ],
            [
                22062,
                22135
            ],
            [
                22135,
                22198
            ],
            [
                22198,
                22346
            ],
            [
                22346,
                22442
            ],
            [
                22442,
                22568
            ],
            [
                22568,
                22625
            ],
            [
                22625,
                22731
            ],
            [
                22731,
                22824
            ],
            [
                22824,
                22865
            ],
            [
                22865,
                23054
            ],
            [
                23054,
                23229
            ],
            [
                23229,
                23387
            ],
            [
                23387,
                23435
            ],
            [
                23435,
                23499
            ],
            [
                23499,
                23558
            ]
        ]
    },
    "abridged": {
        "text": "For two months the fugitives remained absent. In those two months, Mrs. Linton overcame the worst of a brain fever. No mother could have nursed an only child more devotedly than Edgar tended her. Day and night he watched her, patiently enduring her irritable nerves and shaken reason; and, though Dr. Kenneth remarked that she had been saved from the grave only to cause constant future anxiety, Edgar was full of gratitude and joy when Catherine's life was declared out of danger. Hour after hour he would sit beside her, under the illusion that as she returned to bodily health, her mind would settle back to its right balance also.\nThe first time she left her chamber was at the start of March. Mr. Linton had put on her pillow a handful of golden crocuses; her eye caught them in waking, and shone delighted as she gathered them eagerly together.\n'These are the earliest flowers at the Heights,' she exclaimed. 'They remind me of soft winds, and warm sunshine, and nearly melted snow. Edgar, is there not a south wind, and is not the snow almost gone?'\n'The snow is quite gone, darling,' replied her husband; 'the sky is blue, and the larks are singing, and the becks and brooks are all brim full. I wish you were up those hills: the air blows so sweetly, I feel that it would cure you.'\n'I shall be there only once more,' she said; 'and then I shall remain for ever. Next spring you'll look back and think you were happy today.'\nLinton tried to cheer her; but she let the tears stream down her cheeks. We knew she was really better, and, therefore, decided that this sadness might be removed by a change of scene. The master told me to light a fire in the parlour, and to set an easy-chair in the sunshine by the window. Then he brought her down, and she sat enjoying the heat, and revived by the familiar objects round her.\nBy evening she seemed exhausted; yet she would not return to her bedroom, and I had to arrange the parlour sofa for her bed. We fitted up this room for her, where you lie at present, and she was soon strong enough to move from here to the parlour, leaning on Edgar's arm.\nI thought she might recover; and there was double cause to desire it, for on her existence depended that of another. We hoped that in a little while Mr. Linton's heart would be gladdened, and his lands secured, by the birth of an heir.\nI should mention that Isabella, six weeks after her departure, sent her brother a short note, announcing her marriage with Heathcliff. It appeared dry and cold; but at the bottom was scribbled an obscure apology, asserting that she could not help it.\nLinton did not reply to this. In a fortnight more, I got a long letter, which was odd coming from the pen of a new bride. I'll read it: for I keep it still.\nDear Ellen, it begins, - I came last night to Wuthering Heights, and heard, for the first time, that Catherine has been very ill. I must not write to her, I suppose, and my brother is either too angry or too distressed to answer my letter. Still, I must write to somebody, and the only choice left me is you.\nTell Edgar that I'd give the world to see his face again - that my heart returned to Thrushcross Grange twenty-four hours after I left it, and is full of warm feelings for him, and Catherine! But they need not expect me, although not through any lack of affection for them.\nI want to ask you two questions: the first is, How did you manage to preserve the common sympathies of human nature when you lived here? I cannot recognise any feeling which those around me share with me.\nThe second question is this - Is Mr. Heathcliff a man? If so, is he mad? And if not, is he a devil? Please explain, if you can, what I have married. You must call to see me, Ellen, very soon. Don't write, but come, and bring me something from Edgar.\nNow, you shall hear how I have been received in my new home. Despite its lack of comforts, I should dance for joy, if their absence was the total of my miseries!\nIt was dark when we arrived at the farm-house, and your old fellow-servant, Joseph, came out to receive us by the light of a candle. He raised his torch to my face, squinted malignantly, and turned away to lead the horses into the stables.\nHeathcliff stayed to speak to him, and I entered the kitchen - a dingy, untidy hole; it is changed since it was in your charge. By the fire stood a strong, ruffianly child, in dirty clothes, with a look of Catherine about his eyes and mouth.\n'This is Edgar's nephew,' I reflected. 'I must shake hands, and kiss him.'\nI approached, and, attempting to take his chubby fist, said, 'How do you do, my dear? Shall you and I be friends, Hareton?'\nAn oath, and a threat to set Throttler on me if I did not 'frame off' rewarded me.\n'Hey, Throttler, lad!' whispered the little wretch, rousing a bull-dog from its lair in a corner. 'Now, wilt thou be ganging?' he demanded.\nIn fear of my life, I stepped outside to wait for the others. Mr. Heathcliff was nowhere visible; and Joseph, whom I asked to accompany me in, screwed up his nose and replied - 'Mim! mim! mim! Did ever Christian body hear aught like it? Mincing un' munching! How can I tell what ye say?'\n'I say, I wish you to come with me into the house!' I cried, highly disgusted at his rudeness.\n'Not me! I got summut else to do,' he answered with contempt, and continued his work.\nI walked round the yard to another door, at which I knocked. It was opened by a tall, gaunt, unkempt man; masses of shaggy hair hung on his shoulders; and his eyes, too, were like a ghostly Catherine's with all their beauty annihilated.\n'What's your business here?' he asked grimly. 'Who are you?'\n'My name was Isabella Linton,' I replied. 'I'm married to Mr. Heathcliff, and he has brought me here.'\n'Is he come back, then?' he asked, glaring like a hungry wolf.\n'Yes - just now,' I said; 'but he left me here, and I am frightened of the bull-dog in your kitchen.'\n'It's well the hellish villain has kept his word!' growled my host. I wanted to slip away, but he ordered me in, and shut the door.\nThere was a great fire, and that was the only light in the huge apartment. Its floor had become grey; as had the once brilliant pewter-dishes, now dark with tarnish and dust. I asked if I might call a maid; but Mr. Hindley Earnshaw walked up and down, with his hands in his pockets, quite forgetting my presence.\nYou'll not be surprised, Ellen, at my feeling very cheerless, remembering that four miles distant lay my delightful home, containing the only people I loved on earth; and there might as well be the Atlantic between us, instead of those four miles! The cause of my worst despair was finding nobody who would be my ally against Heathcliff! I had sought shelter at Wuthering Heights almost gladly, because it was better than living alone with him; but the people here will not interfere.\nMeanwhile the clock struck nine, and still my companion paced to and fro, groaning now and then. I could not help weeping, till Earnshaw halted, and gave me a stare of newly-awakened surprise.\nI exclaimed - 'I'm tired with my journey, and I want to go to bed! Where is the maid-servant?'\n'We have none,' he answered; 'you must wait on yourself!'\n'Where must I sleep, then?' I sobbed.\n'Joseph will show you Heathcliff's chamber,' said he. Then he added in the strangest tone - 'Be so good as to lock your door and bolt it!'\n'Why, Mr. Earnshaw?'\n'Look here!' he replied, pulling out a pistol with a knife attached to the barrel. 'That's a great tempter to a desperate man, is it not? I cannot resist going up with this every night, and trying his door. If once I find it open he's done for. When the time comes, not all the angels in heaven shall save him!'\nI surveyed the weapon inquisitively, thinking how powerful I should be with such an instrument! I took it from his hand and touched the blade. He looked astonished at the covetous expression on my face. Snatching it back, he returned it to its hiding-place.\n'I don't care if you tell him,' said he.\n'What has Heathcliff done to you?' I asked. 'How has he wronged you? Why don't you tell him to leave?'\n'No!' thundered Earnshaw; 'if he tries to leave me, he's a dead man! Am I to lose all, without a chance of retrieval? Is Hareton to be a beggar? Oh, damnation! I'll have his gold, and then his blood; and hell shall have his soul!'\nYour old master is clearly on the verge of madness, Ellen. Shuddering, I escaped into the kitchen. Joseph was bending over the fire, peering into a large pan; a bowl of oatmeal stood close by. I guessed that the pan held our supper, and, being hungry, I resolved it should be eatable; so, crying out, 'I'll make the porridge!' I removed it out of his reach. 'Mr. Earnshaw,' I continued, 'tells me to wait on myself: so I will, rather than starve.'\n'Good Lord!' he muttered, sitting down. 'If I must have a mistress set o'er my head, it's time to be flitting!'\nI took no notice, but went briskly to work. Joseph watched me with growing indignation.\n'There!' he cried. 'Hareton, thou won't sup thy porridge tonight; they'll be naught but lumps.'\nIt was rather a rough mess, I own, when poured into the bowls. Hareton seized the jug of milk and drank from it. When I told him he should put it in a mug, he kept drinking and glowered at me defyingly.\n'I shall have my supper in another room,' I said. 'Have you no parlour?'\n'Parlour!' Joseph sneered. 'Nay, we've no parlours. If yah don't like our company, there's master's; an' if yah don't like master, there's us.'\n'Then I shall go upstairs,' I answered; 'show me a room.'\nI picked up my bowl. With great grumblings, the fellow rose, and we mounted to the garrets.\n'Here's a room,' he said, flinging back a cranky door. 'It's good enough to eat porridge in.'\nThe room was a lumber-hole smelling of malt and grain, which were piled around in sacks.\n'Why, man,' I exclaimed angrily, 'this is not a place to sleep in. I wish to see my bedroom.'\n'Bed-room!' he repeated, in a tone of mockery. 'Yah see all t' bedrooms there is - yon's mine.' He pointed into the second garret.\n'What do I want with yours? Mr. Heathcliff does not sleep up here, does he?'\n'Oh! it's Master Hathecliff's ye're wanting?' cried he, as if making a new discovery. 'Couldn't ye have said so? He allas keeps his locked, an' nobody ever goes in but hisself.'\n'Well, there are other rooms. For heaven's sake, let me settle somewhere!'\nHe made no reply. Plodding down the wooden steps, he halted at an apartment which, from the superior quality of its furniture, I assumed to be the best one. There was a carpet, its pattern hidden by dust; a fireplace hung with cut-paper, dropping to pieces; and a handsome oak bedstead with crimson curtains, which had been wrenched roughly from their rings, so that they trailed upon the floor. The chairs were also damaged, as were the panels of the walls.\n'This here is t' master's,' announced my guide. My supper by this time was cold, and my patience exhausted. I insisted on being provided instantly with a room and a bed.\n'Where the devil?' he began. 'The Lord bless us! Ye've seen all but Hareton's bit of a chamber. There's not another hole to lie down in i' th' house!'\nI was so vexed, I flung my porridge on the ground; and then sat on the stairs and cried.\n'Ech! ech!' exclaimed Joseph. 'T' master'll tumble over them broken pots; an' then we'll hear summut! Will Hathecliff bide such bonny ways, think ye?'\nHe went scolding to his den, taking the candle with him; and I remained in the dark. An unexpected aid appeared in the shape of Throttler. The dog pushed its nose against mine by way of salute, and then devoured the porridge, while I collected the shattered earthenware, and dried the spatters of milk with my handkerchief.\nSoon I heard Earnshaw's step, and stole into the nearest doorway. The dog could not avoid him, as I guessed by a piteous yelping. Luckily he passed by me, entered his chamber, and shut the door.\nI found shelter in Hareton's room until Joseph came up with Hareton to put him to bed. 'There's room for both ye an' yer pride downstairs, now,' he said. 'Ye may have it all to yerself!'\nGladly did I take advantage of this. I flung myself into a chair by the fire, and slept. My slumber was over too soon. Mr. Heathcliff awoke me; he had just come in, and demanded, in his loving manner, what I was doing there? I told him that he had the key of our room in his pocket.\nThe adjective our gave mortal offence. He swore it was not, nor ever should be, mine - but I'll not repeat his language! I sometimes wonder at him with an intensity that deadens my fear: yet a tiger or a venomous serpent could not rouse terror in me equal to that which he wakens. He told me of Catherine's illness, and accused my brother of causing it, promising that I should suffer in Edgar's place.\nI hate him - I am wretched - I have been a fool! Do not utter one breath of this to anyone at the Grange. I shall expect you every day - don't disappoint me! Isabella.",
        "paragraph_chars": [
            [
                0,
                635
            ],
            [
                635,
                851
            ],
            [
                851,
                1057
            ],
            [
                1057,
                1292
            ],
            [
                1292,
                1434
            ],
            [
                1434,
                1830
            ],
            [
                1830,
                2102
            ],
            [
                2102,
                2338
            ],
            [
                2338,
                2589
            ],
            [
                2589,
                2746
            ],
            [
                2746,
                3055
            ],
            [
                3055,
                3329
            ],
            [
                3329,
                3534
            ],
            [
                3534,
                3784
            ],
            [
                3784,
                3946
            ],
            [
                3946,
                4186
            ],
            [
                4186,
                4428
            ],
            [
                4428,
                4503
            ],
            [
                4503,
                4627
            ],
            [
                4627,
                4710
            ],
            [
                4710,
                4850
            ],
            [
                4850,
                5138
            ],
            [
                5138,
                5233
            ],
            [
                5233,
                5319
            ],
            [
                5319,
                5556
            ],
            [
                5556,
                5617
            ],
            [
                5617,
                5720
            ],
            [
                5720,
                5783
            ],
            [
                5783,
                5885
            ],
            [
                5885,
                6017
            ],
            [
                6017,
                6330
            ],
            [
                6330,
                6815
            ],
            [
                6815,
                7008
            ],
            [
                7008,
                7103
            ],
            [
                7103,
                7161
            ],
            [
                7161,
                7199
            ],
            [
                7199,
                7338
            ],
            [
                7338,
                7359
            ],
            [
                7359,
                7671
            ],
            [
                7671,
                7929
            ],
            [
                7929,
                7970
            ],
            [
                7970,
                8073
            ],
            [
                8073,
                8304
            ],
            [
                8304,
                8752
            ],
            [
                8752,
                8864
            ],
            [
                8864,
                8952
            ],
            [
                8952,
                9048
            ],
            [
                9048,
                9251
            ],
            [
                9251,
                9324
            ],
            [
                9324,
                9468
            ],
            [
                9468,
                9526
            ],
            [
                9526,
                9618
            ],
            [
                9618,
                9712
            ],
            [
                9712,
                9801
            ],
            [
                9801,
                9895
            ],
            [
                9895,
                10026
            ],
            [
                10026,
                10103
            ],
            [
                10103,
                10281
            ],
            [
                10281,
                10356
            ],
            [
                10356,
                10815
            ],
            [
                10815,
                10985
            ],
            [
                10985,
                11136
            ],
            [
                11136,
                11225
            ],
            [
                11225,
                11376
            ],
            [
                11376,
                11700
            ],
            [
                11700,
                11895
            ],
            [
                11895,
                12082
            ],
            [
                12082,
                12365
            ],
            [
                12365,
                12768
            ],
            [
                12768,
                12935
            ]
        ],
        "segment_chars": [
            [
                0,
                46
            ],
            [
                46,
                116
            ],
            [
                116,
                196
            ],
            [
                196,
                482
            ],
            [
                482,
                635
            ],
            [
                635,
                698
            ],
            [
                698,
                851
            ],
            [
                851,
                915
            ],
            [
                915,
                989
            ],
            [
                989,
                1057
            ],
            [
                1057,
                1202
            ],
            [
                1202,
                1292
            ],
            [
                1292,
                1372
            ],
            [
                1372,
                1434
            ],
            [
                1434,
                1507
            ],
            [
                1507,
                1619
            ],
            [
                1619,
                1726
            ],
            [
                1726,
                1830
            ],
            [
                1830,
                1955
            ],
            [
                1955,
                2102
            ],
            [
                2102,
                2219
            ],
            [
                2219,
                2338
            ],
            [
                2338,
                2473
            ],
            [
                2473,
                2589
            ],
            [
                2589,
                2619
            ],
            [
                2619,
                2711
            ],
            [
                2711,
                2746
            ],
            [
                2746,
                2876
            ],
            [
                2876,
                2986
            ],
            [
                2986,
                3055
            ],
            [
                3055,
                3247
            ],
            [
                3247,
                3329
            ],
            [
                3329,
                3466
            ],
            [
                3466,
                3534
            ],
            [
                3534,
                3589
            ],
            [
                3589,
                3607
            ],
            [
                3607,
                3634
            ],
            [
                3634,
                3683
            ],
            [
                3683,
                3726
            ],
            [
                3726,
                3784
            ],
            [
                3784,
                3845
            ],
            [
                3845,
                3946
            ],
            [
                3946,
                4079
            ],
            [
                4079,
                4186
            ],
            [
                4186,
                4314
            ],
            [
                4314,
                4428
            ],
            [
                4428,
                4467
            ],
            [
                4467,
                4503
            ],
            [
                4503,
                4589
            ],
            [
                4589,
                4627
            ],
            [
                4627,
                4710
            ],
            [
                4710,
                4733
            ],
            [
                4733,
                4808
            ],
            [
                4808,
                4837
            ],
            [
                4837,
                4850
            ],
            [
                4850,
                4912
            ],
            [
                4912,
                5033
            ],
            [
                5033,
                5038
            ],
            [
                5038,
                5043
            ],
            [
                5043,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5138
            ],
            [
                5138,
                5190
            ],
            [
                5190,
                5233
            ],
            [
                5233,
                5242
            ],
            [
                5242,
                5319
            ],
            [
                5319,
                5380
            ],
            [
                5380,
                5556
            ],
            [
                5556,
                5585
            ],
            [
                5585,
                5602
            ],
            [
                5602,
                5617
            ],
            [
                5617,
                5659
            ],
            [
                5659,
                5720
            ],
            [
                5720,
                5745
            ],
            [
                5745,
                5783
            ],
            [
                5783,
                5885
            ],
            [
                5885,
                5936
            ],
            [
                5936,
                5953
            ],
            [
                5953,
                6017
            ],
            [
                6017,
                6092
            ],
            [
                6092,
                6192
            ],
            [
                6192,
                6330
            ],
            [
                6330,
                6578
            ],
            [
                6578,
                6668
            ],
            [
                6668,
                6815
            ],
            [
                6815,
                6912
            ],
            [
                6912,
                7008
            ],
            [
                7008,
                7075
            ],
            [
                7075,
                7103
            ],
            [
                7103,
                7161
            ],
            [
                7161,
                7189
            ],
            [
                7189,
                7199
            ],
            [
                7199,
                7253
            ],
            [
                7253,
                7338
            ],
            [
                7338,
                7359
            ],
            [
                7359,
                7372
            ],
            [
                7372,
                7442
            ],
            [
                7442,
                7497
            ],
            [
                7497,
                7566
            ],
            [
                7566,
                7604
            ],
            [
                7604,
                7671
            ],
            [
                7671,
                7767
            ],
            [
                7767,
                7814
            ],
            [
                7814,
                7874
            ],
            [
                7874,
                7929
            ],
            [
                7929,
                7970
            ],
            [
                7970,
                8005
            ],
            [
                8005,
                8014
            ],
            [
                8014,
                8039
            ],
            [
                8039,
                8073
            ],
            [
                8073,
                8079
            ],
            [
                8079,
                8142
            ],
            [
                8142,
                8191
            ],
            [
                8191,
                8218
            ],
            [
                8218,
                8233
            ],
            [
                8233,
                8304
            ],
            [
                8304,
                8363
            ],
            [
                8363,
                8403
            ],
            [
                8403,
                8497
            ],
            [
                8497,
                8631
            ],
            [
                8631,
                8662
            ],
            [
                8662,
                8667
            ],
            [
                8667,
                8752
            ],
            [
                8752,
                8765
            ],
            [
                8765,
                8792
            ],
            [
                8792,
                8864
            ],
            [
                8864,
                8908
            ],
            [
                8908,
                8952
            ],
            [
                8952,
                8961
            ],
            [
                8961,
                8971
            ],
            [
                8971,
                9048
            ],
            [
                9048,
                9111
            ],
            [
                9111,
                9161
            ],
            [
                9161,
                9251
            ],
            [
                9251,
                9301
            ],
            [
                9301,
                9324
            ],
            [
                9324,
                9335
            ],
            [
                9335,
                9351
            ],
            [
                9351,
                9376
            ],
            [
                9376,
                9468
            ],
            [
                9468,
                9526
            ],
            [
                9526,
                9547
            ],
            [
                9547,
                9618
            ],
            [
                9618,
                9673
            ],
            [
                9673,
                9712
            ],
            [
                9712,
                9801
            ],
            [
                9801,
                9868
            ],
            [
                9868,
                9895
            ],
            [
                9895,
                9907
            ],
            [
                9907,
                9942
            ],
            [
                9942,
                9991
            ],
            [
                9991,
                10026
            ],
            [
                10026,
                10054
            ],
            [
                10054,
                10103
            ],
            [
                10103,
                10108
            ],
            [
                10108,
                10149
            ],
            [
                10149,
                10189
            ],
            [
                10189,
                10216
            ],
            [
                10216,
                10281
            ],
            [
                10281,
                10311
            ],
            [
                10311,
                10356
            ],
            [
                10356,
                10374
            ],
            [
                10374,
                10513
            ],
            [
                10513,
                10752
            ],
            [
                10752,
                10815
            ],
            [
                10815,
                10863
            ],
            [
                10863,
                10923
            ],
            [
                10923,
                10985
            ],
            [
                10985,
                11004
            ],
            [
                11004,
                11014
            ],
            [
                11014,
                11034
            ],
            [
                11034,
                11081
            ],
            [
                11081,
                11136
            ],
            [
                11136,
                11225
            ],
            [
                11225,
                11231
            ],
            [
                11231,
                11237
            ],
            [
                11237,
                11255
            ],
            [
                11255,
                11327
            ],
            [
                11327,
                11376
            ],
            [
                11376,
                11461
            ],
            [
                11461,
                11515
            ],
            [
                11515,
                11700
            ],
            [
                11700,
                11766
            ],
            [
                11766,
                11830
            ],
            [
                11830,
                11895
            ],
            [
                11895,
                11982
            ],
            [
                11982,
                12049
            ],
            [
                12049,
                12082
            ],
            [
                12082,
                12119
            ],
            [
                12119,
                12171
            ],
            [
                12171,
                12201
            ],
            [
                12201,
                12307
            ],
            [
                12307,
                12365
            ],
            [
                12365,
                12404
            ],
            [
                12404,
                12486
            ],
            [
                12486,
                12646
            ],
            [
                12646,
                12768
            ],
            [
                12768,
                12817
            ],
            [
                12817,
                12874
            ],
            [
                12874,
                12926
            ],
            [
                12926,
                12935
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                46,
                78
            ],
            [
                88,
                97
            ],
            [
                98,
                100
            ],
            [
                101,
                116
            ],
            [
                116,
                196
            ],
            [
                196,
                212
            ],
            [
                221,
                224
            ],
            [
                224,
                225
            ],
            [
                226,
                244
            ],
            [
                249,
                269
            ],
            [
                270,
                283
            ],
            [
                283,
                296
            ],
            [
                301,
                322
            ],
            [
                323,
                326
            ],
            [
                336,
                356
            ],
            [
                357,
                361
            ],
            [
                362,
                364
            ],
            [
                371,
                394
            ],
            [
                394,
                395
            ],
            [
                402,
                405
            ],
            [
                411,
                413
            ],
            [
                414,
                480
            ],
            [
                482,
                522
            ],
            [
                529,
                546
            ],
            [
                563,
                580
            ],
            [
                581,
                633
            ],
            [
                633,
                635
            ],
            [
                635,
                681
            ],
            [
                688,
                690
            ],
            [
                691,
                698
            ],
            [
                698,
                730
            ],
            [
                731,
                768
            ],
            [
                769,
                851
            ],
            [
                858,
                897
            ],
            [
                900,
                915
            ],
            [
                921,
                938
            ],
            [
                939,
                989
            ],
            [
                989,
                1054
            ],
            [
                1062,
                1080
            ],
            [
                1080,
                1089
            ],
            [
                1092,
                1112
            ],
            [
                1114,
                1202
            ],
            [
                1202,
                1217
            ],
            [
                1218,
                1289
            ],
            [
                1293,
                1300
            ],
            [
                1301,
                1309
            ],
            [
                1315,
                1324
            ],
            [
                1331,
                1335
            ],
            [
                1335,
                1336
            ],
            [
                1338,
                1346
            ],
            [
                1347,
                1372
            ],
            [
                1372,
                1383
            ],
            [
                1384,
                1425
            ],
            [
                1434,
                1440
            ],
            [
                1441,
                1459
            ],
            [
                1459,
                1464
            ],
            [
                1465,
                1482
            ],
            [
                1483,
                1505
            ],
            [
                1505,
                1507
            ],
            [
                1507,
                1566
            ],
            [
                1567,
                1571
            ],
            [
                1580,
                1588
            ],
            [
                1589,
                1619
            ],
            [
                1619,
                1660
            ],
            [
                1661,
                1724
            ],
            [
                1724,
                1725
            ],
            [
                1726,
                1763
            ],
            [
                1764,
                1776
            ],
            [
                1777,
                1786
            ],
            [
                1787,
                1801
            ],
            [
                1802,
                1810
            ],
            [
                1811,
                1828
            ],
            [
                1830,
                1851
            ],
            [
                1852,
                1866
            ],
            [
                1881,
                1890
            ],
            [
                1891,
                1894
            ],
            [
                1902,
                1953
            ],
            [
                1953,
                1955
            ],
            [
                1955,
                1972
            ],
            [
                1985,
                2011
            ],
            [
                2011,
                2012
            ],
            [
                2013,
                2056
            ],
            [
                2062,
                2064
            ],
            [
                2065,
                2076
            ],
            [
                2076,
                2101
            ],
            [
                2102,
                2111
            ],
            [
                2112,
                2129
            ],
            [
                2131,
                2217
            ],
            [
                2217,
                2218
            ],
            [
                2219,
                2221
            ],
            [
                2228,
                2311
            ],
            [
                2311,
                2338
            ],
            [
                2338,
                2368
            ],
            [
                2368,
                2369
            ],
            [
                2370,
                2379
            ],
            [
                2386,
                2400
            ],
            [
                2401,
                2405
            ],
            [
                2406,
                2417
            ],
            [
                2418,
                2473
            ],
            [
                2473,
                2520
            ],
            [
                2531,
                2550
            ],
            [
                2551,
                2587
            ],
            [
                2587,
                2588
            ],
            [
                2589,
                2617
            ],
            [
                2619,
                2666
            ],
            [
                2671,
                2674
            ],
            [
                2675,
                2699
            ],
            [
                2704,
                2709
            ],
            [
                2709,
                2711
            ],
            [
                2711,
                2738
            ],
            [
                2744,
                2745
            ],
            [
                2746,
                2767
            ],
            [
                2767,
                2768
            ],
            [
                2771,
                2865
            ],
            [
                2866,
                2876
            ],
            [
                2876,
                2974
            ],
            [
                2984,
                2986
            ],
            [
                2986,
                3055
            ],
            [
                3060,
                3158
            ],
            [
                3159,
                3200
            ],
            [
                3201,
                3247
            ],
            [
                3251,
                3275
            ],
            [
                3306,
                3308
            ],
            [
                3309,
                3318
            ],
            [
                3327,
                3329
            ],
            [
                3329,
                3374
            ],
            [
                3376,
                3387
            ],
            [
                3395,
                3453
            ],
            [
                3460,
                3466
            ],
            [
                3466,
                3488
            ],
            [
                3497,
                3515
            ],
            [
                3519,
                3534
            ],
            [
                3534,
                3553
            ],
            [
                3554,
                3589
            ],
            [
                3589,
                3607
            ],
            [
                3607,
                3634
            ],
            [
                3641,
                3681
            ],
            [
                3683,
                3691
            ],
            [
                3692,
                3706
            ],
            [
                3706,
                3726
            ],
            [
                3726,
                3784
            ],
            [
                3784,
                3843
            ],
            [
                3843,
                3845
            ],
            [
                3873,
                3874
            ],
            [
                3875,
                3883
            ],
            [
                3884,
                3901
            ],
            [
                3902,
                3944
            ],
            [
                3944,
                3946
            ],
            [
                3946,
                3965
            ],
            [
                3977,
                4029
            ],
            [
                4035,
                4070
            ],
            [
                4071,
                4079
            ],
            [
                4079,
                4081
            ],
            [
                4089,
                4101
            ],
            [
                4102,
                4117
            ],
            [
                4120,
                4132
            ],
            [
                4133,
                4136
            ],
            [
                4144,
                4148
            ],
            [
                4149,
                4151
            ],
            [
                4157,
                4160
            ],
            [
                4161,
                4167
            ],
            [
                4168,
                4184
            ],
            [
                4184,
                4186
            ],
            [
                4186,
                4270
            ],
            [
                4271,
                4276
            ],
            [
                4277,
                4314
            ],
            [
                4314,
                4333
            ],
            [
                4334,
                4340
            ],
            [
                4342,
                4358
            ],
            [
                4359,
                4361
            ],
            [
                4362,
                4367
            ],
            [
                4375,
                4401
            ],
            [
                4402,
                4407
            ],
            [
                4408,
                4420
            ],
            [
                4421,
                4428
            ],
            [
                4434,
                4444
            ],
            [
                4445,
                4451
            ],
            [
                4454,
                4465
            ],
            [
                4465,
                4466
            ],
            [
                4468,
                4491
            ],
            [
                4492,
                4500
            ],
            [
                4503,
                4562
            ],
            [
                4565,
                4587
            ],
            [
                4589,
                4624
            ],
            [
                4627,
                4684
            ],
            [
                4686,
                4695
            ],
            [
                4697,
                4705
            ],
            [
                4708,
                4710
            ],
            [
                4711,
                4730
            ],
            [
                4733,
                4771
            ],
            [
                4772,
                4808
            ],
            [
                4809,
                4834
            ],
            [
                4837,
                4839
            ],
            [
                4848,
                4850
            ],
            [
                4861,
                4868
            ],
            [
                4870,
                4879
            ],
            [
                4888,
                4895
            ],
            [
                4896,
                4899
            ],
            [
                4900,
                4910
            ],
            [
                4910,
                4912
            ],
            [
                4912,
                4966
            ],
            [
                4973,
                4991
            ],
            [
                4991,
                5024
            ],
            [
                5028,
                5033
            ],
            [
                5033,
                5038
            ],
            [
                5038,
                5043
            ],
            [
                5043,
                5046
            ],
            [
                5052,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5123
            ],
            [
                5129,
                5135
            ],
            [
                5139,
                5187
            ],
            [
                5190,
                5198
            ],
            [
                5199,
                5233
            ],
            [
                5233,
                5234
            ],
            [
                5238,
                5242
            ],
            [
                5242,
                5243
            ],
            [
                5248,
                5265
            ],
            [
                5268,
                5279
            ],
            [
                5280,
                5284
            ],
            [
                5285,
                5293
            ],
            [
                5293,
                5317
            ],
            [
                5317,
                5319
            ],
            [
                5319,
                5342
            ],
            [
                5343,
                5370
            ],
            [
                5378,
                5380
            ],
            [
                5380,
                5410
            ],
            [
                5410,
                5411
            ],
            [
                5420,
                5423
            ],
            [
                5423,
                5424
            ],
            [
                5425,
                5446
            ],
            [
                5447,
                5473
            ],
            [
                5474,
                5477
            ],
            [
                5478,
                5556
            ],
            [
                5557,
                5582
            ],
            [
                5585,
                5587
            ],
            [
                5594,
                5602
            ],
            [
                5603,
                5614
            ],
            [
                5621,
                5645
            ],
            [
                5648,
                5659
            ],
            [
                5660,
                5663
            ],
            [
                5664,
                5717
            ],
            [
                5721,
                5742
            ],
            [
                5753,
                5783
            ],
            [
                5784,
                5789
            ],
            [
                5790,
                5798
            ],
            [
                5801,
                5808
            ],
            [
                5810,
                5824
            ],
            [
                5829,
                5834
            ],
            [
                5835,
                5836
            ],
            [
                5840,
                5850
            ],
            [
                5851,
                5853
            ],
            [
                5854,
                5857
            ],
            [
                5858,
                5866
            ],
            [
                5867,
                5869
            ],
            [
                5870,
                5874
            ],
            [
                5875,
                5882
            ],
            [
                5886,
                5933
            ],
            [
                5936,
                5946
            ],
            [
                5947,
                5951
            ],
            [
                5951,
                5952
            ],
            [
                5953,
                5954
            ],
            [
                5962,
                5974
            ],
            [
                5974,
                5979
            ],
            [
                5980,
                6006
            ],
            [
                6007,
                6016
            ],
            [
                6017,
                6053
            ],
            [
                6054,
                6057
            ],
            [
                6063,
                6090
            ],
            [
                6096,
                6105
            ],
            [
                6113,
                6118
            ],
            [
                6126,
                6159
            ],
            [
                6174,
                6192
            ],
            [
                6192,
                6193
            ],
            [
                6203,
                6215
            ],
            [
                6216,
                6217
            ],
            [
                6218,
                6222
            ],
            [
                6222,
                6223
            ],
            [
                6228,
                6231
            ],
            [
                6240,
                6248
            ],
            [
                6249,
                6299
            ],
            [
                6300,
                6328
            ],
            [
                6328,
                6330
            ],
            [
                6330,
                6375
            ],
            [
                6381,
                6391
            ],
            [
                6392,
                6536
            ],
            [
                6545,
                6576
            ],
            [
                6576,
                6578
            ],
            [
                6600,
                6607
            ],
            [
                6612,
                6630
            ],
            [
                6631,
                6668
            ],
            [
                6668,
                6709
            ],
            [
                6710,
                6732
            ],
            [
                6736,
                6739
            ],
            [
                6752,
                6778
            ],
            [
                6779,
                6789
            ],
            [
                6800,
                6803
            ],
            [
                6813,
                6815
            ],
            [
                6825,
                6841
            ],
            [
                6842,
                6888
            ],
            [
                6889,
                6892
            ],
            [
                6902,
                6905
            ],
            [
                6910,
                6912
            ],
            [
                6912,
                6913
            ],
            [
                6920,
                6923
            ],
            [
                6936,
                6958
            ],
            [
                6958,
                7007
            ],
            [
                7008,
                7019
            ],
            [
                7023,
                7075
            ],
            [
                7075,
                7100
            ],
            [
                7104,
                7116
            ],
            [
                7119,
                7131
            ],
            [
                7133,
                7158
            ],
            [
                7162,
                7186
            ],
            [
                7189,
                7197
            ],
            [
                7197,
                7199
            ],
            [
                7200,
                7241
            ],
            [
                7244,
                7251
            ],
            [
                7258,
                7260
            ],
            [
                7261,
                7288
            ],
            [
                7289,
                7290
            ],
            [
                7292,
                7308
            ],
            [
                7309,
                7313
            ],
            [
                7314,
                7318
            ],
            [
                7324,
                7327
            ],
            [
                7328,
                7332
            ],
            [
                7333,
                7335
            ],
            [
                7339,
                7356
            ],
            [
                7360,
                7369
            ],
            [
                7372,
                7391
            ],
            [
                7396,
                7397
            ],
            [
                7398,
                7404
            ],
            [
                7410,
                7411
            ],
            [
                7412,
                7442
            ],
            [
                7447,
                7497
            ],
            [
                7497,
                7566
            ],
            [
                7566,
                7602
            ],
            [
                7602,
                7604
            ],
            [
                7604,
                7668
            ],
            [
                7671,
                7706
            ],
            [
                7717,
                7741
            ],
            [
                7747,
                7767
            ],
            [
                7767,
                7790
            ],
            [
                7791,
                7814
            ],
            [
                7814,
                7841
            ],
            [
                7842,
                7850
            ],
            [
                7851,
                7861
            ],
            [
                7865,
                7872
            ],
            [
                7872,
                7874
            ],
            [
                7887,
                7892
            ],
            [
                7893,
                7895
            ],
            [
                7896,
                7914
            ],
            [
                7927,
                7929
            ],
            [
                7930,
                7958
            ],
            [
                7961,
                7969
            ],
            [
                7971,
                8002
            ],
            [
                8005,
                8014
            ],
            [
                8019,
                8037
            ],
            [
                8037,
                8039
            ],
            [
                8046,
                8048
            ],
            [
                8058,
                8061
            ],
            [
                8062,
                8064
            ],
            [
                8074,
                8076
            ],
            [
                8079,
                8098
            ],
            [
                8103,
                8105
            ],
            [
                8112,
                8140
            ],
            [
                8140,
                8142
            ],
            [
                8142,
                8154
            ],
            [
                8155,
                8158
            ],
            [
                8158,
                8191
            ],
            [
                8191,
                8218
            ],
            [
                8218,
                8233
            ],
            [
                8233,
                8242
            ],
            [
                8243,
                8246
            ],
            [
                8247,
                8251
            ],
            [
                8253,
                8301
            ],
            [
                8304,
                8319
            ],
            [
                8320,
                8354
            ],
            [
                8354,
                8361
            ],
            [
                8361,
                8363
            ],
            [
                8363,
                8365
            ],
            [
                8373,
                8374
            ],
            [
                8375,
                8376
            ],
            [
                8377,
                8403
            ],
            [
                8403,
                8461
            ],
            [
                8461,
                8462
            ],
            [
                8463,
                8464
            ],
            [
                8465,
                8486
            ],
            [
                8487,
                8497
            ],
            [
                8497,
                8498
            ],
            [
                8507,
                8511
            ],
            [
                8512,
                8519
            ],
            [
                8525,
                8603
            ],
            [
                8603,
                8604
            ],
            [
                8606,
                8610
            ],
            [
                8611,
                8628
            ],
            [
                8631,
                8640
            ],
            [
                8641,
                8643
            ],
            [
                8644,
                8660
            ],
            [
                8660,
                8662
            ],
            [
                8665,
                8667
            ],
            [
                8678,
                8679
            ],
            [
                8689,
                8690
            ],
            [
                8701,
                8703
            ],
            [
                8723,
                8724
            ],
            [
                8743,
                8749
            ],
            [
                8758,
                8762
            ],
            [
                8765,
                8790
            ],
            [
                8790,
                8792
            ],
            [
                8792,
                8793
            ],
            [
                8793,
                8797
            ],
            [
                8808,
                8809
            ],
            [
                8819,
                8830
            ],
            [
                8835,
                8841
            ],
            [
                8842,
                8861
            ],
            [
                8864,
                8865
            ],
            [
                8871,
                8880
            ],
            [
                8880,
                8881
            ],
            [
                8882,
                8885
            ],
            [
                8886,
                8906
            ],
            [
                8906,
                8908
            ],
            [
                8908,
                8914
            ],
            [
                8926,
                8952
            ],
            [
                8961,
                8963
            ],
            [
                8969,
                8971
            ],
            [
                8972,
                8985
            ],
            [
                8989,
                9008
            ],
            [
                9016,
                9045
            ],
            [
                9048,
                9050
            ],
            [
                9051,
                9054
            ],
            [
                9055,
                9103
            ],
            [
                9111,
                9125
            ],
            [
                9126,
                9129
            ],
            [
                9134,
                9136
            ],
            [
                9137,
                9141
            ],
            [
                9142,
                9145
            ],
            [
                9152,
                9156
            ],
            [
                9159,
                9161
            ],
            [
                9166,
                9167
            ],
            [
                9177,
                9186
            ],
            [
                9194,
                9202
            ],
            [
                9202,
                9203
            ],
            [
                9204,
                9206
            ],
            [
                9221,
                9233
            ],
            [
                9234,
                9249
            ],
            [
                9249,
                9251
            ],
            [
                9252,
                9290
            ],
            [
                9293,
                9301
            ],
            [
                9302,
                9313
            ],
            [
                9314,
                9321
            ],
            [
                9325,
                9332
            ],
            [
                9342,
                9345
            ],
            [
                9352,
                9365
            ],
            [
                9366,
                9374
            ],
            [
                9376,
                9382
            ],
            [
                9398,
                9414
            ],
            [
                9421,
                9424
            ],
            [
                9427,
                9435
            ],
            [
                9453,
                9465
            ],
            [
                9474,
                9493
            ],
            [
                9496,
                9507
            ],
            [
                9509,
                9518
            ],
            [
                9526,
                9527
            ],
            [
                9538,
                9540
            ],
            [
                9545,
                9547
            ],
            [
                9547,
                9590
            ],
            [
                9591,
                9616
            ],
            [
                9616,
                9618
            ],
            [
                9619,
                9627
            ],
            [
                9635,
                9642
            ],
            [
                9642,
                9666
            ],
            [
                9671,
                9673
            ],
            [
                9674,
                9678
            ],
            [
                9691,
                9693
            ],
            [
                9698,
                9709
            ],
            [
                9712,
                9715
            ],
            [
                9721,
                9726
            ],
            [
                9727,
                9747
            ],
            [
                9748,
                9765
            ],
            [
                9765,
                9766
            ],
            [
                9767,
                9772
            ],
            [
                9773,
                9790
            ],
            [
                9791,
                9793
            ],
            [
                9794,
                9799
            ],
            [
                9799,
                9801
            ],
            [
                9802,
                9810
            ],
            [
                9813,
                9824
            ],
            [
                9825,
                9833
            ],
            [
                9835,
                9868
            ],
            [
                9868,
                9884
            ],
            [
                9896,
                9900
            ],
            [
                9907,
                9942
            ],
            [
                9943,
                9946
            ],
            [
                9947,
                9957
            ],
            [
                9973,
                9977
            ],
            [
                9981,
                9988
            ],
            [
                9991,
                10024
            ],
            [
                10024,
                10026
            ],
            [
                10027,
                10052
            ],
            [
                10056,
                10077
            ],
            [
                10091,
                10100
            ],
            [
                10104,
                10108
            ],
            [
                10108,
                10112
            ],
            [
                10120,
                10132
            ],
            [
                10133,
                10146
            ],
            [
                10149,
                10189
            ],
            [
                10189,
                10190
            ],
            [
                10190,
                10201
            ],
            [
                10207,
                10214
            ],
            [
                10214,
                10216
            ],
            [
                10216,
                10230
            ],
            [
                10235,
                10242
            ],
            [
                10245,
                10246
            ],
            [
                10267,
                10274
            ],
            [
                10286,
                10287
            ],
            [
                10288,
                10311
            ],
            [
                10311,
                10328
            ],
            [
                10328,
                10329
            ],
            [
                10330,
                10353
            ],
            [
                10356,
                10372
            ],
            [
                10374,
                10382
            ],
            [
                10383,
                10405
            ],
            [
                10419,
                10443
            ],
            [
                10444,
                10484
            ],
            [
                10493,
                10513
            ],
            [
                10513,
                10531
            ],
            [
                10531,
                10532
            ],
            [
                10537,
                10544
            ],
            [
                10552,
                10613
            ],
            [
                10614,
                10617
            ],
            [
                10618,
                10632
            ],
            [
                10633,
                10646
            ],
            [
                10647,
                10663
            ],
            [
                10663,
                10664
            ],
            [
                10671,
                10674
            ],
            [
                10680,
                10688
            ],
            [
                10697,
                10714
            ],
            [
                10723,
                10727
            ],
            [
                10736,
                10752
            ],
            [
                10752,
                10781
            ],
            [
                10790,
                10814
            ],
            [
                10821,
                10831
            ],
            [
                10838,
                10840
            ],
            [
                10843,
                10852
            ],
            [
                10853,
                10855
            ],
            [
                10856,
                10861
            ],
            [
                10863,
                10895
            ],
            [
                10896,
                10923
            ],
            [
                10923,
                10968
            ],
            [
                10974,
                10977
            ],
            [
                10983,
                10985
            ],
            [
                10992,
                10995
            ],
            [
                11012,
                11014
            ],
            [
                11019,
                11034
            ],
            [
                11034,
                11071
            ],
            [
                11079,
                11081
            ],
            [
                11081,
                11100
            ],
            [
                11106,
                11108
            ],
            [
                11113,
                11127
            ],
            [
                11136,
                11162
            ],
            [
                11172,
                11195
            ],
            [
                11203,
                11213
            ],
            [
                11214,
                11225
            ],
            [
                11226,
                11231
            ],
            [
                11231,
                11234
            ],
            [
                11237,
                11255
            ],
            [
                11257,
                11258
            ],
            [
                11281,
                11285
            ],
            [
                11293,
                11298
            ],
            [
                11301,
                11310
            ],
            [
                11314,
                11325
            ],
            [
                11327,
                11347
            ],
            [
                11353,
                11373
            ],
            [
                11376,
                11383
            ],
            [
                11384,
                11403
            ],
            [
                11403,
                11461
            ],
            [
                11461,
                11478
            ],
            [
                11479,
                11513
            ],
            [
                11513,
                11515
            ],
            [
                11515,
                11518
            ],
            [
                11523,
                11578
            ],
            [
                11579,
                11582
            ],
            [
                11588,
                11600
            ],
            [
                11600,
                11601
            ],
            [
                11602,
                11609
            ],
            [
                11620,
                11650
            ],
            [
                11657,
                11677
            ],
            [
                11678,
                11685
            ],
            [
                11686,
                11699
            ],
            [
                11705,
                11723
            ],
            [
                11728,
                11733
            ],
            [
                11734,
                11766
            ],
            [
                11766,
                11773
            ],
            [
                11784,
                11793
            ],
            [
                11793,
                11794
            ],
            [
                11795,
                11812
            ],
            [
                11813,
                11830
            ],
            [
                11830,
                11834
            ],
            [
                11838,
                11847
            ],
            [
                11853,
                11894
            ],
            [
                11935,
                11962
            ],
            [
                11963,
                11982
            ],
            [
                11988,
                11995
            ],
            [
                11996,
                11999
            ],
            [
                12005,
                12007
            ],
            [
                12010,
                12021
            ],
            [
                12032,
                12037
            ],
            [
                12043,
                12047
            ],
            [
                12047,
                12049
            ],
            [
                12049,
                12050
            ],
            [
                12050,
                12056
            ],
            [
                12062,
                12075
            ],
            [
                12082,
                12117
            ],
            [
                12119,
                12146
            ],
            [
                12147,
                12158
            ],
            [
                12158,
                12171
            ],
            [
                12171,
                12185
            ],
            [
                12186,
                12190
            ],
            [
                12191,
                12201
            ],
            [
                12201,
                12307
            ],
            [
                12307,
                12317
            ],
            [
                12318,
                12364
            ],
            [
                12365,
                12378
            ],
            [
                12379,
                12382
            ],
            [
                12383,
                12404
            ],
            [
                12404,
                12449
            ],
            [
                12450,
                12484
            ],
            [
                12484,
                12486
            ],
            [
                12486,
                12555
            ],
            [
                12556,
                12646
            ],
            [
                12646,
                12717
            ],
            [
                12717,
                12718
            ],
            [
                12719,
                12742
            ],
            [
                12750,
                12752
            ],
            [
                12753,
                12760
            ],
            [
                12766,
                12768
            ],
            [
                12768,
                12769
            ],
            [
                12770,
                12817
            ],
            [
                12824,
                12829
            ],
            [
                12830,
                12851
            ],
            [
                12859,
                12874
            ],
            [
                12874,
                12925
            ],
            [
                12926,
                12935
            ]
        ],
        "row_chars": [
            [
                0,
                116
            ],
            [
                116,
                196
            ],
            [
                196,
                635
            ],
            [
                635,
                698
            ],
            [
                698,
                851
            ],
            [
                851,
                915
            ],
            [
                915,
                989
            ],
            [
                989,
                1057
            ],
            [
                1057,
                1202
            ],
            [
                1202,
                1292
            ],
            [
                1292,
                1372
            ],
            [
                1372,
                1434
            ],
            [
                1434,
                1507
            ],
            [
                1507,
                1619
            ],
            [
                1619,
                1830
            ],
            [
                1830,
                1955
            ],
            [
                1955,
                2102
            ],
            [
                2102,
                2338
            ],
            [
                2338,
                2473
            ],
            [
                2473,
                2589
            ],
            [
                2589,
                2711
            ],
            [
                2711,
                2746
            ],
            [
                2746,
                2746
            ],
            [
                2746,
                2746
            ],
            [
                2746,
                2876
            ],
            [
                2876,
                2986
            ],
            [
                2986,
                3055
            ],
            [
                3055,
                3247
            ],
            [
                3247,
                3329
            ],
            [
                3329,
                3329
            ],
            [
                3329,
                3466
            ],
            [
                3466,
                3534
            ],
            [
                3534,
                3589
            ],
            [
                3589,
                3607
            ],
            [
                3607,
                3634
            ],
            [
                3634,
                3726
            ],
            [
                3726,
                3784
            ],
            [
                3784,
                3845
            ],
            [
                3845,
                3845
            ],
            [
                3845,
                3946
            ],
            [
                3946,
                4079
            ],
            [
                4079,
                4079
            ],
            [
                4079,
                4186
            ],
            [
                4186,
                4314
            ],
            [
                4314,
                4428
            ],
            [
                4428,
                4503
            ],
            [
                4503,
                4503
            ],
            [
                4503,
                4589
            ],
            [
                4589,
                4589
            ],
            [
                4589,
                4627
            ],
            [
                4627,
                4627
            ],
            [
                4627,
                4710
            ],
            [
                4710,
                4733
            ],
            [
                4733,
                4808
            ],
            [
                4808,
                4837
            ],
            [
                4837,
                4850
            ],
            [
                4850,
                4912
            ],
            [
                4912,
                5033
            ],
            [
                5033,
                5038
            ],
            [
                5038,
                5043
            ],
            [
                5043,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5138
            ],
            [
                5138,
                5190
            ],
            [
                5190,
                5233
            ],
            [
                5233,
                5242
            ],
            [
                5242,
                5319
            ],
            [
                5319,
                5380
            ],
            [
                5380,
                5556
            ],
            [
                5556,
                5585
            ],
            [
                5585,
                5602
            ],
            [
                5602,
                5617
            ],
            [
                5617,
                5659
            ],
            [
                5659,
                5659
            ],
            [
                5659,
                5720
            ],
            [
                5720,
                5745
            ],
            [
                5745,
                5783
            ],
            [
                5783,
                5885
            ],
            [
                5885,
                5936
            ],
            [
                5936,
                5953
            ],
            [
                5953,
                6017
            ],
            [
                6017,
                6192
            ],
            [
                6192,
                6330
            ],
            [
                6330,
                6578
            ],
            [
                6578,
                6578
            ],
            [
                6578,
                6668
            ],
            [
                6668,
                6815
            ],
            [
                6815,
                6912
            ],
            [
                6912,
                6912
            ],
            [
                6912,
                7008
            ],
            [
                7008,
                7075
            ],
            [
                7075,
                7103
            ],
            [
                7103,
                7103
            ],
            [
                7103,
                7161
            ],
            [
                7161,
                7189
            ],
            [
                7189,
                7199
            ],
            [
                7199,
                7253
            ],
            [
                7253,
                7338
            ],
            [
                7338,
                7338
            ],
            [
                7338,
                7338
            ],
            [
                7338,
                7359
            ],
            [
                7359,
                7359
            ],
            [
                7359,
                7372
            ],
            [
                7372,
                7442
            ],
            [
                7442,
                7497
            ],
            [
                7497,
                7566
            ],
            [
                7566,
                7604
            ],
            [
                7604,
                7671
            ],
            [
                7671,
                7767
            ],
            [
                7767,
                7814
            ],
            [
                7814,
                7874
            ],
            [
                7874,
                7929
            ],
            [
                7929,
                7970
            ],
            [
                7970,
                7970
            ],
            [
                7970,
                7970
            ],
            [
                7970,
                8005
            ],
            [
                8005,
                8014
            ],
            [
                8014,
                8039
            ],
            [
                8039,
                8073
            ],
            [
                8073,
                8079
            ],
            [
                8079,
                8142
            ],
            [
                8142,
                8191
            ],
            [
                8191,
                8218
            ],
            [
                8218,
                8233
            ],
            [
                8233,
                8304
            ],
            [
                8304,
                8304
            ],
            [
                8304,
                8363
            ],
            [
                8363,
                8403
            ],
            [
                8403,
                8497
            ],
            [
                8497,
                8631
            ],
            [
                8631,
                8662
            ],
            [
                8662,
                8667
            ],
            [
                8667,
                8752
            ],
            [
                8752,
                8765
            ],
            [
                8765,
                8792
            ],
            [
                8792,
                8864
            ],
            [
                8864,
                8864
            ],
            [
                8864,
                8908
            ],
            [
                8908,
                8908
            ],
            [
                8908,
                8952
            ],
            [
                8952,
                8961
            ],
            [
                8961,
                8971
            ],
            [
                8971,
                9048
            ],
            [
                9048,
                9048
            ],
            [
                9048,
                9048
            ],
            [
                9048,
                9048
            ],
            [
                9048,
                9048
            ],
            [
                9048,
                9048
            ],
            [
                9048,
                9161
            ],
            [
                9161,
                9251
            ],
            [
                9251,
                9301
            ],
            [
                9301,
                9324
            ],
            [
                9324,
                9335
            ],
            [
                9335,
                9351
            ],
            [
                9351,
                9376
            ],
            [
                9376,
                9468
            ],
            [
                9468,
                9526
            ],
            [
                9526,
                9547
            ],
            [
                9547,
                9618
            ],
            [
                9618,
                9673
            ],
            [
                9673,
                9712
            ],
            [
                9712,
                9712
            ],
            [
                9712,
                9801
            ],
            [
                9801,
                9868
            ],
            [
                9868,
                9895
            ],
            [
                9895,
                9907
            ],
            [
                9907,
                9942
            ],
            [
                9942,
                9991
            ],
            [
                9991,
                10026
            ],
            [
                10026,
                10054
            ],
            [
                10054,
                10054
            ],
            [
                10054,
                10103
            ],
            [
                10103,
                10108
            ],
            [
                10108,
                10149
            ],
            [
                10149,
                10189
            ],
            [
                10189,
                10216
            ],
            [
                10216,
                10281
            ],
            [
                10281,
                10281
            ],
            [
                10281,
                10311
            ],
            [
                10311,
                10356
            ],
            [
                10356,
                10513
            ],
            [
                10513,
                10752
            ],
            [
                10752,
                10815
            ],
            [
                10815,
                10863
            ],
            [
                10863,
                10923
            ],
            [
                10923,
                10985
            ],
            [
                10985,
                11004
            ],
            [
                11004,
                11014
            ],
            [
                11014,
                11034
            ],
            [
                11034,
                11034
            ],
            [
                11034,
                11034
            ],
            [
                11034,
                11034
            ],
            [
                11034,
                11081
            ],
            [
                11081,
                11136
            ],
            [
                11136,
                11225
            ],
            [
                11225,
                11231
            ],
            [
                11231,
                11237
            ],
            [
                11237,
                11255
            ],
            [
                11255,
                11255
            ],
            [
                11255,
                11255
            ],
            [
                11255,
                11327
            ],
            [
                11327,
                11327
            ],
            [
                11327,
                11327
            ],
            [
                11327,
                11327
            ],
            [
                11327,
                11376
            ],
            [
                11376,
                11376
            ],
            [
                11376,
                11376
            ],
            [
                11376,
                11461
            ],
            [
                11461,
                11461
            ],
            [
                11461,
                11515
            ],
            [
                11515,
                11700
            ],
            [
                11700,
                11766
            ],
            [
                11766,
                11830
            ],
            [
                11830,
                11895
            ],
            [
                11895,
                11982
            ],
            [
                11982,
                12049
            ],
            [
                12049,
                12082
            ],
            [
                12082,
                12171
            ],
            [
                12171,
                12201
            ],
            [
                12201,
                12307
            ],
            [
                12307,
                12365
            ],
            [
                12365,
                12404
            ],
            [
                12404,
                12486
            ],
            [
                12486,
                12646
            ],
            [
                12646,
                12768
            ],
            [
                12768,
                12817
            ],
            [
                12817,
                12874
            ],
            [
                12874,
                12935
            ]
        ]
    }
}