{
    "original": {
        "text": "As soon as I had perused this epistle I went to the master, and informed him that his sister had arrived at the Heights, and sent me a letter expressing her sorrow for Mrs. Linton's situation, and her ardent desire to see him; with a wish that he would transmit to her, as early as possible, some token of forgiveness by me.\n\"Forgiveness!\" said Linton. \"I have nothing to forgive her, Ellen. You may call at Wuthering Heights this afternoon, if you like, and say that I am not angry, but I'm sorry to have lost her; especially as I can never think she'll be happy. It is out of the question my going to see her, however: we are eternally divided; and should she really wish to oblige me, let her persuade the villain she has married to leave the country.\"\n\"And you won't write her a little note, sir?\" I asked, imploringly.\n\"No,\" he answered. \"It is needless. My communication with Heathcliff's family shall be as sparing as his with mine. It shall not exist!\"\nMr. Edgar's coldness depressed me exceedingly; and all the way from the Grange I puzzled my brains how to put more heart into what he said, when I repeated it; and how to soften his refusal of even a few lines to console Isabella. I daresay she had been on the watch for me since morning: I saw her looking through the lattice as I came up the garden causeway, and I nodded to her; but she drew back, as if afraid of being observed. I entered without knocking. There never was such a dreary, dismal scene as the formerly cheerful house presented! I must confess, that if I had been in the young lady's place, I would, at least, have swept the hearth, and wiped the tables with a duster. But she already partook of the pervading spirit of neglect which encompassed her. Her pretty face was wan and listless; her hair uncurled: some locks hanging lankly down, and some carelessly twisted round her head. Probably she had not touched her dress since yester evening. Hindley was not there. Mr. Heathcliff sat at a table, turning over some papers in his pocket-book; but he rose when I appeared, asked me how I did, quite friendly, and offered me a chair. He was the only thing there that seemed decent; and I thought he never looked better. So much had circumstances altered their positions, that he would certainly have struck a stranger as a born and bred gentleman; and his wife as a thorough little slattern! She came forward eagerly to greet me, and held out one hand to take the expected letter. I shook my head. She wouldn't understand the hint, but followed me to a sideboard, where I went to lay my bonnet, and importuned me in a whisper to give her directly what I had brought. Heathcliff guessed the meaning of her manoeuvres, and said-\"If you have got anything for Isabella (as no doubt you have, Nelly), give it to her. You needn't make a secret of it: we have no secrets between us.\"\n\"Oh, I have nothing,\" I replied, thinking it best to speak the truth at once. \"My master bid me tell his sister that she must not expect either a letter or a visit from him at present. He sends his love, ma'am, and his wishes for your happiness, and his pardon for the grief you have occasioned; but he thinks that after this time his household and the household here should drop intercommunication, as nothing could come of keeping it up.\"\nMrs. Heathcliff's lip quivered slightly, and she returned to her seat in the window. Her husband took his stand on the hearthstone, near me, and began to put questions concerning Catherine. I told him as much as I thought proper of her illness, and he extorted from me, by cross-examination, most of the facts connected with its origin. I blamed her, as she deserved, for bringing it all on herself; and ended by hoping that he would follow Mr. Linton's example and avoid future interference with his family, for good or evil.\n\"Mrs. Linton is now just recovering,\" I said; \"she'll never be like she was, but her life is spared; and if you really have a regard for her, you'll shun crossing her way again: nay, you'll move out of this country entirely; and that you may not regret it, I'll inform you Catherine Linton is as different now from your old friend Catherine Earnshaw, as that young lady is different from me. Her appearance is changed greatly, her character much more so; and the person who is compelled, of necessity, to be her companion, will only sustain his affection hereafter by the remembrance of what she once was, by common humanity, and a sense of duty!\"\n\"That is quite possible,\" remarked Heathcliff, forcing himself to seem calm: \"quite possible that your master should have nothing but common humanity and a sense of duty to fall back upon. But do you imagine that I shall leave Catherine to his _duty_ and _humanity_? and can you compare my feelings respecting Catherine to his? Before you leave this house, I must exact a promise from you that you'll get me an interview with her: consent, or refuse, I _will_ see her! What do you say?\"\n\"I say, Mr. Heathcliff,\" I replied, \"you must not: you never shall, through my means. Another encounter between you and the master would kill her altogether.\"\n\"With your aid that may be avoided,\" he continued; \"and should there be danger of such an event-should he be the cause of adding a single trouble more to her existence-why, I think I shall be justified in going to extremes! I wish you had sincerity enough to tell me whether Catherine would suffer greatly from his loss: the fear that she would restrains me. And there you see the distinction between our feelings: had he been in my place, and I in his, though I hated him with a hatred that turned my life to gall, I never would have raised a hand against him. You may look incredulous, if you please! I never would have banished him from her society as long as she desired his. The moment her regard ceased, I would have torn his heart out, and drunk his blood! But, till then-if you don't believe me, you don't know me-till then, I would have died by inches before I touched a single hair of his head!\"\n\"And yet,\" I interrupted, \"you have no scruples in completely ruining all hopes of her perfect restoration, by thrusting yourself into her remembrance now, when she has nearly forgotten you, and involving her in a new tumult of discord and distress.\"\n\"You suppose she has nearly forgotten me?\" he said. \"Oh, Nelly! you know she has not! You know as well as I do, that for every thought she spends on Linton she spends a thousand on me! At a most miserable period of my life, I had a notion of the kind: it haunted me on my return to the neighbourhood last summer; but only her own assurance could make me admit the horrible idea again. And then, Linton would be nothing, nor Hindley, nor all the dreams that ever I dreamt. Two words would comprehend my future-_death_ and _hell_: existence, after losing her, would be hell. Yet I was a fool to fancy for a moment that she valued Edgar Linton's attachment more than mine. If he loved with all the powers of his puny being, he couldn't love as much in eighty years as I could in a day. And Catherine has a heart as deep as I have: the sea could be as readily contained in that horse-trough as her whole affection be monopolised by him. Tush! He is scarcely a degree dearer to her than her dog, or her horse. It is not in him to be loved like me: how can she love in him what he has not?\"\n\"Catherine and Edgar are as fond of each other as any two people can be,\" cried Isabella, with sudden vivacity. \"No one has a right to talk in that manner, and I won't hear my brother depreciated in silence!\"\n\"Your brother is wondrous fond of you too, isn't he?\" observed Heathcliff, scornfully. \"He turns you adrift on the world with surprising alacrity.\"\n\"He is not aware of what I suffer,\" she replied. \"I didn't tell him that.\"\n\"You have been telling him something, then: you have written, have you?\"\n\"To say that I was married, I did write-you saw the note.\"\n\"And nothing since?\"\n\"No.\"\n\"My young lady is looking sadly the worse for her change of condition,\" I remarked. \"Somebody's love comes short in her case, obviously; whose, I may guess; but, perhaps, I shouldn't say.\"\n\"I should guess it was her own,\" said Heathcliff. \"She degenerates into a mere slut! She is tired of trying to please me uncommonly early. You'd hardly credit it, but the very morrow of our wedding she was weeping to go home. However, she'll suit this house so much the better for not being over nice, and I'll take care she does not disgrace me by rambling abroad.\"\n\"Well, sir,\" returned I, \"I hope you'll consider that Mrs. Heathcliff is accustomed to be looked after and waited on; and that she has been brought up like an only daughter, whom every one was ready to serve. You must let her have a maid to keep things tidy about her, and you must treat her kindly. Whatever be your notion of Mr. Edgar, you cannot doubt that she has a capacity for strong attachments, or she wouldn't have abandoned the elegancies, and comforts, and friends of her former home, to fix contentedly, in such a wilderness as this, with you.\"\n\"She abandoned them under a delusion,\" he answered; \"picturing in me a hero of romance, and expecting unlimited indulgences from my chivalrous devotion. I can hardly regard her in the light of a rational creature, so obstinately has she persisted in forming a fabulous notion of my character and acting on the false impressions she cherished. But, at last, I think she begins to know me: I don't perceive the silly smiles and grimaces that provoked me at first; and the senseless incapability of discerning that I was in earnest when I gave her my opinion of her infatuation and herself. It was a marvellous effort of perspicacity to discover that I did not love her. I believed, at one time, no lessons could teach her that! And yet it is poorly learnt; for this morning she announced, as a piece of appalling intelligence, that I had actually succeeded in making her hate me! A positive labour of Hercules, I assure you! If it be achieved, I have cause to return thanks. Can I trust your assertion, Isabella? Are you sure you hate me? If I let you alone for half a day, won't you come sighing and wheedling to me again? I daresay she would rather I had seemed all tenderness before you: it wounds her vanity to have the truth exposed. But I don't care who knows that the passion was wholly on one side: and I never told her a lie about it. She cannot accuse me of showing one bit of deceitful softness. The first thing she saw me do, on coming out of the Grange, was to hang up her little dog; and when she pleaded for it, the first words I uttered were a wish that I had the hanging of every being belonging to her, except one: possibly she took that exception for herself. But no brutality disgusted her: I suppose she has an innate admiration of it, if only her precious person were secure from injury! Now, was it not the depth of absurdity-of genuine idiocy, for that pitiful, slavish, mean-minded brach to dream that I could love her? Tell your master, Nelly, that I never, in all my life, met with such an abject thing as she is. She even disgraces the name of Linton; and I've sometimes relented, from pure lack of invention, in my experiments on what she could endure, and still creep shamefully cringing back! But tell him, also, to set his fraternal and magisterial heart at ease: that I keep strictly within the limits of the law. I have avoided, up to this period, giving her the slightest right to claim a separation; and, what's more, she'd thank nobody for dividing us. If she desired to go, she might: the nuisance of her presence outweighs the gratification to be derived from tormenting her!\"\n\"Mr. Heathcliff,\" said I, \"this is the talk of a madman; your wife, most likely, is convinced you are mad; and, for that reason, she has borne with you hitherto: but now that you say she may go, she'll doubtless avail herself of the permission. You are not so bewitched, ma'am, are you, as to remain with him of your own accord?\"\n\"Take care, Ellen!\" answered Isabella, her eyes sparkling irefully; there was no misdoubting by their expression the full success of her partner's endeavours to make himself detested. \"Don't put faith in a single word he speaks. He's a lying fiend! a monster, and not a human being! I've been told I might leave him before; and I've made the attempt, but I dare not repeat it! Only, Ellen, promise you'll not mention a syllable of his infamous conversation to my brother or Catherine. Whatever he may pretend, he wishes to provoke Edgar to desperation: he says he has married me on purpose to obtain power over him; and he sha'n't obtain it-I'll die first! I just hope, I pray, that he may forget his diabolical prudence and kill me! The single pleasure I can imagine is to die, or to see him dead!\"\n\"There-that will do for the present!\" said Heathcliff. \"If you are called upon in a court of law, you'll remember her language, Nelly! And take a good look at that countenance: she's near the point which would suit me. No; you're not fit to be your own guardian, Isabella, now; and I, being your legal protector, must retain you in my custody, however distasteful the obligation may be. Go upstairs; I have something to say to Ellen Dean in private. That's not the way: upstairs, I tell you! Why, this is the road upstairs, child!\"\nHe seized, and thrust her from the room; and returned muttering-\"I have no pity! I have no pity! The more the worms writhe, the more I yearn to crush out their entrails! It is a moral teething; and I grind with greater energy in proportion to the increase of pain.\"\n\"Do you understand what the word pity means?\" I said, hastening to resume my bonnet. \"Did you ever feel a touch of it in your life?\"\n\"Put that down!\" he interrupted, perceiving my intention to depart. \"You are not going yet. Come here now, Nelly: I must either persuade or compel you to aid me in fulfilling my determination to see Catherine, and that without delay. I swear that I meditate no harm: I don't desire to cause any disturbance, or to exasperate or insult Mr. Linton; I only wish to hear from herself how she is, and why she has been ill; and to ask if anything that I could do would be of use to her. Last night I was in the Grange garden six hours, and I'll return there to-night; and every night I'll haunt the place, and every day, till I find an opportunity of entering. If Edgar Linton meets me, I shall not hesitate to knock him down, and give him enough to insure his quiescence while I stay. If his servants oppose me, I shall threaten them off with these pistols. But wouldn't it be better to prevent my coming in contact with them, or their master? And you could do it so easily. I'd warn you when I came, and then you might let me in unobserved, as soon as she was alone, and watch till I departed, your conscience quite calm: you would be hindering mischief.\"\nI protested against playing that treacherous part in my employer's house: and, besides, I urged the cruelty and selfishness of his destroying Mrs. Linton's tranquillity for his satisfaction. \"The commonest occurrence startles her painfully,\" I said. \"She's all nerves, and she couldn't bear the surprise, I'm positive. Don't persist, sir! or else I shall be obliged to inform my master of your designs; and he'll take measures to secure his house and its inmates from any such unwarrantable intrusions!\"\n\"In that case I'll take measures to secure you, woman!\" exclaimed Heathcliff; \"you shall not leave Wuthering Heights till to-morrow morning. It is a foolish story to assert that Catherine could not bear to see me; and as to surprising her, I don't desire it: you must prepare her-ask her if I may come. You say she never mentions my name, and that I am never mentioned to her. To whom should she mention me if I am a forbidden topic in the house? She thinks you are all spies for her husband. Oh, I've no doubt she's in hell among you! I guess by her silence, as much as anything, what she feels. You say she is often restless, and anxious-looking: is that a proof of tranquillity? You talk of her mind being unsettled. How the devil could it be otherwise in her frightful isolation? And that insipid, paltry creature attending her from _duty_ and _humanity_! From _pity_ and _charity_! He might as well plant an oak in a flower-pot, and expect it to thrive, as imagine he can restore her to vigour in the soil of his shallow cares? Let us settle it at once: will you stay here, and am I to fight my way to Catherine over Linton and his footman? Or will you be my friend, as you have been hitherto, and do what I request? Decide! because there is no reason for my lingering another minute, if you persist in your stubborn ill-nature!\"\nWell, Mr. Lockwood, I argued and complained, and flatly refused him fifty times; but in the long run he forced me to an agreement. I engaged to carry a letter from him to my mistress; and should she consent, I promised to let him have intelligence of Linton's next absence from home, when he might come, and get in as he was able: I wouldn't be there, and my fellow-servants should be equally out of the way. Was it right or wrong? I fear it was wrong, though expedient. I thought I prevented another explosion by my compliance; and I thought, too, it might create a favourable crisis in Catherine's mental illness: and then I remembered Mr. Edgar's stern rebuke of my carrying tales; and I tried to smooth away all disquietude on the subject, by affirming, with frequent iteration, that that betrayal of trust, if it merited so harsh an appellation, should be the last. Notwithstanding, my journey homeward was sadder than my journey thither; and many misgivings I had, ere I could prevail on myself to put the missive into Mrs. Linton's hand.\nBut here is Kenneth; I'll go down, and tell him how much better you are. My history is _dree_, as we say, and will serve to while away another morning.\nDree, and dreary! I reflected as the good woman descended to receive the doctor: and not exactly of the kind which I should have chosen to amuse me. But never mind! I'll extract wholesome medicines from Mrs. Dean's bitter herbs; and firstly, let me beware of the fascination that lurks in Catherine Heathcliff's brilliant eyes. I should be in a curious taking if I surrendered my heart to that young person, and the daughter turned out a second edition of the mother.",
        "paragraph_chars": [
            [
                0,
                325
            ],
            [
                325,
                756
            ],
            [
                756,
                824
            ],
            [
                824,
                961
            ],
            [
                961,
                2855
            ],
            [
                2855,
                3296
            ],
            [
                3296,
                3823
            ],
            [
                3823,
                4471
            ],
            [
                4471,
                4958
            ],
            [
                4958,
                5117
            ],
            [
                5117,
                6023
            ],
            [
                6023,
                6274
            ],
            [
                6274,
                7359
            ],
            [
                7359,
                7568
            ],
            [
                7568,
                7716
            ],
            [
                7716,
                7791
            ],
            [
                7791,
                7864
            ],
            [
                7864,
                7923
            ],
            [
                7923,
                7944
            ],
            [
                7944,
                7950
            ],
            [
                7950,
                8139
            ],
            [
                8139,
                8506
            ],
            [
                8506,
                9063
            ],
            [
                9063,
                11677
            ],
            [
                11677,
                12007
            ],
            [
                12007,
                12807
            ],
            [
                12807,
                13339
            ],
            [
                13339,
                13605
            ],
            [
                13605,
                13738
            ],
            [
                13738,
                14890
            ],
            [
                14890,
                15394
            ],
            [
                15394,
                16729
            ],
            [
                16729,
                17774
            ],
            [
                17774,
                17926
            ],
            [
                17926,
                18393
            ]
        ],
        "segment_chars": [
            [
                0,
                325
            ],
            [
                325,
                340
            ],
            [
                340,
                353
            ],
            [
                353,
                392
            ],
            [
                392,
                565
            ],
            [
                565,
                756
            ],
            [
                756,
                802
            ],
            [
                802,
                824
            ],
            [
                824,
                843
            ],
            [
                843,
                860
            ],
            [
                860,
                940
            ],
            [
                940,
                961
            ],
            [
                961,
                1192
            ],
            [
                1192,
                1394
            ],
            [
                1394,
                1422
            ],
            [
                1422,
                1508
            ],
            [
                1508,
                1648
            ],
            [
                1648,
                1730
            ],
            [
                1730,
                1863
            ],
            [
                1863,
                1924
            ],
            [
                1924,
                1947
            ],
            [
                1947,
                2112
            ],
            [
                2112,
                2198
            ],
            [
                2198,
                2370
            ],
            [
                2370,
                2459
            ],
            [
                2459,
                2476
            ],
            [
                2476,
                2645
            ],
            [
                2645,
                2790
            ],
            [
                2790,
                2855
            ],
            [
                2855,
                2933
            ],
            [
                2933,
                3040
            ],
            [
                3040,
                3296
            ],
            [
                3296,
                3381
            ],
            [
                3381,
                3486
            ],
            [
                3486,
                3633
            ],
            [
                3633,
                3823
            ],
            [
                3823,
                4215
            ],
            [
                4215,
                4471
            ],
            [
                4471,
                4660
            ],
            [
                4660,
                4738
            ],
            [
                4738,
                4799
            ],
            [
                4799,
                4940
            ],
            [
                4940,
                4958
            ],
            [
                4958,
                5044
            ],
            [
                5044,
                5117
            ],
            [
                5117,
                5341
            ],
            [
                5341,
                5476
            ],
            [
                5476,
                5679
            ],
            [
                5679,
                5720
            ],
            [
                5720,
                5797
            ],
            [
                5797,
                5881
            ],
            [
                5881,
                6023
            ],
            [
                6023,
                6274
            ],
            [
                6274,
                6317
            ],
            [
                6317,
                6326
            ],
            [
                6326,
                6338
            ],
            [
                6338,
                6360
            ],
            [
                6360,
                6459
            ],
            [
                6459,
                6659
            ],
            [
                6659,
                6746
            ],
            [
                6746,
                6847
            ],
            [
                6847,
                6944
            ],
            [
                6944,
                7057
            ],
            [
                7057,
                7207
            ],
            [
                7207,
                7213
            ],
            [
                7213,
                7279
            ],
            [
                7279,
                7359
            ],
            [
                7359,
                7471
            ],
            [
                7471,
                7568
            ],
            [
                7568,
                7622
            ],
            [
                7622,
                7655
            ],
            [
                7655,
                7716
            ],
            [
                7716,
                7765
            ],
            [
                7765,
                7791
            ],
            [
                7791,
                7864
            ],
            [
                7864,
                7923
            ],
            [
                7923,
                7944
            ],
            [
                7944,
                7950
            ],
            [
                7950,
                8034
            ],
            [
                8034,
                8139
            ],
            [
                8139,
                8189
            ],
            [
                8189,
                8224
            ],
            [
                8224,
                8278
            ],
            [
                8278,
                8365
            ],
            [
                8365,
                8506
            ],
            [
                8506,
                8715
            ],
            [
                8715,
                8806
            ],
            [
                8806,
                9063
            ],
            [
                9063,
                9216
            ],
            [
                9216,
                9406
            ],
            [
                9406,
                9651
            ],
            [
                9651,
                9731
            ],
            [
                9731,
                9789
            ],
            [
                9789,
                9941
            ],
            [
                9941,
                9986
            ],
            [
                9986,
                10036
            ],
            [
                10036,
                10074
            ],
            [
                10074,
                10100
            ],
            [
                10100,
                10185
            ],
            [
                10185,
                10300
            ],
            [
                10300,
                10405
            ],
            [
                10405,
                10468
            ],
            [
                10468,
                10740
            ],
            [
                10740,
                10871
            ],
            [
                10871,
                11006
            ],
            [
                11006,
                11102
            ],
            [
                11102,
                11285
            ],
            [
                11285,
                11408
            ],
            [
                11408,
                11551
            ],
            [
                11551,
                11677
            ],
            [
                11677,
                11922
            ],
            [
                11922,
                12007
            ],
            [
                12007,
                12027
            ],
            [
                12027,
                12191
            ],
            [
                12191,
                12236
            ],
            [
                12236,
                12256
            ],
            [
                12256,
                12290
            ],
            [
                12290,
                12384
            ],
            [
                12384,
                12492
            ],
            [
                12492,
                12664
            ],
            [
                12664,
                12741
            ],
            [
                12741,
                12807
            ],
            [
                12807,
                12845
            ],
            [
                12845,
                12862
            ],
            [
                12862,
                12942
            ],
            [
                12942,
                13026
            ],
            [
                13026,
                13194
            ],
            [
                13194,
                13257
            ],
            [
                13257,
                13299
            ],
            [
                13299,
                13339
            ],
            [
                13339,
                13420
            ],
            [
                13420,
                13436
            ],
            [
                13436,
                13509
            ],
            [
                13509,
                13605
            ],
            [
                13605,
                13651
            ],
            [
                13651,
                13690
            ],
            [
                13690,
                13738
            ],
            [
                13738,
                13755
            ],
            [
                13755,
                13806
            ],
            [
                13806,
                13830
            ],
            [
                13830,
                13972
            ],
            [
                13972,
                14219
            ],
            [
                14219,
                14393
            ],
            [
                14393,
                14518
            ],
            [
                14518,
                14591
            ],
            [
                14591,
                14677
            ],
            [
                14677,
                14708
            ],
            [
                14708,
                14890
            ],
            [
                14890,
                15081
            ],
            [
                15081,
                15140
            ],
            [
                15140,
                15209
            ],
            [
                15209,
                15229
            ],
            [
                15229,
                15394
            ],
            [
                15394,
                15450
            ],
            [
                15450,
                15535
            ],
            [
                15535,
                15697
            ],
            [
                15697,
                15771
            ],
            [
                15771,
                15841
            ],
            [
                15841,
                15887
            ],
            [
                15887,
                15930
            ],
            [
                15930,
                15991
            ],
            [
                15991,
                16076
            ],
            [
                16076,
                16114
            ],
            [
                16114,
                16178
            ],
            [
                16178,
                16254
            ],
            [
                16254,
                16281
            ],
            [
                16281,
                16427
            ],
            [
                16427,
                16540
            ],
            [
                16540,
                16616
            ],
            [
                16616,
                16624
            ],
            [
                16624,
                16729
            ],
            [
                16729,
                16860
            ],
            [
                16860,
                17138
            ],
            [
                17138,
                17161
            ],
            [
                17161,
                17200
            ],
            [
                17200,
                17600
            ],
            [
                17600,
                17774
            ],
            [
                17774,
                17847
            ],
            [
                17847,
                17926
            ],
            [
                17926,
                17944
            ],
            [
                17944,
                18075
            ],
            [
                18075,
                18091
            ],
            [
                18091,
                18254
            ],
            [
                18254,
                18393
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                25,
                29
            ],
            [
                135,
                141
            ],
            [
                38,
                63
            ],
            [
                73,
                76
            ],
            [
                119,
                120
            ],
            [
                82,
                92
            ],
            [
                179,
                181
            ],
            [
                201,
                225
            ],
            [
                191,
                200
            ],
            [
                234,
                238
            ],
            [
                262,
                264
            ],
            [
                125,
                129
            ],
            [
                292,
                317
            ],
            [
                323,
                325
            ],
            [
                326,
                337
            ],
            [
                340,
                353
            ],
            [
                354,
                392
            ],
            [
                400,
                565
            ],
            [
                565,
                619
            ],
            [
                757,
                799
            ],
            [
                802,
                803
            ],
            [
                811,
                815
            ],
            [
                822,
                824
            ],
            [
                825,
                827
            ],
            [
                841,
                843
            ],
            [
                877,
                901
            ],
            [
                961,
                1066
            ],
            [
                1132,
                1173
            ],
            [
                1182,
                1191
            ],
            [
                1394,
                1403
            ],
            [
                1404,
                1422
            ],
            [
                1422,
                1444
            ],
            [
                1453,
                1468
            ],
            [
                1473,
                1490
            ],
            [
                1506,
                1508
            ],
            [
                1529,
                1542
            ],
            [
                1568,
                1632
            ],
            [
                1646,
                1648
            ],
            [
                1648,
                1651
            ],
            [
                1656,
                1663
            ],
            [
                1675,
                1706
            ],
            [
                1728,
                1730
            ],
            [
                1730,
                1749
            ],
            [
                1754,
                1771
            ],
            [
                1896,
                1901
            ],
            [
                1817,
                1822
            ],
            [
                1892,
                1895
            ],
            [
                1772,
                1776
            ],
            [
                1828,
                1862
            ],
            [
                1924,
                1947
            ],
            [
                1947,
                2002
            ],
            [
                2050,
                2051
            ],
            [
                2023,
                2034
            ],
            [
                2052,
                2112
            ],
            [
                2112,
                2198
            ],
            [
                2254,
                2370
            ],
            [
                2370,
                2459
            ],
            [
                2459,
                2476
            ],
            [
                2476,
                2571
            ],
            [
                2573,
                2576
            ],
            [
                2588,
                2615
            ],
            [
                2625,
                2644
            ],
            [
                2645,
                2655
            ],
            [
                2699,
                2703
            ],
            [
                2693,
                2694
            ],
            [
                2705,
                2742
            ],
            [
                2774,
                2788
            ],
            [
                2764,
                2771
            ],
            [
                2788,
                2790
            ],
            [
                2790,
                2852
            ],
            [
                2860,
                2874
            ],
            [
                2877,
                2933
            ],
            [
                2937,
                3027
            ],
            [
                3038,
                3040
            ],
            [
                3040,
                3138
            ],
            [
                3149,
                3164
            ],
            [
                3200,
                3203
            ],
            [
                3223,
                3234
            ],
            [
                3240,
                3253
            ],
            [
                3296,
                3365
            ],
            [
                3379,
                3381
            ],
            [
                3381,
                3392
            ],
            [
                3441,
                3449
            ],
            [
                3475,
                3484
            ],
            [
                3484,
                3486
            ],
            [
                3486,
                3524
            ],
            [
                3539,
                3540
            ],
            [
                3528,
                3531
            ],
            [
                3664,
                3679
            ],
            [
                3684,
                3729
            ],
            [
                3762,
                3792
            ],
            [
                3596,
                3599
            ],
            [
                3797,
                3803
            ],
            [
                3821,
                3823
            ],
            [
                3825,
                3828
            ],
            [
                3829,
                3838
            ],
            [
                3848,
                3858
            ],
            [
                3861,
                3868
            ],
            [
                3870,
                3968
            ],
            [
                3986,
                3989
            ],
            [
                3994,
                4012
            ],
            [
                4025,
                4046
            ],
            [
                4096,
                4115
            ],
            [
                4119,
                4172
            ],
            [
                4213,
                4215
            ],
            [
                4215,
                4281
            ],
            [
                4346,
                4377
            ],
            [
                4388,
                4468
            ],
            [
                4506,
                4546
            ],
            [
                4546,
                4547
            ],
            [
                4569,
                4580
            ],
            [
                4593,
                4660
            ],
            [
                4660,
                4714
            ],
            [
                4716,
                4720
            ],
            [
                4736,
                4738
            ],
            [
                4742,
                4769
            ],
            [
                4791,
                4799
            ],
            [
                4860,
                4900
            ],
            [
                4938,
                4940
            ],
            [
                4940,
                4955
            ],
            [
                4959,
                4980
            ],
            [
                4983,
                4993
            ],
            [
                5013,
                5018
            ],
            [
                5024,
                5044
            ],
            [
                5044,
                5114
            ],
            [
                5118,
                5151
            ],
            [
                5154,
                5167
            ],
            [
                5169,
                5172
            ],
            [
                5220,
                5222
            ],
            [
                5271,
                5274
            ],
            [
                5288,
                5289
            ],
            [
                5298,
                5341
            ],
            [
                5341,
                5351
            ],
            [
                5376,
                5383
            ],
            [
                5384,
                5414
            ],
            [
                5423,
                5476
            ],
            [
                5476,
                5497
            ],
            [
                5510,
                5530
            ],
            [
                5536,
                5538
            ],
            [
                5532,
                5535
            ],
            [
                5539,
                5569
            ],
            [
                5631,
                5679
            ],
            [
                5679,
                5703
            ],
            [
                5720,
                5751
            ],
            [
                5769,
                5795
            ],
            [
                5795,
                5797
            ],
            [
                5797,
                5811
            ],
            [
                5819,
                5881
            ],
            [
                5881,
                5890
            ],
            [
                5944,
                5967
            ],
            [
                5978,
                6020
            ],
            [
                6024,
                6031
            ],
            [
                6034,
                6048
            ],
            [
                6050,
                6109
            ],
            [
                6129,
                6217
            ],
            [
                6228,
                6231
            ],
            [
                6237,
                6240
            ],
            [
                6263,
                6271
            ],
            [
                6275,
                6314
            ],
            [
                6317,
                6326
            ],
            [
                6327,
                6338
            ],
            [
                6338,
                6360
            ],
            [
                6360,
                6368
            ],
            [
                6386,
                6459
            ],
            [
                6537,
                6539
            ],
            [
                6496,
                6497
            ],
            [
                6746,
                6783
            ],
            [
                6784,
                6789
            ],
            [
                6659,
                6662
            ],
            [
                6796,
                6800
            ],
            [
                6657,
                6658
            ],
            [
                6803,
                6847
            ],
            [
                6998,
                7057
            ],
            [
                7057,
                7101
            ],
            [
                7213,
                7218
            ],
            [
                7237,
                7263
            ],
            [
                7277,
                7279
            ],
            [
                7317,
                7320
            ],
            [
                7346,
                7348
            ],
            [
                7299,
                7301
            ],
            [
                7360,
                7430
            ],
            [
                7433,
                7447
            ],
            [
                7469,
                7471
            ],
            [
                7519,
                7565
            ],
            [
                7569,
                7619
            ],
            [
                7622,
                7641
            ],
            [
                7643,
                7655
            ],
            [
                7656,
                7688
            ],
            [
                7736,
                7749
            ],
            [
                7752,
                7764
            ],
            [
                7835,
                7852
            ],
            [
                7829,
                7833
            ],
            [
                7827,
                7828
            ],
            [
                7853,
                7861
            ],
            [
                7892,
                7903
            ],
            [
                7865,
                7890
            ],
            [
                7903,
                7920
            ],
            [
                7924,
                7941
            ],
            [
                7945,
                7947
            ],
            [
                7954,
                8019
            ],
            [
                8022,
                8034
            ],
            [
                8039,
                8085
            ],
            [
                8162,
                8169
            ],
            [
                8172,
                8189
            ],
            [
                8194,
                8224
            ],
            [
                8224,
                8227
            ],
            [
                8231,
                8278
            ],
            [
                8278,
                8365
            ],
            [
                8365,
                8373
            ],
            [
                8445,
                8503
            ],
            [
                8507,
                8516
            ],
            [
                8519,
                8530
            ],
            [
                8546,
                8622
            ],
            [
                8713,
                8715
            ],
            [
                8715,
                8743
            ],
            [
                8773,
                8806
            ],
            [
                8844,
                8869
            ],
            [
                8889,
                8943
            ],
            [
                8974,
                8981
            ],
            [
                8956,
                8968
            ],
            [
                8982,
                9000
            ],
            [
                9002,
                9004
            ],
            [
                9052,
                9060
            ],
            [
                9022,
                9024
            ],
            [
                9046,
                9050
            ],
            [
                9032,
                9042
            ],
            [
                9068,
                9099
            ],
            [
                9102,
                9114
            ],
            [
                9116,
                9149
            ],
            [
                9214,
                9216
            ],
            [
                9216,
                9239
            ],
            [
                9256,
                9299
            ],
            [
                9395,
                9404
            ],
            [
                9373,
                9390
            ],
            [
                9253,
                9255
            ],
            [
                9404,
                9406
            ],
            [
                9406,
                9409
            ],
            [
                9420,
                9458
            ],
            [
                9468,
                9528
            ],
            [
                9575,
                9576
            ],
            [
                9604,
                9607
            ],
            [
                9649,
                9651
            ],
            [
                9731,
                9758
            ],
            [
                9767,
                9788
            ],
            [
                9789,
                9941
            ],
            [
                10074,
                10098
            ],
            [
                10062,
                10073
            ],
            [
                10100,
                10185
            ],
            [
                10304,
                10367
            ],
            [
                10372,
                10379
            ],
            [
                10395,
                10405
            ],
            [
                10405,
                10468
            ],
            [
                10468,
                10501
            ],
            [
                10516,
                10539
            ],
            [
                10543,
                10587
            ],
            [
                10604,
                10605
            ],
            [
                10631,
                10632
            ],
            [
                10652,
                10740
            ],
            [
                10740,
                10785
            ],
            [
                10814,
                10817
            ],
            [
                10858,
                10870
            ],
            [
                10871,
                10909
            ],
            [
                10929,
                10967
            ],
            [
                10974,
                11006
            ],
            [
                11036,
                11043
            ],
            [
                11061,
                11102
            ],
            [
                11102,
                11149
            ],
            [
                11185,
                11187
            ],
            [
                11220,
                11285
            ],
            [
                11285,
                11293
            ],
            [
                11357,
                11408
            ],
            [
                11408,
                11414
            ],
            [
                11450,
                11551
            ],
            [
                11551,
                11626
            ],
            [
                11660,
                11674
            ],
            [
                11680,
                11681
            ],
            [
                11682,
                11692
            ],
            [
                11695,
                11702
            ],
            [
                11704,
                11732
            ],
            [
                11734,
                11828
            ],
            [
                11837,
                11888
            ],
            [
                11920,
                11922
            ],
            [
                11922,
                12004
            ],
            [
                12013,
                12024
            ],
            [
                12027,
                12064
            ],
            [
                12189,
                12191
            ],
            [
                12195,
                12197
            ],
            [
                12211,
                12236
            ],
            [
                12236,
                12256
            ],
            [
                12256,
                12266
            ],
            [
                12271,
                12290
            ],
            [
                12290,
                12384
            ],
            [
                12384,
                12423
            ],
            [
                12451,
                12492
            ],
            [
                12501,
                12503
            ],
            [
                12520,
                12543
            ],
            [
                12558,
                12585
            ],
            [
                12597,
                12622
            ],
            [
                12648,
                12664
            ],
            [
                12664,
                12670
            ],
            [
                12679,
                12683
            ],
            [
                12685,
                12741
            ],
            [
                12741,
                12804
            ],
            [
                12819,
                12826
            ],
            [
                12845,
                12862
            ],
            [
                12863,
                12942
            ],
            [
                13030,
                13079
            ],
            [
                13085,
                13124
            ],
            [
                13132,
                13149
            ],
            [
                13192,
                13194
            ],
            [
                13194,
                13257
            ],
            [
                13329,
                13336
            ],
            [
                13339,
                13341
            ],
            [
                13354,
                13402
            ],
            [
                13348,
                13349
            ],
            [
                13404,
                13420
            ],
            [
                13420,
                13436
            ],
            [
                13436,
                13509
            ],
            [
                13509,
                13602
            ],
            [
                13609,
                13648
            ],
            [
                13651,
                13658
            ],
            [
                13679,
                13690
            ],
            [
                13695,
                13735
            ],
            [
                13739,
                13752
            ],
            [
                13755,
                13769
            ],
            [
                13804,
                13806
            ],
            [
                13807,
                13830
            ],
            [
                13885,
                13888
            ],
            [
                13854,
                13858
            ],
            [
                13896,
                13898
            ],
            [
                13930,
                13972
            ],
            [
                13972,
                13986
            ],
            [
                13996,
                14051
            ],
            [
                14066,
                14133
            ],
            [
                14160,
                14219
            ],
            [
                14219,
                14303
            ],
            [
                14321,
                14336
            ],
            [
                14353,
                14393
            ],
            [
                14393,
                14426
            ],
            [
                14443,
                14457
            ],
            [
                14516,
                14518
            ],
            [
                14518,
                14575
            ],
            [
                14582,
                14591
            ],
            [
                14591,
                14630
            ],
            [
                14654,
                14658
            ],
            [
                14675,
                14677
            ],
            [
                14677,
                14708
            ],
            [
                14708,
                14762
            ],
            [
                14775,
                14868
            ],
            [
                14879,
                14887
            ],
            [
                14890,
                14901
            ],
            [
                14967,
                14968
            ],
            [
                14964,
                14967
            ],
            [
                14923,
                14934
            ],
            [
                14976,
                14977
            ],
            [
                14998,
                15009
            ],
            [
                15079,
                15080
            ],
            [
                15032,
                15036
            ],
            [
                15037,
                15043
            ],
            [
                15147,
                15193
            ],
            [
                15132,
                15139
            ],
            [
                15212,
                15229
            ],
            [
                15229,
                15231
            ],
            [
                15237,
                15283
            ],
            [
                15291,
                15336
            ],
            [
                15395,
                15447
            ],
            [
                15450,
                15470
            ],
            [
                15473,
                15515
            ],
            [
                15533,
                15535
            ],
            [
                15535,
                15540
            ],
            [
                15543,
                15550
            ],
            [
                15557,
                15673
            ],
            [
                15695,
                15697
            ],
            [
                15697,
                15731
            ],
            [
                15769,
                15771
            ],
            [
                15771,
                15841
            ],
            [
                15841,
                15887
            ],
            [
                15891,
                15930
            ],
            [
                15991,
                16025
            ],
            [
                16088,
                16096
            ],
            [
                16043,
                16045
            ],
            [
                16103,
                16114
            ],
            [
                16114,
                16178
            ],
            [
                16178,
                16230
            ],
            [
                16232,
                16236
            ],
            [
                16238,
                16241
            ],
            [
                16252,
                16254
            ],
            [
                16281,
                16425
            ],
            [
                16477,
                16510
            ],
            [
                16538,
                16540
            ],
            [
                16540,
                16564
            ],
            [
                16591,
                16616
            ],
            [
                16616,
                16622
            ],
            [
                16729,
                16761
            ],
            [
                16785,
                16820
            ],
            [
                16830,
                16845
            ],
            [
                16858,
                16860
            ],
            [
                16924,
                16927
            ],
            [
                16935,
                16958
            ],
            [
                16977,
                17031
            ],
            [
                16913,
                16916
            ],
            [
                17136,
                17137
            ],
            [
                17138,
                17161
            ],
            [
                17161,
                17188
            ],
            [
                17200,
                17209
            ],
            [
                17278,
                17286
            ],
            [
                17222,
                17239
            ],
            [
                17271,
                17272
            ],
            [
                17258,
                17261
            ],
            [
                17287,
                17343
            ],
            [
                17198,
                17199
            ],
            [
                17349,
                17419
            ],
            [
                17512,
                17516
            ],
            [
                17522,
                17539
            ],
            [
                17580,
                17589
            ],
            [
                17243,
                17245
            ],
            [
                17594,
                17600
            ],
            [
                17617,
                17699
            ],
            [
                17704,
                17705
            ],
            [
                17733,
                17740
            ],
            [
                17749,
                17774
            ],
            [
                17774,
                17785
            ],
            [
                17786,
                17847
            ],
            [
                17847,
                17860
            ],
            [
                17862,
                17866
            ],
            [
                17867,
                17926
            ],
            [
                17926,
                17944
            ],
            [
                17944,
                18075
            ],
            [
                18075,
                18091
            ],
            [
                18091,
                18158
            ],
            [
                18168,
                18254
            ],
            [
                18254,
                18270
            ],
            [
                18286,
                18393
            ]
        ],
        "row_chars": [
            [
                0,
                325
            ],
            [
                325,
                340
            ],
            [
                340,
                353
            ],
            [
                353,
                392
            ],
            [
                392,
                565
            ],
            [
                565,
                756
            ],
            [
                756,
                802
            ],
            [
                802,
                824
            ],
            [
                824,
                843
            ],
            [
                843,
                860
            ],
            [
                860,
                940
            ],
            [
                940,
                961
            ],
            [
                961,
                1192
            ],
            [
                1192,
                1394
            ],
            [
                1394,
                1422
            ],
            [
                1422,
                1508
            ],
            [
                1508,
                1648
            ],
            [
                1648,
                1730
            ],
            [
                1730,
                1924
            ],
            [
                1924,
                1947
            ],
            [
                1947,
                2112
            ],
            [
                2112,
                2198
            ],
            [
                2198,
                2370
            ],
            [
                2370,
                2459
            ],
            [
                2459,
                2476
            ],
            [
                2476,
                2645
            ],
            [
                2645,
                2790
            ],
            [
                2790,
                2855
            ],
            [
                2855,
                2933
            ],
            [
                2933,
                3040
            ],
            [
                3040,
                3296
            ],
            [
                3296,
                3381
            ],
            [
                3381,
                3486
            ],
            [
                3486,
                3823
            ],
            [
                3823,
                4215
            ],
            [
                4215,
                4471
            ],
            [
                4471,
                4660
            ],
            [
                4660,
                4738
            ],
            [
                4738,
                4799
            ],
            [
                4799,
                4940
            ],
            [
                4940,
                4958
            ],
            [
                4958,
                5044
            ],
            [
                5044,
                5117
            ],
            [
                5117,
                5341
            ],
            [
                5341,
                5476
            ],
            [
                5476,
                5679
            ],
            [
                5679,
                5797
            ],
            [
                5797,
                5881
            ],
            [
                5881,
                6023
            ],
            [
                6023,
                6274
            ],
            [
                6274,
                6317
            ],
            [
                6317,
                6326
            ],
            [
                6326,
                6338
            ],
            [
                6338,
                6360
            ],
            [
                6360,
                6459
            ],
            [
                6459,
                6847
            ],
            [
                6847,
                6944
            ],
            [
                6944,
                7057
            ],
            [
                7057,
                7279
            ],
            [
                7279,
                7359
            ],
            [
                7359,
                7471
            ],
            [
                7471,
                7568
            ],
            [
                7568,
                7622
            ],
            [
                7622,
                7655
            ],
            [
                7655,
                7716
            ],
            [
                7716,
                7765
            ],
            [
                7765,
                7791
            ],
            [
                7791,
                7864
            ],
            [
                7864,
                7923
            ],
            [
                7923,
                7944
            ],
            [
                7944,
                7950
            ],
            [
                7950,
                8034
            ],
            [
                8034,
                8139
            ],
            [
                8139,
                8189
            ],
            [
                8189,
                8224
            ],
            [
                8224,
                8278
            ],
            [
                8278,
                8365
            ],
            [
                8365,
                8506
            ],
            [
                8506,
                8715
            ],
            [
                8715,
                8806
            ],
            [
                8806,
                9063
            ],
            [
                9063,
                9216
            ],
            [
                9216,
                9406
            ],
            [
                9406,
                9651
            ],
            [
                9651,
                9731
            ],
            [
                9731,
                9789
            ],
            [
                9789,
                9941
            ],
            [
                9941,
                9986
            ],
            [
                9986,
                10036
            ],
            [
                10036,
                10100
            ],
            [
                10100,
                10185
            ],
            [
                10185,
                10300
            ],
            [
                10300,
                10405
            ],
            [
                10405,
                10468
            ],
            [
                10468,
                10740
            ],
            [
                10740,
                10871
            ],
            [
                10871,
                11006
            ],
            [
                11006,
                11102
            ],
            [
                11102,
                11285
            ],
            [
                11285,
                11408
            ],
            [
                11408,
                11551
            ],
            [
                11551,
                11677
            ],
            [
                11677,
                11922
            ],
            [
                11922,
                12007
            ],
            [
                12007,
                12027
            ],
            [
                12027,
                12191
            ],
            [
                12191,
                12236
            ],
            [
                12236,
                12256
            ],
            [
                12256,
                12290
            ],
            [
                12290,
                12384
            ],
            [
                12384,
                12492
            ],
            [
                12492,
                12664
            ],
            [
                12664,
                12741
            ],
            [
                12741,
                12807
            ],
            [
                12807,
                12845
            ],
            [
                12845,
                12862
            ],
            [
                12862,
                12942
            ],
            [
                12942,
                13026
            ],
            [
                13026,
                13194
            ],
            [
                13194,
                13257
            ],
            [
                13257,
                13299
            ],
            [
                13299,
                13339
            ],
            [
                13339,
                13420
            ],
            [
                13420,
                13436
            ],
            [
                13436,
                13509
            ],
            [
                13509,
                13605
            ],
            [
                13605,
                13651
            ],
            [
                13651,
                13690
            ],
            [
                13690,
                13738
            ],
            [
                13738,
                13755
            ],
            [
                13755,
                13806
            ],
            [
                13806,
                13830
            ],
            [
                13830,
                13972
            ],
            [
                13972,
                14219
            ],
            [
                14219,
                14393
            ],
            [
                14393,
                14518
            ],
            [
                14518,
                14591
            ],
            [
                14591,
                14677
            ],
            [
                14677,
                14708
            ],
            [
                14708,
                14890
            ],
            [
                14890,
                15209
            ],
            [
                15209,
                15229
            ],
            [
                15229,
                15394
            ],
            [
                15394,
                15450
            ],
            [
                15450,
                15535
            ],
            [
                15535,
                15697
            ],
            [
                15697,
                15771
            ],
            [
                15771,
                15841
            ],
            [
                15841,
                15887
            ],
            [
                15887,
                15930
            ],
            [
                15930,
                15991
            ],
            [
                15991,
                16114
            ],
            [
                16114,
                16178
            ],
            [
                16178,
                16254
            ],
            [
                16254,
                16281
            ],
            [
                16281,
                16427
            ],
            [
                16427,
                16540
            ],
            [
                16540,
                16616
            ],
            [
                16616,
                16624
            ],
            [
                16624,
                16729
            ],
            [
                16729,
                16860
            ],
            [
                16860,
                17138
            ],
            [
                17138,
                17161
            ],
            [
                17161,
                17600
            ],
            [
                17600,
                17774
            ],
            [
                17774,
                17847
            ],
            [
                17847,
                17926
            ],
            [
                17926,
                17944
            ],
            [
                17944,
                18075
            ],
            [
                18075,
                18091
            ],
            [
                18091,
                18254
            ],
            [
                18254,
                18393
            ]
        ]
    },
    "abridged": {
        "text": "As soon as I had read this letter I went to the master, and told him about it, informing him of his sister's ardent desire to see him, and her wish to be sent some token of forgiveness.\n'Forgiveness!' said Linton. 'I have nothing to forgive her, Ellen. Call at Wuthering Heights this afternoon, if you like, and say that I am not angry, but I'm sorry to have lost her; especially as I can never think she'll be happy. It is out of the question my going to see her, however.'\n'And you won't write her a little note, sir?' I implored.\n'No. I will not communicate with Heathcliff's family.'\nMr. Edgar's coldness depressed me exceedingly; and all the way from the Grange I puzzled my brains how to soften his refusal of even a few lines to Isabella.\nI entered Wuthering Heights without knocking. There never was such a dismal scene as that formerly cheerful great room! If I had been there, I would, at least, have swept the hearth, and wiped the tables. But Isabella already shared the pervading spirit of neglect. Her pretty face was pale and listless; her dress was unchanged, and her hair was carelessly twisted round her head.\nHindley was not there. Mr. Heathcliff sat at a table, turning over some papers, but he rose and asked me how I did, quite friendly, and offered me a chair. He was the only thing there that seemed decent; and I thought he never looked better. He would certainly have struck a stranger as a born and bred gentleman; and his wife as a thorough little slattern! She came forward eagerly to greet me, and held out one hand to take the expected letter. I shook my head. She wouldn't understand the hint, but followed me to a sideboard, where I went to lay my bonnet; and begged me in a whisper to give her what I had brought.\nHeathcliff said, 'If you have got anything for Isabella, give it to her, Nelly. You needn't make a secret of it: we have no secrets between us.'\n'I have nothing,' I replied, thinking it best to speak the truth at once. 'My master bid me tell his sister that she must not expect either a letter or a visit from him. He sends his love, ma'am, and his wishes for your happiness, and his pardon for the grief you have caused; but he thinks you and he should drop communication.'\nMrs. Heathcliff's lip quivered slightly, and she returned to her seat. Her husband began to ask about Catherine's illness. I told him as much as I thought proper, blaming her for bringing it on herself; and ended by hoping that he would avoid future interference with the family.\n'Mrs. Linton is recovering,' I said; 'she'll never be like she was, but her life is spared; and if you really have a regard for her, you won't see her again: nay, you'll leave this country entirely. Catherine Linton is different now from your old friend Catherine Earnshaw. Her appearance is changed greatly, her character much more so; and Mr. Linton will only sustain his affection from now on by the remembrance of what she once was, by common humanity, and a sense of duty!'\nHeathcliff, forcing himself to seem calm, said: 'Possibly your master has nothing but common humanity and a sense of duty to fall back upon. But do you imagine that I shall leave Catherine to his duty? Can you compare my feelings to his? Promise that you'll get me an interview with her! What do you say?'\n'I say, Mr. Heathcliff,' I replied, 'never, through my means. Another encounter between you and the master would kill her altogether.'\n'With your aid that may be avoided,' he continued; 'and if he troubles her, I shall be justified in going to extremes! I wish you would tell me truly whether Catherine would suffer from his loss: the fear that she would restrains me. And there you see the difference between our feelings. If he had been in my place, and I in his, I never would have raised a hand against him. You may look incredulous - but I never would have banished him as long as she desired his company. The moment her affection ceased, I would have torn his heart out, and drunk his blood! But, till then, I would have died before I touched a single hair of his head!'\n'And yet,' I interrupted, 'you have no scruples in completely ruining all hopes of her health, by thrusting yourself into her remembrance now, when she has nearly forgotten you, and giving her new distress.'\n'You suppose she has nearly forgotten me?' he said. 'Oh, Nelly! you know she has not! You know that for every thought she spends on Linton she spends a thousand on me! If she did not care about me, two words would comprehend my future - death and hell. Existence, after losing her, would be hell. Edgar Linton couldn't love as much in eighty years as I could in a day. And Catherine has a heart as deep as I have: he is no dearer to her than her dog. How could he be?'\n'Catherine and Edgar are as fond of each other as any two people can be,' cried Isabella. 'I won't hear my brother depreciated in silence!'\n'Your brother is wondrous fond of you too, isn't he?' observed Heathcliff scornfully. 'He turns you adrift on the world.'\n'I didn't tell him what I suffer,' she replied.\n'You have written, then, have you?'\n'I did write to say that I was married - you saw the note.'\n'And nothing since?'\n'No.'\n'My young lady is looking sadly the worse for her change of condition,' I remarked. 'Somebody's love comes short in her case, obviously.'\n'Her own,' said Heathcliff. 'She degenerates into a mere slut! She tired of trying to please me uncommonly early. You'd hardly credit it, but the very morrow of our wedding she was weeping to go home. However, I'll take care she does not disgrace me by rambling abroad.'\n'Well, sir,' returned I, 'consider that Mrs. Heathcliff is accustomed to be looked after and waited on. You must let her have a maid, and you must treat her kindly. You cannot doubt that she feels strong attachments, or she wouldn't have abandoned the friends and comforts of her former home to live with you in this wilderness.'\n'She abandoned them under a delusion,' he answered; 'picturing in me a hero of romance. I can hardly regard her as a rational creature, so obstinately has she cherished false impressions of me. But I think she begins to know me: I don't see the silly smiles and grimaces that provoked me at first; and she no longer thinks I love her. I believed, at one time, no lesson could teach her that!\n'And yet it is poorly learnt; for this morning she announced, as a piece of appalling intelligence, that I had actually succeeded in making her hate me! Are you sure you hate me, Isabella? If I let you alone for half a day, won't you come sighing and wheedling to me again? I don't care who knows that the passion was wholly on one side: I never lied about it. She cannot accuse me of showing one bit of deceitful softness. The first thing she saw me do, on leaving the Grange, was to hang her little dog; and when she pleaded for it, I said I wished I could hang every being belonging to her, except one: possibly she took that exception for herself. But no brutality disgusted her: I suppose she admires it, as long as she is safe from injury!\n'Now, was it not the depth of absurdity for that pitiful, slavish, mean-minded creature to dream that I could love her? I never met with such an abject thing as she is. She even disgraces the name of Linton; and I've run out of ideas to see what she could endure, and still creep shamefully cringing back! But tell her brother that I keep strictly within the limits of the law. I have not given her the slightest right to claim a separation; and, what's more, she'd thank nobody for dividing us. If she desired to go, she might: the nuisance of her presence outweighs the pleasure of tormenting her!'\n'Mr. Heathcliff,' said I, 'this is the talk of a madman. Your wife, most likely, is convinced you are mad; and, for that reason, she has borne with you: but now that you say she may go, she'll doubtless do so. You are not so bewitched, ma'am, are you, as to remain with him of your own accord?'\n'Take care, Ellen!' answered Isabella, her eyes sparkling angrily. 'Don't believe a single word he speaks. He's a lying fiend! a monster, not a human being! I've been told I might leave him before; and I've made the attempt, but I dare not repeat it! Only, Ellen, promise you'll not mention this conversation to my brother or Catherine. Heathcliff wishes to provoke Edgar: he says he has married me to obtain power over him; but I'll die first! I just pray that he may forget his diabolical prudence and kill me! The single pleasure I can imagine is to die, or to see him dead!'\n'That will do!' said Heathcliff. 'If you are called upon in a court of law, you'll remember her language, Nelly! You're not fit to be your own guardian, Isabella, and I, being your legal protector, must keep you in my custody. Go upstairs; I have something to say to Ellen Dean in private. Upstairs, child!'\nHe thrust her from the room; and returned muttering, 'I have no pity! I have no pity! The more the worms writhe, the more I yearn to crush out their entrails! It is a moral teething; and I grind with greater energy in proportion to the increase of pain.'\n'Do you understand what the word pity means?' I said, taking up my bonnet. 'Did you ever feel a touch of it in your life?'\n'Put that down!' he interrupted. 'You are not going yet. You must help me to see Catherine, and that without delay. I swear that I mean no harm: I don't desire to cause any disturbance, or to insult Mr. Linton; I only wish to hear from herself how she is, and to ask if anything that I could do would be of use to her. Last night I was in the Grange garden six hours, and I'll return there to-night; and haunt the place till I find an opportunity of entering. If Edgar Linton meets me, I shall knock him down. If his servants oppose me, I shall threaten them off with pistols. But wouldn't it be better to prevent my meeting them? And you could do it so easily. I'd warn you when I came, and then you might let me in as soon as she was alone, and watch till I departed, your conscience quite calm: you would be preventing mischief.'\nI protested, and told him it would be treacherous, and cruel and selfish. 'Mrs. Linton is all nerves, and she couldn't bear the surprise,' I said. 'Don't persist, sir! or I shall be obliged to inform my master of your plans; and he'll take measures to secure his house against you!'\n'In that case I'll take measures to secure you, woman!' exclaimed Heathcliff. 'You shall not leave Wuthering Heights till tomorrow. It is foolish to assert that Catherine could not bear to see me; and as to surprising her, I don't desire it: you must prepare her. You say she never mentions my name. To whom should she mention me if I am a forbidden topic in the house? She thinks you are all spies for her husband. I've no doubt she's in hell among you! You say she is often restless, and her mind is unsettled. How the devil could it be otherwise in her frightful isolation? And that insipid, paltry creature attending her from duty and humanity! He might as well plant an oak in a flower-pot, and expect it to thrive, as imagine he can restore her to vigour in the soil of his shallow cares! Am I to fight my way to Catherine? Or will you be my friend, and do what I request? Decide!'\nWell, Mr. Lockwood, I argued and refused him fifty times; but in the end he forced me to agree to carry a letter to my mistress. If she consented, I promised to let him know of Linton's next absence from home, when he might come and visit.\nWas it right or wrong? I fear it was wrong, though I thought it might prevent another explosion, and even create a favourable crisis in Catherine's mental illness. Then I remembered Mr. Edgar's stern rebuke of my carrying tales; and I vowed that this betrayal of trust should be my last. My journey homeward was sadder than my journey thither; and many misgivings I had, before I put the message into Mrs. Linton's hand.\nBut here is Dr. Kenneth; I'll go down, and tell him how much better you are. My history is dree, as we say, and will serve to while away another morning.\nDree, and dreary! I reflected as the good woman descended to receive the doctor: and not exactly of the kind which I should have chosen to amuse me. But never mind! I'll extract wholesome medicines from Mrs. Dean's bitter herbs; and let me beware of the fascination that lurks in Catherine Heathcliff's brilliant eyes. I should be in a fix if I surrendered my heart to that young person, and the daughter turned out a second edition of the mother.",
        "paragraph_chars": [
            [
                0,
                186
            ],
            [
                186,
                475
            ],
            [
                475,
                533
            ],
            [
                533,
                588
            ],
            [
                588,
                746
            ],
            [
                746,
                1128
            ],
            [
                1128,
                1748
            ],
            [
                1748,
                1893
            ],
            [
                1893,
                2223
            ],
            [
                2223,
                2503
            ],
            [
                2503,
                2982
            ],
            [
                2982,
                3288
            ],
            [
                3288,
                3423
            ],
            [
                3423,
                4065
            ],
            [
                4065,
                4273
            ],
            [
                4273,
                4742
            ],
            [
                4742,
                4882
            ],
            [
                4882,
                5004
            ],
            [
                5004,
                5052
            ],
            [
                5052,
                5088
            ],
            [
                5088,
                5148
            ],
            [
                5148,
                5169
            ],
            [
                5169,
                5175
            ],
            [
                5175,
                5313
            ],
            [
                5313,
                5584
            ],
            [
                5584,
                5914
            ],
            [
                5914,
                6306
            ],
            [
                6306,
                7052
            ],
            [
                7052,
                7653
            ],
            [
                7653,
                7948
            ],
            [
                7948,
                8527
            ],
            [
                8527,
                8835
            ],
            [
                8835,
                9090
            ],
            [
                9090,
                9213
            ],
            [
                9213,
                10046
            ],
            [
                10046,
                10329
            ],
            [
                10329,
                11217
            ],
            [
                11217,
                11457
            ],
            [
                11457,
                11878
            ],
            [
                11878,
                12032
            ],
            [
                12032,
                12479
            ]
        ],
        "segment_chars": [
            [
                0,
                186
            ],
            [
                186,
                201
            ],
            [
                201,
                214
            ],
            [
                214,
                253
            ],
            [
                253,
                418
            ],
            [
                418,
                475
            ],
            [
                475,
                521
            ],
            [
                521,
                533
            ],
            [
                533,
                538
            ],
            [
                538,
                588
            ],
            [
                588,
                746
            ],
            [
                746,
                792
            ],
            [
                792,
                866
            ],
            [
                866,
                951
            ],
            [
                951,
                1012
            ],
            [
                1012,
                1128
            ],
            [
                1128,
                1151
            ],
            [
                1151,
                1284
            ],
            [
                1284,
                1370
            ],
            [
                1370,
                1486
            ],
            [
                1486,
                1575
            ],
            [
                1575,
                1592
            ],
            [
                1592,
                1748
            ],
            [
                1748,
                1828
            ],
            [
                1828,
                1893
            ],
            [
                1893,
                1967
            ],
            [
                1967,
                2063
            ],
            [
                2063,
                2223
            ],
            [
                2223,
                2294
            ],
            [
                2294,
                2346
            ],
            [
                2346,
                2503
            ],
            [
                2503,
                2509
            ],
            [
                2509,
                2702
            ],
            [
                2702,
                2777
            ],
            [
                2777,
                2982
            ],
            [
                2982,
                3123
            ],
            [
                3123,
                3184
            ],
            [
                3184,
                3220
            ],
            [
                3220,
                3270
            ],
            [
                3270,
                3288
            ],
            [
                3288,
                3350
            ],
            [
                3350,
                3423
            ],
            [
                3423,
                3542
            ],
            [
                3542,
                3657
            ],
            [
                3657,
                3712
            ],
            [
                3712,
                3800
            ],
            [
                3800,
                3899
            ],
            [
                3899,
                3986
            ],
            [
                3986,
                4065
            ],
            [
                4065,
                4273
            ],
            [
                4273,
                4316
            ],
            [
                4316,
                4325
            ],
            [
                4325,
                4337
            ],
            [
                4337,
                4359
            ],
            [
                4359,
                4441
            ],
            [
                4441,
                4526
            ],
            [
                4526,
                4570
            ],
            [
                4570,
                4642
            ],
            [
                4642,
                4724
            ],
            [
                4724,
                4742
            ],
            [
                4742,
                4832
            ],
            [
                4832,
                4882
            ],
            [
                4882,
                4936
            ],
            [
                4936,
                4968
            ],
            [
                4968,
                5004
            ],
            [
                5004,
                5052
            ],
            [
                5052,
                5088
            ],
            [
                5088,
                5148
            ],
            [
                5148,
                5169
            ],
            [
                5169,
                5175
            ],
            [
                5175,
                5259
            ],
            [
                5259,
                5313
            ],
            [
                5313,
                5341
            ],
            [
                5341,
                5376
            ],
            [
                5376,
                5427
            ],
            [
                5427,
                5514
            ],
            [
                5514,
                5584
            ],
            [
                5584,
                5688
            ],
            [
                5688,
                5749
            ],
            [
                5749,
                5914
            ],
            [
                5914,
                6002
            ],
            [
                6002,
                6108
            ],
            [
                6108,
                6249
            ],
            [
                6249,
                6306
            ],
            [
                6306,
                6459
            ],
            [
                6459,
                6495
            ],
            [
                6495,
                6580
            ],
            [
                6580,
                6667
            ],
            [
                6667,
                6730
            ],
            [
                6730,
                6958
            ],
            [
                6958,
                7052
            ],
            [
                7052,
                7172
            ],
            [
                7172,
                7221
            ],
            [
                7221,
                7358
            ],
            [
                7358,
                7430
            ],
            [
                7430,
                7548
            ],
            [
                7548,
                7653
            ],
            [
                7653,
                7658
            ],
            [
                7658,
                7710
            ],
            [
                7710,
                7863
            ],
            [
                7863,
                7948
            ],
            [
                7948,
                7968
            ],
            [
                7968,
                8015
            ],
            [
                8015,
                8055
            ],
            [
                8055,
                8075
            ],
            [
                8075,
                8105
            ],
            [
                8105,
                8199
            ],
            [
                8199,
                8285
            ],
            [
                8285,
                8393
            ],
            [
                8393,
                8461
            ],
            [
                8461,
                8527
            ],
            [
                8527,
                8543
            ],
            [
                8543,
                8560
            ],
            [
                8560,
                8640
            ],
            [
                8640,
                8754
            ],
            [
                8754,
                8817
            ],
            [
                8817,
                8835
            ],
            [
                8835,
                8905
            ],
            [
                8905,
                8921
            ],
            [
                8921,
                8994
            ],
            [
                8994,
                9090
            ],
            [
                9090,
                9136
            ],
            [
                9136,
                9165
            ],
            [
                9165,
                9213
            ],
            [
                9213,
                9230
            ],
            [
                9230,
                9246
            ],
            [
                9246,
                9270
            ],
            [
                9270,
                9329
            ],
            [
                9329,
                9532
            ],
            [
                9532,
                9673
            ],
            [
                9673,
                9723
            ],
            [
                9723,
                9790
            ],
            [
                9790,
                9844
            ],
            [
                9844,
                9875
            ],
            [
                9875,
                10046
            ],
            [
                10046,
                10120
            ],
            [
                10120,
                10126
            ],
            [
                10126,
                10193
            ],
            [
                10193,
                10214
            ],
            [
                10214,
                10329
            ],
            [
                10329,
                10385
            ],
            [
                10385,
                10407
            ],
            [
                10407,
                10461
            ],
            [
                10461,
                10593
            ],
            [
                10593,
                10629
            ],
            [
                10629,
                10699
            ],
            [
                10699,
                10745
            ],
            [
                10745,
                10784
            ],
            [
                10784,
                10842
            ],
            [
                10842,
                10906
            ],
            [
                10906,
                10978
            ],
            [
                10978,
                11124
            ],
            [
                11124,
                11159
            ],
            [
                11159,
                11208
            ],
            [
                11208,
                11217
            ],
            [
                11217,
                11346
            ],
            [
                11346,
                11457
            ],
            [
                11457,
                11480
            ],
            [
                11480,
                11621
            ],
            [
                11621,
                11745
            ],
            [
                11745,
                11878
            ],
            [
                11878,
                11955
            ],
            [
                11955,
                12032
            ],
            [
                12032,
                12050
            ],
            [
                12050,
                12181
            ],
            [
                12181,
                12197
            ],
            [
                12197,
                12351
            ],
            [
                12351,
                12479
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                22,
                26
            ],
            [
                27,
                33
            ],
            [
                34,
                59
            ],
            [
                65,
                68
            ],
            [
                77,
                78
            ],
            [
                96,
                106
            ],
            [
                106,
                108
            ],
            [
                109,
                133
            ],
            [
                133,
                142
            ],
            [
                143,
                147
            ],
            [
                148,
                150
            ],
            [
                154,
                158
            ],
            [
                159,
                184
            ],
            [
                184,
                186
            ],
            [
                187,
                198
            ],
            [
                201,
                214
            ],
            [
                215,
                253
            ],
            [
                253,
                418
            ],
            [
                418,
                472
            ],
            [
                476,
                518
            ],
            [
                521,
                522
            ],
            [
                523,
                527
            ],
            [
                531,
                533
            ],
            [
                534,
                536
            ],
            [
                536,
                538
            ],
            [
                561,
                585
            ],
            [
                588,
                693
            ],
            [
                694,
                735
            ],
            [
                736,
                745
            ],
            [
                746,
                755
            ],
            [
                774,
                792
            ],
            [
                792,
                814
            ],
            [
                815,
                830
            ],
            [
                836,
                853
            ],
            [
                864,
                866
            ],
            [
                866,
                879
            ],
            [
                885,
                949
            ],
            [
                949,
                951
            ],
            [
                951,
                954
            ],
            [
                964,
                971
            ],
            [
                979,
                1010
            ],
            [
                1010,
                1012
            ],
            [
                1012,
                1031
            ],
            [
                1037,
                1054
            ],
            [
                1055,
                1060
            ],
            [
                1074,
                1079
            ],
            [
                1080,
                1083
            ],
            [
                1084,
                1088
            ],
            [
                1093,
                1127
            ],
            [
                1128,
                1151
            ],
            [
                1151,
                1206
            ],
            [
                1206,
                1207
            ],
            [
                1208,
                1219
            ],
            [
                1224,
                1284
            ],
            [
                1284,
                1370
            ],
            [
                1370,
                1486
            ],
            [
                1486,
                1575
            ],
            [
                1575,
                1592
            ],
            [
                1592,
                1687
            ],
            [
                1689,
                1692
            ],
            [
                1700,
                1727
            ],
            [
                1728,
                1747
            ],
            [
                1748,
                1758
            ],
            [
                1759,
                1763
            ],
            [
                1763,
                1764
            ],
            [
                1766,
                1803
            ],
            [
                1805,
                1819
            ],
            [
                1819,
                1826
            ],
            [
                1826,
                1828
            ],
            [
                1828,
                1890
            ],
            [
                1894,
                1908
            ],
            [
                1911,
                1967
            ],
            [
                1971,
                2061
            ],
            [
                2061,
                2063
            ],
            [
                2063,
                2161
            ],
            [
                2168,
                2183
            ],
            [
                2188,
                2191
            ],
            [
                2195,
                2206
            ],
            [
                2207,
                2220
            ],
            [
                2223,
                2292
            ],
            [
                2292,
                2294
            ],
            [
                2294,
                2305
            ],
            [
                2306,
                2314
            ],
            [
                2325,
                2334
            ],
            [
                2344,
                2346
            ],
            [
                2346,
                2384
            ],
            [
                2384,
                2385
            ],
            [
                2394,
                2397
            ],
            [
                2398,
                2413
            ],
            [
                2414,
                2459
            ],
            [
                2460,
                2490
            ],
            [
                2491,
                2494
            ],
            [
                2495,
                2501
            ],
            [
                2501,
                2503
            ],
            [
                2505,
                2508
            ],
            [
                2509,
                2518
            ],
            [
                2519,
                2529
            ],
            [
                2532,
                2539
            ],
            [
                2541,
                2639
            ],
            [
                2650,
                2653
            ],
            [
                2654,
                2672
            ],
            [
                2679,
                2700
            ],
            [
                2702,
                2721
            ],
            [
                2722,
                2775
            ],
            [
                2775,
                2777
            ],
            [
                2777,
                2843
            ],
            [
                2855,
                2886
            ],
            [
                2899,
                2979
            ],
            [
                2982,
                3022
            ],
            [
                3028,
                3029
            ],
            [
                3040,
                3051
            ],
            [
                3056,
                3123
            ],
            [
                3123,
                3177
            ],
            [
                3178,
                3182
            ],
            [
                3182,
                3184
            ],
            [
                3184,
                3211
            ],
            [
                3212,
                3220
            ],
            [
                3228,
                3268
            ],
            [
                3268,
                3270
            ],
            [
                3270,
                3285
            ],
            [
                3289,
                3310
            ],
            [
                3313,
                3323
            ],
            [
                3325,
                3330
            ],
            [
                3330,
                3350
            ],
            [
                3350,
                3420
            ],
            [
                3424,
                3457
            ],
            [
                3460,
                3473
            ],
            [
                3475,
                3478
            ],
            [
                3482,
                3484
            ],
            [
                3494,
                3497
            ],
            [
                3497,
                3498
            ],
            [
                3499,
                3542
            ],
            [
                3542,
                3552
            ],
            [
                3559,
                3566
            ],
            [
                3573,
                3603
            ],
            [
                3604,
                3657
            ],
            [
                3657,
                3678
            ],
            [
                3690,
                3710
            ],
            [
                3715,
                3717
            ],
            [
                3718,
                3721
            ],
            [
                3722,
                3752
            ],
            [
                3752,
                3800
            ],
            [
                3800,
                3824
            ],
            [
                3831,
                3862
            ],
            [
                3863,
                3889
            ],
            [
                3897,
                3899
            ],
            [
                3899,
                3913
            ],
            [
                3924,
                3986
            ],
            [
                3986,
                3995
            ],
            [
                3996,
                4019
            ],
            [
                4020,
                4062
            ],
            [
                4066,
                4073
            ],
            [
                4076,
                4090
            ],
            [
                4092,
                4151
            ],
            [
                4158,
                4246
            ],
            [
                4254,
                4257
            ],
            [
                4258,
                4261
            ],
            [
                4262,
                4270
            ],
            [
                4274,
                4313
            ],
            [
                4316,
                4325
            ],
            [
                4326,
                4337
            ],
            [
                4337,
                4359
            ],
            [
                4359,
                4367
            ],
            [
                4368,
                4441
            ],
            [
                4467,
                4469
            ],
            [
                4469,
                4470
            ],
            [
                4471,
                4509
            ],
            [
                4510,
                4515
            ],
            [
                4516,
                4519
            ],
            [
                4520,
                4524
            ],
            [
                4524,
                4525
            ],
            [
                4526,
                4570
            ],
            [
                4583,
                4642
            ],
            [
                4642,
                4686
            ],
            [
                4687,
                4692
            ],
            [
                4696,
                4722
            ],
            [
                4722,
                4724
            ],
            [
                4724,
                4727
            ],
            [
                4734,
                4736
            ],
            [
                4737,
                4739
            ],
            [
                4743,
                4813
            ],
            [
                4816,
                4830
            ],
            [
                4830,
                4832
            ],
            [
                4833,
                4879
            ],
            [
                4883,
                4933
            ],
            [
                4936,
                4955
            ],
            [
                4956,
                4968
            ],
            [
                4969,
                5001
            ],
            [
                5023,
                5036
            ],
            [
                5039,
                5051
            ],
            [
                5053,
                5070
            ],
            [
                5071,
                5075
            ],
            [
                5075,
                5076
            ],
            [
                5077,
                5085
            ],
            [
                5089,
                5100
            ],
            [
                5101,
                5126
            ],
            [
                5127,
                5145
            ],
            [
                5149,
                5166
            ],
            [
                5170,
                5172
            ],
            [
                5179,
                5244
            ],
            [
                5247,
                5259
            ],
            [
                5264,
                5310
            ],
            [
                5314,
                5321
            ],
            [
                5324,
                5341
            ],
            [
                5346,
                5376
            ],
            [
                5376,
                5379
            ],
            [
                5380,
                5427
            ],
            [
                5427,
                5514
            ],
            [
                5514,
                5522
            ],
            [
                5523,
                5581
            ],
            [
                5585,
                5594
            ],
            [
                5597,
                5608
            ],
            [
                5610,
                5686
            ],
            [
                5686,
                5688
            ],
            [
                5688,
                5716
            ],
            [
                5716,
                5749
            ],
            [
                5749,
                5774
            ],
            [
                5781,
                5835
            ],
            [
                5836,
                5843
            ],
            [
                5844,
                5856
            ],
            [
                5857,
                5875
            ],
            [
                5876,
                5878
            ],
            [
                5884,
                5892
            ],
            [
                5893,
                5895
            ],
            [
                5896,
                5900
            ],
            [
                5901,
                5911
            ],
            [
                5919,
                5950
            ],
            [
                5953,
                5965
            ],
            [
                5967,
                6000
            ],
            [
                6000,
                6002
            ],
            [
                6002,
                6025
            ],
            [
                6029,
                6072
            ],
            [
                6073,
                6082
            ],
            [
                6083,
                6100
            ],
            [
                6101,
                6103
            ],
            [
                6106,
                6108
            ],
            [
                6108,
                6111
            ],
            [
                6112,
                6150
            ],
            [
                6155,
                6215
            ],
            [
                6237,
                6238
            ],
            [
                6244,
                6247
            ],
            [
                6247,
                6249
            ],
            [
                6249,
                6276
            ],
            [
                6284,
                6305
            ],
            [
                6307,
                6459
            ],
            [
                6459,
                6483
            ],
            [
                6483,
                6494
            ],
            [
                6495,
                6580
            ],
            [
                6580,
                6643
            ],
            [
                6644,
                6651
            ],
            [
                6657,
                6667
            ],
            [
                6667,
                6730
            ],
            [
                6730,
                6763
            ],
            [
                6772,
                6795
            ],
            [
                6796,
                6840
            ],
            [
                6841,
                6842
            ],
            [
                6848,
                6849
            ],
            [
                6870,
                6958
            ],
            [
                6958,
                7003
            ],
            [
                7012,
                7015
            ],
            [
                7039,
                7051
            ],
            [
                7053,
                7091
            ],
            [
                7092,
                7130
            ],
            [
                7140,
                7172
            ],
            [
                7172,
                7179
            ],
            [
                7180,
                7221
            ],
            [
                7221,
                7268
            ],
            [
                7277,
                7279
            ],
            [
                7293,
                7358
            ],
            [
                7358,
                7366
            ],
            [
                7379,
                7430
            ],
            [
                7430,
                7436
            ],
            [
                7447,
                7548
            ],
            [
                7548,
                7623
            ],
            [
                7636,
                7650
            ],
            [
                7656,
                7657
            ],
            [
                7658,
                7668
            ],
            [
                7671,
                7678
            ],
            [
                7680,
                7708
            ],
            [
                7710,
                7804
            ],
            [
                7804,
                7855
            ],
            [
                7861,
                7863
            ],
            [
                7863,
                7945
            ],
            [
                7954,
                7965
            ],
            [
                7968,
                8005
            ],
            [
                8013,
                8015
            ],
            [
                8019,
                8021
            ],
            [
                8030,
                8055
            ],
            [
                8055,
                8075
            ],
            [
                8075,
                8085
            ],
            [
                8086,
                8105
            ],
            [
                8105,
                8199
            ],
            [
                8199,
                8238
            ],
            [
                8244,
                8285
            ],
            [
                8285,
                8287
            ],
            [
                8296,
                8319
            ],
            [
                8319,
                8346
            ],
            [
                8347,
                8372
            ],
            [
                8377,
                8393
            ],
            [
                8393,
                8399
            ],
            [
                8400,
                8404
            ],
            [
                8405,
                8461
            ],
            [
                8461,
                8524
            ],
            [
                8533,
                8540
            ],
            [
                8543,
                8560
            ],
            [
                8561,
                8640
            ],
            [
                8640,
                8689
            ],
            [
                8690,
                8729
            ],
            [
                8735,
                8752
            ],
            [
                8752,
                8754
            ],
            [
                8754,
                8817
            ],
            [
                8825,
                8832
            ],
            [
                8835,
                8837
            ],
            [
                8838,
                8886
            ],
            [
                8886,
                8887
            ],
            [
                8889,
                8905
            ],
            [
                8905,
                8921
            ],
            [
                8921,
                8994
            ],
            [
                8994,
                9087
            ],
            [
                9094,
                9133
            ],
            [
                9136,
                9143
            ],
            [
                9154,
                9165
            ],
            [
                9170,
                9210
            ],
            [
                9214,
                9227
            ],
            [
                9230,
                9244
            ],
            [
                9244,
                9246
            ],
            [
                9247,
                9270
            ],
            [
                9270,
                9273
            ],
            [
                9274,
                9278
            ],
            [
                9284,
                9286
            ],
            [
                9287,
                9329
            ],
            [
                9329,
                9343
            ],
            [
                9349,
                9404
            ],
            [
                9405,
                9472
            ],
            [
                9473,
                9532
            ],
            [
                9532,
                9616
            ],
            [
                9617,
                9632
            ],
            [
                9633,
                9673
            ],
            [
                9673,
                9706
            ],
            [
                9707,
                9721
            ],
            [
                9721,
                9723
            ],
            [
                9723,
                9780
            ],
            [
                9781,
                9790
            ],
            [
                9790,
                9829
            ],
            [
                9838,
                9842
            ],
            [
                9842,
                9844
            ],
            [
                9844,
                9875
            ],
            [
                9875,
                9929
            ],
            [
                9930,
                10023
            ],
            [
                10035,
                10043
            ],
            [
                10046,
                10057
            ],
            [
                10057,
                10058
            ],
            [
                10059,
                10062
            ],
            [
                10084,
                10095
            ],
            [
                10095,
                10096
            ],
            [
                10107,
                10118
            ],
            [
                10118,
                10119
            ],
            [
                10121,
                10125
            ],
            [
                10126,
                10132
            ],
            [
                10136,
                10182
            ],
            [
                10185,
                10192
            ],
            [
                10197,
                10214
            ],
            [
                10214,
                10216
            ],
            [
                10217,
                10263
            ],
            [
                10269,
                10314
            ],
            [
                10330,
                10382
            ],
            [
                10385,
                10405
            ],
            [
                10408,
                10450
            ],
            [
                10459,
                10461
            ],
            [
                10461,
                10466
            ],
            [
                10467,
                10474
            ],
            [
                10475,
                10591
            ],
            [
                10591,
                10593
            ],
            [
                10593,
                10627
            ],
            [
                10627,
                10629
            ],
            [
                10629,
                10699
            ],
            [
                10699,
                10745
            ],
            [
                10745,
                10784
            ],
            [
                10784,
                10818
            ],
            [
                10819,
                10827
            ],
            [
                10828,
                10830
            ],
            [
                10831,
                10842
            ],
            [
                10842,
                10906
            ],
            [
                10906,
                10958
            ],
            [
                10959,
                10963
            ],
            [
                10964,
                10967
            ],
            [
                10976,
                10978
            ],
            [
                10978,
                11122
            ],
            [
                11124,
                11157
            ],
            [
                11157,
                11159
            ],
            [
                11159,
                11183
            ],
            [
                11183,
                11208
            ],
            [
                11208,
                11214
            ],
            [
                11217,
                11249
            ],
            [
                11250,
                11285
            ],
            [
                11290,
                11305
            ],
            [
                11344,
                11346
            ],
            [
                11349,
                11352
            ],
            [
                11362,
                11385
            ],
            [
                11391,
                11445
            ],
            [
                11446,
                11449
            ],
            [
                11455,
                11456
            ],
            [
                11457,
                11480
            ],
            [
                11480,
                11507
            ],
            [
                11508,
                11517
            ],
            [
                11518,
                11526
            ],
            [
                11535,
                11552
            ],
            [
                11552,
                11553
            ],
            [
                11554,
                11557
            ],
            [
                11563,
                11619
            ],
            [
                11619,
                11620
            ],
            [
                11621,
                11691
            ],
            [
                11698,
                11702
            ],
            [
                11708,
                11725
            ],
            [
                11726,
                11735
            ],
            [
                11736,
                11738
            ],
            [
                11739,
                11745
            ],
            [
                11745,
                11827
            ],
            [
                11835,
                11836
            ],
            [
                11837,
                11844
            ],
            [
                11853,
                11878
            ],
            [
                11878,
                11889
            ],
            [
                11894,
                11955
            ],
            [
                11955,
                11968
            ],
            [
                11969,
                11973
            ],
            [
                11973,
                12032
            ],
            [
                12032,
                12050
            ],
            [
                12050,
                12181
            ],
            [
                12181,
                12197
            ],
            [
                12197,
                12264
            ],
            [
                12265,
                12351
            ],
            [
                12351,
                12367
            ],
            [
                12372,
                12479
            ]
        ],
        "row_chars": [
            [
                0,
                186
            ],
            [
                186,
                201
            ],
            [
                201,
                214
            ],
            [
                214,
                253
            ],
            [
                253,
                418
            ],
            [
                418,
                475
            ],
            [
                475,
                521
            ],
            [
                521,
                533
            ],
            [
                533,
                538
            ],
            [
                538,
                538
            ],
            [
                538,
                588
            ],
            [
                588,
                588
            ],
            [
                588,
                746
            ],
            [
                746,
                746
            ],
            [
                746,
                792
            ],
            [
                792,
                866
            ],
            [
                866,
                951
            ],
            [
                951,
                1012
            ],
            [
                1012,
                1128
            ],
            [
                1128,
                1151
            ],
            [
                1151,
                1284
            ],
            [
                1284,
                1370
            ],
            [
                1370,
                1486
            ],
            [
                1486,
                1575
            ],
            [
                1575,
                1592
            ],
            [
                1592,
                1748
            ],
            [
                1748,
                1828
            ],
            [
                1828,
                1893
            ],
            [
                1893,
                1967
            ],
            [
                1967,
                2063
            ],
            [
                2063,
                2223
            ],
            [
                2223,
                2294
            ],
            [
                2294,
                2346
            ],
            [
                2346,
                2503
            ],
            [
                2503,
                2777
            ],
            [
                2777,
                2982
            ],
            [
                2982,
                3123
            ],
            [
                3123,
                3184
            ],
            [
                3184,
                3220
            ],
            [
                3220,
                3270
            ],
            [
                3270,
                3288
            ],
            [
                3288,
                3350
            ],
            [
                3350,
                3423
            ],
            [
                3423,
                3542
            ],
            [
                3542,
                3657
            ],
            [
                3657,
                3800
            ],
            [
                3800,
                3899
            ],
            [
                3899,
                3986
            ],
            [
                3986,
                4065
            ],
            [
                4065,
                4273
            ],
            [
                4273,
                4316
            ],
            [
                4316,
                4325
            ],
            [
                4325,
                4337
            ],
            [
                4337,
                4359
            ],
            [
                4359,
                4441
            ],
            [
                4441,
                4570
            ],
            [
                4570,
                4570
            ],
            [
                4570,
                4642
            ],
            [
                4642,
                4724
            ],
            [
                4724,
                4742
            ],
            [
                4742,
                4832
            ],
            [
                4832,
                4882
            ],
            [
                4882,
                4936
            ],
            [
                4936,
                4968
            ],
            [
                4968,
                5004
            ],
            [
                5004,
                5052
            ],
            [
                5052,
                5052
            ],
            [
                5052,
                5088
            ],
            [
                5088,
                5148
            ],
            [
                5148,
                5169
            ],
            [
                5169,
                5175
            ],
            [
                5175,
                5259
            ],
            [
                5259,
                5313
            ],
            [
                5313,
                5341
            ],
            [
                5341,
                5376
            ],
            [
                5376,
                5427
            ],
            [
                5427,
                5514
            ],
            [
                5514,
                5584
            ],
            [
                5584,
                5688
            ],
            [
                5688,
                5749
            ],
            [
                5749,
                5914
            ],
            [
                5914,
                6002
            ],
            [
                6002,
                6108
            ],
            [
                6108,
                6249
            ],
            [
                6249,
                6249
            ],
            [
                6249,
                6306
            ],
            [
                6306,
                6459
            ],
            [
                6459,
                6459
            ],
            [
                6459,
                6459
            ],
            [
                6459,
                6495
            ],
            [
                6495,
                6580
            ],
            [
                6580,
                6580
            ],
            [
                6580,
                6667
            ],
            [
                6667,
                6730
            ],
            [
                6730,
                6958
            ],
            [
                6958,
                7052
            ],
            [
                7052,
                7172
            ],
            [
                7172,
                7221
            ],
            [
                7221,
                7358
            ],
            [
                7358,
                7430
            ],
            [
                7430,
                7548
            ],
            [
                7548,
                7653
            ],
            [
                7653,
                7863
            ],
            [
                7863,
                7948
            ],
            [
                7948,
                7968
            ],
            [
                7968,
                8015
            ],
            [
                8015,
                8055
            ],
            [
                8055,
                8075
            ],
            [
                8075,
                8105
            ],
            [
                8105,
                8199
            ],
            [
                8199,
                8285
            ],
            [
                8285,
                8393
            ],
            [
                8393,
                8461
            ],
            [
                8461,
                8527
            ],
            [
                8527,
                8543
            ],
            [
                8543,
                8560
            ],
            [
                8560,
                8640
            ],
            [
                8640,
                8640
            ],
            [
                8640,
                8754
            ],
            [
                8754,
                8817
            ],
            [
                8817,
                8817
            ],
            [
                8817,
                8835
            ],
            [
                8835,
                8905
            ],
            [
                8905,
                8921
            ],
            [
                8921,
                8994
            ],
            [
                8994,
                9090
            ],
            [
                9090,
                9136
            ],
            [
                9136,
                9165
            ],
            [
                9165,
                9213
            ],
            [
                9213,
                9230
            ],
            [
                9230,
                9246
            ],
            [
                9246,
                9270
            ],
            [
                9270,
                9329
            ],
            [
                9329,
                9532
            ],
            [
                9532,
                9673
            ],
            [
                9673,
                9723
            ],
            [
                9723,
                9790
            ],
            [
                9790,
                9844
            ],
            [
                9844,
                9875
            ],
            [
                9875,
                10046
            ],
            [
                10046,
                10193
            ],
            [
                10193,
                10214
            ],
            [
                10214,
                10329
            ],
            [
                10329,
                10385
            ],
            [
                10385,
                10461
            ],
            [
                10461,
                10593
            ],
            [
                10593,
                10629
            ],
            [
                10629,
                10699
            ],
            [
                10699,
                10745
            ],
            [
                10745,
                10784
            ],
            [
                10784,
                10784
            ],
            [
                10784,
                10842
            ],
            [
                10842,
                10906
            ],
            [
                10906,
                10978
            ],
            [
                10978,
                10978
            ],
            [
                10978,
                11124
            ],
            [
                11124,
                11159
            ],
            [
                11159,
                11208
            ],
            [
                11208,
                11217
            ],
            [
                11217,
                11217
            ],
            [
                11217,
                11346
            ],
            [
                11346,
                11457
            ],
            [
                11457,
                11480
            ],
            [
                11480,
                11745
            ],
            [
                11745,
                11878
            ],
            [
                11878,
                11955
            ],
            [
                11955,
                12032
            ],
            [
                12032,
                12050
            ],
            [
                12050,
                12181
            ],
            [
                12181,
                12197
            ],
            [
                12197,
                12351
            ],
            [
                12351,
                12479
            ]
        ]
    }
}