{
    "original": {
        "text": "Another week over-and I am so many days nearer health, and spring! I have now heard all my neighbour's history, at different sittings, as the housekeeper could spare time from more important occupations. I'll continue it in her own words, only a little condensed. She is, on the whole, a very fair narrator, and I don't think I could improve her style.\nIn the evening, she said, the evening of my visit to the Heights, I knew, as well as if I saw him, that Mr. Heathcliff was about the place; and I shunned going out, because I still carried his letter in my pocket, and didn't want to be threatened or teased any more. I had made up my mind not to give it till my master went somewhere, as I could not guess how its receipt would affect Catherine. The consequence was, that it did not reach her before the lapse of three days. The fourth was Sunday, and I brought it into her room after the family were gone to church. There was a manservant left to keep the house with me, and we generally made a practice of locking the doors during the hours of service; but on that occasion the weather was so warm and pleasant that I set them wide open, and, to fulfil my engagement, as I knew who would be coming, I told my companion that the mistress wished very much for some oranges, and he must run over to the village and get a few, to be paid for on the morrow. He departed, and I went upstairs.\nMrs. Linton sat in a loose white dress, with a light shawl over her shoulders, in the recess of the open window, as usual. Her thick, long hair had been partly removed at the beginning of her illness, and now she wore it simply combed in its natural tresses over her temples and neck. Her appearance was altered, as I had told Heathcliff; but when she was calm, there seemed unearthly beauty in the change. The flash of her eyes had been succeeded by a dreamy and melancholy softness; they no longer gave the impression of looking at the objects around her: they appeared always to gaze beyond, and far beyond-you would have said out of this world. Then, the paleness of her face-its haggard aspect having vanished as she recovered flesh-and the peculiar expression arising from her mental state, though painfully suggestive of their causes, added to the touching interest which she awakened; and-invariably to me, I know, and to any person who saw her, I should think-refuted more tangible proofs of convalescence, and stamped her as one doomed to decay.\nA book lay spread on the sill before her, and the scarcely perceptible wind fluttered its leaves at intervals. I believe Linton had laid it there: for she never endeavoured to divert herself with reading, or occupation of any kind, and he would spend many an hour in trying to entice her attention to some subject which had formerly been her amusement. She was conscious of his aim, and in her better moods endured his efforts placidly, only showing their uselessness by now and then suppressing a wearied sigh, and checking him at last with the saddest of smiles and kisses. At other times, she would turn petulantly away, and hide her face in her hands, or even push him off angrily; and then he took care to let her alone, for he was certain of doing no good.\nGimmerton chapel bells were still ringing; and the full, mellow flow of the beck in the valley came soothingly on the ear. It was a sweet substitute for the yet absent murmur of the summer foliage, which drowned that music about the Grange when the trees were in leaf. At Wuthering Heights it always sounded on quiet days following a great thaw or a season of steady rain. And of Wuthering Heights Catherine was thinking as she listened: that is, if she thought or listened at all; but she had the vague, distant look I mentioned before, which expressed no recognition of material things either by ear or eye.\n\"There's a letter for you, Mrs. Linton,\" I said, gently inserting it in one hand that rested on her knee. \"You must read it immediately, because it wants an answer. Shall I break the seal?\" \"Yes,\" she answered, without altering the direction of her eyes. I opened it-it was very short. \"Now,\" I continued, \"read it.\" She drew away her hand, and let it fall. I replaced it in her lap, and stood waiting till it should please her to glance down; but that movement was so long delayed that at last I resumed-\"Must I read it, ma'am? It is from Mr. Heathcliff.\"\nThere was a start and a troubled gleam of recollection, and a struggle to arrange her ideas. She lifted the letter, and seemed to peruse it; and when she came to the signature she sighed: yet still I found she had not gathered its import, for, upon my desiring to hear her reply, she merely pointed to the name, and gazed at me with mournful and questioning eagerness.\n\"Well, he wishes to see you,\" said I, guessing her need of an interpreter. \"He's in the garden by this time, and impatient to know what answer I shall bring.\"\nAs I spoke, I observed a large dog lying on the sunny grass beneath raise its ears as if about to bark, and then smoothing them back, announce, by a wag of the tail, that some one approached whom it did not consider a stranger. Mrs. Linton bent forward, and listened breathlessly. The minute after a step traversed the hall; the open house was too tempting for Heathcliff to resist walking in: most likely he supposed that I was inclined to shirk my promise, and so resolved to trust to his own audacity. With straining eagerness Catherine gazed towards the entrance of her chamber. He did not hit the right room directly: she motioned me to admit him, but he found it out ere I could reach the door, and in a stride or two was at her side, and had her grasped in his arms.\nHe neither spoke nor loosed his hold for some five minutes, during which period he bestowed more kisses than ever he gave in his life before, I daresay: but then my mistress had kissed him first, and I plainly saw that he could hardly bear, for downright agony, to look into her face! The same conviction had stricken him as me, from the instant he beheld her, that there was no prospect of ultimate recovery there-she was fated, sure to die.\n\"Oh, Cathy! Oh, my life! how can I bear it?\" was the first sentence he uttered, in a tone that did not seek to disguise his despair. And now he stared at her so earnestly that I thought the very intensity of his gaze would bring tears into his eyes; but they burned with anguish: they did not melt.\n\"What now?\" said Catherine, leaning back, and returning his look with a suddenly clouded brow: her humour was a mere vane for constantly varying caprices. \"You and Edgar have broken my heart, Heathcliff! And you both come to bewail the deed to me, as if you were the people to be pitied! I shall not pity you, not I. You have killed me-and thriven on it, I think. How strong you are! How many years do you mean to live after I am gone?\"\nHeathcliff had knelt on one knee to embrace her; he attempted to rise, but she seized his hair, and kept him down.\n\"I wish I could hold you,\" she continued, bitterly, \"till we were both dead! I shouldn't care what you suffered. I care nothing for your sufferings. Why shouldn't you suffer? I do! Will you forget me? Will you be happy when I am in the earth? Will you say twenty years hence, 'That's the grave of Catherine Earnshaw? I loved her long ago, and was wretched to lose her; but it is past. I've loved many others since: my children are dearer to me than she was; and, at death, I shall not rejoice that I am going to her: I shall be sorry that I must leave them!' Will you say so, Heathcliff?\"\n\"Don't torture me till I'm as mad as yourself,\" cried he, wrenching his head free, and grinding his teeth.\nThe two, to a cool spectator, made a strange and fearful picture. Well might Catherine deem that heaven would be a land of exile to her, unless with her mortal body she cast away her moral character also. Her present countenance had a wild vindictiveness in its white cheek, and a bloodless lip and scintillating eye; and she retained in her closed fingers a portion of the locks she had been grasping. As to her companion, while raising himself with one hand, he had taken her arm with the other; and so inadequate was his stock of gentleness to the requirements of her condition, that on his letting go I saw four distinct impressions left blue in the colourless skin.\n\"Are you possessed with a devil,\" he pursued, savagely, \"to talk in that manner to me when you are dying? Do you reflect that all those words will be branded in my memory, and eating deeper eternally after you have left me? You know you lie to say I have killed you: and, Catherine, you know that I could as soon forget you as my existence! Is it not sufficient for your infernal selfishness, that while you are at peace I shall writhe in the torments of hell?\"\n\"I shall not be at peace,\" moaned Catherine, recalled to a sense of physical weakness by the violent, unequal throbbing of her heart, which beat visibly and audibly under this excess of agitation. She said nothing further till the paroxysm was over; then she continued, more kindly-\n\"I'm not wishing you greater torment than I have, Heathcliff. I only wish us never to be parted: and should a word of mine distress you hereafter, think I feel the same distress underground, and for my own sake, forgive me! Come here and kneel down again! You never harmed me in your life. Nay, if you nurse anger, that will be worse to remember than my harsh words! Won't you come here again? Do!\"\nHeathcliff went to the back of her chair, and leant over, but not so far as to let her see his face, which was livid with emotion. She bent round to look at him; he would not permit it: turning abruptly, he walked to the fireplace, where he stood, silent, with his back towards us. Mrs. Linton's glance followed him suspiciously: every movement woke a new sentiment in her. After a pause and a prolonged gaze, she resumed; addressing me in accents of indignant disappointment:-\n\"Oh, you see, Nelly, he would not relent a moment to keep me out of the grave. _That_ is how I'm loved! Well, never mind. That is not _my_ Heathcliff. I shall love mine yet; and take him with me: he's in my soul. And,\" added she musingly, \"the thing that irks me most is this shattered prison, after all. I'm tired of being enclosed here. I'm wearying to escape into that glorious world, and to be always there: not seeing it dimly through tears, and yearning for it through the walls of an aching heart: but really with it, and in it. Nelly, you think you are better and more fortunate than I; in full health and strength: you are sorry for me-very soon that will be altered. I shall be sorry for _you_. I shall be incomparably beyond and above you all. I _wonder_ he won't be near me!\" She went on to herself. \"I thought he wished it. Heathcliff, dear! you should not be sullen now. Do come to me, Heathcliff.\"\nIn her eagerness she rose and supported herself on the arm of the chair. At that earnest appeal he turned to her, looking absolutely desperate. His eyes, wide and wet, at last flashed fiercely on her; his breast heaved convulsively. An instant they held asunder, and then how they met I hardly saw, but Catherine made a spring, and he caught her, and they were locked in an embrace from which I thought my mistress would never be released alive: in fact, to my eyes, she seemed directly insensible. He flung himself into the nearest seat, and on my approaching hurriedly to ascertain if she had fainted, he gnashed at me, and foamed like a mad dog, and gathered her to him with greedy jealousy. I did not feel as if I were in the company of a creature of my own species: it appeared that he would not understand, though I spoke to him; so I stood off, and held my tongue, in great perplexity.\nA movement of Catherine's relieved me a little presently: she put up her hand to clasp his neck, and bring her cheek to his as he held her; while he, in return, covering her with frantic caresses, said wildly-\n\"You teach me now how cruel you've been-cruel and false. _Why_ did you despise me? _Why_ did you betray your own heart, Cathy? I have not one word of comfort. You deserve this. You have killed yourself. Yes, you may kiss me, and cry; and wring out my kisses and tears: they'll blight you-they'll damn you. You loved me-then what _right_ had you to leave me? What right-answer me-for the poor fancy you felt for Linton? Because misery and degradation, and death, and nothing that God or Satan could inflict would have parted us, _you_, of your own will, did it. I have not broken your heart-_you_ have broken it; and in breaking it, you have broken mine. So much the worse for me that I am strong. Do I want to live? What kind of living will it be when you-oh, God! would _you_ like to live with your soul in the grave?\"\n\"Let me alone. Let me alone,\" sobbed Catherine. \"If I've done wrong, I'm dying for it. It is enough! You left me too: but I won't upbraid you! I forgive you. Forgive me!\"\n\"It is hard to forgive, and to look at those eyes, and feel those wasted hands,\" he answered. \"Kiss me again; and don't let me see your eyes! I forgive what you have done to me. I love _my_ murderer-but _yours_! How can I?\"\nThey were silent-their faces hid against each other, and washed by each other's tears. At least, I suppose the weeping was on both sides; as it seemed Heathcliff could weep on a great occasion like this.\nI grew very uncomfortable, meanwhile; for the afternoon wore fast away, the man whom I had sent off returned from his errand, and I could distinguish, by the shine of the western sun up the valley, a concourse thickening outside Gimmerton chapel porch.\n\"Service is over,\" I announced. \"My master will be here in half an hour.\"\nHeathcliff groaned a curse, and strained Catherine closer: she never moved.\nEre long I perceived a group of the servants passing up the road towards the kitchen wing. Mr. Linton was not far behind; he opened the gate himself and sauntered slowly up, probably enjoying the lovely afternoon that breathed as soft as summer.\n\"Now he is here,\" I exclaimed. \"For heaven's sake, hurry down! You'll not meet any one on the front stairs. Do be quick; and stay among the trees till he is fairly in.\"\n\"I must go, Cathy,\" said Heathcliff, seeking to extricate himself from his companion's arms. \"But if I live, I'll see you again before you are asleep. I won't stray five yards from your window.\"\n\"You must not go!\" she answered, holding him as firmly as her strength allowed. \"You _shall_ not, I tell you.\"\n\"For one hour,\" he pleaded earnestly.\n\"Not for one minute,\" she replied.\n\"I _must_-Linton will be up immediately,\" persisted the alarmed intruder.\nHe would have risen, and unfixed her fingers by the act-she clung fast, gasping: there was mad resolution in her face.\n\"No!\" she shrieked. \"Oh, don't, don't go. It is the last time! Edgar will not hurt us. Heathcliff, I shall die! I shall die!\"\n\"Damn the fool! There he is,\" cried Heathcliff, sinking back into his seat. \"Hush, my darling! Hush, hush, Catherine! I'll stay. If he shot me so, I'd expire with a blessing on my lips.\"\nAnd there they were fast again. I heard my master mounting the stairs-the cold sweat ran from my forehead: I was horrified.\n\"Are you going to listen to her ravings?\" I said, passionately. \"She does not know what she says. Will you ruin her, because she has not wit to help herself? Get up! You could be free instantly. That is the most diabolical deed that ever you did. We are all done for-master, mistress, and servant.\"\nI wrung my hands, and cried out; and Mr. Linton hastened his step at the noise. In the midst of my agitation, I was sincerely glad to observe that Catherine's arms had fallen relaxed, and her head hung down.\n\"She's fainted, or dead,\" I thought: \"so much the better. Far better that she should be dead, than lingering a burden and a misery-maker to all about her.\"\nEdgar sprang to his unbidden guest, blanched with astonishment and rage. What he meant to do I cannot tell; however, the other stopped all demonstrations, at once, by placing the lifeless-looking form in his arms.\n\"Look there!\" he said. \"Unless you be a fiend, help her first-then you shall speak to me!\"\nHe walked into the parlour, and sat down. Mr. Linton summoned me, and with great difficulty, and after resorting to many means, we managed to restore her to sensation; but she was all bewildered; she sighed, and moaned, and knew nobody. Edgar, in his anxiety for her, forgot her hated friend. I did not. I went, at the earliest opportunity, and besought him to depart; affirming that Catherine was better, and he should hear from me in the morning how she passed the night.\n\"I shall not refuse to go out of doors,\" he answered; \"but I shall stay in the garden: and, Nelly, mind you keep your word to-morrow. I shall be under those larch-trees. Mind! or I pay another visit, whether Linton be in or not.\"\nHe sent a rapid glance through the half-open door of the chamber, and, ascertaining that what I stated was apparently true, delivered the house of his luckless presence.",
        "paragraph_chars": [
            [
                0,
                353
            ],
            [
                353,
                1392
            ],
            [
                1392,
                2448
            ],
            [
                2448,
                3211
            ],
            [
                3211,
                3821
            ],
            [
                3821,
                4378
            ],
            [
                4378,
                4747
            ],
            [
                4747,
                4906
            ],
            [
                4906,
                5680
            ],
            [
                5680,
                6123
            ],
            [
                6123,
                6422
            ],
            [
                6422,
                6859
            ],
            [
                6859,
                6974
            ],
            [
                6974,
                7563
            ],
            [
                7563,
                7670
            ],
            [
                7670,
                8341
            ],
            [
                8341,
                8803
            ],
            [
                8803,
                9086
            ],
            [
                9086,
                9485
            ],
            [
                9485,
                9963
            ],
            [
                9963,
                10876
            ],
            [
                10876,
                11769
            ],
            [
                11769,
                11979
            ],
            [
                11979,
                12799
            ],
            [
                12799,
                12970
            ],
            [
                12970,
                13194
            ],
            [
                13194,
                13398
            ],
            [
                13398,
                13651
            ],
            [
                13651,
                13725
            ],
            [
                13725,
                13801
            ],
            [
                13801,
                14047
            ],
            [
                14047,
                14216
            ],
            [
                14216,
                14411
            ],
            [
                14411,
                14522
            ],
            [
                14522,
                14560
            ],
            [
                14560,
                14595
            ],
            [
                14595,
                14669
            ],
            [
                14669,
                14788
            ],
            [
                14788,
                14914
            ],
            [
                14914,
                15101
            ],
            [
                15101,
                15225
            ],
            [
                15225,
                15524
            ],
            [
                15524,
                15732
            ],
            [
                15732,
                15888
            ],
            [
                15888,
                16102
            ],
            [
                16102,
                16193
            ],
            [
                16193,
                16667
            ],
            [
                16667,
                16897
            ],
            [
                16897,
                17066
            ]
        ],
        "segment_chars": [
            [
                0,
                67
            ],
            [
                67,
                204
            ],
            [
                204,
                264
            ],
            [
                264,
                353
            ],
            [
                353,
                620
            ],
            [
                620,
                749
            ],
            [
                749,
                828
            ],
            [
                828,
                920
            ],
            [
                920,
                1358
            ],
            [
                1358,
                1392
            ],
            [
                1392,
                1515
            ],
            [
                1515,
                1677
            ],
            [
                1677,
                1799
            ],
            [
                1799,
                2041
            ],
            [
                2041,
                2448
            ],
            [
                2448,
                2559
            ],
            [
                2559,
                2801
            ],
            [
                2801,
                3024
            ],
            [
                3024,
                3211
            ],
            [
                3211,
                3334
            ],
            [
                3334,
                3480
            ],
            [
                3480,
                3584
            ],
            [
                3584,
                3821
            ],
            [
                3821,
                3927
            ],
            [
                3927,
                3986
            ],
            [
                3986,
                4011
            ],
            [
                4011,
                4076
            ],
            [
                4076,
                4107
            ],
            [
                4107,
                4138
            ],
            [
                4138,
                4179
            ],
            [
                4179,
                4350
            ],
            [
                4350,
                4378
            ],
            [
                4378,
                4471
            ],
            [
                4471,
                4747
            ],
            [
                4747,
                4822
            ],
            [
                4822,
                4906
            ],
            [
                4906,
                5134
            ],
            [
                5134,
                5187
            ],
            [
                5187,
                5411
            ],
            [
                5411,
                5489
            ],
            [
                5489,
                5680
            ],
            [
                5680,
                5965
            ],
            [
                5965,
                6123
            ],
            [
                6123,
                6135
            ],
            [
                6135,
                6148
            ],
            [
                6148,
                6168
            ],
            [
                6168,
                6256
            ],
            [
                6256,
                6422
            ],
            [
                6422,
                6434
            ],
            [
                6434,
                6577
            ],
            [
                6577,
                6626
            ],
            [
                6626,
                6710
            ],
            [
                6710,
                6739
            ],
            [
                6739,
                6786
            ],
            [
                6786,
                6806
            ],
            [
                6806,
                6859
            ],
            [
                6859,
                6974
            ],
            [
                6974,
                7051
            ],
            [
                7051,
                7087
            ],
            [
                7087,
                7123
            ],
            [
                7123,
                7149
            ],
            [
                7149,
                7155
            ],
            [
                7155,
                7175
            ],
            [
                7175,
                7217
            ],
            [
                7217,
                7291
            ],
            [
                7291,
                7359
            ],
            [
                7359,
                7533
            ],
            [
                7533,
                7563
            ],
            [
                7563,
                7670
            ],
            [
                7670,
                7736
            ],
            [
                7736,
                7875
            ],
            [
                7875,
                8073
            ],
            [
                8073,
                8341
            ],
            [
                8341,
                8447
            ],
            [
                8447,
                8565
            ],
            [
                8565,
                8682
            ],
            [
                8682,
                8803
            ],
            [
                8803,
                9000
            ],
            [
                9000,
                9086
            ],
            [
                9086,
                9148
            ],
            [
                9148,
                9310
            ],
            [
                9310,
                9342
            ],
            [
                9342,
                9376
            ],
            [
                9376,
                9453
            ],
            [
                9453,
                9480
            ],
            [
                9480,
                9485
            ],
            [
                9485,
                9616
            ],
            [
                9616,
                9767
            ],
            [
                9767,
                9859
            ],
            [
                9859,
                9963
            ],
            [
                9963,
                10042
            ],
            [
                10042,
                10067
            ],
            [
                10067,
                10085
            ],
            [
                10085,
                10114
            ],
            [
                10114,
                10176
            ],
            [
                10176,
                10268
            ],
            [
                10268,
                10302
            ],
            [
                10302,
                10499
            ],
            [
                10499,
                10640
            ],
            [
                10640,
                10668
            ],
            [
                10668,
                10718
            ],
            [
                10718,
                10751
            ],
            [
                10751,
                10775
            ],
            [
                10775,
                10800
            ],
            [
                10800,
                10818
            ],
            [
                10818,
                10848
            ],
            [
                10848,
                10876
            ],
            [
                10876,
                10949
            ],
            [
                10949,
                11020
            ],
            [
                11020,
                11109
            ],
            [
                11109,
                11375
            ],
            [
                11375,
                11571
            ],
            [
                11571,
                11769
            ],
            [
                11769,
                11979
            ],
            [
                11979,
                12036
            ],
            [
                12036,
                12062
            ],
            [
                12062,
                12106
            ],
            [
                12106,
                12138
            ],
            [
                12138,
                12156
            ],
            [
                12156,
                12182
            ],
            [
                12182,
                12285
            ],
            [
                12285,
                12337
            ],
            [
                12337,
                12398
            ],
            [
                12398,
                12540
            ],
            [
                12540,
                12633
            ],
            [
                12633,
                12676
            ],
            [
                12676,
                12695
            ],
            [
                12695,
                12744
            ],
            [
                12744,
                12799
            ],
            [
                12799,
                12814
            ],
            [
                12814,
                12847
            ],
            [
                12847,
                12886
            ],
            [
                12886,
                12900
            ],
            [
                12900,
                12942
            ],
            [
                12942,
                12957
            ],
            [
                12957,
                12970
            ],
            [
                12970,
                13064
            ],
            [
                13064,
                13112
            ],
            [
                13112,
                13148
            ],
            [
                13148,
                13182
            ],
            [
                13182,
                13194
            ],
            [
                13194,
                13281
            ],
            [
                13281,
                13398
            ],
            [
                13398,
                13651
            ],
            [
                13651,
                13683
            ],
            [
                13683,
                13725
            ],
            [
                13725,
                13801
            ],
            [
                13801,
                13892
            ],
            [
                13892,
                14047
            ],
            [
                14047,
                14078
            ],
            [
                14078,
                14110
            ],
            [
                14110,
                14155
            ],
            [
                14155,
                14216
            ],
            [
                14216,
                14309
            ],
            [
                14309,
                14367
            ],
            [
                14367,
                14411
            ],
            [
                14411,
                14430
            ],
            [
                14430,
                14491
            ],
            [
                14491,
                14522
            ],
            [
                14522,
                14560
            ],
            [
                14560,
                14595
            ],
            [
                14595,
                14669
            ],
            [
                14669,
                14788
            ],
            [
                14788,
                14794
            ],
            [
                14794,
                14808
            ],
            [
                14808,
                14830
            ],
            [
                14830,
                14851
            ],
            [
                14851,
                14875
            ],
            [
                14875,
                14900
            ],
            [
                14900,
                14914
            ],
            [
                14914,
                14930
            ],
            [
                14930,
                14990
            ],
            [
                14990,
                15009
            ],
            [
                15009,
                15032
            ],
            [
                15032,
                15043
            ],
            [
                15043,
                15101
            ],
            [
                15101,
                15133
            ],
            [
                15133,
                15225
            ],
            [
                15225,
                15267
            ],
            [
                15267,
                15289
            ],
            [
                15289,
                15323
            ],
            [
                15323,
                15383
            ],
            [
                15383,
                15391
            ],
            [
                15391,
                15420
            ],
            [
                15420,
                15472
            ],
            [
                15472,
                15524
            ],
            [
                15524,
                15604
            ],
            [
                15604,
                15732
            ],
            [
                15732,
                15790
            ],
            [
                15790,
                15888
            ],
            [
                15888,
                15961
            ],
            [
                15961,
                16102
            ],
            [
                16102,
                16116
            ],
            [
                16116,
                16125
            ],
            [
                16125,
                16193
            ],
            [
                16193,
                16235
            ],
            [
                16235,
                16430
            ],
            [
                16430,
                16486
            ],
            [
                16486,
                16497
            ],
            [
                16497,
                16667
            ],
            [
                16667,
                16801
            ],
            [
                16801,
                16837
            ],
            [
                16837,
                16843
            ],
            [
                16843,
                16897
            ],
            [
                16897,
                17066
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                18,
                26
            ],
            [
                40,
                67
            ],
            [
                67,
                133
            ],
            [
                202,
                204
            ],
            [
                204,
                237
            ],
            [
                262,
                264
            ],
            [
                264,
                270
            ],
            [
                286,
                353
            ],
            [
                373,
                377
            ],
            [
                353,
                355
            ],
            [
                379,
                425
            ],
            [
                427,
                450
            ],
            [
                452,
                475
            ],
            [
                497,
                599
            ],
            [
                610,
                620
            ],
            [
                620,
                625
            ],
            [
                642,
                656
            ],
            [
                738,
                747
            ],
            [
                657,
                676
            ],
            [
                686,
                712
            ],
            [
                725,
                737
            ],
            [
                747,
                748
            ],
            [
                753,
                764
            ],
            [
                768,
                769
            ],
            [
                775,
                795
            ],
            [
                816,
                828
            ],
            [
                828,
                838
            ],
            [
                839,
                867
            ],
            [
                873,
                876
            ],
            [
                882,
                920
            ],
            [
                920,
                947
            ],
            [
                956,
                991
            ],
            [
                1019,
                1028
            ],
            [
                1056,
                1141
            ],
            [
                1143,
                1146
            ],
            [
                1171,
                1210
            ],
            [
                1036,
                1039
            ],
            [
                1224,
                1248
            ],
            [
                1259,
                1326
            ],
            [
                1356,
                1358
            ],
            [
                1358,
                1392
            ],
            [
                1392,
                1412
            ],
            [
                1419,
                1470
            ],
            [
                1488,
                1515
            ],
            [
                1515,
                1544
            ],
            [
                1560,
                1626
            ],
            [
                1650,
                1677
            ],
            [
                1677,
                1799
            ],
            [
                1799,
                1881
            ],
            [
                1955,
                1985
            ],
            [
                2029,
                2041
            ],
            [
                2063,
                2066
            ],
            [
                2067,
                2071
            ],
            [
                2130,
                2133
            ],
            [
                2138,
                2157
            ],
            [
                2412,
                2440
            ],
            [
                2446,
                2448
            ],
            [
                2448,
                2489
            ],
            [
                2494,
                2497
            ],
            [
                2519,
                2526
            ],
            [
                2534,
                2544
            ],
            [
                2557,
                2559
            ],
            [
                2559,
                2598
            ],
            [
                2684,
                2724
            ],
            [
                2732,
                2735
            ],
            [
                2749,
                2780
            ],
            [
                2786,
                2789
            ],
            [
                2799,
                2801
            ],
            [
                2835,
                2854
            ],
            [
                2801,
                2804
            ],
            [
                2855,
                2889
            ],
            [
                2919,
                2963
            ],
            [
                2973,
                3024
            ],
            [
                3024,
                3132
            ],
            [
                3209,
                3211
            ],
            [
                3211,
                3261
            ],
            [
                3268,
                3291
            ],
            [
                3306,
                3334
            ],
            [
                3480,
                3558
            ],
            [
                3571,
                3584
            ],
            [
                3584,
                3692
            ],
            [
                3697,
                3704
            ],
            [
                3709,
                3728
            ],
            [
                3819,
                3821
            ],
            [
                3827,
                3859
            ],
            [
                3862,
                3876
            ],
            [
                3887,
                3892
            ],
            [
                3917,
                3920
            ],
            [
                3897,
                3901
            ],
            [
                3925,
                3927
            ],
            [
                3928,
                3986
            ],
            [
                3986,
                3993
            ],
            [
                4012,
                4015
            ],
            [
                4018,
                4039
            ],
            [
                4074,
                4075
            ],
            [
                4076,
                4107
            ],
            [
                4179,
                4180
            ],
            [
                4209,
                4227
            ],
            [
                4231,
                4237
            ],
            [
                4252,
                4268
            ],
            [
                4203,
                4204
            ],
            [
                4287,
                4289
            ],
            [
                4308,
                4317
            ],
            [
                4327,
                4350
            ],
            [
                4350,
                4375
            ],
            [
                4378,
                4432
            ],
            [
                4469,
                4471
            ],
            [
                4471,
                4507
            ],
            [
                4515,
                4608
            ],
            [
                4615,
                4620
            ],
            [
                4658,
                4747
            ],
            [
                4748,
                4774
            ],
            [
                4777,
                4783
            ],
            [
                4820,
                4822
            ],
            [
                4823,
                4841
            ],
            [
                4854,
                4877
            ],
            [
                4883,
                4889
            ],
            [
                4906,
                4946
            ],
            [
                4947,
                4953
            ],
            [
                4960,
                4965
            ],
            [
                4974,
                4988
            ],
            [
                5010,
                5013
            ],
            [
                5055,
                5058
            ],
            [
                5066,
                5071
            ],
            [
                5072,
                5076
            ],
            [
                5086,
                5134
            ],
            [
                5134,
                5145
            ],
            [
                5164,
                5187
            ],
            [
                5204,
                5210
            ],
            [
                5221,
                5298
            ],
            [
                5409,
                5410
            ],
            [
                5411,
                5463
            ],
            [
                5487,
                5489
            ],
            [
                5611,
                5629
            ],
            [
                5489,
                5491
            ],
            [
                5630,
                5680
            ],
            [
                5680,
                5752
            ],
            [
                5760,
                5836
            ],
            [
                5842,
                5965
            ],
            [
                6014,
                6040
            ],
            [
                6041,
                6070
            ],
            [
                6080,
                6088
            ],
            [
                6094,
                6123
            ],
            [
                6124,
                6135
            ],
            [
                6135,
                6148
            ],
            [
                6148,
                6165
            ],
            [
                6168,
                6212
            ],
            [
                6247,
                6256
            ],
            [
                6264,
                6280
            ],
            [
                6284,
                6293
            ],
            [
                6371,
                6376
            ],
            [
                6363,
                6371
            ],
            [
                6382,
                6401
            ],
            [
                6412,
                6415
            ],
            [
                6352,
                6357
            ],
            [
                6420,
                6422
            ],
            [
                6423,
                6431
            ],
            [
                6434,
                6493
            ],
            [
                6503,
                6515
            ],
            [
                6575,
                6577
            ],
            [
                6578,
                6626
            ],
            [
                6626,
                6638
            ],
            [
                6647,
                6710
            ],
            [
                6710,
                6730
            ],
            [
                6737,
                6739
            ],
            [
                6739,
                6761
            ],
            [
                6790,
                6796
            ],
            [
                6770,
                6775
            ],
            [
                6804,
                6806
            ],
            [
                6806,
                6856
            ],
            [
                6859,
                6879
            ],
            [
                6892,
                6974
            ],
            [
                6975,
                6998
            ],
            [
                7001,
                7014
            ],
            [
                7016,
                7025
            ],
            [
                7027,
                7051
            ],
            [
                7087,
                7123
            ],
            [
                7123,
                7149
            ],
            [
                7149,
                7155
            ],
            [
                7155,
                7175
            ],
            [
                7175,
                7217
            ],
            [
                7217,
                7249
            ],
            [
                7251,
                7289
            ],
            [
                7291,
                7311
            ],
            [
                7341,
                7359
            ],
            [
                7359,
                7530
            ],
            [
                7533,
                7560
            ],
            [
                7567,
                7580
            ],
            [
                7611,
                7670
            ],
            [
                7700,
                7736
            ],
            [
                7899,
                7968
            ],
            [
                7983,
                7995
            ],
            [
                8037,
                8039
            ],
            [
                8005,
                8011
            ],
            [
                8019,
                8026
            ],
            [
                8071,
                8073
            ],
            [
                8079,
                8092
            ],
            [
                8134,
                8151
            ],
            [
                8172,
                8174
            ],
            [
                8252,
                8341
            ],
            [
                8342,
                8372
            ],
            [
                8375,
                8377
            ],
            [
                8387,
                8396
            ],
            [
                8398,
                8447
            ],
            [
                8471,
                8511
            ],
            [
                8531,
                8563
            ],
            [
                8565,
                8682
            ],
            [
                8682,
                8800
            ],
            [
                8804,
                8827
            ],
            [
                8830,
                8847
            ],
            [
                8926,
                8935
            ],
            [
                8948,
                8955
            ],
            [
                8989,
                9000
            ],
            [
                9000,
                9086
            ],
            [
                9087,
                9148
            ],
            [
                9148,
                9193
            ],
            [
                9285,
                9287
            ],
            [
                9209,
                9280
            ],
            [
                9298,
                9310
            ],
            [
                9310,
                9319
            ],
            [
                9340,
                9342
            ],
            [
                9342,
                9376
            ],
            [
                9394,
                9399
            ],
            [
                9406,
                9453
            ],
            [
                9453,
                9480
            ],
            [
                9480,
                9482
            ],
            [
                9485,
                9526
            ],
            [
                9576,
                9584
            ],
            [
                9602,
                9616
            ],
            [
                9616,
                9646
            ],
            [
                9671,
                9731
            ],
            [
                9733,
                9740
            ],
            [
                9746,
                9767
            ],
            [
                9767,
                9814
            ],
            [
                9859,
                9872
            ],
            [
                9895,
                9898
            ],
            [
                9919,
                9921
            ],
            [
                9893,
                9894
            ],
            [
                9936,
                9963
            ],
            [
                9964,
                10042
            ],
            [
                10043,
                10047
            ],
            [
                10049,
                10067
            ],
            [
                10067,
                10085
            ],
            [
                10085,
                10096
            ],
            [
                10098,
                10100
            ],
            [
                10102,
                10114
            ],
            [
                10114,
                10174
            ],
            [
                10188,
                10191
            ],
            [
                10182,
                10187
            ],
            [
                10192,
                10201
            ],
            [
                10203,
                10255
            ],
            [
                10266,
                10268
            ],
            [
                10268,
                10302
            ],
            [
                10302,
                10349
            ],
            [
                10373,
                10409
            ],
            [
                10468,
                10471
            ],
            [
                10355,
                10360
            ],
            [
                10472,
                10478
            ],
            [
                10492,
                10499
            ],
            [
                10499,
                10505
            ],
            [
                10587,
                10640
            ],
            [
                10640,
                10660
            ],
            [
                10662,
                10665
            ],
            [
                10668,
                10678
            ],
            [
                10692,
                10718
            ],
            [
                10718,
                10719
            ],
            [
                10729,
                10748
            ],
            [
                10800,
                10818
            ],
            [
                10818,
                10848
            ],
            [
                10848,
                10873
            ],
            [
                10876,
                10949
            ],
            [
                10972,
                11020
            ],
            [
                11020,
                11043
            ],
            [
                11052,
                11109
            ],
            [
                11109,
                11129
            ],
            [
                11137,
                11147
            ],
            [
                11179,
                11330
            ],
            [
                11343,
                11353
            ],
            [
                11373,
                11374
            ],
            [
                11375,
                11436
            ],
            [
                11447,
                11449
            ],
            [
                11460,
                11528
            ],
            [
                11538,
                11541
            ],
            [
                11549,
                11571
            ],
            [
                11571,
                11591
            ],
            [
                11664,
                11666
            ],
            [
                11594,
                11598
            ],
            [
                11710,
                11726
            ],
            [
                11746,
                11769
            ],
            [
                11769,
                11815
            ],
            [
                11825,
                11849
            ],
            [
                11856,
                11859
            ],
            [
                11880,
                11885
            ],
            [
                11907,
                11917
            ],
            [
                11928,
                11979
            ],
            [
                12007,
                12018
            ],
            [
                12001,
                12006
            ],
            [
                12018,
                12019
            ],
            [
                12025,
                12036
            ],
            [
                12037,
                12040
            ],
            [
                12042,
                12062
            ],
            [
                12063,
                12066
            ],
            [
                12068,
                12106
            ],
            [
                12138,
                12156
            ],
            [
                12156,
                12182
            ],
            [
                12182,
                12212
            ],
            [
                12241,
                12246
            ],
            [
                12275,
                12285
            ],
            [
                12285,
                12298
            ],
            [
                12303,
                12307
            ],
            [
                12309,
                12314
            ],
            [
                12316,
                12337
            ],
            [
                12398,
                12506
            ],
            [
                12508,
                12511
            ],
            [
                12512,
                12540
            ],
            [
                12540,
                12569
            ],
            [
                12570,
                12573
            ],
            [
                12575,
                12633
            ],
            [
                12633,
                12676
            ],
            [
                12676,
                12695
            ],
            [
                12695,
                12744
            ],
            [
                12744,
                12749
            ],
            [
                12751,
                12754
            ],
            [
                12756,
                12796
            ],
            [
                12814,
                12826
            ],
            [
                12829,
                12847
            ],
            [
                12848,
                12886
            ],
            [
                12886,
                12900
            ],
            [
                12900,
                12922
            ],
            [
                12944,
                12957
            ],
            [
                12957,
                12967
            ],
            [
                12971,
                13048
            ],
            [
                13051,
                13064
            ],
            [
                13065,
                13112
            ],
            [
                13112,
                13148
            ],
            [
                13148,
                13154
            ],
            [
                13156,
                13158
            ],
            [
                13160,
                13172
            ],
            [
                13180,
                13182
            ],
            [
                13182,
                13191
            ],
            [
                13194,
                13222
            ],
            [
                13227,
                13281
            ],
            [
                13281,
                13398
            ],
            [
                13398,
                13469
            ],
            [
                13524,
                13535
            ],
            [
                13596,
                13597
            ],
            [
                13619,
                13643
            ],
            [
                13649,
                13651
            ],
            [
                13660,
                13667
            ],
            [
                13670,
                13683
            ],
            [
                13687,
                13722
            ],
            [
                13725,
                13801
            ],
            [
                13810,
                13845
            ],
            [
                13890,
                13892
            ],
            [
                13892,
                13925
            ],
            [
                13954,
                14013
            ],
            [
                14045,
                14047
            ],
            [
                14048,
                14062
            ],
            [
                14065,
                14078
            ],
            [
                14079,
                14110
            ],
            [
                14155,
                14203
            ],
            [
                14217,
                14233
            ],
            [
                14236,
                14251
            ],
            [
                14307,
                14309
            ],
            [
                14310,
                14313
            ],
            [
                14325,
                14367
            ],
            [
                14367,
                14408
            ],
            [
                14412,
                14427
            ],
            [
                14430,
                14491
            ],
            [
                14492,
                14495
            ],
            [
                14497,
                14502
            ],
            [
                14504,
                14519
            ],
            [
                14523,
                14535
            ],
            [
                14538,
                14560
            ],
            [
                14561,
                14579
            ],
            [
                14582,
                14595
            ],
            [
                14596,
                14597
            ],
            [
                14599,
                14603
            ],
            [
                14605,
                14634
            ],
            [
                14637,
                14646
            ],
            [
                14651,
                14658
            ],
            [
                14667,
                14669
            ],
            [
                14669,
                14688
            ],
            [
                14724,
                14725
            ],
            [
                14725,
                14739
            ],
            [
                14739,
                14788
            ],
            [
                14789,
                14791
            ],
            [
                14794,
                14808
            ],
            [
                14809,
                14811
            ],
            [
                14818,
                14830
            ],
            [
                14830,
                14851
            ],
            [
                14851,
                14875
            ],
            [
                14875,
                14898
            ],
            [
                14920,
                14930
            ],
            [
                14930,
                14941
            ],
            [
                14944,
                14990
            ],
            [
                14991,
                15009
            ],
            [
                15009,
                15013
            ],
            [
                15030,
                15032
            ],
            [
                15032,
                15043
            ],
            [
                15043,
                15098
            ],
            [
                15133,
                15225
            ],
            [
                15226,
                15264
            ],
            [
                15267,
                15289
            ],
            [
                15294,
                15323
            ],
            [
                15323,
                15383
            ],
            [
                15383,
                15391
            ],
            [
                15420,
                15472
            ],
            [
                15472,
                15491
            ],
            [
                15524,
                15604
            ],
            [
                15604,
                15606
            ],
            [
                15620,
                15639
            ],
            [
                15650,
                15698
            ],
            [
                15706,
                15732
            ],
            [
                15736,
                15755
            ],
            [
                15758,
                15768
            ],
            [
                15770,
                15790
            ],
            [
                15790,
                15885
            ],
            [
                15888,
                15903
            ],
            [
                15922,
                15923
            ],
            [
                15933,
                15961
            ],
            [
                15961,
                15995
            ],
            [
                16043,
                16050
            ],
            [
                16063,
                16102
            ],
            [
                16103,
                16113
            ],
            [
                16116,
                16125
            ],
            [
                16149,
                16190
            ],
            [
                16193,
                16235
            ],
            [
                16235,
                16284
            ],
            [
                16321,
                16372
            ],
            [
                16377,
                16429
            ],
            [
                16430,
                16451
            ],
            [
                16459,
                16486
            ],
            [
                16486,
                16497
            ],
            [
                16497,
                16537
            ],
            [
                16547,
                16602
            ],
            [
                16603,
                16667
            ],
            [
                16726,
                16752
            ],
            [
                16708,
                16720
            ],
            [
                16754,
                16789
            ],
            [
                16799,
                16801
            ],
            [
                16801,
                16835
            ],
            [
                16905,
                16906
            ],
            [
                16913,
                16919
            ],
            [
                16928,
                16931
            ],
            [
                16942,
                16946
            ],
            [
                16961,
                16962
            ],
            [
                16897,
                16899
            ],
            [
                17065,
                17066
            ]
        ],
        "row_chars": [
            [
                0,
                67
            ],
            [
                67,
                204
            ],
            [
                204,
                264
            ],
            [
                264,
                353
            ],
            [
                353,
                620
            ],
            [
                620,
                749
            ],
            [
                749,
                828
            ],
            [
                828,
                920
            ],
            [
                920,
                1358
            ],
            [
                1358,
                1392
            ],
            [
                1392,
                1515
            ],
            [
                1515,
                1677
            ],
            [
                1677,
                1799
            ],
            [
                1799,
                2041
            ],
            [
                2041,
                2448
            ],
            [
                2448,
                2559
            ],
            [
                2559,
                2801
            ],
            [
                2801,
                3024
            ],
            [
                3024,
                3211
            ],
            [
                3211,
                3334
            ],
            [
                3334,
                3480
            ],
            [
                3480,
                3584
            ],
            [
                3584,
                3821
            ],
            [
                3821,
                3927
            ],
            [
                3927,
                3986
            ],
            [
                3986,
                4011
            ],
            [
                4011,
                4076
            ],
            [
                4076,
                4107
            ],
            [
                4107,
                4138
            ],
            [
                4138,
                4179
            ],
            [
                4179,
                4350
            ],
            [
                4350,
                4378
            ],
            [
                4378,
                4471
            ],
            [
                4471,
                4747
            ],
            [
                4747,
                4822
            ],
            [
                4822,
                4906
            ],
            [
                4906,
                5134
            ],
            [
                5134,
                5187
            ],
            [
                5187,
                5411
            ],
            [
                5411,
                5489
            ],
            [
                5489,
                5680
            ],
            [
                5680,
                5965
            ],
            [
                5965,
                6123
            ],
            [
                6123,
                6135
            ],
            [
                6135,
                6148
            ],
            [
                6148,
                6168
            ],
            [
                6168,
                6256
            ],
            [
                6256,
                6422
            ],
            [
                6422,
                6434
            ],
            [
                6434,
                6577
            ],
            [
                6577,
                6626
            ],
            [
                6626,
                6710
            ],
            [
                6710,
                6739
            ],
            [
                6739,
                6806
            ],
            [
                6806,
                6859
            ],
            [
                6859,
                6974
            ],
            [
                6974,
                7051
            ],
            [
                7051,
                7087
            ],
            [
                7087,
                7123
            ],
            [
                7123,
                7149
            ],
            [
                7149,
                7155
            ],
            [
                7155,
                7175
            ],
            [
                7175,
                7217
            ],
            [
                7217,
                7359
            ],
            [
                7359,
                7533
            ],
            [
                7533,
                7563
            ],
            [
                7563,
                7670
            ],
            [
                7670,
                7736
            ],
            [
                7736,
                7875
            ],
            [
                7875,
                8073
            ],
            [
                8073,
                8341
            ],
            [
                8341,
                8447
            ],
            [
                8447,
                8565
            ],
            [
                8565,
                8682
            ],
            [
                8682,
                8803
            ],
            [
                8803,
                9000
            ],
            [
                9000,
                9086
            ],
            [
                9086,
                9148
            ],
            [
                9148,
                9310
            ],
            [
                9310,
                9342
            ],
            [
                9342,
                9376
            ],
            [
                9376,
                9453
            ],
            [
                9453,
                9480
            ],
            [
                9480,
                9485
            ],
            [
                9485,
                9616
            ],
            [
                9616,
                9767
            ],
            [
                9767,
                9963
            ],
            [
                9963,
                10042
            ],
            [
                10042,
                10067
            ],
            [
                10067,
                10085
            ],
            [
                10085,
                10114
            ],
            [
                10114,
                10176
            ],
            [
                10176,
                10268
            ],
            [
                10268,
                10302
            ],
            [
                10302,
                10499
            ],
            [
                10499,
                10640
            ],
            [
                10640,
                10668
            ],
            [
                10668,
                10718
            ],
            [
                10718,
                10751
            ],
            [
                10751,
                10775
            ],
            [
                10775,
                10800
            ],
            [
                10800,
                10818
            ],
            [
                10818,
                10848
            ],
            [
                10848,
                10876
            ],
            [
                10876,
                10949
            ],
            [
                10949,
                11020
            ],
            [
                11020,
                11109
            ],
            [
                11109,
                11375
            ],
            [
                11375,
                11571
            ],
            [
                11571,
                11769
            ],
            [
                11769,
                11979
            ],
            [
                11979,
                12036
            ],
            [
                12036,
                12062
            ],
            [
                12062,
                12106
            ],
            [
                12106,
                12138
            ],
            [
                12138,
                12156
            ],
            [
                12156,
                12182
            ],
            [
                12182,
                12285
            ],
            [
                12285,
                12337
            ],
            [
                12337,
                12398
            ],
            [
                12398,
                12540
            ],
            [
                12540,
                12633
            ],
            [
                12633,
                12676
            ],
            [
                12676,
                12695
            ],
            [
                12695,
                12744
            ],
            [
                12744,
                12799
            ],
            [
                12799,
                12814
            ],
            [
                12814,
                12847
            ],
            [
                12847,
                12886
            ],
            [
                12886,
                12900
            ],
            [
                12900,
                12957
            ],
            [
                12957,
                12970
            ],
            [
                12970,
                13064
            ],
            [
                13064,
                13112
            ],
            [
                13112,
                13148
            ],
            [
                13148,
                13182
            ],
            [
                13182,
                13194
            ],
            [
                13194,
                13281
            ],
            [
                13281,
                13398
            ],
            [
                13398,
                13651
            ],
            [
                13651,
                13683
            ],
            [
                13683,
                13725
            ],
            [
                13725,
                13801
            ],
            [
                13801,
                13892
            ],
            [
                13892,
                14047
            ],
            [
                14047,
                14078
            ],
            [
                14078,
                14110
            ],
            [
                14110,
                14155
            ],
            [
                14155,
                14216
            ],
            [
                14216,
                14309
            ],
            [
                14309,
                14367
            ],
            [
                14367,
                14411
            ],
            [
                14411,
                14430
            ],
            [
                14430,
                14491
            ],
            [
                14491,
                14522
            ],
            [
                14522,
                14560
            ],
            [
                14560,
                14595
            ],
            [
                14595,
                14669
            ],
            [
                14669,
                14788
            ],
            [
                14788,
                14794
            ],
            [
                14794,
                14808
            ],
            [
                14808,
                14830
            ],
            [
                14830,
                14851
            ],
            [
                14851,
                14875
            ],
            [
                14875,
                14900
            ],
            [
                14900,
                14914
            ],
            [
                14914,
                14930
            ],
            [
                14930,
                14990
            ],
            [
                14990,
                15009
            ],
            [
                15009,
                15032
            ],
            [
                15032,
                15043
            ],
            [
                15043,
                15101
            ],
            [
                15101,
                15133
            ],
            [
                15133,
                15225
            ],
            [
                15225,
                15267
            ],
            [
                15267,
                15289
            ],
            [
                15289,
                15323
            ],
            [
                15323,
                15383
            ],
            [
                15383,
                15391
            ],
            [
                15391,
                15420
            ],
            [
                15420,
                15472
            ],
            [
                15472,
                15524
            ],
            [
                15524,
                15604
            ],
            [
                15604,
                15732
            ],
            [
                15732,
                15790
            ],
            [
                15790,
                15888
            ],
            [
                15888,
                15961
            ],
            [
                15961,
                16102
            ],
            [
                16102,
                16116
            ],
            [
                16116,
                16125
            ],
            [
                16125,
                16193
            ],
            [
                16193,
                16235
            ],
            [
                16235,
                16430
            ],
            [
                16430,
                16486
            ],
            [
                16486,
                16497
            ],
            [
                16497,
                16667
            ],
            [
                16667,
                16801
            ],
            [
                16801,
                16837
            ],
            [
                16837,
                16843
            ],
            [
                16843,
                16897
            ],
            [
                16897,
                17066
            ]
        ]
    },
    "abridged": {
        "text": "Another week over, and I am nearer health, and spring! I have now heard all my neighbour's history, at different sittings. I'll continue it in her own words. She is a very fair narrator, and I don't think I could improve her style.\nMrs. Dean said: In the evening of my visit to the Heights, I knew as well as if I saw him that Mr. Heathcliff was around Thrushcross Grange. I shunned going out, because I still carried his letter in my pocket, and didn't want to be threatened any more. I had decided not to give it to Catherine till my master went out, as I could not guess how it would affect her.\nIn consequence, it did not reach her for three days. The fourth day was Sunday, and I brought it to her after the family were gone to church. There was a manservant left in the house with me, and we generally locked the doors; but on that occasion the weather was so warm and pleasant that I set them wide open; and, as I knew who would be coming, I told the servant that the mistress wished for some oranges, and he must run over to the village and get a few. He departed, and I went upstairs.\nMrs. Linton sat in a white dress, with a light shawl over her shoulders, by the open window, as usual. Her thick, long hair had been cut at the beginning of her illness, and now she wore it simply combed over her temples and neck. Her appearance was altered, as I had told Heathcliff; but when she was calm, there seemed unearthly beauty in the change. The flash of her eyes had been succeeded by a dreamy and melancholy softness; they appeared always to gaze beyond this world. Her pale face and peculiar expression stamped her as one doomed to die.\nA book lay spread on the sill before her, the wind fluttering its leaves. I believe Linton had laid it there: for he would spend many an hour in trying to interest her in some subject which had formerly amused her. In her better moods she endured his efforts placidly, only now and then suppressing a wearied sigh, and stopping him at last with the saddest of smiles and kisses. At other times, she would turn petulantly away, and hide her face in her hands, or even push him off angrily.\nGimmerton chapel bells were still ringing; and the mellow flow of the beck came soothingly on the ear. At Wuthering Heights it always sounded on quiet days following a great thaw or steady rain. And of Wuthering Heights Catherine was thinking as she listened: that is, if she thought or listened at all; she had a vague, distant look.\n'There's a letter for you, Mrs. Linton,' I said, gently putting it in her hand. 'You must read it immediately, because it wants an answer. Shall I open it?'\n'Yes,' she answered, without looking at it.\nI opened it - it was very short. Then I stood waiting till she should glance down; but she did not, so at last I said, 'Must I read it, ma'am? It is from Mr. Heathcliff.'\nThere was a start and a troubled gleam of recollection. She lifted the letter, and seemed to read it; and when she came to the signature she sighed: yet still I found she had not gathered its meaning, for she merely pointed to the name, and gazed at me with mournful and questioning eagerness.\n'Well, he wishes to see you,' said I. 'He's in the garden, and impatient to know your answer.'\nAs I spoke, I observed a large dog lying outside on the grass raise its ears and wag its tail, announcing that someone approached whom it did not consider a stranger. Mrs. Linton listened breathlessly. A step crossed the hall; the open house was too tempting for Heathcliff to resist walking in.\nWith straining eagerness Catherine gazed towards the doorway. In a stride or two he was at her side, and had her grasped in his arms.\nHe neither spoke nor loosed his hold for some five minutes, during which time he bestowed more kisses than ever he gave in his life before, I daresay: but my mistress had kissed him first, and I plainly saw that he could hardly bear, for downright agony, to look into her face! The instant he beheld her, he knew that there was no prospect of recovery - she was fated, sure to die.\n'Oh, Cathy! Oh, my life! how can I bear it?' was the first sentence he uttered, in a tone of despair. He stared at her earnestly; but his eyes burned with anguish, not with tears.\n'What now?' said Catherine, leaning back, and returning his look with a clouded brow. 'You and Edgar have broken my heart, Heathcliff! And you both bewail the deed to me, as if you were the people to be pitied! I shall not pity you. You have killed me - and grown strong on it! How many years do you mean to live after I am gone?'\nHeathcliff had knelt to embrace her; he attempted to rise, but she seized his hair, and kept him down.\n'I wish I could hold you,' she continued bitterly, 'till we were both dead! I care nothing for your sufferings. Why shouldn't you suffer? I do! Will you forget me? Will you be happy when I am in the earth? Will you say twenty years hence, \"That's the grave of Catherine Earnshaw - I loved her long ago; but it is past. I've loved many others since: my children are dearer to me than she was; and, at death, I shall not rejoice that I am going to her: I shall be sorry that I must leave them!\" Will you say so, Heathcliff?'\n'Don't torture me,' cried he, wrenching his head free, and grinding his teeth.\nThey made a strange and fearful picture. Catherine's face had a wild vindictiveness in its white cheek, and a bloodless lip and glittering eye; and she still held some of his hair in her fingers. Her companion had taken her arm so roughly that on his letting go I saw four distinct impressions left blue in the colourless skin.\n'Are you possessed with a devil,' he said savagely, 'to talk in that manner to me when you are dying? Those words will be branded in my memory eternally after you have left me. You know you lie to say I have killed you: and, Catherine, you know that I could as soon forget you as my existence! Is it not sufficient for your infernal selfishness, that while you are at peace I shall writhe in the torments of hell?'\n'I shall not be at peace,' moaned Catherine, her heart beating visibly in her agitation. She said nothing further till the paroxysm was over; then she continued, more kindly-\n'I'm not wishing you greater torment than I have, Heathcliff. I only wish us never to be parted: and should my words distress you hereafter, think I feel the same distress underground, and forgive me! Come here! You never harmed me in your life. Your anger will be worse to remember than my harsh words! Won't you come here again? Do!'\nHeathcliff went to the back of her chair, his face white with emotion. She bent round to look at him; but turning abruptly, he walked to the fireplace, where he stood silent, his back towards us. Mrs. Linton's glance followed him suspiciously: after a pause she said to me, with indignant disappointment:-\n'Oh, you see, Nelly, he would not relent a moment to keep me out of the grave. That is how I'm loved! Well, never mind. That is not my Heathcliff. I shall love mine yet; and take him with me: he's in my soul.' She added musingly, 'The thing that irks me most is this shattered prison. I'm tired of being enclosed here. I'm wearying to escape into that glorious world: not seeing it dimly through tears, but to be really in it. Nelly, you are sorry for me - very soon that will be altered. I shall be sorry for you. I shall be far beyond and above you all. I wonder he won't be near me! Heathcliff, dear! you should not be sullen now. Do come to me, Heathcliff.'\nIn her eagerness she rose and supported herself on the arm of the chair. He turned to her, looking absolutely desperate. His eyes, wide and wet, flashed fiercely on her; his breast heaved convulsively. An instant they held apart, and then Catherine made a spring, and he caught her, and they were locked in an embrace from which I thought my mistress would never be released alive: in fact, she seemed unconscious.\nHe flung himself into the nearest seat, and on my approaching to see if she had fainted, he gnashed at me, and foamed like a mad dog, and held her with greedy jealousy. I did not feel as if he were human; so I stood off, in great perplexity.\nA movement of Catherine's relieved me a little: she put up her hand to his cheek; while he, covering her with frantic caresses, said wildly-\n'You've been cruel - cruel and false. Why did you despise me? Why did you betray your own heart, Cathy? You deserve this. You have killed yourself. Yes, you may kiss me, and cry; your tears will damn you. You loved me - what right had you to leave me? Because misery and degradation, and death, and nothing that God or Satan could inflict would have parted us, you, of your own will, did it. I have not broken your heart - you have broken it; and in breaking it, you have broken mine. So much the worse for me that I am strong. Do I want to live? What kind of living will it be when you - oh, God! would you like to live with your soul in the grave?'\n'Let me alone,' sobbed Catherine. 'If I've done wrong, I'm dying for it. It is enough! You left me too: but I forgive you. Forgive me!'\n'It is hard to forgive, and to look at those eyes, and feel those wasted hands,' he answered. 'Kiss me again; and don't let me see your eyes! I forgive what you have done to me. I love my murderer - but yours! How can I?'\nThey were silent - their faces hidden against each other, and washed by each other's tears. At least, I suppose the weeping was on both sides; as it seemed Heathcliff could weep on a great occasion like this.\nI grew very uncomfortable, meanwhile; for the afternoon wore fast away, and I could see a crowd outside Gimmerton chapel.\n'Service is over,' I announced. 'My master will be here in half an hour.'\nHeathcliff groaned a curse, and strained Catherine closer: she never moved.\nSoon I perceived a group of the servants approaching. Mr. Linton was not far behind; he sauntered slowly up, probably enjoying the lovely afternoon.\n'Now he is here,' I exclaimed. 'For heaven's sake, hurry down! Do be quick; and stay among the trees till he is inside.'\n'I must go, Cathy,' said Heathcliff. 'But I'll see you again before you are asleep. I won't stray five yards from your window.'\n'You must not go!' she answered, holding him as firmly as her strength allowed. 'You shall not, I tell you.'\n'For one hour,' he pleaded earnestly.\n'Not for one minute,' she replied.\n'I must - Linton will be up immediately,' he persisted, alarmed.\nHe would have risen - but she clung fast to him, gasping: there was mad resolution in her face.\n'No!' she shrieked. 'Oh, don't go. It is the last time! Edgar will not hurt us. Heathcliff, I shall die!'\n'Damn the fool! There he is,' cried Heathcliff, sinking back into his seat. 'Hush, my darling! Hush! I'll stay. If he shot me so, I'd expire with a blessing on my lips.'\nI heard my master mounting the stairs - the cold sweat ran from my forehead: I was horrified.\n'Are you going to listen to her ravings?' I said, passionately. 'She does not know what she says. Will you ruin her, because she has not wit to help herself? Get up! That is the most diabolical deed that ever you did. We are all done for.'\nI wrung my hands, and cried out; and Mr. Linton hastened his step at the noise. In my agitation, I was glad to observe that Catherine's arms had fallen limp, and her head hung down.\n'She's fainted, or dead,' I thought: 'so much the better. Far better that she should be dead, than lingering a burden and a misery-maker to all about her.'\nEdgar sprang to Heathcliff, pale with astonishment and rage. What he meant to do I cannot tell; Heathcliff at once placed the lifeless-looking form in his arms.\n'Look there!' he said. 'Help her first - then you shall speak to me!'\nHe walked into the parlour, and sat down. Mr. Linton summoned me, and with great difficulty we managed to restore her to sensation; but she was bewildered; she sighed, and moaned, and knew nobody.\nEdgar, in his anxiety, forgot her hated friend. I did not. I went, at the earliest opportunity, and begged him to depart; affirming that Catherine was better, and that he should hear from me in the morning how she passed the night.\n'I shall stay in the garden,' he answered; 'and, Nelly, mind you keep your word tomorrow. I shall be under those larch-trees.'\nWith a last glance at the door, he left.",
        "paragraph_chars": [
            [
                0,
                232
            ],
            [
                232,
                599
            ],
            [
                599,
                1094
            ],
            [
                1094,
                1645
            ],
            [
                1645,
                2134
            ],
            [
                2134,
                2469
            ],
            [
                2469,
                2626
            ],
            [
                2626,
                2670
            ],
            [
                2670,
                2841
            ],
            [
                2841,
                3135
            ],
            [
                3135,
                3230
            ],
            [
                3230,
                3526
            ],
            [
                3526,
                3660
            ],
            [
                3660,
                4042
            ],
            [
                4042,
                4222
            ],
            [
                4222,
                4553
            ],
            [
                4553,
                4656
            ],
            [
                4656,
                5179
            ],
            [
                5179,
                5258
            ],
            [
                5258,
                5586
            ],
            [
                5586,
                6001
            ],
            [
                6001,
                6176
            ],
            [
                6176,
                6512
            ],
            [
                6512,
                6818
            ],
            [
                6818,
                7480
            ],
            [
                7480,
                7895
            ],
            [
                7895,
                8137
            ],
            [
                8137,
                8278
            ],
            [
                8278,
                8929
            ],
            [
                8929,
                9065
            ],
            [
                9065,
                9287
            ],
            [
                9287,
                9496
            ],
            [
                9496,
                9618
            ],
            [
                9618,
                9692
            ],
            [
                9692,
                9768
            ],
            [
                9768,
                9917
            ],
            [
                9917,
                10038
            ],
            [
                10038,
                10166
            ],
            [
                10166,
                10275
            ],
            [
                10275,
                10313
            ],
            [
                10313,
                10348
            ],
            [
                10348,
                10413
            ],
            [
                10413,
                10509
            ],
            [
                10509,
                10615
            ],
            [
                10615,
                10785
            ],
            [
                10785,
                10879
            ],
            [
                10879,
                11119
            ],
            [
                11119,
                11301
            ],
            [
                11301,
                11457
            ],
            [
                11457,
                11618
            ],
            [
                11618,
                11688
            ],
            [
                11688,
                11885
            ],
            [
                11885,
                12117
            ],
            [
                12117,
                12244
            ],
            [
                12244,
                12284
            ]
        ],
        "segment_chars": [
            [
                0,
                55
            ],
            [
                55,
                123
            ],
            [
                123,
                158
            ],
            [
                158,
                232
            ],
            [
                232,
                373
            ],
            [
                373,
                486
            ],
            [
                486,
                599
            ],
            [
                599,
                652
            ],
            [
                652,
                741
            ],
            [
                741,
                1060
            ],
            [
                1060,
                1094
            ],
            [
                1094,
                1197
            ],
            [
                1197,
                1325
            ],
            [
                1325,
                1447
            ],
            [
                1447,
                1573
            ],
            [
                1573,
                1645
            ],
            [
                1645,
                1719
            ],
            [
                1719,
                1860
            ],
            [
                1860,
                2024
            ],
            [
                2024,
                2134
            ],
            [
                2134,
                2237
            ],
            [
                2237,
                2329
            ],
            [
                2329,
                2469
            ],
            [
                2469,
                2549
            ],
            [
                2549,
                2608
            ],
            [
                2608,
                2626
            ],
            [
                2626,
                2670
            ],
            [
                2670,
                2703
            ],
            [
                2703,
                2813
            ],
            [
                2813,
                2841
            ],
            [
                2841,
                2897
            ],
            [
                2897,
                3135
            ],
            [
                3135,
                3173
            ],
            [
                3173,
                3230
            ],
            [
                3230,
                3397
            ],
            [
                3397,
                3432
            ],
            [
                3432,
                3526
            ],
            [
                3526,
                3588
            ],
            [
                3588,
                3660
            ],
            [
                3660,
                3938
            ],
            [
                3938,
                4042
            ],
            [
                4042,
                4054
            ],
            [
                4054,
                4067
            ],
            [
                4067,
                4087
            ],
            [
                4087,
                4144
            ],
            [
                4144,
                4222
            ],
            [
                4222,
                4234
            ],
            [
                4234,
                4308
            ],
            [
                4308,
                4357
            ],
            [
                4357,
                4433
            ],
            [
                4433,
                4455
            ],
            [
                4455,
                4500
            ],
            [
                4500,
                4553
            ],
            [
                4553,
                4656
            ],
            [
                4656,
                4732
            ],
            [
                4732,
                4768
            ],
            [
                4768,
                4794
            ],
            [
                4794,
                4800
            ],
            [
                4800,
                4820
            ],
            [
                4820,
                4862
            ],
            [
                4862,
                4975
            ],
            [
                4975,
                5149
            ],
            [
                5149,
                5179
            ],
            [
                5179,
                5258
            ],
            [
                5258,
                5299
            ],
            [
                5299,
                5454
            ],
            [
                5454,
                5586
            ],
            [
                5586,
                5688
            ],
            [
                5688,
                5763
            ],
            [
                5763,
                5880
            ],
            [
                5880,
                6001
            ],
            [
                6001,
                6090
            ],
            [
                6090,
                6176
            ],
            [
                6176,
                6238
            ],
            [
                6238,
                6377
            ],
            [
                6377,
                6388
            ],
            [
                6388,
                6422
            ],
            [
                6422,
                6480
            ],
            [
                6480,
                6507
            ],
            [
                6507,
                6512
            ],
            [
                6512,
                6583
            ],
            [
                6583,
                6708
            ],
            [
                6708,
                6818
            ],
            [
                6818,
                6897
            ],
            [
                6897,
                6920
            ],
            [
                6920,
                6938
            ],
            [
                6938,
                6965
            ],
            [
                6965,
                7028
            ],
            [
                7028,
                7103
            ],
            [
                7103,
                7137
            ],
            [
                7137,
                7245
            ],
            [
                7245,
                7307
            ],
            [
                7307,
                7333
            ],
            [
                7333,
                7374
            ],
            [
                7374,
                7404
            ],
            [
                7404,
                7422
            ],
            [
                7422,
                7452
            ],
            [
                7452,
                7480
            ],
            [
                7480,
                7553
            ],
            [
                7553,
                7601
            ],
            [
                7601,
                7682
            ],
            [
                7682,
                7895
            ],
            [
                7895,
                8064
            ],
            [
                8064,
                8137
            ],
            [
                8137,
                8278
            ],
            [
                8278,
                8316
            ],
            [
                8316,
                8340
            ],
            [
                8340,
                8382
            ],
            [
                8382,
                8400
            ],
            [
                8400,
                8426
            ],
            [
                8426,
                8483
            ],
            [
                8483,
                8530
            ],
            [
                8530,
                8670
            ],
            [
                8670,
                8763
            ],
            [
                8763,
                8806
            ],
            [
                8806,
                8825
            ],
            [
                8825,
                8876
            ],
            [
                8876,
                8929
            ],
            [
                8929,
                8963
            ],
            [
                8963,
                9002
            ],
            [
                9002,
                9016
            ],
            [
                9016,
                9052
            ],
            [
                9052,
                9065
            ],
            [
                9065,
                9159
            ],
            [
                9159,
                9207
            ],
            [
                9207,
                9243
            ],
            [
                9243,
                9275
            ],
            [
                9275,
                9287
            ],
            [
                9287,
                9379
            ],
            [
                9379,
                9496
            ],
            [
                9496,
                9618
            ],
            [
                9618,
                9650
            ],
            [
                9650,
                9692
            ],
            [
                9692,
                9768
            ],
            [
                9768,
                9822
            ],
            [
                9822,
                9917
            ],
            [
                9917,
                9948
            ],
            [
                9948,
                9980
            ],
            [
                9980,
                10038
            ],
            [
                10038,
                10075
            ],
            [
                10075,
                10122
            ],
            [
                10122,
                10166
            ],
            [
                10166,
                10185
            ],
            [
                10185,
                10246
            ],
            [
                10246,
                10275
            ],
            [
                10275,
                10313
            ],
            [
                10313,
                10348
            ],
            [
                10348,
                10413
            ],
            [
                10413,
                10509
            ],
            [
                10509,
                10515
            ],
            [
                10515,
                10529
            ],
            [
                10529,
                10544
            ],
            [
                10544,
                10565
            ],
            [
                10565,
                10589
            ],
            [
                10589,
                10615
            ],
            [
                10615,
                10631
            ],
            [
                10631,
                10691
            ],
            [
                10691,
                10710
            ],
            [
                10710,
                10716
            ],
            [
                10716,
                10727
            ],
            [
                10727,
                10785
            ],
            [
                10785,
                10879
            ],
            [
                10879,
                10921
            ],
            [
                10921,
                10943
            ],
            [
                10943,
                10977
            ],
            [
                10977,
                11037
            ],
            [
                11037,
                11045
            ],
            [
                11045,
                11097
            ],
            [
                11097,
                11119
            ],
            [
                11119,
                11199
            ],
            [
                11199,
                11301
            ],
            [
                11301,
                11359
            ],
            [
                11359,
                11457
            ],
            [
                11457,
                11518
            ],
            [
                11518,
                11618
            ],
            [
                11618,
                11632
            ],
            [
                11632,
                11641
            ],
            [
                11641,
                11688
            ],
            [
                11688,
                11730
            ],
            [
                11730,
                11885
            ],
            [
                11885,
                11933
            ],
            [
                11933,
                11944
            ],
            [
                11944,
                12117
            ],
            [
                12117,
                12207
            ],
            [
                12207,
                12244
            ],
            [
                12244,
                12284
            ]
        ],
        "overlap_chars": [
            [
                0,
                17
            ],
            [
                19,
                27
            ],
            [
                28,
                55
            ],
            [
                55,
                121
            ],
            [
                121,
                123
            ],
            [
                123,
                156
            ],
            [
                156,
                158
            ],
            [
                158,
                164
            ],
            [
                165,
                232
            ],
            [
                242,
                246
            ],
            [
                248,
                250
            ],
            [
                251,
                297
            ],
            [
                298,
                321
            ],
            [
                322,
                345
            ],
            [
                373,
                475
            ],
            [
                476,
                486
            ],
            [
                486,
                491
            ],
            [
                500,
                514
            ],
            [
                518,
                527
            ],
            [
                528,
                547
            ],
            [
                551,
                577
            ],
            [
                581,
                593
            ],
            [
                597,
                598
            ],
            [
                602,
                613
            ],
            [
                613,
                614
            ],
            [
                615,
                635
            ],
            [
                640,
                652
            ],
            [
                652,
                662
            ],
            [
                667,
                695
            ],
            [
                699,
                702
            ],
            [
                703,
                741
            ],
            [
                741,
                768
            ],
            [
                772,
                807
            ],
            [
                815,
                824
            ],
            [
                824,
                909
            ],
            [
                911,
                914
            ],
            [
                914,
                953
            ],
            [
                954,
                957
            ],
            [
                966,
                990
            ],
            [
                991,
                1058
            ],
            [
                1058,
                1060
            ],
            [
                1060,
                1094
            ],
            [
                1094,
                1114
            ],
            [
                1115,
                1166
            ],
            [
                1170,
                1197
            ],
            [
                1197,
                1226
            ],
            [
                1231,
                1297
            ],
            [
                1298,
                1325
            ],
            [
                1325,
                1447
            ],
            [
                1447,
                1529
            ],
            [
                1530,
                1560
            ],
            [
                1561,
                1573
            ],
            [
                1573,
                1576
            ],
            [
                1582,
                1586
            ],
            [
                1587,
                1590
            ],
            [
                1591,
                1610
            ],
            [
                1611,
                1639
            ],
            [
                1643,
                1645
            ],
            [
                1645,
                1686
            ],
            [
                1687,
                1690
            ],
            [
                1691,
                1698
            ],
            [
                1707,
                1717
            ],
            [
                1717,
                1719
            ],
            [
                1719,
                1758
            ],
            [
                1759,
                1799
            ],
            [
                1809,
                1812
            ],
            [
                1816,
                1847
            ],
            [
                1855,
                1858
            ],
            [
                1858,
                1860
            ],
            [
                1860,
                1879
            ],
            [
                1880,
                1883
            ],
            [
                1884,
                1918
            ],
            [
                1919,
                1963
            ],
            [
                1973,
                2024
            ],
            [
                2024,
                2132
            ],
            [
                2132,
                2134
            ],
            [
                2134,
                2184
            ],
            [
                2185,
                2208
            ],
            [
                2209,
                2237
            ],
            [
                2237,
                2315
            ],
            [
                2316,
                2329
            ],
            [
                2329,
                2437
            ],
            [
                2438,
                2445
            ],
            [
                2448,
                2467
            ],
            [
                2467,
                2469
            ],
            [
                2475,
                2507
            ],
            [
                2510,
                2524
            ],
            [
                2533,
                2538
            ],
            [
                2539,
                2542
            ],
            [
                2543,
                2547
            ],
            [
                2547,
                2549
            ],
            [
                2550,
                2608
            ],
            [
                2608,
                2615
            ],
            [
                2627,
                2630
            ],
            [
                2633,
                2654
            ],
            [
                2668,
                2669
            ],
            [
                2670,
                2703
            ],
            [
                2708,
                2709
            ],
            [
                2710,
                2728
            ],
            [
                2733,
                2739
            ],
            [
                2740,
                2756
            ],
            [
                2768,
                2769
            ],
            [
                2770,
                2772
            ],
            [
                2773,
                2782
            ],
            [
                2790,
                2813
            ],
            [
                2813,
                2838
            ],
            [
                2841,
                2895
            ],
            [
                2895,
                2897
            ],
            [
                2897,
                2933
            ],
            [
                2939,
                3032
            ],
            [
                3040,
                3045
            ],
            [
                3046,
                3135
            ],
            [
                3136,
                3162
            ],
            [
                3165,
                3171
            ],
            [
                3171,
                3173
            ],
            [
                3174,
                3192
            ],
            [
                3192,
                3215
            ],
            [
                3221,
                3227
            ],
            [
                3230,
                3270
            ],
            [
                3279,
                3285
            ],
            [
                3286,
                3291
            ],
            [
                3292,
                3306
            ],
            [
                3307,
                3310
            ],
            [
                3311,
                3314
            ],
            [
                3319,
                3324
            ],
            [
                3336,
                3340
            ],
            [
                3349,
                3397
            ],
            [
                3397,
                3408
            ],
            [
                3409,
                3432
            ],
            [
                3432,
                3438
            ],
            [
                3447,
                3524
            ],
            [
                3524,
                3525
            ],
            [
                3526,
                3578
            ],
            [
                3586,
                3588
            ],
            [
                3588,
                3606
            ],
            [
                3607,
                3609
            ],
            [
                3610,
                3660
            ],
            [
                3660,
                3732
            ],
            [
                3738,
                3814
            ],
            [
                3815,
                3938
            ],
            [
                3938,
                3964
            ],
            [
                3973,
                4002
            ],
            [
                4003,
                4011
            ],
            [
                4012,
                4042
            ],
            [
                4043,
                4054
            ],
            [
                4054,
                4067
            ],
            [
                4067,
                4084
            ],
            [
                4087,
                4131
            ],
            [
                4135,
                4144
            ],
            [
                4144,
                4160
            ],
            [
                4161,
                4170
            ],
            [
                4170,
                4175
            ],
            [
                4176,
                4184
            ],
            [
                4185,
                4204
            ],
            [
                4206,
                4209
            ],
            [
                4215,
                4220
            ],
            [
                4220,
                4222
            ],
            [
                4223,
                4231
            ],
            [
                4234,
                4293
            ],
            [
                4294,
                4306
            ],
            [
                4306,
                4308
            ],
            [
                4309,
                4357
            ],
            [
                4357,
                4369
            ],
            [
                4370,
                4433
            ],
            [
                4433,
                4453
            ],
            [
                4453,
                4455
            ],
            [
                4455,
                4479
            ],
            [
                4486,
                4492
            ],
            [
                4493,
                4498
            ],
            [
                4498,
                4500
            ],
            [
                4500,
                4550
            ],
            [
                4553,
                4573
            ],
            [
                4574,
                4656
            ],
            [
                4657,
                4680
            ],
            [
                4683,
                4696
            ],
            [
                4697,
                4706
            ],
            [
                4708,
                4732
            ],
            [
                4732,
                4768
            ],
            [
                4768,
                4794
            ],
            [
                4794,
                4800
            ],
            [
                4800,
                4820
            ],
            [
                4820,
                4862
            ],
            [
                4862,
                4894
            ],
            [
                4896,
                4934
            ],
            [
                4937,
                4957
            ],
            [
                4957,
                4975
            ],
            [
                4975,
                5146
            ],
            [
                5149,
                5176
            ],
            [
                5183,
                5196
            ],
            [
                5199,
                5258
            ],
            [
                5263,
                5299
            ],
            [
                5316,
                5385
            ],
            [
                5397,
                5409
            ],
            [
                5426,
                5428
            ],
            [
                5438,
                5444
            ],
            [
                5445,
                5452
            ],
            [
                5452,
                5454
            ],
            [
                5454,
                5467
            ],
            [
                5468,
                5485
            ],
            [
                5486,
                5488
            ],
            [
                5497,
                5586
            ],
            [
                5587,
                5617
            ],
            [
                5620,
                5622
            ],
            [
                5628,
                5637
            ],
            [
                5639,
                5688
            ],
            [
                5688,
                5728
            ],
            [
                5729,
                5761
            ],
            [
                5763,
                5880
            ],
            [
                5880,
                5998
            ],
            [
                6002,
                6025
            ],
            [
                6028,
                6045
            ],
            [
                6046,
                6055
            ],
            [
                6064,
                6071
            ],
            [
                6079,
                6090
            ],
            [
                6090,
                6176
            ],
            [
                6177,
                6238
            ],
            [
                6238,
                6283
            ],
            [
                6284,
                6286
            ],
            [
                6293,
                6364
            ],
            [
                6365,
                6377
            ],
            [
                6377,
                6386
            ],
            [
                6386,
                6388
            ],
            [
                6388,
                6422
            ],
            [
                6427,
                6432
            ],
            [
                6433,
                6480
            ],
            [
                6480,
                6507
            ],
            [
                6507,
                6509
            ],
            [
                6512,
                6553
            ],
            [
                6554,
                6562
            ],
            [
                6569,
                6583
            ],
            [
                6583,
                6613
            ],
            [
                6618,
                6678
            ],
            [
                6679,
                6686
            ],
            [
                6687,
                6708
            ],
            [
                6708,
                6755
            ],
            [
                6756,
                6769
            ],
            [
                6770,
                6773
            ],
            [
                6782,
                6784
            ],
            [
                6784,
                6785
            ],
            [
                6791,
                6818
            ],
            [
                6819,
                6897
            ],
            [
                6897,
                6901
            ],
            [
                6902,
                6920
            ],
            [
                6920,
                6938
            ],
            [
                6938,
                6949
            ],
            [
                6950,
                6952
            ],
            [
                6953,
                6965
            ],
            [
                6965,
                7025
            ],
            [
                7028,
                7031
            ],
            [
                7032,
                7037
            ],
            [
                7038,
                7047
            ],
            [
                7049,
                7101
            ],
            [
                7101,
                7103
            ],
            [
                7103,
                7137
            ],
            [
                7137,
                7184
            ],
            [
                7184,
                7220
            ],
            [
                7221,
                7224
            ],
            [
                7225,
                7230
            ],
            [
                7231,
                7237
            ],
            [
                7238,
                7245
            ],
            [
                7245,
                7251
            ],
            [
                7252,
                7307
            ],
            [
                7307,
                7327
            ],
            [
                7328,
                7331
            ],
            [
                7333,
                7343
            ],
            [
                7348,
                7374
            ],
            [
                7374,
                7375
            ],
            [
                7383,
                7402
            ],
            [
                7404,
                7422
            ],
            [
                7422,
                7452
            ],
            [
                7452,
                7477
            ],
            [
                7480,
                7553
            ],
            [
                7553,
                7601
            ],
            [
                7601,
                7624
            ],
            [
                7625,
                7682
            ],
            [
                7682,
                7702
            ],
            [
                7708,
                7718
            ],
            [
                7719,
                7870
            ],
            [
                7871,
                7881
            ],
            [
                7893,
                7894
            ],
            [
                7895,
                7956
            ],
            [
                7957,
                7959
            ],
            [
                7964,
                8032
            ],
            [
                8038,
                8041
            ],
            [
                8042,
                8064
            ],
            [
                8064,
                8084
            ],
            [
                8085,
                8087
            ],
            [
                8088,
                8092
            ],
            [
                8098,
                8114
            ],
            [
                8114,
                8137
            ],
            [
                8137,
                8183
            ],
            [
                8183,
                8207
            ],
            [
                8208,
                8211
            ],
            [
                8212,
                8217
            ],
            [
                8217,
                8227
            ],
            [
                8227,
                8278
            ],
            [
                8279,
                8290
            ],
            [
                8291,
                8296
            ],
            [
                8297,
                8298
            ],
            [
                8305,
                8316
            ],
            [
                8316,
                8319
            ],
            [
                8320,
                8340
            ],
            [
                8340,
                8343
            ],
            [
                8344,
                8382
            ],
            [
                8382,
                8400
            ],
            [
                8400,
                8426
            ],
            [
                8426,
                8456
            ],
            [
                8462,
                8467
            ],
            [
                8473,
                8483
            ],
            [
                8483,
                8497
            ],
            [
                8498,
                8502
            ],
            [
                8503,
                8508
            ],
            [
                8509,
                8530
            ],
            [
                8530,
                8638
            ],
            [
                8639,
                8642
            ],
            [
                8642,
                8670
            ],
            [
                8670,
                8700
            ],
            [
                8701,
                8704
            ],
            [
                8705,
                8763
            ],
            [
                8763,
                8806
            ],
            [
                8806,
                8825
            ],
            [
                8825,
                8876
            ],
            [
                8876,
                8881
            ],
            [
                8882,
                8885
            ],
            [
                8886,
                8926
            ],
            [
                8930,
                8942
            ],
            [
                8945,
                8963
            ],
            [
                8964,
                9002
            ],
            [
                9002,
                9016
            ],
            [
                9016,
                9038
            ],
            [
                9039,
                9052
            ],
            [
                9052,
                9062
            ],
            [
                9066,
                9143
            ],
            [
                9146,
                9159
            ],
            [
                9160,
                9207
            ],
            [
                9207,
                9243
            ],
            [
                9243,
                9249
            ],
            [
                9250,
                9252
            ],
            [
                9253,
                9267
            ],
            [
                9273,
                9275
            ],
            [
                9275,
                9284
            ],
            [
                9287,
                9317
            ],
            [
                9325,
                9379
            ],
            [
                9379,
                9496
            ],
            [
                9496,
                9567
            ],
            [
                9568,
                9579
            ],
            [
                9584,
                9585
            ],
            [
                9592,
                9616
            ],
            [
                9616,
                9618
            ],
            [
                9627,
                9634
            ],
            [
                9637,
                9650
            ],
            [
                9654,
                9689
            ],
            [
                9692,
                9768
            ],
            [
                9773,
                9808
            ],
            [
                9820,
                9822
            ],
            [
                9822,
                9855
            ],
            [
                9856,
                9915
            ],
            [
                9915,
                9917
            ],
            [
                9918,
                9932
            ],
            [
                9935,
                9948
            ],
            [
                9949,
                9980
            ],
            [
                9980,
                10028
            ],
            [
                10039,
                10055
            ],
            [
                10058,
                10073
            ],
            [
                10073,
                10075
            ],
            [
                10076,
                10079
            ],
            [
                10080,
                10122
            ],
            [
                10122,
                10163
            ],
            [
                10167,
                10182
            ],
            [
                10185,
                10246
            ],
            [
                10247,
                10250
            ],
            [
                10251,
                10256
            ],
            [
                10257,
                10272
            ],
            [
                10276,
                10288
            ],
            [
                10291,
                10313
            ],
            [
                10314,
                10332
            ],
            [
                10335,
                10348
            ],
            [
                10349,
                10350
            ],
            [
                10351,
                10355
            ],
            [
                10358,
                10387
            ],
            [
                10393,
                10402
            ],
            [
                10404,
                10411
            ],
            [
                10411,
                10413
            ],
            [
                10413,
                10432
            ],
            [
                10433,
                10434
            ],
            [
                10439,
                10453
            ],
            [
                10460,
                10509
            ],
            [
                10510,
                10512
            ],
            [
                10515,
                10529
            ],
            [
                10530,
                10532
            ],
            [
                10532,
                10544
            ],
            [
                10544,
                10565
            ],
            [
                10565,
                10589
            ],
            [
                10589,
                10612
            ],
            [
                10621,
                10631
            ],
            [
                10631,
                10642
            ],
            [
                10645,
                10691
            ],
            [
                10692,
                10710
            ],
            [
                10710,
                10714
            ],
            [
                10714,
                10716
            ],
            [
                10716,
                10727
            ],
            [
                10727,
                10782
            ],
            [
                10785,
                10879
            ],
            [
                10880,
                10918
            ],
            [
                10921,
                10943
            ],
            [
                10948,
                10977
            ],
            [
                10977,
                11037
            ],
            [
                11037,
                11045
            ],
            [
                11045,
                11097
            ],
            [
                11097,
                11116
            ],
            [
                11119,
                11199
            ],
            [
                11199,
                11201
            ],
            [
                11202,
                11221
            ],
            [
                11222,
                11270
            ],
            [
                11275,
                11301
            ],
            [
                11305,
                11324
            ],
            [
                11327,
                11337
            ],
            [
                11339,
                11359
            ],
            [
                11359,
                11454
            ],
            [
                11457,
                11472
            ],
            [
                11483,
                11484
            ],
            [
                11490,
                11518
            ],
            [
                11518,
                11552
            ],
            [
                11564,
                11571
            ],
            [
                11579,
                11618
            ],
            [
                11619,
                11629
            ],
            [
                11632,
                11641
            ],
            [
                11642,
                11685
            ],
            [
                11688,
                11730
            ],
            [
                11730,
                11779
            ],
            [
                11780,
                11831
            ],
            [
                11832,
                11884
            ],
            [
                11885,
                11906
            ],
            [
                11906,
                11933
            ],
            [
                11933,
                11944
            ],
            [
                11944,
                11984
            ],
            [
                11992,
                12047
            ],
            [
                12053,
                12117
            ],
            [
                12118,
                12144
            ],
            [
                12147,
                12159
            ],
            [
                12161,
                12196
            ],
            [
                12205,
                12207
            ],
            [
                12207,
                12241
            ],
            [
                12249,
                12250
            ],
            [
                12256,
                12262
            ],
            [
                12266,
                12269
            ],
            [
                12270,
                12274
            ],
            [
                12274,
                12275
            ],
            [
                12276,
                12278
            ],
            [
                12283,
                12284
            ]
        ],
        "row_chars": [
            [
                0,
                55
            ],
            [
                55,
                123
            ],
            [
                123,
                158
            ],
            [
                158,
                232
            ],
            [
                232,
                486
            ],
            [
                486,
                599
            ],
            [
                599,
                652
            ],
            [
                652,
                741
            ],
            [
                741,
                1060
            ],
            [
                1060,
                1094
            ],
            [
                1094,
                1197
            ],
            [
                1197,
                1325
            ],
            [
                1325,
                1447
            ],
            [
                1447,
                1573
            ],
            [
                1573,
                1645
            ],
            [
                1645,
                1719
            ],
            [
                1719,
                1860
            ],
            [
                1860,
                2024
            ],
            [
                2024,
                2134
            ],
            [
                2134,
                2237
            ],
            [
                2237,
                2237
            ],
            [
                2237,
                2329
            ],
            [
                2329,
                2469
            ],
            [
                2469,
                2549
            ],
            [
                2549,
                2608
            ],
            [
                2608,
                2626
            ],
            [
                2626,
                2670
            ],
            [
                2670,
                2703
            ],
            [
                2703,
                2703
            ],
            [
                2703,
                2703
            ],
            [
                2703,
                2813
            ],
            [
                2813,
                2841
            ],
            [
                2841,
                2897
            ],
            [
                2897,
                3135
            ],
            [
                3135,
                3173
            ],
            [
                3173,
                3230
            ],
            [
                3230,
                3397
            ],
            [
                3397,
                3432
            ],
            [
                3432,
                3526
            ],
            [
                3526,
                3588
            ],
            [
                3588,
                3660
            ],
            [
                3660,
                3938
            ],
            [
                3938,
                4042
            ],
            [
                4042,
                4054
            ],
            [
                4054,
                4067
            ],
            [
                4067,
                4087
            ],
            [
                4087,
                4144
            ],
            [
                4144,
                4222
            ],
            [
                4222,
                4234
            ],
            [
                4234,
                4308
            ],
            [
                4308,
                4357
            ],
            [
                4357,
                4433
            ],
            [
                4433,
                4455
            ],
            [
                4455,
                4500
            ],
            [
                4500,
                4553
            ],
            [
                4553,
                4656
            ],
            [
                4656,
                4732
            ],
            [
                4732,
                4732
            ],
            [
                4732,
                4768
            ],
            [
                4768,
                4794
            ],
            [
                4794,
                4800
            ],
            [
                4800,
                4820
            ],
            [
                4820,
                4862
            ],
            [
                4862,
                4975
            ],
            [
                4975,
                5149
            ],
            [
                5149,
                5179
            ],
            [
                5179,
                5258
            ],
            [
                5258,
                5299
            ],
            [
                5299,
                5299
            ],
            [
                5299,
                5454
            ],
            [
                5454,
                5586
            ],
            [
                5586,
                5688
            ],
            [
                5688,
                5763
            ],
            [
                5763,
                5880
            ],
            [
                5880,
                6001
            ],
            [
                6001,
                6090
            ],
            [
                6090,
                6176
            ],
            [
                6176,
                6238
            ],
            [
                6238,
                6377
            ],
            [
                6377,
                6388
            ],
            [
                6388,
                6422
            ],
            [
                6422,
                6480
            ],
            [
                6480,
                6507
            ],
            [
                6507,
                6512
            ],
            [
                6512,
                6583
            ],
            [
                6583,
                6708
            ],
            [
                6708,
                6818
            ],
            [
                6818,
                6897
            ],
            [
                6897,
                6920
            ],
            [
                6920,
                6938
            ],
            [
                6938,
                6965
            ],
            [
                6965,
                7028
            ],
            [
                7028,
                7103
            ],
            [
                7103,
                7137
            ],
            [
                7137,
                7245
            ],
            [
                7245,
                7307
            ],
            [
                7307,
                7333
            ],
            [
                7333,
                7374
            ],
            [
                7374,
                7404
            ],
            [
                7404,
                7404
            ],
            [
                7404,
                7404
            ],
            [
                7404,
                7422
            ],
            [
                7422,
                7452
            ],
            [
                7452,
                7480
            ],
            [
                7480,
                7553
            ],
            [
                7553,
                7601
            ],
            [
                7601,
                7682
            ],
            [
                7682,
                7895
            ],
            [
                7895,
                8064
            ],
            [
                8064,
                8137
            ],
            [
                8137,
                8278
            ],
            [
                8278,
                8316
            ],
            [
                8316,
                8340
            ],
            [
                8340,
                8382
            ],
            [
                8382,
                8382
            ],
            [
                8382,
                8400
            ],
            [
                8400,
                8426
            ],
            [
                8426,
                8483
            ],
            [
                8483,
                8530
            ],
            [
                8530,
                8530
            ],
            [
                8530,
                8670
            ],
            [
                8670,
                8763
            ],
            [
                8763,
                8806
            ],
            [
                8806,
                8825
            ],
            [
                8825,
                8876
            ],
            [
                8876,
                8929
            ],
            [
                8929,
                8929
            ],
            [
                8929,
                8963
            ],
            [
                8963,
                9002
            ],
            [
                9002,
                9016
            ],
            [
                9016,
                9052
            ],
            [
                9052,
                9065
            ],
            [
                9065,
                9159
            ],
            [
                9159,
                9207
            ],
            [
                9207,
                9243
            ],
            [
                9243,
                9275
            ],
            [
                9275,
                9287
            ],
            [
                9287,
                9379
            ],
            [
                9379,
                9496
            ],
            [
                9496,
                9618
            ],
            [
                9618,
                9650
            ],
            [
                9650,
                9692
            ],
            [
                9692,
                9768
            ],
            [
                9768,
                9822
            ],
            [
                9822,
                9917
            ],
            [
                9917,
                9948
            ],
            [
                9948,
                9980
            ],
            [
                9980,
                9980
            ],
            [
                9980,
                10038
            ],
            [
                10038,
                10075
            ],
            [
                10075,
                10122
            ],
            [
                10122,
                10166
            ],
            [
                10166,
                10185
            ],
            [
                10185,
                10246
            ],
            [
                10246,
                10275
            ],
            [
                10275,
                10313
            ],
            [
                10313,
                10348
            ],
            [
                10348,
                10413
            ],
            [
                10413,
                10509
            ],
            [
                10509,
                10515
            ],
            [
                10515,
                10529
            ],
            [
                10529,
                10544
            ],
            [
                10544,
                10565
            ],
            [
                10565,
                10589
            ],
            [
                10589,
                10615
            ],
            [
                10615,
                10615
            ],
            [
                10615,
                10631
            ],
            [
                10631,
                10691
            ],
            [
                10691,
                10710
            ],
            [
                10710,
                10716
            ],
            [
                10716,
                10727
            ],
            [
                10727,
                10785
            ],
            [
                10785,
                10785
            ],
            [
                10785,
                10879
            ],
            [
                10879,
                10921
            ],
            [
                10921,
                10943
            ],
            [
                10943,
                10977
            ],
            [
                10977,
                11037
            ],
            [
                11037,
                11045
            ],
            [
                11045,
                11045
            ],
            [
                11045,
                11097
            ],
            [
                11097,
                11119
            ],
            [
                11119,
                11199
            ],
            [
                11199,
                11301
            ],
            [
                11301,
                11359
            ],
            [
                11359,
                11457
            ],
            [
                11457,
                11518
            ],
            [
                11518,
                11618
            ],
            [
                11618,
                11632
            ],
            [
                11632,
                11641
            ],
            [
                11641,
                11688
            ],
            [
                11688,
                11730
            ],
            [
                11730,
                11885
            ],
            [
                11885,
                11933
            ],
            [
                11933,
                11944
            ],
            [
                11944,
                12117
            ],
            [
                12117,
                12207
            ],
            [
                12207,
                12244
            ],
            [
                12244,
                12244
            ],
            [
                12244,
                12244
            ],
            [
                12244,
                12284
            ]
        ]
    }
}