{
    "original": {
        "text": "The twelve years, continued Mrs. Dean, following that dismal period were the happiest of my life: my greatest troubles in their passage rose from our little lady's trifling illnesses, which she had to experience in common with all children, rich and poor. For the rest, after the first six months, she grew like a larch, and could walk and talk too, in her own way, before the heath blossomed a second time over Mrs. Linton's dust. She was the most winning thing that ever brought sunshine into a desolate house: a real beauty in face, with the Earnshaws' handsome dark eyes, but the Lintons' fair skin and small features, and yellow curling hair. Her spirit was high, though not rough, and qualified by a heart sensitive and lively to excess in its affections. That capacity for intense attachments reminded me of her mother: still she did not resemble her: for she could be soft and mild as a dove, and she had a gentle voice and pensive expression: her anger was never furious; her love never fierce: it was deep and tender. However, it must be acknowledged, she had faults to foil her gifts. A propensity to be saucy was one; and a perverse will, that indulged children invariably acquire, whether they be good tempered or cross. If a servant chanced to vex her, it was always-\"I shall tell papa!\" And if he reproved her, even by a look, you would have thought it a heart-breaking business: I don't believe he ever did speak a harsh word to her. He took her education entirely on himself, and made it an amusement. Fortunately, curiosity and a quick intellect made her an apt scholar: she learned rapidly and eagerly, and did honour to his teaching.\nTill she reached the age of thirteen she had not once been beyond the range of the park by herself. Mr. Linton would take her with him a mile or so outside, on rare occasions; but he trusted her to no one else. Gimmerton was an unsubstantial name in her ears; the chapel, the only building she had approached or entered, except her own home. Wuthering Heights and Mr. Heathcliff did not exist for her: she was a perfect recluse; and, apparently, perfectly contented. Sometimes, indeed, while surveying the country from her nursery window, she would observe-\n\"Ellen, how long will it be before I can walk to the top of those hills? I wonder what lies on the other side-is it the sea?\"\n\"No, Miss Cathy,\" I would answer; \"it is hills again, just like these.\"\n\"And what are those golden rocks like when you stand under them?\" she once asked.\nThe abrupt descent of Penistone Crags particularly attracted her notice; especially when the setting sun shone on it and the topmost heights, and the whole extent of landscape besides lay in shadow. I explained that they were bare masses of stone, with hardly enough earth in their clefts to nourish a stunted tree.\n\"And why are they bright so long after it is evening here?\" she pursued.\n\"Because they are a great deal higher up than we are,\" replied I; \"you could not climb them, they are too high and steep. In winter the frost is always there before it comes to us; and deep into summer I have found snow under that black hollow on the north-east side!\"\n\"Oh, you have been on them!\" she cried gleefully. \"Then I can go, too, when I am a woman. Has papa been, Ellen?\"\n\"Papa would tell you, Miss,\" I answered, hastily, \"that they are not worth the trouble of visiting. The moors, where you ramble with him, are much nicer; and Thrushcross Park is the finest place in the world.\"\n\"But I know the park, and I don't know those,\" she murmured to herself. \"And I should delight to look round me from the brow of that tallest point: my little pony Minny shall take me some time.\"\nOne of the maids mentioning the Fairy Cave, quite turned her head with a desire to fulfil this project: she teased Mr. Linton about it; and he promised she should have the journey when she got older. But Miss Catherine measured her age by months, and, \"Now, am I old enough to go to Penistone Crags?\" was the constant question in her mouth. The road thither wound close by Wuthering Heights. Edgar had not the heart to pass it; so she received as constantly the answer, \"Not yet, love: not yet.\"\nI said Mrs. Heathcliff lived above a dozen years after quitting her husband. Her family were of a delicate constitution: she and Edgar both lacked the ruddy health that you will generally meet in these parts. What her last illness was, I am not certain: I conjecture, they died of the same thing, a kind of fever, slow at its commencement, but incurable, and rapidly consuming life towards the close. She wrote to inform her brother of the probable conclusion of a four-months' indisposition under which she had suffered, and entreated him to come to her, if possible; for she had much to settle, and she wished to bid him adieu, and deliver Linton safely into his hands. Her hope was that Linton might be left with him, as he had been with her: his father, she would fain convince herself, had no desire to assume the burden of his maintenance or education. My master hesitated not a moment in complying with her request: reluctant as he was to leave home at ordinary calls, he flew to answer this; commanding Catherine to my peculiar vigilance, in his absence, with reiterated orders that she must not wander out of the park, even under my escort: he did not calculate on her going unaccompanied.\nHe was away three weeks. The first day or two my charge sat in a corner of the library, too sad for either reading or playing: in that quiet state she caused me little trouble; but it was succeeded by an interval of impatient, fretful weariness; and being too busy, and too old then, to run up and down amusing her, I hit on a method by which she might entertain herself. I used to send her on her travels round the grounds-now on foot, and now on a pony; indulging her with a patient audience of all her real and imaginary adventures when she returned.\nThe summer shone in full prime; and she took such a taste for this solitary rambling that she often contrived to remain out from breakfast till tea; and then the evenings were spent in recounting her fanciful tales. I did not fear her breaking bounds; because the gates were generally locked, and I thought she would scarcely venture forth alone, if they had stood wide open. Unluckily, my confidence proved misplaced. Catherine came to me, one morning, at eight o'clock, and said she was that day an Arabian merchant, going to cross the Desert with his caravan; and I must give her plenty of provision for herself and beasts: a horse, and three camels, personated by a large hound and a couple of pointers. I got together good store of dainties, and slung them in a basket on one side of the saddle; and she sprang up as gay as a fairy, sheltered by her wide-brimmed hat and gauze veil from the July sun, and trotted off with a merry laugh, mocking my cautious counsel to avoid galloping, and come back early. The naughty thing never made her appearance at tea. One traveller, the hound, being an old dog and fond of its ease, returned; but neither Cathy, nor the pony, nor the two pointers were visible in any direction: I despatched emissaries down this path, and that path, and at last went wandering in search of her myself. There was a labourer working at a fence round a plantation, on the borders of the grounds. I inquired of him if he had seen our young lady.\n\"I saw her at morn,\" he replied: \"she would have me to cut her a hazel switch, and then she leapt her Galloway over the hedge yonder, where it is lowest, and galloped out of sight.\"\nYou may guess how I felt at hearing this news. It struck me directly she must have started for Penistone Crags. \"What will become of her?\" I ejaculated, pushing through a gap which the man was repairing, and making straight to the high-road. I walked as if for a wager, mile after mile, till a turn brought me in view of the Heights; but no Catherine could I detect, far or near. The Crags lie about a mile and a half beyond Mr. Heathcliff's place, and that is four from the Grange, so I began to fear night would fall ere I could reach them. \"And what if she should have slipped in clambering among them,\" I reflected, \"and been killed, or broken some of her bones?\" My suspense was truly painful; and, at first, it gave me delightful relief to observe, in hurrying by the farmhouse, Charlie, the fiercest of the pointers, lying under a window, with swelled head and bleeding ear. I opened the wicket and ran to the door, knocking vehemently for admittance. A woman whom I knew, and who formerly lived at Gimmerton, answered: she had been servant there since the death of Mr. Earnshaw.\n\"Ah,\" said she, \"you are come a-seeking your little mistress! Don't be frightened. She's here safe: but I'm glad it isn't the master.\"\n\"He is not at home then, is he?\" I panted, quite breathless with quick walking and alarm.\n\"No, no,\" she replied: \"both he and Joseph are off, and I think they won't return this hour or more. Step in and rest you a bit.\"\nI entered, and beheld my stray lamb seated on the hearth, rocking herself in a little chair that had been her mother's when a child. Her hat was hung against the wall, and she seemed perfectly at home, laughing and chattering, in the best spirits imaginable, to Hareton-now a great, strong lad of eighteen-who stared at her with considerable curiosity and astonishment: comprehending precious little of the fluent succession of remarks and questions which her tongue never ceased pouring forth.\n\"Very well, Miss!\" I exclaimed, concealing my joy under an angry countenance. \"This is your last ride, till papa comes back. I'll not trust you over the threshold again, you naughty, naughty girl!\"\n\"Aha, Ellen!\" she cried, gaily, jumping up and running to my side. \"I shall have a pretty story to tell to-night; and so you've found me out. Have you ever been here in your life before?\"\n\"Put that hat on, and home at once,\" said I. \"I'm dreadfully grieved at you, Miss Cathy: you've done extremely wrong! It's no use pouting and crying: that won't repay the trouble I've had, scouring the country after you. To think how Mr. Linton charged me to keep you in; and you stealing off so! It shows you are a cunning little fox, and nobody will put faith in you any more.\"\n\"What have I done?\" sobbed she, instantly checked. \"Papa charged me nothing: he'll not scold me, Ellen-he's never cross, like you!\"\n\"Come, come!\" I repeated. \"I'll tie the riband. Now, let us have no petulance. Oh, for shame! You thirteen years old, and such a baby!\"\nThis exclamation was caused by her pushing the hat from her head, and retreating to the chimney out of my reach.\n\"Nay,\" said the servant, \"don't be hard on the bonny lass, Mrs. Dean. We made her stop: she'd fain have ridden forwards, afeard you should be uneasy. Hareton offered to go with her, and I thought he should: it's a wild road over the hills.\"\nHareton, during the discussion, stood with his hands in his pockets, too awkward to speak; though he looked as if he did not relish my intrusion.\n\"How long am I to wait?\" I continued, disregarding the woman's interference. \"It will be dark in ten minutes. Where is the pony, Miss Cathy? And where is Phoenix? I shall leave you, unless you be quick; so please yourself.\"\n\"The pony is in the yard,\" she replied, \"and Phoenix is shut in there. He's bitten-and so is Charlie. I was going to tell you all about it; but you are in a bad temper, and don't deserve to hear.\"\nI picked up her hat, and approached to reinstate it; but perceiving that the people of the house took her part, she commenced capering round the room; and on my giving chase, ran like a mouse over and under and behind the furniture, rendering it ridiculous for me to pursue. Hareton and the woman laughed, and she joined them, and waxed more impertinent still; till I cried, in great irritation,-\"Well, Miss Cathy, if you were aware whose house this is you'd be glad enough to get out.\"\n\"It's _your_ father's, isn't it?\" said she, turning to Hareton.\n\"Nay,\" he replied, looking down, and blushing bashfully.\nHe could not stand a steady gaze from her eyes, though they were just his own.\n\"Whose then-your master's?\" she asked.\nHe coloured deeper, with a different feeling, muttered an oath, and turned away.\n\"Who is his master?\" continued the tiresome girl, appealing to me. \"He talked about 'our house,' and 'our folk.' I thought he had been the owner's son. And he never said Miss: he should have done, shouldn't he, if he's a servant?\"\nHareton grew black as a thunder-cloud at this childish speech. I silently shook my questioner, and at last succeeded in equipping her for departure.\n\"Now, get my horse,\" she said, addressing her unknown kinsman as she would one of the stable-boys at the Grange. \"And you may come with me. I want to see where the goblin-hunter rises in the marsh, and to hear about the _fairishes_, as you call them: but make haste! What's the matter? Get my horse, I say.\"\n\"I'll see thee damned before I be _thy_ servant!\" growled the lad.\n\"You'll see me _what_!\" asked Catherine in surprise.\n\"Damned-thou saucy witch!\" he replied.\n\"There, Miss Cathy! you see you have got into pretty company,\" I interposed. \"Nice words to be used to a young lady! Pray don't begin to dispute with him. Come, let us seek for Minny ourselves, and begone.\"\n\"But, Ellen,\" cried she, staring fixed in astonishment, \"how dare he speak so to me? Mustn't he be made to do as I ask him? You wicked creature, I shall tell papa what you said.-Now, then!\"\nHareton did not appear to feel this threat; so the tears sprang into her eyes with indignation. \"You bring the pony,\" she exclaimed, turning to the woman, \"and let my dog free this moment!\"\n\"Softly, Miss,\" answered she addressed; \"you'll lose nothing by being civil. Though Mr. Hareton, there, be not the master's son, he's your cousin: and I was never hired to serve you.\"\n\"_He_ my cousin!\" cried Cathy, with a scornful laugh.\n\"Yes, indeed,\" responded her reprover.\n\"Oh, Ellen! don't let them say such things,\" she pursued in great trouble. \"Papa is gone to fetch my cousin from London: my cousin is a gentleman's son. That my-\" she stopped, and wept outright; upset at the bare notion of relationship with such a clown.\n\"Hush, hush!\" I whispered; \"people can have many cousins and of all sorts, Miss Cathy, without being any the worse for it; only they needn't keep their company, if they be disagreeable and bad.\"\n\"He's not-he's not my cousin, Ellen!\" she went on, gathering fresh grief from reflection, and flinging herself into my arms for refuge from the idea.\nI was much vexed at her and the servant for their mutual revelations; having no doubt of Linton's approaching arrival, communicated by the former, being reported to Mr. Heathcliff; and feeling as confident that Catherine's first thought on her father's return would be to seek an explanation of the latter's assertion concerning her rude-bred kindred. Hareton, recovering from his disgust at being taken for a servant, seemed moved by her distress; and, having fetched the pony round to the door, he took, to propitiate her, a fine crooked-legged terrier whelp from the kennel, and putting it into her hand, bid her whist! for he meant nought. Pausing in her lamentations, she surveyed him with a glance of awe and horror, then burst forth anew.\nI could scarcely refrain from smiling at this antipathy to the poor fellow; who was a well-made, athletic youth, good-looking in features, and stout and healthy, but attired in garments befitting his daily occupations of working on the farm and lounging among the moors after rabbits and game. Still, I thought I could detect in his physiognomy a mind owning better qualities than his father ever possessed. Good things lost amid a wilderness of weeds, to be sure, whose rankness far over-topped their neglected growth; yet, notwithstanding, evidence of a wealthy soil, that might yield luxuriant crops under other and favourable circumstances. Mr. Heathcliff, I believe, had not treated him physically ill; thanks to his fearless nature, which offered no temptation to that course of oppression: he had none of the timid susceptibility that would have given zest to ill-treatment, in Heathcliff's judgment. He appeared to have bent his malevolence on making him a brute: he was never taught to read or write; never rebuked for any bad habit which did not annoy his keeper; never led a single step towards virtue, or guarded by a single precept against vice. And from what I heard, Joseph contributed much to his deterioration, by a narrow-minded partiality which prompted him to flatter and pet him, as a boy, because he was the head of the old family. And as he had been in the habit of accusing Catherine Earnshaw and Heathcliff, when children, of putting the master past his patience, and compelling him to seek solace in drink by what he termed their \"offald ways,\" so at present he laid the whole burden of Hareton's faults on the shoulders of the usurper of his property. If the lad swore, he wouldn't correct him: nor however culpably he behaved. It gave Joseph satisfaction, apparently, to watch him go the worst lengths: he allowed that the lad was ruined: that his soul was abandoned to perdition; but then he reflected that Heathcliff must answer for it. Hareton's blood would be required at his hands; and there lay immense consolation in that thought. Joseph had instilled into him a pride of name, and of his lineage; he would, had he dared, have fostered hate between him and the present owner of the Heights: but his dread of that owner amounted to superstition; and he confined his feelings regarding him to muttered innuendoes and private comminations. I don't pretend to be intimately acquainted with the mode of living customary in those days at Wuthering Heights: I only speak from hearsay; for I saw little. The villagers affirmed Mr. Heathcliff was _near_, and a cruel hard landlord to his tenants; but the house, inside, had regained its ancient aspect of comfort under female management, and the scenes of riot common in Hindley's time were not now enacted within its walls. The master was too gloomy to seek companionship with any people, good or bad; and he is yet.\nThis, however, is not making progress with my story. Miss Cathy rejected the peace-offering of the terrier, and demanded her own dogs, Charlie and Phoenix. They came limping and hanging their heads; and we set out for home, sadly out of sorts, every one of us. I could not wring from my little lady how she had spent the day; except that, as I supposed, the goal of her pilgrimage was Penistone Crags; and she arrived without adventure to the gate of the farm-house, when Hareton happened to issue forth, attended by some canine followers, who attacked her train. They had a smart battle, before their owners could separate them: that formed an introduction. Catherine told Hareton who she was, and where she was going; and asked him to show her the way: finally, beguiling him to accompany her. He opened the mysteries of the Fairy Cave, and twenty other queer places. But, being in disgrace, I was not favoured with a description of the interesting objects she saw. I could gather, however, that her guide had been a favourite till she hurt his feelings by addressing him as a servant; and Heathcliff's housekeeper hurt hers by calling him her cousin. Then the language he had held to her rankled in her heart; she who was always \"love,\" and \"darling,\" and \"queen,\" and \"angel,\" with everybody at the Grange, to be insulted so shockingly by a stranger! She did not comprehend it; and hard work I had to obtain a promise that she would not lay the grievance before her father. I explained how he objected to the whole household at the Heights, and how sorry he would be to find she had been there; but I insisted most on the fact, that if she revealed my negligence of his orders, he would perhaps be so angry that I should have to leave; and Cathy couldn't bear that prospect: she pledged her word, and kept it for my sake. After all, she was a sweet little girl.",
        "paragraph_chars": [
            [
                0,
                1654
            ],
            [
                1654,
                2212
            ],
            [
                2212,
                2338
            ],
            [
                2338,
                2410
            ],
            [
                2410,
                2492
            ],
            [
                2492,
                2808
            ],
            [
                2808,
                2881
            ],
            [
                2881,
                3150
            ],
            [
                3150,
                3263
            ],
            [
                3263,
                3473
            ],
            [
                3473,
                3668
            ],
            [
                3668,
                4164
            ],
            [
                4164,
                5363
            ],
            [
                5363,
                5917
            ],
            [
                5917,
                7387
            ],
            [
                7387,
                7569
            ],
            [
                7569,
                8656
            ],
            [
                8656,
                8791
            ],
            [
                8791,
                8881
            ],
            [
                8881,
                9011
            ],
            [
                9011,
                9506
            ],
            [
                9506,
                9704
            ],
            [
                9704,
                9892
            ],
            [
                9892,
                10272
            ],
            [
                10272,
                10404
            ],
            [
                10404,
                10540
            ],
            [
                10540,
                10653
            ],
            [
                10653,
                10894
            ],
            [
                10894,
                11040
            ],
            [
                11040,
                11264
            ],
            [
                11264,
                11461
            ],
            [
                11461,
                11948
            ],
            [
                11948,
                12012
            ],
            [
                12012,
                12069
            ],
            [
                12069,
                12148
            ],
            [
                12148,
                12187
            ],
            [
                12187,
                12268
            ],
            [
                12268,
                12499
            ],
            [
                12499,
                12648
            ],
            [
                12648,
                12956
            ],
            [
                12956,
                13023
            ],
            [
                13023,
                13076
            ],
            [
                13076,
                13115
            ],
            [
                13115,
                13322
            ],
            [
                13322,
                13512
            ],
            [
                13512,
                13702
            ],
            [
                13702,
                13886
            ],
            [
                13886,
                13940
            ],
            [
                13940,
                13979
            ],
            [
                13979,
                14234
            ],
            [
                14234,
                14429
            ],
            [
                14429,
                14579
            ],
            [
                14579,
                15325
            ],
            [
                15325,
                18219
            ],
            [
                18219,
                20084
            ]
        ],
        "segment_chars": [
            [
                0,
                256
            ],
            [
                256,
                432
            ],
            [
                432,
                648
            ],
            [
                648,
                762
            ],
            [
                762,
                1028
            ],
            [
                1028,
                1096
            ],
            [
                1096,
                1234
            ],
            [
                1234,
                1302
            ],
            [
                1302,
                1450
            ],
            [
                1450,
                1519
            ],
            [
                1519,
                1654
            ],
            [
                1654,
                1754
            ],
            [
                1754,
                1865
            ],
            [
                1865,
                1996
            ],
            [
                1996,
                2121
            ],
            [
                2121,
                2212
            ],
            [
                2212,
                2285
            ],
            [
                2285,
                2338
            ],
            [
                2338,
                2410
            ],
            [
                2410,
                2476
            ],
            [
                2476,
                2492
            ],
            [
                2492,
                2691
            ],
            [
                2691,
                2808
            ],
            [
                2808,
                2868
            ],
            [
                2868,
                2881
            ],
            [
                2881,
                3003
            ],
            [
                3003,
                3150
            ],
            [
                3150,
                3179
            ],
            [
                3179,
                3200
            ],
            [
                3200,
                3240
            ],
            [
                3240,
                3263
            ],
            [
                3263,
                3363
            ],
            [
                3363,
                3473
            ],
            [
                3473,
                3545
            ],
            [
                3545,
                3668
            ],
            [
                3668,
                3868
            ],
            [
                3868,
                3969
            ],
            [
                3969,
                4009
            ],
            [
                4009,
                4060
            ],
            [
                4060,
                4164
            ],
            [
                4164,
                4241
            ],
            [
                4241,
                4373
            ],
            [
                4373,
                4565
            ],
            [
                4565,
                4836
            ],
            [
                4836,
                5023
            ],
            [
                5023,
                5363
            ],
            [
                5363,
                5388
            ],
            [
                5388,
                5735
            ],
            [
                5735,
                5917
            ],
            [
                5917,
                6133
            ],
            [
                6133,
                6293
            ],
            [
                6293,
                6336
            ],
            [
                6336,
                6625
            ],
            [
                6625,
                6928
            ],
            [
                6928,
                6980
            ],
            [
                6980,
                7247
            ],
            [
                7247,
                7338
            ],
            [
                7338,
                7387
            ],
            [
                7387,
                7569
            ],
            [
                7569,
                7616
            ],
            [
                7616,
                7681
            ],
            [
                7681,
                7708
            ],
            [
                7708,
                7811
            ],
            [
                7811,
                7949
            ],
            [
                7949,
                8112
            ],
            [
                8112,
                8237
            ],
            [
                8237,
                8451
            ],
            [
                8451,
                8528
            ],
            [
                8528,
                8656
            ],
            [
                8656,
                8718
            ],
            [
                8718,
                8739
            ],
            [
                8739,
                8791
            ],
            [
                8791,
                8824
            ],
            [
                8824,
                8881
            ],
            [
                8881,
                8982
            ],
            [
                8982,
                9011
            ],
            [
                9011,
                9144
            ],
            [
                9144,
                9506
            ],
            [
                9506,
                9525
            ],
            [
                9525,
                9584
            ],
            [
                9584,
                9631
            ],
            [
                9631,
                9704
            ],
            [
                9704,
                9718
            ],
            [
                9718,
                9771
            ],
            [
                9771,
                9846
            ],
            [
                9846,
                9892
            ],
            [
                9892,
                9937
            ],
            [
                9937,
                10010
            ],
            [
                10010,
                10113
            ],
            [
                10113,
                10189
            ],
            [
                10189,
                10272
            ],
            [
                10272,
                10292
            ],
            [
                10292,
                10323
            ],
            [
                10323,
                10404
            ],
            [
                10404,
                10418
            ],
            [
                10418,
                10430
            ],
            [
                10430,
                10452
            ],
            [
                10452,
                10483
            ],
            [
                10483,
                10498
            ],
            [
                10498,
                10540
            ],
            [
                10540,
                10653
            ],
            [
                10653,
                10723
            ],
            [
                10723,
                10803
            ],
            [
                10803,
                10894
            ],
            [
                10894,
                11040
            ],
            [
                11040,
                11065
            ],
            [
                11065,
                11117
            ],
            [
                11117,
                11150
            ],
            [
                11150,
                11181
            ],
            [
                11181,
                11203
            ],
            [
                11203,
                11264
            ],
            [
                11264,
                11335
            ],
            [
                11335,
                11366
            ],
            [
                11366,
                11461
            ],
            [
                11461,
                11736
            ],
            [
                11736,
                11948
            ],
            [
                11948,
                11982
            ],
            [
                11982,
                12012
            ],
            [
                12012,
                12069
            ],
            [
                12069,
                12148
            ],
            [
                12148,
                12176
            ],
            [
                12176,
                12187
            ],
            [
                12187,
                12268
            ],
            [
                12268,
                12289
            ],
            [
                12289,
                12335
            ],
            [
                12335,
                12381
            ],
            [
                12381,
                12420
            ],
            [
                12420,
                12499
            ],
            [
                12499,
                12562
            ],
            [
                12562,
                12648
            ],
            [
                12648,
                12761
            ],
            [
                12761,
                12788
            ],
            [
                12788,
                12915
            ],
            [
                12915,
                12934
            ],
            [
                12934,
                12956
            ],
            [
                12956,
                13006
            ],
            [
                13006,
                13023
            ],
            [
                13023,
                13047
            ],
            [
                13047,
                13076
            ],
            [
                13076,
                13103
            ],
            [
                13103,
                13115
            ],
            [
                13115,
                13135
            ],
            [
                13135,
                13192
            ],
            [
                13192,
                13232
            ],
            [
                13232,
                13270
            ],
            [
                13270,
                13322
            ],
            [
                13322,
                13407
            ],
            [
                13407,
                13446
            ],
            [
                13446,
                13512
            ],
            [
                13512,
                13608
            ],
            [
                13608,
                13702
            ],
            [
                13702,
                13779
            ],
            [
                13779,
                13886
            ],
            [
                13886,
                13904
            ],
            [
                13904,
                13940
            ],
            [
                13940,
                13979
            ],
            [
                13979,
                13991
            ],
            [
                13991,
                14054
            ],
            [
                14054,
                14132
            ],
            [
                14132,
                14234
            ],
            [
                14234,
                14248
            ],
            [
                14248,
                14429
            ],
            [
                14429,
                14467
            ],
            [
                14467,
                14579
            ],
            [
                14579,
                14931
            ],
            [
                14931,
                15202
            ],
            [
                15202,
                15223
            ],
            [
                15223,
                15325
            ],
            [
                15325,
                15619
            ],
            [
                15619,
                15733
            ],
            [
                15733,
                15970
            ],
            [
                15970,
                16233
            ],
            [
                16233,
                16484
            ],
            [
                16484,
                16679
            ],
            [
                16679,
                17004
            ],
            [
                17004,
                17080
            ],
            [
                17080,
                17292
            ],
            [
                17292,
                17391
            ],
            [
                17391,
                17697
            ],
            [
                17697,
                17856
            ],
            [
                17856,
                18126
            ],
            [
                18126,
                18219
            ],
            [
                18219,
                18272
            ],
            [
                18272,
                18375
            ],
            [
                18375,
                18480
            ],
            [
                18480,
                18783
            ],
            [
                18783,
                18878
            ],
            [
                18878,
                19015
            ],
            [
                19015,
                19089
            ],
            [
                19089,
                19187
            ],
            [
                19187,
                19373
            ],
            [
                19373,
                19574
            ],
            [
                19574,
                19697
            ],
            [
                19697,
                20045
            ],
            [
                20045,
                20084
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                39,
                67
            ],
            [
                16,
                38
            ],
            [
                68,
                118
            ],
            [
                146,
                163
            ],
            [
                173,
                182
            ],
            [
                254,
                256
            ],
            [
                270,
                344
            ],
            [
                366,
                431
            ],
            [
                432,
                526
            ],
            [
                534,
                606
            ],
            [
                627,
                648
            ],
            [
                648,
                668
            ],
            [
                687,
                690
            ],
            [
                706,
                711
            ],
            [
                712,
                732
            ],
            [
                760,
                762
            ],
            [
                762,
                826
            ],
            [
                833,
                927
            ],
            [
                952,
                1027
            ],
            [
                1028,
                1036
            ],
            [
                1062,
                1065
            ],
            [
                1121,
                1124
            ],
            [
                1115,
                1120
            ],
            [
                1060,
                1061
            ],
            [
                1156,
                1173
            ],
            [
                1232,
                1234
            ],
            [
                1234,
                1246
            ],
            [
                1258,
                1261
            ],
            [
                1262,
                1280
            ],
            [
                1282,
                1299
            ],
            [
                1302,
                1308
            ],
            [
                1312,
                1364
            ],
            [
                1370,
                1376
            ],
            [
                1393,
                1418
            ],
            [
                1429,
                1450
            ],
            [
                1450,
                1452
            ],
            [
                1458,
                1461
            ],
            [
                1484,
                1496
            ],
            [
                1589,
                1620
            ],
            [
                1652,
                1654
            ],
            [
                1654,
                1719
            ],
            [
                1737,
                1754
            ],
            [
                1754,
                1865
            ],
            [
                1914,
                1924
            ],
            [
                1875,
                1878
            ],
            [
                1926,
                1951
            ],
            [
                1966,
                1973
            ],
            [
                1982,
                1996
            ],
            [
                2056,
                2059
            ],
            [
                1996,
                2032
            ],
            [
                2081,
                2086
            ],
            [
                2060,
                2063
            ],
            [
                2086,
                2120
            ],
            [
                2121,
                2176
            ],
            [
                2185,
                2202
            ],
            [
                2213,
                2285
            ],
            [
                2285,
                2335
            ],
            [
                2339,
                2353
            ],
            [
                2356,
                2371
            ],
            [
                2373,
                2407
            ],
            [
                2411,
                2473
            ],
            [
                2514,
                2605
            ],
            [
                2625,
                2632
            ],
            [
                2689,
                2691
            ],
            [
                2691,
                2808
            ],
            [
                2809,
                2865
            ],
            [
                2868,
                2881
            ],
            [
                2882,
                2933
            ],
            [
                2936,
                2946
            ],
            [
                2948,
                3003
            ],
            [
                3003,
                3106
            ],
            [
                3132,
                3147
            ],
            [
                3151,
                3176
            ],
            [
                3179,
                3200
            ],
            [
                3206,
                3240
            ],
            [
                3240,
                3260
            ],
            [
                3264,
                3289
            ],
            [
                3292,
                3312
            ],
            [
                3314,
                3363
            ],
            [
                3363,
                3470
            ],
            [
                3474,
                3517
            ],
            [
                3520,
                3532
            ],
            [
                3543,
                3545
            ],
            [
                3546,
                3558
            ],
            [
                3567,
                3588
            ],
            [
                3601,
                3623
            ],
            [
                3631,
                3665
            ],
            [
                3921,
                3966
            ],
            [
                3998,
                4001
            ],
            [
                3977,
                3994
            ],
            [
                4007,
                4009
            ],
            [
                4009,
                4017
            ],
            [
                4026,
                4058
            ],
            [
                4094,
                4095
            ],
            [
                4060,
                4065
            ],
            [
                4136,
                4137
            ],
            [
                4139,
                4161
            ],
            [
                4164,
                4192
            ],
            [
                4199,
                4218
            ],
            [
                4228,
                4241
            ],
            [
                4285,
                4298
            ],
            [
                4252,
                4256
            ],
            [
                4299,
                4303
            ],
            [
                4262,
                4270
            ],
            [
                4731,
                4732
            ],
            [
                4373,
                4416
            ],
            [
                4502,
                4507
            ],
            [
                4565,
                4596
            ],
            [
                4328,
                4332
            ],
            [
                4668,
                4671
            ],
            [
                4517,
                4522
            ],
            [
                4700,
                4718
            ],
            [
                4371,
                4372
            ],
            [
                4765,
                4805
            ],
            [
                4241,
                4244
            ],
            [
                4806,
                4835
            ],
            [
                5023,
                5032
            ],
            [
                5317,
                5324
            ],
            [
                5085,
                5102
            ],
            [
                5103,
                5120
            ],
            [
                5138,
                5150
            ],
            [
                5074,
                5077
            ],
            [
                5162,
                5163
            ],
            [
                5250,
                5254
            ],
            [
                5211,
                5226
            ],
            [
                5259,
                5263
            ],
            [
                5175,
                5184
            ],
            [
                5264,
                5290
            ],
            [
                5361,
                5363
            ],
            [
                5363,
                5388
            ],
            [
                5388,
                5408
            ],
            [
                5419,
                5425
            ],
            [
                5438,
                5489
            ],
            [
                5829,
                5832
            ],
            [
                5498,
                5509
            ],
            [
                5514,
                5550
            ],
            [
                5561,
                5563
            ],
            [
                5590,
                5612
            ],
            [
                5647,
                5649
            ],
            [
                5674,
                5680
            ],
            [
                5750,
                5787
            ],
            [
                5791,
                5799
            ],
            [
                5808,
                5818
            ],
            [
                5742,
                5744
            ],
            [
                5864,
                5917
            ],
            [
                5917,
                5933
            ],
            [
                5947,
                6016
            ],
            [
                6037,
                6040
            ],
            [
                6056,
                6074
            ],
            [
                6093,
                6098
            ],
            [
                6075,
                6087
            ],
            [
                6102,
                6133
            ],
            [
                6133,
                6151
            ],
            [
                6169,
                6250
            ],
            [
                6257,
                6263
            ],
            [
                6264,
                6292
            ],
            [
                6293,
                6336
            ],
            [
                6336,
                6356
            ],
            [
                6358,
                6369
            ],
            [
                6387,
                6405
            ],
            [
                6415,
                6509
            ],
            [
                6520,
                6531
            ],
            [
                6356,
                6357
            ],
            [
                6544,
                6570
            ],
            [
                6577,
                6614
            ],
            [
                6623,
                6625
            ],
            [
                6625,
                6626
            ],
            [
                6654,
                6662
            ],
            [
                6679,
                6690
            ],
            [
                6768,
                6771
            ],
            [
                6710,
                6735
            ],
            [
                6821,
                6869
            ],
            [
                6887,
                6905
            ],
            [
                6926,
                6927
            ],
            [
                6928,
                6951
            ],
            [
                6972,
                6980
            ],
            [
                6995,
                7139
            ],
            [
                7140,
                7141
            ],
            [
                7164,
                7178
            ],
            [
                7180,
                7188
            ],
            [
                7193,
                7198
            ],
            [
                7207,
                7246
            ],
            [
                7247,
                7275
            ],
            [
                7307,
                7336
            ],
            [
                7305,
                7306
            ],
            [
                7338,
                7339
            ],
            [
                7352,
                7387
            ],
            [
                7388,
                7397
            ],
            [
                7408,
                7419
            ],
            [
                7475,
                7488
            ],
            [
                7498,
                7519
            ],
            [
                7539,
                7566
            ],
            [
                7569,
                7616
            ],
            [
                7616,
                7680
            ],
            [
                7682,
                7705
            ],
            [
                7708,
                7709
            ],
            [
                7720,
                7721
            ],
            [
                7777,
                7792
            ],
            [
                7796,
                7811
            ],
            [
                7811,
                7819
            ],
            [
                7837,
                7889
            ],
            [
                7832,
                7833
            ],
            [
                7894,
                7927
            ],
            [
                7947,
                7949
            ],
            [
                7949,
                7968
            ],
            [
                8030,
                8034
            ],
            [
                8035,
                8051
            ],
            [
                7976,
                7979
            ],
            [
                8055,
                8087
            ],
            [
                8092,
                8111
            ],
            [
                8117,
                8128
            ],
            [
                8141,
                8173
            ],
            [
                8176,
                8188
            ],
            [
                8190,
                8221
            ],
            [
                8229,
                8234
            ],
            [
                8237,
                8252
            ],
            [
                8259,
                8271
            ],
            [
                8324,
                8335
            ],
            [
                8339,
                8342
            ],
            [
                8283,
                8293
            ],
            [
                8305,
                8314
            ],
            [
                8354,
                8419
            ],
            [
                8437,
                8450
            ],
            [
                8451,
                8452
            ],
            [
                8475,
                8490
            ],
            [
                8471,
                8474
            ],
            [
                8526,
                8528
            ],
            [
                8528,
                8547
            ],
            [
                8586,
                8656
            ],
            [
                8657,
                8659
            ],
            [
                8662,
                8671
            ],
            [
                8673,
                8718
            ],
            [
                8718,
                8739
            ],
            [
                8739,
                8768
            ],
            [
                8778,
                8788
            ],
            [
                8792,
                8814
            ],
            [
                8824,
                8833
            ],
            [
                8840,
                8850
            ],
            [
                8879,
                8881
            ],
            [
                8882,
                8884
            ],
            [
                8891,
                8903
            ],
            [
                8905,
                8927
            ],
            [
                8931,
                8936
            ],
            [
                8945,
                8982
            ],
            [
                8982,
                8998
            ],
            [
                9003,
                9008
            ],
            [
                9011,
                9144
            ],
            [
                9183,
                9236
            ],
            [
                9270,
                9339
            ],
            [
                9353,
                9394
            ],
            [
                9404,
                9417
            ],
            [
                9436,
                9466
            ],
            [
                9499,
                9506
            ],
            [
                9512,
                9522
            ],
            [
                9525,
                9555
            ],
            [
                9562,
                9570
            ],
            [
                9582,
                9584
            ],
            [
                9590,
                9631
            ],
            [
                9631,
                9649
            ],
            [
                9669,
                9701
            ],
            [
                9705,
                9715
            ],
            [
                9718,
                9727
            ],
            [
                9729,
                9771
            ],
            [
                9772,
                9807
            ],
            [
                9844,
                9846
            ],
            [
                9846,
                9869
            ],
            [
                9883,
                9889
            ],
            [
                9893,
                9913
            ],
            [
                9914,
                9926
            ],
            [
                9929,
                9937
            ],
            [
                9938,
                10010
            ],
            [
                10010,
                10101
            ],
            [
                10108,
                10111
            ],
            [
                10102,
                10107
            ],
            [
                10137,
                10159
            ],
            [
                10187,
                10189
            ],
            [
                10198,
                10201
            ],
            [
                10206,
                10226
            ],
            [
                10273,
                10289
            ],
            [
                10292,
                10302
            ],
            [
                10321,
                10323
            ],
            [
                10324,
                10401
            ],
            [
                10405,
                10415
            ],
            [
                10418,
                10430
            ],
            [
                10457,
                10483
            ],
            [
                10483,
                10498
            ],
            [
                10498,
                10537
            ],
            [
                10654,
                10657
            ],
            [
                10660,
                10677
            ],
            [
                10679,
                10723
            ],
            [
                10723,
                10739
            ],
            [
                10741,
                10744
            ],
            [
                10801,
                10803
            ],
            [
                10803,
                10891
            ],
            [
                10894,
                10901
            ],
            [
                10926,
                10983
            ],
            [
                11038,
                11040
            ],
            [
                11041,
                11062
            ],
            [
                11065,
                11077
            ],
            [
                11091,
                11117
            ],
            [
                11118,
                11150
            ],
            [
                11150,
                11181
            ],
            [
                11181,
                11203
            ],
            [
                11233,
                11241
            ],
            [
                11269,
                11288
            ],
            [
                11291,
                11303
            ],
            [
                11305,
                11335
            ],
            [
                11335,
                11339
            ],
            [
                11340,
                11353
            ],
            [
                11357,
                11366
            ],
            [
                11366,
                11458
            ],
            [
                11461,
                11481
            ],
            [
                11514,
                11517
            ],
            [
                11573,
                11576
            ],
            [
                11571,
                11572
            ],
            [
                11529,
                11566
            ],
            [
                11692,
                11693
            ],
            [
                11497,
                11499
            ],
            [
                11587,
                11590
            ],
            [
                11596,
                11692
            ],
            [
                11734,
                11736
            ],
            [
                11736,
                11786
            ],
            [
                11820,
                11855
            ],
            [
                11786,
                11787
            ],
            [
                11858,
                11882
            ],
            [
                11894,
                11945
            ],
            [
                11949,
                11953
            ],
            [
                11955,
                11959
            ],
            [
                11961,
                11979
            ],
            [
                11982,
                12012
            ],
            [
                12013,
                12016
            ],
            [
                12019,
                12057
            ],
            [
                12067,
                12069
            ],
            [
                12149,
                12173
            ],
            [
                12176,
                12187
            ],
            [
                12187,
                12205
            ],
            [
                12231,
                12268
            ],
            [
                12269,
                12286
            ],
            [
                12289,
                12335
            ],
            [
                12352,
                12353
            ],
            [
                12336,
                12351
            ],
            [
                12335,
                12336
            ],
            [
                12353,
                12362
            ],
            [
                12365,
                12368
            ],
            [
                12370,
                12378
            ],
            [
                12381,
                12393
            ],
            [
                12403,
                12420
            ],
            [
                12420,
                12496
            ],
            [
                12499,
                12544
            ],
            [
                12560,
                12562
            ],
            [
                12562,
                12578
            ],
            [
                12592,
                12597
            ],
            [
                12629,
                12632
            ],
            [
                12646,
                12648
            ],
            [
                12654,
                12666
            ],
            [
                12669,
                12689
            ],
            [
                12710,
                12712
            ],
            [
                12734,
                12741
            ],
            [
                12759,
                12761
            ],
            [
                12766,
                12788
            ],
            [
                12788,
                12867
            ],
            [
                12869,
                12878
            ],
            [
                12879,
                12915
            ],
            [
                12915,
                12934
            ],
            [
                12934,
                12953
            ],
            [
                12957,
                12989
            ],
            [
                12991,
                12994
            ],
            [
                12996,
                13003
            ],
            [
                13006,
                13023
            ],
            [
                13024,
                13037
            ],
            [
                13039,
                13043
            ],
            [
                13047,
                13076
            ],
            [
                13080,
                13084
            ],
            [
                13089,
                13100
            ],
            [
                13103,
                13115
            ],
            [
                13121,
                13135
            ],
            [
                13135,
                13175
            ],
            [
                13178,
                13179
            ],
            [
                13190,
                13192
            ],
            [
                13193,
                13206
            ],
            [
                13215,
                13232
            ],
            [
                13237,
                13242
            ],
            [
                13260,
                13270
            ],
            [
                13270,
                13282
            ],
            [
                13307,
                13319
            ],
            [
                13323,
                13333
            ],
            [
                13336,
                13354
            ],
            [
                13361,
                13377
            ],
            [
                13379,
                13407
            ],
            [
                13446,
                13498
            ],
            [
                13512,
                13608
            ],
            [
                13609,
                13627
            ],
            [
                13630,
                13666
            ],
            [
                13668,
                13699
            ],
            [
                13707,
                13715
            ],
            [
                13727,
                13730
            ],
            [
                13718,
                13726
            ],
            [
                13740,
                13741
            ],
            [
                13743,
                13779
            ],
            [
                13788,
                13797
            ],
            [
                13799,
                13804
            ],
            [
                13836,
                13883
            ],
            [
                13895,
                13901
            ],
            [
                13904,
                13940
            ],
            [
                13941,
                13952
            ],
            [
                13980,
                13991
            ],
            [
                13991,
                14021
            ],
            [
                14024,
                14035
            ],
            [
                14052,
                14054
            ],
            [
                14055,
                14132
            ],
            [
                14132,
                14136
            ],
            [
                14142,
                14172
            ],
            [
                14232,
                14234
            ],
            [
                14235,
                14239
            ],
            [
                14248,
                14260
            ],
            [
                14262,
                14290
            ],
            [
                14307,
                14319
            ],
            [
                14355,
                14426
            ],
            [
                14439,
                14464
            ],
            [
                14467,
                14470
            ],
            [
                14577,
                14579
            ],
            [
                14579,
                14584
            ],
            [
                14590,
                14595
            ],
            [
                14929,
                14930
            ],
            [
                14656,
                14664
            ],
            [
                14668,
                14696
            ],
            [
                14839,
                14844
            ],
            [
                14845,
                14847
            ],
            [
                14732,
                14763
            ],
            [
                14785,
                14799
            ],
            [
                14851,
                14870
            ],
            [
                14819,
                14829
            ],
            [
                14772,
                14774
            ],
            [
                14931,
                15056
            ],
            [
                15063,
                15083
            ],
            [
                15104,
                15110
            ],
            [
                15126,
                15133
            ],
            [
                15140,
                15202
            ],
            [
                15202,
                15216
            ],
            [
                15221,
                15223
            ],
            [
                15252,
                15255
            ],
            [
                15265,
                15273
            ],
            [
                15286,
                15306
            ],
            [
                15319,
                15325
            ],
            [
                15325,
                15341
            ],
            [
                15355,
                15399
            ],
            [
                15405,
                15450
            ],
            [
                15462,
                15463
            ],
            [
                15474,
                15490
            ],
            [
                15561,
                15565
            ],
            [
                15617,
                15619
            ],
            [
                15619,
                15625
            ],
            [
                15684,
                15733
            ],
            [
                15970,
                16031
            ],
            [
                16062,
                16063
            ],
            [
                16033,
                16062
            ],
            [
                16120,
                16140
            ],
            [
                16162,
                16177
            ],
            [
                16210,
                16220
            ],
            [
                16092,
                16094
            ],
            [
                16231,
                16232
            ],
            [
                16233,
                16235
            ],
            [
                16253,
                16261
            ],
            [
                16274,
                16366
            ],
            [
                16405,
                16408
            ],
            [
                16423,
                16461
            ],
            [
                16470,
                16483
            ],
            [
                16484,
                16513
            ],
            [
                16553,
                16555
            ],
            [
                16613,
                16620
            ],
            [
                16598,
                16601
            ],
            [
                16634,
                16679
            ],
            [
                16913,
                16957
            ],
            [
                16746,
                16756
            ],
            [
                16962,
                16971
            ],
            [
                17002,
                17004
            ],
            [
                17022,
                17041
            ],
            [
                17007,
                17014
            ],
            [
                17068,
                17080
            ],
            [
                17080,
                17190
            ],
            [
                17197,
                17205
            ],
            [
                17234,
                17237
            ],
            [
                17246,
                17291
            ],
            [
                17811,
                17854
            ],
            [
                17755,
                17757
            ],
            [
                17789,
                17809
            ],
            [
                17854,
                17856
            ],
            [
                17856,
                17869
            ],
            [
                17879,
                17897
            ],
            [
                17904,
                18019
            ],
            [
                18115,
                18118
            ],
            [
                18020,
                18042
            ],
            [
                18054,
                18056
            ],
            [
                18043,
                18046
            ],
            [
                18057,
                18061
            ],
            [
                18072,
                18086
            ],
            [
                18124,
                18126
            ],
            [
                18126,
                18173
            ],
            [
                18202,
                18213
            ],
            [
                18217,
                18219
            ],
            [
                18352,
                18353
            ],
            [
                18272,
                18330
            ],
            [
                18422,
                18441
            ],
            [
                18344,
                18352
            ],
            [
                18441,
                18461
            ],
            [
                18478,
                18480
            ],
            [
                18552,
                18556
            ],
            [
                18522,
                18529
            ],
            [
                18604,
                18636
            ],
            [
                18658,
                18698
            ],
            [
                18736,
                18740
            ],
            [
                18556,
                18557
            ],
            [
                18763,
                18771
            ],
            [
                18808,
                18847
            ],
            [
                18876,
                18878
            ],
            [
                18878,
                18972
            ],
            [
                19013,
                19015
            ],
            [
                19015,
                19017
            ],
            [
                19042,
                19061
            ],
            [
                19069,
                19089
            ],
            [
                19187,
                19188
            ],
            [
                19212,
                19216
            ],
            [
                19311,
                19313
            ],
            [
                19236,
                19305
            ],
            [
                19371,
                19373
            ],
            [
                19373,
                19397
            ],
            [
                19410,
                19417
            ],
            [
                19430,
                19435
            ],
            [
                19440,
                19443
            ],
            [
                19530,
                19547
            ],
            [
                19559,
                19573
            ],
            [
                19574,
                19604
            ],
            [
                19615,
                19620
            ],
            [
                19605,
                19614
            ],
            [
                19621,
                19623
            ],
            [
                19633,
                19640
            ],
            [
                19656,
                19659
            ],
            [
                19685,
                19697
            ],
            [
                19697,
                19849
            ],
            [
                19851,
                19855
            ],
            [
                19901,
                19903
            ],
            [
                19918,
                19929
            ],
            [
                19930,
                19957
            ],
            [
                19963,
                20045
            ],
            [
                20045,
                20084
            ]
        ],
        "row_chars": [
            [
                0,
                256
            ],
            [
                256,
                432
            ],
            [
                432,
                648
            ],
            [
                648,
                762
            ],
            [
                762,
                1028
            ],
            [
                1028,
                1234
            ],
            [
                1234,
                1302
            ],
            [
                1302,
                1450
            ],
            [
                1450,
                1654
            ],
            [
                1654,
                1754
            ],
            [
                1754,
                1865
            ],
            [
                1865,
                1996
            ],
            [
                1996,
                2121
            ],
            [
                2121,
                2212
            ],
            [
                2212,
                2285
            ],
            [
                2285,
                2338
            ],
            [
                2338,
                2410
            ],
            [
                2410,
                2476
            ],
            [
                2476,
                2492
            ],
            [
                2492,
                2691
            ],
            [
                2691,
                2808
            ],
            [
                2808,
                2868
            ],
            [
                2868,
                2881
            ],
            [
                2881,
                3003
            ],
            [
                3003,
                3150
            ],
            [
                3150,
                3179
            ],
            [
                3179,
                3200
            ],
            [
                3200,
                3240
            ],
            [
                3240,
                3263
            ],
            [
                3263,
                3363
            ],
            [
                3363,
                3473
            ],
            [
                3473,
                3545
            ],
            [
                3545,
                3668
            ],
            [
                3668,
                3868
            ],
            [
                3868,
                3969
            ],
            [
                3969,
                4009
            ],
            [
                4009,
                4164
            ],
            [
                4164,
                4241
            ],
            [
                4241,
                4836
            ],
            [
                4836,
                5023
            ],
            [
                5023,
                5363
            ],
            [
                5363,
                5388
            ],
            [
                5388,
                5917
            ],
            [
                5917,
                6133
            ],
            [
                6133,
                6293
            ],
            [
                6293,
                6336
            ],
            [
                6336,
                6625
            ],
            [
                6625,
                6928
            ],
            [
                6928,
                6980
            ],
            [
                6980,
                7247
            ],
            [
                7247,
                7387
            ],
            [
                7387,
                7569
            ],
            [
                7569,
                7616
            ],
            [
                7616,
                7681
            ],
            [
                7681,
                7708
            ],
            [
                7708,
                7811
            ],
            [
                7811,
                7949
            ],
            [
                7949,
                8112
            ],
            [
                8112,
                8237
            ],
            [
                8237,
                8451
            ],
            [
                8451,
                8528
            ],
            [
                8528,
                8656
            ],
            [
                8656,
                8718
            ],
            [
                8718,
                8739
            ],
            [
                8739,
                8791
            ],
            [
                8791,
                8824
            ],
            [
                8824,
                8881
            ],
            [
                8881,
                8982
            ],
            [
                8982,
                9011
            ],
            [
                9011,
                9144
            ],
            [
                9144,
                9506
            ],
            [
                9506,
                9525
            ],
            [
                9525,
                9584
            ],
            [
                9584,
                9631
            ],
            [
                9631,
                9704
            ],
            [
                9704,
                9718
            ],
            [
                9718,
                9771
            ],
            [
                9771,
                9846
            ],
            [
                9846,
                9892
            ],
            [
                9892,
                9937
            ],
            [
                9937,
                10010
            ],
            [
                10010,
                10189
            ],
            [
                10189,
                10272
            ],
            [
                10272,
                10292
            ],
            [
                10292,
                10323
            ],
            [
                10323,
                10404
            ],
            [
                10404,
                10418
            ],
            [
                10418,
                10430
            ],
            [
                10430,
                10452
            ],
            [
                10452,
                10483
            ],
            [
                10483,
                10498
            ],
            [
                10498,
                10540
            ],
            [
                10540,
                10653
            ],
            [
                10653,
                10723
            ],
            [
                10723,
                10803
            ],
            [
                10803,
                10894
            ],
            [
                10894,
                11040
            ],
            [
                11040,
                11065
            ],
            [
                11065,
                11117
            ],
            [
                11117,
                11150
            ],
            [
                11150,
                11181
            ],
            [
                11181,
                11203
            ],
            [
                11203,
                11264
            ],
            [
                11264,
                11335
            ],
            [
                11335,
                11366
            ],
            [
                11366,
                11461
            ],
            [
                11461,
                11736
            ],
            [
                11736,
                11948
            ],
            [
                11948,
                11982
            ],
            [
                11982,
                12012
            ],
            [
                12012,
                12069
            ],
            [
                12069,
                12148
            ],
            [
                12148,
                12176
            ],
            [
                12176,
                12187
            ],
            [
                12187,
                12268
            ],
            [
                12268,
                12289
            ],
            [
                12289,
                12335
            ],
            [
                12335,
                12381
            ],
            [
                12381,
                12420
            ],
            [
                12420,
                12499
            ],
            [
                12499,
                12562
            ],
            [
                12562,
                12648
            ],
            [
                12648,
                12761
            ],
            [
                12761,
                12788
            ],
            [
                12788,
                12915
            ],
            [
                12915,
                12934
            ],
            [
                12934,
                12956
            ],
            [
                12956,
                13006
            ],
            [
                13006,
                13023
            ],
            [
                13023,
                13047
            ],
            [
                13047,
                13076
            ],
            [
                13076,
                13103
            ],
            [
                13103,
                13115
            ],
            [
                13115,
                13135
            ],
            [
                13135,
                13192
            ],
            [
                13192,
                13232
            ],
            [
                13232,
                13270
            ],
            [
                13270,
                13322
            ],
            [
                13322,
                13407
            ],
            [
                13407,
                13446
            ],
            [
                13446,
                13512
            ],
            [
                13512,
                13608
            ],
            [
                13608,
                13702
            ],
            [
                13702,
                13779
            ],
            [
                13779,
                13886
            ],
            [
                13886,
                13904
            ],
            [
                13904,
                13940
            ],
            [
                13940,
                13979
            ],
            [
                13979,
                13991
            ],
            [
                13991,
                14054
            ],
            [
                14054,
                14132
            ],
            [
                14132,
                14234
            ],
            [
                14234,
                14248
            ],
            [
                14248,
                14429
            ],
            [
                14429,
                14467
            ],
            [
                14467,
                14579
            ],
            [
                14579,
                14931
            ],
            [
                14931,
                15202
            ],
            [
                15202,
                15223
            ],
            [
                15223,
                15325
            ],
            [
                15325,
                15619
            ],
            [
                15619,
                15733
            ],
            [
                15733,
                15970
            ],
            [
                15970,
                16233
            ],
            [
                16233,
                16484
            ],
            [
                16484,
                16679
            ],
            [
                16679,
                17004
            ],
            [
                17004,
                17080
            ],
            [
                17080,
                17292
            ],
            [
                17292,
                17391
            ],
            [
                17391,
                17697
            ],
            [
                17697,
                17856
            ],
            [
                17856,
                18126
            ],
            [
                18126,
                18219
            ],
            [
                18219,
                18272
            ],
            [
                18272,
                18480
            ],
            [
                18480,
                18878
            ],
            [
                18878,
                19015
            ],
            [
                19015,
                19089
            ],
            [
                19089,
                19187
            ],
            [
                19187,
                19373
            ],
            [
                19373,
                19574
            ],
            [
                19574,
                19697
            ],
            [
                19697,
                20045
            ],
            [
                20045,
                20084
            ]
        ]
    },
    "abridged": {
        "text": "The twelve years following that dismal period, continued Mrs. Dean, were the happiest of my life: my greatest troubles were our little lady's minor illnesses. After the first six months, she grew like a larch, and could walk and talk before the heath blossomed a second time over Mrs. Linton's dust.\nShe was the most winning thing that ever brought sunshine into a desolate house: a real beauty, with the Earnshaws' handsome dark eyes, but the Lintons' fair skin and yellow curling hair. Her spirit was high, and her heart was sensitive and lively. That capacity for intense attachments reminded me of her mother: yet she did not resemble her: for she could be soft and mild as a dove, and she had a gentle voice. Her anger was never furious; her love never fierce: it was deep and tender.\nHowever, she was also saucy, like all indulged children. If a servant vexed her, it was always - 'I shall tell papa!' And if her father reproved her, even by a look, you would have thought her heart-broken: I don't believe he ever spoke a harsh word to her. He taught her himself, and she learned rapidly and eagerly.\nTill she reached the age of thirteen she had not once been beyond Thrushcross Park by herself. Mr. Linton would take her with him a mile or so outside, on rare occasions; but he trusted her to no one else. The chapel was the only building she had entered other than her own home. She knew nothing of Wuthering Heights and Mr. Heathcliff; and was, apparently, perfectly contented.\nSometimes, indeed, while surveying the country from her window, she would ask:\n'Ellen, how long will it be before I can walk to the top of those hills? I wonder what lies on the other side - is it the sea?'\n'No, Miss Cathy,' I would answer; 'it is hills again, just like these.'\n'And what are those golden rocks like when you stand under them?'\nPenistone Crags particularly attracted her notice; especially when the setting sun shone on their heights. I explained that they were bare masses of stone, with hardly enough earth in their clefts to nourish a stunted tree.\n'And why are they bright so long after it is evening here?' she pursued.\n'Because they are a great deal higher up than we are,' replied I; 'you could not climb them, they are too high and steep. In winter the frost is always there before it comes to us; and deep into summer I have found snow under their north-east side!'\n'Oh, you have been on them!' she cried gleefully. 'Then I can go, too, when I am a woman. Has papa been, Ellen?'\n'Papa would tell you, Miss,' I answered, hastily, 'that they are not worth the trouble of visiting. The moors, where you ramble with him, are much nicer; and Thrushcross Park is the finest place in the world.'\n'But I know the park, and I don't know those,' she murmured. 'And I should like to look round me from that tallest point: my pony Minny shall take me some time.'\n'Now, am I old enough to go to Penistone Crags?' became her constant question. The road there wound close by Wuthering Heights; and Edgar always answered, 'Not yet, love: not yet.'\nI said Mrs. Heathcliff lived over a dozen years after leaving her husband. She and Edgar were both delicate; what her last illness was, I am not certain, but she wrote to inform her brother that she was probably dying, and begged him to come to her. She wished to bid him adieu, and deliver her son Linton safely into his hands.\nMy master did not hesitate: reluctant as he usually was to leave home, he flew to her; telling me that in his absence, I must ensure that Catherine did not wander out of the park.\nHe was away three weeks. The first day or two Catherine sat in the library, too sad for either reading or playing: her quiet state caused me little trouble; but it was followed by fretful weariness; and to amuse her, I sent her on her travels round the grounds - on foot, or on a pony; listening to her real and imaginary adventures when she returned.\nThe summer shone; and she took such a taste for this solitary rambling that she often stayed out till tea; and then spent the evenings recounting her fanciful tales. I did not fear her leaving the park, because the gates were generally locked, and I thought she would scarcely venture out alone, even if they had stood wide open.\nUnluckily, my confidence proved misplaced. Catherine came to me one morning, and said she was an Arabian merchant, going to cross the Desert with his caravan; and I must give her plenty of food for herself, a horse, and three camels, impersonated by a large hound and a couple of pointer dogs. I put some dainties in a basket beside her saddle; and she sprang up gaily, and trotted off with a merry laugh, mocking my advice to avoid galloping.\nThe naughty thing never appeared at tea. The hound, being an old dog and fond of its ease, returned; but neither Cathy, nor the pony, nor the two pointers were visible in any direction: so I sent servants down this path and that, and went wandering in search of her myself.\nThere was a labourer working on the borders of the grounds, and I asked him if he had seen our young lady.\n'I saw her this morning,' he replied: 'she leapt her pony over the hedge yonder, and galloped out of sight.'\nYou may guess how I felt at hearing this news. It struck me directly she must have started for Penistone Crags.\n'What will become of her?' I exclaimed, making straight for the high-road. I walked swiftly, mile after mile, till a turn brought me in view of Wuthering Heights; but no Catherine could I see. The Crags lie about four miles from the Grange, and I began to fear night would fall before I could reach them.\n'What if she has slipped in clambering among them,' I reflected, 'and been killed, or broken some bones?' My suspense was painful; and in hurrying past the Heights it gave me great relief to see Charlie, the fiercest of the pointers, lying under a window, with a bleeding ear.\nI ran to the door and knocked loudly. A woman whom I knew answered: she had been servant there since the death of Mr. Earnshaw.\n'Ah,' said she, 'you are come a-seeking your little mistress! Don't be frightened. She's here safe: but I'm glad you're not the master.'\n'He is not at home then?' I panted, breathless.\n'No,' she replied: 'both he and Joseph are out, and they won't return this hour or more. Step in and rest a bit.'\nI entered, and beheld my stray lamb seated on the hearth, rocking herself in a little chair that had been her mother's when a child. She seemed perfectly at home, laughing and chattering to Hareton - now a great, strong lad of eighteen - who stared at her with curiosity and astonishment: comprehending little of the stream of remarks and questions which she poured forth.\n'Well, Miss!' I exclaimed, concealing my joy with an angry face. 'This is your last ride, till papa comes back. I'll not trust you again, you naughty, naughty girl!'\n'Aha, Ellen!' she cried gaily, jumping up and running to my side. 'I shall have a pretty story to tell tonight. Have you ever been here before?'\n'Put that hat on, and come home at once,' said I. 'I'm dreadfully grieved at you, Miss Cathy: you've done extremely wrong! It's no use pouting and crying: that won't repay the trouble I've had, scouring the country for you after your Papa charged me to keep you safe! You're a cunning little fox.'\n'What have I done?' sobbed she. 'Papa charged me nothing: he'll not scold me, Ellen - he's never cross, like you!'\n'Come, come!' I repeated. 'Let us have no petulance. Oh, for shame! You thirteen years old, and such a baby!'\n'Nay,' said the servant, 'don't be hard on the bonny lass, Mrs. Dean. We made her stop though she wanted to ride on. Hareton offered to go with her, and I thought he should: it's a wild road over the hills.'\nHareton stood with his hands in his pockets, too awkward to speak.\n'How long am I to wait?' I continued, ignoring the woman's interference. 'It will be dark in ten minutes. Where is the pony, Miss Cathy? And where is Phoenix? Be quick!'\n'The pony is in the yard,' she replied, 'and Phoenix is shut in there. He's been bitten - and so has Charlie. I was going to tell you all about it; but you are in a bad temper, and don't deserve to hear.'\nI picked up her hat, but she, seeing that the people of the house took her side, began to caper round the room; and on my giving chase, ran like a mouse over and under and behind the furniture. Hareton and the woman laughed, and she joined them; till I cried, in great irritation, 'Well, Miss Cathy, if you knew whose house this is you'd be glad enough to get out.'\n'It's your father's, isn't it?' said she, turning to Hareton.\n'Nay,' he replied, looking down, and blushing.\n'Whose then - your master's?' she asked.\nHe coloured deeper, muttered an oath, and turned away.\n'Who is his master?' continued the tiresome girl, appealing to me. 'He talked about \"our house,\" and \"our folk.\" I thought he was the owner's son. And he never said Miss: he should have done, shouldn't he, if he's a servant?'\nHareton grew black as a thunder-cloud at this. I silently shook Catherine, and put her hat on her head.\n'Get my horse,' she said, addressing Hareton as if he were a stable-boy. 'You may come with me. I want to see where the goblin-hunter rises in the marsh, and to hear about the fairishes, as you call them: but make haste! What's the matter? Get my horse, I say.'\n'I'll see thee damned before I be thy servant!' growled the lad.\n'You'll see me what?' asked Catherine in surprise.\n'Damned - thou saucy witch!' he replied.\n'There, Miss Cathy! you see you have got into pretty company,' I said. 'Nice words to use to a young lady! Don't argue with him. Come, let us find your pony, and begone.'\n'But, Ellen,' cried she, staring in astonishment, 'how dare he speak so to me? You wicked creature, I shall tell papa what you said!'\nHareton did not appear to feel this threat; so the tears sprang into her eyes with indignation. 'You bring the pony,' she exclaimed, turning to the woman, 'and let my dog free this moment!'\n'Softly, Miss,' she answered; 'you'll lose nothing by being civil. Mr. Hareton there is your cousin: and I was never hired to serve you.'\n'My cousin!' cried Cathy, with a scornful laugh.\n'Yes, indeed.'\n'Oh, Ellen! don't let them say such things,' she pursued, troubled. 'Papa is gone to fetch my cousin from London: my cousin is a gentleman's son. That-' she stopped, and wept outright.\n'Hush!' I whispered; 'people can have many cousins, Miss Cathy; only they needn't keep their company, if they be disagreeable and bad.'\n'He's not my cousin, Ellen!' she said.\nI was vexed. I had no doubt that Linton's approaching arrival would now be reported to Mr. Heathcliff; and I was sure that Catherine would seek an explanation about Hareton from her father as soon as he returned.\nHareton, recovering from his disgust at being taken for a servant, seemed moved by her distress; and, having fetched the pony to the door, he took a fine terrier pup from the kennel, and putting it into her hand, bid her whist! for he meant naught. She looked at him with awe and horror, then wept anew.\nI could scarcely help smiling at this antipathy to the poor fellow. He was a well-made, athletic youth, good-looking, strong and healthy, but dressed as a rough farm-worker. Still, he looked as if he had better qualities than his father ever possessed. Mr. Heathcliff, I believe, had not treated him physically ill, thanks to his fearless nature: he had none of the timidity that would have tempted Heathcliff to mistreat him.\nInstead, Heathcliff had bent his ill-will on making him a brute: he was never taught to read or write; never rebuked for any bad habit, nor led towards virtue, or guarded by a single word against vice.\nAnd from what I heard, Joseph had made matters worse by flattering and petting him, because he was the head of the old family. Joseph laid the whole burden of Hareton's faults on Heathcliff's shoulders. He wouldn't correct the lad no matter how ill he behaved. It gave Joseph satisfaction, apparently, to watch him go the worst lengths: he allowed that the lad was ruined and his soul damned, but reflected that Heathcliff must answer for it.\nI only speak from hearsay; for I saw little of life at Wuthering Heights. The villagers said Mr. Heathcliff was miserly, and a cruel hard landlord to his tenants; but the house, inside, had regained its ancient aspect of comfort under its female management, and there was none of the riot of Hindley's time. The master was too gloomy to seek companionship; and he is still.\nWell, Miss Cathy rejected the peace-offering of the terrier, and we set out for home with our own dogs, sadly out of sorts. She told me that she had aimed for Penistone Crags; and she arrived at the gate of the farm-house, when Hareton came out with some dogs, which attacked hers before their owners could separate them. Catherine told Hareton who she was, and where she was going; and asked him to show her the way. He told her about the Fairy Cave, and other queer places. I gathered that he was a favourite till she hurt his feelings by addressing him as a servant. Then the language he had used rankled; she was shocked to be insulted so by a stranger!\nShe did not comprehend it; and I had hard work to make her promise not to tell her father. I explained how he objected to the whole household at the Heights, and how sorry he would be to find she had been there; but I insisted most on the fact that he might be so angry with me that I should have to leave. Cathy couldn't bear that prospect: she pledged her word, and kept it for my sake. After all, she was a sweet little girl.",
        "paragraph_chars": [
            [
                0,
                300
            ],
            [
                300,
                790
            ],
            [
                790,
                1108
            ],
            [
                1108,
                1488
            ],
            [
                1488,
                1567
            ],
            [
                1567,
                1695
            ],
            [
                1695,
                1767
            ],
            [
                1767,
                1833
            ],
            [
                1833,
                2057
            ],
            [
                2057,
                2130
            ],
            [
                2130,
                2380
            ],
            [
                2380,
                2493
            ],
            [
                2493,
                2703
            ],
            [
                2703,
                2865
            ],
            [
                2865,
                3046
            ],
            [
                3046,
                3375
            ],
            [
                3375,
                3555
            ],
            [
                3555,
                3907
            ],
            [
                3907,
                4237
            ],
            [
                4237,
                4681
            ],
            [
                4681,
                4955
            ],
            [
                4955,
                5062
            ],
            [
                5062,
                5171
            ],
            [
                5171,
                5283
            ],
            [
                5283,
                5588
            ],
            [
                5588,
                5865
            ],
            [
                5865,
                5993
            ],
            [
                5993,
                6130
            ],
            [
                6130,
                6178
            ],
            [
                6178,
                6292
            ],
            [
                6292,
                6665
            ],
            [
                6665,
                6831
            ],
            [
                6831,
                6976
            ],
            [
                6976,
                7274
            ],
            [
                7274,
                7389
            ],
            [
                7389,
                7499
            ],
            [
                7499,
                7707
            ],
            [
                7707,
                7774
            ],
            [
                7774,
                7944
            ],
            [
                7944,
                8149
            ],
            [
                8149,
                8515
            ],
            [
                8515,
                8577
            ],
            [
                8577,
                8624
            ],
            [
                8624,
                8665
            ],
            [
                8665,
                8720
            ],
            [
                8720,
                8946
            ],
            [
                8946,
                9050
            ],
            [
                9050,
                9312
            ],
            [
                9312,
                9377
            ],
            [
                9377,
                9428
            ],
            [
                9428,
                9469
            ],
            [
                9469,
                9640
            ],
            [
                9640,
                9774
            ],
            [
                9774,
                9964
            ],
            [
                9964,
                10102
            ],
            [
                10102,
                10151
            ],
            [
                10151,
                10166
            ],
            [
                10166,
                10351
            ],
            [
                10351,
                10487
            ],
            [
                10487,
                10526
            ],
            [
                10526,
                10739
            ],
            [
                10739,
                11043
            ],
            [
                11043,
                11470
            ],
            [
                11470,
                11672
            ],
            [
                11672,
                12115
            ],
            [
                12115,
                12489
            ],
            [
                12489,
                13147
            ],
            [
                13147,
                13575
            ]
        ],
        "segment_chars": [
            [
                0,
                159
            ],
            [
                159,
                300
            ],
            [
                300,
                488
            ],
            [
                488,
                549
            ],
            [
                549,
                714
            ],
            [
                714,
                790
            ],
            [
                790,
                847
            ],
            [
                847,
                908
            ],
            [
                908,
                1048
            ],
            [
                1048,
                1108
            ],
            [
                1108,
                1203
            ],
            [
                1203,
                1314
            ],
            [
                1314,
                1388
            ],
            [
                1388,
                1488
            ],
            [
                1488,
                1567
            ],
            [
                1567,
                1640
            ],
            [
                1640,
                1695
            ],
            [
                1695,
                1767
            ],
            [
                1767,
                1833
            ],
            [
                1833,
                1940
            ],
            [
                1940,
                2057
            ],
            [
                2057,
                2117
            ],
            [
                2117,
                2130
            ],
            [
                2130,
                2252
            ],
            [
                2252,
                2380
            ],
            [
                2380,
                2409
            ],
            [
                2409,
                2430
            ],
            [
                2430,
                2470
            ],
            [
                2470,
                2493
            ],
            [
                2493,
                2593
            ],
            [
                2593,
                2703
            ],
            [
                2703,
                2764
            ],
            [
                2764,
                2865
            ],
            [
                2865,
                2914
            ],
            [
                2914,
                2944
            ],
            [
                2944,
                3046
            ],
            [
                3046,
                3121
            ],
            [
                3121,
                3296
            ],
            [
                3296,
                3375
            ],
            [
                3375,
                3555
            ],
            [
                3555,
                3580
            ],
            [
                3580,
                3907
            ],
            [
                3907,
                4073
            ],
            [
                4073,
                4237
            ],
            [
                4237,
                4280
            ],
            [
                4280,
                4531
            ],
            [
                4531,
                4681
            ],
            [
                4681,
                4722
            ],
            [
                4722,
                4955
            ],
            [
                4955,
                5062
            ],
            [
                5062,
                5171
            ],
            [
                5171,
                5218
            ],
            [
                5218,
                5283
            ],
            [
                5283,
                5310
            ],
            [
                5310,
                5358
            ],
            [
                5358,
                5476
            ],
            [
                5476,
                5588
            ],
            [
                5588,
                5694
            ],
            [
                5694,
                5865
            ],
            [
                5865,
                5903
            ],
            [
                5903,
                5993
            ],
            [
                5993,
                6055
            ],
            [
                6055,
                6076
            ],
            [
                6076,
                6130
            ],
            [
                6130,
                6156
            ],
            [
                6156,
                6178
            ],
            [
                6178,
                6267
            ],
            [
                6267,
                6292
            ],
            [
                6292,
                6425
            ],
            [
                6425,
                6665
            ],
            [
                6665,
                6679
            ],
            [
                6679,
                6730
            ],
            [
                6730,
                6777
            ],
            [
                6777,
                6831
            ],
            [
                6831,
                6845
            ],
            [
                6845,
                6897
            ],
            [
                6897,
                6943
            ],
            [
                6943,
                6976
            ],
            [
                6976,
                7026
            ],
            [
                7026,
                7099
            ],
            [
                7099,
                7244
            ],
            [
                7244,
                7274
            ],
            [
                7274,
                7294
            ],
            [
                7294,
                7306
            ],
            [
                7306,
                7389
            ],
            [
                7389,
                7403
            ],
            [
                7403,
                7415
            ],
            [
                7415,
                7442
            ],
            [
                7442,
                7457
            ],
            [
                7457,
                7499
            ],
            [
                7499,
                7569
            ],
            [
                7569,
                7616
            ],
            [
                7616,
                7707
            ],
            [
                7707,
                7774
            ],
            [
                7774,
                7799
            ],
            [
                7799,
                7847
            ],
            [
                7847,
                7880
            ],
            [
                7880,
                7911
            ],
            [
                7911,
                7933
            ],
            [
                7933,
                7944
            ],
            [
                7944,
                8015
            ],
            [
                8015,
                8054
            ],
            [
                8054,
                8149
            ],
            [
                8149,
                8343
            ],
            [
                8343,
                8515
            ],
            [
                8515,
                8547
            ],
            [
                8547,
                8577
            ],
            [
                8577,
                8624
            ],
            [
                8624,
                8654
            ],
            [
                8654,
                8665
            ],
            [
                8665,
                8720
            ],
            [
                8720,
                8741
            ],
            [
                8741,
                8787
            ],
            [
                8787,
                8833
            ],
            [
                8833,
                8867
            ],
            [
                8867,
                8946
            ],
            [
                8946,
                8993
            ],
            [
                8993,
                9050
            ],
            [
                9050,
                9123
            ],
            [
                9123,
                9146
            ],
            [
                9146,
                9271
            ],
            [
                9271,
                9290
            ],
            [
                9290,
                9312
            ],
            [
                9312,
                9360
            ],
            [
                9360,
                9377
            ],
            [
                9377,
                9399
            ],
            [
                9399,
                9428
            ],
            [
                9428,
                9457
            ],
            [
                9457,
                9469
            ],
            [
                9469,
                9489
            ],
            [
                9489,
                9540
            ],
            [
                9540,
                9576
            ],
            [
                9576,
                9598
            ],
            [
                9598,
                9640
            ],
            [
                9640,
                9719
            ],
            [
                9719,
                9774
            ],
            [
                9774,
                9870
            ],
            [
                9870,
                9964
            ],
            [
                9964,
                10031
            ],
            [
                10031,
                10102
            ],
            [
                10102,
                10115
            ],
            [
                10115,
                10151
            ],
            [
                10151,
                10166
            ],
            [
                10166,
                10178
            ],
            [
                10178,
                10234
            ],
            [
                10234,
                10312
            ],
            [
                10312,
                10351
            ],
            [
                10351,
                10359
            ],
            [
                10359,
                10487
            ],
            [
                10487,
                10516
            ],
            [
                10516,
                10526
            ],
            [
                10526,
                10539
            ],
            [
                10539,
                10739
            ],
            [
                10739,
                10967
            ],
            [
                10967,
                10988
            ],
            [
                10988,
                11043
            ],
            [
                11043,
                11111
            ],
            [
                11111,
                11217
            ],
            [
                11217,
                11296
            ],
            [
                11296,
                11470
            ],
            [
                11470,
                11672
            ],
            [
                11672,
                11799
            ],
            [
                11799,
                11875
            ],
            [
                11875,
                11933
            ],
            [
                11933,
                12115
            ],
            [
                12115,
                12189
            ],
            [
                12189,
                12423
            ],
            [
                12423,
                12489
            ],
            [
                12489,
                12613
            ],
            [
                12613,
                12811
            ],
            [
                12811,
                12907
            ],
            [
                12907,
                12965
            ],
            [
                12965,
                13059
            ],
            [
                13059,
                13147
            ],
            [
                13147,
                13238
            ],
            [
                13238,
                13454
            ],
            [
                13454,
                13536
            ],
            [
                13536,
                13575
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                17,
                45
            ],
            [
                45,
                67
            ],
            [
                68,
                118
            ],
            [
                124,
                141
            ],
            [
                148,
                157
            ],
            [
                157,
                159
            ],
            [
                159,
                233
            ],
            [
                234,
                299
            ],
            [
                300,
                394
            ],
            [
                394,
                466
            ],
            [
                467,
                488
            ],
            [
                488,
                508
            ],
            [
                509,
                512
            ],
            [
                517,
                522
            ],
            [
                527,
                547
            ],
            [
                547,
                549
            ],
            [
                549,
                613
            ],
            [
                618,
                712
            ],
            [
                714,
                789
            ],
            [
                790,
                798
            ],
            [
                799,
                802
            ],
            [
                803,
                806
            ],
            [
                812,
                817
            ],
            [
                817,
                818
            ],
            [
                828,
                845
            ],
            [
                845,
                847
            ],
            [
                847,
                859
            ],
            [
                860,
                863
            ],
            [
                866,
                884
            ],
            [
                888,
                905
            ],
            [
                908,
                914
            ],
            [
                926,
                978
            ],
            [
                983,
                989
            ],
            [
                995,
                1020
            ],
            [
                1027,
                1048
            ],
            [
                1048,
                1050
            ],
            [
                1058,
                1061
            ],
            [
                1062,
                1074
            ],
            [
                1075,
                1106
            ],
            [
                1106,
                1108
            ],
            [
                1108,
                1173
            ],
            [
                1186,
                1203
            ],
            [
                1203,
                1314
            ],
            [
                1314,
                1324
            ],
            [
                1325,
                1328
            ],
            [
                1329,
                1354
            ],
            [
                1355,
                1362
            ],
            [
                1374,
                1388
            ],
            [
                1388,
                1391
            ],
            [
                1408,
                1444
            ],
            [
                1444,
                1449
            ],
            [
                1450,
                1453
            ],
            [
                1453,
                1487
            ],
            [
                1488,
                1543
            ],
            [
                1544,
                1561
            ],
            [
                1568,
                1640
            ],
            [
                1640,
                1692
            ],
            [
                1696,
                1710
            ],
            [
                1713,
                1728
            ],
            [
                1730,
                1764
            ],
            [
                1768,
                1830
            ],
            [
                1833,
                1924
            ],
            [
                1931,
                1938
            ],
            [
                1938,
                1940
            ],
            [
                1940,
                2057
            ],
            [
                2058,
                2114
            ],
            [
                2117,
                2130
            ],
            [
                2131,
                2182
            ],
            [
                2185,
                2195
            ],
            [
                2197,
                2252
            ],
            [
                2252,
                2355
            ],
            [
                2362,
                2377
            ],
            [
                2381,
                2406
            ],
            [
                2409,
                2430
            ],
            [
                2436,
                2470
            ],
            [
                2470,
                2490
            ],
            [
                2494,
                2519
            ],
            [
                2522,
                2542
            ],
            [
                2544,
                2593
            ],
            [
                2593,
                2700
            ],
            [
                2704,
                2747
            ],
            [
                2750,
                2762
            ],
            [
                2762,
                2764
            ],
            [
                2765,
                2777
            ],
            [
                2783,
                2804
            ],
            [
                2805,
                2827
            ],
            [
                2828,
                2862
            ],
            [
                2866,
                2911
            ],
            [
                2921,
                2924
            ],
            [
                2925,
                2942
            ],
            [
                2942,
                2944
            ],
            [
                2944,
                2952
            ],
            [
                2959,
                2991
            ],
            [
                2991,
                2992
            ],
            [
                2997,
                3002
            ],
            [
                3018,
                3019
            ],
            [
                3021,
                3043
            ],
            [
                3046,
                3074
            ],
            [
                3080,
                3099
            ],
            [
                3108,
                3121
            ],
            [
                3121,
                3134
            ],
            [
                3135,
                3139
            ],
            [
                3140,
                3144
            ],
            [
                3145,
                3153
            ],
            [
                3153,
                3154
            ],
            [
                3155,
                3198
            ],
            [
                3198,
                3203
            ],
            [
                3204,
                3235
            ],
            [
                3236,
                3240
            ],
            [
                3241,
                3244
            ],
            [
                3263,
                3268
            ],
            [
                3276,
                3294
            ],
            [
                3294,
                3295
            ],
            [
                3296,
                3336
            ],
            [
                3337,
                3340
            ],
            [
                3345,
                3374
            ],
            [
                3375,
                3384
            ],
            [
                3385,
                3392
            ],
            [
                3401,
                3418
            ],
            [
                3427,
                3444
            ],
            [
                3444,
                3456
            ],
            [
                3457,
                3460
            ],
            [
                3460,
                3461
            ],
            [
                3473,
                3477
            ],
            [
                3478,
                3493
            ],
            [
                3496,
                3500
            ],
            [
                3513,
                3522
            ],
            [
                3527,
                3553
            ],
            [
                3553,
                3555
            ],
            [
                3555,
                3580
            ],
            [
                3580,
                3600
            ],
            [
                3611,
                3617
            ],
            [
                3618,
                3669
            ],
            [
                3670,
                3673
            ],
            [
                3674,
                3685
            ],
            [
                3686,
                3722
            ],
            [
                3732,
                3734
            ],
            [
                3735,
                3757
            ],
            [
                3758,
                3760
            ],
            [
                3767,
                3773
            ],
            [
                3779,
                3817
            ],
            [
                3818,
                3826
            ],
            [
                3830,
                3840
            ],
            [
                3851,
                3853
            ],
            [
                3854,
                3907
            ],
            [
                3907,
                3923
            ],
            [
                3923,
                3992
            ],
            [
                4000,
                4003
            ],
            [
                4004,
                4022
            ],
            [
                4023,
                4028
            ],
            [
                4029,
                4041
            ],
            [
                4042,
                4073
            ],
            [
                4073,
                4091
            ],
            [
                4110,
                4191
            ],
            [
                4196,
                4202
            ],
            [
                4208,
                4236
            ],
            [
                4237,
                4280
            ],
            [
                4280,
                4300
            ],
            [
                4301,
                4312
            ],
            [
                4312,
                4330
            ],
            [
                4331,
                4425
            ],
            [
                4431,
                4442
            ],
            [
                4442,
                4443
            ],
            [
                4444,
                4470
            ],
            [
                4479,
                4516
            ],
            [
                4529,
                4531
            ],
            [
                4531,
                4532
            ],
            [
                4542,
                4550
            ],
            [
                4551,
                4562
            ],
            [
                4570,
                4573
            ],
            [
                4574,
                4599
            ],
            [
                4605,
                4653
            ],
            [
                4661,
                4679
            ],
            [
                4679,
                4680
            ],
            [
                4681,
                4704
            ],
            [
                4714,
                4722
            ],
            [
                4722,
                4866
            ],
            [
                4870,
                4871
            ],
            [
                4886,
                4900
            ],
            [
                4901,
                4909
            ],
            [
                4909,
                4914
            ],
            [
                4915,
                4954
            ],
            [
                4955,
                4983
            ],
            [
                4984,
                5013
            ],
            [
                5013,
                5014
            ],
            [
                5019,
                5020
            ],
            [
                5027,
                5062
            ],
            [
                5063,
                5072
            ],
            [
                5088,
                5099
            ],
            [
                5101,
                5114
            ],
            [
                5120,
                5141
            ],
            [
                5141,
                5168
            ],
            [
                5171,
                5218
            ],
            [
                5218,
                5282
            ],
            [
                5284,
                5307
            ],
            [
                5310,
                5311
            ],
            [
                5321,
                5322
            ],
            [
                5323,
                5338
            ],
            [
                5343,
                5358
            ],
            [
                5358,
                5366
            ],
            [
                5374,
                5426
            ],
            [
                5427,
                5428
            ],
            [
                5437,
                5470
            ],
            [
                5474,
                5476
            ],
            [
                5476,
                5495
            ],
            [
                5496,
                5500
            ],
            [
                5507,
                5523
            ],
            [
                5524,
                5527
            ],
            [
                5528,
                5560
            ],
            [
                5568,
                5587
            ],
            [
                5589,
                5600
            ],
            [
                5605,
                5637
            ],
            [
                5640,
                5652
            ],
            [
                5654,
                5685
            ],
            [
                5686,
                5691
            ],
            [
                5694,
                5709
            ],
            [
                5710,
                5722
            ],
            [
                5723,
                5734
            ],
            [
                5740,
                5743
            ],
            [
                5752,
                5762
            ],
            [
                5769,
                5778
            ],
            [
                5783,
                5848
            ],
            [
                5851,
                5864
            ],
            [
                5865,
                5866
            ],
            [
                5867,
                5882
            ],
            [
                5883,
                5886
            ],
            [
                5901,
                5903
            ],
            [
                5903,
                5922
            ],
            [
                5923,
                5993
            ],
            [
                5994,
                5996
            ],
            [
                5999,
                6008
            ],
            [
                6010,
                6055
            ],
            [
                6055,
                6076
            ],
            [
                6076,
                6105
            ],
            [
                6117,
                6127
            ],
            [
                6131,
                6153
            ],
            [
                6156,
                6165
            ],
            [
                6166,
                6176
            ],
            [
                6176,
                6178
            ],
            [
                6179,
                6181
            ],
            [
                6184,
                6196
            ],
            [
                6198,
                6220
            ],
            [
                6224,
                6229
            ],
            [
                6230,
                6267
            ],
            [
                6267,
                6283
            ],
            [
                6284,
                6289
            ],
            [
                6292,
                6425
            ],
            [
                6425,
                6478
            ],
            [
                6479,
                6552
            ],
            [
                6553,
                6594
            ],
            [
                6595,
                6608
            ],
            [
                6616,
                6646
            ],
            [
                6658,
                6665
            ],
            [
                6666,
                6676
            ],
            [
                6679,
                6709
            ],
            [
                6715,
                6723
            ],
            [
                6728,
                6730
            ],
            [
                6736,
                6777
            ],
            [
                6777,
                6795
            ],
            [
                6796,
                6828
            ],
            [
                6832,
                6842
            ],
            [
                6845,
                6854
            ],
            [
                6855,
                6897
            ],
            [
                6898,
                6933
            ],
            [
                6941,
                6943
            ],
            [
                6943,
                6966
            ],
            [
                6967,
                6973
            ],
            [
                6977,
                6997
            ],
            [
                7003,
                7015
            ],
            [
                7018,
                7026
            ],
            [
                7027,
                7099
            ],
            [
                7099,
                7190
            ],
            [
                7195,
                7198
            ],
            [
                7199,
                7204
            ],
            [
                7215,
                7237
            ],
            [
                7242,
                7244
            ],
            [
                7244,
                7247
            ],
            [
                7251,
                7271
            ],
            [
                7275,
                7291
            ],
            [
                7294,
                7304
            ],
            [
                7304,
                7306
            ],
            [
                7307,
                7386
            ],
            [
                7390,
                7400
            ],
            [
                7403,
                7415
            ],
            [
                7416,
                7442
            ],
            [
                7442,
                7457
            ],
            [
                7457,
                7496
            ],
            [
                7500,
                7503
            ],
            [
                7506,
                7523
            ],
            [
                7525,
                7569
            ],
            [
                7569,
                7585
            ],
            [
                7593,
                7596
            ],
            [
                7614,
                7616
            ],
            [
                7616,
                7704
            ],
            [
                7707,
                7714
            ],
            [
                7715,
                7772
            ],
            [
                7772,
                7774
            ],
            [
                7775,
                7796
            ],
            [
                7799,
                7811
            ],
            [
                7821,
                7847
            ],
            [
                7848,
                7880
            ],
            [
                7880,
                7911
            ],
            [
                7911,
                7933
            ],
            [
                7933,
                7941
            ],
            [
                7949,
                7968
            ],
            [
                7971,
                7983
            ],
            [
                7985,
                8015
            ],
            [
                8015,
                8019
            ],
            [
                8025,
                8040
            ],
            [
                8045,
                8054
            ],
            [
                8054,
                8146
            ],
            [
                8149,
                8169
            ],
            [
                8170,
                8173
            ],
            [
                8174,
                8177
            ],
            [
                8177,
                8178
            ],
            [
                8186,
                8223
            ],
            [
                8228,
                8229
            ],
            [
                8236,
                8238
            ],
            [
                8239,
                8242
            ],
            [
                8245,
                8341
            ],
            [
                8341,
                8343
            ],
            [
                8343,
                8393
            ],
            [
                8393,
                8428
            ],
            [
                8428,
                8429
            ],
            [
                8431,
                8455
            ],
            [
                8461,
                8512
            ],
            [
                8516,
                8520
            ],
            [
                8521,
                8525
            ],
            [
                8526,
                8544
            ],
            [
                8547,
                8577
            ],
            [
                8578,
                8581
            ],
            [
                8584,
                8622
            ],
            [
                8622,
                8624
            ],
            [
                8625,
                8651
            ],
            [
                8654,
                8665
            ],
            [
                8665,
                8683
            ],
            [
                8683,
                8720
            ],
            [
                8721,
                8738
            ],
            [
                8741,
                8787
            ],
            [
                8787,
                8788
            ],
            [
                8788,
                8803
            ],
            [
                8804,
                8805
            ],
            [
                8805,
                8814
            ],
            [
                8817,
                8820
            ],
            [
                8822,
                8830
            ],
            [
                8833,
                8845
            ],
            [
                8850,
                8867
            ],
            [
                8867,
                8943
            ],
            [
                8946,
                8991
            ],
            [
                8991,
                8993
            ],
            [
                8993,
                9009
            ],
            [
                9019,
                9024
            ],
            [
                9029,
                9032
            ],
            [
                9048,
                9050
            ],
            [
                9051,
                9063
            ],
            [
                9066,
                9086
            ],
            [
                9095,
                9097
            ],
            [
                9111,
                9118
            ],
            [
                9121,
                9123
            ],
            [
                9124,
                9146
            ],
            [
                9146,
                9225
            ],
            [
                9226,
                9235
            ],
            [
                9235,
                9271
            ],
            [
                9271,
                9290
            ],
            [
                9290,
                9309
            ],
            [
                9313,
                9345
            ],
            [
                9346,
                9349
            ],
            [
                9350,
                9357
            ],
            [
                9360,
                9377
            ],
            [
                9378,
                9391
            ],
            [
                9392,
                9396
            ],
            [
                9399,
                9428
            ],
            [
                9432,
                9437
            ],
            [
                9443,
                9454
            ],
            [
                9457,
                9469
            ],
            [
                9475,
                9489
            ],
            [
                9489,
                9529
            ],
            [
                9532,
                9533
            ],
            [
                9538,
                9540
            ],
            [
                9541,
                9554
            ],
            [
                9559,
                9576
            ],
            [
                9576,
                9581
            ],
            [
                9588,
                9598
            ],
            [
                9598,
                9610
            ],
            [
                9625,
                9637
            ],
            [
                9641,
                9651
            ],
            [
                9654,
                9672
            ],
            [
                9673,
                9689
            ],
            [
                9691,
                9719
            ],
            [
                9719,
                9771
            ],
            [
                9774,
                9870
            ],
            [
                9871,
                9889
            ],
            [
                9892,
                9928
            ],
            [
                9930,
                9961
            ],
            [
                9969,
                9977
            ],
            [
                9980,
                9983
            ],
            [
                9984,
                9992
            ],
            [
                9992,
                9993
            ],
            [
                9995,
                10031
            ],
            [
                10033,
                10042
            ],
            [
                10043,
                10048
            ],
            [
                10052,
                10099
            ],
            [
                10106,
                10112
            ],
            [
                10115,
                10151
            ],
            [
                10152,
                10163
            ],
            [
                10167,
                10178
            ],
            [
                10178,
                10208
            ],
            [
                10211,
                10222
            ],
            [
                10232,
                10234
            ],
            [
                10235,
                10312
            ],
            [
                10312,
                10316
            ],
            [
                10319,
                10349
            ],
            [
                10349,
                10351
            ],
            [
                10352,
                10356
            ],
            [
                10359,
                10371
            ],
            [
                10373,
                10401
            ],
            [
                10401,
                10413
            ],
            [
                10413,
                10484
            ],
            [
                10488,
                10513
            ],
            [
                10516,
                10519
            ],
            [
                10524,
                10526
            ],
            [
                10526,
                10531
            ],
            [
                10532,
                10537
            ],
            [
                10537,
                10538
            ],
            [
                10545,
                10553
            ],
            [
                10559,
                10587
            ],
            [
                10588,
                10593
            ],
            [
                10598,
                10600
            ],
            [
                10601,
                10632
            ],
            [
                10644,
                10658
            ],
            [
                10665,
                10684
            ],
            [
                10704,
                10714
            ],
            [
                10715,
                10717
            ],
            [
                10739,
                10864
            ],
            [
                10865,
                10885
            ],
            [
                10886,
                10892
            ],
            [
                10893,
                10900
            ],
            [
                10905,
                10967
            ],
            [
                10967,
                10981
            ],
            [
                10986,
                10988
            ],
            [
                10988,
                10991
            ],
            [
                11002,
                11010
            ],
            [
                11011,
                11031
            ],
            [
                11037,
                11043
            ],
            [
                11043,
                11059
            ],
            [
                11065,
                11109
            ],
            [
                11114,
                11159
            ],
            [
                11159,
                11160
            ],
            [
                11168,
                11184
            ],
            [
                11204,
                11208
            ],
            [
                11215,
                11217
            ],
            [
                11217,
                11223
            ],
            [
                11247,
                11296
            ],
            [
                11296,
                11357
            ],
            [
                11357,
                11358
            ],
            [
                11359,
                11388
            ],
            [
                11388,
                11408
            ],
            [
                11418,
                11433
            ],
            [
                11442,
                11452
            ],
            [
                11453,
                11455
            ],
            [
                11468,
                11469
            ],
            [
                11479,
                11481
            ],
            [
                11494,
                11502
            ],
            [
                11512,
                11604
            ],
            [
                11610,
                11613
            ],
            [
                11614,
                11652
            ],
            [
                11658,
                11671
            ],
            [
                11672,
                11701
            ],
            [
                11725,
                11727
            ],
            [
                11739,
                11746
            ],
            [
                11751,
                11754
            ],
            [
                11754,
                11799
            ],
            [
                11806,
                11850
            ],
            [
                11851,
                11861
            ],
            [
                11864,
                11873
            ],
            [
                11873,
                11875
            ],
            [
                11875,
                11894
            ],
            [
                11895,
                11902
            ],
            [
                11921,
                11933
            ],
            [
                11933,
                12043
            ],
            [
                12048,
                12056
            ],
            [
                12065,
                12068
            ],
            [
                12069,
                12114
            ],
            [
                12115,
                12158
            ],
            [
                12159,
                12161
            ],
            [
                12167,
                12187
            ],
            [
                12187,
                12189
            ],
            [
                12189,
                12202
            ],
            [
                12208,
                12226
            ],
            [
                12234,
                12349
            ],
            [
                12350,
                12353
            ],
            [
                12354,
                12376
            ],
            [
                12392,
                12394
            ],
            [
                12395,
                12398
            ],
            [
                12399,
                12403
            ],
            [
                12407,
                12421
            ],
            [
                12421,
                12423
            ],
            [
                12423,
                12470
            ],
            [
                12470,
                12481
            ],
            [
                12487,
                12489
            ],
            [
                12493,
                12494
            ],
            [
                12495,
                12553
            ],
            [
                12554,
                12573
            ],
            [
                12583,
                12591
            ],
            [
                12591,
                12611
            ],
            [
                12611,
                12613
            ],
            [
                12625,
                12629
            ],
            [
                12630,
                12637
            ],
            [
                12648,
                12680
            ],
            [
                12684,
                12724
            ],
            [
                12739,
                12743
            ],
            [
                12748,
                12749
            ],
            [
                12756,
                12764
            ],
            [
                12770,
                12809
            ],
            [
                12809,
                12811
            ],
            [
                12811,
                12905
            ],
            [
                12905,
                12907
            ],
            [
                12907,
                12909
            ],
            [
                12925,
                12944
            ],
            [
                12945,
                12965
            ],
            [
                12965,
                12966
            ],
            [
                12976,
                12980
            ],
            [
                12981,
                12983
            ],
            [
                12988,
                13057
            ],
            [
                13057,
                13059
            ],
            [
                13059,
                13083
            ],
            [
                13089,
                13096
            ],
            [
                13096,
                13101
            ],
            [
                13102,
                13105
            ],
            [
                13114,
                13131
            ],
            [
                13132,
                13146
            ],
            [
                13147,
                13177
            ],
            [
                13178,
                13183
            ],
            [
                13184,
                13193
            ],
            [
                13194,
                13196
            ],
            [
                13206,
                13213
            ],
            [
                13214,
                13217
            ],
            [
                13226,
                13238
            ],
            [
                13238,
                13390
            ],
            [
                13391,
                13395
            ],
            [
                13396,
                13398
            ],
            [
                13405,
                13416
            ],
            [
                13425,
                13452
            ],
            [
                13454,
                13536
            ],
            [
                13536,
                13575
            ]
        ],
        "row_chars": [
            [
                0,
                159
            ],
            [
                159,
                300
            ],
            [
                300,
                488
            ],
            [
                488,
                549
            ],
            [
                549,
                790
            ],
            [
                790,
                847
            ],
            [
                847,
                908
            ],
            [
                908,
                1048
            ],
            [
                1048,
                1108
            ],
            [
                1108,
                1203
            ],
            [
                1203,
                1314
            ],
            [
                1314,
                1388
            ],
            [
                1388,
                1488
            ],
            [
                1488,
                1567
            ],
            [
                1567,
                1640
            ],
            [
                1640,
                1695
            ],
            [
                1695,
                1767
            ],
            [
                1767,
                1833
            ],
            [
                1833,
                1833
            ],
            [
                1833,
                1940
            ],
            [
                1940,
                2057
            ],
            [
                2057,
                2117
            ],
            [
                2117,
                2130
            ],
            [
                2130,
                2252
            ],
            [
                2252,
                2380
            ],
            [
                2380,
                2409
            ],
            [
                2409,
                2430
            ],
            [
                2430,
                2470
            ],
            [
                2470,
                2493
            ],
            [
                2493,
                2593
            ],
            [
                2593,
                2703
            ],
            [
                2703,
                2764
            ],
            [
                2764,
                2865
            ],
            [
                2865,
                2865
            ],
            [
                2865,
                2914
            ],
            [
                2914,
                2944
            ],
            [
                2944,
                3046
            ],
            [
                3046,
                3121
            ],
            [
                3121,
                3375
            ],
            [
                3375,
                3375
            ],
            [
                3375,
                3555
            ],
            [
                3555,
                3580
            ],
            [
                3580,
                3907
            ],
            [
                3907,
                4073
            ],
            [
                4073,
                4237
            ],
            [
                4237,
                4280
            ],
            [
                4280,
                4531
            ],
            [
                4531,
                4681
            ],
            [
                4681,
                4722
            ],
            [
                4722,
                4955
            ],
            [
                4955,
                5062
            ],
            [
                5062,
                5171
            ],
            [
                5171,
                5218
            ],
            [
                5218,
                5283
            ],
            [
                5283,
                5310
            ],
            [
                5310,
                5358
            ],
            [
                5358,
                5476
            ],
            [
                5476,
                5588
            ],
            [
                5588,
                5694
            ],
            [
                5694,
                5865
            ],
            [
                5865,
                5903
            ],
            [
                5903,
                5993
            ],
            [
                5993,
                6055
            ],
            [
                6055,
                6076
            ],
            [
                6076,
                6130
            ],
            [
                6130,
                6156
            ],
            [
                6156,
                6178
            ],
            [
                6178,
                6267
            ],
            [
                6267,
                6292
            ],
            [
                6292,
                6425
            ],
            [
                6425,
                6665
            ],
            [
                6665,
                6679
            ],
            [
                6679,
                6730
            ],
            [
                6730,
                6777
            ],
            [
                6777,
                6831
            ],
            [
                6831,
                6845
            ],
            [
                6845,
                6897
            ],
            [
                6897,
                6943
            ],
            [
                6943,
                6976
            ],
            [
                6976,
                7026
            ],
            [
                7026,
                7099
            ],
            [
                7099,
                7244
            ],
            [
                7244,
                7274
            ],
            [
                7274,
                7294
            ],
            [
                7294,
                7306
            ],
            [
                7306,
                7389
            ],
            [
                7389,
                7403
            ],
            [
                7403,
                7415
            ],
            [
                7415,
                7415
            ],
            [
                7415,
                7442
            ],
            [
                7442,
                7457
            ],
            [
                7457,
                7499
            ],
            [
                7499,
                7499
            ],
            [
                7499,
                7569
            ],
            [
                7569,
                7616
            ],
            [
                7616,
                7707
            ],
            [
                7707,
                7774
            ],
            [
                7774,
                7799
            ],
            [
                7799,
                7847
            ],
            [
                7847,
                7880
            ],
            [
                7880,
                7911
            ],
            [
                7911,
                7933
            ],
            [
                7933,
                7944
            ],
            [
                7944,
                8015
            ],
            [
                8015,
                8054
            ],
            [
                8054,
                8149
            ],
            [
                8149,
                8343
            ],
            [
                8343,
                8515
            ],
            [
                8515,
                8547
            ],
            [
                8547,
                8577
            ],
            [
                8577,
                8624
            ],
            [
                8624,
                8624
            ],
            [
                8624,
                8654
            ],
            [
                8654,
                8665
            ],
            [
                8665,
                8720
            ],
            [
                8720,
                8741
            ],
            [
                8741,
                8787
            ],
            [
                8787,
                8833
            ],
            [
                8833,
                8867
            ],
            [
                8867,
                8946
            ],
            [
                8946,
                8993
            ],
            [
                8993,
                9050
            ],
            [
                9050,
                9123
            ],
            [
                9123,
                9146
            ],
            [
                9146,
                9271
            ],
            [
                9271,
                9290
            ],
            [
                9290,
                9312
            ],
            [
                9312,
                9360
            ],
            [
                9360,
                9377
            ],
            [
                9377,
                9399
            ],
            [
                9399,
                9428
            ],
            [
                9428,
                9457
            ],
            [
                9457,
                9469
            ],
            [
                9469,
                9489
            ],
            [
                9489,
                9540
            ],
            [
                9540,
                9576
            ],
            [
                9576,
                9598
            ],
            [
                9598,
                9640
            ],
            [
                9640,
                9719
            ],
            [
                9719,
                9719
            ],
            [
                9719,
                9774
            ],
            [
                9774,
                9870
            ],
            [
                9870,
                9964
            ],
            [
                9964,
                10031
            ],
            [
                10031,
                10102
            ],
            [
                10102,
                10115
            ],
            [
                10115,
                10151
            ],
            [
                10151,
                10166
            ],
            [
                10166,
                10178
            ],
            [
                10178,
                10234
            ],
            [
                10234,
                10312
            ],
            [
                10312,
                10351
            ],
            [
                10351,
                10359
            ],
            [
                10359,
                10487
            ],
            [
                10487,
                10516
            ],
            [
                10516,
                10526
            ],
            [
                10526,
                10739
            ],
            [
                10739,
                10967
            ],
            [
                10967,
                10988
            ],
            [
                10988,
                11043
            ],
            [
                11043,
                11217
            ],
            [
                11217,
                11296
            ],
            [
                11296,
                11296
            ],
            [
                11296,
                11470
            ],
            [
                11470,
                11672
            ],
            [
                11672,
                11799
            ],
            [
                11799,
                11875
            ],
            [
                11875,
                11933
            ],
            [
                11933,
                12115
            ],
            [
                12115,
                12115
            ],
            [
                12115,
                12115
            ],
            [
                12115,
                12189
            ],
            [
                12189,
                12423
            ],
            [
                12423,
                12489
            ],
            [
                12489,
                12489
            ],
            [
                12489,
                12613
            ],
            [
                12613,
                12811
            ],
            [
                12811,
                12907
            ],
            [
                12907,
                12965
            ],
            [
                12965,
                12965
            ],
            [
                12965,
                13059
            ],
            [
                13059,
                13147
            ],
            [
                13147,
                13238
            ],
            [
                13238,
                13536
            ],
            [
                13536,
                13575
            ]
        ]
    }
}