{
    "original": {
        "text": "A letter, edged with black, announced the day of my master's return. Isabella was dead; and he wrote to bid me get mourning for his daughter, and arrange a room, and other accommodations, for his youthful nephew. Catherine ran wild with joy at the idea of welcoming her father back; and indulged most sanguine anticipations of the innumerable excellencies of her \"real\" cousin. The evening of their expected arrival came. Since early morning she had been busy ordering her own small affairs; and now attired in her new black frock-poor thing! her aunt's death impressed her with no definite sorrow-she obliged me, by constant worrying, to walk with her down through the grounds to meet them.\n\"Linton is just six months younger than I am,\" she chattered, as we strolled leisurely over the swells and hollows of mossy turf, under shadow of the trees. \"How delightful it will be to have him for a playfellow! Aunt Isabella sent papa a beautiful lock of his hair; it was lighter than mine-more flaxen, and quite as fine. I have it carefully preserved in a little glass box; and I've often thought what a pleasure it would be to see its owner. Oh! I am happy-and papa, dear, dear papa! Come, Ellen, let us run! come, run.\"\nShe ran, and returned and ran again, many times before my sober footsteps reached the gate, and then she seated herself on the grassy bank beside the path, and tried to wait patiently; but that was impossible: she couldn't be still a minute.\n\"How long they are!\" she exclaimed. \"Ah, I see, some dust on the road-they are coming! No! When will they be here? May we not go a little way-half a mile, Ellen, only just half a mile? Do say yes: to that clump of birches at the turn!\"\nI refused staunchly. At length her suspense was ended: the travelling carriage rolled in sight. Miss Cathy shrieked and stretched out her arms as soon as she caught her father's face looking from the window. He descended, nearly as eager as herself; and a considerable interval elapsed ere they had a thought to spare for any but themselves. While they exchanged caresses I took a peep in to see after Linton. He was asleep in a corner, wrapped in a warm, fur-lined cloak, as if it had been winter. A pale, delicate, effeminate boy, who might have been taken for my master's younger brother, so strong was the resemblance: but there was a sickly peevishness in his aspect that Edgar Linton never had. The latter saw me looking; and having shaken hands, advised me to close the door, and leave him undisturbed; for the journey had fatigued him. Cathy would fain have taken one glance, but her father told her to come, and they walked together up the park, while I hastened before to prepare the servants.\n\"Now, darling,\" said Mr. Linton, addressing his daughter, as they halted at the bottom of the front steps: \"your cousin is not so strong or so merry as you are, and he has lost his mother, remember, a very short time since; therefore, don't expect him to play and run about with you directly. And don't harass him much by talking: let him be quiet this evening, at least, will you?\"\n\"Yes, yes, papa,\" answered Catherine: \"but I do want to see him; and he hasn't once looked out.\"\nThe carriage stopped; and the sleeper being roused, was lifted to the ground by his uncle.\n\"This is your cousin Cathy, Linton,\" he said, putting their little hands together. \"She's fond of you already; and mind you don't grieve her by crying to-night. Try to be cheerful now; the travelling is at an end, and you have nothing to do but rest and amuse yourself as you please.\"\n\"Let me go to bed, then,\" answered the boy, shrinking from Catherine's salute; and he put his fingers to remove incipient tears.\n\"Come, come, there's a good child,\" I whispered, leading him in. \"You'll make her weep too-see how sorry she is for you!\"\nI do not know whether it was sorrow for him, but his cousin put on as sad a countenance as himself, and returned to her father. All three entered, and mounted to the library, where tea was laid ready. I proceeded to remove Linton's cap and mantle, and placed him on a chair by the table; but he was no sooner seated than he began to cry afresh. My master inquired what was the matter.\n\"I can't sit on a chair,\" sobbed the boy.\n\"Go to the sofa, then, and Ellen shall bring you some tea,\" answered his uncle patiently.\nHe had been greatly tried, during the journey, I felt convinced, by his fretful ailing charge. Linton slowly trailed himself off, and lay down. Cathy carried a footstool and her cup to his side. At first she sat silent; but that could not last: she had resolved to make a pet of her little cousin, as she would have him to be; and she commenced stroking his curls, and kissing his cheek, and offering him tea in her saucer, like a baby. This pleased him, for he was not much better: he dried his eyes, and lightened into a faint smile.\n\"Oh, he'll do very well,\" said the master to me, after watching them a minute. \"Very well, if we can keep him, Ellen. The company of a child of his own age will instil new spirit into him soon, and by wishing for strength he'll gain it.\"\n\"Ay, if we can keep him!\" I mused to myself; and sore misgivings came over me that there was slight hope of that. And then, I thought, how ever will that weakling live at Wuthering Heights? Between his father and Hareton, what playmates and instructors they'll be. Our doubts were presently decided-even earlier than I expected. I had just taken the children upstairs, after tea was finished, and seen Linton asleep-he would not suffer me to leave him till that was the case-I had come down, and was standing by the table in the hall, lighting a bedroom candle for Mr. Edgar, when a maid stepped out of the kitchen and informed me that Mr. Heathcliff's servant Joseph was at the door, and wished to speak with the master.\n\"I shall ask him what he wants first,\" I said, in considerable trepidation. \"A very unlikely hour to be troubling people, and the instant they have returned from a long journey. I don't think the master can see him.\"\nJoseph had advanced through the kitchen as I uttered these words, and now presented himself in the hall. He was donned in his Sunday garments, with his most sanctimonious and sourest face, and, holding his hat in one hand, and his stick in the other, he proceeded to clean his shoes on the mat.\n\"Good-evening, Joseph,\" I said, coldly. \"What business brings you here to-night?\"\n\"It's Maister Linton I mun spake to,\" he answered, waving me disdainfully aside.\n\"Mr. Linton is going to bed; unless you have something particular to say, I'm sure he won't hear it now,\" I continued. \"You had better sit down in there, and entrust your message to me.\"\n\"Which is his rahm?\" pursued the fellow, surveying the range of closed doors.\nI perceived he was bent on refusing my mediation, so very reluctantly I went up to the library, and announced the unseasonable visitor, advising that he should be dismissed till next day. Mr. Linton had no time to empower me to do so, for Joseph mounted close at my heels, and, pushing into the apartment, planted himself at the far side of the table, with his two fists clapped on the head of his stick, and began in an elevated tone, as if anticipating opposition-\n\"Hathecliff has sent me for his lad, and I munn't goa back 'bout him.\"\nEdgar Linton was silent a minute; an expression of exceeding sorrow overcast his features: he would have pitied the child on his own account; but, recalling Isabella's hopes and fears, and anxious wishes for her son, and her commendations of him to his care, he grieved bitterly at the prospect of yielding him up, and searched in his heart how it might be avoided. No plan offered itself: the very exhibition of any desire to keep him would have rendered the claimant more peremptory: there was nothing left but to resign him. However, he was not going to rouse him from his sleep.\n\"Tell Mr. Heathcliff,\" he answered calmly, \"that his son shall come to Wuthering Heights to-morrow. He is in bed, and too tired to go the distance now. You may also tell him that the mother of Linton desired him to remain under my guardianship; and, at present, his health is very precarious.\"\n\"Noa!\" said Joseph, giving a thud with his prop on the floor, and assuming an authoritative air. \"Noa! that means naught. Hathecliff maks noa 'count o' t' mother, nor ye norther; but he'll heu' his lad; und I mun tak' him-soa now ye knaw!\"\n\"You shall not to-night!\" answered Linton decisively. \"Walk down stairs at once, and repeat to your master what I have said. Ellen, show him down. Go-\"\nAnd, aiding the indignant elder with a lift by the arm, he rid the room of him and closed the door.\n\"Varrah weell!\" shouted Joseph, as he slowly drew off. \"To-morn, he's come hisseln, and thrust _him_ out, if ye darr!\"",
        "paragraph_chars": [
            [
                0,
                692
            ],
            [
                692,
                1218
            ],
            [
                1218,
                1460
            ],
            [
                1460,
                1696
            ],
            [
                1696,
                2700
            ],
            [
                2700,
                3083
            ],
            [
                3083,
                3180
            ],
            [
                3180,
                3271
            ],
            [
                3271,
                3556
            ],
            [
                3556,
                3685
            ],
            [
                3685,
                3807
            ],
            [
                3807,
                4192
            ],
            [
                4192,
                4234
            ],
            [
                4234,
                4324
            ],
            [
                4324,
                4860
            ],
            [
                4860,
                5098
            ],
            [
                5098,
                5820
            ],
            [
                5820,
                6037
            ],
            [
                6037,
                6332
            ],
            [
                6332,
                6414
            ],
            [
                6414,
                6495
            ],
            [
                6495,
                6682
            ],
            [
                6682,
                6760
            ],
            [
                6760,
                7227
            ],
            [
                7227,
                7298
            ],
            [
                7298,
                7881
            ],
            [
                7881,
                8175
            ],
            [
                8175,
                8415
            ],
            [
                8415,
                8567
            ],
            [
                8567,
                8667
            ],
            [
                8667,
                8785
            ]
        ],
        "segment_chars": [
            [
                0,
                69
            ],
            [
                69,
                213
            ],
            [
                213,
                378
            ],
            [
                378,
                422
            ],
            [
                422,
                543
            ],
            [
                543,
                692
            ],
            [
                692,
                849
            ],
            [
                849,
                906
            ],
            [
                906,
                1017
            ],
            [
                1017,
                1139
            ],
            [
                1139,
                1143
            ],
            [
                1143,
                1181
            ],
            [
                1181,
                1206
            ],
            [
                1206,
                1218
            ],
            [
                1218,
                1460
            ],
            [
                1460,
                1481
            ],
            [
                1481,
                1496
            ],
            [
                1496,
                1547
            ],
            [
                1547,
                1551
            ],
            [
                1551,
                1575
            ],
            [
                1575,
                1645
            ],
            [
                1645,
                1696
            ],
            [
                1696,
                1717
            ],
            [
                1717,
                1792
            ],
            [
                1792,
                1904
            ],
            [
                1904,
                2038
            ],
            [
                2038,
                2106
            ],
            [
                2106,
                2195
            ],
            [
                2195,
                2397
            ],
            [
                2397,
                2540
            ],
            [
                2540,
                2700
            ],
            [
                2700,
                2993
            ],
            [
                2993,
                3083
            ],
            [
                3083,
                3180
            ],
            [
                3180,
                3271
            ],
            [
                3271,
                3354
            ],
            [
                3354,
                3432
            ],
            [
                3432,
                3556
            ],
            [
                3556,
                3685
            ],
            [
                3685,
                3750
            ],
            [
                3750,
                3807
            ],
            [
                3807,
                3935
            ],
            [
                3935,
                4008
            ],
            [
                4008,
                4152
            ],
            [
                4152,
                4192
            ],
            [
                4192,
                4234
            ],
            [
                4234,
                4324
            ],
            [
                4324,
                4419
            ],
            [
                4419,
                4468
            ],
            [
                4468,
                4519
            ],
            [
                4519,
                4761
            ],
            [
                4761,
                4860
            ],
            [
                4860,
                4939
            ],
            [
                4939,
                4978
            ],
            [
                4978,
                5098
            ],
            [
                5098,
                5124
            ],
            [
                5124,
                5212
            ],
            [
                5212,
                5288
            ],
            [
                5288,
                5363
            ],
            [
                5363,
                5427
            ],
            [
                5427,
                5820
            ],
            [
                5820,
                5896
            ],
            [
                5896,
                5998
            ],
            [
                5998,
                6037
            ],
            [
                6037,
                6142
            ],
            [
                6142,
                6332
            ],
            [
                6332,
                6372
            ],
            [
                6372,
                6414
            ],
            [
                6414,
                6495
            ],
            [
                6495,
                6614
            ],
            [
                6614,
                6682
            ],
            [
                6682,
                6703
            ],
            [
                6703,
                6760
            ],
            [
                6760,
                6948
            ],
            [
                6948,
                7227
            ],
            [
                7227,
                7298
            ],
            [
                7298,
                7664
            ],
            [
                7664,
                7826
            ],
            [
                7826,
                7881
            ],
            [
                7881,
                7981
            ],
            [
                7981,
                8033
            ],
            [
                8033,
                8175
            ],
            [
                8175,
                8182
            ],
            [
                8182,
                8272
            ],
            [
                8272,
                8278
            ],
            [
                8278,
                8297
            ],
            [
                8297,
                8415
            ],
            [
                8415,
                8441
            ],
            [
                8441,
                8469
            ],
            [
                8469,
                8540
            ],
            [
                8540,
                8562
            ],
            [
                8562,
                8567
            ],
            [
                8567,
                8667
            ],
            [
                8667,
                8683
            ],
            [
                8683,
                8722
            ],
            [
                8722,
                8785
            ]
        ],
        "overlap_chars": [
            [
                0,
                27
            ],
            [
                49,
                58
            ],
            [
                67,
                69
            ],
            [
                69,
                91
            ],
            [
                192,
                213
            ],
            [
                213,
                286
            ],
            [
                359,
                362
            ],
            [
                364,
                368
            ],
            [
                370,
                378
            ],
            [
                378,
                415
            ],
            [
                612,
                613
            ],
            [
                442,
                445
            ],
            [
                610,
                612
            ],
            [
                636,
                652
            ],
            [
                658,
                692
            ],
            [
                693,
                736
            ],
            [
                739,
                768
            ],
            [
                822,
                827
            ],
            [
                838,
                849
            ],
            [
                850,
                906
            ],
            [
                906,
                984
            ],
            [
                1015,
                1017
            ],
            [
                1074,
                1139
            ],
            [
                1139,
                1143
            ],
            [
                1143,
                1157
            ],
            [
                1170,
                1181
            ],
            [
                1181,
                1204
            ],
            [
                1218,
                1225
            ],
            [
                1300,
                1318
            ],
            [
                1338,
                1426
            ],
            [
                1458,
                1460
            ],
            [
                1461,
                1478
            ],
            [
                1481,
                1496
            ],
            [
                1497,
                1506
            ],
            [
                1508,
                1545
            ],
            [
                1751,
                1781
            ],
            [
                1785,
                1792
            ],
            [
                1792,
                1853
            ],
            [
                1861,
                1904
            ],
            [
                1907,
                1917
            ],
            [
                1946,
                1949
            ],
            [
                2038,
                2084
            ],
            [
                2098,
                2106
            ],
            [
                2106,
                2167
            ],
            [
                2193,
                2195
            ],
            [
                2195,
                2396
            ],
            [
                2408,
                2427
            ],
            [
                2449,
                2459
            ],
            [
                2460,
                2462
            ],
            [
                2489,
                2492
            ],
            [
                2504,
                2539
            ],
            [
                2701,
                2713
            ],
            [
                2716,
                2720
            ],
            [
                2744,
                2757
            ],
            [
                2808,
                2897
            ],
            [
                2922,
                2923
            ],
            [
                2935,
                2982
            ],
            [
                2991,
                2993
            ],
            [
                3031,
                3070
            ],
            [
                3202,
                3205
            ],
            [
                3243,
                3249
            ],
            [
                3230,
                3231
            ],
            [
                3180,
                3192
            ],
            [
                3232,
                3235
            ],
            [
                3206,
                3209
            ],
            [
                3224,
                3230
            ],
            [
                3236,
                3242
            ],
            [
                3269,
                3271
            ],
            [
                3277,
                3305
            ],
            [
                3308,
                3354
            ],
            [
                3358,
                3421
            ],
            [
                3430,
                3432
            ],
            [
                3432,
                3492
            ],
            [
                3516,
                3553
            ],
            [
                3557,
                3579
            ],
            [
                3582,
                3624
            ],
            [
                3635,
                3638
            ],
            [
                3658,
                3660
            ],
            [
                3683,
                3685
            ],
            [
                3686,
                3718
            ],
            [
                3721,
                3750
            ],
            [
                3751,
                3804
            ],
            [
                3850,
                3851
            ],
            [
                3856,
                3866
            ],
            [
                3874,
                3880
            ],
            [
                3895,
                3897
            ],
            [
                3933,
                3935
            ],
            [
                3935,
                3944
            ],
            [
                3966,
                4008
            ],
            [
                4008,
                4009
            ],
            [
                4030,
                4046
            ],
            [
                4053,
                4101
            ],
            [
                4131,
                4152
            ],
            [
                4152,
                4192
            ],
            [
                4193,
                4215
            ],
            [
                4218,
                4234
            ],
            [
                4235,
                4291
            ],
            [
                4294,
                4324
            ],
            [
                4324,
                4349
            ],
            [
                4351,
                4403
            ],
            [
                4349,
                4350
            ],
            [
                4404,
                4419
            ],
            [
                4419,
                4440
            ],
            [
                4449,
                4466
            ],
            [
                4494,
                4497
            ],
            [
                4468,
                4493
            ],
            [
                4506,
                4519
            ],
            [
                4519,
                4620
            ],
            [
                4649,
                4761
            ],
            [
                4761,
                4777
            ],
            [
                4805,
                4860
            ],
            [
                4861,
                4883
            ],
            [
                4886,
                4908
            ],
            [
                4915,
                4928
            ],
            [
                4937,
                4939
            ],
            [
                4945,
                4978
            ],
            [
                4978,
                5020
            ],
            [
                5044,
                5047
            ],
            [
                5028,
                5038
            ],
            [
                5099,
                5121
            ],
            [
                5124,
                5142
            ],
            [
                5176,
                5190
            ],
            [
                5198,
                5212
            ],
            [
                5222,
                5286
            ],
            [
                5220,
                5221
            ],
            [
                5212,
                5215
            ],
            [
                5286,
                5288
            ],
            [
                5320,
                5362
            ],
            [
                5363,
                5378
            ],
            [
                5389,
                5396
            ],
            [
                5425,
                5427
            ],
            [
                5427,
                5465
            ],
            [
                5537,
                5539
            ],
            [
                5489,
                5494
            ],
            [
                5575,
                5583
            ],
            [
                5584,
                5588
            ],
            [
                5672,
                5685
            ],
            [
                5717,
                5733
            ],
            [
                5759,
                5820
            ],
            [
                5904,
                5996
            ],
            [
                5859,
                5865
            ],
            [
                5996,
                5998
            ],
            [
                5998,
                6034
            ],
            [
                6224,
                6225
            ],
            [
                6037,
                6131
            ],
            [
                6159,
                6169
            ],
            [
                6178,
                6224
            ],
            [
                6330,
                6332
            ],
            [
                6333,
                6353
            ],
            [
                6356,
                6372
            ],
            [
                6373,
                6377
            ],
            [
                6387,
                6402
            ],
            [
                6415,
                6419
            ],
            [
                6428,
                6436
            ],
            [
                6447,
                6449
            ],
            [
                6452,
                6495
            ],
            [
                6498,
                6499
            ],
            [
                6500,
                6598
            ],
            [
                6601,
                6614
            ],
            [
                6615,
                6629
            ],
            [
                6653,
                6679
            ],
            [
                6683,
                6695
            ],
            [
                6721,
                6760
            ],
            [
                6830,
                6836
            ],
            [
                6840,
                6869
            ],
            [
                6946,
                6948
            ],
            [
                6999,
                7005
            ],
            [
                7014,
                7054
            ],
            [
                6993,
                6994
            ],
            [
                7169,
                7177
            ],
            [
                7190,
                7225
            ],
            [
                7286,
                7287
            ],
            [
                7231,
                7233
            ],
            [
                7233,
                7269
            ],
            [
                7274,
                7279
            ],
            [
                7281,
                7285
            ],
            [
                7292,
                7295
            ],
            [
                7298,
                7331
            ],
            [
                7359,
                7387
            ],
            [
                7445,
                7465
            ],
            [
                7487,
                7513
            ],
            [
                7555,
                7664
            ],
            [
                7664,
                7686
            ],
            [
                7782,
                7826
            ],
            [
                7826,
                7881
            ],
            [
                7887,
                7901
            ],
            [
                7904,
                7923
            ],
            [
                7925,
                7969
            ],
            [
                7979,
                7981
            ],
            [
                7981,
                8011
            ],
            [
                8028,
                8033
            ],
            [
                8033,
                8059
            ],
            [
                8074,
                8080
            ],
            [
                8064,
                8070
            ],
            [
                8081,
                8172
            ],
            [
                8176,
                8178
            ],
            [
                8182,
                8193
            ],
            [
                8270,
                8272
            ],
            [
                8317,
                8318
            ],
            [
                8300,
                8302
            ],
            [
                8302,
                8307
            ],
            [
                8313,
                8315
            ],
            [
                8324,
                8326
            ],
            [
                8330,
                8336
            ],
            [
                8352,
                8353
            ],
            [
                8358,
                8363
            ],
            [
                8369,
                8377
            ],
            [
                8382,
                8383
            ],
            [
                8393,
                8399
            ],
            [
                8401,
                8404
            ],
            [
                8426,
                8429
            ],
            [
                8441,
                8469
            ],
            [
                8470,
                8474
            ],
            [
                8487,
                8540
            ],
            [
                8540,
                8562
            ],
            [
                8562,
                8564
            ],
            [
                8567,
                8603
            ],
            [
                8618,
                8667
            ],
            [
                8675,
                8680
            ],
            [
                8683,
                8697
            ],
            [
                8699,
                8704
            ],
            [
                8720,
                8722
            ],
            [
                8725,
                8734
            ],
            [
                8737,
                8745
            ],
            [
                8751,
                8761
            ],
            [
                8763,
                8766
            ],
            [
                8768,
                8775
            ]
        ],
        "row_chars": [
            [
                0,
                69
            ],
            [
                69,
                213
            ],
            [
                213,
                378
            ],
            [
                378,
                692
            ],
            [
                692,
                849
            ],
            [
                849,
                906
            ],
            [
                906,
                1017
            ],
            [
                1017,
                1139
            ],
            [
                1139,
                1143
            ],
            [
                1143,
                1181
            ],
            [
                1181,
                1206
            ],
            [
                1206,
                1218
            ],
            [
                1218,
                1460
            ],
            [
                1460,
                1481
            ],
            [
                1481,
                1496
            ],
            [
                1496,
                1547
            ],
            [
                1547,
                1551
            ],
            [
                1551,
                1575
            ],
            [
                1575,
                1645
            ],
            [
                1645,
                1696
            ],
            [
                1696,
                1717
            ],
            [
                1717,
                1792
            ],
            [
                1792,
                1904
            ],
            [
                1904,
                2106
            ],
            [
                2106,
                2195
            ],
            [
                2195,
                2397
            ],
            [
                2397,
                2540
            ],
            [
                2540,
                2700
            ],
            [
                2700,
                2993
            ],
            [
                2993,
                3083
            ],
            [
                3083,
                3180
            ],
            [
                3180,
                3271
            ],
            [
                3271,
                3354
            ],
            [
                3354,
                3432
            ],
            [
                3432,
                3556
            ],
            [
                3556,
                3685
            ],
            [
                3685,
                3750
            ],
            [
                3750,
                3807
            ],
            [
                3807,
                3935
            ],
            [
                3935,
                4008
            ],
            [
                4008,
                4152
            ],
            [
                4152,
                4192
            ],
            [
                4192,
                4234
            ],
            [
                4234,
                4324
            ],
            [
                4324,
                4419
            ],
            [
                4419,
                4519
            ],
            [
                4519,
                4761
            ],
            [
                4761,
                4860
            ],
            [
                4860,
                4939
            ],
            [
                4939,
                4978
            ],
            [
                4978,
                5098
            ],
            [
                5098,
                5124
            ],
            [
                5124,
                5212
            ],
            [
                5212,
                5288
            ],
            [
                5288,
                5363
            ],
            [
                5363,
                5427
            ],
            [
                5427,
                5820
            ],
            [
                5820,
                5998
            ],
            [
                5998,
                6037
            ],
            [
                6037,
                6332
            ],
            [
                6332,
                6372
            ],
            [
                6372,
                6414
            ],
            [
                6414,
                6495
            ],
            [
                6495,
                6614
            ],
            [
                6614,
                6682
            ],
            [
                6682,
                6703
            ],
            [
                6703,
                6760
            ],
            [
                6760,
                6948
            ],
            [
                6948,
                7227
            ],
            [
                7227,
                7298
            ],
            [
                7298,
                7664
            ],
            [
                7664,
                7826
            ],
            [
                7826,
                7881
            ],
            [
                7881,
                7981
            ],
            [
                7981,
                8033
            ],
            [
                8033,
                8175
            ],
            [
                8175,
                8182
            ],
            [
                8182,
                8272
            ],
            [
                8272,
                8278
            ],
            [
                8278,
                8297
            ],
            [
                8297,
                8415
            ],
            [
                8415,
                8441
            ],
            [
                8441,
                8469
            ],
            [
                8469,
                8540
            ],
            [
                8540,
                8562
            ],
            [
                8562,
                8567
            ],
            [
                8567,
                8667
            ],
            [
                8667,
                8683
            ],
            [
                8683,
                8722
            ],
            [
                8722,
                8785
            ]
        ]
    },
    "abridged": {
        "text": "A letter, edged with black, came from my master. Isabella was dead; and Edgar was returning with his youthful nephew. Catherine ran wild with joy at the idea of welcoming her father back; and looked forward to seeing her 'real' cousin. On the evening of their expected arrival, she persuaded me to walk with her through the grounds to meet them.\n'Linton is just six months younger than I am,' she chattered, as we strolled under the trees. 'How delightful it will be to have him for a playfellow! Aunt Isabella sent papa a beautiful lock of his hair; it was lighter than mine. I've often thought what a pleasure it would be to see its owner. Oh! I am happy - and dear papa! Come, Ellen, let us run!'\nShe ran to the gate, and then sat on the grassy bank beside the path, and tried to wait patiently; but that was impossible.\n'How long they are!' she exclaimed. 'Ah, I see some dust on the road - they are coming!'\nThe travelling carriage rolled into sight. Miss Cathy shrieked and stretched out her arms as soon as she saw her father's face looking from the window. Edgar descended, and while they exchanged caresses I took a peep in at Linton. He was asleep in a corner, wrapped in a warm, fur-lined cloak. A pale, delicate, effeminate boy, who might have been taken for my master's younger brother, so strong was the resemblance: but there was a sickly peevishness in his aspect that Edgar Linton never had.\nMr Linton saw me looking; and advised me not to disturb him; for the journey had fatigued him.\n'Now, darling,' he said to his daughter, 'your cousin is not so strong or so merry as you are, and he has lost his mother, remember; so don't expect him to play and run about with you. Let him be quiet this evening, at least.'\nEdgar and Cathy walked up to the house, while the carriage was driven round to the steps. There he roused Linton and lifted him out.\n'This is your cousin Cathy, Linton,' he said, putting their little hands together. 'She's fond of you already; and mind you don't grieve her by crying. Try to be cheerful now; the travelling is at an end, and you can rest and amuse yourself as you please.'\n'Let me go to bed, then,' answered the boy, shrinking from Catherine, and starting to weep.\n'Come, come, there's a good child,' I whispered, leading him in. 'You'll make her weep too - see how sorry she is for you!'\nCertainly, his cousin looked as sad as he did. All three went to the library, where tea was laid ready. I removed Linton's cap and cloak, and placed him on a chair by the table; but he began to cry afresh. My master inquired what was the matter.\n'I can't sit on a chair,' sobbed the boy.\n'Go to the sofa, then, and Ellen shall bring you some tea,' answered his uncle patiently.\nHe had been greatly tried during the journey, I felt convinced, by his fretful, ailing charge. Linton slowly trailed off, and lay down, and Cathy carried a footstool to his side. At first she sat silent; but that could not last: she had resolved to make a pet of her little cousin; and she commenced stroking his curls, and kissing his cheek, and offering him tea in her saucer, like a baby. This pleased him: he dried his eyes, and lightened into a faint smile.\n'Oh, he'll do very well,' said the master to me, watching them. 'Very well, if we can keep him, Ellen. The company of a child of his own age will give him new spirit.'\n'Ay, if we can keep him!' I mused to myself; I felt that there was little hope of that. I thought, how ever will that weakling live at Wuthering Heights, with Heathcliff and Hareton? what playmates and instructors they'll be.\nOur doubts were soon decided. I had just taken the children upstairs to bed, and had come back down, when a maid informed me that Joseph was at the door, and wished to speak with the master.\n'It is an unlikely hour to be troubling people, and the instant they have returned from a long journey,' I said. 'I don't think the master can see him.'\nHowever, Joseph had advanced through the kitchen as I uttered these words, and now presented himself in his Sunday clothes, with his most sanctimonious and sourest face.\n'Good-evening, Joseph,' I said, coldly. 'What brings you here tonight?'\n'It's Master Linton I must speak to,' he answered, waving me disdainfully aside.\n'Mr. Linton is going to bed; unless you have something particular to say, I'm sure he won't hear it now,' I continued. 'You had better entrust your message to me.'\n'Which is his room?' he pursued, surveying the range of closed doors.\nReluctantly I went to the library, and announced him. But Joseph followed close at my heels, and, pushing into the room, began in a high tone, as if anticipating opposition:\n'Heathcliff has sent me for his lad, and I mustn't go back without him.'\nEdgar Linton was silent a minute; sorrow overcast his features. Recalling Isabella's anxious wishes for her son, he grieved bitterly at the prospect of yielding him up, and searched in his heart how it might be avoided. No plan offered itself: there was nothing left but to resign him. However, he was not going to rouse him from his sleep.\n'Tell Mr. Heathcliff,' he answered calmly, 'that his son shall come to Wuthering Heights tomorrow. He is in bed, and too tired to travel now. You may also tell him that Linton's mother desired him to remain under my guardianship; and, at present, his health is very precarious.'\n'No!' said Joseph. 'Heathcliff makes no account o' the mother; he'll have his lad; and I must take him - so now yah know!'\n'Not tonight!' answered Linton decisively. 'Walk downstairs at once, and repeat to your master what I have said. Ellen, show him down. Go!'\nAnd, aiding the indignant elder with his arm, he rid the room of him and closed the door.\n'Very weell!' shouted Joseph as he left. 'To-morn, he'll come hisself; and thrust him out, if yah dare!'",
        "paragraph_chars": [
            [
                0,
                346
            ],
            [
                346,
                700
            ],
            [
                700,
                824
            ],
            [
                824,
                913
            ],
            [
                913,
                1409
            ],
            [
                1409,
                1504
            ],
            [
                1504,
                1731
            ],
            [
                1731,
                1864
            ],
            [
                1864,
                2121
            ],
            [
                2121,
                2213
            ],
            [
                2213,
                2337
            ],
            [
                2337,
                2583
            ],
            [
                2583,
                2625
            ],
            [
                2625,
                2715
            ],
            [
                2715,
                3178
            ],
            [
                3178,
                3346
            ],
            [
                3346,
                3572
            ],
            [
                3572,
                3763
            ],
            [
                3763,
                3916
            ],
            [
                3916,
                4086
            ],
            [
                4086,
                4158
            ],
            [
                4158,
                4239
            ],
            [
                4239,
                4403
            ],
            [
                4403,
                4473
            ],
            [
                4473,
                4647
            ],
            [
                4647,
                4720
            ],
            [
                4720,
                5061
            ],
            [
                5061,
                5340
            ],
            [
                5340,
                5463
            ],
            [
                5463,
                5603
            ],
            [
                5603,
                5693
            ],
            [
                5693,
                5797
            ]
        ],
        "segment_chars": [
            [
                0,
                49
            ],
            [
                49,
                118
            ],
            [
                118,
                236
            ],
            [
                236,
                346
            ],
            [
                346,
                440
            ],
            [
                440,
                497
            ],
            [
                497,
                577
            ],
            [
                577,
                642
            ],
            [
                642,
                646
            ],
            [
                646,
                674
            ],
            [
                674,
                700
            ],
            [
                700,
                824
            ],
            [
                824,
                845
            ],
            [
                845,
                860
            ],
            [
                860,
                913
            ],
            [
                913,
                956
            ],
            [
                956,
                1065
            ],
            [
                1065,
                1144
            ],
            [
                1144,
                1207
            ],
            [
                1207,
                1409
            ],
            [
                1409,
                1504
            ],
            [
                1504,
                1689
            ],
            [
                1689,
                1731
            ],
            [
                1731,
                1821
            ],
            [
                1821,
                1864
            ],
            [
                1864,
                1947
            ],
            [
                1947,
                2016
            ],
            [
                2016,
                2121
            ],
            [
                2121,
                2213
            ],
            [
                2213,
                2278
            ],
            [
                2278,
                2337
            ],
            [
                2337,
                2384
            ],
            [
                2384,
                2441
            ],
            [
                2441,
                2543
            ],
            [
                2543,
                2583
            ],
            [
                2583,
                2625
            ],
            [
                2625,
                2715
            ],
            [
                2715,
                2810
            ],
            [
                2810,
                2894
            ],
            [
                2894,
                3107
            ],
            [
                3107,
                3178
            ],
            [
                3178,
                3242
            ],
            [
                3242,
                3281
            ],
            [
                3281,
                3346
            ],
            [
                3346,
                3372
            ],
            [
                3372,
                3434
            ],
            [
                3434,
                3529
            ],
            [
                3529,
                3572
            ],
            [
                3572,
                3602
            ],
            [
                3602,
                3763
            ],
            [
                3763,
                3876
            ],
            [
                3876,
                3916
            ],
            [
                3916,
                4086
            ],
            [
                4086,
                4126
            ],
            [
                4126,
                4158
            ],
            [
                4158,
                4239
            ],
            [
                4239,
                4244
            ],
            [
                4244,
                4358
            ],
            [
                4358,
                4403
            ],
            [
                4403,
                4424
            ],
            [
                4424,
                4473
            ],
            [
                4473,
                4527
            ],
            [
                4527,
                4647
            ],
            [
                4647,
                4720
            ],
            [
                4720,
                4784
            ],
            [
                4784,
                4940
            ],
            [
                4940,
                5006
            ],
            [
                5006,
                5061
            ],
            [
                5061,
                5160
            ],
            [
                5160,
                5203
            ],
            [
                5203,
                5340
            ],
            [
                5340,
                5346
            ],
            [
                5346,
                5359
            ],
            [
                5359,
                5463
            ],
            [
                5463,
                5478
            ],
            [
                5478,
                5506
            ],
            [
                5506,
                5576
            ],
            [
                5576,
                5598
            ],
            [
                5598,
                5603
            ],
            [
                5603,
                5693
            ],
            [
                5693,
                5707
            ],
            [
                5707,
                5734
            ],
            [
                5734,
                5797
            ]
        ],
        "overlap_chars": [
            [
                0,
                27
            ],
            [
                38,
                47
            ],
            [
                47,
                49
            ],
            [
                49,
                71
            ],
            [
                97,
                118
            ],
            [
                118,
                191
            ],
            [
                217,
                220
            ],
            [
                222,
                226
            ],
            [
                228,
                236
            ],
            [
                239,
                276
            ],
            [
                276,
                277
            ],
            [
                278,
                281
            ],
            [
                292,
                294
            ],
            [
                295,
                311
            ],
            [
                312,
                346
            ],
            [
                347,
                390
            ],
            [
                393,
                422
            ],
            [
                423,
                428
            ],
            [
                429,
                440
            ],
            [
                441,
                497
            ],
            [
                497,
                575
            ],
            [
                575,
                577
            ],
            [
                577,
                642
            ],
            [
                642,
                646
            ],
            [
                646,
                662
            ],
            [
                663,
                674
            ],
            [
                674,
                697
            ],
            [
                700,
                707
            ],
            [
                711,
                729
            ],
            [
                734,
                822
            ],
            [
                822,
                824
            ],
            [
                825,
                842
            ],
            [
                845,
                860
            ],
            [
                861,
                870
            ],
            [
                871,
                910
            ],
            [
                913,
                943
            ],
            [
                949,
                956
            ],
            [
                956,
                1017
            ],
            [
                1022,
                1065
            ],
            [
                1071,
                1081
            ],
            [
                1082,
                1085
            ],
            [
                1086,
                1132
            ],
            [
                1136,
                1144
            ],
            [
                1144,
                1205
            ],
            [
                1205,
                1207
            ],
            [
                1207,
                1408
            ],
            [
                1419,
                1438
            ],
            [
                1439,
                1449
            ],
            [
                1454,
                1456
            ],
            [
                1465,
                1468
            ],
            [
                1468,
                1503
            ],
            [
                1505,
                1517
            ],
            [
                1523,
                1527
            ],
            [
                1531,
                1544
            ],
            [
                1546,
                1635
            ],
            [
                1635,
                1636
            ],
            [
                1640,
                1687
            ],
            [
                1687,
                1689
            ],
            [
                1689,
                1728
            ],
            [
                1737,
                1740
            ],
            [
                1757,
                1763
            ],
            [
                1769,
                1770
            ],
            [
                1777,
                1789
            ],
            [
                1790,
                1793
            ],
            [
                1810,
                1813
            ],
            [
                1830,
                1836
            ],
            [
                1848,
                1854
            ],
            [
                1862,
                1864
            ],
            [
                1870,
                1898
            ],
            [
                1901,
                1947
            ],
            [
                1951,
                2014
            ],
            [
                2014,
                2016
            ],
            [
                2016,
                2076
            ],
            [
                2081,
                2118
            ],
            [
                2122,
                2144
            ],
            [
                2147,
                2189
            ],
            [
                2191,
                2194
            ],
            [
                2204,
                2206
            ],
            [
                2211,
                2213
            ],
            [
                2214,
                2246
            ],
            [
                2249,
                2278
            ],
            [
                2279,
                2334
            ],
            [
                2346,
                2347
            ],
            [
                2348,
                2358
            ],
            [
                2366,
                2372
            ],
            [
                2373,
                2375
            ],
            [
                2382,
                2384
            ],
            [
                2384,
                2393
            ],
            [
                2399,
                2441
            ],
            [
                2441,
                2442
            ],
            [
                2451,
                2467
            ],
            [
                2473,
                2521
            ],
            [
                2522,
                2543
            ],
            [
                2543,
                2583
            ],
            [
                2584,
                2606
            ],
            [
                2609,
                2625
            ],
            [
                2626,
                2682
            ],
            [
                2685,
                2715
            ],
            [
                2715,
                2740
            ],
            [
                2741,
                2793
            ],
            [
                2793,
                2794
            ],
            [
                2795,
                2810
            ],
            [
                2810,
                2831
            ],
            [
                2832,
                2849
            ],
            [
                2851,
                2854
            ],
            [
                2855,
                2880
            ],
            [
                2881,
                2894
            ],
            [
                2894,
                2995
            ],
            [
                2995,
                3107
            ],
            [
                3107,
                3123
            ],
            [
                3123,
                3178
            ],
            [
                3179,
                3201
            ],
            [
                3204,
                3226
            ],
            [
                3227,
                3240
            ],
            [
                3240,
                3242
            ],
            [
                3248,
                3281
            ],
            [
                3281,
                3323
            ],
            [
                3329,
                3332
            ],
            [
                3333,
                3343
            ],
            [
                3347,
                3369
            ],
            [
                3372,
                3390
            ],
            [
                3398,
                3412
            ],
            [
                3420,
                3434
            ],
            [
                3434,
                3498
            ],
            [
                3498,
                3499
            ],
            [
                3516,
                3519
            ],
            [
                3527,
                3529
            ],
            [
                3529,
                3571
            ],
            [
                3572,
                3587
            ],
            [
                3593,
                3600
            ],
            [
                3600,
                3602
            ],
            [
                3602,
                3640
            ],
            [
                3641,
                3643
            ],
            [
                3647,
                3652
            ],
            [
                3653,
                3661
            ],
            [
                3667,
                3671
            ],
            [
                3671,
                3684
            ],
            [
                3685,
                3701
            ],
            [
                3702,
                3763
            ],
            [
                3773,
                3865
            ],
            [
                3868,
                3874
            ],
            [
                3874,
                3876
            ],
            [
                3877,
                3913
            ],
            [
                3923,
                3924
            ],
            [
                3925,
                4019
            ],
            [
                4020,
                4030
            ],
            [
                4038,
                4084
            ],
            [
                4084,
                4086
            ],
            [
                4087,
                4107
            ],
            [
                4110,
                4126
            ],
            [
                4127,
                4131
            ],
            [
                4132,
                4147
            ],
            [
                4159,
                4163
            ],
            [
                4171,
                4179
            ],
            [
                4191,
                4193
            ],
            [
                4196,
                4239
            ],
            [
                4242,
                4243
            ],
            [
                4244,
                4342
            ],
            [
                4345,
                4358
            ],
            [
                4359,
                4373
            ],
            [
                4374,
                4400
            ],
            [
                4404,
                4416
            ],
            [
                4434,
                4473
            ],
            [
                4485,
                4491
            ],
            [
                4492,
                4521
            ],
            [
                4525,
                4527
            ],
            [
                4531,
                4537
            ],
            [
                4547,
                4587
            ],
            [
                4592,
                4593
            ],
            [
                4594,
                4602
            ],
            [
                4610,
                4645
            ],
            [
                4647,
                4648
            ],
            [
                4648,
                4650
            ],
            [
                4653,
                4689
            ],
            [
                4695,
                4700
            ],
            [
                4701,
                4705
            ],
            [
                4714,
                4717
            ],
            [
                4720,
                4753
            ],
            [
                4754,
                4782
            ],
            [
                4784,
                4804
            ],
            [
                4805,
                4831
            ],
            [
                4831,
                4940
            ],
            [
                4940,
                4962
            ],
            [
                4962,
                5006
            ],
            [
                5006,
                5061
            ],
            [
                5067,
                5081
            ],
            [
                5084,
                5103
            ],
            [
                5105,
                5149
            ],
            [
                5158,
                5160
            ],
            [
                5160,
                5190
            ],
            [
                5198,
                5203
            ],
            [
                5203,
                5229
            ],
            [
                5230,
                5236
            ],
            [
                5239,
                5245
            ],
            [
                5246,
                5337
            ],
            [
                5341,
                5343
            ],
            [
                5346,
                5357
            ],
            [
                5357,
                5359
            ],
            [
                5359,
                5360
            ],
            [
                5360,
                5362
            ],
            [
                5365,
                5370
            ],
            [
                5377,
                5379
            ],
            [
                5388,
                5390
            ],
            [
                5395,
                5401
            ],
            [
                5401,
                5402
            ],
            [
                5403,
                5408
            ],
            [
                5414,
                5422
            ],
            [
                5427,
                5428
            ],
            [
                5439,
                5447
            ],
            [
                5448,
                5451
            ],
            [
                5464,
                5467
            ],
            [
                5478,
                5506
            ],
            [
                5507,
                5511
            ],
            [
                5523,
                5576
            ],
            [
                5576,
                5598
            ],
            [
                5598,
                5600
            ],
            [
                5603,
                5639
            ],
            [
                5644,
                5693
            ],
            [
                5699,
                5704
            ],
            [
                5707,
                5721
            ],
            [
                5722,
                5727
            ],
            [
                5732,
                5734
            ],
            [
                5737,
                5746
            ],
            [
                5750,
                5758
            ],
            [
                5764,
                5774
            ],
            [
                5775,
                5778
            ],
            [
                5779,
                5786
            ]
        ],
        "row_chars": [
            [
                0,
                49
            ],
            [
                49,
                118
            ],
            [
                118,
                236
            ],
            [
                236,
                346
            ],
            [
                346,
                440
            ],
            [
                440,
                497
            ],
            [
                497,
                577
            ],
            [
                577,
                642
            ],
            [
                642,
                646
            ],
            [
                646,
                674
            ],
            [
                674,
                700
            ],
            [
                700,
                700
            ],
            [
                700,
                824
            ],
            [
                824,
                845
            ],
            [
                845,
                860
            ],
            [
                860,
                913
            ],
            [
                913,
                913
            ],
            [
                913,
                913
            ],
            [
                913,
                913
            ],
            [
                913,
                913
            ],
            [
                913,
                913
            ],
            [
                913,
                956
            ],
            [
                956,
                1065
            ],
            [
                1065,
                1144
            ],
            [
                1144,
                1207
            ],
            [
                1207,
                1409
            ],
            [
                1409,
                1504
            ],
            [
                1504,
                1504
            ],
            [
                1504,
                1689
            ],
            [
                1689,
                1731
            ],
            [
                1731,
                1731
            ],
            [
                1731,
                1864
            ],
            [
                1864,
                1947
            ],
            [
                1947,
                2016
            ],
            [
                2016,
                2121
            ],
            [
                2121,
                2213
            ],
            [
                2213,
                2278
            ],
            [
                2278,
                2337
            ],
            [
                2337,
                2384
            ],
            [
                2384,
                2441
            ],
            [
                2441,
                2543
            ],
            [
                2543,
                2583
            ],
            [
                2583,
                2625
            ],
            [
                2625,
                2715
            ],
            [
                2715,
                2810
            ],
            [
                2810,
                2894
            ],
            [
                2894,
                3107
            ],
            [
                3107,
                3178
            ],
            [
                3178,
                3242
            ],
            [
                3242,
                3281
            ],
            [
                3281,
                3346
            ],
            [
                3346,
                3372
            ],
            [
                3372,
                3434
            ],
            [
                3434,
                3529
            ],
            [
                3529,
                3572
            ],
            [
                3572,
                3602
            ],
            [
                3602,
                3763
            ],
            [
                3763,
                3876
            ],
            [
                3876,
                3916
            ],
            [
                3916,
                4086
            ],
            [
                4086,
                4126
            ],
            [
                4126,
                4158
            ],
            [
                4158,
                4239
            ],
            [
                4239,
                4358
            ],
            [
                4358,
                4403
            ],
            [
                4403,
                4424
            ],
            [
                4424,
                4473
            ],
            [
                4473,
                4527
            ],
            [
                4527,
                4647
            ],
            [
                4647,
                4720
            ],
            [
                4720,
                4940
            ],
            [
                4940,
                5006
            ],
            [
                5006,
                5061
            ],
            [
                5061,
                5160
            ],
            [
                5160,
                5203
            ],
            [
                5203,
                5340
            ],
            [
                5340,
                5346
            ],
            [
                5346,
                5359
            ],
            [
                5359,
                5359
            ],
            [
                5359,
                5359
            ],
            [
                5359,
                5463
            ],
            [
                5463,
                5478
            ],
            [
                5478,
                5506
            ],
            [
                5506,
                5576
            ],
            [
                5576,
                5598
            ],
            [
                5598,
                5603
            ],
            [
                5603,
                5693
            ],
            [
                5693,
                5707
            ],
            [
                5707,
                5734
            ],
            [
                5734,
                5797
            ]
        ]
    }
}