{
    "original": {
        "text": "Summer drew to an end, and early autumn: it was past Michaelmas, but the harvest was late that year, and a few of our fields were still uncleared. Mr. Linton and his daughter would frequently walk out among the reapers; at the carrying of the last sheaves they stayed till dusk, and the evening happening to be chill and damp, my master caught a bad cold, that settled obstinately on his lungs, and confined him indoors throughout the whole of the winter, nearly without intermission.\nPoor Cathy, frightened from her little romance, had been considerably sadder and duller since its abandonment; and her father insisted on her reading less, and taking more exercise. She had his companionship no longer; I esteemed it a duty to supply its lack, as much as possible, with mine: an inefficient substitute; for I could only spare two or three hours, from my numerous diurnal occupations, to follow her footsteps, and then my society was obviously less desirable than his.\nOn an afternoon in October, or the beginning of November-a fresh watery afternoon, when the turf and paths were rustling with moist, withered leaves, and the cold blue sky was half hidden by clouds-dark grey streamers, rapidly mounting from the west, and boding abundant rain-I requested my young lady to forego her ramble, because I was certain of showers. She refused; and I unwillingly donned a cloak, and took my umbrella to accompany her on a stroll to the bottom of the park: a formal walk which she generally affected if low-spirited-and that she invariably was when Mr. Edgar had been worse than ordinary, a thing never known from his confession, but guessed both by her and me from his increased silence and the melancholy of his countenance. She went sadly on: there was no running or bounding now, though the chill wind might well have tempted her to race. And often, from the side of my eye, I could detect her raising a hand, and brushing something off her cheek. I gazed round for a means of diverting her thoughts. On one side of the road rose a high, rough bank, where hazels and stunted oaks, with their roots half exposed, held uncertain tenure: the soil was too loose for the latter; and strong winds had blown some nearly horizontal. In summer Miss Catherine delighted to climb along these trunks, and sit in the branches, swinging twenty feet above the ground; and I, pleased with her agility and her light, childish heart, still considered it proper to scold every time I caught her at such an elevation, but so that she knew there was no necessity for descending. From dinner to tea she would lie in her breeze-rocked cradle, doing nothing except singing old songs-my nursery lore-to herself, or watching the birds, joint tenants, feed and entice their young ones to fly: or nestling with closed lids, half thinking, half dreaming, happier than words can express.\n\"Look, Miss!\" I exclaimed, pointing to a nook under the roots of one twisted tree. \"Winter is not here yet. There's a little flower up yonder, the last bud from the multitude of bluebells that clouded those turf steps in July with a lilac mist. Will you clamber up, and pluck it to show to papa?\" Cathy stared a long time at the lonely blossom trembling in its earthy shelter, and replied, at length-\"No, I'll not touch it: but it looks melancholy, does it not, Ellen?\"\n\"Yes,\" I observed, \"about as starved and suckless as you: your cheeks are bloodless; let us take hold of hands and run. You're so low, I daresay I shall keep up with you.\"\n\"No,\" she repeated, and continued sauntering on, pausing at intervals to muse over a bit of moss, or a tuft of blanched grass, or a fungus spreading its bright orange among the heaps of brown foliage; and, ever and anon, her hand was lifted to her averted face.\n\"Catherine, why are you crying, love?\" I asked, approaching and putting my arm over her shoulder. \"You mustn't cry because papa has a cold; be thankful it is nothing worse.\"\nShe now put no further restraint on her tears; her breath was stifled by sobs.\n\"Oh, it will be something worse,\" she said. \"And what shall I do when papa and you leave me, and I am by myself? I can't forget your words, Ellen; they are always in my ear. How life will be changed, how dreary the world will be, when papa and you are dead.\"\n\"None can tell whether you won't die before us,\" I replied. \"It's wrong to anticipate evil. We'll hope there are years and years to come before any of us go: master is young, and I am strong, and hardly forty-five. My mother lived till eighty, a canty dame to the last. And suppose Mr. Linton were spared till he saw sixty, that would be more years than you have counted, Miss. And would it not be foolish to mourn a calamity above twenty years beforehand?\"\n\"But Aunt Isabella was younger than papa,\" she remarked, gazing up with timid hope to seek further consolation.\n\"Aunt Isabella had not you and me to nurse her,\" I replied. \"She wasn't as happy as Master: she hadn't as much to live for. All you need do, is to wait well on your father, and cheer him by letting him see you cheerful; and avoid giving him anxiety on any subject: mind that, Cathy! I'll not disguise but you might kill him if you were wild and reckless, and cherished a foolish, fanciful affection for the son of a person who would be glad to have him in his grave; and allowed him to discover that you fretted over the separation he has judged it expedient to make.\"\n\"I fret about nothing on earth except papa's illness,\" answered my companion. \"I care for nothing in comparison with papa. And I'll never-never-oh, never, while I have my senses, do an act or say a word to vex him. I love him better than myself, Ellen; and I know it by this: I pray every night that I may live after him; because I would rather be miserable than that he should be: that proves I love him better than myself.\"\n\"Good words,\" I replied. \"But deeds must prove it also; and after he is well, remember you don't forget resolutions formed in the hour of fear.\"\nAs we talked, we neared a door that opened on the road; and my young lady, lightening into sunshine again, climbed up and seated herself on the top of the wall, reaching over to gather some hips that bloomed scarlet on the summit branches of the wild-rose trees shadowing the highway side: the lower fruit had disappeared, but only birds could touch the upper, except from Cathy's present station. In stretching to pull them, her hat fell off; and as the door was locked, she proposed scrambling down to recover it. I bid her be cautious lest she got a fall, and she nimbly disappeared. But the return was no such easy matter: the stones were smooth and neatly cemented, and the rose-bushes and black-berry stragglers could yield no assistance in re-ascending. I, like a fool, didn't recollect that, till I heard her laughing and exclaiming-\"Ellen! you'll have to fetch the key, or else I must run round to the porter's lodge. I can't scale the ramparts on this side!\"\n\"Stay where you are,\" I answered; \"I have my bundle of keys in my pocket: perhaps I may manage to open it; if not, I'll go.\"\nCatherine amused herself with dancing to and fro before the door, while I tried all the large keys in succession. I had applied the last, and found that none would do; so, repeating my desire that she would remain there, I was about to hurry home as fast as I could, when an approaching sound arrested me. It was the trot of a horse; Cathy's dance stopped also.\n\"Who is that?\" I whispered.\n\"Ellen, I wish you could open the door,\" whispered back my companion, anxiously.\n\"Ho, Miss Linton!\" cried a deep voice (the rider's), \"I'm glad to meet you. Don't be in haste to enter, for I have an explanation to ask and obtain.\"\n\"I sha'n't speak to you, Mr. Heathcliff,\" answered Catherine. \"Papa says you are a wicked man, and you hate both him and me; and Ellen says the same.\"\n\"That is nothing to the purpose,\" said Heathcliff. (He it was.) \"I don't hate my son, I suppose; and it is concerning him that I demand your attention. Yes; you have cause to blush. Two or three months since, were you not in the habit of writing to Linton? making love in play, eh? You deserved, both of you, flogging for that! You especially, the elder; and less sensitive, as it turns out. I've got your letters, and if you give me any pertness I'll send them to your father. I presume you grew weary of the amusement and dropped it, didn't you? Well, you dropped Linton with it into a Slough of Despond. He was in earnest: in love, really. As true as I live, he's dying for you; breaking his heart at your fickleness: not figuratively, but actually. Though Hareton has made him a standing jest for six weeks, and I have used more serious measures, and attempted to frighten him out of his idiocy, he gets worse daily; and he'll be under the sod before summer, unless you restore him!\"\n\"How can you lie so glaringly to the poor child?\" I called from the inside. \"Pray ride on! How can you deliberately get up such paltry falsehoods? Miss Cathy, I'll knock the lock off with a stone: you won't believe that vile nonsense. You can feel in yourself it is impossible that a person should die for love of a stranger.\"\n\"I was not aware there were eavesdroppers,\" muttered the detected villain. \"Worthy Mrs. Dean, I like you, but I don't like your double-dealing,\" he added aloud. \"How could _you_ lie so glaringly as to affirm I hated the 'poor child'? and invent bugbear stories to terrify her from my door-stones? Catherine Linton (the very name warms me), my bonny lass, I shall be from home all this week; go and see if I have not spoken truth: do, there's a darling! Just imagine your father in my place, and Linton in yours; then think how you would value your careless lover if he refused to stir a step to comfort you, when your father himself entreated him; and don't, from pure stupidity, fall into the same error. I swear, on my salvation, he's going to his grave, and none but you can save him!\"\nThe lock gave way and I issued out.\n\"I swear Linton is dying,\" repeated Heathcliff, looking hard at me. \"And grief and disappointment are hastening his death. Nelly, if you won't let her go, you can walk over yourself. But I shall not return till this time next week; and I think your master himself would scarcely object to her visiting her cousin.\"\n\"Come in,\" said I, taking Cathy by the arm and half forcing her to re-enter; for she lingered, viewing with troubled eyes the features of the speaker, too stern to express his inward deceit.\nHe pushed his horse close, and, bending down, observed-\"Miss Catherine, I'll own to you that I have little patience with Linton; and Hareton and Joseph have less. I'll own that he's with a harsh set. He pines for kindness, as well as love; and a kind word from you would be his best medicine. Don't mind Mrs. Dean's cruel cautions; but be generous, and contrive to see him. He dreams of you day and night, and cannot be persuaded that you don't hate him, since you neither write nor call.\"\nI closed the door, and rolled a stone to assist the loosened lock in holding it; and spreading my umbrella, I drew my charge underneath: for the rain began to drive through the moaning branches of the trees, and warned us to avoid delay. Our hurry prevented any comment on the encounter with Heathcliff, as we stretched towards home; but I divined instinctively that Catherine's heart was clouded now in double darkness. Her features were so sad, they did not seem hers: she evidently regarded what she had heard as every syllable true.\nThe master had retired to rest before we came in. Cathy stole to his room to inquire how he was; he had fallen asleep. She returned, and asked me to sit with her in the library. We took our tea together; and afterwards she lay down on the rug, and told me not to talk, for she was weary. I got a book, and pretended to read. As soon as she supposed me absorbed in my occupation, she recommenced her silent weeping: it appeared, at present, her favourite diversion. I suffered her to enjoy it a while; then I expostulated: deriding and ridiculing all Mr. Heathcliff's assertions about his son, as if I were certain she would coincide. Alas! I hadn't skill to counteract the effect his account had produced: it was just what he intended.\n\"You may be right, Ellen,\" she answered; \"but I shall never feel at ease till I know. And I must tell Linton it is not my fault that I don't write, and convince him that I shall not change.\"\nWhat use were anger and protestations against her silly credulity? We parted that night-hostile; but next day beheld me on the road to Wuthering Heights, by the side of my wilful young mistress's pony. I couldn't bear to witness her sorrow: to see her pale, dejected countenance, and heavy eyes: and I yielded, in the faint hope that Linton himself might prove, by his reception of us, how little of the tale was founded on fact.",
        "paragraph_chars": [
            [
                0,
                485
            ],
            [
                485,
                969
            ],
            [
                969,
                2856
            ],
            [
                2856,
                3326
            ],
            [
                3326,
                3498
            ],
            [
                3498,
                3760
            ],
            [
                3760,
                3934
            ],
            [
                3934,
                4013
            ],
            [
                4013,
                4272
            ],
            [
                4272,
                4730
            ],
            [
                4730,
                4842
            ],
            [
                4842,
                5411
            ],
            [
                5411,
                5837
            ],
            [
                5837,
                5982
            ],
            [
                5982,
                6951
            ],
            [
                6951,
                7076
            ],
            [
                7076,
                7438
            ],
            [
                7438,
                7466
            ],
            [
                7466,
                7547
            ],
            [
                7547,
                7697
            ],
            [
                7697,
                7848
            ],
            [
                7848,
                8836
            ],
            [
                8836,
                9163
            ],
            [
                9163,
                9952
            ],
            [
                9952,
                9988
            ],
            [
                9988,
                10303
            ],
            [
                10303,
                10494
            ],
            [
                10494,
                10984
            ],
            [
                10984,
                11521
            ],
            [
                11521,
                12257
            ],
            [
                12257,
                12448
            ],
            [
                12448,
                12877
            ]
        ],
        "segment_chars": [
            [
                0,
                147
            ],
            [
                147,
                485
            ],
            [
                485,
                667
            ],
            [
                667,
                969
            ],
            [
                969,
                1327
            ],
            [
                1327,
                1721
            ],
            [
                1721,
                1837
            ],
            [
                1837,
                1946
            ],
            [
                1946,
                1999
            ],
            [
                1999,
                2223
            ],
            [
                2223,
                2556
            ],
            [
                2556,
                2856
            ],
            [
                2856,
                2870
            ],
            [
                2870,
                2939
            ],
            [
                2939,
                2964
            ],
            [
                2964,
                3101
            ],
            [
                3101,
                3153
            ],
            [
                3153,
                3326
            ],
            [
                3326,
                3446
            ],
            [
                3446,
                3498
            ],
            [
                3498,
                3760
            ],
            [
                3760,
                3799
            ],
            [
                3799,
                3858
            ],
            [
                3858,
                3934
            ],
            [
                3934,
                4013
            ],
            [
                4013,
                4057
            ],
            [
                4057,
                4126
            ],
            [
                4126,
                4187
            ],
            [
                4187,
                4272
            ],
            [
                4272,
                4332
            ],
            [
                4332,
                4364
            ],
            [
                4364,
                4487
            ],
            [
                4487,
                4542
            ],
            [
                4542,
                4650
            ],
            [
                4650,
                4730
            ],
            [
                4730,
                4842
            ],
            [
                4842,
                4902
            ],
            [
                4902,
                4966
            ],
            [
                4966,
                5125
            ],
            [
                5125,
                5411
            ],
            [
                5411,
                5489
            ],
            [
                5489,
                5534
            ],
            [
                5534,
                5626
            ],
            [
                5626,
                5837
            ],
            [
                5837,
                5862
            ],
            [
                5862,
                5982
            ],
            [
                5982,
                6380
            ],
            [
                6380,
                6498
            ],
            [
                6498,
                6569
            ],
            [
                6569,
                6743
            ],
            [
                6743,
                6831
            ],
            [
                6831,
                6909
            ],
            [
                6909,
                6951
            ],
            [
                6951,
                7076
            ],
            [
                7076,
                7190
            ],
            [
                7190,
                7382
            ],
            [
                7382,
                7438
            ],
            [
                7438,
                7453
            ],
            [
                7453,
                7466
            ],
            [
                7466,
                7547
            ],
            [
                7547,
                7566
            ],
            [
                7566,
                7623
            ],
            [
                7623,
                7697
            ],
            [
                7697,
                7759
            ],
            [
                7759,
                7848
            ],
            [
                7848,
                7899
            ],
            [
                7899,
                7912
            ],
            [
                7912,
                8000
            ],
            [
                8000,
                8030
            ],
            [
                8030,
                8105
            ],
            [
                8105,
                8130
            ],
            [
                8130,
                8176
            ],
            [
                8176,
                8240
            ],
            [
                8240,
                8326
            ],
            [
                8326,
                8396
            ],
            [
                8396,
                8455
            ],
            [
                8455,
                8491
            ],
            [
                8491,
                8601
            ],
            [
                8601,
                8836
            ],
            [
                8836,
                8886
            ],
            [
                8886,
                8912
            ],
            [
                8912,
                8927
            ],
            [
                8927,
                8983
            ],
            [
                8983,
                9071
            ],
            [
                9071,
                9163
            ],
            [
                9163,
                9238
            ],
            [
                9238,
                9324
            ],
            [
                9324,
                9397
            ],
            [
                9397,
                9460
            ],
            [
                9460,
                9616
            ],
            [
                9616,
                9869
            ],
            [
                9869,
                9952
            ],
            [
                9952,
                9988
            ],
            [
                9988,
                10056
            ],
            [
                10056,
                10111
            ],
            [
                10111,
                10171
            ],
            [
                10171,
                10303
            ],
            [
                10303,
                10494
            ],
            [
                10494,
                10657
            ],
            [
                10657,
                10694
            ],
            [
                10694,
                10787
            ],
            [
                10787,
                10868
            ],
            [
                10868,
                10984
            ],
            [
                10984,
                11222
            ],
            [
                11222,
                11405
            ],
            [
                11405,
                11521
            ],
            [
                11521,
                11571
            ],
            [
                11571,
                11640
            ],
            [
                11640,
                11699
            ],
            [
                11699,
                11809
            ],
            [
                11809,
                11846
            ],
            [
                11846,
                11986
            ],
            [
                11986,
                12155
            ],
            [
                12155,
                12161
            ],
            [
                12161,
                12257
            ],
            [
                12257,
                12343
            ],
            [
                12343,
                12448
            ],
            [
                12448,
                12515
            ],
            [
                12515,
                12650
            ],
            [
                12650,
                12877
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                33,
                39
            ],
            [
                73,
                99
            ],
            [
                145,
                147
            ],
            [
                147,
                219
            ],
            [
                256,
                294
            ],
            [
                311,
                354
            ],
            [
                356,
                360
            ],
            [
                408,
                419
            ],
            [
                448,
                454
            ],
            [
                483,
                485
            ],
            [
                485,
                495
            ],
            [
                533,
                578
            ],
            [
                513,
                531
            ],
            [
                594,
                667
            ],
            [
                704,
                705
            ],
            [
                895,
                898
            ],
            [
                745,
                765
            ],
            [
                808,
                845
            ],
            [
                718,
                719
            ],
            [
                908,
                913
            ],
            [
                919,
                933
            ],
            [
                944,
                958
            ],
            [
                725,
                727
            ],
            [
                959,
                963
            ],
            [
                967,
                969
            ],
            [
                969,
                971
            ],
            [
                1026,
                1033
            ],
            [
                975,
                996
            ],
            [
                1052,
                1056
            ],
            [
                1070,
                1094
            ],
            [
                1102,
                1159
            ],
            [
                1240,
                1245
            ],
            [
                1050,
                1051
            ],
            [
                1257,
                1270
            ],
            [
                1281,
                1291
            ],
            [
                1245,
                1246
            ],
            [
                1218,
                1223
            ],
            [
                1271,
                1273
            ],
            [
                1000,
                1003
            ],
            [
                1014,
                1016
            ],
            [
                1057,
                1060
            ],
            [
                1325,
                1327
            ],
            [
                1365,
                1366
            ],
            [
                1460,
                1474
            ],
            [
                1378,
                1382
            ],
            [
                1494,
                1510
            ],
            [
                1327,
                1330
            ],
            [
                1534,
                1552
            ],
            [
                1349,
                1352
            ],
            [
                1338,
                1339
            ],
            [
                1519,
                1522
            ],
            [
                1628,
                1635
            ],
            [
                1660,
                1663
            ],
            [
                1603,
                1611
            ],
            [
                1674,
                1685
            ],
            [
                1690,
                1700
            ],
            [
                1719,
                1720
            ],
            [
                1721,
                1776
            ],
            [
                1835,
                1837
            ],
            [
                1837,
                1846
            ],
            [
                1873,
                1874
            ],
            [
                1888,
                1946
            ],
            [
                1946,
                1998
            ],
            [
                1999,
                2034
            ],
            [
                2042,
                2077
            ],
            [
                2115,
                2124
            ],
            [
                2170,
                2171
            ],
            [
                2176,
                2223
            ],
            [
                2223,
                2266
            ],
            [
                2273,
                2278
            ],
            [
                2287,
                2349
            ],
            [
                2355,
                2382
            ],
            [
                2412,
                2419
            ],
            [
                2444,
                2446
            ],
            [
                2450,
                2473
            ],
            [
                2494,
                2502
            ],
            [
                2503,
                2529
            ],
            [
                2441,
                2443
            ],
            [
                2554,
                2556
            ],
            [
                2556,
                2617
            ],
            [
                2639,
                2656
            ],
            [
                2683,
                2706
            ],
            [
                2762,
                2766
            ],
            [
                2794,
                2856
            ],
            [
                2857,
                2867
            ],
            [
                2870,
                2894
            ],
            [
                2908,
                2939
            ],
            [
                2940,
                2964
            ],
            [
                2964,
                2987
            ],
            [
                2997,
                3007
            ],
            [
                3034,
                3042
            ],
            [
                3031,
                3033
            ],
            [
                3017,
                3020
            ],
            [
                3099,
                3101
            ],
            [
                3101,
                3109
            ],
            [
                3126,
                3134
            ],
            [
                3120,
                3121
            ],
            [
                3135,
                3150
            ],
            [
                3153,
                3165
            ],
            [
                3178,
                3199
            ],
            [
                3231,
                3245
            ],
            [
                3257,
                3292
            ],
            [
                3303,
                3323
            ],
            [
                3327,
                3330
            ],
            [
                3333,
                3344
            ],
            [
                3379,
                3417
            ],
            [
                3423,
                3427
            ],
            [
                3431,
                3446
            ],
            [
                3461,
                3495
            ],
            [
                3499,
                3501
            ],
            [
                3504,
                3531
            ],
            [
                3543,
                3567
            ],
            [
                3719,
                3760
            ],
            [
                3761,
                3796
            ],
            [
                3799,
                3807
            ],
            [
                3824,
                3838
            ],
            [
                3844,
                3847
            ],
            [
                3856,
                3858
            ],
            [
                3859,
                3931
            ],
            [
                3981,
                4013
            ],
            [
                4014,
                4044
            ],
            [
                4047,
                4057
            ],
            [
                4058,
                4104
            ],
            [
                4124,
                4126
            ],
            [
                4213,
                4269
            ],
            [
                4321,
                4322
            ],
            [
                4364,
                4390
            ],
            [
                4401,
                4415
            ],
            [
                4428,
                4487
            ],
            [
                4487,
                4514
            ],
            [
                4540,
                4542
            ],
            [
                4542,
                4594
            ],
            [
                4654,
                4686
            ],
            [
                4704,
                4727
            ],
            [
                4731,
                4770
            ],
            [
                4773,
                4786
            ],
            [
                4797,
                4812
            ],
            [
                4840,
                4842
            ],
            [
                4843,
                4888
            ],
            [
                4891,
                4902
            ],
            [
                4938,
                4964
            ],
            [
                4914,
                4916
            ],
            [
                4964,
                4966
            ],
            [
                4970,
                4973
            ],
            [
                5019,
                5031
            ],
            [
                5052,
                5090
            ],
            [
                5105,
                5125
            ],
            [
                5147,
                5212
            ],
            [
                5222,
                5312
            ],
            [
                5321,
                5324
            ],
            [
                5328,
                5376
            ],
            [
                5388,
                5390
            ],
            [
                5401,
                5408
            ],
            [
                5412,
                5432
            ],
            [
                5442,
                5463
            ],
            [
                5466,
                5474
            ],
            [
                5487,
                5489
            ],
            [
                5490,
                5534
            ],
            [
                5534,
                5548
            ],
            [
                5557,
                5564
            ],
            [
                5588,
                5626
            ],
            [
                5626,
                5662
            ],
            [
                5838,
                5848
            ],
            [
                5851,
                5862
            ],
            [
                5863,
                5914
            ],
            [
                5928,
                5940
            ],
            [
                5982,
                6036
            ],
            [
                6355,
                6360
            ],
            [
                6089,
                6103
            ],
            [
                6119,
                6121
            ],
            [
                6126,
                6171
            ],
            [
                6172,
                6200
            ],
            [
                6224,
                6265
            ],
            [
                6378,
                6380
            ],
            [
                6380,
                6396
            ],
            [
                6402,
                6498
            ],
            [
                6498,
                6510
            ],
            [
                6539,
                6568
            ],
            [
                6569,
                6631
            ],
            [
                6741,
                6743
            ],
            [
                6787,
                6822
            ],
            [
                6744,
                6745
            ],
            [
                6824,
                6831
            ],
            [
                6831,
                6859
            ],
            [
                6907,
                6909
            ],
            [
                6909,
                6948
            ],
            [
                6986,
                7023
            ],
            [
                6973,
                6983
            ],
            [
                7023,
                7024
            ],
            [
                7025,
                7073
            ],
            [
                7076,
                7085
            ],
            [
                7114,
                7177
            ],
            [
                7188,
                7190
            ],
            [
                7190,
                7191
            ],
            [
                7218,
                7247
            ],
            [
                7290,
                7382
            ],
            [
                7382,
                7438
            ],
            [
                7439,
                7450
            ],
            [
                7453,
                7466
            ],
            [
                7467,
                7504
            ],
            [
                7507,
                7521
            ],
            [
                7536,
                7547
            ],
            [
                7548,
                7563
            ],
            [
                7566,
                7584
            ],
            [
                7601,
                7623
            ],
            [
                7623,
                7628
            ],
            [
                7632,
                7634
            ],
            [
                7649,
                7661
            ],
            [
                7677,
                7683
            ],
            [
                7703,
                7704
            ],
            [
                7698,
                7702
            ],
            [
                7705,
                7736
            ],
            [
                7739,
                7759
            ],
            [
                7760,
                7820
            ],
            [
                7854,
                7879
            ],
            [
                7882,
                7899
            ],
            [
                7913,
                7954
            ],
            [
                7966,
                7976
            ],
            [
                7998,
                8000
            ],
            [
                8000,
                8030
            ],
            [
                8030,
                8049
            ],
            [
                8055,
                8105
            ],
            [
                8105,
                8130
            ],
            [
                8130,
                8133
            ],
            [
                8144,
                8148
            ],
            [
                8134,
                8142
            ],
            [
                8157,
                8176
            ],
            [
                8176,
                8240
            ],
            [
                8240,
                8326
            ],
            [
                8326,
                8382
            ],
            [
                8394,
                8396
            ],
            [
                8396,
                8455
            ],
            [
                8455,
                8461
            ],
            [
                8483,
                8489
            ],
            [
                8474,
                8481
            ],
            [
                8489,
                8491
            ],
            [
                8491,
                8529
            ],
            [
                8591,
                8599
            ],
            [
                8530,
                8567
            ],
            [
                8599,
                8601
            ],
            [
                8748,
                8781
            ],
            [
                8796,
                8833
            ],
            [
                8837,
                8855
            ],
            [
                8866,
                8883
            ],
            [
                8886,
                8912
            ],
            [
                8913,
                8927
            ],
            [
                8988,
                8994
            ],
            [
                9040,
                9042
            ],
            [
                9033,
                9036
            ],
            [
                9043,
                9069
            ],
            [
                9164,
                9204
            ],
            [
                9207,
                9219
            ],
            [
                9229,
                9238
            ],
            [
                9239,
                9305
            ],
            [
                9308,
                9324
            ],
            [
                9460,
                9528
            ],
            [
                9529,
                9567
            ],
            [
                9570,
                9616
            ],
            [
                9869,
                9877
            ],
            [
                9897,
                9949
            ],
            [
                9952,
                9975
            ],
            [
                9983,
                9988
            ],
            [
                9989,
                10012
            ],
            [
                10015,
                10056
            ],
            [
                10057,
                10111
            ],
            [
                10111,
                10171
            ],
            [
                10175,
                10243
            ],
            [
                10252,
                10300
            ],
            [
                10304,
                10311
            ],
            [
                10314,
                10345
            ],
            [
                10384,
                10405
            ],
            [
                10406,
                10424
            ],
            [
                10492,
                10494
            ],
            [
                10494,
                10539
            ],
            [
                10550,
                10570
            ],
            [
                10582,
                10657
            ],
            [
                10671,
                10694
            ],
            [
                10694,
                10787
            ],
            [
                10830,
                10846
            ],
            [
                10856,
                10868
            ],
            [
                10868,
                10903
            ],
            [
                10929,
                10932
            ],
            [
                10939,
                10981
            ],
            [
                10984,
                11001
            ],
            [
                11003,
                11021
            ],
            [
                11061,
                11063
            ],
            [
                11092,
                11098
            ],
            [
                11109,
                11119
            ],
            [
                11079,
                11090
            ],
            [
                11119,
                11177
            ],
            [
                11220,
                11222
            ],
            [
                11288,
                11293
            ],
            [
                11312,
                11316
            ],
            [
                11286,
                11287
            ],
            [
                11257,
                11286
            ],
            [
                11316,
                11323
            ],
            [
                11346,
                11405
            ],
            [
                11405,
                11422
            ],
            [
                11426,
                11429
            ],
            [
                11453,
                11477
            ],
            [
                11497,
                11499
            ],
            [
                11515,
                11521
            ],
            [
                11521,
                11531
            ],
            [
                11613,
                11616
            ],
            [
                11632,
                11638
            ],
            [
                11559,
                11570
            ],
            [
                11702,
                11747
            ],
            [
                11753,
                11809
            ],
            [
                11809,
                11846
            ],
            [
                12013,
                12020
            ],
            [
                11986,
                11987
            ],
            [
                11857,
                11860
            ],
            [
                11927,
                11934
            ],
            [
                11934,
                11935
            ],
            [
                12027,
                12028
            ],
            [
                12056,
                12066
            ],
            [
                12071,
                12112
            ],
            [
                11984,
                11985
            ],
            [
                12258,
                12281
            ],
            [
                12284,
                12297
            ],
            [
                12299,
                12343
            ],
            [
                12343,
                12403
            ],
            [
                12448,
                12461
            ],
            [
                12486,
                12515
            ],
            [
                12549,
                12557
            ],
            [
                12580,
                12600
            ],
            [
                12617,
                12650
            ],
            [
                12650,
                12668
            ],
            [
                12692,
                12699
            ],
            [
                12681,
                12687
            ],
            [
                12742,
                12808
            ],
            [
                12834,
                12860
            ],
            [
                12876,
                12877
            ]
        ],
        "row_chars": [
            [
                0,
                147
            ],
            [
                147,
                485
            ],
            [
                485,
                667
            ],
            [
                667,
                969
            ],
            [
                969,
                1327
            ],
            [
                1327,
                1721
            ],
            [
                1721,
                1837
            ],
            [
                1837,
                1946
            ],
            [
                1946,
                1999
            ],
            [
                1999,
                2223
            ],
            [
                2223,
                2556
            ],
            [
                2556,
                2856
            ],
            [
                2856,
                2870
            ],
            [
                2870,
                2939
            ],
            [
                2939,
                2964
            ],
            [
                2964,
                3101
            ],
            [
                3101,
                3153
            ],
            [
                3153,
                3326
            ],
            [
                3326,
                3446
            ],
            [
                3446,
                3498
            ],
            [
                3498,
                3760
            ],
            [
                3760,
                3799
            ],
            [
                3799,
                3858
            ],
            [
                3858,
                3934
            ],
            [
                3934,
                4013
            ],
            [
                4013,
                4057
            ],
            [
                4057,
                4126
            ],
            [
                4126,
                4187
            ],
            [
                4187,
                4272
            ],
            [
                4272,
                4487
            ],
            [
                4487,
                4542
            ],
            [
                4542,
                4650
            ],
            [
                4650,
                4730
            ],
            [
                4730,
                4842
            ],
            [
                4842,
                4902
            ],
            [
                4902,
                4966
            ],
            [
                4966,
                5125
            ],
            [
                5125,
                5411
            ],
            [
                5411,
                5489
            ],
            [
                5489,
                5534
            ],
            [
                5534,
                5626
            ],
            [
                5626,
                5837
            ],
            [
                5837,
                5862
            ],
            [
                5862,
                5982
            ],
            [
                5982,
                6380
            ],
            [
                6380,
                6498
            ],
            [
                6498,
                6569
            ],
            [
                6569,
                6743
            ],
            [
                6743,
                6831
            ],
            [
                6831,
                6909
            ],
            [
                6909,
                6951
            ],
            [
                6951,
                7076
            ],
            [
                7076,
                7190
            ],
            [
                7190,
                7382
            ],
            [
                7382,
                7438
            ],
            [
                7438,
                7453
            ],
            [
                7453,
                7466
            ],
            [
                7466,
                7547
            ],
            [
                7547,
                7566
            ],
            [
                7566,
                7623
            ],
            [
                7623,
                7697
            ],
            [
                7697,
                7759
            ],
            [
                7759,
                7848
            ],
            [
                7848,
                7899
            ],
            [
                7899,
                7912
            ],
            [
                7912,
                8000
            ],
            [
                8000,
                8030
            ],
            [
                8030,
                8105
            ],
            [
                8105,
                8130
            ],
            [
                8130,
                8176
            ],
            [
                8176,
                8240
            ],
            [
                8240,
                8326
            ],
            [
                8326,
                8396
            ],
            [
                8396,
                8455
            ],
            [
                8455,
                8491
            ],
            [
                8491,
                8601
            ],
            [
                8601,
                8836
            ],
            [
                8836,
                8886
            ],
            [
                8886,
                8912
            ],
            [
                8912,
                8927
            ],
            [
                8927,
                8983
            ],
            [
                8983,
                9071
            ],
            [
                9071,
                9163
            ],
            [
                9163,
                9238
            ],
            [
                9238,
                9324
            ],
            [
                9324,
                9397
            ],
            [
                9397,
                9460
            ],
            [
                9460,
                9616
            ],
            [
                9616,
                9869
            ],
            [
                9869,
                9952
            ],
            [
                9952,
                9988
            ],
            [
                9988,
                10056
            ],
            [
                10056,
                10111
            ],
            [
                10111,
                10171
            ],
            [
                10171,
                10303
            ],
            [
                10303,
                10494
            ],
            [
                10494,
                10657
            ],
            [
                10657,
                10694
            ],
            [
                10694,
                10787
            ],
            [
                10787,
                10868
            ],
            [
                10868,
                10984
            ],
            [
                10984,
                11222
            ],
            [
                11222,
                11405
            ],
            [
                11405,
                11521
            ],
            [
                11521,
                11640
            ],
            [
                11640,
                11699
            ],
            [
                11699,
                11809
            ],
            [
                11809,
                11846
            ],
            [
                11846,
                12155
            ],
            [
                12155,
                12161
            ],
            [
                12161,
                12257
            ],
            [
                12257,
                12343
            ],
            [
                12343,
                12448
            ],
            [
                12448,
                12515
            ],
            [
                12515,
                12650
            ],
            [
                12650,
                12877
            ]
        ]
    },
    "abridged": {
        "text": "Summer drew to an end, and autumn came. Harvest was late that year. Mr. Linton and his daughter would frequently walk out among the reapers; once they stayed till dusk, and the evening being chill and damp, my master caught a bad cold that kept him indoors all winter.\nPoor Cathy had been considerably sadder and duller since abandoning her little romance; and her father insisted on her reading less, and taking more exercise. I kept her company as much as possible, although I could only spare two or three hours a day, and my society was less desirable to her than her father's.\nOn a fresh afternoon in October, when paths were rustling with withered leaves, and the cold blue sky was half hidden by rain-clouds, my young lady still insisted on her ramble; so I unwillingly donned a cloak, and took my umbrella to accompany her on a stroll to the bottom of the park. It was a walk which she took if low-spirited - as she always was when Mr. Edgar was ill; she guessed his state from his silence and melancholy.\nShe went sadly on: there was no running or bounding now. And often I detected her raising a hand, and brushing something off her cheek. I gazed round for a means of diverting her thoughts.\nOn one side of the road rose a high bank, where hazels and stunted oaks clung uncertainly; strong winds had blown some nearly horizontal. In summer Miss Catherine delighted to climb these and sit in the branches, swinging twenty feet above the ground. I, pleased with her agility, still scolded every time I caught her there, but so mildly that she knew there was no need to descend. From dinner to tea she would lie in her breeze-rocked cradle, singing old songs, or watching the birds: or half thinking, half dreaming, happier than words can express.\n'Look, Miss!' I exclaimed, pointing to the roots of one twisted tree. 'Winter is not here yet. There's a little flower there, the last bluebell of the year. Will you pluck it, to show to papa?'\nCathy stared at the lonely blossom, and replied, 'No, I'll not touch it: but it looks sad, does it not, Ellen?'\n'Yes,' I observed, 'like you: your cheeks are bloodless; let us hold hands and run. I daresay I shall keep up with you.'\n'No,' she repeated, and continued walking on, pausing at intervals. Frequently her hand was lifted to her averted face.\n'Catherine, why are you crying, love?' I asked, putting my arm round her. 'You mustn't cry because papa has a cold; be thankful it is nothing worse.'\nHer breath was stifled by sobs.\n'Oh, it will be something worse,' she said. 'And what shall I do when papa and you leave me? How dreary the world will be, when papa and you are dead.'\n'Why,' said I, 'we'll hope there are years to come before that: master is young, and I am strong, and hardly forty-five. My mother lived till eighty. And suppose Mr. Linton were spared till he saw sixty! Would it not be foolish to mourn him twenty years beforehand?'\n'But Aunt Isabella was younger than papa,' she remarked, with timid hope.\n'Aunt Isabella had not you and me to nurse her,' I replied. 'She hadn't as much to live for as your father. You can cheer him by being cheerful; and avoid giving him anxiety: mind that, Cathy! You might kill him if you were wild and reckless, and cherished a fanciful affection for the son of a person who would be glad to have him in his grave; and if you let him discover that you fretted over the separation he thought it best to make.'\n'I fret about nothing except papa's illness,' she answered. 'I care for nothing in comparison with papa. And I'll never, never, do an act or say a word to vex him. I love him better than myself, Ellen.'\n'Good words,' I replied. 'But deeds must prove it also; and after he is well, don't forget it.'\nAs we talked, we neared a door that opened on the road. Cathy climbed up and sat on top of the wall, reaching over to gather some rose-hips that bloomed scarlet on the wild-rose trees shadowing the highway. In stretching to pick them, her hat fell off; and as the door was locked, she proposed scrambling down to recover it. I bid her be careful, and she nimbly disappeared.\nBut the return was no such easy matter: the stones were smooth. I heard her laughing and exclaiming, 'Ellen! you'll have to fetch the key. I can't scale the ramparts on this side!'\n'I have my bundle of keys in my pocket,' I answered: 'perhaps I may manage to open it; if not, I'll go.'\nCatherine danced to and fro before the door, while I tried all the large keys in turn. I found that none would do; so, telling her to stay there, I was about to hurry home as fast as I could, when an approaching sound arrested me. It was the trot of a horse; Cathy's dance stopped also.\n'Who is that?' I whispered.\n'Ellen, I wish you could open the door,' she whispered back anxiously.\n'Ho, Miss Linton!' cried a deep voice. 'I'm glad to meet you. Don't hurry in, for I have something to ask.'\n'I shan't speak to you, Mr. Heathcliff,' answered Catherine. 'Papa says you are a wicked man, and you hate both him and me.'\n'That is nothing to the purpose,' said Heathcliff. 'I don't hate my son, I suppose; and it is about him that I want to speak. Yes; you have cause to blush. Two or three months ago, were you not in the habit of writing to Linton? making love in play, eh? You both deserved flogging for that! You especially, the elder; and less sensitive, as it turns out. I've got your letters, and if you give me any pertness I'll send them to your father. I presume you grew weary of the amusement and dropped it? Well, you dropped Linton with it into a Slough of Despond. He was really in love. As true as I live, he's dying for you; actually breaking his heart at your fickleness. He gets worse daily; and he'll be dead before summer, unless you restore him!'\n'How can you lie so to the poor child?' I called from the inside. 'Pray ride on! Cathy, don't you believe that vile nonsense.'\n'I was not aware there were eavesdroppers,' muttered the villain. 'Worthy Mrs. Dean, I like you, but I don't like your double-dealing,' he added aloud. 'Catherine Linton (the very name warms me), my bonny lass, I shall be away from home all this week; go and see if have not spoken truth: do, there's a darling! I swear, Linton's going to his grave, and none but you can save him!'\nThe lock gave way and I rushed out.\n'I swear Linton is dying,' repeated Heathcliff, looking hard at me. 'And grief and disappointment are hastening his death. Nelly, if you won't let her go, you can walk over yourself. I shall not return till this time next week; and I think your master would scarcely object to her visiting her cousin.'\n'Come in,' said I, taking Cathy by the arm. She lingered, viewing Heathcliff with troubled eyes.\nHe pushed his horse close, and, bending down, said, 'Miss Catherine, I'll admit that I have little patience with Linton; and Hareton and Joseph have less. He's with a harsh set. He pines for kindness, as well as love; and a kind word from you would be his best medicine. Be generous, and go to see him. He dreams of you day and night, and thinks you hate him, since you neither write nor call.'\nI closed the door and rolled a stone against it. Then I drew Cathy underneath my umbrella: for the rain began to drive through the moaning branches. As we hurried home, we did not talk about the encounter with Heathcliff; but I guessed that Catherine's heart was clouded now in double darkness. Her features were sad: she evidently regarded his words as true.\nThe master was asleep in bed when we came in. Cathy and I took our tea together; and afterwards she lay on the rug, and told me not to talk, for she was weary. I got a book, and pretended to read. After a while I saw she was again weeping silently: so I began ridiculing Mr. Heathcliff's assertions about his son.\n'You may be right, Ellen,' she answered; 'but I shall never feel at ease till I know. And I must tell Linton it is not my fault that I don't write.'\nWhat use were my protests against her silly credulity? Next day I went to Wuthering Heights beside my wilful young mistress's pony. I couldn't bear to see her sorrow: and I yielded, in the faint hope that Linton himself might prove how little of the tale was true.",
        "paragraph_chars": [
            [
                0,
                269
            ],
            [
                269,
                582
            ],
            [
                582,
                1014
            ],
            [
                1014,
                1203
            ],
            [
                1203,
                1756
            ],
            [
                1756,
                1950
            ],
            [
                1950,
                2062
            ],
            [
                2062,
                2183
            ],
            [
                2183,
                2303
            ],
            [
                2303,
                2453
            ],
            [
                2453,
                2485
            ],
            [
                2485,
                2637
            ],
            [
                2637,
                2904
            ],
            [
                2904,
                2978
            ],
            [
                2978,
                3418
            ],
            [
                3418,
                3621
            ],
            [
                3621,
                3717
            ],
            [
                3717,
                4092
            ],
            [
                4092,
                4273
            ],
            [
                4273,
                4378
            ],
            [
                4378,
                4665
            ],
            [
                4665,
                4693
            ],
            [
                4693,
                4764
            ],
            [
                4764,
                4872
            ],
            [
                4872,
                4997
            ],
            [
                4997,
                5744
            ],
            [
                5744,
                5871
            ],
            [
                5871,
                6253
            ],
            [
                6253,
                6289
            ],
            [
                6289,
                6592
            ],
            [
                6592,
                6689
            ],
            [
                6689,
                7084
            ],
            [
                7084,
                7444
            ],
            [
                7444,
                7758
            ],
            [
                7758,
                7907
            ],
            [
                7907,
                8171
            ]
        ],
        "segment_chars": [
            [
                0,
                40
            ],
            [
                40,
                68
            ],
            [
                68,
                269
            ],
            [
                269,
                428
            ],
            [
                428,
                582
            ],
            [
                582,
                870
            ],
            [
                870,
                1014
            ],
            [
                1014,
                1071
            ],
            [
                1071,
                1150
            ],
            [
                1150,
                1203
            ],
            [
                1203,
                1341
            ],
            [
                1341,
                1455
            ],
            [
                1455,
                1587
            ],
            [
                1587,
                1756
            ],
            [
                1756,
                1770
            ],
            [
                1770,
                1826
            ],
            [
                1826,
                1851
            ],
            [
                1851,
                1913
            ],
            [
                1913,
                1950
            ],
            [
                1950,
                2062
            ],
            [
                2062,
                2146
            ],
            [
                2146,
                2183
            ],
            [
                2183,
                2251
            ],
            [
                2251,
                2303
            ],
            [
                2303,
                2342
            ],
            [
                2342,
                2377
            ],
            [
                2377,
                2453
            ],
            [
                2453,
                2485
            ],
            [
                2485,
                2529
            ],
            [
                2529,
                2578
            ],
            [
                2578,
                2637
            ],
            [
                2637,
                2758
            ],
            [
                2758,
                2787
            ],
            [
                2787,
                2841
            ],
            [
                2841,
                2904
            ],
            [
                2904,
                2978
            ],
            [
                2978,
                3038
            ],
            [
                3038,
                3086
            ],
            [
                3086,
                3171
            ],
            [
                3171,
                3418
            ],
            [
                3418,
                3478
            ],
            [
                3478,
                3523
            ],
            [
                3523,
                3582
            ],
            [
                3582,
                3621
            ],
            [
                3621,
                3646
            ],
            [
                3646,
                3717
            ],
            [
                3717,
                3773
            ],
            [
                3773,
                3924
            ],
            [
                3924,
                4042
            ],
            [
                4042,
                4092
            ],
            [
                4092,
                4156
            ],
            [
                4156,
                4201
            ],
            [
                4201,
                4231
            ],
            [
                4231,
                4273
            ],
            [
                4273,
                4378
            ],
            [
                4378,
                4465
            ],
            [
                4465,
                4609
            ],
            [
                4609,
                4665
            ],
            [
                4665,
                4680
            ],
            [
                4680,
                4693
            ],
            [
                4693,
                4764
            ],
            [
                4764,
                4783
            ],
            [
                4783,
                4803
            ],
            [
                4803,
                4826
            ],
            [
                4826,
                4872
            ],
            [
                4872,
                4933
            ],
            [
                4933,
                4997
            ],
            [
                4997,
                5048
            ],
            [
                5048,
                5123
            ],
            [
                5123,
                5153
            ],
            [
                5153,
                5226
            ],
            [
                5226,
                5251
            ],
            [
                5251,
                5288
            ],
            [
                5288,
                5352
            ],
            [
                5352,
                5438
            ],
            [
                5438,
                5496
            ],
            [
                5496,
                5555
            ],
            [
                5555,
                5578
            ],
            [
                5578,
                5665
            ],
            [
                5665,
                5744
            ],
            [
                5744,
                5784
            ],
            [
                5784,
                5810
            ],
            [
                5810,
                5825
            ],
            [
                5825,
                5871
            ],
            [
                5871,
                5937
            ],
            [
                5937,
                6023
            ],
            [
                6023,
                6183
            ],
            [
                6183,
                6253
            ],
            [
                6253,
                6289
            ],
            [
                6289,
                6357
            ],
            [
                6357,
                6412
            ],
            [
                6412,
                6472
            ],
            [
                6472,
                6592
            ],
            [
                6592,
                6636
            ],
            [
                6636,
                6689
            ],
            [
                6689,
                6844
            ],
            [
                6844,
                6867
            ],
            [
                6867,
                6960
            ],
            [
                6960,
                6992
            ],
            [
                6992,
                7084
            ],
            [
                7084,
                7133
            ],
            [
                7133,
                7233
            ],
            [
                7233,
                7379
            ],
            [
                7379,
                7444
            ],
            [
                7444,
                7490
            ],
            [
                7490,
                7604
            ],
            [
                7604,
                7641
            ],
            [
                7641,
                7758
            ],
            [
                7758,
                7844
            ],
            [
                7844,
                7907
            ],
            [
                7907,
                7962
            ],
            [
                7962,
                8039
            ],
            [
                8039,
                8171
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                27,
                33
            ],
            [
                40,
                66
            ],
            [
                66,
                68
            ],
            [
                68,
                140
            ],
            [
                146,
                184
            ],
            [
                191,
                234
            ],
            [
                235,
                239
            ],
            [
                245,
                256
            ],
            [
                261,
                267
            ],
            [
                267,
                269
            ],
            [
                269,
                279
            ],
            [
                280,
                325
            ],
            [
                337,
                355
            ],
            [
                355,
                428
            ],
            [
                428,
                429
            ],
            [
                435,
                438
            ],
            [
                447,
                467
            ],
            [
                477,
                514
            ],
            [
                515,
                516
            ],
            [
                520,
                525
            ],
            [
                526,
                540
            ],
            [
                541,
                555
            ],
            [
                556,
                558
            ],
            [
                563,
                567
            ],
            [
                580,
                582
            ],
            [
                582,
                584
            ],
            [
                585,
                592
            ],
            [
                593,
                614
            ],
            [
                615,
                619
            ],
            [
                620,
                644
            ],
            [
                645,
                702
            ],
            [
                703,
                708
            ],
            [
                714,
                715
            ],
            [
                716,
                729
            ],
            [
                748,
                758
            ],
            [
                763,
                764
            ],
            [
                791,
                796
            ],
            [
                814,
                816
            ],
            [
                846,
                849
            ],
            [
                857,
                859
            ],
            [
                860,
                863
            ],
            [
                868,
                870
            ],
            [
                877,
                878
            ],
            [
                879,
                893
            ],
            [
                894,
                898
            ],
            [
                899,
                916
            ],
            [
                920,
                923
            ],
            [
                931,
                949
            ],
            [
                954,
                957
            ],
            [
                957,
                958
            ],
            [
                959,
                962
            ],
            [
                963,
                970
            ],
            [
                971,
                974
            ],
            [
                981,
                989
            ],
            [
                990,
                1001
            ],
            [
                1002,
                1012
            ],
            [
                1012,
                1013
            ],
            [
                1014,
                1069
            ],
            [
                1069,
                1071
            ],
            [
                1071,
                1080
            ],
            [
                1081,
                1082
            ],
            [
                1092,
                1150
            ],
            [
                1150,
                1202
            ],
            [
                1203,
                1238
            ],
            [
                1239,
                1274
            ],
            [
                1281,
                1290
            ],
            [
                1292,
                1293
            ],
            [
                1294,
                1341
            ],
            [
                1341,
                1384
            ],
            [
                1385,
                1390
            ],
            [
                1391,
                1453
            ],
            [
                1455,
                1482
            ],
            [
                1482,
                1489
            ],
            [
                1490,
                1492
            ],
            [
                1498,
                1521
            ],
            [
                1527,
                1535
            ],
            [
                1543,
                1569
            ],
            [
                1575,
                1577
            ],
            [
                1585,
                1587
            ],
            [
                1587,
                1648
            ],
            [
                1649,
                1666
            ],
            [
                1666,
                1689
            ],
            [
                1689,
                1693
            ],
            [
                1694,
                1756
            ],
            [
                1757,
                1767
            ],
            [
                1770,
                1794
            ],
            [
                1795,
                1826
            ],
            [
                1827,
                1851
            ],
            [
                1851,
                1874
            ],
            [
                1880,
                1890
            ],
            [
                1891,
                1899
            ],
            [
                1900,
                1902
            ],
            [
                1903,
                1906
            ],
            [
                1911,
                1913
            ],
            [
                1913,
                1921
            ],
            [
                1922,
                1930
            ],
            [
                1930,
                1931
            ],
            [
                1932,
                1947
            ],
            [
                1950,
                1962
            ],
            [
                1963,
                1984
            ],
            [
                1984,
                1998
            ],
            [
                2000,
                2035
            ],
            [
                2039,
                2059
            ],
            [
                2063,
                2066
            ],
            [
                2069,
                2080
            ],
            [
                2087,
                2125
            ],
            [
                2126,
                2130
            ],
            [
                2131,
                2146
            ],
            [
                2146,
                2180
            ],
            [
                2184,
                2186
            ],
            [
                2189,
                2216
            ],
            [
                2225,
                2249
            ],
            [
                2262,
                2303
            ],
            [
                2304,
                2339
            ],
            [
                2342,
                2350
            ],
            [
                2351,
                2365
            ],
            [
                2372,
                2375
            ],
            [
                2375,
                2377
            ],
            [
                2378,
                2450
            ],
            [
                2453,
                2485
            ],
            [
                2486,
                2516
            ],
            [
                2519,
                2529
            ],
            [
                2530,
                2576
            ],
            [
                2576,
                2578
            ],
            [
                2578,
                2634
            ],
            [
                2649,
                2650
            ],
            [
                2653,
                2679
            ],
            [
                2680,
                2694
            ],
            [
                2699,
                2758
            ],
            [
                2758,
                2785
            ],
            [
                2785,
                2787
            ],
            [
                2787,
                2839
            ],
            [
                2841,
                2873
            ],
            [
                2878,
                2901
            ],
            [
                2905,
                2944
            ],
            [
                2947,
                2960
            ],
            [
                2961,
                2976
            ],
            [
                2976,
                2978
            ],
            [
                2979,
                3024
            ],
            [
                3027,
                3038
            ],
            [
                3043,
                3069
            ],
            [
                3070,
                3072
            ],
            [
                3084,
                3086
            ],
            [
                3086,
                3089
            ],
            [
                3094,
                3106
            ],
            [
                3113,
                3151
            ],
            [
                3151,
                3171
            ],
            [
                3171,
                3236
            ],
            [
                3237,
                3327
            ],
            [
                3339,
                3342
            ],
            [
                3343,
                3391
            ],
            [
                3400,
                3402
            ],
            [
                3408,
                3415
            ],
            [
                3419,
                3439
            ],
            [
                3440,
                3461
            ],
            [
                3468,
                3476
            ],
            [
                3476,
                3478
            ],
            [
                3479,
                3523
            ],
            [
                3523,
                3537
            ],
            [
                3537,
                3544
            ],
            [
                3544,
                3582
            ],
            [
                3582,
                3618
            ],
            [
                3622,
                3632
            ],
            [
                3635,
                3646
            ],
            [
                3647,
                3698
            ],
            [
                3699,
                3711
            ],
            [
                3717,
                3771
            ],
            [
                3773,
                3778
            ],
            [
                3779,
                3793
            ],
            [
                3798,
                3800
            ],
            [
                3801,
                3846
            ],
            [
                3852,
                3880
            ],
            [
                3881,
                3922
            ],
            [
                3922,
                3924
            ],
            [
                3924,
                3940
            ],
            [
                3946,
                4042
            ],
            [
                4042,
                4054
            ],
            [
                4062,
                4091
            ],
            [
                4092,
                4154
            ],
            [
                4154,
                4156
            ],
            [
                4156,
                4191
            ],
            [
                4191,
                4192
            ],
            [
                4194,
                4201
            ],
            [
                4201,
                4229
            ],
            [
                4229,
                4231
            ],
            [
                4231,
                4270
            ],
            [
                4274,
                4311
            ],
            [
                4314,
                4324
            ],
            [
                4324,
                4325
            ],
            [
                4327,
                4375
            ],
            [
                4378,
                4387
            ],
            [
                4395,
                4458
            ],
            [
                4463,
                4465
            ],
            [
                4465,
                4466
            ],
            [
                4467,
                4496
            ],
            [
                4517,
                4609
            ],
            [
                4609,
                4665
            ],
            [
                4666,
                4677
            ],
            [
                4680,
                4693
            ],
            [
                4694,
                4731
            ],
            [
                4738,
                4752
            ],
            [
                4753,
                4764
            ],
            [
                4765,
                4780
            ],
            [
                4783,
                4801
            ],
            [
                4804,
                4826
            ],
            [
                4826,
                4831
            ],
            [
                4838,
                4840
            ],
            [
                4840,
                4852
            ],
            [
                4863,
                4869
            ],
            [
                4872,
                4873
            ],
            [
                4873,
                4877
            ],
            [
                4879,
                4910
            ],
            [
                4913,
                4933
            ],
            [
                4934,
                4994
            ],
            [
                5003,
                5028
            ],
            [
                5031,
                5048
            ],
            [
                5049,
                5090
            ],
            [
                5097,
                5107
            ],
            [
                5121,
                5123
            ],
            [
                5123,
                5153
            ],
            [
                5153,
                5172
            ],
            [
                5176,
                5226
            ],
            [
                5226,
                5251
            ],
            [
                5251,
                5254
            ],
            [
                5255,
                5259
            ],
            [
                5260,
                5268
            ],
            [
                5269,
                5288
            ],
            [
                5288,
                5352
            ],
            [
                5352,
                5438
            ],
            [
                5438,
                5494
            ],
            [
                5494,
                5496
            ],
            [
                5496,
                5555
            ],
            [
                5555,
                5561
            ],
            [
                5562,
                5568
            ],
            [
                5569,
                5576
            ],
            [
                5576,
                5578
            ],
            [
                5578,
                5616
            ],
            [
                5617,
                5625
            ],
            [
                5626,
                5663
            ],
            [
                5663,
                5665
            ],
            [
                5665,
                5698
            ],
            [
                5704,
                5741
            ],
            [
                5745,
                5763
            ],
            [
                5764,
                5781
            ],
            [
                5784,
                5810
            ],
            [
                5811,
                5825
            ],
            [
                5825,
                5831
            ],
            [
                5835,
                5837
            ],
            [
                5838,
                5841
            ],
            [
                5842,
                5868
            ],
            [
                5872,
                5912
            ],
            [
                5915,
                5927
            ],
            [
                5928,
                5937
            ],
            [
                5938,
                6004
            ],
            [
                6007,
                6023
            ],
            [
                6024,
                6092
            ],
            [
                6098,
                6136
            ],
            [
                6137,
                6183
            ],
            [
                6183,
                6191
            ],
            [
                6198,
                6250
            ],
            [
                6253,
                6276
            ],
            [
                6284,
                6289
            ],
            [
                6290,
                6313
            ],
            [
                6316,
                6357
            ],
            [
                6358,
                6412
            ],
            [
                6412,
                6472
            ],
            [
                6472,
                6540
            ],
            [
                6541,
                6589
            ],
            [
                6593,
                6600
            ],
            [
                6603,
                6634
            ],
            [
                6636,
                6657
            ],
            [
                6669,
                6687
            ],
            [
                6687,
                6689
            ],
            [
                6689,
                6734
            ],
            [
                6742,
                6762
            ],
            [
                6769,
                6844
            ],
            [
                6844,
                6867
            ],
            [
                6867,
                6960
            ],
            [
                6960,
                6976
            ],
            [
                6980,
                6992
            ],
            [
                6992,
                7027
            ],
            [
                7035,
                7038
            ],
            [
                7039,
                7081
            ],
            [
                7084,
                7101
            ],
            [
                7102,
                7120
            ],
            [
                7129,
                7131
            ],
            [
                7138,
                7144
            ],
            [
                7151,
                7161
            ],
            [
                7162,
                7173
            ],
            [
                7173,
                7231
            ],
            [
                7231,
                7233
            ],
            [
                7233,
                7238
            ],
            [
                7247,
                7251
            ],
            [
                7251,
                7252
            ],
            [
                7275,
                7304
            ],
            [
                7304,
                7311
            ],
            [
                7320,
                7379
            ],
            [
                7379,
                7396
            ],
            [
                7397,
                7400
            ],
            [
                7400,
                7424
            ],
            [
                7435,
                7437
            ],
            [
                7438,
                7444
            ],
            [
                7444,
                7454
            ],
            [
                7455,
                7458
            ],
            [
                7459,
                7465
            ],
            [
                7478,
                7489
            ],
            [
                7502,
                7547
            ],
            [
                7548,
                7604
            ],
            [
                7604,
                7641
            ],
            [
                7647,
                7654
            ],
            [
                7655,
                7656
            ],
            [
                7661,
                7664
            ],
            [
                7675,
                7682
            ],
            [
                7691,
                7692
            ],
            [
                7696,
                7697
            ],
            [
                7704,
                7714
            ],
            [
                7715,
                7756
            ],
            [
                7756,
                7757
            ],
            [
                7759,
                7782
            ],
            [
                7785,
                7798
            ],
            [
                7800,
                7844
            ],
            [
                7844,
                7904
            ],
            [
                7907,
                7920
            ],
            [
                7933,
                7962
            ],
            [
                7962,
                7970
            ],
            [
                7978,
                7998
            ],
            [
                8006,
                8039
            ],
            [
                8039,
                8057
            ],
            [
                8058,
                8065
            ],
            [
                8066,
                8072
            ],
            [
                8072,
                8138
            ],
            [
                8139,
                8165
            ],
            [
                8170,
                8171
            ]
        ],
        "row_chars": [
            [
                0,
                68
            ],
            [
                68,
                269
            ],
            [
                269,
                428
            ],
            [
                428,
                582
            ],
            [
                582,
                870
            ],
            [
                870,
                1014
            ],
            [
                1014,
                1071
            ],
            [
                1071,
                1150
            ],
            [
                1150,
                1203
            ],
            [
                1203,
                1341
            ],
            [
                1341,
                1587
            ],
            [
                1587,
                1756
            ],
            [
                1756,
                1770
            ],
            [
                1770,
                1826
            ],
            [
                1826,
                1851
            ],
            [
                1851,
                1913
            ],
            [
                1913,
                1950
            ],
            [
                1950,
                2062
            ],
            [
                2062,
                2146
            ],
            [
                2146,
                2183
            ],
            [
                2183,
                2303
            ],
            [
                2303,
                2342
            ],
            [
                2342,
                2377
            ],
            [
                2377,
                2453
            ],
            [
                2453,
                2485
            ],
            [
                2485,
                2529
            ],
            [
                2529,
                2578
            ],
            [
                2578,
                2578
            ],
            [
                2578,
                2637
            ],
            [
                2637,
                2758
            ],
            [
                2758,
                2787
            ],
            [
                2787,
                2841
            ],
            [
                2841,
                2904
            ],
            [
                2904,
                2978
            ],
            [
                2978,
                3038
            ],
            [
                3038,
                3086
            ],
            [
                3086,
                3171
            ],
            [
                3171,
                3418
            ],
            [
                3418,
                3478
            ],
            [
                3478,
                3523
            ],
            [
                3523,
                3582
            ],
            [
                3582,
                3621
            ],
            [
                3621,
                3646
            ],
            [
                3646,
                3717
            ],
            [
                3717,
                3924
            ],
            [
                3924,
                4042
            ],
            [
                4042,
                4092
            ],
            [
                4092,
                4156
            ],
            [
                4156,
                4201
            ],
            [
                4201,
                4231
            ],
            [
                4231,
                4273
            ],
            [
                4273,
                4378
            ],
            [
                4378,
                4465
            ],
            [
                4465,
                4609
            ],
            [
                4609,
                4665
            ],
            [
                4665,
                4680
            ],
            [
                4680,
                4693
            ],
            [
                4693,
                4764
            ],
            [
                4764,
                4783
            ],
            [
                4783,
                4826
            ],
            [
                4826,
                4872
            ],
            [
                4872,
                4933
            ],
            [
                4933,
                4997
            ],
            [
                4997,
                5048
            ],
            [
                5048,
                5048
            ],
            [
                5048,
                5123
            ],
            [
                5123,
                5153
            ],
            [
                5153,
                5226
            ],
            [
                5226,
                5251
            ],
            [
                5251,
                5288
            ],
            [
                5288,
                5352
            ],
            [
                5352,
                5438
            ],
            [
                5438,
                5496
            ],
            [
                5496,
                5555
            ],
            [
                5555,
                5578
            ],
            [
                5578,
                5665
            ],
            [
                5665,
                5744
            ],
            [
                5744,
                5784
            ],
            [
                5784,
                5810
            ],
            [
                5810,
                5825
            ],
            [
                5825,
                5825
            ],
            [
                5825,
                5871
            ],
            [
                5871,
                5871
            ],
            [
                5871,
                5937
            ],
            [
                5937,
                6023
            ],
            [
                6023,
                6023
            ],
            [
                6023,
                6023
            ],
            [
                6023,
                6183
            ],
            [
                6183,
                6183
            ],
            [
                6183,
                6253
            ],
            [
                6253,
                6289
            ],
            [
                6289,
                6357
            ],
            [
                6357,
                6412
            ],
            [
                6412,
                6472
            ],
            [
                6472,
                6592
            ],
            [
                6592,
                6689
            ],
            [
                6689,
                6844
            ],
            [
                6844,
                6867
            ],
            [
                6867,
                6960
            ],
            [
                6960,
                6992
            ],
            [
                6992,
                7084
            ],
            [
                7084,
                7233
            ],
            [
                7233,
                7379
            ],
            [
                7379,
                7444
            ],
            [
                7444,
                7490
            ],
            [
                7490,
                7490
            ],
            [
                7490,
                7604
            ],
            [
                7604,
                7641
            ],
            [
                7641,
                7758
            ],
            [
                7758,
                7758
            ],
            [
                7758,
                7758
            ],
            [
                7758,
                7844
            ],
            [
                7844,
                7907
            ],
            [
                7907,
                7962
            ],
            [
                7962,
                8039
            ],
            [
                8039,
                8171
            ]
        ]
    }
}