{
    "original": {
        "text": "\"These things happened last winter, sir,\" said Mrs. Dean; \"hardly more than a year ago. Last winter, I did not think, at another twelve months' end, I should be amusing a stranger to the family with relating them! Yet, who knows how long you'll be a stranger? You're too young to rest always contented, living by yourself; and I some way fancy no one could see Catherine Linton and not love her. You smile; but why do you look so lively and interested when I talk about her? and why have you asked me to hang her picture over your fireplace? and why-?\"\n\"Stop, my good friend!\" I cried. \"It may be very possible that _I_ should love her; but would she love me? I doubt it too much to venture my tranquillity by running into temptation: and then my home is not here. I'm of the busy world, and to its arms I must return. Go on. Was Catherine obedient to her father's commands?\"\n\"She was,\" continued the housekeeper. \"Her affection for him was still the chief sentiment in her heart; and he spoke without anger: he spoke in the deep tenderness of one about to leave his treasure amid perils and foes, where his remembered words would be the only aid that he could bequeath to guide her. He said to me, a few days afterwards, 'I wish my nephew would write, Ellen, or call. Tell me, sincerely, what you think of him: is he changed for the better, or is there a prospect of improvement, as he grows a man?'\n\"'He's very delicate, sir,' I replied; 'and scarcely likely to reach manhood: but this I can say, he does not resemble his father; and if Miss Catherine had the misfortune to marry him, he would not be beyond her control: unless she were extremely and foolishly indulgent. However, master, you'll have plenty of time to get acquainted with him and see whether he would suit her: it wants four years and more to his being of age.'\"\nEdgar sighed; and, walking to the window, looked out towards Gimmerton Kirk. It was a misty afternoon, but the February sun shone dimly, and we could just distinguish the two fir-trees in the yard, and the sparely-scattered gravestones.\n\"I've prayed often,\" he half soliloquised, \"for the approach of what is coming; and now I begin to shrink, and fear it. I thought the memory of the hour I came down that glen a bridegroom would be less sweet than the anticipation that I was soon, in a few months, or, possibly, weeks, to be carried up, and laid in its lonely hollow! Ellen, I've been very happy with my little Cathy: through winter nights and summer days she was a living hope at my side. But I've been as happy musing by myself among those stones, under that old church: lying, through the long June evenings, on the green mound of her mother's grave, and wishing-yearning for the time when I might lie beneath it. What can I do for Cathy? How must I quit her? I'd not care one moment for Linton being Heathcliff's son; nor for his taking her from me, if he could console her for my loss. I'd not care that Heathcliff gained his ends, and triumphed in robbing me of my last blessing! But should Linton be unworthy-only a feeble tool to his father-I cannot abandon her to him! And, hard though it be to crush her buoyant spirit, I must persevere in making her sad while I live, and leaving her solitary when I die. Darling! I'd rather resign her to God, and lay her in the earth before me.\"\n\"Resign her to God as it is, sir,\" I answered, \"and if we should lose you-which may He forbid-under His providence, I'll stand her friend and counsellor to the last. Miss Catherine is a good girl: I don't fear that she will go wilfully wrong; and people who do their duty are always finally rewarded.\"\nSpring advanced; yet my master gathered no real strength, though he resumed his walks in the grounds with his daughter. To her inexperienced notions, this itself was a sign of convalescence; and then his cheek was often flushed, and his eyes were bright; she felt sure of his recovering. On her seventeenth birthday, he did not visit the churchyard: it was raining, and I observed-\"You'll surely not go out to-night, sir?\"\nHe answered,-\"No, I'll defer it this year a little longer.\" He wrote again to Linton, expressing his great desire to see him; and, had the invalid been presentable, I've no doubt his father would have permitted him to come. As it was, being instructed, he returned an answer, intimating that Mr. Heathcliff objected to his calling at the Grange; but his uncle's kind remembrance delighted him, and he hoped to meet him sometimes in his rambles, and personally to petition that his cousin and he might not remain long so utterly divided.\nThat part of his letter was simple, and probably his own. Heathcliff knew he could plead eloquently for Catherine's company, then.\n\"I do not ask,\" he said, \"that she may visit here; but am I never to see her, because my father forbids me to go to her home, and you forbid her to come to mine? Do, now and then, ride with her towards the Heights; and let us exchange a few words, in your presence! We have done nothing to deserve this separation; and you are not angry with me: you have no reason to dislike me, you allow, yourself. Dear uncle! send me a kind note to-morrow, and leave to join you anywhere you please, except at Thrushcross Grange. I believe an interview would convince you that my father's character is not mine: he affirms I am more your nephew than his son; and though I have faults which render me unworthy of Catherine, she has excused them, and for her sake, you should also. You inquire after my health-it is better; but while I remain cut off from all hope, and doomed to solitude, or the society of those who never did and never will like me, how can I be cheerful and well?\"\nEdgar, though he felt for the boy, could not consent to grant his request; because he could not accompany Catherine. He said, in summer, perhaps, they might meet: meantime, he wished him to continue writing at intervals, and engaged to give him what advice and comfort he was able by letter; being well aware of his hard position in his family. Linton complied; and had he been unrestrained, would probably have spoiled all by filling his epistles with complaints and lamentations: but his father kept a sharp watch over him; and, of course, insisted on every line that my master sent being shown; so, instead of penning his peculiar personal sufferings and distresses, the themes constantly uppermost in his thoughts, he harped on the cruel obligation of being held asunder from his friend and love; and gently intimated that Mr. Linton must allow an interview soon, or he should fear he was purposely deceiving him with empty promises.\nCathy was a powerful ally at home; and between them they at length persuaded my master to acquiesce in their having a ride or a walk together about once a week, under my guardianship, and on the moors nearest the Grange: for June found him still declining. Though he had set aside yearly a portion of his income for my young lady's fortune, he had a natural desire that she might retain-or at least return in a short time to-the house of her ancestors; and he considered her only prospect of doing that was by a union with his heir; he had no idea that the latter was failing almost as fast as himself; nor had any one, I believe: no doctor visited the Heights, and no one saw Master Heathcliff to make report of his condition among us. I, for my part, began to fancy my forebodings were false, and that he must be actually rallying, when he mentioned riding and walking on the moors, and seemed so earnest in pursuing his object. I could not picture a father treating a dying child as tyrannically and wickedly as I afterwards learned Heathcliff had treated him, to compel this apparent eagerness: his efforts redoubling the more imminently his avaricious and unfeeling plans were threatened with defeat by death.",
        "paragraph_chars": [
            [
                0,
                553
            ],
            [
                553,
                876
            ],
            [
                876,
                1401
            ],
            [
                1401,
                1832
            ],
            [
                1832,
                2069
            ],
            [
                2069,
                3327
            ],
            [
                3327,
                3629
            ],
            [
                3629,
                4052
            ],
            [
                4052,
                4589
            ],
            [
                4589,
                4720
            ],
            [
                4720,
                5690
            ],
            [
                5690,
                6628
            ],
            [
                6628,
                7842
            ]
        ],
        "segment_chars": [
            [
                0,
                88
            ],
            [
                88,
                214
            ],
            [
                214,
                260
            ],
            [
                260,
                396
            ],
            [
                396,
                475
            ],
            [
                475,
                542
            ],
            [
                542,
                553
            ],
            [
                553,
                577
            ],
            [
                577,
                586
            ],
            [
                586,
                660
            ],
            [
                660,
                765
            ],
            [
                765,
                819
            ],
            [
                819,
                826
            ],
            [
                826,
                876
            ],
            [
                876,
                914
            ],
            [
                914,
                1184
            ],
            [
                1184,
                1269
            ],
            [
                1269,
                1401
            ],
            [
                1401,
                1674
            ],
            [
                1674,
                1832
            ],
            [
                1832,
                1909
            ],
            [
                1909,
                2069
            ],
            [
                2069,
                2189
            ],
            [
                2189,
                2403
            ],
            [
                2403,
                2525
            ],
            [
                2525,
                2752
            ],
            [
                2752,
                2777
            ],
            [
                2777,
                2798
            ],
            [
                2798,
                2926
            ],
            [
                2926,
                3021
            ],
            [
                3021,
                3113
            ],
            [
                3113,
                3251
            ],
            [
                3251,
                3260
            ],
            [
                3260,
                3327
            ],
            [
                3327,
                3493
            ],
            [
                3493,
                3629
            ],
            [
                3629,
                3749
            ],
            [
                3749,
                3917
            ],
            [
                3917,
                4052
            ],
            [
                4052,
                4112
            ],
            [
                4112,
                4276
            ],
            [
                4276,
                4589
            ],
            [
                4589,
                4647
            ],
            [
                4647,
                4720
            ],
            [
                4720,
                4882
            ],
            [
                4882,
                4986
            ],
            [
                4986,
                5121
            ],
            [
                5121,
                5133
            ],
            [
                5133,
                5237
            ],
            [
                5237,
                5487
            ],
            [
                5487,
                5690
            ],
            [
                5690,
                5807
            ],
            [
                5807,
                6035
            ],
            [
                6035,
                6628
            ],
            [
                6628,
                6885
            ],
            [
                6885,
                7365
            ],
            [
                7365,
                7559
            ],
            [
                7559,
                7842
            ]
        ],
        "overlap_chars": [
            [
                7,
                39
            ],
            [
                42,
                56
            ],
            [
                86,
                88
            ],
            [
                142,
                143
            ],
            [
                101,
                117
            ],
            [
                147,
                179
            ],
            [
                194,
                214
            ],
            [
                214,
                260
            ],
            [
                327,
                328
            ],
            [
                338,
                396
            ],
            [
                396,
                475
            ],
            [
                475,
                540
            ],
            [
                558,
                574
            ],
            [
                577,
                586
            ],
            [
                587,
                615
            ],
            [
                617,
                618
            ],
            [
                620,
                660
            ],
            [
                660,
                670
            ],
            [
                733,
                738
            ],
            [
                744,
                765
            ],
            [
                765,
                819
            ],
            [
                819,
                826
            ],
            [
                830,
                839
            ],
            [
                852,
                862
            ],
            [
                897,
                912
            ],
            [
                887,
                896
            ],
            [
                988,
                1007
            ],
            [
                1096,
                1097
            ],
            [
                1021,
                1075
            ],
            [
                1161,
                1169
            ],
            [
                1138,
                1142
            ],
            [
                1119,
                1124
            ],
            [
                1170,
                1183
            ],
            [
                1184,
                1197
            ],
            [
                1220,
                1258
            ],
            [
                1267,
                1269
            ],
            [
                1269,
                1287
            ],
            [
                1310,
                1347
            ],
            [
                1381,
                1392
            ],
            [
                1393,
                1401
            ],
            [
                1403,
                1621
            ],
            [
                1623,
                1638
            ],
            [
                1653,
                1674
            ],
            [
                1674,
                1744
            ],
            [
                1778,
                1782
            ],
            [
                1789,
                1799
            ],
            [
                1761,
                1763
            ],
            [
                1822,
                1828
            ],
            [
                1832,
                1902
            ],
            [
                1907,
                1909
            ],
            [
                1909,
                2002
            ],
            [
                2056,
                2069
            ],
            [
                2070,
                2087
            ],
            [
                2090,
                2092
            ],
            [
                2110,
                2111
            ],
            [
                2113,
                2147
            ],
            [
                2187,
                2189
            ],
            [
                2410,
                2451
            ],
            [
                2523,
                2525
            ],
            [
                2525,
                2613
            ],
            [
                2647,
                2692
            ],
            [
                2701,
                2752
            ],
            [
                2752,
                2777
            ],
            [
                2826,
                2832
            ],
            [
                2839,
                2855
            ],
            [
                2887,
                2926
            ],
            [
                3021,
                3024
            ],
            [
                3032,
                3038
            ],
            [
                3042,
                3113
            ],
            [
                3113,
                3135
            ],
            [
                3163,
                3171
            ],
            [
                3192,
                3217
            ],
            [
                3226,
                3251
            ],
            [
                3251,
                3260
            ],
            [
                3260,
                3324
            ],
            [
                3335,
                3345
            ],
            [
                3354,
                3359
            ],
            [
                3362,
                3373
            ],
            [
                3375,
                3410
            ],
            [
                3414,
                3421
            ],
            [
                3443,
                3464
            ],
            [
                3480,
                3493
            ],
            [
                3493,
                3522
            ],
            [
                3570,
                3573
            ],
            [
                3594,
                3598
            ],
            [
                3629,
                3671
            ],
            [
                3677,
                3749
            ],
            [
                3884,
                3887
            ],
            [
                3791,
                3794
            ],
            [
                3905,
                3915
            ],
            [
                3829,
                3882
            ],
            [
                3915,
                3916
            ],
            [
                3917,
                3945
            ],
            [
                4112,
                4252
            ],
            [
                4263,
                4266
            ],
            [
                4270,
                4276
            ],
            [
                4276,
                4286
            ],
            [
                4339,
                4401
            ],
            [
                4402,
                4500
            ],
            [
                4512,
                4514
            ],
            [
                4524,
                4563
            ],
            [
                4580,
                4588
            ],
            [
                4589,
                4646
            ],
            [
                4721,
                4733
            ],
            [
                4736,
                4744
            ],
            [
                4746,
                4796
            ],
            [
                4880,
                4882
            ],
            [
                4882,
                4884
            ],
            [
                4900,
                4986
            ],
            [
                5121,
                5133
            ],
            [
                5133,
                5152
            ],
            [
                5162,
                5167
            ],
            [
                5174,
                5194
            ],
            [
                5207,
                5237
            ],
            [
                5284,
                5321
            ],
            [
                5330,
                5396
            ],
            [
                5404,
                5450
            ],
            [
                5485,
                5487
            ],
            [
                5505,
                5514
            ],
            [
                5518,
                5540
            ],
            [
                5548,
                5560
            ],
            [
                5565,
                5593
            ],
            [
                5655,
                5687
            ],
            [
                5690,
                5734
            ],
            [
                5746,
                5807
            ],
            [
                5807,
                5865
            ],
            [
                5931,
                5934
            ],
            [
                5940,
                5946
            ],
            [
                5909,
                5914
            ],
            [
                5866,
                5896
            ],
            [
                6033,
                6034
            ],
            [
                6035,
                6041
            ],
            [
                6060,
                6062
            ],
            [
                6056,
                6059
            ],
            [
                6063,
                6081
            ],
            [
                6409,
                6411
            ],
            [
                6082,
                6128
            ],
            [
                6138,
                6153
            ],
            [
                6170,
                6214
            ],
            [
                6219,
                6220
            ],
            [
                6052,
                6055
            ],
            [
                6232,
                6243
            ],
            [
                6244,
                6254
            ],
            [
                6286,
                6290
            ],
            [
                6561,
                6563
            ],
            [
                6512,
                6538
            ],
            [
                6603,
                6606
            ],
            [
                6539,
                6551
            ],
            [
                6607,
                6611
            ],
            [
                6552,
                6556
            ],
            [
                6626,
                6628
            ],
            [
                6685,
                6694
            ],
            [
                6705,
                6714
            ],
            [
                6715,
                6717
            ],
            [
                6731,
                6769
            ],
            [
                6776,
                6811
            ],
            [
                6816,
                6828
            ],
            [
                6837,
                6847
            ],
            [
                6634,
                6637
            ],
            [
                6868,
                6883
            ],
            [
                6728,
                6730
            ],
            [
                6883,
                6885
            ],
            [
                6885,
                6908
            ],
            [
                6940,
                7007
            ],
            [
                7027,
                7033
            ],
            [
                7050,
                7052
            ],
            [
                7288,
                7289
            ],
            [
                7053,
                7084
            ],
            [
                7099,
                7137
            ],
            [
                7151,
                7159
            ],
            [
                7363,
                7364
            ],
            [
                7161,
                7180
            ],
            [
                7192,
                7288
            ],
            [
                7365,
                7389
            ],
            [
                7427,
                7431
            ],
            [
                7435,
                7442
            ],
            [
                7452,
                7511
            ],
            [
                7557,
                7559
            ],
            [
                7559,
                7694
            ],
            [
                7727,
                7730
            ],
            [
                7799,
                7842
            ]
        ],
        "row_chars": [
            [
                0,
                88
            ],
            [
                88,
                214
            ],
            [
                214,
                260
            ],
            [
                260,
                396
            ],
            [
                396,
                475
            ],
            [
                475,
                542
            ],
            [
                542,
                553
            ],
            [
                553,
                577
            ],
            [
                577,
                586
            ],
            [
                586,
                660
            ],
            [
                660,
                765
            ],
            [
                765,
                819
            ],
            [
                819,
                826
            ],
            [
                826,
                876
            ],
            [
                876,
                914
            ],
            [
                914,
                1184
            ],
            [
                1184,
                1269
            ],
            [
                1269,
                1401
            ],
            [
                1401,
                1674
            ],
            [
                1674,
                1832
            ],
            [
                1832,
                1909
            ],
            [
                1909,
                2069
            ],
            [
                2069,
                2189
            ],
            [
                2189,
                2403
            ],
            [
                2403,
                2525
            ],
            [
                2525,
                2752
            ],
            [
                2752,
                2777
            ],
            [
                2777,
                2798
            ],
            [
                2798,
                2926
            ],
            [
                2926,
                3021
            ],
            [
                3021,
                3113
            ],
            [
                3113,
                3251
            ],
            [
                3251,
                3260
            ],
            [
                3260,
                3327
            ],
            [
                3327,
                3493
            ],
            [
                3493,
                3629
            ],
            [
                3629,
                3749
            ],
            [
                3749,
                3917
            ],
            [
                3917,
                4276
            ],
            [
                4276,
                4589
            ],
            [
                4589,
                4647
            ],
            [
                4647,
                4720
            ],
            [
                4720,
                4882
            ],
            [
                4882,
                4986
            ],
            [
                4986,
                5121
            ],
            [
                5121,
                5133
            ],
            [
                5133,
                5237
            ],
            [
                5237,
                5487
            ],
            [
                5487,
                5690
            ],
            [
                5690,
                5807
            ],
            [
                5807,
                6035
            ],
            [
                6035,
                6628
            ],
            [
                6628,
                6885
            ],
            [
                6885,
                7365
            ],
            [
                7365,
                7559
            ],
            [
                7559,
                7842
            ]
        ]
    },
    "abridged": {
        "text": "'These things happened last winter, sir,' said Mrs. Dean. 'I did not think, back then, I should be amusing a stranger with relating them! Yet, who knows how long you'll be a stranger? I fancy no one could see Catherine Linton and not love her. You smile; but why do you look so lively and interested when I talk about her? and why have you asked me to hang her picture over your fireplace?'\n'Stop, my good friend!' I cried. 'It may be very possible that I should love her; but would she love me? I doubt it: and my home is not here. I'm of the busy world, and to its arms I must return. Go on. Did Catherine obey her father?'\n'She did.' The housekeeper continued her story:\nEdgar spoke without anger, with the deep tenderness of one about to leave his treasure, who can bequeath only words to guide her.\nHe said to me, 'I wish my nephew would write, Ellen. Tell me, sincerely: is he changed for the better, or is he likely to improve as he grows to a man?'\n'He's very delicate, sir,' I replied; 'and scarcely likely to reach manhood: but this I can say, he does not resemble his father; and if Miss Catherine had the misfortune to marry him, he would not be beyond her control unless she were foolishly indulgent. However, master, you'll have plenty of time to get acquainted with him: it's still four years until he's of age at twenty-one.'\nEdgar sighed; and, walking to the window, looked out towards Gimmerton Church. It was a misty afternoon, but the February sun shone dimly, and we could just distinguish the gravestones.\n'I've prayed often,' he murmured, 'for the approach of what is coming. I've been very happy with my little Cathy. But I've been as happy musing by myself among those stones, under that old church: lying on the green mound of her mother's grave, and yearning for the time when I might lie beneath it. What can I do for Cathy? It doesn't matter that Linton is Heathcliff's son, if he could console her for my loss. But if Linton is unworthy - only a feeble tool to his father - I cannot abandon her to him! And, hard though it be, I must make her sad while I live, and leave her solitary when I die. Darling! I'd rather resign her to God, and lay her in the earth before me.'\n'Resign her to God, sir,' I answered, 'and if we should lose you - which may God forbid - I'll stand her friend to the last. Miss Catherine is a good girl, and does her duty.'\nSpring advanced; yet my master gathered no strength, though he resumed his walks in the grounds with his daughter. She thought he was recovering: his cheek was often flushed, and his eyes were bright.\nOn her seventeenth birthday, he wrote again to Linton, expressing his great desire to see him; and, had the invalid been presentable, I've no doubt his father would have let him come. As it was, Linton replied that Mr. Heathcliff objected to his calling at the Grange; but that his uncle's kind remembrance delighted him, and he hoped to meet him sometimes in his rambles, and to ask that his cousin and he might not remain divided. That part of his letter was simple, and probably his own.\n'I do not ask,' he said, 'that she may visit here; but am I never to see her? Do sometimes ride with her towards the Heights; and let us exchange a few words, in your presence! Dear uncle! send me a kind note tomorrow, and allow me to join you anywhere except at Thrushcross Grange. My father's character is not mine: he says I am more your nephew than his son; and though I have faults which make me unworthy of Catherine, she has excused them. My health is better; but while I am cut off from hope, and doomed to solitude, how can I be cheerful and well?'\nEdgar, though he felt for the boy, could not grant his request; because he could not accompany Catherine. He said, in summer, perhaps, they might meet: meantime, he sent him advice, and wished him to continue writing.\nLinton obeyed. If he had been unrestrained, he would probably have spoiled all by filling his letters with complaints: but his father kept a sharp watch over him, and insisted on seeing every line; so he merely suggested that Mr. Linton must allow him an interview with Cathy soon.\nAt length my master agreed to their having a ride or a walk together once a week, under my guardianship, on the moors near the Grange. He was still declining in health. Though he had set aside money for my young lady's fortune, he had a natural desire that she might return to Wuthering Heights, the house of her ancestors; and her only prospect of doing that was by marrying his heir. He had no idea that Linton was failing almost as fast as himself; nor had any one, I believe: no doctor visited the Heights.\nI, for my part, began to think that Linton must be rallying, when he mentioned riding and walking on the moors. I could not picture a father treating a dying child as tyrannically and wickedly as I afterwards learned Heathcliff had treated him, to make him write so eagerly, when his greedy plans were threatened with defeat by death.",
        "paragraph_chars": [
            [
                0,
                391
            ],
            [
                391,
                626
            ],
            [
                626,
                674
            ],
            [
                674,
                804
            ],
            [
                804,
                957
            ],
            [
                957,
                1342
            ],
            [
                1342,
                1528
            ],
            [
                1528,
                2202
            ],
            [
                2202,
                2378
            ],
            [
                2378,
                2579
            ],
            [
                2579,
                3070
            ],
            [
                3070,
                3628
            ],
            [
                3628,
                3846
            ],
            [
                3846,
                4128
            ],
            [
                4128,
                4639
            ],
            [
                4639,
                4973
            ]
        ],
        "segment_chars": [
            [
                0,
                58
            ],
            [
                58,
                138
            ],
            [
                138,
                184
            ],
            [
                184,
                244
            ],
            [
                244,
                323
            ],
            [
                323,
                391
            ],
            [
                391,
                415
            ],
            [
                415,
                424
            ],
            [
                424,
                496
            ],
            [
                496,
                533
            ],
            [
                533,
                587
            ],
            [
                587,
                594
            ],
            [
                594,
                626
            ],
            [
                626,
                637
            ],
            [
                637,
                674
            ],
            [
                674,
                804
            ],
            [
                804,
                857
            ],
            [
                857,
                957
            ],
            [
                957,
                1214
            ],
            [
                1214,
                1342
            ],
            [
                1342,
                1421
            ],
            [
                1421,
                1528
            ],
            [
                1528,
                1599
            ],
            [
                1599,
                1642
            ],
            [
                1642,
                1828
            ],
            [
                1828,
                1853
            ],
            [
                1853,
                1941
            ],
            [
                1941,
                2033
            ],
            [
                2033,
                2126
            ],
            [
                2126,
                2135
            ],
            [
                2135,
                2202
            ],
            [
                2202,
                2327
            ],
            [
                2327,
                2378
            ],
            [
                2378,
                2493
            ],
            [
                2493,
                2579
            ],
            [
                2579,
                2763
            ],
            [
                2763,
                3012
            ],
            [
                3012,
                3070
            ],
            [
                3070,
                3148
            ],
            [
                3148,
                3247
            ],
            [
                3247,
                3259
            ],
            [
                3259,
                3353
            ],
            [
                3353,
                3516
            ],
            [
                3516,
                3628
            ],
            [
                3628,
                3734
            ],
            [
                3734,
                3846
            ],
            [
                3846,
                3861
            ],
            [
                3861,
                4128
            ],
            [
                4128,
                4263
            ],
            [
                4263,
                4297
            ],
            [
                4297,
                4514
            ],
            [
                4514,
                4639
            ],
            [
                4639,
                4751
            ],
            [
                4751,
                4973
            ]
        ],
        "overlap_chars": [
            [
                7,
                39
            ],
            [
                42,
                56
            ],
            [
                56,
                58
            ],
            [
                58,
                59
            ],
            [
                59,
                75
            ],
            [
                85,
                117
            ],
            [
                118,
                138
            ],
            [
                138,
                184
            ],
            [
                184,
                185
            ],
            [
                186,
                244
            ],
            [
                244,
                323
            ],
            [
                323,
                388
            ],
            [
                396,
                412
            ],
            [
                415,
                424
            ],
            [
                425,
                453
            ],
            [
                454,
                455
            ],
            [
                456,
                496
            ],
            [
                496,
                506
            ],
            [
                506,
                511
            ],
            [
                512,
                533
            ],
            [
                533,
                587
            ],
            [
                587,
                594
            ],
            [
                598,
                607
            ],
            [
                613,
                623
            ],
            [
                637,
                652
            ],
            [
                653,
                662
            ],
            [
                680,
                699
            ],
            [
                699,
                700
            ],
            [
                706,
                760
            ],
            [
                770,
                778
            ],
            [
                779,
                783
            ],
            [
                784,
                789
            ],
            [
                790,
                803
            ],
            [
                804,
                817
            ],
            [
                817,
                855
            ],
            [
                855,
                857
            ],
            [
                857,
                875
            ],
            [
                875,
                912
            ],
            [
                934,
                945
            ],
            [
                949,
                957
            ],
            [
                958,
                1176
            ],
            [
                1177,
                1192
            ],
            [
                1193,
                1214
            ],
            [
                1214,
                1284
            ],
            [
                1284,
                1288
            ],
            [
                1297,
                1307
            ],
            [
                1314,
                1316
            ],
            [
                1319,
                1325
            ],
            [
                1342,
                1412
            ],
            [
                1419,
                1421
            ],
            [
                1421,
                1514
            ],
            [
                1515,
                1528
            ],
            [
                1529,
                1546
            ],
            [
                1549,
                1551
            ],
            [
                1560,
                1561
            ],
            [
                1563,
                1597
            ],
            [
                1597,
                1599
            ],
            [
                1599,
                1640
            ],
            [
                1640,
                1642
            ],
            [
                1642,
                1730
            ],
            [
                1731,
                1776
            ],
            [
                1777,
                1828
            ],
            [
                1828,
                1853
            ],
            [
                1876,
                1882
            ],
            [
                1886,
                1902
            ],
            [
                1902,
                1941
            ],
            [
                1941,
                1944
            ],
            [
                1948,
                1954
            ],
            [
                1958,
                2033
            ],
            [
                2033,
                2055
            ],
            [
                2055,
                2063
            ],
            [
                2069,
                2094
            ],
            [
                2101,
                2126
            ],
            [
                2126,
                2135
            ],
            [
                2135,
                2199
            ],
            [
                2210,
                2220
            ],
            [
                2220,
                2225
            ],
            [
                2228,
                2239
            ],
            [
                2241,
                2278
            ],
            [
                2283,
                2291
            ],
            [
                2292,
                2313
            ],
            [
                2314,
                2327
            ],
            [
                2327,
                2356
            ],
            [
                2358,
                2361
            ],
            [
                2371,
                2375
            ],
            [
                2378,
                2420
            ],
            [
                2421,
                2493
            ],
            [
                2493,
                2496
            ],
            [
                2508,
                2511
            ],
            [
                2512,
                2522
            ],
            [
                2524,
                2577
            ],
            [
                2577,
                2578
            ],
            [
                2579,
                2607
            ],
            [
                2608,
                2748
            ],
            [
                2753,
                2756
            ],
            [
                2757,
                2763
            ],
            [
                2763,
                2773
            ],
            [
                2789,
                2851
            ],
            [
                2857,
                2955
            ],
            [
                2956,
                2958
            ],
            [
                2963,
                3002
            ],
            [
                3003,
                3011
            ],
            [
                3012,
                3069
            ],
            [
                3071,
                3083
            ],
            [
                3086,
                3094
            ],
            [
                3096,
                3146
            ],
            [
                3146,
                3148
            ],
            [
                3148,
                3150
            ],
            [
                3161,
                3247
            ],
            [
                3247,
                3259
            ],
            [
                3259,
                3278
            ],
            [
                3287,
                3292
            ],
            [
                3302,
                3322
            ],
            [
                3323,
                3353
            ],
            [
                3353,
                3390
            ],
            [
                3396,
                3462
            ],
            [
                3468,
                3514
            ],
            [
                3514,
                3516
            ],
            [
                3516,
                3525
            ],
            [
                3526,
                3548
            ],
            [
                3552,
                3564
            ],
            [
                3565,
                3593
            ],
            [
                3593,
                3625
            ],
            [
                3628,
                3672
            ],
            [
                3673,
                3734
            ],
            [
                3734,
                3792
            ],
            [
                3798,
                3801
            ],
            [
                3802,
                3808
            ],
            [
                3808,
                3813
            ],
            [
                3814,
                3844
            ],
            [
                3844,
                3845
            ],
            [
                3846,
                3852
            ],
            [
                3864,
                3866
            ],
            [
                3867,
                3870
            ],
            [
                3871,
                3889
            ],
            [
                3890,
                3892
            ],
            [
                3893,
                3939
            ],
            [
                3948,
                3963
            ],
            [
                3963,
                4007
            ],
            [
                4007,
                4008
            ],
            [
                4009,
                4012
            ],
            [
                4013,
                4024
            ],
            [
                4032,
                4042
            ],
            [
                4042,
                4046
            ],
            [
                4047,
                4049
            ],
            [
                4067,
                4093
            ],
            [
                4094,
                4097
            ],
            [
                4098,
                4110
            ],
            [
                4111,
                4115
            ],
            [
                4122,
                4126
            ],
            [
                4126,
                4128
            ],
            [
                4128,
                4137
            ],
            [
                4138,
                4147
            ],
            [
                4155,
                4157
            ],
            [
                4158,
                4196
            ],
            [
                4197,
                4232
            ],
            [
                4233,
                4245
            ],
            [
                4251,
                4261
            ],
            [
                4266,
                4269
            ],
            [
                4270,
                4285
            ],
            [
                4286,
                4288
            ],
            [
                4295,
                4297
            ],
            [
                4297,
                4320
            ],
            [
                4327,
                4394
            ],
            [
                4395,
                4401
            ],
            [
                4402,
                4404
            ],
            [
                4422,
                4423
            ],
            [
                4424,
                4455
            ],
            [
                4456,
                4494
            ],
            [
                4504,
                4512
            ],
            [
                4512,
                4513
            ],
            [
                4514,
                4533
            ],
            [
                4541,
                4637
            ],
            [
                4639,
                4663
            ],
            [
                4670,
                4674
            ],
            [
                4682,
                4689
            ],
            [
                4690,
                4749
            ],
            [
                4749,
                4751
            ],
            [
                4751,
                4886
            ],
            [
                4919,
                4922
            ],
            [
                4930,
                4973
            ]
        ],
        "row_chars": [
            [
                0,
                58
            ],
            [
                58,
                138
            ],
            [
                138,
                184
            ],
            [
                184,
                244
            ],
            [
                244,
                323
            ],
            [
                323,
                391
            ],
            [
                391,
                391
            ],
            [
                391,
                415
            ],
            [
                415,
                424
            ],
            [
                424,
                496
            ],
            [
                496,
                533
            ],
            [
                533,
                587
            ],
            [
                587,
                594
            ],
            [
                594,
                626
            ],
            [
                626,
                674
            ],
            [
                674,
                804
            ],
            [
                804,
                857
            ],
            [
                857,
                957
            ],
            [
                957,
                1214
            ],
            [
                1214,
                1342
            ],
            [
                1342,
                1421
            ],
            [
                1421,
                1528
            ],
            [
                1528,
                1599
            ],
            [
                1599,
                1599
            ],
            [
                1599,
                1642
            ],
            [
                1642,
                1828
            ],
            [
                1828,
                1853
            ],
            [
                1853,
                1853
            ],
            [
                1853,
                1941
            ],
            [
                1941,
                1941
            ],
            [
                1941,
                2033
            ],
            [
                2033,
                2126
            ],
            [
                2126,
                2135
            ],
            [
                2135,
                2202
            ],
            [
                2202,
                2327
            ],
            [
                2327,
                2378
            ],
            [
                2378,
                2493
            ],
            [
                2493,
                2579
            ],
            [
                2579,
                2763
            ],
            [
                2763,
                3012
            ],
            [
                3012,
                3070
            ],
            [
                3070,
                3070
            ],
            [
                3070,
                3148
            ],
            [
                3148,
                3247
            ],
            [
                3247,
                3247
            ],
            [
                3247,
                3259
            ],
            [
                3259,
                3353
            ],
            [
                3353,
                3516
            ],
            [
                3516,
                3628
            ],
            [
                3628,
                3734
            ],
            [
                3734,
                3846
            ],
            [
                3846,
                4128
            ],
            [
                4128,
                4297
            ],
            [
                4297,
                4639
            ],
            [
                4639,
                4751
            ],
            [
                4751,
                4973
            ]
        ]
    }
}