{
    "original": {
        "text": "Summer was already past its prime, when Edgar reluctantly yielded his assent to their entreaties, and Catherine and I set out on our first ride to join her cousin. It was a close, sultry day: devoid of sunshine, but with a sky too dappled and hazy to threaten rain: and our place of meeting had been fixed at the guide-stone, by the cross-roads. On arriving there, however, a little herd-boy, despatched as a messenger, told us that,-\"Maister Linton wer just o' this side th' Heights: and he'd be mitch obleeged to us to gang on a bit further.\"\n\"Then Master Linton has forgot the first injunction of his uncle,\" I observed: \"he bid us keep on the Grange land, and here we are off at once.\"\n\"Well, we'll turn our horses' heads round when we reach him,\" answered my companion; \"our excursion shall lie towards home.\"\nBut when we reached him, and that was scarcely a quarter of a mile from his own door, we found he had no horse; and we were forced to dismount, and leave ours to graze. He lay on the heath, awaiting our approach, and did not rise till we came within a few yards. Then he walked so feebly, and looked so pale, that I immediately exclaimed,-\"Why, Master Heathcliff, you are not fit for enjoying a ramble this morning. How ill you do look!\"\nCatherine surveyed him with grief and astonishment: she changed the ejaculation of joy on her lips to one of alarm; and the congratulation on their long-postponed meeting to an anxious inquiry, whether he were worse than usual?\n\"No-better-better!\" he panted, trembling, and retaining her hand as if he needed its support, while his large blue eyes wandered timidly over her; the hollowness round them transforming to haggard wildness the languid expression they once possessed.\n\"But you have been worse,\" persisted his cousin; \"worse than when I saw you last; you are thinner, and-\"\n\"I'm tired,\" he interrupted, hurriedly. \"It is too hot for walking, let us rest here. And, in the morning, I often feel sick-papa says I grow so fast.\"\nBadly satisfied, Cathy sat down, and he reclined beside her.\n\"This is something like your paradise,\" said she, making an effort at cheerfulness. \"You recollect the two days we agreed to spend in the place and way each thought pleasantest? This is nearly yours, only there are clouds; but then they are so soft and mellow: it is nicer than sunshine. Next week, if you can, we'll ride down to the Grange Park, and try mine.\"\nLinton did not appear to remember what she talked of and he had evidently great difficulty in sustaining any kind of conversation. His lack of interest in the subjects she started, and his equal incapacity to contribute to her entertainment, were so obvious that she could not conceal her disappointment. An indefinite alteration had come over his whole person and manner. The pettishness that might be caressed into fondness, had yielded to a listless apathy; there was less of the peevish temper of a child which frets and teases on purpose to be soothed, and more of the self-absorbed moroseness of a confirmed invalid, repelling consolation, and ready to regard the good-humoured mirth of others as an insult. Catherine perceived, as well as I did, that he held it rather a punishment, than a gratification, to endure our company; and she made no scruple of proposing, presently, to depart. That proposal, unexpectedly, roused Linton from his lethargy, and threw him into a strange state of agitation. He glanced fearfully towards the Heights, begging she would remain another half-hour, at least.\n\"But I think,\" said Cathy, \"you'd be more comfortable at home than sitting here; and I cannot amuse you to-day, I see, by my tales, and songs, and chatter: you have grown wiser than I, in these six months; you have little taste for my diversions now: or else, if I could amuse you, I'd willingly stay.\"\n\"Stay to rest yourself,\" he replied. \"And, Catherine, don't think or say that I'm _very_ unwell: it is the heavy weather and heat that make me dull; and I walked about, before you came, a great deal for me. Tell uncle I'm in tolerable health, will you?\"\n\"I'll tell him that _you_ say so, Linton. I couldn't affirm that you are,\" observed my young lady, wondering at his pertinacious assertion of what was evidently an untruth.\n\"And be here again next Thursday,\" continued he, shunning her puzzled gaze. \"And give him my thanks for permitting you to come-my best thanks, Catherine. And-and, if you _did_ meet my father, and he asked you about me, don't lead him to suppose that I've been extremely silent and stupid: don't look sad and downcast, as you are doing-he'll be angry.\"\n\"I care nothing for his anger,\" exclaimed Cathy, imagining she would be its object.\n\"But I do,\" said her cousin, shuddering. \"_Don't_ provoke him against me, Catherine, for he is very hard.\"\n\"Is he severe to you, Master Heathcliff?\" I inquired. \"Has he grown weary of indulgence, and passed from passive to active hatred?\"\nLinton looked at me, but did not answer; and, after keeping her seat by his side another ten minutes, during which his head fell drowsily on his breast, and he uttered nothing except suppressed moans of exhaustion or pain, Cathy began to seek solace in looking for bilberries, and sharing the produce of her researches with me: she did not offer them to him, for she saw further notice would only weary and annoy.\n\"Is it half-an-hour now, Ellen?\" she whispered in my ear, at last. \"I can't tell why we should stay. He's asleep, and papa will be wanting us back.\"\n\"Well, we must not leave him asleep,\" I answered; \"wait till he wakes, and be patient. You were mighty eager to set off, but your longing to see poor Linton has soon evaporated!\"\n\"Why did _he_ wish to see me?\" returned Catherine. \"In his crossest humours, formerly, I liked him better than I do in his present curious mood. It's just as if it were a task he was compelled to perform-this interview-for fear his father should scold him. But I'm hardly going to come to give Mr. Heathcliff pleasure; whatever reason he may have for ordering Linton to undergo this penance. And, though I'm glad he's better in health, I'm sorry he's so much less pleasant, and so much less affectionate to me.\"\n\"You think _he is_ better in health, then?\" I said.\n\"Yes,\" she answered; \"because he always made such a great deal of his sufferings, you know. He is not tolerably well, as he told me to tell papa; but he's better, very likely.\"\n\"There you differ with me, Miss Cathy,\" I remarked; \"I should conjecture him to be far worse.\"\nLinton here started from his slumber in bewildered terror, and asked if any one had called his name.\n\"No,\" said Catherine; \"unless in dreams. I cannot conceive how you manage to doze out of doors, in the morning.\"\n\"I thought I heard my father,\" he gasped, glancing up to the frowning nab above us. \"You are sure nobody spoke?\"\n\"Quite sure,\" replied his cousin. \"Only Ellen and I were disputing concerning your health. Are you truly stronger, Linton, than when we separated in winter? If you be, I'm certain one thing is not stronger-your regard for me: speak,-are you?\"\nThe tears gushed from Linton's eyes as he answered, \"Yes, yes, I am!\" And, still under the spell of the imaginary voice, his gaze wandered up and down to detect its owner.\nCathy rose. \"For to-day we must part,\" she said. \"And I won't conceal that I have been sadly disappointed with our meeting; though I'll mention it to nobody but you: not that I stand in awe of Mr. Heathcliff.\"\n\"Hush,\" murmured Linton; \"for God's sake, hush! He's coming.\" And he clung to Catherine's arm, striving to detain her; but at that announcement she hastily disengaged herself, and whistled to Minny, who obeyed her like a dog.\n\"I'll be here next Thursday,\" she cried, springing to the saddle. \"Good-bye. Quick, Ellen!\"\nAnd so we left him, scarcely conscious of our departure, so absorbed was he in anticipating his father's approach.\nBefore we reached home, Catherine's displeasure softened into a perplexed sensation of pity and regret, largely blended with vague, uneasy doubts about Linton's actual circumstances, physical and social: in which I partook, though I counselled her not to say much; for a second journey would make us better judges. My master requested an account of our ongoings. His nephew's offering of thanks was duly delivered, Miss Cathy gently touching on the rest: I also threw little light on his inquiries, for I hardly knew what to hide and what to reveal.",
        "paragraph_chars": [
            [
                0,
                545
            ],
            [
                545,
                690
            ],
            [
                690,
                815
            ],
            [
                815,
                1253
            ],
            [
                1253,
                1481
            ],
            [
                1481,
                1731
            ],
            [
                1731,
                1836
            ],
            [
                1836,
                1988
            ],
            [
                1988,
                2049
            ],
            [
                2049,
                2411
            ],
            [
                2411,
                3513
            ],
            [
                3513,
                3816
            ],
            [
                3816,
                4070
            ],
            [
                4070,
                4243
            ],
            [
                4243,
                4595
            ],
            [
                4595,
                4679
            ],
            [
                4679,
                4786
            ],
            [
                4786,
                4918
            ],
            [
                4918,
                5332
            ],
            [
                5332,
                5481
            ],
            [
                5481,
                5660
            ],
            [
                5660,
                6172
            ],
            [
                6172,
                6224
            ],
            [
                6224,
                6401
            ],
            [
                6401,
                6496
            ],
            [
                6496,
                6597
            ],
            [
                6597,
                6710
            ],
            [
                6710,
                6823
            ],
            [
                6823,
                7066
            ],
            [
                7066,
                7238
            ],
            [
                7238,
                7448
            ],
            [
                7448,
                7674
            ],
            [
                7674,
                7766
            ],
            [
                7766,
                7881
            ],
            [
                7881,
                8430
            ]
        ],
        "segment_chars": [
            [
                0,
                164
            ],
            [
                164,
                346
            ],
            [
                346,
                545
            ],
            [
                545,
                690
            ],
            [
                690,
                815
            ],
            [
                815,
                984
            ],
            [
                984,
                1078
            ],
            [
                1078,
                1231
            ],
            [
                1231,
                1253
            ],
            [
                1253,
                1481
            ],
            [
                1481,
                1501
            ],
            [
                1501,
                1731
            ],
            [
                1731,
                1836
            ],
            [
                1836,
                1876
            ],
            [
                1876,
                1922
            ],
            [
                1922,
                1988
            ],
            [
                1988,
                2049
            ],
            [
                2049,
                2133
            ],
            [
                2133,
                2227
            ],
            [
                2227,
                2337
            ],
            [
                2337,
                2411
            ],
            [
                2411,
                2542
            ],
            [
                2542,
                2716
            ],
            [
                2716,
                2784
            ],
            [
                2784,
                3125
            ],
            [
                3125,
                3306
            ],
            [
                3306,
                3417
            ],
            [
                3417,
                3513
            ],
            [
                3513,
                3816
            ],
            [
                3816,
                3853
            ],
            [
                3853,
                4023
            ],
            [
                4023,
                4070
            ],
            [
                4070,
                4112
            ],
            [
                4112,
                4243
            ],
            [
                4243,
                4319
            ],
            [
                4319,
                4397
            ],
            [
                4397,
                4595
            ],
            [
                4595,
                4679
            ],
            [
                4679,
                4720
            ],
            [
                4720,
                4786
            ],
            [
                4786,
                4828
            ],
            [
                4828,
                4840
            ],
            [
                4840,
                4918
            ],
            [
                4918,
                5332
            ],
            [
                5332,
                5365
            ],
            [
                5365,
                5399
            ],
            [
                5399,
                5433
            ],
            [
                5433,
                5481
            ],
            [
                5481,
                5568
            ],
            [
                5568,
                5660
            ],
            [
                5660,
                5691
            ],
            [
                5691,
                5711
            ],
            [
                5711,
                5805
            ],
            [
                5805,
                5917
            ],
            [
                5917,
                6052
            ],
            [
                6052,
                6172
            ],
            [
                6172,
                6216
            ],
            [
                6216,
                6224
            ],
            [
                6224,
                6316
            ],
            [
                6316,
                6401
            ],
            [
                6401,
                6496
            ],
            [
                6496,
                6597
            ],
            [
                6597,
                6638
            ],
            [
                6638,
                6710
            ],
            [
                6710,
                6794
            ],
            [
                6794,
                6823
            ],
            [
                6823,
                6857
            ],
            [
                6857,
                6914
            ],
            [
                6914,
                6980
            ],
            [
                6980,
                7066
            ],
            [
                7066,
                7136
            ],
            [
                7136,
                7238
            ],
            [
                7238,
                7250
            ],
            [
                7250,
                7287
            ],
            [
                7287,
                7448
            ],
            [
                7448,
                7496
            ],
            [
                7496,
                7510
            ],
            [
                7510,
                7674
            ],
            [
                7674,
                7740
            ],
            [
                7740,
                7751
            ],
            [
                7751,
                7766
            ],
            [
                7766,
                7881
            ],
            [
                7881,
                8196
            ],
            [
                8196,
                8244
            ],
            [
                8244,
                8430
            ]
        ],
        "overlap_chars": [
            [
                0,
                45
            ],
            [
                58,
                65
            ],
            [
                96,
                164
            ],
            [
                164,
                172
            ],
            [
                187,
                190
            ],
            [
                192,
                215
            ],
            [
                227,
                230
            ],
            [
                243,
                264
            ],
            [
                270,
                305
            ],
            [
                326,
                346
            ],
            [
                346,
                392
            ],
            [
                404,
                427
            ],
            [
                460,
                461
            ],
            [
                443,
                449
            ],
            [
                454,
                458
            ],
            [
                462,
                471
            ],
            [
                472,
                488
            ],
            [
                526,
                542
            ],
            [
                819,
                839
            ],
            [
                910,
                912
            ],
            [
                849,
                899
            ],
            [
                982,
                984
            ],
            [
                984,
                1003
            ],
            [
                1026,
                1076
            ],
            [
                1076,
                1078
            ],
            [
                1078,
                1152
            ],
            [
                1155,
                1178
            ],
            [
                1231,
                1250
            ],
            [
                1253,
                1303
            ],
            [
                1367,
                1368
            ],
            [
                1305,
                1308
            ],
            [
                1447,
                1481
            ],
            [
                1482,
                1498
            ],
            [
                1501,
                1526
            ],
            [
                1537,
                1609
            ],
            [
                1618,
                1626
            ],
            [
                1699,
                1709
            ],
            [
                1670,
                1686
            ],
            [
                1729,
                1731
            ],
            [
                1732,
                1755
            ],
            [
                1797,
                1811
            ],
            [
                1758,
                1767
            ],
            [
                1778,
                1779
            ],
            [
                1813,
                1833
            ],
            [
                1837,
                1846
            ],
            [
                1849,
                1876
            ],
            [
                1877,
                1902
            ],
            [
                1904,
                1922
            ],
            [
                1927,
                1961
            ],
            [
                1966,
                1985
            ],
            [
                2003,
                2019
            ],
            [
                2037,
                2043
            ],
            [
                2047,
                2049
            ],
            [
                2055,
                2086
            ],
            [
                2089,
                2131
            ],
            [
                2249,
                2275
            ],
            [
                2281,
                2308
            ],
            [
                2247,
                2248
            ],
            [
                2310,
                2337
            ],
            [
                2337,
                2403
            ],
            [
                2411,
                2463
            ],
            [
                2468,
                2474
            ],
            [
                2485,
                2504
            ],
            [
                2516,
                2542
            ],
            [
                2542,
                2562
            ],
            [
                2658,
                2673
            ],
            [
                2678,
                2716
            ],
            [
                2788,
                2799
            ],
            [
                2838,
                2871
            ],
            [
                2981,
                3032
            ],
            [
                3123,
                3124
            ],
            [
                3125,
                3134
            ],
            [
                3164,
                3171
            ],
            [
                3144,
                3145
            ],
            [
                3180,
                3186
            ],
            [
                3201,
                3205
            ],
            [
                3162,
                3163
            ],
            [
                3233,
                3253
            ],
            [
                3295,
                3306
            ],
            [
                3306,
                3319
            ],
            [
                3321,
                3333
            ],
            [
                3335,
                3417
            ],
            [
                3417,
                3513
            ],
            [
                3514,
                3525
            ],
            [
                3528,
                3539
            ],
            [
                3541,
                3592
            ],
            [
                3773,
                3813
            ],
            [
                3822,
                3829
            ],
            [
                3841,
                3853
            ],
            [
                3913,
                3922
            ],
            [
                3941,
                3983
            ],
            [
                4002,
                4014
            ],
            [
                3985,
                4000
            ],
            [
                4021,
                4023
            ],
            [
                4023,
                4040
            ],
            [
                4051,
                4067
            ],
            [
                4071,
                4089
            ],
            [
                4091,
                4094
            ],
            [
                4096,
                4112
            ],
            [
                4112,
                4142
            ],
            [
                4145,
                4167
            ],
            [
                4241,
                4243
            ],
            [
                4244,
                4275
            ],
            [
                4278,
                4290
            ],
            [
                4317,
                4319
            ],
            [
                4320,
                4323
            ],
            [
                4329,
                4332
            ],
            [
                4343,
                4369
            ],
            [
                4395,
                4397
            ],
            [
                4397,
                4412
            ],
            [
                4414,
                4417
            ],
            [
                4419,
                4467
            ],
            [
                4473,
                4476
            ],
            [
                4493,
                4502
            ],
            [
                4513,
                4530
            ],
            [
                4577,
                4592
            ],
            [
                4596,
                4624
            ],
            [
                4627,
                4642
            ],
            [
                4677,
                4679
            ],
            [
                4680,
                4688
            ],
            [
                4691,
                4720
            ],
            [
                4725,
                4727
            ],
            [
                4729,
                4783
            ],
            [
                4787,
                4825
            ],
            [
                4828,
                4839
            ],
            [
                4918,
                4957
            ],
            [
                4964,
                4969
            ],
            [
                4987,
                5019
            ],
            [
                5033,
                5117
            ],
            [
                5139,
                5155
            ],
            [
                5179,
                5198
            ],
            [
                5237,
                5275
            ],
            [
                5330,
                5332
            ],
            [
                5333,
                5362
            ],
            [
                5365,
                5378
            ],
            [
                5397,
                5399
            ],
            [
                5433,
                5478
            ],
            [
                5532,
                5550
            ],
            [
                5519,
                5529
            ],
            [
                5566,
                5568
            ],
            [
                5568,
                5592
            ],
            [
                5600,
                5657
            ],
            [
                5661,
                5668
            ],
            [
                5670,
                5672
            ],
            [
                5674,
                5688
            ],
            [
                5691,
                5711
            ],
            [
                5712,
                5714
            ],
            [
                5799,
                5805
            ],
            [
                5805,
                5809
            ],
            [
                5815,
                5820
            ],
            [
                5864,
                5868
            ],
            [
                5824,
                5863
            ],
            [
                5879,
                5917
            ],
            [
                6057,
                6137
            ],
            [
                6146,
                6169
            ],
            [
                6173,
                6182
            ],
            [
                6184,
                6189
            ],
            [
                6191,
                6213
            ],
            [
                6216,
                6224
            ],
            [
                6225,
                6228
            ],
            [
                6231,
                6244
            ],
            [
                6246,
                6304
            ],
            [
                6314,
                6316
            ],
            [
                6316,
                6325
            ],
            [
                6336,
                6341
            ],
            [
                6370,
                6398
            ],
            [
                6408,
                6438
            ],
            [
                6441,
                6452
            ],
            [
                6454,
                6462
            ],
            [
                6484,
                6493
            ],
            [
                6496,
                6502
            ],
            [
                6508,
                6567
            ],
            [
                6576,
                6597
            ],
            [
                6711,
                6738
            ],
            [
                6741,
                6760
            ],
            [
                6792,
                6794
            ],
            [
                6795,
                6820
            ],
            [
                6824,
                6834
            ],
            [
                6837,
                6857
            ],
            [
                6914,
                6950
            ],
            [
                6972,
                6978
            ],
            [
                7066,
                7117
            ],
            [
                7119,
                7133
            ],
            [
                7141,
                7238
            ],
            [
                7238,
                7250
            ],
            [
                7251,
                7254
            ],
            [
                7262,
                7274
            ],
            [
                7277,
                7287
            ],
            [
                7288,
                7394
            ],
            [
                7402,
                7445
            ],
            [
                7449,
                7453
            ],
            [
                7456,
                7472
            ],
            [
                7474,
                7496
            ],
            [
                7496,
                7507
            ],
            [
                7510,
                7541
            ],
            [
                7565,
                7570
            ],
            [
                7592,
                7603
            ],
            [
                7615,
                7639
            ],
            [
                7562,
                7565
            ],
            [
                7672,
                7674
            ],
            [
                7675,
                7701
            ],
            [
                7704,
                7740
            ],
            [
                7741,
                7751
            ],
            [
                7751,
                7763
            ],
            [
                7766,
                7784
            ],
            [
                7879,
                7881
            ],
            [
                7881,
                7954
            ],
            [
                7968,
                7972
            ],
            [
                7983,
                7984
            ],
            [
                7993,
                8039
            ],
            [
                8194,
                8195
            ],
            [
                8094,
                8095
            ],
            [
                8103,
                8149
            ],
            [
                8181,
                8187
            ],
            [
                8150,
                8166
            ],
            [
                8196,
                8233
            ],
            [
                8242,
                8244
            ],
            [
                8244,
                8256
            ],
            [
                8269,
                8275
            ],
            [
                8280,
                8295
            ],
            [
                8349,
                8355
            ],
            [
                8380,
                8430
            ]
        ],
        "row_chars": [
            [
                0,
                164
            ],
            [
                164,
                346
            ],
            [
                346,
                545
            ],
            [
                545,
                690
            ],
            [
                690,
                815
            ],
            [
                815,
                984
            ],
            [
                984,
                1078
            ],
            [
                1078,
                1253
            ],
            [
                1253,
                1481
            ],
            [
                1481,
                1501
            ],
            [
                1501,
                1731
            ],
            [
                1731,
                1836
            ],
            [
                1836,
                1876
            ],
            [
                1876,
                1922
            ],
            [
                1922,
                1988
            ],
            [
                1988,
                2049
            ],
            [
                2049,
                2337
            ],
            [
                2337,
                2411
            ],
            [
                2411,
                2542
            ],
            [
                2542,
                2716
            ],
            [
                2716,
                2784
            ],
            [
                2784,
                3125
            ],
            [
                3125,
                3306
            ],
            [
                3306,
                3417
            ],
            [
                3417,
                3513
            ],
            [
                3513,
                3816
            ],
            [
                3816,
                3853
            ],
            [
                3853,
                4023
            ],
            [
                4023,
                4070
            ],
            [
                4070,
                4112
            ],
            [
                4112,
                4243
            ],
            [
                4243,
                4319
            ],
            [
                4319,
                4397
            ],
            [
                4397,
                4595
            ],
            [
                4595,
                4679
            ],
            [
                4679,
                4720
            ],
            [
                4720,
                4786
            ],
            [
                4786,
                4828
            ],
            [
                4828,
                4840
            ],
            [
                4840,
                4918
            ],
            [
                4918,
                5332
            ],
            [
                5332,
                5365
            ],
            [
                5365,
                5399
            ],
            [
                5399,
                5433
            ],
            [
                5433,
                5481
            ],
            [
                5481,
                5568
            ],
            [
                5568,
                5660
            ],
            [
                5660,
                5691
            ],
            [
                5691,
                5711
            ],
            [
                5711,
                5805
            ],
            [
                5805,
                5917
            ],
            [
                5917,
                6052
            ],
            [
                6052,
                6172
            ],
            [
                6172,
                6216
            ],
            [
                6216,
                6224
            ],
            [
                6224,
                6316
            ],
            [
                6316,
                6401
            ],
            [
                6401,
                6496
            ],
            [
                6496,
                6597
            ],
            [
                6597,
                6638
            ],
            [
                6638,
                6710
            ],
            [
                6710,
                6794
            ],
            [
                6794,
                6823
            ],
            [
                6823,
                6857
            ],
            [
                6857,
                6914
            ],
            [
                6914,
                6980
            ],
            [
                6980,
                7066
            ],
            [
                7066,
                7136
            ],
            [
                7136,
                7238
            ],
            [
                7238,
                7250
            ],
            [
                7250,
                7287
            ],
            [
                7287,
                7448
            ],
            [
                7448,
                7496
            ],
            [
                7496,
                7510
            ],
            [
                7510,
                7674
            ],
            [
                7674,
                7740
            ],
            [
                7740,
                7751
            ],
            [
                7751,
                7766
            ],
            [
                7766,
                7881
            ],
            [
                7881,
                8196
            ],
            [
                8196,
                8244
            ],
            [
                8244,
                8430
            ]
        ]
    },
    "abridged": {
        "text": "Summer was already past its prime, when Edgar yielded, and Catherine and I set out on our first ride to join her cousin. It was a day devoid of sunshine, but too hazy to threaten rain. Our place of meeting had been fixed by the cross-roads. On arriving there, however, a little herd-boy, sent as a messenger, told us: 'Master Linton were just this side of th' Heights: and we must go on a bit further.'\nWhen we reached him, he was scarcely a quarter of a mile from his own door. He lay on the heath, and did not rise till we came within a few yards of him. Then he walked so feebly, and looked so pale, that I immediately exclaimed, 'Why, Master Heathcliff, how ill you do look!'\nCatherine surveyed him with grief and astonishment; anxiously she inquired whether he were worse than usual?\n'No - better - better!' he panted, trembling, and holding her hand as if he needed its support, while his large blue eyes wandered over her with a expression of haggard wildness.\n'But you have been worse since I saw you last,' persisted Cathy; 'you are thinner, and-'\n'I'm tired,' he interrupted, hurriedly. 'It is too hot for walking; let us rest here. In the morning, I often feel sick - papa says I grow so fast.'\nDissatisfied, Cathy sat down beside him.\n'This is something like your paradise,' said she, making an effort at cheerfulness; 'only there are clouds; but they are so soft and mellow, it is nicer than sunshine. Next week, if you can, we'll ride down to the Grange Park, and try my paradise.'\nLinton did not appear to remember what she talked of. He had great difficulty in holding any kind of conversation. His lack of interest was so obvious that Cathy could not conceal her disappointment. His pettishness had yielded to a listless apathy; the self-absorbed moroseness of a confirmed invalid.\nCatherine saw that he endured, rather than enjoyed, our company; and she soon proposed to depart. That proposal unexpectedly roused Linton from his lethargy, and threw him into a strange state of agitation. He glanced fearfully towards the Heights, begging she would remain another half-hour, at least.\n'But I think,' said Cathy, 'you'd be more comfortable at home than sitting here. If I could amuse you, I'd willingly stay.'\n'Stay to rest,' he replied. 'It is the heat that make me dull; and I walked about a great deal before you came. Tell uncle I'm in good health, will you?'\n'I'll tell him that you say so, Linton. I couldn't affirm that you are,' observed my young lady.\n'And be here again next Thursday,' continued he. 'And thank him for permitting you to come. And - and, if you did meet my father, and he asked you about me, don't tell him I've been silent and stupid - he'll be angry.'\n'I care nothing for his anger,' exclaimed Cathy.\n'But I do,' said her cousin, shuddering. 'Don't provoke him against me, Catherine, for he is very hard.'\n'Is he severe to you, Master Heathcliff?' I inquired.\nLinton looked at me, but did not answer. After sitting by his side another ten minutes, while his head fell drowsily on his breast, and he uttered nothing except suppressed moans, Cathy began to look for bilberries, and share them with me: she did not offer them to him.\n'Is it half-an-hour now, Ellen?' she whispered. 'He's asleep, and papa will be wanting us back.'\n'Wait till he wakes,' I answered. 'You were mighty eager to come, but your longing to see poor Linton has soon evaporated!'\n'Why did he wish to see me?' returned Catherine. 'He's in such a strange mood. It's as if this meeting were a task he was compelled to perform for fear his father should scold him. Though I'm glad he's better in health, I'm sorry he's so much less pleasant, and less affectionate to me.'\n'You think he is better in health, then?' I said.\n'Yes,' she answered; 'because he always made such a great deal of his sufferings. He is not completely well, but he's better, very likely.'\n'There you differ with me, Miss Cathy,' I remarked; 'I should say he is far worse.'\nLinton started from his slumber in bewildered terror, and asked if anyone had called his name.\n'I thought I heard my father,' he gasped, glancing around. 'You are sure nobody spoke?'\n'Quite sure,' replied his cousin. 'Are you truly stronger, Linton, than last winter?'\nThe tears gushed from Linton's eyes as he answered, 'Yes, yes, I am!' Still under the spell of the imaginary voice, his gaze wandered up and down to detect its owner.\nCathy rose. 'For today we must part,' she said. 'And I won't conceal that I have been sadly disappointed with our meeting; though I'll mention it to nobody: not that I stand in awe of Mr. Heathcliff.'\n'Hush,' murmured Linton; 'for God's sake, hush! He's coming.' And he clung to Catherine's arm; but she hastily freed herself, and whistled to her pony.\n'I'll be here next Thursday,' she cried, springing to the saddle. 'Good-bye. Quick, Ellen!' And so we left him.\nBefore we reached home, Catherine's displeasure softened into a perplexed pity, blended with vague, uneasy doubts about Linton. I shared her doubts, though I counselled her not to say much; for we should judge his state better after a second journey.\nMy master requested an account of our trip. His nephew's thanks were duly delivered, but we said little else; for I hardly knew what to hide and what to reveal.",
        "paragraph_chars": [
            [
                0,
                403
            ],
            [
                403,
                680
            ],
            [
                680,
                789
            ],
            [
                789,
                968
            ],
            [
                968,
                1057
            ],
            [
                1057,
                1206
            ],
            [
                1206,
                1247
            ],
            [
                1247,
                1496
            ],
            [
                1496,
                1799
            ],
            [
                1799,
                2102
            ],
            [
                2102,
                2226
            ],
            [
                2226,
                2380
            ],
            [
                2380,
                2477
            ],
            [
                2477,
                2696
            ],
            [
                2696,
                2745
            ],
            [
                2745,
                2850
            ],
            [
                2850,
                2904
            ],
            [
                2904,
                3175
            ],
            [
                3175,
                3272
            ],
            [
                3272,
                3396
            ],
            [
                3396,
                3684
            ],
            [
                3684,
                3734
            ],
            [
                3734,
                3874
            ],
            [
                3874,
                3958
            ],
            [
                3958,
                4053
            ],
            [
                4053,
                4141
            ],
            [
                4141,
                4227
            ],
            [
                4227,
                4394
            ],
            [
                4394,
                4595
            ],
            [
                4595,
                4747
            ],
            [
                4747,
                4859
            ],
            [
                4859,
                5110
            ],
            [
                5110,
                5270
            ]
        ],
        "segment_chars": [
            [
                0,
                121
            ],
            [
                121,
                185
            ],
            [
                185,
                241
            ],
            [
                241,
                403
            ],
            [
                403,
                479
            ],
            [
                479,
                557
            ],
            [
                557,
                680
            ],
            [
                680,
                789
            ],
            [
                789,
                813
            ],
            [
                813,
                968
            ],
            [
                968,
                1057
            ],
            [
                1057,
                1097
            ],
            [
                1097,
                1143
            ],
            [
                1143,
                1206
            ],
            [
                1206,
                1247
            ],
            [
                1247,
                1415
            ],
            [
                1415,
                1496
            ],
            [
                1496,
                1550
            ],
            [
                1550,
                1611
            ],
            [
                1611,
                1696
            ],
            [
                1696,
                1799
            ],
            [
                1799,
                1897
            ],
            [
                1897,
                2006
            ],
            [
                2006,
                2102
            ],
            [
                2102,
                2183
            ],
            [
                2183,
                2226
            ],
            [
                2226,
                2254
            ],
            [
                2254,
                2338
            ],
            [
                2338,
                2380
            ],
            [
                2380,
                2420
            ],
            [
                2420,
                2477
            ],
            [
                2477,
                2526
            ],
            [
                2526,
                2569
            ],
            [
                2569,
                2696
            ],
            [
                2696,
                2745
            ],
            [
                2745,
                2786
            ],
            [
                2786,
                2850
            ],
            [
                2850,
                2892
            ],
            [
                2892,
                2904
            ],
            [
                2904,
                2945
            ],
            [
                2945,
                3175
            ],
            [
                3175,
                3208
            ],
            [
                3208,
                3223
            ],
            [
                3223,
                3272
            ],
            [
                3272,
                3306
            ],
            [
                3306,
                3396
            ],
            [
                3396,
                3425
            ],
            [
                3425,
                3445
            ],
            [
                3445,
                3475
            ],
            [
                3475,
                3577
            ],
            [
                3577,
                3684
            ],
            [
                3684,
                3726
            ],
            [
                3726,
                3734
            ],
            [
                3734,
                3816
            ],
            [
                3816,
                3874
            ],
            [
                3874,
                3958
            ],
            [
                3958,
                4053
            ],
            [
                4053,
                4112
            ],
            [
                4112,
                4141
            ],
            [
                4141,
                4175
            ],
            [
                4175,
                4227
            ],
            [
                4227,
                4297
            ],
            [
                4297,
                4394
            ],
            [
                4394,
                4406
            ],
            [
                4406,
                4442
            ],
            [
                4442,
                4595
            ],
            [
                4595,
                4643
            ],
            [
                4643,
                4657
            ],
            [
                4657,
                4747
            ],
            [
                4747,
                4813
            ],
            [
                4813,
                4824
            ],
            [
                4824,
                4839
            ],
            [
                4839,
                4859
            ],
            [
                4859,
                4987
            ],
            [
                4987,
                5110
            ],
            [
                5110,
                5154
            ],
            [
                5154,
                5270
            ]
        ],
        "overlap_chars": [
            [
                0,
                45
            ],
            [
                46,
                53
            ],
            [
                53,
                121
            ],
            [
                121,
                129
            ],
            [
                130,
                133
            ],
            [
                134,
                157
            ],
            [
                158,
                161
            ],
            [
                162,
                183
            ],
            [
                185,
                220
            ],
            [
                221,
                241
            ],
            [
                241,
                287
            ],
            [
                293,
                316
            ],
            [
                318,
                319
            ],
            [
                326,
                332
            ],
            [
                338,
                342
            ],
            [
                343,
                352
            ],
            [
                356,
                372
            ],
            [
                384,
                400
            ],
            [
                403,
                423
            ],
            [
                424,
                426
            ],
            [
                427,
                477
            ],
            [
                477,
                479
            ],
            [
                479,
                498
            ],
            [
                498,
                548
            ],
            [
                555,
                557
            ],
            [
                557,
                631
            ],
            [
                634,
                657
            ],
            [
                658,
                677
            ],
            [
                680,
                730
            ],
            [
                730,
                731
            ],
            [
                742,
                745
            ],
            [
                755,
                789
            ],
            [
                790,
                810
            ],
            [
                813,
                838
            ],
            [
                847,
                919
            ],
            [
                920,
                928
            ],
            [
                936,
                946
            ],
            [
                950,
                966
            ],
            [
                966,
                968
            ],
            [
                969,
                992
            ],
            [
                999,
                1013
            ],
            [
                1016,
                1025
            ],
            [
                1031,
                1032
            ],
            [
                1034,
                1054
            ],
            [
                1058,
                1067
            ],
            [
                1070,
                1097
            ],
            [
                1098,
                1123
            ],
            [
                1125,
                1143
            ],
            [
                1143,
                1178
            ],
            [
                1184,
                1203
            ],
            [
                1218,
                1234
            ],
            [
                1235,
                1241
            ],
            [
                1245,
                1247
            ],
            [
                1253,
                1284
            ],
            [
                1287,
                1329
            ],
            [
                1332,
                1358
            ],
            [
                1359,
                1386
            ],
            [
                1386,
                1387
            ],
            [
                1388,
                1415
            ],
            [
                1415,
                1481
            ],
            [
                1496,
                1548
            ],
            [
                1550,
                1556
            ],
            [
                1557,
                1576
            ],
            [
                1585,
                1611
            ],
            [
                1611,
                1631
            ],
            [
                1636,
                1651
            ],
            [
                1658,
                1696
            ],
            [
                1700,
                1711
            ],
            [
                1712,
                1745
            ],
            [
                1746,
                1797
            ],
            [
                1797,
                1798
            ],
            [
                1799,
                1808
            ],
            [
                1813,
                1820
            ],
            [
                1828,
                1829
            ],
            [
                1830,
                1836
            ],
            [
                1837,
                1841
            ],
            [
                1849,
                1850
            ],
            [
                1851,
                1871
            ],
            [
                1886,
                1897
            ],
            [
                1897,
                1910
            ],
            [
                1911,
                1923
            ],
            [
                1924,
                2006
            ],
            [
                2006,
                2102
            ],
            [
                2103,
                2114
            ],
            [
                2117,
                2128
            ],
            [
                2130,
                2181
            ],
            [
                2183,
                2223
            ],
            [
                2232,
                2239
            ],
            [
                2242,
                2254
            ],
            [
                2255,
                2264
            ],
            [
                2265,
                2307
            ],
            [
                2308,
                2320
            ],
            [
                2321,
                2336
            ],
            [
                2336,
                2338
            ],
            [
                2338,
                2355
            ],
            [
                2361,
                2377
            ],
            [
                2381,
                2399
            ],
            [
                2400,
                2403
            ],
            [
                2404,
                2420
            ],
            [
                2420,
                2450
            ],
            [
                2453,
                2475
            ],
            [
                2475,
                2477
            ],
            [
                2478,
                2509
            ],
            [
                2512,
                2524
            ],
            [
                2524,
                2526
            ],
            [
                2527,
                2530
            ],
            [
                2537,
                2540
            ],
            [
                2541,
                2567
            ],
            [
                2567,
                2569
            ],
            [
                2569,
                2586
            ],
            [
                2587,
                2590
            ],
            [
                2591,
                2639
            ],
            [
                2645,
                2648
            ],
            [
                2649,
                2658
            ],
            [
                2659,
                2676
            ],
            [
                2677,
                2693
            ],
            [
                2697,
                2725
            ],
            [
                2728,
                2743
            ],
            [
                2743,
                2745
            ],
            [
                2746,
                2754
            ],
            [
                2757,
                2786
            ],
            [
                2790,
                2792
            ],
            [
                2793,
                2847
            ],
            [
                2851,
                2889
            ],
            [
                2892,
                2903
            ],
            [
                2904,
                2943
            ],
            [
                2945,
                2950
            ],
            [
                2959,
                2991
            ],
            [
                2998,
                3082
            ],
            [
                3082,
                3098
            ],
            [
                3104,
                3123
            ],
            [
                3135,
                3173
            ],
            [
                3173,
                3175
            ],
            [
                3176,
                3205
            ],
            [
                3208,
                3221
            ],
            [
                3221,
                3223
            ],
            [
                3224,
                3269
            ],
            [
                3273,
                3291
            ],
            [
                3294,
                3304
            ],
            [
                3304,
                3306
            ],
            [
                3307,
                3331
            ],
            [
                3336,
                3393
            ],
            [
                3397,
                3404
            ],
            [
                3405,
                3407
            ],
            [
                3408,
                3422
            ],
            [
                3425,
                3445
            ],
            [
                3451,
                3453
            ],
            [
                3469,
                3475
            ],
            [
                3475,
                3479
            ],
            [
                3480,
                3485
            ],
            [
                3486,
                3490
            ],
            [
                3499,
                3538
            ],
            [
                3539,
                3577
            ],
            [
                3577,
                3657
            ],
            [
                3658,
                3681
            ],
            [
                3685,
                3694
            ],
            [
                3695,
                3700
            ],
            [
                3701,
                3723
            ],
            [
                3726,
                3734
            ],
            [
                3735,
                3738
            ],
            [
                3741,
                3754
            ],
            [
                3756,
                3814
            ],
            [
                3814,
                3816
            ],
            [
                3816,
                3825
            ],
            [
                3837,
                3842
            ],
            [
                3843,
                3871
            ],
            [
                3881,
                3911
            ],
            [
                3914,
                3925
            ],
            [
                3927,
                3935
            ],
            [
                3946,
                3955
            ],
            [
                3958,
                3964
            ],
            [
                3965,
                4024
            ],
            [
                4032,
                4053
            ],
            [
                4054,
                4081
            ],
            [
                4084,
                4103
            ],
            [
                4110,
                4112
            ],
            [
                4113,
                4138
            ],
            [
                4142,
                4152
            ],
            [
                4155,
                4175
            ],
            [
                4176,
                4212
            ],
            [
                4218,
                4224
            ],
            [
                4227,
                4278
            ],
            [
                4280,
                4294
            ],
            [
                4297,
                4394
            ],
            [
                4394,
                4406
            ],
            [
                4407,
                4410
            ],
            [
                4417,
                4429
            ],
            [
                4432,
                4442
            ],
            [
                4443,
                4549
            ],
            [
                4549,
                4592
            ],
            [
                4596,
                4600
            ],
            [
                4603,
                4619
            ],
            [
                4621,
                4643
            ],
            [
                4643,
                4654
            ],
            [
                4657,
                4688
            ],
            [
                4688,
                4693
            ],
            [
                4694,
                4705
            ],
            [
                4712,
                4736
            ],
            [
                4737,
                4740
            ],
            [
                4745,
                4747
            ],
            [
                4748,
                4774
            ],
            [
                4777,
                4813
            ],
            [
                4814,
                4824
            ],
            [
                4824,
                4836
            ],
            [
                4839,
                4857
            ],
            [
                4857,
                4859
            ],
            [
                4859,
                4932
            ],
            [
                4933,
                4937
            ],
            [
                4937,
                4938
            ],
            [
                4939,
                4985
            ],
            [
                4985,
                4986
            ],
            [
                4987,
                4988
            ],
            [
                5006,
                5052
            ],
            [
                5079,
                5085
            ],
            [
                5092,
                5108
            ],
            [
                5110,
                5147
            ],
            [
                5152,
                5154
            ],
            [
                5154,
                5166
            ],
            [
                5167,
                5173
            ],
            [
                5179,
                5194
            ],
            [
                5207,
                5213
            ],
            [
                5220,
                5270
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                241
            ],
            [
                241,
                403
            ],
            [
                403,
                403
            ],
            [
                403,
                403
            ],
            [
                403,
                479
            ],
            [
                479,
                557
            ],
            [
                557,
                680
            ],
            [
                680,
                789
            ],
            [
                789,
                813
            ],
            [
                813,
                968
            ],
            [
                968,
                1057
            ],
            [
                1057,
                1097
            ],
            [
                1097,
                1143
            ],
            [
                1143,
                1206
            ],
            [
                1206,
                1247
            ],
            [
                1247,
                1415
            ],
            [
                1415,
                1496
            ],
            [
                1496,
                1611
            ],
            [
                1611,
                1696
            ],
            [
                1696,
                1696
            ],
            [
                1696,
                1799
            ],
            [
                1799,
                1897
            ],
            [
                1897,
                2006
            ],
            [
                2006,
                2102
            ],
            [
                2102,
                2226
            ],
            [
                2226,
                2254
            ],
            [
                2254,
                2338
            ],
            [
                2338,
                2380
            ],
            [
                2380,
                2420
            ],
            [
                2420,
                2477
            ],
            [
                2477,
                2526
            ],
            [
                2526,
                2569
            ],
            [
                2569,
                2696
            ],
            [
                2696,
                2745
            ],
            [
                2745,
                2786
            ],
            [
                2786,
                2850
            ],
            [
                2850,
                2892
            ],
            [
                2892,
                2904
            ],
            [
                2904,
                2904
            ],
            [
                2904,
                3175
            ],
            [
                3175,
                3208
            ],
            [
                3208,
                3223
            ],
            [
                3223,
                3223
            ],
            [
                3223,
                3272
            ],
            [
                3272,
                3306
            ],
            [
                3306,
                3396
            ],
            [
                3396,
                3425
            ],
            [
                3425,
                3445
            ],
            [
                3445,
                3475
            ],
            [
                3475,
                3577
            ],
            [
                3577,
                3577
            ],
            [
                3577,
                3684
            ],
            [
                3684,
                3726
            ],
            [
                3726,
                3734
            ],
            [
                3734,
                3816
            ],
            [
                3816,
                3874
            ],
            [
                3874,
                3958
            ],
            [
                3958,
                4053
            ],
            [
                4053,
                4053
            ],
            [
                4053,
                4053
            ],
            [
                4053,
                4112
            ],
            [
                4112,
                4141
            ],
            [
                4141,
                4175
            ],
            [
                4175,
                4175
            ],
            [
                4175,
                4227
            ],
            [
                4227,
                4227
            ],
            [
                4227,
                4297
            ],
            [
                4297,
                4394
            ],
            [
                4394,
                4406
            ],
            [
                4406,
                4442
            ],
            [
                4442,
                4595
            ],
            [
                4595,
                4643
            ],
            [
                4643,
                4657
            ],
            [
                4657,
                4747
            ],
            [
                4747,
                4813
            ],
            [
                4813,
                4824
            ],
            [
                4824,
                4839
            ],
            [
                4839,
                4859
            ],
            [
                4859,
                5110
            ],
            [
                5110,
                5154
            ],
            [
                5154,
                5270
            ]
        ]
    }
}