{
    "original": {
        "text": "Seven days glided away, every one marking its course by the henceforth rapid alteration of Edgar Linton's state. The havoc that months had previously wrought was now emulated by the inroads of hours. Catherine we would fain have deluded yet; but her own quick spirit refused to delude her: it divined in secret, and brooded on the dreadful probability, gradually ripening into certainty. She had not the heart to mention her ride, when Thursday came round; I mentioned it for her, and obtained permission to order her out of doors: for the library, where her father stopped a short time daily-the brief period he could bear to sit up-and his chamber, had become her whole world. She grudged each moment that did not find her bending over his pillow, or seated by his side. Her countenance grew wan with watching and sorrow, and my master gladly dismissed her to what he flattered himself would be a happy change of scene and society; drawing comfort from the hope that she would not now be left entirely alone after his death.\nHe had a fixed idea, I guessed by several observations he let fall, that, as his nephew resembled him in person, he would resemble him in mind; for Linton's letters bore few or no indications of his defective character. And I, through pardonable weakness, refrained from correcting the error; asking myself what good there would be in disturbing his last moments with information that he had neither power nor opportunity to turn to account.\nWe deferred our excursion till the afternoon; a golden afternoon of August: every breath from the hills so full of life, that it seemed whoever respired it, though dying, might revive. Catherine's face was just like the landscape-shadows and sunshine flitting over it in rapid succession; but the shadows rested longer, and the sunshine was more transient; and her poor little heart reproached itself for even that passing forgetfulness of its cares.\nWe discerned Linton watching at the same spot he had selected before. My young mistress alighted, and told me that, as she was resolved to stay a very little while, I had better hold the pony and remain on horseback; but I dissented: I wouldn't risk losing sight of the charge committed to me a minute; so we climbed the slope of heath together. Master Heathcliff received us with greater animation on this occasion: not the animation of high spirits though, nor yet of joy; it looked more like fear.\n\"It is late!\" he said, speaking short and with difficulty. \"Is not your father very ill? I thought you wouldn't come.\"\n\"_Why_ won't you be candid?\" cried Catherine, swallowing her greeting. \"Why cannot you say at once you don't want me? It is strange, Linton, that for the second time you have brought me here on purpose, apparently to distress us both, and for no reason besides!\"\nLinton shivered, and glanced at her, half supplicating, half ashamed; but his cousin's patience was not sufficient to endure this enigmatical behaviour.\n\"My father _is_ very ill,\" she said; \"and why am I called from his bedside? Why didn't you send to absolve me from my promise, when you wished I wouldn't keep it? Come! I desire an explanation: playing and trifling are completely banished out of my mind; and I can't dance attendance on your affectations now!\"\n\"My affectations!\" he murmured; \"what are they? For heaven's sake, Catherine, don't look so angry! Despise me as much as you please; I am a worthless, cowardly wretch: I can't be scorned enough; but I'm too mean for your anger. Hate my father, and spare me for contempt.\"\n\"Nonsense!\" cried Catherine in a passion. \"Foolish, silly boy! And there! he trembles: as if I were really going to touch him! You needn't bespeak contempt, Linton: anybody will have it spontaneously at your service. Get off! I shall return home: it is folly dragging you from the hearth-stone, and pretending-what do we pretend? Let go my frock! If I pitied you for crying and looking so very frightened, you should spurn such pity. Ellen, tell him how disgraceful this conduct is. Rise, and don't degrade yourself into an abject reptile-_don't_!\"\nWith streaming face and an expression of agony, Linton had thrown his nerveless frame along the ground: he seemed convulsed with exquisite terror.\n\"Oh!\" he sobbed, \"I cannot bear it! Catherine, Catherine, I'm a traitor, too, and I dare not tell you! But leave me, and I shall be killed! _Dear_ Catherine, my life is in your hands: and you have said you loved me, and if you did, it wouldn't harm you. You'll not go, then? kind, sweet, good Catherine! And perhaps you _will_ consent-and he'll let me die with you!\"\nMy young lady, on witnessing his intense anguish, stooped to raise him. The old feeling of indulgent tenderness overcame her vexation, and she grew thoroughly moved and alarmed.\n\"Consent to what?\" she asked. \"To stay! tell me the meaning of this strange talk, and I will. You contradict your own words, and distract me! Be calm and frank, and confess at once all that weighs on your heart. You wouldn't injure me, Linton, would you? You wouldn't let any enemy hurt me, if you could prevent it? I'll believe you are a coward, for yourself, but not a cowardly betrayer of your best friend.\"\n\"But my father threatened me,\" gasped the boy, clasping his attenuated fingers, \"and I dread him-I dread him! I _dare_ not tell!\"\n\"Oh, well!\" said Catherine, with scornful compassion, \"keep your secret: _I'm_ no coward. Save yourself: I'm not afraid!\"\nHer magnanimity provoked his tears: he wept wildly, kissing her supporting hands, and yet could not summon courage to speak out. I was cogitating what the mystery might be, and determined Catherine should never suffer to benefit him or any one else, by my good will; when, hearing a rustle among the ling, I looked up and saw Mr. Heathcliff almost close upon us, descending the Heights. He didn't cast a glance towards my companions, though they were sufficiently near for Linton's sobs to be audible; but hailing me in the almost hearty tone he assumed to none besides, and the sincerity of which I couldn't avoid doubting, he said-\n\"It is something to see you so near to my house, Nelly. How are you at the Grange? Let us hear. The rumour goes,\" he added, in a lower tone, \"that Edgar Linton is on his death-bed: perhaps they exaggerate his illness?\"\n\"No; my master is dying,\" I replied: \"it is true enough. A sad thing it will be for us all, but a blessing for him!\"\n\"How long will he last, do you think?\" he asked.\n\"I don't know,\" I said.\n\"Because,\" he continued, looking at the two young people, who were fixed under his eye-Linton appeared as if he could not venture to stir or raise his head, and Catherine could not move, on his account-\"because that lad yonder seems determined to beat me; and I'd thank his uncle to be quick, and go before him! Hallo! has the whelp been playing that game long? I _did_ give him some lessons about snivelling. Is he pretty lively with Miss Linton generally?\"\n\"Lively? no-he has shown the greatest distress,\" I answered. \"To see him, I should say, that instead of rambling with his sweetheart on the hills, he ought to be in bed, under the hands of a doctor.\"\n\"He shall be, in a day or two,\" muttered Heathcliff. \"But first-get up, Linton! Get up!\" he shouted. \"Don't grovel on the ground there: up, this moment!\"\nLinton had sunk prostrate again in another paroxysm of helpless fear, caused by his father's glance towards him, I suppose: there was nothing else to produce such humiliation. He made several efforts to obey, but his little strength was annihilated for the time, and he fell back again with a moan. Mr. Heathcliff advanced, and lifted him to lean against a ridge of turf.\n\"Now,\" said he, with curbed ferocity, \"I'm getting angry and if you don't command that paltry spirit of yours-_damn_ you! get up directly!\"\n\"I will, father,\" he panted. \"Only, let me alone, or I shall faint. I've done as you wished, I'm sure. Catherine will tell you that I-that I-have been cheerful. Ah! keep by me, Catherine; give me your hand.\"\n\"Take mine,\" said his father; \"stand on your feet. There now-she'll lend you her arm: that's right, look at her. You would imagine I was the devil himself, Miss Linton, to excite such horror. Be so kind as to walk home with him, will you? He shudders if I touch him.\"\n\"Linton dear!\" whispered Catherine, \"I can't go to Wuthering Heights: papa has forbidden me. He'll not harm you: why are you so afraid?\"\n\"I can never re-enter that house,\" he answered. \"I'm _not_ to re-enter it without you!\"\n\"Stop!\" cried his father. \"We'll respect Catherine's filial scruples. Nelly, take him in, and I'll follow your advice concerning the doctor, without delay.\"\n\"You'll do well,\" replied I. \"But I must remain with my mistress: to mind your son is not my business.\"\n\"You are very stiff,\" said Heathcliff, \"I know that: but you'll force me to pinch the baby and make it scream before it moves your charity. Come, then, my hero. Are you willing to return, escorted by me?\"\nHe approached once more, and made as if he would seize the fragile being; but, shrinking back, Linton clung to his cousin, and implored her to accompany him, with a frantic importunity that admitted no denial. However I disapproved, I couldn't hinder her: indeed, how could she have refused him herself? What was filling him with dread we had no means of discerning; but there he was, powerless under its grip, and any addition seemed capable of shocking him into idiocy. We reached the threshold; Catherine walked in, and I stood waiting till she had conducted the invalid to a chair, expecting her out immediately; when Mr. Heathcliff, pushing me forward, exclaimed-\"My house is not stricken with the plague, Nelly; and I have a mind to be hospitable to-day: sit down, and allow me to shut the door.\"\nHe shut and locked it also. I started.\n\"You shall have tea before you go home,\" he added. \"I am by myself. Hareton is gone with some cattle to the Lees, and Zillah and Joseph are off on a journey of pleasure; and, though I'm used to being alone, I'd rather have some interesting company, if I can get it. Miss Linton, take your seat by _him_. I give you what I have: the present is hardly worth accepting; but I have nothing else to offer. It is Linton, I mean. How she does stare! It's odd what a savage feeling I have to anything that seems afraid of me! Had I been born where laws are less strict and tastes less dainty, I should treat myself to a slow vivisection of those two, as an evening's amusement.\"\nHe drew in his breath, struck the table, and swore to himself, \"By hell! I hate them.\"\n\"I am not afraid of you!\" exclaimed Catherine, who could not hear the latter part of his speech. She stepped close up; her black eyes flashing with passion and resolution. \"Give me that key: I will have it!\" she said. \"I wouldn't eat or drink here, if I were starving.\"\nHeathcliff had the key in his hand that remained on the table. He looked up, seized with a sort of surprise at her boldness; or, possibly, reminded, by her voice and glance, of the person from whom she inherited it. She snatched at the instrument, and half succeeded in getting it out of his loosened fingers: but her action recalled him to the present; he recovered it speedily.\n\"Now, Catherine Linton,\" he said, \"stand off, or I shall knock you down; and, that will make Mrs. Dean mad.\"\nRegardless of this warning, she captured his closed hand and its contents again. \"We _will_ go!\" she repeated, exerting her utmost efforts to cause the iron muscles to relax; and finding that her nails made no impression, she applied her teeth pretty sharply. Heathcliff glanced at me a glance that kept me from interfering a moment. Catherine was too intent on his fingers to notice his face. He opened them suddenly, and resigned the object of dispute; but, ere she had well secured it, he seized her with the liberated hand, and, pulling her on his knee, administered with the other a shower of terrific slaps on both sides of the head, each sufficient to have fulfilled his threat, had she been able to fall.\nAt this diabolical violence I rushed on him furiously. \"You villain!\" I began to cry, \"you villain!\" A touch on the chest silenced me: I am stout, and soon put out of breath; and, what with that and the rage, I staggered dizzily back and felt ready to suffocate, or to burst a blood-vessel. The scene was over in two minutes; Catherine, released, put her two hands to her temples, and looked just as if she were not sure whether her ears were off or on. She trembled like a reed, poor thing, and leant against the table perfectly bewildered.\n\"I know how to chastise children, you see,\" said the scoundrel, grimly, as he stooped to repossess himself of the key, which had dropped to the floor. \"Go to Linton now, as I told you; and cry at your ease! I shall be your father, to-morrow-all the father you'll have in a few days-and you shall have plenty of that. You can bear plenty; you're no weakling: you shall have a daily taste, if I catch such a devil of a temper in your eyes again!\"\nCathy ran to me instead of Linton, and knelt down and put her burning cheek on my lap, weeping aloud. Her cousin had shrunk into a corner of the settle, as quiet as a mouse, congratulating himself, I dare say, that the correction had alighted on another than him. Mr. Heathcliff, perceiving us all confounded, rose, and expeditiously made the tea himself. The cups and saucers were laid ready. He poured it out, and handed me a cup.\n\"Wash away your spleen,\" he said. \"And help your own naughty pet and mine. It is not poisoned, though I prepared it. I'm going out to seek your horses.\"\nOur first thought, on his departure, was to force an exit somewhere. We tried the kitchen door, but that was fastened outside: we looked at the windows-they were too narrow for even Cathy's little figure.\n\"Master Linton,\" I cried, seeing we were regularly imprisoned, \"you know what your diabolical father is after, and you shall tell us, or I'll box your ears, as he has done your cousin's.\"\n\"Yes, Linton, you must tell,\" said Catherine. \"It was for your sake I came; and it will be wickedly ungrateful if you refuse.\"\n\"Give me some tea, I'm thirsty, and then I'll tell you,\" he answered. \"Mrs. Dean, go away. I don't like you standing over me. Now, Catherine, you are letting your tears fall into my cup. I won't drink that. Give me another.\" Catherine pushed another to him, and wiped her face. I felt disgusted at the little wretch's composure, since he was no longer in terror for himself. The anguish he had exhibited on the moor subsided as soon as ever he entered Wuthering Heights; so I guessed he had been menaced with an awful visitation of wrath if he failed in decoying us there; and, that accomplished, he had no further immediate fears.\n\"Papa wants us to be married,\" he continued, after sipping some of the liquid. \"And he knows your papa wouldn't let us marry now; and he's afraid of my dying if we wait; so we are to be married in the morning, and you are to stay here all night; and, if you do as he wishes, you shall return home next day, and take me with you.\"\n\"Take you with her, pitiful changeling!\" I exclaimed. \"_You_ marry? Why, the man is mad! or he thinks us fools, every one. And do you imagine that beautiful young lady, that healthy, hearty girl, will tie herself to a little perishing monkey like you? Are you cherishing the notion that anybody, let alone Miss Catherine Linton, would have you for a husband? You want whipping for bringing us in here at all, with your dastardly puling tricks: and-don't look so silly, now! I've a very good mind to shake you severely, for your contemptible treachery, and your imbecile conceit.\"\nI did give him a slight shaking; but it brought on the cough, and he took to his ordinary resource of moaning and weeping, and Catherine rebuked me.\n\"Stay all night? No,\" she said, looking slowly round. \"Ellen, I'll burn that door down but I'll get out.\"\nAnd she would have commenced the execution of her threat directly, but Linton was up in alarm for his dear self again. He clasped her in his two feeble arms sobbing:-\"Won't you have me, and save me? not let me come to the Grange? Oh, darling Catherine! you mustn't go and leave, after all. You _must_ obey my father-you _must_!\"\n\"I must obey my own,\" she replied, \"and relieve him from this cruel suspense. The whole night! What would he think? He'll be distressed already. I'll either break or burn a way out of the house. Be quiet! You're in no danger; but if you hinder me-Linton, I love papa better than you!\" The mortal terror he felt of Mr. Heathcliff's anger restored to the boy his coward's eloquence. Catherine was near distraught: still, she persisted that she must go home, and tried entreaty in her turn, persuading him to subdue his selfish agony. While they were thus occupied, our jailor re-entered.\n\"Your beasts have trotted off,\" he said, \"and-now Linton! snivelling again? What has she been doing to you? Come, come-have done, and get to bed. In a month or two, my lad, you'll be able to pay her back her present tyrannies with a vigorous hand. You're pining for pure love, are you not? nothing else in the world: and she shall have you! There, to bed! Zillah won't be here to-night; you must undress yourself. Hush! hold your noise! Once in your own room, I'll not come near you: you needn't fear. By chance, you've managed tolerably. I'll look to the rest.\"\nHe spoke these words, holding the door open for his son to pass, and the latter achieved his exit exactly as a spaniel might which suspected the person who attended on it of designing a spiteful squeeze. The lock was re-secured. Heathcliff approached the fire, where my mistress and I stood silent. Catherine looked up, and instinctively raised her hand to her cheek: his neighbourhood revived a painful sensation. Anybody else would have been incapable of regarding the childish act with sternness, but he scowled on her and muttered-\"Oh! you are not afraid of me? Your courage is well disguised: you seem damnably afraid!\"\n\"I _am_ afraid now,\" she replied, \"because, if I stay, papa will be miserable: and how can I endure making him miserable-when he-when he-Mr. Heathcliff, let _me_ go home! I promise to marry Linton: papa would like me to: and I love him. Why should you wish to force me to do what I'll willingly do of myself?\"\n\"Let him dare to force you,\" I cried. \"There's law in the land, thank God! there is; though we be in an out-of-the-way place. I'd inform if he were my own son: and it's felony without benefit of clergy!\"\n\"Silence!\" said the ruffian. \"To the devil with your clamour! I don't want _you_ to speak. Miss Linton, I shall enjoy myself remarkably in thinking your father will be miserable: I shall not sleep for satisfaction. You could have hit on no surer way of fixing your residence under my roof for the next twenty-four hours than informing me that such an event would follow. As to your promise to marry Linton, I'll take care you shall keep it; for you shall not quit this place till it is fulfilled.\"\n\"Send Ellen, then, to let papa know I'm safe!\" exclaimed Catherine, weeping bitterly. \"Or marry me now. Poor papa! Ellen, he'll think we're lost. What shall we do?\"\n\"Not he! He'll think you are tired of waiting on him, and run off for a little amusement,\" answered Heathcliff. \"You cannot deny that you entered my house of your own accord, in contempt of his injunctions to the contrary. And it is quite natural that you should desire amusement at your age; and that you would weary of nursing a sick man, and that man _only_ your father. Catherine, his happiest days were over when your days began. He cursed you, I dare say, for coming into the world (I did, at least); and it would just do if he cursed you as _he_ went out of it. I'd join him. I don't love you! How should I? Weep away. As far as I can see, it will be your chief diversion hereafter; unless Linton make amends for other losses: and your provident parent appears to fancy he may. His letters of advice and consolation entertained me vastly. In his last he recommended my jewel to be careful of his; and kind to her when he got her. Careful and kind-that's paternal. But Linton requires his whole stock of care and kindness for himself. Linton can play the little tyrant well. He'll undertake to torture any number of cats, if their teeth be drawn and their claws pared. You'll be able to tell his uncle fine tales of his _kindness_, when you get home again, I assure you.\"\n\"You're right there!\" I said; \"explain your son's character. Show his resemblance to yourself: and then, I hope, Miss Cathy will think twice before she takes the cockatrice!\"\n\"I don't much mind speaking of his amiable qualities now,\" he answered; \"because she must either accept him or remain a prisoner, and you along with her, till your master dies. I can detain you both, quite concealed, here. If you doubt, encourage her to retract her word, and you'll have an opportunity of judging!\"\n\"I'll not retract my word,\" said Catherine. \"I'll marry him within this hour, if I may go to Thrushcross Grange afterwards. Mr. Heathcliff, you're a cruel man, but you're not a fiend; and you won't, from _mere_ malice, destroy irrevocably all my happiness. If papa thought I had left him on purpose, and if he died before I returned, could I bear to live? I've given over crying: but I'm going to kneel here, at your knee; and I'll not get up, and I'll not take my eyes from your face till you look back at me! No, don't turn away! _do look_! you'll see nothing to provoke you. I don't hate you. I'm not angry that you struck me. Have you never loved _anybody_ in all your life, uncle? _never_? Ah! you must look once. I'm so wretched, you can't help being sorry and pitying me.\"\n\"Keep your eft's fingers off; and move, or I'll kick you!\" cried Heathcliff, brutally repulsing her. \"I'd rather be hugged by a snake. How the devil can you dream of fawning on me? I _detest_ you!\"\nHe shrugged his shoulders: shook himself, indeed, as if his flesh crept with aversion; and thrust back his chair; while I got up, and opened my mouth, to commence a downright torrent of abuse. But I was rendered dumb in the middle of the first sentence, by a threat that I should be shown into a room by myself the very next syllable I uttered. It was growing dark-we heard a sound of voices at the garden-gate. Our host hurried out instantly: _he_ had his wits about him; _we_ had not. There was a talk of two or three minutes, and he returned alone.\n\"I thought it had been your cousin Hareton,\" I observed to Catherine. \"I wish he would arrive! Who knows but he might take our part?\"\n\"It was three servants sent to seek you from the Grange,\" said Heathcliff, overhearing me. \"You should have opened a lattice and called out: but I could swear that chit is glad you didn't. She's glad to be obliged to stay, I'm certain.\"\nAt learning the chance we had missed, we both gave vent to our grief without control; and he allowed us to wail on till nine o'clock. Then he bid us go upstairs, through the kitchen, to Zillah's chamber; and I whispered my companion to obey: perhaps we might contrive to get through the window there, or into a garret, and out by its skylight. The window, however, was narrow, like those below, and the garret trap was safe from our attempts; for we were fastened in as before. We neither of us lay down: Catherine took her station by the lattice, and watched anxiously for morning; a deep sigh being the only answer I could obtain to my frequent entreaties that she would try to rest. I seated myself in a chair, and rocked to and fro, passing harsh judgment on my many derelictions of duty; from which, it struck me then, all the misfortunes of my employers sprang. It was not the case, in reality, I am aware; but it was, in my imagination, that dismal night; and I thought Heathcliff himself less guilty than I.\nAt seven o'clock he came, and inquired if Miss Linton had risen. She ran to the door immediately, and answered, \"Yes.\" \"Here, then,\" he said, opening it, and pulling her out. I rose to follow, but he turned the lock again. I demanded my release.\n\"Be patient,\" he replied; \"I'll send up your breakfast in a while.\"\nI thumped on the panels, and rattled the latch angrily and Catherine asked why I was still shut up? He answered, I must try to endure it another hour, and they went away. I endured it two or three hours; at length, I heard a footstep: not Heathcliff's.\n\"I've brought you something to eat,\" said a voice; \"oppen t' door!\"\nComplying eagerly, I beheld Hareton, laden with food enough to last me all day.\n\"Tak' it,\" he added, thrusting the tray into my hand.\n\"Stay one minute,\" I began.\n\"Nay,\" cried he, and retired, regardless of any prayers I could pour forth to detain him.\nAnd there I remained enclosed the whole day, and the whole of the next night; and another, and another. Five nights and four days I remained, altogether, seeing nobody but Hareton once every morning; and he was a model of a jailor: surly, and dumb, and deaf to every attempt at moving his sense of justice or compassion.",
        "paragraph_chars": [
            [
                0,
                1027
            ],
            [
                1027,
                1469
            ],
            [
                1469,
                1920
            ],
            [
                1920,
                2421
            ],
            [
                2421,
                2540
            ],
            [
                2540,
                2803
            ],
            [
                2803,
                2956
            ],
            [
                2956,
                3267
            ],
            [
                3267,
                3539
            ],
            [
                3539,
                4088
            ],
            [
                4088,
                4235
            ],
            [
                4235,
                4602
            ],
            [
                4602,
                4780
            ],
            [
                4780,
                5191
            ],
            [
                5191,
                5321
            ],
            [
                5321,
                5443
            ],
            [
                5443,
                6077
            ],
            [
                6077,
                6296
            ],
            [
                6296,
                6413
            ],
            [
                6413,
                6462
            ],
            [
                6462,
                6486
            ],
            [
                6486,
                6945
            ],
            [
                6945,
                7145
            ],
            [
                7145,
                7299
            ],
            [
                7299,
                7671
            ],
            [
                7671,
                7811
            ],
            [
                7811,
                8019
            ],
            [
                8019,
                8287
            ],
            [
                8287,
                8424
            ],
            [
                8424,
                8512
            ],
            [
                8512,
                8669
            ],
            [
                8669,
                8773
            ],
            [
                8773,
                8978
            ],
            [
                8978,
                9781
            ],
            [
                9781,
                9820
            ],
            [
                9820,
                10491
            ],
            [
                10491,
                10578
            ],
            [
                10578,
                10848
            ],
            [
                10848,
                11228
            ],
            [
                11228,
                11337
            ],
            [
                11337,
                12050
            ],
            [
                12050,
                12592
            ],
            [
                12592,
                13037
            ],
            [
                13037,
                13470
            ],
            [
                13470,
                13623
            ],
            [
                13623,
                13828
            ],
            [
                13828,
                14016
            ],
            [
                14016,
                14143
            ],
            [
                14143,
                14775
            ],
            [
                14775,
                15105
            ],
            [
                15105,
                15685
            ],
            [
                15685,
                15834
            ],
            [
                15834,
                15940
            ],
            [
                15940,
                16269
            ],
            [
                16269,
                16855
            ],
            [
                16855,
                17418
            ],
            [
                17418,
                18043
            ],
            [
                18043,
                18353
            ],
            [
                18353,
                18557
            ],
            [
                18557,
                19055
            ],
            [
                19055,
                19220
            ],
            [
                19220,
                20498
            ],
            [
                20498,
                20673
            ],
            [
                20673,
                20989
            ],
            [
                20989,
                21769
            ],
            [
                21769,
                21967
            ],
            [
                21967,
                22519
            ],
            [
                22519,
                22653
            ],
            [
                22653,
                22890
            ],
            [
                22890,
                23906
            ],
            [
                23906,
                24152
            ],
            [
                24152,
                24220
            ],
            [
                24220,
                24473
            ],
            [
                24473,
                24541
            ],
            [
                24541,
                24621
            ],
            [
                24621,
                24675
            ],
            [
                24675,
                24703
            ],
            [
                24703,
                24793
            ],
            [
                24793,
                25113
            ]
        ],
        "segment_chars": [
            [
                0,
                113
            ],
            [
                113,
                200
            ],
            [
                200,
                388
            ],
            [
                388,
                679
            ],
            [
                679,
                773
            ],
            [
                773,
                1027
            ],
            [
                1027,
                1247
            ],
            [
                1247,
                1469
            ],
            [
                1469,
                1654
            ],
            [
                1654,
                1920
            ],
            [
                1920,
                1990
            ],
            [
                1990,
                2266
            ],
            [
                2266,
                2421
            ],
            [
                2421,
                2435
            ],
            [
                2435,
                2480
            ],
            [
                2480,
                2510
            ],
            [
                2510,
                2540
            ],
            [
                2540,
                2569
            ],
            [
                2569,
                2611
            ],
            [
                2611,
                2658
            ],
            [
                2658,
                2803
            ],
            [
                2803,
                2956
            ],
            [
                2956,
                3032
            ],
            [
                3032,
                3119
            ],
            [
                3119,
                3125
            ],
            [
                3125,
                3267
            ],
            [
                3267,
                3286
            ],
            [
                3286,
                3315
            ],
            [
                3315,
                3366
            ],
            [
                3366,
                3495
            ],
            [
                3495,
                3539
            ],
            [
                3539,
                3551
            ],
            [
                3551,
                3581
            ],
            [
                3581,
                3602
            ],
            [
                3602,
                3613
            ],
            [
                3613,
                3666
            ],
            [
                3666,
                3756
            ],
            [
                3756,
                3765
            ],
            [
                3765,
                3869
            ],
            [
                3869,
                3886
            ],
            [
                3886,
                3973
            ],
            [
                3973,
                4022
            ],
            [
                4022,
                4088
            ],
            [
                4088,
                4235
            ],
            [
                4235,
                4241
            ],
            [
                4241,
                4271
            ],
            [
                4271,
                4338
            ],
            [
                4338,
                4375
            ],
            [
                4375,
                4489
            ],
            [
                4489,
                4510
            ],
            [
                4510,
                4539
            ],
            [
                4539,
                4602
            ],
            [
                4602,
                4674
            ],
            [
                4674,
                4780
            ],
            [
                4780,
                4799
            ],
            [
                4799,
                4810
            ],
            [
                4810,
                4820
            ],
            [
                4820,
                4874
            ],
            [
                4874,
                4922
            ],
            [
                4922,
                4992
            ],
            [
                4992,
                5035
            ],
            [
                5035,
                5096
            ],
            [
                5096,
                5191
            ],
            [
                5191,
                5301
            ],
            [
                5301,
                5321
            ],
            [
                5321,
                5333
            ],
            [
                5333,
                5411
            ],
            [
                5411,
                5443
            ],
            [
                5443,
                5572
            ],
            [
                5572,
                5830
            ],
            [
                5830,
                6077
            ],
            [
                6077,
                6133
            ],
            [
                6133,
                6160
            ],
            [
                6160,
                6173
            ],
            [
                6173,
                6296
            ],
            [
                6296,
                6353
            ],
            [
                6353,
                6413
            ],
            [
                6413,
                6452
            ],
            [
                6452,
                6462
            ],
            [
                6462,
                6486
            ],
            [
                6486,
                6798
            ],
            [
                6798,
                6805
            ],
            [
                6805,
                6848
            ],
            [
                6848,
                6896
            ],
            [
                6896,
                6945
            ],
            [
                6945,
                6954
            ],
            [
                6954,
                7006
            ],
            [
                7006,
                7145
            ],
            [
                7145,
                7198
            ],
            [
                7198,
                7225
            ],
            [
                7225,
                7234
            ],
            [
                7234,
                7246
            ],
            [
                7246,
                7299
            ],
            [
                7299,
                7475
            ],
            [
                7475,
                7598
            ],
            [
                7598,
                7671
            ],
            [
                7671,
                7793
            ],
            [
                7793,
                7811
            ],
            [
                7811,
                7840
            ],
            [
                7840,
                7879
            ],
            [
                7879,
                7914
            ],
            [
                7914,
                7972
            ],
            [
                7972,
                7976
            ],
            [
                7976,
                8019
            ],
            [
                8019,
                8070
            ],
            [
                8070,
                8132
            ],
            [
                8132,
                8211
            ],
            [
                8211,
                8258
            ],
            [
                8258,
                8287
            ],
            [
                8287,
                8302
            ],
            [
                8302,
                8380
            ],
            [
                8380,
                8424
            ],
            [
                8424,
                8472
            ],
            [
                8472,
                8512
            ],
            [
                8512,
                8520
            ],
            [
                8520,
                8538
            ],
            [
                8538,
                8582
            ],
            [
                8582,
                8669
            ],
            [
                8669,
                8698
            ],
            [
                8698,
                8773
            ],
            [
                8773,
                8913
            ],
            [
                8913,
                8934
            ],
            [
                8934,
                8978
            ],
            [
                8978,
                9188
            ],
            [
                9188,
                9282
            ],
            [
                9282,
                9450
            ],
            [
                9450,
                9781
            ],
            [
                9781,
                9809
            ],
            [
                9809,
                9820
            ],
            [
                9820,
                9871
            ],
            [
                9871,
                9888
            ],
            [
                9888,
                10086
            ],
            [
                10086,
                10124
            ],
            [
                10124,
                10221
            ],
            [
                10221,
                10243
            ],
            [
                10243,
                10263
            ],
            [
                10263,
                10338
            ],
            [
                10338,
                10491
            ],
            [
                10491,
                10564
            ],
            [
                10564,
                10578
            ],
            [
                10578,
                10604
            ],
            [
                10604,
                10675
            ],
            [
                10675,
                10750
            ],
            [
                10750,
                10786
            ],
            [
                10786,
                10796
            ],
            [
                10796,
                10848
            ],
            [
                10848,
                10911
            ],
            [
                10911,
                11064
            ],
            [
                11064,
                11228
            ],
            [
                11228,
                11337
            ],
            [
                11337,
                11418
            ],
            [
                11418,
                11434
            ],
            [
                11434,
                11597
            ],
            [
                11597,
                11671
            ],
            [
                11671,
                11731
            ],
            [
                11731,
                12050
            ],
            [
                12050,
                12105
            ],
            [
                12105,
                12120
            ],
            [
                12120,
                12151
            ],
            [
                12151,
                12341
            ],
            [
                12341,
                12504
            ],
            [
                12504,
                12592
            ],
            [
                12592,
                12743
            ],
            [
                12743,
                12799
            ],
            [
                12799,
                12909
            ],
            [
                12909,
                13037
            ],
            [
                13037,
                13139
            ],
            [
                13139,
                13301
            ],
            [
                13301,
                13393
            ],
            [
                13393,
                13431
            ],
            [
                13431,
                13470
            ],
            [
                13470,
                13504
            ],
            [
                13504,
                13545
            ],
            [
                13545,
                13587
            ],
            [
                13587,
                13623
            ],
            [
                13623,
                13692
            ],
            [
                13692,
                13828
            ],
            [
                13828,
                14016
            ],
            [
                14016,
                14062
            ],
            [
                14062,
                14143
            ],
            [
                14143,
                14213
            ],
            [
                14213,
                14234
            ],
            [
                14234,
                14269
            ],
            [
                14269,
                14330
            ],
            [
                14330,
                14350
            ],
            [
                14350,
                14368
            ],
            [
                14368,
                14421
            ],
            [
                14421,
                14518
            ],
            [
                14518,
                14775
            ],
            [
                14775,
                14854
            ],
            [
                14854,
                15105
            ],
            [
                15105,
                15146
            ],
            [
                15146,
                15159
            ],
            [
                15159,
                15173
            ],
            [
                15173,
                15194
            ],
            [
                15194,
                15228
            ],
            [
                15228,
                15357
            ],
            [
                15357,
                15464
            ],
            [
                15464,
                15579
            ],
            [
                15579,
                15685
            ],
            [
                15685,
                15834
            ],
            [
                15834,
                15851
            ],
            [
                15851,
                15888
            ],
            [
                15888,
                15940
            ],
            [
                15940,
                16059
            ],
            [
                16059,
                16139
            ],
            [
                16139,
                16170
            ],
            [
                16170,
                16193
            ],
            [
                16193,
                16230
            ],
            [
                16230,
                16269
            ],
            [
                16269,
                16347
            ],
            [
                16347,
                16364
            ],
            [
                16364,
                16385
            ],
            [
                16385,
                16414
            ],
            [
                16414,
                16464
            ],
            [
                16464,
                16474
            ],
            [
                16474,
                16554
            ],
            [
                16554,
                16650
            ],
            [
                16650,
                16801
            ],
            [
                16801,
                16855
            ],
            [
                16855,
                16913
            ],
            [
                16913,
                16931
            ],
            [
                16931,
                16963
            ],
            [
                16963,
                17001
            ],
            [
                17001,
                17103
            ],
            [
                17103,
                17145
            ],
            [
                17145,
                17196
            ],
            [
                17196,
                17211
            ],
            [
                17211,
                17269
            ],
            [
                17269,
                17275
            ],
            [
                17275,
                17292
            ],
            [
                17292,
                17357
            ],
            [
                17357,
                17394
            ],
            [
                17394,
                17418
            ],
            [
                17418,
                17622
            ],
            [
                17622,
                17647
            ],
            [
                17647,
                17717
            ],
            [
                17717,
                17833
            ],
            [
                17833,
                17958
            ],
            [
                17958,
                17984
            ],
            [
                17984,
                18043
            ],
            [
                18043,
                18214
            ],
            [
                18214,
                18280
            ],
            [
                18280,
                18353
            ],
            [
                18353,
                18391
            ],
            [
                18391,
                18428
            ],
            [
                18428,
                18479
            ],
            [
                18479,
                18557
            ],
            [
                18557,
                18568
            ],
            [
                18568,
                18586
            ],
            [
                18586,
                18619
            ],
            [
                18619,
                18648
            ],
            [
                18648,
                18772
            ],
            [
                18772,
                18928
            ],
            [
                18928,
                19055
            ],
            [
                19055,
                19102
            ],
            [
                19102,
                19141
            ],
            [
                19141,
                19159
            ],
            [
                19159,
                19170
            ],
            [
                19170,
                19201
            ],
            [
                19201,
                19220
            ],
            [
                19220,
                19229
            ],
            [
                19229,
                19332
            ],
            [
                19332,
                19443
            ],
            [
                19443,
                19594
            ],
            [
                19594,
                19655
            ],
            [
                19655,
                19789
            ],
            [
                19789,
                19803
            ],
            [
                19803,
                19821
            ],
            [
                19821,
                19835
            ],
            [
                19835,
                19846
            ],
            [
                19846,
                20005
            ],
            [
                20005,
                20066
            ],
            [
                20066,
                20157
            ],
            [
                20157,
                20191
            ],
            [
                20191,
                20261
            ],
            [
                20261,
                20301
            ],
            [
                20301,
                20395
            ],
            [
                20395,
                20498
            ],
            [
                20498,
                20520
            ],
            [
                20520,
                20559
            ],
            [
                20559,
                20673
            ],
            [
                20673,
                20850
            ],
            [
                20850,
                20896
            ],
            [
                20896,
                20989
            ],
            [
                20989,
                21033
            ],
            [
                21033,
                21113
            ],
            [
                21113,
                21246
            ],
            [
                21246,
                21345
            ],
            [
                21345,
                21500
            ],
            [
                21500,
                21521
            ],
            [
                21521,
                21532
            ],
            [
                21532,
                21567
            ],
            [
                21567,
                21585
            ],
            [
                21585,
                21619
            ],
            [
                21619,
                21675
            ],
            [
                21675,
                21684
            ],
            [
                21684,
                21688
            ],
            [
                21688,
                21708
            ],
            [
                21708,
                21769
            ],
            [
                21769,
                21828
            ],
            [
                21828,
                21870
            ],
            [
                21870,
                21904
            ],
            [
                21904,
                21950
            ],
            [
                21950,
                21967
            ],
            [
                21967,
                22160
            ],
            [
                22160,
                22312
            ],
            [
                22312,
                22379
            ],
            [
                22379,
                22454
            ],
            [
                22454,
                22519
            ],
            [
                22519,
                22589
            ],
            [
                22589,
                22614
            ],
            [
                22614,
                22653
            ],
            [
                22653,
                22744
            ],
            [
                22744,
                22842
            ],
            [
                22842,
                22890
            ],
            [
                22890,
                23024
            ],
            [
                23024,
                23234
            ],
            [
                23234,
                23368
            ],
            [
                23368,
                23576
            ],
            [
                23576,
                23758
            ],
            [
                23758,
                23906
            ],
            [
                23906,
                23971
            ],
            [
                23971,
                24025
            ],
            [
                24025,
                24081
            ],
            [
                24081,
                24129
            ],
            [
                24129,
                24152
            ],
            [
                24152,
                24220
            ],
            [
                24220,
                24320
            ],
            [
                24320,
                24391
            ],
            [
                24391,
                24473
            ],
            [
                24473,
                24541
            ],
            [
                24541,
                24621
            ],
            [
                24621,
                24675
            ],
            [
                24675,
                24703
            ],
            [
                24703,
                24793
            ],
            [
                24793,
                24897
            ],
            [
                24897,
                25113
            ]
        ],
        "overlap_chars": [
            [
                56,
                59
            ],
            [
                0,
                10
            ],
            [
                91,
                111
            ],
            [
                111,
                113
            ],
            [
                200,
                209
            ],
            [
                229,
                236
            ],
            [
                288,
                289
            ],
            [
                316,
                351
            ],
            [
                246,
                249
            ],
            [
                351,
                387
            ],
            [
                388,
                429
            ],
            [
                431,
                455
            ],
            [
                457,
                458
            ],
            [
                485,
                507
            ],
            [
                514,
                535
            ],
            [
                555,
                565
            ],
            [
                642,
                649
            ],
            [
                651,
                679
            ],
            [
                679,
                707
            ],
            [
                708,
                715
            ],
            [
                725,
                773
            ],
            [
                789,
                793
            ],
            [
                798,
                811
            ],
            [
                822,
                869
            ],
            [
                888,
                920
            ],
            [
                932,
                1027
            ],
            [
                1027,
                1046
            ],
            [
                1093,
                1131
            ],
            [
                1138,
                1200
            ],
            [
                1219,
                1247
            ],
            [
                1251,
                1252
            ],
            [
                1309,
                1318
            ],
            [
                1252,
                1253
            ],
            [
                1344,
                1349
            ],
            [
                1362,
                1389
            ],
            [
                1467,
                1469
            ],
            [
                1469,
                1471
            ],
            [
                1515,
                1612
            ],
            [
                1622,
                1625
            ],
            [
                1626,
                1654
            ],
            [
                1654,
                1699
            ],
            [
                1707,
                1787
            ],
            [
                1918,
                1920
            ],
            [
                1920,
                1922
            ],
            [
                1933,
                1965
            ],
            [
                1982,
                1990
            ],
            [
                2273,
                2275
            ],
            [
                2284,
                2318
            ],
            [
                2322,
                2326
            ],
            [
                2335,
                2357
            ],
            [
                2390,
                2393
            ],
            [
                2377,
                2378
            ],
            [
                2371,
                2377
            ],
            [
                2393,
                2421
            ],
            [
                2422,
                2432
            ],
            [
                2435,
                2452
            ],
            [
                2463,
                2480
            ],
            [
                2481,
                2510
            ],
            [
                2510,
                2537
            ],
            [
                2612,
                2656
            ],
            [
                2569,
                2584
            ],
            [
                2609,
                2610
            ],
            [
                2658,
                2730
            ],
            [
                2743,
                2800
            ],
            [
                2803,
                2844
            ],
            [
                2864,
                2887
            ],
            [
                2899,
                2902
            ],
            [
                2890,
                2898
            ],
            [
                2954,
                2956
            ],
            [
                2960,
                2966
            ],
            [
                2968,
                2970
            ],
            [
                2972,
                2980
            ],
            [
                2983,
                2992
            ],
            [
                2998,
                3030
            ],
            [
                3081,
                3091
            ],
            [
                3036,
                3042
            ],
            [
                3063,
                3065
            ],
            [
                3334,
                3364
            ],
            [
                3286,
                3297
            ],
            [
                3370,
                3376
            ],
            [
                3388,
                3433
            ],
            [
                3493,
                3495
            ],
            [
                3495,
                3509
            ],
            [
                3521,
                3523
            ],
            [
                3540,
                3548
            ],
            [
                3551,
                3581
            ],
            [
                3597,
                3602
            ],
            [
                3613,
                3624
            ],
            [
                3626,
                3666
            ],
            [
                3765,
                3785
            ],
            [
                3869,
                3886
            ],
            [
                3913,
                3916
            ],
            [
                3925,
                3927
            ],
            [
                3933,
                3943
            ],
            [
                3971,
                3973
            ],
            [
                3973,
                4022
            ],
            [
                4032,
                4078
            ],
            [
                4079,
                4084
            ],
            [
                4088,
                4092
            ],
            [
                4093,
                4153
            ],
            [
                4180,
                4216
            ],
            [
                4227,
                4235
            ],
            [
                4236,
                4238
            ],
            [
                4241,
                4251
            ],
            [
                4253,
                4271
            ],
            [
                4282,
                4306
            ],
            [
                4311,
                4338
            ],
            [
                4338,
                4375
            ],
            [
                4376,
                4380
            ],
            [
                4382,
                4449
            ],
            [
                4487,
                4489
            ],
            [
                4489,
                4510
            ],
            [
                4510,
                4539
            ],
            [
                4539,
                4554
            ],
            [
                4556,
                4560
            ],
            [
                4562,
                4599
            ],
            [
                4602,
                4674
            ],
            [
                4674,
                4780
            ],
            [
                4781,
                4796
            ],
            [
                4799,
                4810
            ],
            [
                4814,
                4818
            ],
            [
                4820,
                4874
            ],
            [
                4922,
                4929
            ],
            [
                4939,
                4952
            ],
            [
                4961,
                4992
            ],
            [
                4992,
                5035
            ],
            [
                5035,
                5096
            ],
            [
                5096,
                5125
            ],
            [
                5139,
                5188
            ],
            [
                5192,
                5219
            ],
            [
                5222,
                5237
            ],
            [
                5272,
                5301
            ],
            [
                5301,
                5302
            ],
            [
                5310,
                5318
            ],
            [
                5322,
                5330
            ],
            [
                5333,
                5374
            ],
            [
                5376,
                5392
            ],
            [
                5424,
                5440
            ],
            [
                5479,
                5506
            ],
            [
                5518,
                5572
            ],
            [
                5572,
                5577
            ],
            [
                5589,
                5615
            ],
            [
                5710,
                5732
            ],
            [
                5747,
                5783
            ],
            [
                5791,
                5804
            ],
            [
                5828,
                5830
            ],
            [
                5830,
                5883
            ],
            [
                5916,
                5929
            ],
            [
                5889,
                5893
            ],
            [
                5936,
                5966
            ],
            [
                5974,
                6013
            ],
            [
                6068,
                6077
            ],
            [
                6133,
                6158
            ],
            [
                6124,
                6131
            ],
            [
                6158,
                6160
            ],
            [
                6160,
                6173
            ],
            [
                6173,
                6188
            ],
            [
                6191,
                6217
            ],
            [
                6219,
                6293
            ],
            [
                6297,
                6319
            ],
            [
                6322,
                6331
            ],
            [
                6351,
                6353
            ],
            [
                6353,
                6410
            ],
            [
                6414,
                6449
            ],
            [
                6452,
                6462
            ],
            [
                6463,
                6475
            ],
            [
                6478,
                6486
            ],
            [
                6487,
                6494
            ],
            [
                6497,
                6543
            ],
            [
                6697,
                6705
            ],
            [
                6713,
                6798
            ],
            [
                6798,
                6805
            ],
            [
                6805,
                6848
            ],
            [
                6848,
                6849
            ],
            [
                6851,
                6854
            ],
            [
                6856,
                6896
            ],
            [
                6896,
                6942
            ],
            [
                6946,
                6954
            ],
            [
                6954,
                6991
            ],
            [
                6994,
                7006
            ],
            [
                7019,
                7031
            ],
            [
                7033,
                7057
            ],
            [
                7078,
                7142
            ],
            [
                7146,
                7174
            ],
            [
                7177,
                7198
            ],
            [
                7199,
                7223
            ],
            [
                7234,
                7246
            ],
            [
                7250,
                7273
            ],
            [
                7281,
                7296
            ],
            [
                7299,
                7314
            ],
            [
                7331,
                7333
            ],
            [
                7354,
                7367
            ],
            [
                7473,
                7475
            ],
            [
                7475,
                7511
            ],
            [
                7523,
                7531
            ],
            [
                7560,
                7565
            ],
            [
                7569,
                7598
            ],
            [
                7598,
                7671
            ],
            [
                7672,
                7675
            ],
            [
                7678,
                7708
            ],
            [
                7710,
                7727
            ],
            [
                7732,
                7781
            ],
            [
                7788,
                7793
            ],
            [
                7793,
                7808
            ],
            [
                7812,
                7826
            ],
            [
                7829,
                7840
            ],
            [
                7841,
                7879
            ],
            [
                7879,
                7902
            ],
            [
                7912,
                7914
            ],
            [
                7914,
                7972
            ],
            [
                7972,
                7976
            ],
            [
                7976,
                8016
            ],
            [
                8025,
                8029
            ],
            [
                8032,
                8048
            ],
            [
                8050,
                8070
            ],
            [
                8080,
                8117
            ],
            [
                8130,
                8132
            ],
            [
                8132,
                8211
            ],
            [
                8211,
                8258
            ],
            [
                8258,
                8284
            ],
            [
                8288,
                8299
            ],
            [
                8302,
                8322
            ],
            [
                8324,
                8380
            ],
            [
                8400,
                8421
            ],
            [
                8473,
                8476
            ],
            [
                8478,
                8481
            ],
            [
                8483,
                8485
            ],
            [
                8437,
                8456
            ],
            [
                8498,
                8509
            ],
            [
                8459,
                8461
            ],
            [
                8470,
                8471
            ],
            [
                8520,
                8538
            ],
            [
                8539,
                8564
            ],
            [
                8572,
                8582
            ],
            [
                8582,
                8651
            ],
            [
                8687,
                8698
            ],
            [
                8699,
                8734
            ],
            [
                8738,
                8742
            ],
            [
                8743,
                8770
            ],
            [
                8830,
                8882
            ],
            [
                8795,
                8810
            ],
            [
                8911,
                8913
            ],
            [
                8913,
                8934
            ],
            [
                8938,
                8941
            ],
            [
                8978,
                8991
            ],
            [
                9089,
                9092
            ],
            [
                8992,
                9001
            ],
            [
                9050,
                9088
            ],
            [
                9001,
                9006
            ],
            [
                9105,
                9134
            ],
            [
                9186,
                9188
            ],
            [
                9242,
                9255
            ],
            [
                9280,
                9282
            ],
            [
                9314,
                9316
            ],
            [
                9308,
                9313
            ],
            [
                9343,
                9348
            ],
            [
                9355,
                9361
            ],
            [
                9363,
                9387
            ],
            [
                9448,
                9449
            ],
            [
                9450,
                9474
            ],
            [
                9476,
                9495
            ],
            [
                9497,
                9500
            ],
            [
                9540,
                9562
            ],
            [
                9593,
                9645
            ],
            [
                9495,
                9496
            ],
            [
                9562,
                9563
            ],
            [
                9700,
                9730
            ],
            [
                9737,
                9778
            ],
            [
                9781,
                9808
            ],
            [
                9821,
                9858
            ],
            [
                9861,
                9871
            ],
            [
                9888,
                9955
            ],
            [
                9967,
                9968
            ],
            [
                9960,
                9963
            ],
            [
                9988,
                10067
            ],
            [
                10084,
                10086
            ],
            [
                10086,
                10116
            ],
            [
                10227,
                10233
            ],
            [
                10146,
                10220
            ],
            [
                10243,
                10263
            ],
            [
                10263,
                10271
            ],
            [
                10279,
                10285
            ],
            [
                10294,
                10295
            ],
            [
                10304,
                10338
            ],
            [
                10338,
                10380
            ],
            [
                10403,
                10488
            ],
            [
                10491,
                10552
            ],
            [
                10555,
                10564
            ],
            [
                10564,
                10575
            ],
            [
                10579,
                10601
            ],
            [
                10604,
                10623
            ],
            [
                10673,
                10675
            ],
            [
                10675,
                10695
            ],
            [
                10697,
                10750
            ],
            [
                10751,
                10783
            ],
            [
                10786,
                10796
            ],
            [
                10797,
                10845
            ],
            [
                10848,
                10882
            ],
            [
                10909,
                10911
            ],
            [
                10911,
                10923
            ],
            [
                10932,
                10936
            ],
            [
                10947,
                10995
            ],
            [
                10997,
                11009
            ],
            [
                11022,
                11064
            ],
            [
                11064,
                11083
            ],
            [
                11094,
                11139
            ],
            [
                11149,
                11161
            ],
            [
                11202,
                11228
            ],
            [
                11229,
                11250
            ],
            [
                11253,
                11261
            ],
            [
                11263,
                11304
            ],
            [
                11306,
                11334
            ],
            [
                11337,
                11417
            ],
            [
                11419,
                11421
            ],
            [
                11423,
                11427
            ],
            [
                11429,
                11431
            ],
            [
                11434,
                11447
            ],
            [
                11476,
                11478
            ],
            [
                11485,
                11501
            ],
            [
                11505,
                11580
            ],
            [
                11588,
                11597
            ],
            [
                11597,
                11621
            ],
            [
                11641,
                11660
            ],
            [
                11669,
                11671
            ],
            [
                11731,
                11740
            ],
            [
                11699,
                11710
            ],
            [
                11746,
                11755
            ],
            [
                11792,
                11795
            ],
            [
                11801,
                11804
            ],
            [
                11769,
                11772
            ],
            [
                11824,
                11839
            ],
            [
                11756,
                11759
            ],
            [
                11878,
                11881
            ],
            [
                11923,
                11975
            ],
            [
                12048,
                12050
            ],
            [
                12050,
                12105
            ],
            [
                12106,
                12117
            ],
            [
                12120,
                12134
            ],
            [
                12151,
                12228
            ],
            [
                12259,
                12283
            ],
            [
                12228,
                12229
            ],
            [
                12293,
                12298
            ],
            [
                12316,
                12340
            ],
            [
                12341,
                12374
            ],
            [
                12376,
                12404
            ],
            [
                12409,
                12421
            ],
            [
                12429,
                12430
            ],
            [
                12447,
                12504
            ],
            [
                12504,
                12592
            ],
            [
                12593,
                12633
            ],
            [
                12636,
                12654
            ],
            [
                12656,
                12662
            ],
            [
                12741,
                12743
            ],
            [
                12744,
                12761
            ],
            [
                12777,
                12799
            ],
            [
                12799,
                12822
            ],
            [
                12832,
                12909
            ],
            [
                12909,
                13018
            ],
            [
                13029,
                13034
            ],
            [
                13037,
                13063
            ],
            [
                13064,
                13139
            ],
            [
                13139,
                13301
            ],
            [
                13301,
                13356
            ],
            [
                13371,
                13393
            ],
            [
                13431,
                13470
            ],
            [
                13471,
                13485
            ],
            [
                13495,
                13504
            ],
            [
                13545,
                13587
            ],
            [
                13587,
                13620
            ],
            [
                13623,
                13692
            ],
            [
                13692,
                13731
            ],
            [
                13748,
                13749
            ],
            [
                13763,
                13774
            ],
            [
                13780,
                13828
            ],
            [
                13836,
                13842
            ],
            [
                13845,
                13853
            ],
            [
                13892,
                13983
            ],
            [
                14017,
                14043
            ],
            [
                14046,
                14062
            ],
            [
                14063,
                14140
            ],
            [
                14144,
                14160
            ],
            [
                14162,
                14173
            ],
            [
                14179,
                14197
            ],
            [
                14200,
                14213
            ],
            [
                14215,
                14218
            ],
            [
                14219,
                14234
            ],
            [
                14234,
                14269
            ],
            [
                14269,
                14330
            ],
            [
                14330,
                14350
            ],
            [
                14350,
                14365
            ],
            [
                14368,
                14392
            ],
            [
                14393,
                14421
            ],
            [
                14421,
                14518
            ],
            [
                14522,
                14529
            ],
            [
                14533,
                14536
            ],
            [
                14559,
                14578
            ],
            [
                14584,
                14646
            ],
            [
                14681,
                14693
            ],
            [
                14697,
                14702
            ],
            [
                14706,
                14719
            ],
            [
                14743,
                14757
            ],
            [
                14768,
                14775
            ],
            [
                14776,
                14803
            ],
            [
                14806,
                14819
            ],
            [
                14826,
                14838
            ],
            [
                14852,
                14854
            ],
            [
                14855,
                15102
            ],
            [
                15111,
                15143
            ],
            [
                15146,
                15159
            ],
            [
                15161,
                15164
            ],
            [
                15166,
                15173
            ],
            [
                15232,
                15286
            ],
            [
                15295,
                15357
            ],
            [
                15464,
                15497
            ],
            [
                15501,
                15533
            ],
            [
                15541,
                15572
            ],
            [
                15577,
                15579
            ],
            [
                15579,
                15585
            ],
            [
                15591,
                15613
            ],
            [
                15622,
                15632
            ],
            [
                15646,
                15682
            ],
            [
                15685,
                15745
            ],
            [
                15751,
                15753
            ],
            [
                15787,
                15834
            ],
            [
                15840,
                15851
            ],
            [
                15851,
                15853
            ],
            [
                15856,
                15873
            ],
            [
                15881,
                15888
            ],
            [
                15889,
                15920
            ],
            [
                15930,
                15937
            ],
            [
                16011,
                16059
            ],
            [
                16059,
                16080
            ],
            [
                16085,
                16105
            ],
            [
                16107,
                16139
            ],
            [
                16170,
                16193
            ],
            [
                16230,
                16233
            ],
            [
                16235,
                16239
            ],
            [
                16241,
                16259
            ],
            [
                16261,
                16265
            ],
            [
                16270,
                16288
            ],
            [
                16291,
                16303
            ],
            [
                16305,
                16347
            ],
            [
                16347,
                16364
            ],
            [
                16364,
                16385
            ],
            [
                16385,
                16414
            ],
            [
                16414,
                16464
            ],
            [
                16464,
                16474
            ],
            [
                16524,
                16551
            ],
            [
                16650,
                16680
            ],
            [
                16688,
                16728
            ],
            [
                16735,
                16738
            ],
            [
                16768,
                16771
            ],
            [
                16832,
                16855
            ],
            [
                16856,
                16860
            ],
            [
                16868,
                16884
            ],
            [
                16887,
                16894
            ],
            [
                16905,
                16913
            ],
            [
                16913,
                16931
            ],
            [
                16974,
                17001
            ],
            [
                17001,
                17058
            ],
            [
                17081,
                17103
            ],
            [
                17196,
                17211
            ],
            [
                17211,
                17231
            ],
            [
                17240,
                17269
            ],
            [
                17269,
                17275
            ],
            [
                17315,
                17357
            ],
            [
                17357,
                17394
            ],
            [
                17394,
                17398
            ],
            [
                17404,
                17415
            ],
            [
                17418,
                17420
            ],
            [
                17448,
                17473
            ],
            [
                17438,
                17439
            ],
            [
                17570,
                17573
            ],
            [
                17527,
                17528
            ],
            [
                17529,
                17536
            ],
            [
                17620,
                17622
            ],
            [
                17647,
                17657
            ],
            [
                17622,
                17625
            ],
            [
                17658,
                17717
            ],
            [
                17717,
                17737
            ],
            [
                17742,
                17755
            ],
            [
                17763,
                17784
            ],
            [
                17831,
                17833
            ],
            [
                17922,
                17952
            ],
            [
                17916,
                17917
            ],
            [
                17954,
                17958
            ],
            [
                17958,
                17984
            ],
            [
                17984,
                18040
            ],
            [
                18044,
                18045
            ],
            [
                18047,
                18049
            ],
            [
                18051,
                18061
            ],
            [
                18064,
                18076
            ],
            [
                18078,
                18142
            ],
            [
                18163,
                18180
            ],
            [
                18182,
                18199
            ],
            [
                18201,
                18203
            ],
            [
                18205,
                18214
            ],
            [
                18214,
                18280
            ],
            [
                18280,
                18340
            ],
            [
                18344,
                18350
            ],
            [
                18354,
                18379
            ],
            [
                18382,
                18391
            ],
            [
                18397,
                18426
            ],
            [
                18561,
                18565
            ],
            [
                18568,
                18586
            ],
            [
                18624,
                18626
            ],
            [
                18590,
                18604
            ],
            [
                18633,
                18636
            ],
            [
                18617,
                18618
            ],
            [
                18648,
                18772
            ],
            [
                18772,
                18881
            ],
            [
                18892,
                18894
            ],
            [
                18926,
                18928
            ],
            [
                18928,
                19042
            ],
            [
                19061,
                19099
            ],
            [
                19102,
                19141
            ],
            [
                19142,
                19144
            ],
            [
                19151,
                19153
            ],
            [
                19154,
                19159
            ],
            [
                19159,
                19170
            ],
            [
                19170,
                19199
            ],
            [
                19221,
                19229
            ],
            [
                19229,
                19277
            ],
            [
                19278,
                19289
            ],
            [
                19299,
                19308
            ],
            [
                19311,
                19332
            ],
            [
                19447,
                19482
            ],
            [
                19532,
                19559
            ],
            [
                19592,
                19594
            ],
            [
                19594,
                19655
            ],
            [
                19655,
                19730
            ],
            [
                19751,
                19753
            ],
            [
                19761,
                19767
            ],
            [
                19769,
                19771
            ],
            [
                19778,
                19789
            ],
            [
                19789,
                19803
            ],
            [
                19803,
                19821
            ],
            [
                19821,
                19835
            ],
            [
                19835,
                19846
            ],
            [
                19875,
                19877
            ],
            [
                19899,
                19923
            ],
            [
                19846,
                19848
            ],
            [
                19878,
                19882
            ],
            [
                20003,
                20005
            ],
            [
                20005,
                20026
            ],
            [
                20043,
                20066
            ],
            [
                20066,
                20107
            ],
            [
                20128,
                20132
            ],
            [
                20124,
                20127
            ],
            [
                20108,
                20122
            ],
            [
                20155,
                20157
            ],
            [
                20191,
                20259
            ],
            [
                20268,
                20280
            ],
            [
                20288,
                20301
            ],
            [
                20301,
                20387
            ],
            [
                20393,
                20395
            ],
            [
                20395,
                20445
            ],
            [
                20456,
                20475
            ],
            [
                20481,
                20495
            ],
            [
                20499,
                20517
            ],
            [
                20520,
                20527
            ],
            [
                20559,
                20563
            ],
            [
                20537,
                20547
            ],
            [
                20568,
                20591
            ],
            [
                20601,
                20602
            ],
            [
                20593,
                20596
            ],
            [
                20611,
                20655
            ],
            [
                20679,
                20681
            ],
            [
                20726,
                20729
            ],
            [
                20732,
                20744
            ],
            [
                20746,
                20780
            ],
            [
                20801,
                20802
            ],
            [
                20781,
                20801
            ],
            [
                20825,
                20850
            ],
            [
                20850,
                20855
            ],
            [
                20863,
                20871
            ],
            [
                20879,
                20888
            ],
            [
                20890,
                20894
            ],
            [
                21034,
                21055
            ],
            [
                21061,
                21065
            ],
            [
                21017,
                21031
            ],
            [
                21065,
                21066
            ],
            [
                21067,
                21078
            ],
            [
                21101,
                21113
            ],
            [
                21113,
                21171
            ],
            [
                21244,
                21246
            ],
            [
                21246,
                21345
            ],
            [
                21373,
                21397
            ],
            [
                21412,
                21431
            ],
            [
                21474,
                21500
            ],
            [
                21500,
                21521
            ],
            [
                21522,
                21529
            ],
            [
                21530,
                21532
            ],
            [
                21567,
                21585
            ],
            [
                21585,
                21619
            ],
            [
                21619,
                21639
            ],
            [
                21650,
                21675
            ],
            [
                21676,
                21681
            ],
            [
                21682,
                21684
            ],
            [
                21684,
                21688
            ],
            [
                21688,
                21708
            ],
            [
                21708,
                21739
            ],
            [
                21756,
                21766
            ],
            [
                21770,
                21779
            ],
            [
                21783,
                21807
            ],
            [
                21807,
                21825
            ],
            [
                21828,
                21870
            ],
            [
                21871,
                21904
            ],
            [
                21904,
                21950
            ],
            [
                21950,
                21951
            ],
            [
                21953,
                21959
            ],
            [
                21961,
                21964
            ],
            [
                21967,
                21969
            ],
            [
                21994,
                22007
            ],
            [
                22015,
                22038
            ],
            [
                22052,
                22079
            ],
            [
                22158,
                22159
            ],
            [
                22087,
                22088
            ],
            [
                22101,
                22116
            ],
            [
                22118,
                22120
            ],
            [
                22153,
                22158
            ],
            [
                22079,
                22080
            ],
            [
                22160,
                22163
            ],
            [
                22166,
                22169
            ],
            [
                22221,
                22232
            ],
            [
                22310,
                22311
            ],
            [
                22312,
                22340
            ],
            [
                22352,
                22379
            ],
            [
                22379,
                22410
            ],
            [
                22474,
                22495
            ],
            [
                22500,
                22519
            ],
            [
                22520,
                22561
            ],
            [
                22564,
                22589
            ],
            [
                22590,
                22614
            ],
            [
                22628,
                22650
            ],
            [
                22654,
                22708
            ],
            [
                22711,
                22744
            ],
            [
                22745,
                22760
            ],
            [
                22782,
                22788
            ],
            [
                22794,
                22797
            ],
            [
                22812,
                22842
            ],
            [
                22842,
                22887
            ],
            [
                22890,
                22935
            ],
            [
                22974,
                23024
            ],
            [
                23024,
                23050
            ],
            [
                23073,
                23109
            ],
            [
                23158,
                23160
            ],
            [
                23110,
                23131
            ],
            [
                23132,
                23148
            ],
            [
                23161,
                23193
            ],
            [
                23213,
                23219
            ],
            [
                23060,
                23063
            ],
            [
                23201,
                23207
            ],
            [
                23224,
                23234
            ],
            [
                23234,
                23258
            ],
            [
                23259,
                23265
            ],
            [
                23283,
                23299
            ],
            [
                23305,
                23308
            ],
            [
                23366,
                23367
            ],
            [
                23368,
                23393
            ],
            [
                23395,
                23404
            ],
            [
                23422,
                23428
            ],
            [
                23436,
                23490
            ],
            [
                23410,
                23413
            ],
            [
                23495,
                23506
            ],
            [
                23507,
                23508
            ],
            [
                23567,
                23576
            ],
            [
                23576,
                23577
            ],
            [
                23592,
                23652
            ],
            [
                23585,
                23591
            ],
            [
                23681,
                23682
            ],
            [
                23832,
                23851
            ],
            [
                23693,
                23694
            ],
            [
                23857,
                23906
            ],
            [
                23906,
                23930
            ],
            [
                23969,
                23971
            ],
            [
                23971,
                24007
            ],
            [
                24039,
                24041
            ],
            [
                24072,
                24081
            ],
            [
                24081,
                24098
            ],
            [
                24103,
                24129
            ],
            [
                24129,
                24152
            ],
            [
                24153,
                24163
            ],
            [
                24166,
                24177
            ],
            [
                24179,
                24217
            ],
            [
                24220,
                24274
            ],
            [
                24320,
                24322
            ],
            [
                24333,
                24339
            ],
            [
                24347,
                24374
            ],
            [
                24380,
                24391
            ],
            [
                24391,
                24422
            ],
            [
                24424,
                24473
            ],
            [
                24474,
                24507
            ],
            [
                24510,
                24523
            ],
            [
                24531,
                24538
            ],
            [
                24569,
                24593
            ],
            [
                24619,
                24620
            ],
            [
                24627,
                24629
            ],
            [
                24632,
                24673
            ],
            [
                24718,
                24732
            ],
            [
                24751,
                24758
            ],
            [
                24673,
                24675
            ],
            [
                24803,
                24897
            ],
            [
                24897,
                24934
            ],
            [
                24947,
                24972
            ],
            [
                24991,
                25011
            ],
            [
                25017,
                25059
            ],
            [
                25078,
                25081
            ],
            [
                25102,
                25113
            ]
        ],
        "row_chars": [
            [
                0,
                113
            ],
            [
                113,
                200
            ],
            [
                200,
                388
            ],
            [
                388,
                679
            ],
            [
                679,
                773
            ],
            [
                773,
                1027
            ],
            [
                1027,
                1247
            ],
            [
                1247,
                1469
            ],
            [
                1469,
                1654
            ],
            [
                1654,
                1920
            ],
            [
                1920,
                1990
            ],
            [
                1990,
                2266
            ],
            [
                2266,
                2421
            ],
            [
                2421,
                2435
            ],
            [
                2435,
                2480
            ],
            [
                2480,
                2510
            ],
            [
                2510,
                2540
            ],
            [
                2540,
                2658
            ],
            [
                2658,
                2803
            ],
            [
                2803,
                2956
            ],
            [
                2956,
                3119
            ],
            [
                3119,
                3125
            ],
            [
                3125,
                3267
            ],
            [
                3267,
                3366
            ],
            [
                3366,
                3495
            ],
            [
                3495,
                3539
            ],
            [
                3539,
                3551
            ],
            [
                3551,
                3581
            ],
            [
                3581,
                3602
            ],
            [
                3602,
                3613
            ],
            [
                3613,
                3666
            ],
            [
                3666,
                3756
            ],
            [
                3756,
                3765
            ],
            [
                3765,
                3886
            ],
            [
                3886,
                3973
            ],
            [
                3973,
                4022
            ],
            [
                4022,
                4088
            ],
            [
                4088,
                4235
            ],
            [
                4235,
                4241
            ],
            [
                4241,
                4271
            ],
            [
                4271,
                4338
            ],
            [
                4338,
                4375
            ],
            [
                4375,
                4489
            ],
            [
                4489,
                4510
            ],
            [
                4510,
                4539
            ],
            [
                4539,
                4602
            ],
            [
                4602,
                4674
            ],
            [
                4674,
                4780
            ],
            [
                4780,
                4799
            ],
            [
                4799,
                4810
            ],
            [
                4810,
                4820
            ],
            [
                4820,
                4874
            ],
            [
                4874,
                4922
            ],
            [
                4922,
                4992
            ],
            [
                4992,
                5035
            ],
            [
                5035,
                5096
            ],
            [
                5096,
                5191
            ],
            [
                5191,
                5301
            ],
            [
                5301,
                5321
            ],
            [
                5321,
                5333
            ],
            [
                5333,
                5443
            ],
            [
                5443,
                5572
            ],
            [
                5572,
                5830
            ],
            [
                5830,
                6077
            ],
            [
                6077,
                6160
            ],
            [
                6160,
                6173
            ],
            [
                6173,
                6296
            ],
            [
                6296,
                6353
            ],
            [
                6353,
                6413
            ],
            [
                6413,
                6452
            ],
            [
                6452,
                6462
            ],
            [
                6462,
                6486
            ],
            [
                6486,
                6798
            ],
            [
                6798,
                6805
            ],
            [
                6805,
                6848
            ],
            [
                6848,
                6896
            ],
            [
                6896,
                6945
            ],
            [
                6945,
                6954
            ],
            [
                6954,
                7006
            ],
            [
                7006,
                7145
            ],
            [
                7145,
                7198
            ],
            [
                7198,
                7225
            ],
            [
                7225,
                7234
            ],
            [
                7234,
                7246
            ],
            [
                7246,
                7299
            ],
            [
                7299,
                7475
            ],
            [
                7475,
                7598
            ],
            [
                7598,
                7671
            ],
            [
                7671,
                7793
            ],
            [
                7793,
                7811
            ],
            [
                7811,
                7840
            ],
            [
                7840,
                7879
            ],
            [
                7879,
                7914
            ],
            [
                7914,
                7972
            ],
            [
                7972,
                7976
            ],
            [
                7976,
                8019
            ],
            [
                8019,
                8070
            ],
            [
                8070,
                8132
            ],
            [
                8132,
                8211
            ],
            [
                8211,
                8258
            ],
            [
                8258,
                8287
            ],
            [
                8287,
                8302
            ],
            [
                8302,
                8380
            ],
            [
                8380,
                8424
            ],
            [
                8424,
                8512
            ],
            [
                8512,
                8520
            ],
            [
                8520,
                8538
            ],
            [
                8538,
                8582
            ],
            [
                8582,
                8669
            ],
            [
                8669,
                8698
            ],
            [
                8698,
                8773
            ],
            [
                8773,
                8913
            ],
            [
                8913,
                8934
            ],
            [
                8934,
                8978
            ],
            [
                8978,
                9188
            ],
            [
                9188,
                9282
            ],
            [
                9282,
                9450
            ],
            [
                9450,
                9781
            ],
            [
                9781,
                9809
            ],
            [
                9809,
                9820
            ],
            [
                9820,
                9871
            ],
            [
                9871,
                9888
            ],
            [
                9888,
                10086
            ],
            [
                10086,
                10243
            ],
            [
                10243,
                10263
            ],
            [
                10263,
                10338
            ],
            [
                10338,
                10491
            ],
            [
                10491,
                10564
            ],
            [
                10564,
                10578
            ],
            [
                10578,
                10604
            ],
            [
                10604,
                10675
            ],
            [
                10675,
                10750
            ],
            [
                10750,
                10786
            ],
            [
                10786,
                10796
            ],
            [
                10796,
                10848
            ],
            [
                10848,
                10911
            ],
            [
                10911,
                11064
            ],
            [
                11064,
                11228
            ],
            [
                11228,
                11337
            ],
            [
                11337,
                11418
            ],
            [
                11418,
                11434
            ],
            [
                11434,
                11597
            ],
            [
                11597,
                11671
            ],
            [
                11671,
                12050
            ],
            [
                12050,
                12105
            ],
            [
                12105,
                12120
            ],
            [
                12120,
                12151
            ],
            [
                12151,
                12341
            ],
            [
                12341,
                12504
            ],
            [
                12504,
                12592
            ],
            [
                12592,
                12743
            ],
            [
                12743,
                12799
            ],
            [
                12799,
                12909
            ],
            [
                12909,
                13037
            ],
            [
                13037,
                13139
            ],
            [
                13139,
                13301
            ],
            [
                13301,
                13393
            ],
            [
                13393,
                13431
            ],
            [
                13431,
                13470
            ],
            [
                13470,
                13504
            ],
            [
                13504,
                13545
            ],
            [
                13545,
                13587
            ],
            [
                13587,
                13623
            ],
            [
                13623,
                13692
            ],
            [
                13692,
                13828
            ],
            [
                13828,
                14016
            ],
            [
                14016,
                14062
            ],
            [
                14062,
                14143
            ],
            [
                14143,
                14213
            ],
            [
                14213,
                14234
            ],
            [
                14234,
                14269
            ],
            [
                14269,
                14330
            ],
            [
                14330,
                14350
            ],
            [
                14350,
                14368
            ],
            [
                14368,
                14421
            ],
            [
                14421,
                14518
            ],
            [
                14518,
                14775
            ],
            [
                14775,
                14854
            ],
            [
                14854,
                15105
            ],
            [
                15105,
                15146
            ],
            [
                15146,
                15159
            ],
            [
                15159,
                15173
            ],
            [
                15173,
                15194
            ],
            [
                15194,
                15228
            ],
            [
                15228,
                15357
            ],
            [
                15357,
                15464
            ],
            [
                15464,
                15579
            ],
            [
                15579,
                15685
            ],
            [
                15685,
                15834
            ],
            [
                15834,
                15851
            ],
            [
                15851,
                15888
            ],
            [
                15888,
                15940
            ],
            [
                15940,
                16059
            ],
            [
                16059,
                16139
            ],
            [
                16139,
                16170
            ],
            [
                16170,
                16193
            ],
            [
                16193,
                16230
            ],
            [
                16230,
                16269
            ],
            [
                16269,
                16347
            ],
            [
                16347,
                16364
            ],
            [
                16364,
                16385
            ],
            [
                16385,
                16414
            ],
            [
                16414,
                16464
            ],
            [
                16464,
                16474
            ],
            [
                16474,
                16554
            ],
            [
                16554,
                16650
            ],
            [
                16650,
                16855
            ],
            [
                16855,
                16913
            ],
            [
                16913,
                16931
            ],
            [
                16931,
                16963
            ],
            [
                16963,
                17001
            ],
            [
                17001,
                17103
            ],
            [
                17103,
                17145
            ],
            [
                17145,
                17196
            ],
            [
                17196,
                17211
            ],
            [
                17211,
                17269
            ],
            [
                17269,
                17275
            ],
            [
                17275,
                17292
            ],
            [
                17292,
                17357
            ],
            [
                17357,
                17394
            ],
            [
                17394,
                17418
            ],
            [
                17418,
                17622
            ],
            [
                17622,
                17717
            ],
            [
                17717,
                17833
            ],
            [
                17833,
                17958
            ],
            [
                17958,
                17984
            ],
            [
                17984,
                18043
            ],
            [
                18043,
                18214
            ],
            [
                18214,
                18280
            ],
            [
                18280,
                18353
            ],
            [
                18353,
                18391
            ],
            [
                18391,
                18428
            ],
            [
                18428,
                18479
            ],
            [
                18479,
                18557
            ],
            [
                18557,
                18568
            ],
            [
                18568,
                18586
            ],
            [
                18586,
                18648
            ],
            [
                18648,
                18772
            ],
            [
                18772,
                18928
            ],
            [
                18928,
                19055
            ],
            [
                19055,
                19102
            ],
            [
                19102,
                19141
            ],
            [
                19141,
                19159
            ],
            [
                19159,
                19170
            ],
            [
                19170,
                19201
            ],
            [
                19201,
                19220
            ],
            [
                19220,
                19229
            ],
            [
                19229,
                19332
            ],
            [
                19332,
                19443
            ],
            [
                19443,
                19594
            ],
            [
                19594,
                19655
            ],
            [
                19655,
                19789
            ],
            [
                19789,
                19803
            ],
            [
                19803,
                19821
            ],
            [
                19821,
                19835
            ],
            [
                19835,
                19846
            ],
            [
                19846,
                20005
            ],
            [
                20005,
                20066
            ],
            [
                20066,
                20157
            ],
            [
                20157,
                20191
            ],
            [
                20191,
                20301
            ],
            [
                20301,
                20395
            ],
            [
                20395,
                20498
            ],
            [
                20498,
                20520
            ],
            [
                20520,
                20673
            ],
            [
                20673,
                20850
            ],
            [
                20850,
                20896
            ],
            [
                20896,
                20989
            ],
            [
                20989,
                21113
            ],
            [
                21113,
                21246
            ],
            [
                21246,
                21345
            ],
            [
                21345,
                21500
            ],
            [
                21500,
                21521
            ],
            [
                21521,
                21532
            ],
            [
                21532,
                21567
            ],
            [
                21567,
                21585
            ],
            [
                21585,
                21619
            ],
            [
                21619,
                21675
            ],
            [
                21675,
                21684
            ],
            [
                21684,
                21688
            ],
            [
                21688,
                21708
            ],
            [
                21708,
                21769
            ],
            [
                21769,
                21828
            ],
            [
                21828,
                21870
            ],
            [
                21870,
                21904
            ],
            [
                21904,
                21950
            ],
            [
                21950,
                21967
            ],
            [
                21967,
                22312
            ],
            [
                22312,
                22379
            ],
            [
                22379,
                22519
            ],
            [
                22519,
                22589
            ],
            [
                22589,
                22614
            ],
            [
                22614,
                22653
            ],
            [
                22653,
                22744
            ],
            [
                22744,
                22842
            ],
            [
                22842,
                22890
            ],
            [
                22890,
                23024
            ],
            [
                23024,
                23234
            ],
            [
                23234,
                23368
            ],
            [
                23368,
                23576
            ],
            [
                23576,
                23906
            ],
            [
                23906,
                23971
            ],
            [
                23971,
                24081
            ],
            [
                24081,
                24129
            ],
            [
                24129,
                24152
            ],
            [
                24152,
                24220
            ],
            [
                24220,
                24320
            ],
            [
                24320,
                24391
            ],
            [
                24391,
                24473
            ],
            [
                24473,
                24541
            ],
            [
                24541,
                24621
            ],
            [
                24621,
                24793
            ],
            [
                24793,
                24897
            ],
            [
                24897,
                25113
            ]
        ]
    },
    "abridged": {
        "text": "In the next seven days Edgar Linton's state grew rapidly worse. Catherine could no longer be deluded: she brooded on the dreadful probability of her father's death, gradually ripening into certainty.\nShe had not the heart to mention her ride when Thursday came round. I obtained permission to send her out of doors: for her father's chamber had become her whole world. She grudged each moment that she did not spend bending over his pillow, or seated by his side. She grew pale with watching, and my master gladly dismissed her to what he thought would be a happy change of scene; drawing comfort from the hope that she would not now be left entirely alone after his death.\nHe had a fixed idea, that, as his nephew resembled him in looks, he would resemble him in mind; for Linton's letters bore few signs of his defective character. I did not correct the error, since there was no point disturbing his last moments.\nWe set off on a golden afternoon of August: every breath from the hills so full of life, that it seemed whoever breathed it, even though dying, might revive. Catherine's face was just like the landscape - shadows and sunshine flitting over it in rapid succession; but the shadows rested longer.\nWe found Linton watching at the same spot as before. He received us with greater animation this time: not the animation of joy, though; it looked more like fear.\n'It is late!' he said, speaking with difficulty. 'Is not your father very ill? I thought you wouldn't come.'\n'Why cannot you say at once you don't want me?' cried Catherine. 'It is strange, Linton, that for the second time you have brought me here apparently to distress us both, and for no reason besides!'\nLinton shivered, and glanced at her, half ashamed; but his cousin was out of patience.\n'My father is very ill,' she said; 'why am I called from his bedside, when you didn't really want me?'\n'Catherine, don't look so angry!' he murmured. 'Despise me if you please; I am a worthless, cowardly wretch. Hate my father: but don't hate me.'\n'Nonsense!' cried Catherine in a passion. 'Silly boy! He trembles as if I were really going to touch him! I shall return home: let go my frock! Don't cry and look so frightened. Ellen, tell him how disgraceful this conduct is. Don't degrade yourself into an abject reptile - don't!'\nWith a streaming face and an expression of agony, Linton had thrown himself upon the ground: he seemed convulsed with terror.\n'Oh!' he sobbed, 'I cannot bear it! Catherine, I'm a traitor, and I dare not tell you! But leave me, and I shall be killed! Dear Catherine, my life is in your hands: and you have said you loved me. You'll not go, then? kind, sweet, good Catherine! And perhaps you will consent - and he'll let me die with you!'\nMy young lady, on witnessing his intense anguish, stooped to raise him. The old feeling of indulgent tenderness overcame her vexation, and she grew thoroughly moved and alarmed.\n'Consent to what?' she asked. 'To stay? tell me the meaning of this strange talk, and I will. Be calm, and confess all that weighs on your heart. You wouldn't injure me, Linton, would you? You wouldn't let any enemy hurt me, if you could prevent it? I'll believe you are a coward, but not a cowardly betrayer of your best friend.'\n'But my father threatened me,' gasped the boy, 'and I dread him - I dread him! I dare not tell!'\n'Oh, well!' said Catherine, with scornful compassion, 'keep your secret: I'm not afraid!'\nHe wept wildly, kissing her hands, and yet could not summon courage to speak out. I was wondering what the mystery might be, when, hearing a rustle, I looked up and saw Mr. Heathcliff close upon us. He didn't cast a glance towards my companions, though Linton's sobs were audible; but hailing me in the hearty tone he assumed to none besides, he said-\n'How are you at the Grange, Nelly? Let us hear. The rumour goes,' he added, in a lower tone, 'that Edgar Linton is on his death-bed: perhaps they exaggerate his illness?'\n'No; my master is dying,' I replied. 'A sad thing it will be for us all, but a blessing for him!'\n'How long will he last, do you think?' he asked.\n'I don't know,' I said.\n'Because,' he continued, looking at the two young people, 'that lad seems determined to beat me; and I'd thank his uncle to be quick, and go before him! Hallo! has the whelp been playing that game long? I did give him some lessons about snivelling. Is he pretty lively with Miss Linton generally?'\n'Lively? No - he has shown the greatest distress,' I answered. 'I should say that instead of rambling on the hills, he ought to be in bed, under the hands of a doctor.'\n'He shall be, in a day or two,' muttered Heathcliff. 'But first - get up, Linton!' he shouted. 'Don't grovel on the ground. Up, this moment!'\nLinton had sunk down in helpless fear. He made several efforts to obey, but had no strength, and fell back again with a moan. Mr. Heathcliff advanced, and lifted him to lean against a ridge of turf.\n'Now,' said he, with curbed ferocity, 'I'm getting angry. If you don't command that paltry spirit of yours - damn you! get up directly!'\n'I will, father,' he panted. 'Only, let me alone, or I shall faint. I've done as you wished. Catherine will tell you that I - that I - have been cheerful. Ah! keep by me, Catherine; give me your hand.'\n'Take mine,' said his father; 'stand on your feet. She'll lend you her arm: that's right. You would imagine I was the devil himself, Miss Linton, to excite such horror. Be so kind as to walk home with him, will you? He shudders if I touch him.'\n'Linton dear!' whispered Catherine, 'I can't go to Wuthering Heights: papa has forbidden me. Why are you so afraid?'\n'I'm not to re-enter that house without you!' he said.\n'Stop!' cried his father. 'We'll respect Catherine's scruples. Nelly, take him in, and I'll follow your advice concerning the doctor.'\n'Good,' replied I. 'But I must remain with my mistress: minding your son is not my business.'\n'You'll force me to pinch the baby and make it scream,' said Heathcliff. 'Come, then, my hero. Shall I escort you?'\nHe approached his son once more; but, shrinking back, Linton clung to Cathy, and frantically implored her to accompany him. How could she refuse? We did not know the reason for his dread; but he was powerless under its grip.\nWe reached the threshold. Catherine walked in and was leading the invalid to a chair; when Mr. Heathcliff, pushing me forward, exclaimed, 'Nelly, I have a mind to be hospitable today: sit down, and allow me to shut the door.'\nHe shut and locked it also.\n'You shall have tea before you go home,' he added. 'Hareton is gone with some cattle to the Lees, and Zillah and Joseph have a day off; and, though I'm used to being alone, I'd rather have some interesting company. Miss Linton, take your seat by Linton: the present is hardly worth accepting; but I have nothing else to offer. How she does stare! It's odd how savage I feel towards anything that seems afraid of me! Had I been born where laws are less strict, I should treat myself to a slow vivisection of those two, as an evening's amusement.'\nHe drew in his breath, struck the table, and swore to himself: 'By hell! I hate them.'\n'I am not afraid of you!' exclaimed Catherine. She stepped close up, her black eyes flashing with passion and resolution. 'Give me that key: I will have it!' she said. 'I wouldn't eat or drink here, if I were starving.'\nHeathcliff had the key in his hand. He looked up with surprise at her boldness; or, possibly, reminded by her voice of the person from whom she inherited it. She snatched at the key, and half succeeded in getting it out of his fingers: but he recovered it speedily.\n'Now, Catherine Linton,' he said, 'stand off, or I shall knock you down; and that will make Mrs. Dean mad.'\nRegardless of this warning, she captured his closed hand and its contents again.\n'We will go!' she repeated, trying to make the iron muscles relax; and finding that her nails made no impression, she applied her teeth sharply. Heathcliff glanced at me to keep me from interfering. Then he opened his fingers suddenly, but before she could take the key, he seized her and gave her a shower of terrific slaps on both sides of the head.\nAt this diabolical violence I rushed on him furiously. 'You villain!' I began to cry. A touch on the chest silenced me: I am stout, and soon put out of breath; and I staggered dizzily back, feeling ready to burst a blood-vessel.\nThe scene was over in two minutes. Catherine, released, put her hands to her head, as if she were not sure whether her ears were off or on. She trembled like a reed, poor thing, and leant against the table perfectly bewildered.\n'I know how to chastise children, you see,' said the scoundrel grimly. 'Go to Linton now, and cry at your ease! I shall be your father, tomorrow - all the father you'll have in a few days - and you shall have plenty of that. You can bear plenty; you're no weakling: you shall have a daily taste, if I catch such a devil of a temper in you again!'\nCathy ran to me instead of to Linton, and knelt down and put her burning cheek on my lap, weeping aloud. Her cousin had shrunk into a corner of the settle, as quiet as a mouse, congratulating himself, I dare say, that the correction had alighted on another than him. Mr. Heathcliff, perceiving us all confounded, rose, and made the tea himself. He poured it out, and handed me a cup.\n'Wash away your annoyance,' he said. 'It is not poisoned, though I prepared it. I'm going out to seek your horses.'\nOur first thought, on his departure, was to force an exit somewhere. We tried the kitchen door, but that was locked: and the windows were too narrow for even Cathy's little figure.\n'Master Linton,' I cried, 'you know what your diabolical father is after, and you shall tell us, or I'll box your ears.'\n'Yes, Linton, you must tell,' said Catherine. 'It was for your sake I came; and it will be wickedly ungrateful if you refuse.'\n'Give me some tea - I'm thirsty. Then I'll tell you,' he answered. 'Mrs. Dean, go away. I don't like you standing over me. Now, Catherine, you are letting your tears fall into my cup. I won't drink that. Give me another.'\nCatherine pushed another cup to him, and wiped her face. I felt disgusted at the little wretch's composure, since he was no longer in terror for himself. His anguish had subsided as soon as he entered Wuthering Heights; so I guessed he had been menaced if he failed to decoy us there; and now had no further fears.\n'Papa wants us to be married,' he continued, sipping some tea. 'And he knows your papa wouldn't let us marry now; and he's afraid of my dying if we wait; so we are to be married in the morning, and you are to stay here all night; and, if you do as he wishes, you shall return home next day, and take me with you.'\n'Take you with her, pitiful changeling!' I exclaimed. 'You marry? Do you imagine that beautiful young lady, that healthy girl, will tie herself to a little perishing monkey like you? You want whipping for bringing us here at all, with your dastardly tricks: and - don't look so silly! I've a good mind to shake you, for your treachery, and your imbecile conceit.'\nI did give him a slight shaking; but it brought on the cough. He started moaning and weeping, and Catherine rebuked me.\n'Stay all night? No,' she said, looking round. 'Ellen, I'll burn that door down to get out.'\nAt once Linton was up in alarm for his dear self again. He clasped her in his feeble arms sobbing: 'Won't you have me, and save me? Oh, darling Catherine! You must obey my father - you must!'\n'I must obey my own,' she replied, 'and relieve him from this cruel suspense. The whole night! What would he think? He'll be distressed already. I'll either break or burn a way out of the house. Be quiet! I love papa better than you!' Catherine was near distraught: she persisted that she must go home, and was entreating him when our jailor re-entered.\n'Your horses have trotted off,' he said. 'Linton! snivelling again? Have done, and get to bed. In a month or two, my lad, you'll be able to pay her back with a vigorous hand. There, to bed! Zillah won't be here tonight; you must undress yourself. Hush! I'll not come near you: you needn't fear. By chance, you've managed tolerably. I'll see to the rest.'\nHe held the door open for his son, who slunk out like a frightened spaniel. Heathcliff locked the door, and approached the fire, where my mistress and I stood silent. Catherine looked up, instinctively raising her hand to her cheek. He scowled on her and muttered, 'Oh! so you are not afraid of me? Your courage is well disguised: you seem damnably afraid!'\n'I am afraid now,' she replied, 'because, if I stay, papa will be miserable: and how can I endure that - when he - when he - Mr. Heathcliff, let me go home! I promise to marry Linton: papa would like me to: and I love him. Why should you wish to force me to do what I'll willingly do myself?'\n'Let him dare to force you,' I cried. 'There's law in the land, thank God!'\n'Silence!' said the ruffian. 'To the devil with you! Miss Linton, I shall enjoy myself remarkably in thinking your father will be miserable: I shall not sleep for satisfaction. You could have hit on no surer way of fixing your residence under my roof for the next twenty-four hours than telling me of his misery. As to your promise to marry Linton, I'll take care you shall keep it; for you shall not quit this place till it is done.'\n'Send Ellen, then, to let papa know I'm safe!' exclaimed Catherine, weeping bitterly. 'Or let me be married now. Poor papa! Ellen, he'll think we're lost!'\n'Not he! He'll think you are tired of waiting on him, and have run off for amusement,' answered Heathcliff. 'It is quite natural that you should weary of nursing a sick man. Catherine, his happiest days were over when your days began. He cursed you, I dare say, for coming into the world (I did, at least); and he should curse you as he goes out of it. I'd join him. I don't love you! How should I? Weep away. You'll be doing plenty of weeping hereafter; unless Linton improves as your father hopes. His letters of advice entertained me vastly. In his last he recommended my jewel to be kind and careful of his. But Linton requires his whole stock of care and kindness for himself: he can play the tyrant well. He'll undertake to torture any number of cats, if their teeth be drawn and their claws cut. You'll be able to tell his uncle fine tales of his kindness, when you get home, I assure you.'\n'You're right there!' I said; 'Show your son's resemblance to yourself, and Miss Cathy will think twice before she takes him!'\n'It doesn't matter now,' he answered; 'because she must either accept him, or remain a prisoner, till your master dies. I can keep you both concealed here.'\n'I'll marry him within the hour,' said Catherine, 'if I may go home afterwards. Mr. Heathcliff, you're a cruel man, but you're not a fiend. If papa thought I had left him on purpose, and if he died before I returned, could I bear to live? I'm going to kneel here, and I'll not get up till you look back at me! No, don't turn away! do look! I don't hate you. I'm not angry that you struck me. Have you never loved anybody in all your life, uncle? never? Ah! you must look once. I'm so wretched, you can't help pitying me.'\n'Keep your lizard's fingers off; and move away, or I'll kick you!' cried Heathcliff, brutally repulsing her. 'I'd rather be hugged by a snake. How the devil can you dream of fawning on me? I detest you!' He shook himself, as if his flesh crept; and thrust back his chair. I opened my mouth to abuse him; but was silenced by a threat.\nIt was growing dark - we heard voices at the garden-gate. Our host hurried out instantly: after two or three minutes, he returned alone.\n'I thought it had been your cousin Hareton,' I observed to Catherine. 'I wish he would arrive! He might take our part.'\n'It was three servants sent to seek you from the Grange,' said Heathcliff, overhearing me. 'You should have called through the window; but that chit is glad you didn't. She's glad to be obliged to stay, I'm certain.'\nAt learning the chance we had missed, we both wept; and he allowed us to wail on till nine o'clock. Then he bid us go upstairs to Zillah's chamber; and I whispered to my companion to obey: thinking perhaps we might get through the window there, or out by the garret skylight. The window, however, was too narrow, and the garret was locked.\nWe neither of us lay down. Catherine waited by the window, and watched anxiously for morning; a deep sigh being her only answer when I begged her to rest. I sat in a chair, and rocked to and fro, passing harsh judgment on myself; for, that dismal night, I thought Heathcliff himself less guilty than I.\nAt seven o'clock he came for Catherine. She ran to the door immediately, and he pulled her out. When I rose to follow, he turned the lock again. I demanded my release.\n'Be patient,' he replied; 'I'll send up your breakfast in a while.'\nI thumped on the panels, and rattled the latch angrily. He told me I must endure it another hour, and then went away. I endured it two or three hours, until at length, I heard a footstep: not Heathcliff's.\n'I've brought you something to eat,' said a voice; 'open t' door!'\nIt was Hareton, laden with food. 'Take it,' he added, thrusting the tray into my hand, and retired, ignoring my prayers.\nI remained enclosed the whole day, and the whole of the next night; and another, and another. Five nights and four days I remained, seeing nobody but Hareton; and he was a model jailor: surly, and dumb, and deaf to every appeal to his compassion.",
        "paragraph_chars": [
            [
                0,
                200
            ],
            [
                200,
                674
            ],
            [
                674,
                917
            ],
            [
                917,
                1212
            ],
            [
                1212,
                1374
            ],
            [
                1374,
                1483
            ],
            [
                1483,
                1682
            ],
            [
                1682,
                1769
            ],
            [
                1769,
                1872
            ],
            [
                1872,
                2017
            ],
            [
                2017,
                2300
            ],
            [
                2300,
                2426
            ],
            [
                2426,
                2737
            ],
            [
                2737,
                2915
            ],
            [
                2915,
                3246
            ],
            [
                3246,
                3343
            ],
            [
                3343,
                3433
            ],
            [
                3433,
                3785
            ],
            [
                3785,
                3956
            ],
            [
                3956,
                4054
            ],
            [
                4054,
                4103
            ],
            [
                4103,
                4127
            ],
            [
                4127,
                4425
            ],
            [
                4425,
                4594
            ],
            [
                4594,
                4736
            ],
            [
                4736,
                4935
            ],
            [
                4935,
                5072
            ],
            [
                5072,
                5274
            ],
            [
                5274,
                5519
            ],
            [
                5519,
                5636
            ],
            [
                5636,
                5691
            ],
            [
                5691,
                5826
            ],
            [
                5826,
                5920
            ],
            [
                5920,
                6036
            ],
            [
                6036,
                6261
            ],
            [
                6261,
                6487
            ],
            [
                6487,
                6515
            ],
            [
                6515,
                7061
            ],
            [
                7061,
                7148
            ],
            [
                7148,
                7368
            ],
            [
                7368,
                7634
            ],
            [
                7634,
                7742
            ],
            [
                7742,
                7823
            ],
            [
                7823,
                8175
            ],
            [
                8175,
                8404
            ],
            [
                8404,
                8632
            ],
            [
                8632,
                8979
            ],
            [
                8979,
                9363
            ],
            [
                9363,
                9479
            ],
            [
                9479,
                9660
            ],
            [
                9660,
                9781
            ],
            [
                9781,
                9908
            ],
            [
                9908,
                10130
            ],
            [
                10130,
                10445
            ],
            [
                10445,
                10759
            ],
            [
                10759,
                11123
            ],
            [
                11123,
                11243
            ],
            [
                11243,
                11336
            ],
            [
                11336,
                11528
            ],
            [
                11528,
                11882
            ],
            [
                11882,
                12237
            ],
            [
                12237,
                12595
            ],
            [
                12595,
                12888
            ],
            [
                12888,
                12964
            ],
            [
                12964,
                13399
            ],
            [
                13399,
                13555
            ],
            [
                13555,
                14453
            ],
            [
                14453,
                14580
            ],
            [
                14580,
                14737
            ],
            [
                14737,
                15259
            ],
            [
                15259,
                15593
            ],
            [
                15593,
                15730
            ],
            [
                15730,
                15850
            ],
            [
                15850,
                16067
            ],
            [
                16067,
                16407
            ],
            [
                16407,
                16710
            ],
            [
                16710,
                16878
            ],
            [
                16878,
                16946
            ],
            [
                16946,
                17152
            ],
            [
                17152,
                17219
            ],
            [
                17219,
                17340
            ],
            [
                17340,
                17586
            ]
        ],
        "segment_chars": [
            [
                0,
                64
            ],
            [
                64,
                200
            ],
            [
                200,
                268
            ],
            [
                268,
                369
            ],
            [
                369,
                464
            ],
            [
                464,
                674
            ],
            [
                674,
                834
            ],
            [
                834,
                917
            ],
            [
                917,
                1075
            ],
            [
                1075,
                1212
            ],
            [
                1212,
                1265
            ],
            [
                1265,
                1374
            ],
            [
                1374,
                1388
            ],
            [
                1388,
                1423
            ],
            [
                1423,
                1453
            ],
            [
                1453,
                1483
            ],
            [
                1483,
                1531
            ],
            [
                1531,
                1548
            ],
            [
                1548,
                1682
            ],
            [
                1682,
                1769
            ],
            [
                1769,
                1872
            ],
            [
                1872,
                1906
            ],
            [
                1906,
                1919
            ],
            [
                1919,
                1981
            ],
            [
                1981,
                2017
            ],
            [
                2017,
                2029
            ],
            [
                2029,
                2059
            ],
            [
                2059,
                2071
            ],
            [
                2071,
                2123
            ],
            [
                2123,
                2161
            ],
            [
                2161,
                2195
            ],
            [
                2195,
                2244
            ],
            [
                2244,
                2300
            ],
            [
                2300,
                2426
            ],
            [
                2426,
                2432
            ],
            [
                2432,
                2462
            ],
            [
                2462,
                2513
            ],
            [
                2513,
                2550
            ],
            [
                2550,
                2624
            ],
            [
                2624,
                2645
            ],
            [
                2645,
                2674
            ],
            [
                2674,
                2737
            ],
            [
                2737,
                2809
            ],
            [
                2809,
                2915
            ],
            [
                2915,
                2934
            ],
            [
                2934,
                2945
            ],
            [
                2945,
                2955
            ],
            [
                2955,
                3009
            ],
            [
                3009,
                3061
            ],
            [
                3061,
                3104
            ],
            [
                3104,
                3165
            ],
            [
                3165,
                3246
            ],
            [
                3246,
                3325
            ],
            [
                3325,
                3343
            ],
            [
                3343,
                3355
            ],
            [
                3355,
                3433
            ],
            [
                3433,
                3515
            ],
            [
                3515,
                3632
            ],
            [
                3632,
                3785
            ],
            [
                3785,
                3820
            ],
            [
                3820,
                3833
            ],
            [
                3833,
                3956
            ],
            [
                3956,
                3993
            ],
            [
                3993,
                4054
            ],
            [
                4054,
                4093
            ],
            [
                4093,
                4103
            ],
            [
                4103,
                4127
            ],
            [
                4127,
                4280
            ],
            [
                4280,
                4287
            ],
            [
                4287,
                4330
            ],
            [
                4330,
                4376
            ],
            [
                4376,
                4425
            ],
            [
                4425,
                4434
            ],
            [
                4434,
                4488
            ],
            [
                4488,
                4594
            ],
            [
                4594,
                4647
            ],
            [
                4647,
                4677
            ],
            [
                4677,
                4689
            ],
            [
                4689,
                4718
            ],
            [
                4718,
                4736
            ],
            [
                4736,
                4775
            ],
            [
                4775,
                4862
            ],
            [
                4862,
                4935
            ],
            [
                4935,
                4993
            ],
            [
                4993,
                5054
            ],
            [
                5054,
                5072
            ],
            [
                5072,
                5101
            ],
            [
                5101,
                5140
            ],
            [
                5140,
                5165
            ],
            [
                5165,
                5227
            ],
            [
                5227,
                5231
            ],
            [
                5231,
                5274
            ],
            [
                5274,
                5325
            ],
            [
                5325,
                5364
            ],
            [
                5364,
                5443
            ],
            [
                5443,
                5490
            ],
            [
                5490,
                5519
            ],
            [
                5519,
                5534
            ],
            [
                5534,
                5612
            ],
            [
                5612,
                5636
            ],
            [
                5636,
                5682
            ],
            [
                5682,
                5691
            ],
            [
                5691,
                5699
            ],
            [
                5699,
                5717
            ],
            [
                5717,
                5754
            ],
            [
                5754,
                5826
            ],
            [
                5826,
                5845
            ],
            [
                5845,
                5920
            ],
            [
                5920,
                5993
            ],
            [
                5993,
                6015
            ],
            [
                6015,
                6036
            ],
            [
                6036,
                6160
            ],
            [
                6160,
                6182
            ],
            [
                6182,
                6261
            ],
            [
                6261,
                6287
            ],
            [
                6287,
                6487
            ],
            [
                6487,
                6515
            ],
            [
                6515,
                6566
            ],
            [
                6566,
                6730
            ],
            [
                6730,
                6842
            ],
            [
                6842,
                6862
            ],
            [
                6862,
                6931
            ],
            [
                6931,
                7061
            ],
            [
                7061,
                7134
            ],
            [
                7134,
                7148
            ],
            [
                7148,
                7174
            ],
            [
                7174,
                7195
            ],
            [
                7195,
                7270
            ],
            [
                7270,
                7306
            ],
            [
                7306,
                7316
            ],
            [
                7316,
                7368
            ],
            [
                7368,
                7404
            ],
            [
                7404,
                7526
            ],
            [
                7526,
                7634
            ],
            [
                7634,
                7742
            ],
            [
                7742,
                7823
            ],
            [
                7823,
                7837
            ],
            [
                7837,
                7968
            ],
            [
                7968,
                8022
            ],
            [
                8022,
                8175
            ],
            [
                8175,
                8230
            ],
            [
                8230,
                8245
            ],
            [
                8245,
                8261
            ],
            [
                8261,
                8404
            ],
            [
                8404,
                8439
            ],
            [
                8439,
                8544
            ],
            [
                8544,
                8632
            ],
            [
                8632,
                8703
            ],
            [
                8703,
                8744
            ],
            [
                8744,
                8857
            ],
            [
                8857,
                8979
            ],
            [
                8979,
                9084
            ],
            [
                9084,
                9246
            ],
            [
                9246,
                9324
            ],
            [
                9324,
                9363
            ],
            [
                9363,
                9400
            ],
            [
                9400,
                9443
            ],
            [
                9443,
                9479
            ],
            [
                9479,
                9548
            ],
            [
                9548,
                9660
            ],
            [
                9660,
                9781
            ],
            [
                9781,
                9827
            ],
            [
                9827,
                9908
            ],
            [
                9908,
                9941
            ],
            [
                9941,
                9975
            ],
            [
                9975,
                9981
            ],
            [
                9981,
                9996
            ],
            [
                9996,
                10031
            ],
            [
                10031,
                10092
            ],
            [
                10092,
                10112
            ],
            [
                10112,
                10130
            ],
            [
                10130,
                10187
            ],
            [
                10187,
                10284
            ],
            [
                10284,
                10445
            ],
            [
                10445,
                10508
            ],
            [
                10508,
                10759
            ],
            [
                10759,
                10800
            ],
            [
                10800,
                10813
            ],
            [
                10813,
                10825
            ],
            [
                10825,
                10942
            ],
            [
                10942,
                11044
            ],
            [
                11044,
                11123
            ],
            [
                11123,
                11185
            ],
            [
                11185,
                11243
            ],
            [
                11243,
                11260
            ],
            [
                11260,
                11290
            ],
            [
                11290,
                11336
            ],
            [
                11336,
                11392
            ],
            [
                11392,
                11468
            ],
            [
                11468,
                11491
            ],
            [
                11491,
                11528
            ],
            [
                11528,
                11606
            ],
            [
                11606,
                11623
            ],
            [
                11623,
                11644
            ],
            [
                11644,
                11673
            ],
            [
                11673,
                11723
            ],
            [
                11723,
                11733
            ],
            [
                11733,
                11763
            ],
            [
                11763,
                11882
            ],
            [
                11882,
                11923
            ],
            [
                11923,
                11932
            ],
            [
                11932,
                11950
            ],
            [
                11950,
                11977
            ],
            [
                11977,
                12057
            ],
            [
                12057,
                12072
            ],
            [
                12072,
                12129
            ],
            [
                12129,
                12135
            ],
            [
                12135,
                12177
            ],
            [
                12177,
                12214
            ],
            [
                12214,
                12237
            ],
            [
                12237,
                12313
            ],
            [
                12313,
                12404
            ],
            [
                12404,
                12470
            ],
            [
                12470,
                12507
            ],
            [
                12507,
                12536
            ],
            [
                12536,
                12595
            ],
            [
                12595,
                12752
            ],
            [
                12752,
                12818
            ],
            [
                12818,
                12888
            ],
            [
                12888,
                12926
            ],
            [
                12926,
                12964
            ],
            [
                12964,
                12975
            ],
            [
                12975,
                12993
            ],
            [
                12993,
                13017
            ],
            [
                13017,
                13141
            ],
            [
                13141,
                13277
            ],
            [
                13277,
                13399
            ],
            [
                13399,
                13446
            ],
            [
                13446,
                13485
            ],
            [
                13485,
                13512
            ],
            [
                13512,
                13523
            ],
            [
                13523,
                13555
            ],
            [
                13555,
                13564
            ],
            [
                13564,
                13663
            ],
            [
                13663,
                13729
            ],
            [
                13729,
                13790
            ],
            [
                13790,
                13908
            ],
            [
                13908,
                13922
            ],
            [
                13922,
                13940
            ],
            [
                13940,
                13954
            ],
            [
                13954,
                13965
            ],
            [
                13965,
                14055
            ],
            [
                14055,
                14100
            ],
            [
                14100,
                14167
            ],
            [
                14167,
                14266
            ],
            [
                14266,
                14358
            ],
            [
                14358,
                14453
            ],
            [
                14453,
                14475
            ],
            [
                14475,
                14580
            ],
            [
                14580,
                14700
            ],
            [
                14700,
                14737
            ],
            [
                14737,
                14817
            ],
            [
                14817,
                14877
            ],
            [
                14877,
                14976
            ],
            [
                14976,
                15047
            ],
            [
                15047,
                15068
            ],
            [
                15068,
                15077
            ],
            [
                15077,
                15095
            ],
            [
                15095,
                15129
            ],
            [
                15129,
                15183
            ],
            [
                15183,
                15190
            ],
            [
                15190,
                15194
            ],
            [
                15194,
                15214
            ],
            [
                15214,
                15259
            ],
            [
                15259,
                15326
            ],
            [
                15326,
                15368
            ],
            [
                15368,
                15402
            ],
            [
                15402,
                15448
            ],
            [
                15448,
                15463
            ],
            [
                15463,
                15531
            ],
            [
                15531,
                15593
            ],
            [
                15593,
                15651
            ],
            [
                15651,
                15730
            ],
            [
                15730,
                15800
            ],
            [
                15800,
                15825
            ],
            [
                15825,
                15850
            ],
            [
                15850,
                15941
            ],
            [
                15941,
                16019
            ],
            [
                16019,
                16067
            ],
            [
                16067,
                16167
            ],
            [
                16167,
                16343
            ],
            [
                16343,
                16407
            ],
            [
                16407,
                16434
            ],
            [
                16434,
                16562
            ],
            [
                16562,
                16710
            ],
            [
                16710,
                16750
            ],
            [
                16750,
                16806
            ],
            [
                16806,
                16855
            ],
            [
                16855,
                16878
            ],
            [
                16878,
                16946
            ],
            [
                16946,
                17002
            ],
            [
                17002,
                17064
            ],
            [
                17064,
                17152
            ],
            [
                17152,
                17219
            ],
            [
                17219,
                17252
            ],
            [
                17252,
                17340
            ],
            [
                17340,
                17434
            ],
            [
                17434,
                17586
            ]
        ],
        "overlap_chars": [
            [
                3,
                6
            ],
            [
                12,
                22
            ],
            [
                23,
                43
            ],
            [
                62,
                64
            ],
            [
                64,
                73
            ],
            [
                93,
                100
            ],
            [
                100,
                101
            ],
            [
                106,
                141
            ],
            [
                145,
                148
            ],
            [
                163,
                199
            ],
            [
                200,
                241
            ],
            [
                242,
                266
            ],
            [
                268,
                269
            ],
            [
                270,
                292
            ],
            [
                298,
                319
            ],
            [
                320,
                330
            ],
            [
                333,
                340
            ],
            [
                341,
                369
            ],
            [
                369,
                397
            ],
            [
                402,
                409
            ],
            [
                416,
                464
            ],
            [
                468,
                472
            ],
            [
                478,
                491
            ],
            [
                491,
                538
            ],
            [
                547,
                579
            ],
            [
                579,
                674
            ],
            [
                674,
                693
            ],
            [
                693,
                731
            ],
            [
                737,
                799
            ],
            [
                806,
                834
            ],
            [
                834,
                835
            ],
            [
                852,
                861
            ],
            [
                861,
                862
            ],
            [
                869,
                874
            ],
            [
                888,
                915
            ],
            [
                915,
                917
            ],
            [
                917,
                919
            ],
            [
                931,
                1028
            ],
            [
                1038,
                1041
            ],
            [
                1047,
                1075
            ],
            [
                1075,
                1121
            ],
            [
                1130,
                1210
            ],
            [
                1210,
                1212
            ],
            [
                1212,
                1214
            ],
            [
                1221,
                1253
            ],
            [
                1257,
                1265
            ],
            [
                1265,
                1267
            ],
            [
                1268,
                1302
            ],
            [
                1303,
                1307
            ],
            [
                1312,
                1334
            ],
            [
                1335,
                1338
            ],
            [
                1338,
                1339
            ],
            [
                1340,
                1346
            ],
            [
                1346,
                1374
            ],
            [
                1375,
                1385
            ],
            [
                1388,
                1405
            ],
            [
                1406,
                1423
            ],
            [
                1424,
                1453
            ],
            [
                1453,
                1480
            ],
            [
                1484,
                1528
            ],
            [
                1531,
                1546
            ],
            [
                1546,
                1547
            ],
            [
                1549,
                1621
            ],
            [
                1622,
                1679
            ],
            [
                1682,
                1723
            ],
            [
                1724,
                1747
            ],
            [
                1748,
                1751
            ],
            [
                1759,
                1767
            ],
            [
                1767,
                1769
            ],
            [
                1773,
                1779
            ],
            [
                1780,
                1782
            ],
            [
                1783,
                1791
            ],
            [
                1794,
                1803
            ],
            [
                1805,
                1837
            ],
            [
                1837,
                1847
            ],
            [
                1848,
                1854
            ],
            [
                1867,
                1869
            ],
            [
                1873,
                1903
            ],
            [
                1906,
                1917
            ],
            [
                1924,
                1930
            ],
            [
                1934,
                1979
            ],
            [
                1979,
                1981
            ],
            [
                1981,
                1995
            ],
            [
                2012,
                2014
            ],
            [
                2018,
                2026
            ],
            [
                2029,
                2059
            ],
            [
                2066,
                2071
            ],
            [
                2071,
                2082
            ],
            [
                2083,
                2123
            ],
            [
                2123,
                2143
            ],
            [
                2144,
                2161
            ],
            [
                2171,
                2174
            ],
            [
                2180,
                2182
            ],
            [
                2183,
                2193
            ],
            [
                2193,
                2195
            ],
            [
                2195,
                2244
            ],
            [
                2244,
                2291
            ],
            [
                2292,
                2297
            ],
            [
                2300,
                2304
            ],
            [
                2307,
                2367
            ],
            [
                2381,
                2417
            ],
            [
                2418,
                2426
            ],
            [
                2427,
                2429
            ],
            [
                2432,
                2442
            ],
            [
                2444,
                2462
            ],
            [
                2462,
                2486
            ],
            [
                2486,
                2513
            ],
            [
                2513,
                2550
            ],
            [
                2550,
                2554
            ],
            [
                2555,
                2622
            ],
            [
                2622,
                2624
            ],
            [
                2624,
                2645
            ],
            [
                2645,
                2674
            ],
            [
                2674,
                2689
            ],
            [
                2690,
                2694
            ],
            [
                2695,
                2734
            ],
            [
                2737,
                2809
            ],
            [
                2809,
                2915
            ],
            [
                2916,
                2931
            ],
            [
                2934,
                2945
            ],
            [
                2949,
                2953
            ],
            [
                2955,
                3009
            ],
            [
                3009,
                3016
            ],
            [
                3016,
                3029
            ],
            [
                3030,
                3061
            ],
            [
                3061,
                3104
            ],
            [
                3104,
                3165
            ],
            [
                3165,
                3194
            ],
            [
                3194,
                3243
            ],
            [
                3247,
                3274
            ],
            [
                3277,
                3292
            ],
            [
                3294,
                3325
            ],
            [
                3325,
                3326
            ],
            [
                3332,
                3340
            ],
            [
                3344,
                3352
            ],
            [
                3355,
                3396
            ],
            [
                3398,
                3414
            ],
            [
                3414,
                3430
            ],
            [
                3433,
                3460
            ],
            [
                3461,
                3515
            ],
            [
                3515,
                3520
            ],
            [
                3531,
                3557
            ],
            [
                3558,
                3580
            ],
            [
                3580,
                3616
            ],
            [
                3617,
                3630
            ],
            [
                3630,
                3632
            ],
            [
                3632,
                3685
            ],
            [
                3686,
                3699
            ],
            [
                3700,
                3704
            ],
            [
                3705,
                3735
            ],
            [
                3736,
                3775
            ],
            [
                3776,
                3785
            ],
            [
                3786,
                3811
            ],
            [
                3811,
                3818
            ],
            [
                3818,
                3820
            ],
            [
                3820,
                3833
            ],
            [
                3833,
                3848
            ],
            [
                3851,
                3877
            ],
            [
                3879,
                3953
            ],
            [
                3957,
                3979
            ],
            [
                3982,
                3991
            ],
            [
                3991,
                3993
            ],
            [
                3994,
                4051
            ],
            [
                4055,
                4090
            ],
            [
                4093,
                4103
            ],
            [
                4104,
                4116
            ],
            [
                4119,
                4127
            ],
            [
                4128,
                4135
            ],
            [
                4138,
                4184
            ],
            [
                4186,
                4194
            ],
            [
                4195,
                4280
            ],
            [
                4280,
                4287
            ],
            [
                4287,
                4330
            ],
            [
                4330,
                4331
            ],
            [
                4332,
                4335
            ],
            [
                4336,
                4376
            ],
            [
                4376,
                4422
            ],
            [
                4426,
                4434
            ],
            [
                4434,
                4473
            ],
            [
                4476,
                4488
            ],
            [
                4489,
                4501
            ],
            [
                4502,
                4526
            ],
            [
                4527,
                4591
            ],
            [
                4595,
                4623
            ],
            [
                4626,
                4647
            ],
            [
                4648,
                4674
            ],
            [
                4677,
                4689
            ],
            [
                4693,
                4716
            ],
            [
                4718,
                4733
            ],
            [
                4736,
                4751
            ],
            [
                4757,
                4759
            ],
            [
                4760,
                4773
            ],
            [
                4773,
                4775
            ],
            [
                4775,
                4811
            ],
            [
                4819,
                4827
            ],
            [
                4827,
                4832
            ],
            [
                4833,
                4862
            ],
            [
                4862,
                4935
            ],
            [
                4936,
                4939
            ],
            [
                4942,
                4972
            ],
            [
                4974,
                4991
            ],
            [
                4993,
                5043
            ],
            [
                5049,
                5054
            ],
            [
                5054,
                5069
            ],
            [
                5073,
                5087
            ],
            [
                5090,
                5101
            ],
            [
                5102,
                5140
            ],
            [
                5140,
                5163
            ],
            [
                5163,
                5165
            ],
            [
                5165,
                5227
            ],
            [
                5227,
                5231
            ],
            [
                5231,
                5271
            ],
            [
                5280,
                5284
            ],
            [
                5287,
                5303
            ],
            [
                5305,
                5325
            ],
            [
                5325,
                5362
            ],
            [
                5362,
                5364
            ],
            [
                5364,
                5443
            ],
            [
                5443,
                5490
            ],
            [
                5490,
                5516
            ],
            [
                5520,
                5531
            ],
            [
                5534,
                5554
            ],
            [
                5556,
                5612
            ],
            [
                5612,
                5633
            ],
            [
                5637,
                5640
            ],
            [
                5641,
                5644
            ],
            [
                5645,
                5647
            ],
            [
                5648,
                5667
            ],
            [
                5668,
                5679
            ],
            [
                5682,
                5684
            ],
            [
                5689,
                5690
            ],
            [
                5699,
                5717
            ],
            [
                5718,
                5743
            ],
            [
                5744,
                5754
            ],
            [
                5754,
                5823
            ],
            [
                5834,
                5845
            ],
            [
                5846,
                5881
            ],
            [
                5882,
                5886
            ],
            [
                5890,
                5917
            ],
            [
                5921,
                5973
            ],
            [
                5976,
                5991
            ],
            [
                5991,
                5993
            ],
            [
                5994,
                6015
            ],
            [
                6030,
                6033
            ],
            [
                6036,
                6049
            ],
            [
                6050,
                6053
            ],
            [
                6058,
                6067
            ],
            [
                6067,
                6105
            ],
            [
                6111,
                6116
            ],
            [
                6129,
                6158
            ],
            [
                6158,
                6160
            ],
            [
                6160,
                6173
            ],
            [
                6180,
                6182
            ],
            [
                6182,
                6184
            ],
            [
                6217,
                6222
            ],
            [
                6222,
                6227
            ],
            [
                6228,
                6234
            ],
            [
                6235,
                6259
            ],
            [
                6259,
                6260
            ],
            [
                6261,
                6285
            ],
            [
                6287,
                6306
            ],
            [
                6307,
                6310
            ],
            [
                6323,
                6345
            ],
            [
                6345,
                6397
            ],
            [
                6397,
                6398
            ],
            [
                6405,
                6406
            ],
            [
                6407,
                6437
            ],
            [
                6443,
                6484
            ],
            [
                6487,
                6514
            ],
            [
                6516,
                6553
            ],
            [
                6556,
                6566
            ],
            [
                6567,
                6634
            ],
            [
                6640,
                6641
            ],
            [
                6646,
                6649
            ],
            [
                6649,
                6728
            ],
            [
                6728,
                6730
            ],
            [
                6730,
                6760
            ],
            [
                6761,
                6767
            ],
            [
                6767,
                6841
            ],
            [
                6842,
                6862
            ],
            [
                6862,
                6870
            ],
            [
                6875,
                6881
            ],
            [
                6882,
                6883
            ],
            [
                6897,
                6931
            ],
            [
                6931,
                6973
            ],
            [
                6973,
                7058
            ],
            [
                7061,
                7122
            ],
            [
                7125,
                7134
            ],
            [
                7134,
                7145
            ],
            [
                7149,
                7171
            ],
            [
                7174,
                7193
            ],
            [
                7193,
                7195
            ],
            [
                7195,
                7215
            ],
            [
                7217,
                7270
            ],
            [
                7271,
                7303
            ],
            [
                7306,
                7316
            ],
            [
                7317,
                7365
            ],
            [
                7368,
                7402
            ],
            [
                7402,
                7404
            ],
            [
                7404,
                7416
            ],
            [
                7417,
                7421
            ],
            [
                7422,
                7470
            ],
            [
                7471,
                7483
            ],
            [
                7484,
                7526
            ],
            [
                7526,
                7545
            ],
            [
                7549,
                7594
            ],
            [
                7595,
                7607
            ],
            [
                7608,
                7634
            ],
            [
                7635,
                7656
            ],
            [
                7659,
                7667
            ],
            [
                7669,
                7710
            ],
            [
                7711,
                7739
            ],
            [
                7742,
                7822
            ],
            [
                7824,
                7826
            ],
            [
                7827,
                7831
            ],
            [
                7832,
                7834
            ],
            [
                7837,
                7850
            ],
            [
                7858,
                7860
            ],
            [
                7866,
                7882
            ],
            [
                7883,
                7958
            ],
            [
                7959,
                7968
            ],
            [
                7968,
                7992
            ],
            [
                8001,
                8020
            ],
            [
                8020,
                8022
            ],
            [
                8027,
                8036
            ],
            [
                8037,
                8048
            ],
            [
                8049,
                8058
            ],
            [
                8059,
                8062
            ],
            [
                8070,
                8073
            ],
            [
                8085,
                8088
            ],
            [
                8092,
                8107
            ],
            [
                8108,
                8111
            ],
            [
                8117,
                8120
            ],
            [
                8121,
                8173
            ],
            [
                8173,
                8175
            ],
            [
                8175,
                8230
            ],
            [
                8231,
                8242
            ],
            [
                8245,
                8259
            ],
            [
                8261,
                8338
            ],
            [
                8339,
                8363
            ],
            [
                8363,
                8364
            ],
            [
                8373,
                8378
            ],
            [
                8379,
                8403
            ],
            [
                8404,
                8437
            ],
            [
                8439,
                8467
            ],
            [
                8468,
                8480
            ],
            [
                8485,
                8486
            ],
            [
                8487,
                8544
            ],
            [
                8544,
                8632
            ],
            [
                8633,
                8673
            ],
            [
                8676,
                8694
            ],
            [
                8695,
                8701
            ],
            [
                8701,
                8703
            ],
            [
                8704,
                8721
            ],
            [
                8722,
                8744
            ],
            [
                8744,
                8767
            ],
            [
                8777,
                8857
            ],
            [
                8857,
                8966
            ],
            [
                8971,
                8976
            ],
            [
                8979,
                9005
            ],
            [
                9009,
                9084
            ],
            [
                9084,
                9246
            ],
            [
                9246,
                9301
            ],
            [
                9302,
                9324
            ],
            [
                9324,
                9363
            ],
            [
                9364,
                9378
            ],
            [
                9391,
                9400
            ],
            [
                9401,
                9443
            ],
            [
                9443,
                9476
            ],
            [
                9479,
                9548
            ],
            [
                9548,
                9587
            ],
            [
                9594,
                9595
            ],
            [
                9600,
                9611
            ],
            [
                9612,
                9660
            ],
            [
                9668,
                9674
            ],
            [
                9677,
                9685
            ],
            [
                9687,
                9778
            ],
            [
                9782,
                9808
            ],
            [
                9811,
                9827
            ],
            [
                9828,
                9905
            ],
            [
                9909,
                9925
            ],
            [
                9928,
                9939
            ],
            [
                9941,
                9959
            ],
            [
                9962,
                9975
            ],
            [
                9977,
                9980
            ],
            [
                9981,
                9996
            ],
            [
                9996,
                10031
            ],
            [
                10031,
                10092
            ],
            [
                10092,
                10112
            ],
            [
                10112,
                10127
            ],
            [
                10130,
                10154
            ],
            [
                10159,
                10187
            ],
            [
                10187,
                10284
            ],
            [
                10288,
                10295
            ],
            [
                10296,
                10299
            ],
            [
                10300,
                10319
            ],
            [
                10320,
                10382
            ],
            [
                10383,
                10395
            ],
            [
                10399,
                10404
            ],
            [
                10405,
                10418
            ],
            [
                10423,
                10437
            ],
            [
                10438,
                10445
            ],
            [
                10446,
                10473
            ],
            [
                10476,
                10489
            ],
            [
                10490,
                10502
            ],
            [
                10506,
                10508
            ],
            [
                10509,
                10756
            ],
            [
                10765,
                10797
            ],
            [
                10800,
                10813
            ],
            [
                10814,
                10817
            ],
            [
                10818,
                10825
            ],
            [
                10825,
                10879
            ],
            [
                10880,
                10942
            ],
            [
                10942,
                10975
            ],
            [
                10976,
                11008
            ],
            [
                11009,
                11042
            ],
            [
                11042,
                11044
            ],
            [
                11044,
                11050
            ],
            [
                11051,
                11073
            ],
            [
                11073,
                11083
            ],
            [
                11084,
                11120
            ],
            [
                11123,
                11183
            ],
            [
                11185,
                11187
            ],
            [
                11196,
                11243
            ],
            [
                11249,
                11260
            ],
            [
                11260,
                11262
            ],
            [
                11265,
                11282
            ],
            [
                11283,
                11290
            ],
            [
                11291,
                11322
            ],
            [
                11326,
                11333
            ],
            [
                11344,
                11392
            ],
            [
                11392,
                11413
            ],
            [
                11414,
                11434
            ],
            [
                11436,
                11468
            ],
            [
                11468,
                11491
            ],
            [
                11491,
                11494
            ],
            [
                11495,
                11499
            ],
            [
                11500,
                11520
            ],
            [
                11521,
                11525
            ],
            [
                11529,
                11547
            ],
            [
                11550,
                11562
            ],
            [
                11564,
                11606
            ],
            [
                11606,
                11623
            ],
            [
                11623,
                11644
            ],
            [
                11644,
                11673
            ],
            [
                11673,
                11723
            ],
            [
                11723,
                11733
            ],
            [
                11733,
                11760
            ],
            [
                11763,
                11793
            ],
            [
                11794,
                11834
            ],
            [
                11839,
                11842
            ],
            [
                11850,
                11853
            ],
            [
                11859,
                11882
            ],
            [
                11883,
                11887
            ],
            [
                11895,
                11911
            ],
            [
                11914,
                11921
            ],
            [
                11924,
                11932
            ],
            [
                11932,
                11950
            ],
            [
                11950,
                11977
            ],
            [
                11977,
                12034
            ],
            [
                12035,
                12057
            ],
            [
                12057,
                12072
            ],
            [
                12072,
                12092
            ],
            [
                12100,
                12129
            ],
            [
                12129,
                12135
            ],
            [
                12135,
                12177
            ],
            [
                12177,
                12214
            ],
            [
                12214,
                12218
            ],
            [
                12223,
                12234
            ],
            [
                12237,
                12239
            ],
            [
                12245,
                12270
            ],
            [
                12270,
                12271
            ],
            [
                12272,
                12275
            ],
            [
                12291,
                12292
            ],
            [
                12304,
                12311
            ],
            [
                12311,
                12313
            ],
            [
                12313,
                12323
            ],
            [
                12331,
                12334
            ],
            [
                12345,
                12404
            ],
            [
                12404,
                12424
            ],
            [
                12425,
                12438
            ],
            [
                12447,
                12468
            ],
            [
                12468,
                12470
            ],
            [
                12470,
                12500
            ],
            [
                12500,
                12501
            ],
            [
                12503,
                12507
            ],
            [
                12510,
                12536
            ],
            [
                12536,
                12592
            ],
            [
                12596,
                12597
            ],
            [
                12598,
                12600
            ],
            [
                12601,
                12611
            ],
            [
                12614,
                12626
            ],
            [
                12628,
                12692
            ],
            [
                12698,
                12719
            ],
            [
                12722,
                12739
            ],
            [
                12740,
                12742
            ],
            [
                12743,
                12752
            ],
            [
                12752,
                12818
            ],
            [
                12818,
                12878
            ],
            [
                12879,
                12885
            ],
            [
                12889,
                12914
            ],
            [
                12917,
                12926
            ],
            [
                12932,
                12961
            ],
            [
                12968,
                12972
            ],
            [
                12975,
                12993
            ],
            [
                12993,
                12995
            ],
            [
                12997,
                13011
            ],
            [
                13012,
                13015
            ],
            [
                13015,
                13016
            ],
            [
                13017,
                13141
            ],
            [
                13141,
                13250
            ],
            [
                13259,
                13261
            ],
            [
                13275,
                13277
            ],
            [
                13277,
                13391
            ],
            [
                13405,
                13443
            ],
            [
                13446,
                13485
            ],
            [
                13486,
                13488
            ],
            [
                13493,
                13495
            ],
            [
                13507,
                13512
            ],
            [
                13512,
                13523
            ],
            [
                13523,
                13552
            ],
            [
                13556,
                13564
            ],
            [
                13564,
                13612
            ],
            [
                13618,
                13629
            ],
            [
                13630,
                13639
            ],
            [
                13642,
                13663
            ],
            [
                13664,
                13699
            ],
            [
                13700,
                13727
            ],
            [
                13727,
                13729
            ],
            [
                13729,
                13790
            ],
            [
                13790,
                13865
            ],
            [
                13866,
                13868
            ],
            [
                13882,
                13888
            ],
            [
                13889,
                13891
            ],
            [
                13897,
                13908
            ],
            [
                13908,
                13922
            ],
            [
                13922,
                13940
            ],
            [
                13940,
                13954
            ],
            [
                13954,
                13965
            ],
            [
                13972,
                13974
            ],
            [
                13999,
                14023
            ],
            [
                14033,
                14035
            ],
            [
                14036,
                14040
            ],
            [
                14053,
                14055
            ],
            [
                14055,
                14076
            ],
            [
                14077,
                14100
            ],
            [
                14100,
                14141
            ],
            [
                14142,
                14146
            ],
            [
                14147,
                14150
            ],
            [
                14151,
                14165
            ],
            [
                14165,
                14167
            ],
            [
                14167,
                14235
            ],
            [
                14240,
                14252
            ],
            [
                14253,
                14266
            ],
            [
                14266,
                14352
            ],
            [
                14356,
                14358
            ],
            [
                14358,
                14408
            ],
            [
                14417,
                14436
            ],
            [
                14436,
                14450
            ],
            [
                14454,
                14472
            ],
            [
                14475,
                14482
            ],
            [
                14484,
                14488
            ],
            [
                14489,
                14499
            ],
            [
                14500,
                14523
            ],
            [
                14523,
                14524
            ],
            [
                14525,
                14528
            ],
            [
                14529,
                14573
            ],
            [
                14589,
                14591
            ],
            [
                14599,
                14602
            ],
            [
                14605,
                14617
            ],
            [
                14619,
                14653
            ],
            [
                14653,
                14654
            ],
            [
                14655,
                14675
            ],
            [
                14675,
                14700
            ],
            [
                14700,
                14705
            ],
            [
                14711,
                14719
            ],
            [
                14720,
                14729
            ],
            [
                14730,
                14734
            ],
            [
                14738,
                14759
            ],
            [
                14764,
                14768
            ],
            [
                14771,
                14785
            ],
            [
                14785,
                14786
            ],
            [
                14788,
                14799
            ],
            [
                14805,
                14817
            ],
            [
                14817,
                14875
            ],
            [
                14875,
                14877
            ],
            [
                14877,
                14976
            ],
            [
                14976,
                15000
            ],
            [
                15001,
                15020
            ],
            [
                15021,
                15047
            ],
            [
                15047,
                15068
            ],
            [
                15068,
                15075
            ],
            [
                15075,
                15077
            ],
            [
                15077,
                15095
            ],
            [
                15095,
                15129
            ],
            [
                15129,
                15149
            ],
            [
                15158,
                15183
            ],
            [
                15183,
                15188
            ],
            [
                15188,
                15190
            ],
            [
                15190,
                15194
            ],
            [
                15194,
                15214
            ],
            [
                15214,
                15245
            ],
            [
                15246,
                15256
            ],
            [
                15260,
                15269
            ],
            [
                15276,
                15300
            ],
            [
                15305,
                15323
            ],
            [
                15326,
                15368
            ],
            [
                15369,
                15402
            ],
            [
                15402,
                15448
            ],
            [
                15448,
                15449
            ],
            [
                15450,
                15456
            ],
            [
                15457,
                15460
            ],
            [
                15463,
                15465
            ],
            [
                15466,
                15479
            ],
            [
                15479,
                15502
            ],
            [
                15502,
                15529
            ],
            [
                15529,
                15530
            ],
            [
                15531,
                15532
            ],
            [
                15533,
                15548
            ],
            [
                15549,
                15551
            ],
            [
                15552,
                15557
            ],
            [
                15561,
                15562
            ],
            [
                15563,
                15566
            ],
            [
                15567,
                15570
            ],
            [
                15580,
                15591
            ],
            [
                15591,
                15592
            ],
            [
                15593,
                15623
            ],
            [
                15624,
                15651
            ],
            [
                15651,
                15682
            ],
            [
                15689,
                15710
            ],
            [
                15711,
                15730
            ],
            [
                15731,
                15772
            ],
            [
                15775,
                15800
            ],
            [
                15801,
                15825
            ],
            [
                15825,
                15847
            ],
            [
                15851,
                15905
            ],
            [
                15908,
                15941
            ],
            [
                15942,
                15957
            ],
            [
                15958,
                15964
            ],
            [
                15985,
                15988
            ],
            [
                15989,
                16019
            ],
            [
                16019,
                16064
            ],
            [
                16067,
                16112
            ],
            [
                16117,
                16167
            ],
            [
                16167,
                16193
            ],
            [
                16194,
                16230
            ],
            [
                16231,
                16233
            ],
            [
                16234,
                16255
            ],
            [
                16265,
                16281
            ],
            [
                16282,
                16314
            ],
            [
                16315,
                16321
            ],
            [
                16322,
                16325
            ],
            [
                16326,
                16332
            ],
            [
                16333,
                16343
            ],
            [
                16343,
                16367
            ],
            [
                16372,
                16378
            ],
            [
                16378,
                16394
            ],
            [
                16395,
                16398
            ],
            [
                16405,
                16406
            ],
            [
                16407,
                16432
            ],
            [
                16434,
                16443
            ],
            [
                16451,
                16457
            ],
            [
                16464,
                16518
            ],
            [
                16519,
                16522
            ],
            [
                16523,
                16534
            ],
            [
                16540,
                16541
            ],
            [
                16553,
                16562
            ],
            [
                16562,
                16563
            ],
            [
                16568,
                16628
            ],
            [
                16629,
                16635
            ],
            [
                16635,
                16636
            ],
            [
                16640,
                16659
            ],
            [
                16659,
                16660
            ],
            [
                16661,
                16710
            ],
            [
                16710,
                16734
            ],
            [
                16748,
                16750
            ],
            [
                16750,
                16786
            ],
            [
                16787,
                16789
            ],
            [
                16797,
                16806
            ],
            [
                16811,
                16828
            ],
            [
                16829,
                16855
            ],
            [
                16855,
                16878
            ],
            [
                16879,
                16889
            ],
            [
                16892,
                16903
            ],
            [
                16905,
                16943
            ],
            [
                16946,
                17000
            ],
            [
                17002,
                17004
            ],
            [
                17013,
                17019
            ],
            [
                17020,
                17047
            ],
            [
                17053,
                17064
            ],
            [
                17064,
                17095
            ],
            [
                17103,
                17152
            ],
            [
                17153,
                17186
            ],
            [
                17189,
                17202
            ],
            [
                17209,
                17216
            ],
            [
                17226,
                17250
            ],
            [
                17250,
                17251
            ],
            [
                17258,
                17260
            ],
            [
                17263,
                17304
            ],
            [
                17304,
                17318
            ],
            [
                17331,
                17338
            ],
            [
                17338,
                17340
            ],
            [
                17340,
                17434
            ],
            [
                17434,
                17471
            ],
            [
                17472,
                17497
            ],
            [
                17497,
                17517
            ],
            [
                17518,
                17560
            ],
            [
                17571,
                17574
            ],
            [
                17575,
                17586
            ]
        ],
        "row_chars": [
            [
                0,
                64
            ],
            [
                64,
                64
            ],
            [
                64,
                200
            ],
            [
                200,
                369
            ],
            [
                369,
                464
            ],
            [
                464,
                674
            ],
            [
                674,
                834
            ],
            [
                834,
                917
            ],
            [
                917,
                1075
            ],
            [
                1075,
                1212
            ],
            [
                1212,
                1265
            ],
            [
                1265,
                1265
            ],
            [
                1265,
                1374
            ],
            [
                1374,
                1388
            ],
            [
                1388,
                1423
            ],
            [
                1423,
                1453
            ],
            [
                1453,
                1483
            ],
            [
                1483,
                1548
            ],
            [
                1548,
                1682
            ],
            [
                1682,
                1769
            ],
            [
                1769,
                1872
            ],
            [
                1872,
                1872
            ],
            [
                1872,
                1872
            ],
            [
                1872,
                1919
            ],
            [
                1919,
                1981
            ],
            [
                1981,
                2017
            ],
            [
                2017,
                2029
            ],
            [
                2029,
                2059
            ],
            [
                2059,
                2071
            ],
            [
                2071,
                2071
            ],
            [
                2071,
                2123
            ],
            [
                2123,
                2123
            ],
            [
                2123,
                2123
            ],
            [
                2123,
                2161
            ],
            [
                2161,
                2195
            ],
            [
                2195,
                2244
            ],
            [
                2244,
                2300
            ],
            [
                2300,
                2426
            ],
            [
                2426,
                2432
            ],
            [
                2432,
                2462
            ],
            [
                2462,
                2513
            ],
            [
                2513,
                2550
            ],
            [
                2550,
                2624
            ],
            [
                2624,
                2645
            ],
            [
                2645,
                2674
            ],
            [
                2674,
                2737
            ],
            [
                2737,
                2809
            ],
            [
                2809,
                2915
            ],
            [
                2915,
                2934
            ],
            [
                2934,
                2945
            ],
            [
                2945,
                2955
            ],
            [
                2955,
                3009
            ],
            [
                3009,
                3009
            ],
            [
                3009,
                3061
            ],
            [
                3061,
                3104
            ],
            [
                3104,
                3165
            ],
            [
                3165,
                3246
            ],
            [
                3246,
                3325
            ],
            [
                3325,
                3343
            ],
            [
                3343,
                3355
            ],
            [
                3355,
                3433
            ],
            [
                3433,
                3515
            ],
            [
                3515,
                3632
            ],
            [
                3632,
                3785
            ],
            [
                3785,
                3820
            ],
            [
                3820,
                3833
            ],
            [
                3833,
                3956
            ],
            [
                3956,
                3993
            ],
            [
                3993,
                4054
            ],
            [
                4054,
                4093
            ],
            [
                4093,
                4103
            ],
            [
                4103,
                4127
            ],
            [
                4127,
                4280
            ],
            [
                4280,
                4287
            ],
            [
                4287,
                4330
            ],
            [
                4330,
                4376
            ],
            [
                4376,
                4425
            ],
            [
                4425,
                4434
            ],
            [
                4434,
                4488
            ],
            [
                4488,
                4594
            ],
            [
                4594,
                4647
            ],
            [
                4647,
                4677
            ],
            [
                4677,
                4677
            ],
            [
                4677,
                4689
            ],
            [
                4689,
                4736
            ],
            [
                4736,
                4775
            ],
            [
                4775,
                4862
            ],
            [
                4862,
                4935
            ],
            [
                4935,
                5054
            ],
            [
                5054,
                5072
            ],
            [
                5072,
                5101
            ],
            [
                5101,
                5140
            ],
            [
                5140,
                5165
            ],
            [
                5165,
                5227
            ],
            [
                5227,
                5231
            ],
            [
                5231,
                5274
            ],
            [
                5274,
                5325
            ],
            [
                5325,
                5364
            ],
            [
                5364,
                5443
            ],
            [
                5443,
                5490
            ],
            [
                5490,
                5519
            ],
            [
                5519,
                5534
            ],
            [
                5534,
                5612
            ],
            [
                5612,
                5636
            ],
            [
                5636,
                5691
            ],
            [
                5691,
                5699
            ],
            [
                5699,
                5717
            ],
            [
                5717,
                5754
            ],
            [
                5754,
                5826
            ],
            [
                5826,
                5845
            ],
            [
                5845,
                5920
            ],
            [
                5920,
                5993
            ],
            [
                5993,
                6015
            ],
            [
                6015,
                6036
            ],
            [
                6036,
                6160
            ],
            [
                6160,
                6182
            ],
            [
                6182,
                6261
            ],
            [
                6261,
                6487
            ],
            [
                6487,
                6515
            ],
            [
                6515,
                6515
            ],
            [
                6515,
                6566
            ],
            [
                6566,
                6566
            ],
            [
                6566,
                6730
            ],
            [
                6730,
                6842
            ],
            [
                6842,
                6862
            ],
            [
                6862,
                6931
            ],
            [
                6931,
                7061
            ],
            [
                7061,
                7134
            ],
            [
                7134,
                7148
            ],
            [
                7148,
                7174
            ],
            [
                7174,
                7195
            ],
            [
                7195,
                7270
            ],
            [
                7270,
                7306
            ],
            [
                7306,
                7316
            ],
            [
                7316,
                7368
            ],
            [
                7368,
                7404
            ],
            [
                7404,
                7526
            ],
            [
                7526,
                7634
            ],
            [
                7634,
                7742
            ],
            [
                7742,
                7823
            ],
            [
                7823,
                7837
            ],
            [
                7837,
                7968
            ],
            [
                7968,
                8022
            ],
            [
                8022,
                8175
            ],
            [
                8175,
                8230
            ],
            [
                8230,
                8245
            ],
            [
                8245,
                8261
            ],
            [
                8261,
                8404
            ],
            [
                8404,
                8544
            ],
            [
                8544,
                8632
            ],
            [
                8632,
                8703
            ],
            [
                8703,
                8744
            ],
            [
                8744,
                8857
            ],
            [
                8857,
                8979
            ],
            [
                8979,
                9084
            ],
            [
                9084,
                9246
            ],
            [
                9246,
                9324
            ],
            [
                9324,
                9324
            ],
            [
                9324,
                9363
            ],
            [
                9363,
                9400
            ],
            [
                9400,
                9400
            ],
            [
                9400,
                9443
            ],
            [
                9443,
                9479
            ],
            [
                9479,
                9548
            ],
            [
                9548,
                9660
            ],
            [
                9660,
                9781
            ],
            [
                9781,
                9827
            ],
            [
                9827,
                9908
            ],
            [
                9908,
                9975
            ],
            [
                9975,
                9996
            ],
            [
                9996,
                10031
            ],
            [
                10031,
                10092
            ],
            [
                10092,
                10112
            ],
            [
                10112,
                10130
            ],
            [
                10130,
                10187
            ],
            [
                10187,
                10284
            ],
            [
                10284,
                10445
            ],
            [
                10445,
                10508
            ],
            [
                10508,
                10759
            ],
            [
                10759,
                10800
            ],
            [
                10800,
                10813
            ],
            [
                10813,
                10825
            ],
            [
                10825,
                10825
            ],
            [
                10825,
                10825
            ],
            [
                10825,
                10942
            ],
            [
                10942,
                10942
            ],
            [
                10942,
                11044
            ],
            [
                11044,
                11123
            ],
            [
                11123,
                11243
            ],
            [
                11243,
                11260
            ],
            [
                11260,
                11290
            ],
            [
                11290,
                11336
            ],
            [
                11336,
                11392
            ],
            [
                11392,
                11468
            ],
            [
                11468,
                11468
            ],
            [
                11468,
                11491
            ],
            [
                11491,
                11491
            ],
            [
                11491,
                11528
            ],
            [
                11528,
                11606
            ],
            [
                11606,
                11623
            ],
            [
                11623,
                11644
            ],
            [
                11644,
                11673
            ],
            [
                11673,
                11723
            ],
            [
                11723,
                11733
            ],
            [
                11733,
                11763
            ],
            [
                11763,
                11763
            ],
            [
                11763,
                11882
            ],
            [
                11882,
                11932
            ],
            [
                11932,
                11950
            ],
            [
                11950,
                11950
            ],
            [
                11950,
                11977
            ],
            [
                11977,
                12057
            ],
            [
                12057,
                12057
            ],
            [
                12057,
                12057
            ],
            [
                12057,
                12072
            ],
            [
                12072,
                12129
            ],
            [
                12129,
                12135
            ],
            [
                12135,
                12135
            ],
            [
                12135,
                12177
            ],
            [
                12177,
                12214
            ],
            [
                12214,
                12237
            ],
            [
                12237,
                12313
            ],
            [
                12313,
                12404
            ],
            [
                12404,
                12470
            ],
            [
                12470,
                12507
            ],
            [
                12507,
                12536
            ],
            [
                12536,
                12595
            ],
            [
                12595,
                12752
            ],
            [
                12752,
                12818
            ],
            [
                12818,
                12888
            ],
            [
                12888,
                12926
            ],
            [
                12926,
                12964
            ],
            [
                12964,
                12964
            ],
            [
                12964,
                12964
            ],
            [
                12964,
                12975
            ],
            [
                12975,
                12993
            ],
            [
                12993,
                13017
            ],
            [
                13017,
                13141
            ],
            [
                13141,
                13277
            ],
            [
                13277,
                13399
            ],
            [
                13399,
                13446
            ],
            [
                13446,
                13485
            ],
            [
                13485,
                13512
            ],
            [
                13512,
                13523
            ],
            [
                13523,
                13555
            ],
            [
                13555,
                13555
            ],
            [
                13555,
                13564
            ],
            [
                13564,
                13663
            ],
            [
                13663,
                13663
            ],
            [
                13663,
                13729
            ],
            [
                13729,
                13790
            ],
            [
                13790,
                13908
            ],
            [
                13908,
                13922
            ],
            [
                13922,
                13940
            ],
            [
                13940,
                13954
            ],
            [
                13954,
                13965
            ],
            [
                13965,
                14055
            ],
            [
                14055,
                14100
            ],
            [
                14100,
                14167
            ],
            [
                14167,
                14167
            ],
            [
                14167,
                14266
            ],
            [
                14266,
                14358
            ],
            [
                14358,
                14453
            ],
            [
                14453,
                14475
            ],
            [
                14475,
                14580
            ],
            [
                14580,
                14700
            ],
            [
                14700,
                14737
            ],
            [
                14737,
                14737
            ],
            [
                14737,
                14817
            ],
            [
                14817,
                14877
            ],
            [
                14877,
                14976
            ],
            [
                14976,
                15047
            ],
            [
                15047,
                15068
            ],
            [
                15068,
                15077
            ],
            [
                15077,
                15077
            ],
            [
                15077,
                15095
            ],
            [
                15095,
                15129
            ],
            [
                15129,
                15183
            ],
            [
                15183,
                15190
            ],
            [
                15190,
                15194
            ],
            [
                15194,
                15214
            ],
            [
                15214,
                15259
            ],
            [
                15259,
                15326
            ],
            [
                15326,
                15368
            ],
            [
                15368,
                15402
            ],
            [
                15402,
                15448
            ],
            [
                15448,
                15463
            ],
            [
                15463,
                15593
            ],
            [
                15593,
                15651
            ],
            [
                15651,
                15730
            ],
            [
                15730,
                15800
            ],
            [
                15800,
                15825
            ],
            [
                15825,
                15850
            ],
            [
                15850,
                15941
            ],
            [
                15941,
                16019
            ],
            [
                16019,
                16067
            ],
            [
                16067,
                16167
            ],
            [
                16167,
                16343
            ],
            [
                16343,
                16407
            ],
            [
                16407,
                16562
            ],
            [
                16562,
                16710
            ],
            [
                16710,
                16750
            ],
            [
                16750,
                16806
            ],
            [
                16806,
                16855
            ],
            [
                16855,
                16878
            ],
            [
                16878,
                16946
            ],
            [
                16946,
                17002
            ],
            [
                17002,
                17064
            ],
            [
                17064,
                17152
            ],
            [
                17152,
                17219
            ],
            [
                17219,
                17252
            ],
            [
                17252,
                17340
            ],
            [
                17340,
                17434
            ],
            [
                17434,
                17586
            ]
        ]
    }
}