{
    "original": {
        "text": "On the fifth morning, or rather afternoon, a different step approached-lighter and shorter; and, this time, the person entered the room. It was Zillah; donned in her scarlet shawl, with a black silk bonnet on her head, and a willow-basket swung to her arm.\n\"Eh, dear! Mrs. Dean!\" she exclaimed. \"Well! there is a talk about you at Gimmerton. I never thought but you were sunk in the Blackhorse marsh, and missy with you, till master told me you'd been found, and he'd lodged you here! What! and you must have got on an island, sure? And how long were you in the hole? Did master save you, Mrs. Dean? But you're not so thin-you've not been so poorly, have you?\"\n\"Your master is a true scoundrel!\" I replied. \"But he shall answer for it. He needn't have raised that tale: it shall all be laid bare!\"\n\"What do you mean?\" asked Zillah. \"It's not his tale: they tell that in the village-about your being lost in the marsh; and I calls to Earnshaw, when I come in-'Eh, they's queer things, Mr. Hareton, happened since I went off. It's a sad pity of that likely young lass, and cant Nelly Dean.' He stared. I thought he had not heard aught, so I told him the rumour. The master listened, and he just smiled to himself, and said, 'If they have been in the marsh, they are out now, Zillah. Nelly Dean is lodged, at this minute, in your room. You can tell her to flit, when you go up; here is the key. The bog-water got into her head, and she would have run home quite flighty; but I fixed her till she came round to her senses. You can bid her go to the Grange at once, if she be able, and carry a message from me, that her young lady will follow in time to attend the squire's funeral.'\"\n\"Mr. Edgar is not dead?\" I gasped. \"Oh! Zillah, Zillah!\"\n\"No, no; sit you down, my good mistress,\" she replied; \"you're right sickly yet. He's not dead; Doctor Kenneth thinks he may last another day. I met him on the road and asked.\"\nInstead of sitting down, I snatched my outdoor things, and hastened below, for the way was free. On entering the house, I looked about for some one to give information of Catherine. The place was filled with sunshine, and the door stood wide open; but nobody seemed at hand. As I hesitated whether to go off at once, or return and seek my mistress, a slight cough drew my attention to the hearth. Linton lay on the settle, sole tenant, sucking a stick of sugar-candy, and pursuing my movements with apathetic eyes. \"Where is Miss Catherine?\" I demanded sternly, supposing I could frighten him into giving intelligence, by catching him thus, alone. He sucked on like an innocent.\n\"Is she gone?\" I said.\n\"No,\" he replied; \"she's upstairs: she's not to go; we won't let her.\"\n\"You won't let her, little idiot!\" I exclaimed. \"Direct me to her room immediately, or I'll make you sing out sharply.\"\n\"Papa would make you sing out, if you attempted to get there,\" he answered. \"He says I'm not to be soft with Catherine: she's my wife, and it's shameful that she should wish to leave me. He says she hates me and wants me to die, that she may have my money; but she shan't have it: and she shan't go home! She never shall!-she may cry, and be sick as much as she pleases!\"\nHe resumed his former occupation, closing his lids, as if he meant to drop asleep.\n\"Master Heathcliff,\" I resumed, \"have you forgotten all Catherine's kindness to you last winter, when you affirmed you loved her, and when she brought you books and sung you songs, and came many a time through wind and snow to see you? She wept to miss one evening, because you would be disappointed; and you felt then that she was a hundred times too good to you: and now you believe the lies your father tells, though you know he detests you both. And you join him against her. That's fine gratitude, is it not?\"\nThe corner of Linton's mouth fell, and he took the sugar-candy from his lips.\n\"Did she come to Wuthering Heights because she hated you?\" I continued. \"Think for yourself! As to your money, she does not even know that you will have any. And you say she's sick; and yet you leave her alone, up there in a strange house! You who have felt what it is to be so neglected! You could pity your own sufferings; and she pitied them, too; but you won't pity hers! I shed tears, Master Heathcliff, you see-an elderly woman, and a servant merely-and you, after pretending such affection, and having reason to worship her almost, store every tear you have for yourself, and lie there quite at ease. Ah! you're a heartless, selfish boy!\"\n\"I can't stay with her,\" he answered crossly. \"I'll not stay by myself. She cries so I can't bear it. And she won't give over, though I say I'll call my father. I did call him once, and he threatened to strangle her if she was not quiet; but she began again the instant he left the room, moaning and grieving all night long, though I screamed for vexation that I couldn't sleep.\"\n\"Is Mr. Heathcliff out?\" I inquired, perceiving that the wretched creature had no power to sympathize with his cousin's mental tortures.\n\"He's in the court,\" he replied, \"talking to Doctor Kenneth; who says uncle is dying, truly, at last. I'm glad, for I shall be master of the Grange after him. Catherine always spoke of it as her house. It isn't hers! It's mine: papa says everything she has is mine. All her nice books are mine; she offered to give me them, and her pretty birds, and her pony Minny, if I would get the key of our room, and let her out; but I told her she had nothing to give, they were all, all mine. And then she cried, and took a little picture from her neck, and said I should have that; two pictures in a gold case, on one side her mother, and on the other uncle, when they were young. That was yesterday-I said they were mine, too; and tried to get them from her. The spiteful thing wouldn't let me: she pushed me off, and hurt me. I shrieked out-that frightens her-she heard papa coming, and she broke the hinges and divided the case, and gave me her mother's portrait; the other she attempted to hide: but papa asked what was the matter, and I explained it. He took the one I had away, and ordered her to resign hers to me; she refused, and he-he struck her down, and wrenched it off the chain, and crushed it with his foot.\"\n\"And were you pleased to see her struck?\" I asked: having my designs in encouraging his talk.\n\"I winked,\" he answered: \"I wink to see my father strike a dog or a horse, he does it so hard. Yet I was glad at first-she deserved punishing for pushing me: but when papa was gone, she made me come to the window and showed me her cheek cut on the inside, against her teeth, and her mouth filling with blood; and then she gathered up the bits of the picture, and went and sat down with her face to the wall, and she has never spoken to me since: and I sometimes think she can't speak for pain. I don't like to think so; but she's a naughty thing for crying continually; and she looks so pale and wild, I'm afraid of her.\"\n\"And you can get the key if you choose?\" I said.\n\"Yes, when I am upstairs,\" he answered; \"but I can't walk upstairs now.\"\n\"In what apartment is it?\" I asked.\n\"Oh,\" he cried, \"I shan't tell _you_ where it is. It is our secret. Nobody, neither Hareton nor Zillah, is to know. There! you've tired me-go away, go away!\" And he turned his face on to his arm, and shut his eyes again.\nI considered it best to depart without seeing Mr. Heathcliff, and bring a rescue for my young lady from the Grange. On reaching it, the astonishment of my fellow-servants to see me, and their joy also, was intense; and when they heard that their little mistress was safe, two or three were about to hurry up and shout the news at Mr. Edgar's door: but I bespoke the announcement of it myself. How changed I found him, even in those few days! He lay an image of sadness and resignation awaiting his death. Very young he looked: though his actual age was thirty-nine, one would have called him ten years younger, at least. He thought of Catherine; for he murmured her name. I touched his hand, and spoke.\n\"Catherine is coming, dear master!\" I whispered; \"she is alive and well; and will be here, I hope, to-night.\"\nI trembled at the first effects of this intelligence: he half rose up, looked eagerly round the apartment, and then sank back in a swoon. As soon as he recovered, I related our compulsory visit, and detention at the Heights. I said Heathcliff forced me to go in: which was not quite true. I uttered as little as possible against Linton; nor did I describe all his father's brutal conduct-my intentions being to add no bitterness, if I could help it, to his already over-flowing cup.\nHe divined that one of his enemy's purposes was to secure the personal property, as well as the estate, to his son: or rather himself; yet why he did not wait till his decease was a puzzle to my master, because ignorant how nearly he and his nephew would quit the world together. However, he felt that his will had better be altered: instead of leaving Catherine's fortune at her own disposal, he determined to put it in the hands of trustees for her use during life, and for her children, if she had any, after her. By that means, it could not fall to Mr. Heathcliff should Linton die.\nHaving received his orders, I despatched a man to fetch the attorney, and four more, provided with serviceable weapons, to demand my young lady of her jailor. Both parties were delayed very late. The single servant returned first. He said Mr. Green, the lawyer, was out when he arrived at his house, and he had to wait two hours for his re-entrance; and then Mr. Green told him he had a little business in the village that must be done; but he would be at Thrushcross Grange before morning. The four men came back unaccompanied also. They brought word that Catherine was ill: too ill to quit her room; and Heathcliff would not suffer them to see her. I scolded the stupid fellows well for listening to that tale, which I would not carry to my master; resolving to take a whole bevy up to the Heights, at day-light, and storm it literally, unless the prisoner were quietly surrendered to us. Her father _shall_ see her, I vowed, and vowed again, if that devil be killed on his own doorstones in trying to prevent it!\nHappily, I was spared the journey and the trouble. I had gone downstairs at three o'clock to fetch a jug of water; and was passing through the hall with it in my hand, when a sharp knock at the front door made me jump. \"Oh! it is Green,\" I said, recollecting myself-\"only Green,\" and I went on, intending to send somebody else to open it; but the knock was repeated: not loud, and still importunately. I put the jug on the banister and hastened to admit him myself. The harvest moon shone clear outside. It was not the attorney. My own sweet little mistress sprang on my neck sobbing, \"Ellen, Ellen! Is papa alive?\"\n\"Yes,\" I cried: \"yes, my angel, he is, God be thanked, you are safe with us again!\"\nShe wanted to run, breathless as she was, upstairs to Mr. Linton's room; but I compelled her to sit down on a chair, and made her drink, and washed her pale face, chafing it into a faint colour with my apron. Then I said I must go first, and tell of her arrival; imploring her to say, she should be happy with young Heathcliff. She stared, but soon comprehending why I counselled her to utter the falsehood, she assured me she would not complain.\nI couldn't abide to be present at their meeting. I stood outside the chamber-door a quarter of an hour, and hardly ventured near the bed, then. All was composed, however: Catherine's despair was as silent as her father's joy. She supported him calmly, in appearance; and he fixed on her features his raised eyes that seemed dilating with ecstasy.\nHe died blissfully, Mr. Lockwood: he died so. Kissing her cheek, he murmured,-\"I am going to her; and you, darling child, shall come to us!\" and never stirred or spoke again; but continued that rapt, radiant gaze, till his pulse imperceptibly stopped and his soul departed. None could have noticed the exact minute of his death, it was so entirely without a struggle.\nWhether Catherine had spent her tears, or whether the grief were too weighty to let them flow, she sat there dry-eyed till the sun rose: she sat till noon, and would still have remained brooding over that deathbed, but I insisted on her coming away and taking some repose. It was well I succeeded in removing her, for at dinner-time appeared the lawyer, having called at Wuthering Heights to get his instructions how to behave. He had sold himself to Mr. Heathcliff: that was the cause of his delay in obeying my master's summons. Fortunately, no thought of worldly affairs crossed the latter's mind, to disturb him, after his daughter's arrival.\nMr. Green took upon himself to order everything and everybody about the place. He gave all the servants but me, notice to quit. He would have carried his delegated authority to the point of insisting that Edgar Linton should not be buried beside his wife, but in the chapel, with his family. There was the will, however, to hinder that, and my loud protestations against any infringement of its directions. The funeral was hurried over; Catherine, Mrs. Linton Heathcliff now, was suffered to stay at the Grange till her father's corpse had quitted it.\nShe told me that her anguish had at last spurred Linton to incur the risk of liberating her. She heard the men I sent disputing at the door, and she gathered the sense of Heathcliff's answer. It drove her desperate. Linton who had been conveyed up to the little parlour soon after I left, was terrified into fetching the key before his father re-ascended. He had the cunning to unlock and re-lock the door, without shutting it; and when he should have gone to bed, he begged to sleep with Hareton, and his petition was granted for once. Catherine stole out before break of day. She dared not try the doors lest the dogs should raise an alarm; she visited the empty chambers and examined their windows; and, luckily, lighting on her mother's, she got easily out of its lattice, and on to the ground, by means of the fir-tree close by. Her accomplice suffered for his share in the escape, notwithstanding his timid contrivances.",
        "paragraph_chars": [
            [
                0,
                257
            ],
            [
                257,
                661
            ],
            [
                661,
                798
            ],
            [
                798,
                1680
            ],
            [
                1680,
                1737
            ],
            [
                1737,
                1914
            ],
            [
                1914,
                2593
            ],
            [
                2593,
                2616
            ],
            [
                2616,
                2687
            ],
            [
                2687,
                2807
            ],
            [
                2807,
                3179
            ],
            [
                3179,
                3262
            ],
            [
                3262,
                3777
            ],
            [
                3777,
                3855
            ],
            [
                3855,
                4501
            ],
            [
                4501,
                4881
            ],
            [
                4881,
                5018
            ],
            [
                5018,
                6234
            ],
            [
                6234,
                6328
            ],
            [
                6328,
                6950
            ],
            [
                6950,
                6999
            ],
            [
                6999,
                7072
            ],
            [
                7072,
                7108
            ],
            [
                7108,
                7329
            ],
            [
                7329,
                8032
            ],
            [
                8032,
                8142
            ],
            [
                8142,
                8625
            ],
            [
                8625,
                9212
            ],
            [
                9212,
                10228
            ],
            [
                10228,
                10844
            ],
            [
                10844,
                10928
            ],
            [
                10928,
                11375
            ],
            [
                11375,
                11722
            ],
            [
                11722,
                12090
            ],
            [
                12090,
                12737
            ],
            [
                12737,
                13289
            ],
            [
                13289,
                14215
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                257
            ],
            [
                257,
                268
            ],
            [
                268,
                280
            ],
            [
                280,
                295
            ],
            [
                295,
                302
            ],
            [
                302,
                342
            ],
            [
                342,
                485
            ],
            [
                485,
                491
            ],
            [
                491,
                533
            ],
            [
                533,
                568
            ],
            [
                568,
                600
            ],
            [
                600,
                661
            ],
            [
                661,
                696
            ],
            [
                696,
                707
            ],
            [
                707,
                736
            ],
            [
                736,
                798
            ],
            [
                798,
                818
            ],
            [
                818,
                832
            ],
            [
                832,
                1024
            ],
            [
                1024,
                1089
            ],
            [
                1089,
                1100
            ],
            [
                1100,
                1160
            ],
            [
                1160,
                1281
            ],
            [
                1281,
                1333
            ],
            [
                1333,
                1392
            ],
            [
                1392,
                1519
            ],
            [
                1519,
                1680
            ],
            [
                1680,
                1705
            ],
            [
                1705,
                1715
            ],
            [
                1715,
                1720
            ],
            [
                1720,
                1737
            ],
            [
                1737,
                1818
            ],
            [
                1818,
                1880
            ],
            [
                1880,
                1914
            ],
            [
                1914,
                2011
            ],
            [
                2011,
                2096
            ],
            [
                2096,
                2189
            ],
            [
                2189,
                2311
            ],
            [
                2311,
                2429
            ],
            [
                2429,
                2456
            ],
            [
                2456,
                2562
            ],
            [
                2562,
                2593
            ],
            [
                2593,
                2608
            ],
            [
                2608,
                2616
            ],
            [
                2616,
                2687
            ],
            [
                2687,
                2722
            ],
            [
                2722,
                2735
            ],
            [
                2735,
                2807
            ],
            [
                2807,
                2883
            ],
            [
                2883,
                2994
            ],
            [
                2994,
                3112
            ],
            [
                3112,
                3179
            ],
            [
                3179,
                3262
            ],
            [
                3262,
                3498
            ],
            [
                3498,
                3712
            ],
            [
                3712,
                3742
            ],
            [
                3742,
                3777
            ],
            [
                3777,
                3855
            ],
            [
                3855,
                3914
            ],
            [
                3914,
                3927
            ],
            [
                3927,
                3948
            ],
            [
                3948,
                4013
            ],
            [
                4013,
                4095
            ],
            [
                4095,
                4144
            ],
            [
                4144,
                4231
            ],
            [
                4231,
                4463
            ],
            [
                4463,
                4467
            ],
            [
                4467,
                4501
            ],
            [
                4501,
                4547
            ],
            [
                4547,
                4573
            ],
            [
                4573,
                4603
            ],
            [
                4603,
                4662
            ],
            [
                4662,
                4881
            ],
            [
                4881,
                4906
            ],
            [
                4906,
                5018
            ],
            [
                5018,
                5120
            ],
            [
                5120,
                5177
            ],
            [
                5177,
                5220
            ],
            [
                5220,
                5235
            ],
            [
                5235,
                5284
            ],
            [
                5284,
                5502
            ],
            [
                5502,
                5691
            ],
            [
                5691,
                5770
            ],
            [
                5770,
                5838
            ],
            [
                5838,
                6066
            ],
            [
                6066,
                6234
            ],
            [
                6234,
                6276
            ],
            [
                6276,
                6328
            ],
            [
                6328,
                6423
            ],
            [
                6423,
                6822
            ],
            [
                6822,
                6950
            ],
            [
                6950,
                6991
            ],
            [
                6991,
                6999
            ],
            [
                6999,
                7072
            ],
            [
                7072,
                7099
            ],
            [
                7099,
                7108
            ],
            [
                7108,
                7158
            ],
            [
                7158,
                7176
            ],
            [
                7176,
                7224
            ],
            [
                7224,
                7231
            ],
            [
                7231,
                7266
            ],
            [
                7266,
                7329
            ],
            [
                7329,
                7445
            ],
            [
                7445,
                7722
            ],
            [
                7722,
                7771
            ],
            [
                7771,
                7834
            ],
            [
                7834,
                7950
            ],
            [
                7950,
                8001
            ],
            [
                8001,
                8032
            ],
            [
                8032,
                8068
            ],
            [
                8068,
                8142
            ],
            [
                8142,
                8280
            ],
            [
                8280,
                8367
            ],
            [
                8367,
                8431
            ],
            [
                8431,
                8625
            ],
            [
                8625,
                8905
            ],
            [
                8905,
                9142
            ],
            [
                9142,
                9212
            ],
            [
                9212,
                9371
            ],
            [
                9371,
                9408
            ],
            [
                9408,
                9443
            ],
            [
                9443,
                9703
            ],
            [
                9703,
                9746
            ],
            [
                9746,
                9863
            ],
            [
                9863,
                10103
            ],
            [
                10103,
                10228
            ],
            [
                10228,
                10279
            ],
            [
                10279,
                10447
            ],
            [
                10447,
                10452
            ],
            [
                10452,
                10630
            ],
            [
                10630,
                10694
            ],
            [
                10694,
                10732
            ],
            [
                10732,
                10757
            ],
            [
                10757,
                10828
            ],
            [
                10828,
                10844
            ],
            [
                10844,
                10928
            ],
            [
                10928,
                11137
            ],
            [
                11137,
                11256
            ],
            [
                11256,
                11375
            ],
            [
                11375,
                11424
            ],
            [
                11424,
                11519
            ],
            [
                11519,
                11601
            ],
            [
                11601,
                11722
            ],
            [
                11722,
                11768
            ],
            [
                11768,
                11863
            ],
            [
                11863,
                11996
            ],
            [
                11996,
                12090
            ],
            [
                12090,
                12363
            ],
            [
                12363,
                12518
            ],
            [
                12518,
                12621
            ],
            [
                12621,
                12737
            ],
            [
                12737,
                12816
            ],
            [
                12816,
                12865
            ],
            [
                12865,
                13029
            ],
            [
                13029,
                13144
            ],
            [
                13144,
                13289
            ],
            [
                13289,
                13382
            ],
            [
                13382,
                13481
            ],
            [
                13481,
                13505
            ],
            [
                13505,
                13645
            ],
            [
                13645,
                13826
            ],
            [
                13826,
                13867
            ],
            [
                13867,
                14123
            ],
            [
                14123,
                14215
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                41,
                44
            ],
            [
                55,
                70
            ],
            [
                90,
                95
            ],
            [
                119,
                137
            ],
            [
                186,
                187
            ],
            [
                166,
                179
            ],
            [
                188,
                205
            ],
            [
                217,
                244
            ],
            [
                206,
                208
            ],
            [
                248,
                257
            ],
            [
                258,
                268
            ],
            [
                268,
                277
            ],
            [
                280,
                295
            ],
            [
                313,
                342
            ],
            [
                350,
                357
            ],
            [
                362,
                485
            ],
            [
                533,
                568
            ],
            [
                568,
                598
            ],
            [
                662,
                678
            ],
            [
                684,
                693
            ],
            [
                696,
                707
            ],
            [
                736,
                751
            ],
            [
                759,
                768
            ],
            [
                833,
                850
            ],
            [
                1022,
                1023
            ],
            [
                852,
                861
            ],
            [
                867,
                957
            ],
            [
                961,
                962
            ],
            [
                832,
                833
            ],
            [
                959,
                961
            ],
            [
                982,
                996
            ],
            [
                1024,
                1070
            ],
            [
                1076,
                1086
            ],
            [
                1089,
                1098
            ],
            [
                1132,
                1160
            ],
            [
                1160,
                1184
            ],
            [
                1193,
                1199
            ],
            [
                1210,
                1221
            ],
            [
                1223,
                1281
            ],
            [
                1281,
                1301
            ],
            [
                1319,
                1333
            ],
            [
                1333,
                1352
            ],
            [
                1357,
                1392
            ],
            [
                1392,
                1423
            ],
            [
                1466,
                1471
            ],
            [
                1429,
                1432
            ],
            [
                1504,
                1519
            ],
            [
                1527,
                1551
            ],
            [
                1575,
                1596
            ],
            [
                1606,
                1676
            ],
            [
                1683,
                1684
            ],
            [
                1685,
                1702
            ],
            [
                1705,
                1715
            ],
            [
                1716,
                1720
            ],
            [
                1720,
                1726
            ],
            [
                1738,
                1745
            ],
            [
                1818,
                1831
            ],
            [
                1779,
                1790
            ],
            [
                1816,
                1817
            ],
            [
                1878,
                1879
            ],
            [
                1840,
                1878
            ],
            [
                1939,
                1952
            ],
            [
                1961,
                1987
            ],
            [
                2009,
                2011
            ],
            [
                2136,
                2179
            ],
            [
                2212,
                2214
            ],
            [
                2130,
                2131
            ],
            [
                2263,
                2264
            ],
            [
                2272,
                2311
            ],
            [
                2311,
                2335
            ],
            [
                2348,
                2385
            ],
            [
                2408,
                2428
            ],
            [
                2430,
                2453
            ],
            [
                2456,
                2474
            ],
            [
                2560,
                2562
            ],
            [
                2594,
                2605
            ],
            [
                2617,
                2619
            ],
            [
                2622,
                2633
            ],
            [
                2635,
                2650
            ],
            [
                2668,
                2684
            ],
            [
                2664,
                2666
            ],
            [
                2688,
                2719
            ],
            [
                2722,
                2735
            ],
            [
                2743,
                2796
            ],
            [
                2808,
                2844
            ],
            [
                2862,
                2867
            ],
            [
                2870,
                2883
            ],
            [
                2884,
                2994
            ],
            [
                2994,
                3035
            ],
            [
                3036,
                3112
            ],
            [
                3129,
                3176
            ],
            [
                3179,
                3181
            ],
            [
                3190,
                3193
            ],
            [
                3226,
                3262
            ],
            [
                3270,
                3280
            ],
            [
                3283,
                3284
            ],
            [
                3292,
                3293
            ],
            [
                3295,
                3358
            ],
            [
                3396,
                3498
            ],
            [
                3498,
                3712
            ],
            [
                3712,
                3742
            ],
            [
                3742,
                3774
            ],
            [
                3791,
                3810
            ],
            [
                3810,
                3855
            ],
            [
                3860,
                3911
            ],
            [
                3914,
                3927
            ],
            [
                3946,
                3948
            ],
            [
                3948,
                4013
            ],
            [
                4017,
                4095
            ],
            [
                4184,
                4194
            ],
            [
                4159,
                4163
            ],
            [
                4168,
                4178
            ],
            [
                4199,
                4200
            ],
            [
                4206,
                4231
            ],
            [
                4320,
                4352
            ],
            [
                4264,
                4267
            ],
            [
                4394,
                4447
            ],
            [
                4454,
                4463
            ],
            [
                4463,
                4467
            ],
            [
                4467,
                4498
            ],
            [
                4502,
                4523
            ],
            [
                4526,
                4547
            ],
            [
                4577,
                4603
            ],
            [
                4603,
                4616
            ],
            [
                4626,
                4662
            ],
            [
                4662,
                4796
            ],
            [
                4810,
                4819
            ],
            [
                4824,
                4856
            ],
            [
                4862,
                4878
            ],
            [
                4882,
                4903
            ],
            [
                4906,
                4998
            ],
            [
                5016,
                5018
            ],
            [
                5019,
                5030
            ],
            [
                5039,
                5050
            ],
            [
                5052,
                5062
            ],
            [
                5070,
                5102
            ],
            [
                5111,
                5120
            ],
            [
                5120,
                5177
            ],
            [
                5177,
                5220
            ],
            [
                5220,
                5235
            ],
            [
                5235,
                5284
            ],
            [
                5313,
                5335
            ],
            [
                5284,
                5302
            ],
            [
                5340,
                5394
            ],
            [
                5424,
                5451
            ],
            [
                5477,
                5501
            ],
            [
                5511,
                5691
            ],
            [
                5710,
                5770
            ],
            [
                5770,
                5838
            ],
            [
                5838,
                5975
            ],
            [
                6064,
                6066
            ],
            [
                6074,
                6077
            ],
            [
                6082,
                6083
            ],
            [
                6066,
                6073
            ],
            [
                6092,
                6112
            ],
            [
                6120,
                6231
            ],
            [
                6235,
                6273
            ],
            [
                6276,
                6283
            ],
            [
                6326,
                6328
            ],
            [
                6329,
                6330
            ],
            [
                6340,
                6352
            ],
            [
                6354,
                6355
            ],
            [
                6361,
                6423
            ],
            [
                6423,
                6469
            ],
            [
                6484,
                6513
            ],
            [
                6545,
                6582
            ],
            [
                6601,
                6822
            ],
            [
                6852,
                6947
            ],
            [
                6951,
                6988
            ],
            [
                6991,
                6999
            ],
            [
                7000,
                7023
            ],
            [
                7026,
                7038
            ],
            [
                7040,
                7069
            ],
            [
                7073,
                7080
            ],
            [
                7091,
                7096
            ],
            [
                7099,
                7108
            ],
            [
                7109,
                7111
            ],
            [
                7114,
                7123
            ],
            [
                7125,
                7138
            ],
            [
                7140,
                7143
            ],
            [
                7156,
                7158
            ],
            [
                7176,
                7182
            ],
            [
                7212,
                7224
            ],
            [
                7231,
                7254
            ],
            [
                7266,
                7272
            ],
            [
                7308,
                7329
            ],
            [
                7329,
                7394
            ],
            [
                7395,
                7432
            ],
            [
                7437,
                7444
            ],
            [
                7445,
                7456
            ],
            [
                7647,
                7650
            ],
            [
                7459,
                7477
            ],
            [
                7511,
                7514
            ],
            [
                7521,
                7524
            ],
            [
                7478,
                7499
            ],
            [
                7531,
                7542
            ],
            [
                7720,
                7722
            ],
            [
                7722,
                7771
            ],
            [
                7771,
                7777
            ],
            [
                7778,
                7813
            ],
            [
                7814,
                7834
            ],
            [
                7979,
                7990
            ],
            [
                7964,
                7973
            ],
            [
                7995,
                7999
            ],
            [
                8001,
                8019
            ],
            [
                8030,
                8032
            ],
            [
                8033,
                8065
            ],
            [
                8068,
                8080
            ],
            [
                8082,
                8139
            ],
            [
                8142,
                8159
            ],
            [
                8166,
                8181
            ],
            [
                8194,
                8219
            ],
            [
                8228,
                8233
            ],
            [
                8220,
                8227
            ],
            [
                8247,
                8280
            ],
            [
                8291,
                8314
            ],
            [
                8354,
                8357
            ],
            [
                8315,
                8318
            ],
            [
                8330,
                8336
            ],
            [
                8374,
                8403
            ],
            [
                8429,
                8431
            ],
            [
                8431,
                8432
            ],
            [
                8441,
                8497
            ],
            [
                8502,
                8530
            ],
            [
                8550,
                8556
            ],
            [
                8560,
                8570
            ],
            [
                8592,
                8594
            ],
            [
                8599,
                8625
            ],
            [
                8625,
                8627
            ],
            [
                8636,
                8686
            ],
            [
                8696,
                8704
            ],
            [
                8717,
                8727
            ],
            [
                8729,
                8740
            ],
            [
                8760,
                8770
            ],
            [
                8771,
                8792
            ],
            [
                8801,
                8835
            ],
            [
                8836,
                8844
            ],
            [
                8845,
                8905
            ],
            [
                8905,
                8957
            ],
            [
                9017,
                9018
            ],
            [
                9033,
                9039
            ],
            [
                8978,
                8997
            ],
            [
                9043,
                9113
            ],
            [
                9131,
                9142
            ],
            [
                9157,
                9212
            ],
            [
                9240,
                9241
            ],
            [
                9253,
                9280
            ],
            [
                9282,
                9295
            ],
            [
                9238,
                9239
            ],
            [
                9306,
                9310
            ],
            [
                9323,
                9331
            ],
            [
                9332,
                9355
            ],
            [
                9359,
                9371
            ],
            [
                9371,
                9396
            ],
            [
                9406,
                9408
            ],
            [
                9408,
                9443
            ],
            [
                9443,
                9497
            ],
            [
                9510,
                9544
            ],
            [
                9560,
                9596
            ],
            [
                9606,
                9629
            ],
            [
                9647,
                9652
            ],
            [
                9630,
                9634
            ],
            [
                9653,
                9702
            ],
            [
                9703,
                9746
            ],
            [
                9746,
                9782
            ],
            [
                9788,
                9812
            ],
            [
                9814,
                9838
            ],
            [
                9846,
                9850
            ],
            [
                9854,
                9863
            ],
            [
                9863,
                9891
            ],
            [
                9897,
                9924
            ],
            [
                9973,
                9988
            ],
            [
                9994,
                10012
            ],
            [
                10027,
                10039
            ],
            [
                10051,
                10075
            ],
            [
                10084,
                10102
            ],
            [
                10228,
                10279
            ],
            [
                10301,
                10317
            ],
            [
                10394,
                10395
            ],
            [
                10401,
                10446
            ],
            [
                10448,
                10452
            ],
            [
                10452,
                10457
            ],
            [
                10495,
                10505
            ],
            [
                10466,
                10472
            ],
            [
                10565,
                10570
            ],
            [
                10732,
                10757
            ],
            [
                10757,
                10812
            ],
            [
                10814,
                10828
            ],
            [
                10828,
                10841
            ],
            [
                10845,
                10848
            ],
            [
                10851,
                10859
            ],
            [
                10861,
                10881
            ],
            [
                10883,
                10925
            ],
            [
                10928,
                10969
            ],
            [
                10979,
                11006
            ],
            [
                11049,
                11057
            ],
            [
                11024,
                11032
            ],
            [
                11063,
                11089
            ],
            [
                11135,
                11137
            ],
            [
                11137,
                11211
            ],
            [
                11213,
                11256
            ],
            [
                11336,
                11375
            ],
            [
                11375,
                11385
            ],
            [
                11392,
                11424
            ],
            [
                11424,
                11477
            ],
            [
                11517,
                11519
            ],
            [
                11519,
                11601
            ],
            [
                11601,
                11625
            ],
            [
                11640,
                11648
            ],
            [
                11658,
                11661
            ],
            [
                11708,
                11712
            ],
            [
                11682,
                11686
            ],
            [
                11713,
                11722
            ],
            [
                11722,
                11768
            ],
            [
                11768,
                11798
            ],
            [
                11801,
                11860
            ],
            [
                11867,
                11950
            ],
            [
                11965,
                11995
            ],
            [
                12098,
                12107
            ],
            [
                12189,
                12230
            ],
            [
                12235,
                12255
            ],
            [
                12262,
                12354
            ],
            [
                12361,
                12363
            ],
            [
                12408,
                12422
            ],
            [
                12402,
                12403
            ],
            [
                12432,
                12442
            ],
            [
                12423,
                12431
            ],
            [
                12442,
                12502
            ],
            [
                12516,
                12518
            ],
            [
                12518,
                12588
            ],
            [
                12619,
                12620
            ],
            [
                12737,
                12773
            ],
            [
                12789,
                12816
            ],
            [
                12816,
                12847
            ],
            [
                12849,
                12865
            ],
            [
                12865,
                12867
            ],
            [
                12911,
                12913
            ],
            [
                12937,
                13029
            ],
            [
                13029,
                13077
            ],
            [
                13142,
                13144
            ],
            [
                13144,
                13216
            ],
            [
                13226,
                13289
            ],
            [
                13289,
                13347
            ],
            [
                13354,
                13382
            ],
            [
                13645,
                13785
            ],
            [
                13824,
                13826
            ],
            [
                13826,
                13852
            ],
            [
                13865,
                13867
            ],
            [
                13867,
                13870
            ],
            [
                14046,
                14049
            ],
            [
                14039,
                14045
            ],
            [
                14064,
                14069
            ],
            [
                14035,
                14038
            ],
            [
                14073,
                14086
            ],
            [
                14088,
                14123
            ],
            [
                14123,
                14175
            ],
            [
                14192,
                14215
            ]
        ],
        "row_chars": [
            [
                0,
                137
            ],
            [
                137,
                257
            ],
            [
                257,
                268
            ],
            [
                268,
                280
            ],
            [
                280,
                295
            ],
            [
                295,
                302
            ],
            [
                302,
                342
            ],
            [
                342,
                485
            ],
            [
                485,
                491
            ],
            [
                491,
                533
            ],
            [
                533,
                568
            ],
            [
                568,
                600
            ],
            [
                600,
                661
            ],
            [
                661,
                696
            ],
            [
                696,
                707
            ],
            [
                707,
                736
            ],
            [
                736,
                798
            ],
            [
                798,
                818
            ],
            [
                818,
                832
            ],
            [
                832,
                1089
            ],
            [
                1089,
                1160
            ],
            [
                1160,
                1281
            ],
            [
                1281,
                1333
            ],
            [
                1333,
                1392
            ],
            [
                1392,
                1519
            ],
            [
                1519,
                1680
            ],
            [
                1680,
                1705
            ],
            [
                1705,
                1715
            ],
            [
                1715,
                1720
            ],
            [
                1720,
                1737
            ],
            [
                1737,
                1880
            ],
            [
                1880,
                1914
            ],
            [
                1914,
                2011
            ],
            [
                2011,
                2096
            ],
            [
                2096,
                2311
            ],
            [
                2311,
                2429
            ],
            [
                2429,
                2456
            ],
            [
                2456,
                2562
            ],
            [
                2562,
                2593
            ],
            [
                2593,
                2608
            ],
            [
                2608,
                2616
            ],
            [
                2616,
                2687
            ],
            [
                2687,
                2722
            ],
            [
                2722,
                2735
            ],
            [
                2735,
                2807
            ],
            [
                2807,
                2883
            ],
            [
                2883,
                2994
            ],
            [
                2994,
                3112
            ],
            [
                3112,
                3179
            ],
            [
                3179,
                3262
            ],
            [
                3262,
                3498
            ],
            [
                3498,
                3712
            ],
            [
                3712,
                3742
            ],
            [
                3742,
                3777
            ],
            [
                3777,
                3855
            ],
            [
                3855,
                3914
            ],
            [
                3914,
                3927
            ],
            [
                3927,
                3948
            ],
            [
                3948,
                4013
            ],
            [
                4013,
                4095
            ],
            [
                4095,
                4144
            ],
            [
                4144,
                4231
            ],
            [
                4231,
                4463
            ],
            [
                4463,
                4467
            ],
            [
                4467,
                4501
            ],
            [
                4501,
                4547
            ],
            [
                4547,
                4573
            ],
            [
                4573,
                4603
            ],
            [
                4603,
                4662
            ],
            [
                4662,
                4881
            ],
            [
                4881,
                4906
            ],
            [
                4906,
                5018
            ],
            [
                5018,
                5120
            ],
            [
                5120,
                5177
            ],
            [
                5177,
                5220
            ],
            [
                5220,
                5235
            ],
            [
                5235,
                5284
            ],
            [
                5284,
                5502
            ],
            [
                5502,
                5691
            ],
            [
                5691,
                5770
            ],
            [
                5770,
                5838
            ],
            [
                5838,
                6066
            ],
            [
                6066,
                6234
            ],
            [
                6234,
                6276
            ],
            [
                6276,
                6328
            ],
            [
                6328,
                6423
            ],
            [
                6423,
                6822
            ],
            [
                6822,
                6950
            ],
            [
                6950,
                6991
            ],
            [
                6991,
                6999
            ],
            [
                6999,
                7072
            ],
            [
                7072,
                7099
            ],
            [
                7099,
                7108
            ],
            [
                7108,
                7158
            ],
            [
                7158,
                7176
            ],
            [
                7176,
                7224
            ],
            [
                7224,
                7231
            ],
            [
                7231,
                7266
            ],
            [
                7266,
                7329
            ],
            [
                7329,
                7445
            ],
            [
                7445,
                7722
            ],
            [
                7722,
                7771
            ],
            [
                7771,
                7834
            ],
            [
                7834,
                7950
            ],
            [
                7950,
                8032
            ],
            [
                8032,
                8068
            ],
            [
                8068,
                8142
            ],
            [
                8142,
                8280
            ],
            [
                8280,
                8431
            ],
            [
                8431,
                8625
            ],
            [
                8625,
                8905
            ],
            [
                8905,
                9142
            ],
            [
                9142,
                9212
            ],
            [
                9212,
                9371
            ],
            [
                9371,
                9408
            ],
            [
                9408,
                9443
            ],
            [
                9443,
                9703
            ],
            [
                9703,
                9746
            ],
            [
                9746,
                9863
            ],
            [
                9863,
                10103
            ],
            [
                10103,
                10228
            ],
            [
                10228,
                10279
            ],
            [
                10279,
                10447
            ],
            [
                10447,
                10452
            ],
            [
                10452,
                10757
            ],
            [
                10757,
                10828
            ],
            [
                10828,
                10844
            ],
            [
                10844,
                10928
            ],
            [
                10928,
                11137
            ],
            [
                11137,
                11256
            ],
            [
                11256,
                11375
            ],
            [
                11375,
                11424
            ],
            [
                11424,
                11519
            ],
            [
                11519,
                11601
            ],
            [
                11601,
                11722
            ],
            [
                11722,
                11768
            ],
            [
                11768,
                11863
            ],
            [
                11863,
                11996
            ],
            [
                11996,
                12090
            ],
            [
                12090,
                12363
            ],
            [
                12363,
                12518
            ],
            [
                12518,
                12621
            ],
            [
                12621,
                12737
            ],
            [
                12737,
                12816
            ],
            [
                12816,
                12865
            ],
            [
                12865,
                13029
            ],
            [
                13029,
                13144
            ],
            [
                13144,
                13289
            ],
            [
                13289,
                13382
            ],
            [
                13382,
                13481
            ],
            [
                13481,
                13505
            ],
            [
                13505,
                13645
            ],
            [
                13645,
                13826
            ],
            [
                13826,
                13867
            ],
            [
                13867,
                14123
            ],
            [
                14123,
                14215
            ]
        ]
    },
    "abridged": {
        "text": "On the fifth day, a lighter step approached; and Zillah entered the room. She wore a scarlet shawl and black silk bonnet, and a willow-basket swung on her arm.\n'Eh, dear! Mrs. Dean!' she exclaimed. 'There's talk about you at Gimmerton. We thought you were sunk in the Blackhorse marsh, and missy with you, till master told me you'd been found, and he'd lodged you here! And how long were you in the hole? Did master save you, Mrs. Dean?'\n'Your master is a scoundrel!' I replied. 'He needn't have started that tale!'\n'It's not his tale,' said Zillah. 'They tell it in the village - about your being lost in the marsh; and I calls to Earnshaw, when I come in, \"Eh, Mr. Hareton, it's a sad pity of that likely young lass, and Nelly Dean.\" He stared, so I told him the rumour. The master listened, and smiled, and said, \"If they have been in the marsh, they are out now, Zillah. Nelly Dean is lodged in your room. You can tell her to leave, when you go up; here is the key. The bog-water got into her head; but she has come to her senses. Bid her go to the Grange, and carry a message that her young lady will follow in time to attend the squire's funeral.\"'\n'Mr. Edgar is not dead?' I gasped. 'Oh! Zillah!'\n'No, no; he's not dead,' she replied. 'Dr. Kenneth thinks he may last another day.'\nI snatched my things, and hastened below. The door stood wide open; but nobody seemed to be there, until a cough drew my attention to the hearth. Linton lay on the settle, sucking a stick of sugar-candy, and watching me with apathetic eyes.\n'Where is Miss Catherine?' I demanded sternly. 'Is she gone?'\n'No,' he replied; 'she's upstairs: we won't let her go.'\n'You won't let her, little idiot!' I exclaimed. 'Direct me to her room immediately, or I'll make you sing out.'\n'Papa would make you sing out, if you went there,' he answered. 'He says I'm not to be soft with Catherine: she's my wife, and it's shameful that she should wish to leave me. He says she hates me and wants me to die, so that she may have my money; but she shan't have it: and she shan't go home! She may cry, and be sick as much as she pleases!'\nHe closed his eyelids, as if he meant to drop asleep.\n'Master Heathcliff,' I said, 'have you forgotten all Catherine's kindness to you last winter, when she brought you books and sung you songs, and came many a time through wind and snow to see you? She wept to miss one evening, because you would be disappointed; and you felt then that she was a hundred times too good to you: and now you believe the lies your father tells, though you know he detests you both. And you join him against her. That's fine gratitude, is it not?'\nLinton's mouth fell open, and he took the sugar-candy from his lips.\n'Did she come to Wuthering Heights because she hated you?' I continued. 'Think! As to your money, she does not even know that you will have any. You say she's sick; and yet you leave her alone, up there in a strange house! She pitied your sufferings, but you won't pity hers! After pretending such affection, you store every tear you have for yourself, and lie there at ease. Ah! you're a heartless, selfish boy!'\n'I can't stay with her,' he answered crossly. 'She cries so I can't bear it. And she won't stop, though I say I'll call my father. I did call him once, and he threatened to strangle her if she was not quiet; but she began again the instant he left the room, moaning all night, though I screamed for vexation because I couldn't sleep.'\n'Is Mr. Heathcliff out?' I inquired, perceiving that the wretched creature had no power to sympathize with his cousin.\n'He's in the courtyard,' he replied, 'talking to Dr. Kenneth; who says uncle is dying at last. I'm glad, for I shall be master of the Grange after him. Catherine always spoke of it as her house. It isn't hers! It's mine: papa says everything she has is mine. She offered to give me all her nice books, and her pretty birds, and her pony Minny, if I would let her out; but I told her they were all, all mine.\n'Then she cried, and took a little picture from her neck, and said I should have that; two pictures in a gold case, on one side her mother, and on the other uncle, when they were young. I said they were mine, too; and tried to get them from her. The spiteful thing wouldn't let me: she pushed me off, and hurt me. I shrieked out - that frightens her - she heard papa coming, and she broke the hinges and divided the case, and gave me her mother's portrait. She tried to hide the other, but I told papa, and he took mine, and ordered her to give hers to me; she refused, and he - he struck her down, and wrenched it off the chain, and crushed it with his foot.'\n'And were you pleased to see her struck?' I asked.\n'I winced,' he answered: 'I wince to see my father strike a dog or a horse, he does it so hard. Yet I was glad at first - she deserved punishing: but when papa was gone, she showed me her cheek cut on the inside, and her mouth filling with blood; and then she gathered up the bits of the picture, and went and sat down with her face to the wall, and she has never spoken to me since: and I sometimes think she can't speak for pain. She's a naughty thing for crying continually; and she looks so pale and wild, I'm afraid of her.'\n'And you can get the key if you choose?' I said.\n'Yes, when I am upstairs,' he answered; 'but I can't walk upstairs now.'\n'In what room is it?' I asked.\n'Oh,' he cried, 'I shan't tell you. Nobody is to know. You've tired me - go away!' And he shut his eyes again.\nI considered it best to depart without seeing Mr. Heathcliff, and to bring a rescue for my young lady from Thrushcross Grange.\nOn reaching the Grange, the astonishment and joy of my fellow-servants was intense. I went to tell Mr. Edgar the news; but how changed I found him, even in those few days! He lay, an image of sadness and resignation, awaiting his death. He murmured Catherine's name: I touched his hand.\n'Catherine is coming, dear master!' I whispered; 'she is alive and well; and will be here, I hope, to-night.'\nI trembled at the effects of this news: he half rose up, looked round eagerly, and then sank back in a swoon. When he recovered, I related the events of our visit, saying Heathcliff forced me to go in. I said as little as possible against Linton; nor did I describe his father's brutal conduct - not wishing to add more bitterness to Edgar's already over-flowing cup.\nHe guessed that one of his enemy's purposes was to secure the property and the estate to his son: yet why Heathcliff did not wait till his death was a puzzle to my master, because he was ignorant of how nearly he and his nephew would quit the world together. However, he felt that his will had better be altered, to put Catherine's fortune in the hands of trustees for her use during life, and for her children after her. Then it could not fall to Mr. Heathcliff should Linton die.\nI sent a man to fetch the attorney; and four more men, with weapons, went to demand my young lady from her jailor. Both parties were delayed. The single servant returned first. He said Mr. Green, the lawyer, was out when he arrived, and he had to wait two hours for him; and then Mr. Green told him he had business in the village; but that he would be at Thrushcross Grange before morning.\nThe four men came back unaccompanied also. They brought word that Catherine was too ill to quit her room, and Heathcliff would not let them see her. I scolded the stupid fellows for listening to that tale, and resolved to take a whole mob up to the Heights, and storm it unless the prisoner were surrendered to us.\nHappily, I was spared the journey and the trouble. At three o'clock, a sharp knock at the front door made me jump.\n'Oh! it is only Green,' I said; but it was not the attorney. My own sweet little mistress sprang on my neck sobbing, 'Ellen, Ellen! Is papa alive?'\n'Yes,' I cried: 'yes, my angel, he is. God be thanked, you are safe with us again!'\nShe wanted to run, breathless as she was, to Mr. Linton's room; but I made her sit down, and washed her pale face. Then I said I must go first, and tell of her arrival; imploring her to say she should be happy with young Heathcliff. She assured me she would not complain.\nI couldn't bear to be present at their meeting. I stood outside the chamber-door a quarter of an hour before going in. All was composed, however: Catherine's despair was as silent as her father's joy. She supported him calmly; and he gazed at her with eyes full of ecstasy.\nHe died blissfully, Mr. Lockwood: he died so. Kissing her cheek, he murmured, 'I am going to her; and you, darling child, shall come to us!' He never stirred or spoke again; but continued that rapt, radiant gaze, till his pulse stopped and his soul departed.\nCatherine sat there dry-eyed till the sun rose: she stayed till noon, and would have remained brooding over that deathbed, but I insisted on her coming away and taking some rest. At dinner-time Mr. Green, the lawyer, appeared, having called at Wuthering Heights to get his instructions. He had sold himself to Mr. Heathcliff: that was the cause of his delay.\nMr. Green took upon himself to order everybody about the place. He gave all the servants but me notice to quit. He tried to insist that Edgar Linton should not be buried beside his wife, but in the chapel, with his family. There was the will, however, to hinder that, and I protested loudly. The funeral was hurried over; Catherine, Mrs. Linton Heathcliff now, was allowed to stay at the Grange till her father's corpse had quitted it.\nShe told me that her anguish had at last spurred Linton to take the risk of liberating her. He had the cunning to unlock and re-lock the door, without shutting it; and when he should have gone to bed, he begged to sleep with Hareton. Catherine stole out before dawn, finding an open window in her mother's empty room. She climbed out easily, and got to the ground by means of the fir-tree close by. Her accomplice suffered for his share in the escape, despite his timid contrivances.",
        "paragraph_chars": [
            [
                0,
                160
            ],
            [
                160,
                438
            ],
            [
                438,
                516
            ],
            [
                516,
                1155
            ],
            [
                1155,
                1204
            ],
            [
                1204,
                1288
            ],
            [
                1288,
                1529
            ],
            [
                1529,
                1591
            ],
            [
                1591,
                1648
            ],
            [
                1648,
                1760
            ],
            [
                1760,
                2106
            ],
            [
                2106,
                2160
            ],
            [
                2160,
                2635
            ],
            [
                2635,
                2704
            ],
            [
                2704,
                3118
            ],
            [
                3118,
                3453
            ],
            [
                3453,
                3572
            ],
            [
                3572,
                3980
            ],
            [
                3980,
                4641
            ],
            [
                4641,
                4692
            ],
            [
                4692,
                5222
            ],
            [
                5222,
                5271
            ],
            [
                5271,
                5344
            ],
            [
                5344,
                5375
            ],
            [
                5375,
                5486
            ],
            [
                5486,
                5613
            ],
            [
                5613,
                5900
            ],
            [
                5900,
                6010
            ],
            [
                6010,
                6378
            ],
            [
                6378,
                6860
            ],
            [
                6860,
                7250
            ],
            [
                7250,
                7565
            ],
            [
                7565,
                7680
            ],
            [
                7680,
                7828
            ],
            [
                7828,
                7912
            ],
            [
                7912,
                8184
            ],
            [
                8184,
                8458
            ],
            [
                8458,
                8717
            ],
            [
                8717,
                9076
            ],
            [
                9076,
                9512
            ],
            [
                9512,
                9995
            ]
        ],
        "segment_chars": [
            [
                0,
                74
            ],
            [
                74,
                160
            ],
            [
                160,
                171
            ],
            [
                171,
                183
            ],
            [
                183,
                198
            ],
            [
                198,
                236
            ],
            [
                236,
                370
            ],
            [
                370,
                405
            ],
            [
                405,
                438
            ],
            [
                438,
                468
            ],
            [
                468,
                479
            ],
            [
                479,
                516
            ],
            [
                516,
                550
            ],
            [
                550,
                736
            ],
            [
                736,
                773
            ],
            [
                773,
                875
            ],
            [
                875,
                910
            ],
            [
                910,
                970
            ],
            [
                970,
                1035
            ],
            [
                1035,
                1155
            ],
            [
                1155,
                1160
            ],
            [
                1160,
                1180
            ],
            [
                1180,
                1190
            ],
            [
                1190,
                1195
            ],
            [
                1195,
                1204
            ],
            [
                1204,
                1242
            ],
            [
                1242,
                1247
            ],
            [
                1247,
                1288
            ],
            [
                1288,
                1330
            ],
            [
                1330,
                1434
            ],
            [
                1434,
                1529
            ],
            [
                1529,
                1556
            ],
            [
                1556,
                1576
            ],
            [
                1576,
                1591
            ],
            [
                1591,
                1648
            ],
            [
                1648,
                1683
            ],
            [
                1683,
                1696
            ],
            [
                1696,
                1760
            ],
            [
                1760,
                1824
            ],
            [
                1824,
                1935
            ],
            [
                1935,
                2056
            ],
            [
                2056,
                2106
            ],
            [
                2106,
                2160
            ],
            [
                2160,
                2356
            ],
            [
                2356,
                2570
            ],
            [
                2570,
                2600
            ],
            [
                2600,
                2635
            ],
            [
                2635,
                2704
            ],
            [
                2704,
                2763
            ],
            [
                2763,
                2776
            ],
            [
                2776,
                2784
            ],
            [
                2784,
                2849
            ],
            [
                2849,
                2927
            ],
            [
                2927,
                2980
            ],
            [
                2980,
                3080
            ],
            [
                3080,
                3084
            ],
            [
                3084,
                3118
            ],
            [
                3118,
                3164
            ],
            [
                3164,
                3195
            ],
            [
                3195,
                3249
            ],
            [
                3249,
                3453
            ],
            [
                3453,
                3478
            ],
            [
                3478,
                3572
            ],
            [
                3572,
                3667
            ],
            [
                3667,
                3724
            ],
            [
                3724,
                3767
            ],
            [
                3767,
                3782
            ],
            [
                3782,
                3831
            ],
            [
                3831,
                3980
            ],
            [
                3980,
                4166
            ],
            [
                4166,
                4226
            ],
            [
                4226,
                4294
            ],
            [
                4294,
                4437
            ],
            [
                4437,
                4641
            ],
            [
                4641,
                4683
            ],
            [
                4683,
                4692
            ],
            [
                4692,
                4788
            ],
            [
                4788,
                5124
            ],
            [
                5124,
                5222
            ],
            [
                5222,
                5263
            ],
            [
                5263,
                5271
            ],
            [
                5271,
                5344
            ],
            [
                5344,
                5366
            ],
            [
                5366,
                5375
            ],
            [
                5375,
                5411
            ],
            [
                5411,
                5430
            ],
            [
                5430,
                5458
            ],
            [
                5458,
                5486
            ],
            [
                5486,
                5613
            ],
            [
                5613,
                5697
            ],
            [
                5697,
                5785
            ],
            [
                5785,
                5850
            ],
            [
                5850,
                5900
            ],
            [
                5900,
                5936
            ],
            [
                5936,
                6010
            ],
            [
                6010,
                6120
            ],
            [
                6120,
                6212
            ],
            [
                6212,
                6378
            ],
            [
                6378,
                6637
            ],
            [
                6637,
                6800
            ],
            [
                6800,
                6860
            ],
            [
                6860,
                6975
            ],
            [
                6975,
                7002
            ],
            [
                7002,
                7037
            ],
            [
                7037,
                7250
            ],
            [
                7250,
                7293
            ],
            [
                7293,
                7399
            ],
            [
                7399,
                7565
            ],
            [
                7565,
                7616
            ],
            [
                7616,
                7680
            ],
            [
                7680,
                7685
            ],
            [
                7685,
                7741
            ],
            [
                7741,
                7812
            ],
            [
                7812,
                7828
            ],
            [
                7828,
                7867
            ],
            [
                7867,
                7912
            ],
            [
                7912,
                8027
            ],
            [
                8027,
                8145
            ],
            [
                8145,
                8184
            ],
            [
                8184,
                8232
            ],
            [
                8232,
                8303
            ],
            [
                8303,
                8385
            ],
            [
                8385,
                8458
            ],
            [
                8458,
                8504
            ],
            [
                8504,
                8599
            ],
            [
                8599,
                8717
            ],
            [
                8717,
                8896
            ],
            [
                8896,
                9004
            ],
            [
                9004,
                9076
            ],
            [
                9076,
                9140
            ],
            [
                9140,
                9188
            ],
            [
                9188,
                9299
            ],
            [
                9299,
                9368
            ],
            [
                9368,
                9512
            ],
            [
                9512,
                9604
            ],
            [
                9604,
                9746
            ],
            [
                9746,
                9830
            ],
            [
                9830,
                9911
            ],
            [
                9911,
                9995
            ]
        ],
        "overlap_chars": [
            [
                0,
                12
            ],
            [
                16,
                19
            ],
            [
                28,
                43
            ],
            [
                43,
                48
            ],
            [
                56,
                74
            ],
            [
                83,
                84
            ],
            [
                85,
                98
            ],
            [
                103,
                120
            ],
            [
                120,
                147
            ],
            [
                148,
                150
            ],
            [
                151,
                160
            ],
            [
                161,
                171
            ],
            [
                171,
                180
            ],
            [
                183,
                198
            ],
            [
                207,
                236
            ],
            [
                239,
                246
            ],
            [
                247,
                370
            ],
            [
                370,
                405
            ],
            [
                405,
                435
            ],
            [
                439,
                455
            ],
            [
                456,
                465
            ],
            [
                468,
                479
            ],
            [
                480,
                495
            ],
            [
                504,
                513
            ],
            [
                517,
                534
            ],
            [
                548,
                549
            ],
            [
                551,
                560
            ],
            [
                564,
                656
            ],
            [
                656,
                657
            ],
            [
                658,
                659
            ],
            [
                659,
                661
            ],
            [
                661,
                675
            ],
            [
                676,
                722
            ],
            [
                723,
                733
            ],
            [
                736,
                745
            ],
            [
                745,
                773
            ],
            [
                773,
                797
            ],
            [
                798,
                804
            ],
            [
                804,
                815
            ],
            [
                817,
                875
            ],
            [
                875,
                895
            ],
            [
                896,
                910
            ],
            [
                910,
                929
            ],
            [
                935,
                970
            ],
            [
                970,
                1001
            ],
            [
                1001,
                1006
            ],
            [
                1007,
                1010
            ],
            [
                1020,
                1035
            ],
            [
                1035,
                1059
            ],
            [
                1059,
                1080
            ],
            [
                1081,
                1151
            ],
            [
                1158,
                1159
            ],
            [
                1160,
                1177
            ],
            [
                1180,
                1190
            ],
            [
                1191,
                1195
            ],
            [
                1195,
                1201
            ],
            [
                1205,
                1212
            ],
            [
                1213,
                1226
            ],
            [
                1229,
                1240
            ],
            [
                1240,
                1241
            ],
            [
                1245,
                1246
            ],
            [
                1247,
                1285
            ],
            [
                1288,
                1301
            ],
            [
                1302,
                1328
            ],
            [
                1328,
                1330
            ],
            [
                1330,
                1373
            ],
            [
                1374,
                1376
            ],
            [
                1385,
                1386
            ],
            [
                1393,
                1394
            ],
            [
                1395,
                1434
            ],
            [
                1434,
                1458
            ],
            [
                1458,
                1495
            ],
            [
                1508,
                1528
            ],
            [
                1530,
                1553
            ],
            [
                1556,
                1574
            ],
            [
                1574,
                1576
            ],
            [
                1577,
                1588
            ],
            [
                1592,
                1594
            ],
            [
                1597,
                1608
            ],
            [
                1610,
                1625
            ],
            [
                1626,
                1642
            ],
            [
                1643,
                1645
            ],
            [
                1649,
                1680
            ],
            [
                1683,
                1696
            ],
            [
                1704,
                1757
            ],
            [
                1761,
                1797
            ],
            [
                1803,
                1808
            ],
            [
                1811,
                1824
            ],
            [
                1825,
                1935
            ],
            [
                1935,
                1976
            ],
            [
                1980,
                2056
            ],
            [
                2056,
                2103
            ],
            [
                2106,
                2108
            ],
            [
                2116,
                2119
            ],
            [
                2124,
                2160
            ],
            [
                2168,
                2178
            ],
            [
                2181,
                2182
            ],
            [
                2187,
                2188
            ],
            [
                2190,
                2253
            ],
            [
                2254,
                2356
            ],
            [
                2356,
                2570
            ],
            [
                2570,
                2600
            ],
            [
                2600,
                2632
            ],
            [
                2635,
                2654
            ],
            [
                2659,
                2704
            ],
            [
                2709,
                2760
            ],
            [
                2763,
                2776
            ],
            [
                2782,
                2784
            ],
            [
                2784,
                2849
            ],
            [
                2849,
                2927
            ],
            [
                2927,
                2937
            ],
            [
                2938,
                2942
            ],
            [
                2943,
                2953
            ],
            [
                2953,
                2954
            ],
            [
                2955,
                2980
            ],
            [
                2980,
                3012
            ],
            [
                3013,
                3016
            ],
            [
                3017,
                3070
            ],
            [
                3071,
                3080
            ],
            [
                3080,
                3084
            ],
            [
                3084,
                3115
            ],
            [
                3119,
                3140
            ],
            [
                3143,
                3164
            ],
            [
                3169,
                3195
            ],
            [
                3195,
                3208
            ],
            [
                3213,
                3249
            ],
            [
                3249,
                3383
            ],
            [
                3384,
                3393
            ],
            [
                3393,
                3425
            ],
            [
                3434,
                3450
            ],
            [
                3454,
                3475
            ],
            [
                3478,
                3570
            ],
            [
                3570,
                3572
            ],
            [
                3573,
                3584
            ],
            [
                3597,
                3608
            ],
            [
                3610,
                3620
            ],
            [
                3625,
                3657
            ],
            [
                3658,
                3667
            ],
            [
                3667,
                3724
            ],
            [
                3724,
                3767
            ],
            [
                3767,
                3782
            ],
            [
                3782,
                3831
            ],
            [
                3831,
                3853
            ],
            [
                3854,
                3872
            ],
            [
                3872,
                3926
            ],
            [
                3927,
                3954
            ],
            [
                3955,
                3979
            ],
            [
                3986,
                4166
            ],
            [
                4166,
                4226
            ],
            [
                4226,
                4294
            ],
            [
                4294,
                4435
            ],
            [
                4435,
                4437
            ],
            [
                4455,
                4458
            ],
            [
                4470,
                4471
            ],
            [
                4487,
                4494
            ],
            [
                4499,
                4519
            ],
            [
                4525,
                4638
            ],
            [
                4642,
                4680
            ],
            [
                4683,
                4690
            ],
            [
                4690,
                4692
            ],
            [
                4693,
                4694
            ],
            [
                4704,
                4716
            ],
            [
                4718,
                4719
            ],
            [
                4726,
                4788
            ],
            [
                4788,
                4836
            ],
            [
                4836,
                4865
            ],
            [
                4866,
                4903
            ],
            [
                4903,
                5124
            ],
            [
                5124,
                5219
            ],
            [
                5223,
                5260
            ],
            [
                5263,
                5271
            ],
            [
                5272,
                5295
            ],
            [
                5298,
                5310
            ],
            [
                5312,
                5341
            ],
            [
                5345,
                5352
            ],
            [
                5358,
                5363
            ],
            [
                5366,
                5375
            ],
            [
                5376,
                5378
            ],
            [
                5381,
                5390
            ],
            [
                5392,
                5405
            ],
            [
                5406,
                5409
            ],
            [
                5409,
                5411
            ],
            [
                5411,
                5417
            ],
            [
                5418,
                5430
            ],
            [
                5430,
                5455
            ],
            [
                5458,
                5464
            ],
            [
                5465,
                5486
            ],
            [
                5486,
                5551
            ],
            [
                5555,
                5592
            ],
            [
                5605,
                5612
            ],
            [
                5613,
                5624
            ],
            [
                5625,
                5628
            ],
            [
                5635,
                5653
            ],
            [
                5654,
                5657
            ],
            [
                5658,
                5661
            ],
            [
                5662,
                5683
            ],
            [
                5684,
                5695
            ],
            [
                5695,
                5697
            ],
            [
                5736,
                5785
            ],
            [
                5785,
                5791
            ],
            [
                5793,
                5828
            ],
            [
                5830,
                5850
            ],
            [
                5850,
                5861
            ],
            [
                5862,
                5871
            ],
            [
                5874,
                5878
            ],
            [
                5880,
                5898
            ],
            [
                5898,
                5900
            ],
            [
                5901,
                5933
            ],
            [
                5936,
                5948
            ],
            [
                5950,
                6007
            ],
            [
                6010,
                6027
            ],
            [
                6028,
                6043
            ],
            [
                6048,
                6073
            ],
            [
                6074,
                6079
            ],
            [
                6080,
                6087
            ],
            [
                6087,
                6120
            ],
            [
                6125,
                6148
            ],
            [
                6149,
                6152
            ],
            [
                6163,
                6166
            ],
            [
                6167,
                6173
            ],
            [
                6181,
                6210
            ],
            [
                6210,
                6212
            ],
            [
                6212,
                6213
            ],
            [
                6219,
                6275
            ],
            [
                6276,
                6305
            ],
            [
                6318,
                6324
            ],
            [
                6330,
                6340
            ],
            [
                6341,
                6343
            ],
            [
                6352,
                6378
            ],
            [
                6378,
                6380
            ],
            [
                6389,
                6439
            ],
            [
                6440,
                6448
            ],
            [
                6453,
                6463
            ],
            [
                6464,
                6475
            ],
            [
                6476,
                6486
            ],
            [
                6495,
                6516
            ],
            [
                6523,
                6557
            ],
            [
                6565,
                6573
            ],
            [
                6577,
                6637
            ],
            [
                6637,
                6689
            ],
            [
                6689,
                6690
            ],
            [
                6691,
                6697
            ],
            [
                6698,
                6717
            ],
            [
                6718,
                6788
            ],
            [
                6789,
                6800
            ],
            [
                6805,
                6860
            ],
            [
                6860,
                6861
            ],
            [
                6867,
                6894
            ],
            [
                6896,
                6909
            ],
            [
                6913,
                6914
            ],
            [
                6915,
                6919
            ],
            [
                6920,
                6928
            ],
            [
                6934,
                6957
            ],
            [
                6963,
                6975
            ],
            [
                6975,
                7000
            ],
            [
                7000,
                7002
            ],
            [
                7002,
                7037
            ],
            [
                7037,
                7091
            ],
            [
                7091,
                7125
            ],
            [
                7129,
                7165
            ],
            [
                7166,
                7189
            ],
            [
                7189,
                7194
            ],
            [
                7195,
                7199
            ],
            [
                7200,
                7249
            ],
            [
                7250,
                7293
            ],
            [
                7293,
                7329
            ],
            [
                7330,
                7354
            ],
            [
                7356,
                7380
            ],
            [
                7385,
                7389
            ],
            [
                7390,
                7399
            ],
            [
                7399,
                7427
            ],
            [
                7428,
                7455
            ],
            [
                7469,
                7484
            ],
            [
                7489,
                7507
            ],
            [
                7508,
                7520
            ],
            [
                7521,
                7545
            ],
            [
                7546,
                7564
            ],
            [
                7565,
                7616
            ],
            [
                7616,
                7632
            ],
            [
                7632,
                7633
            ],
            [
                7634,
                7679
            ],
            [
                7681,
                7685
            ],
            [
                7685,
                7690
            ],
            [
                7691,
                7701
            ],
            [
                7704,
                7710
            ],
            [
                7710,
                7715
            ],
            [
                7716,
                7741
            ],
            [
                7741,
                7796
            ],
            [
                7798,
                7812
            ],
            [
                7812,
                7825
            ],
            [
                7829,
                7832
            ],
            [
                7835,
                7843
            ],
            [
                7845,
                7865
            ],
            [
                7867,
                7909
            ],
            [
                7912,
                7953
            ],
            [
                7954,
                7981
            ],
            [
                7982,
                7990
            ],
            [
                7991,
                7999
            ],
            [
                7999,
                8025
            ],
            [
                8025,
                8027
            ],
            [
                8027,
                8101
            ],
            [
                8102,
                8145
            ],
            [
                8145,
                8184
            ],
            [
                8184,
                8194
            ],
            [
                8200,
                8232
            ],
            [
                8232,
                8285
            ],
            [
                8301,
                8303
            ],
            [
                8303,
                8385
            ],
            [
                8385,
                8409
            ],
            [
                8409,
                8417
            ],
            [
                8427,
                8430
            ],
            [
                8431,
                8435
            ],
            [
                8436,
                8440
            ],
            [
                8449,
                8458
            ],
            [
                8458,
                8504
            ],
            [
                8504,
                8534
            ],
            [
                8537,
                8596
            ],
            [
                8602,
                8685
            ],
            [
                8686,
                8716
            ],
            [
                8717,
                8726
            ],
            [
                8727,
                8768
            ],
            [
                8776,
                8796
            ],
            [
                8797,
                8889
            ],
            [
                8894,
                8896
            ],
            [
                8896,
                8910
            ],
            [
                8920,
                8921
            ],
            [
                8922,
                8932
            ],
            [
                8934,
                8942
            ],
            [
                8942,
                9002
            ],
            [
                9002,
                9004
            ],
            [
                9004,
                9074
            ],
            [
                9074,
                9075
            ],
            [
                9076,
                9112
            ],
            [
                9113,
                9140
            ],
            [
                9140,
                9171
            ],
            [
                9172,
                9188
            ],
            [
                9188,
                9190
            ],
            [
                9197,
                9199
            ],
            [
                9207,
                9299
            ],
            [
                9299,
                9347
            ],
            [
                9366,
                9368
            ],
            [
                9368,
                9440
            ],
            [
                9449,
                9512
            ],
            [
                9512,
                9570
            ],
            [
                9576,
                9604
            ],
            [
                9604,
                9744
            ],
            [
                9744,
                9746
            ],
            [
                9746,
                9772
            ],
            [
                9828,
                9830
            ],
            [
                9830,
                9833
            ],
            [
                9842,
                9845
            ],
            [
                9846,
                9852
            ],
            [
                9852,
                9857
            ],
            [
                9858,
                9861
            ],
            [
                9862,
                9875
            ],
            [
                9876,
                9911
            ],
            [
                9911,
                9963
            ],
            [
                9972,
                9995
            ]
        ],
        "row_chars": [
            [
                0,
                74
            ],
            [
                74,
                160
            ],
            [
                160,
                171
            ],
            [
                171,
                183
            ],
            [
                183,
                198
            ],
            [
                198,
                198
            ],
            [
                198,
                236
            ],
            [
                236,
                370
            ],
            [
                370,
                370
            ],
            [
                370,
                370
            ],
            [
                370,
                405
            ],
            [
                405,
                438
            ],
            [
                438,
                438
            ],
            [
                438,
                468
            ],
            [
                468,
                479
            ],
            [
                479,
                479
            ],
            [
                479,
                516
            ],
            [
                516,
                516
            ],
            [
                516,
                516
            ],
            [
                516,
                736
            ],
            [
                736,
                773
            ],
            [
                773,
                875
            ],
            [
                875,
                910
            ],
            [
                910,
                970
            ],
            [
                970,
                1035
            ],
            [
                1035,
                1155
            ],
            [
                1155,
                1180
            ],
            [
                1180,
                1190
            ],
            [
                1190,
                1195
            ],
            [
                1195,
                1204
            ],
            [
                1204,
                1288
            ],
            [
                1288,
                1288
            ],
            [
                1288,
                1330
            ],
            [
                1330,
                1330
            ],
            [
                1330,
                1434
            ],
            [
                1434,
                1529
            ],
            [
                1529,
                1556
            ],
            [
                1556,
                1576
            ],
            [
                1576,
                1576
            ],
            [
                1576,
                1591
            ],
            [
                1591,
                1591
            ],
            [
                1591,
                1648
            ],
            [
                1648,
                1683
            ],
            [
                1683,
                1696
            ],
            [
                1696,
                1760
            ],
            [
                1760,
                1824
            ],
            [
                1824,
                1935
            ],
            [
                1935,
                2056
            ],
            [
                2056,
                2106
            ],
            [
                2106,
                2160
            ],
            [
                2160,
                2356
            ],
            [
                2356,
                2570
            ],
            [
                2570,
                2600
            ],
            [
                2600,
                2635
            ],
            [
                2635,
                2704
            ],
            [
                2704,
                2763
            ],
            [
                2763,
                2776
            ],
            [
                2776,
                2784
            ],
            [
                2784,
                2849
            ],
            [
                2849,
                2927
            ],
            [
                2927,
                2927
            ],
            [
                2927,
                2980
            ],
            [
                2980,
                3080
            ],
            [
                3080,
                3084
            ],
            [
                3084,
                3118
            ],
            [
                3118,
                3164
            ],
            [
                3164,
                3164
            ],
            [
                3164,
                3195
            ],
            [
                3195,
                3249
            ],
            [
                3249,
                3453
            ],
            [
                3453,
                3478
            ],
            [
                3478,
                3572
            ],
            [
                3572,
                3667
            ],
            [
                3667,
                3724
            ],
            [
                3724,
                3767
            ],
            [
                3767,
                3782
            ],
            [
                3782,
                3831
            ],
            [
                3831,
                3980
            ],
            [
                3980,
                4166
            ],
            [
                4166,
                4226
            ],
            [
                4226,
                4294
            ],
            [
                4294,
                4437
            ],
            [
                4437,
                4641
            ],
            [
                4641,
                4683
            ],
            [
                4683,
                4692
            ],
            [
                4692,
                4788
            ],
            [
                4788,
                5124
            ],
            [
                5124,
                5222
            ],
            [
                5222,
                5263
            ],
            [
                5263,
                5271
            ],
            [
                5271,
                5344
            ],
            [
                5344,
                5366
            ],
            [
                5366,
                5375
            ],
            [
                5375,
                5411
            ],
            [
                5411,
                5411
            ],
            [
                5411,
                5430
            ],
            [
                5430,
                5430
            ],
            [
                5430,
                5458
            ],
            [
                5458,
                5486
            ],
            [
                5486,
                5613
            ],
            [
                5613,
                5697
            ],
            [
                5697,
                5785
            ],
            [
                5785,
                5850
            ],
            [
                5850,
                5850
            ],
            [
                5850,
                5900
            ],
            [
                5900,
                5936
            ],
            [
                5936,
                6010
            ],
            [
                6010,
                6120
            ],
            [
                6120,
                6212
            ],
            [
                6212,
                6378
            ],
            [
                6378,
                6637
            ],
            [
                6637,
                6800
            ],
            [
                6800,
                6860
            ],
            [
                6860,
                6975
            ],
            [
                6975,
                7002
            ],
            [
                7002,
                7037
            ],
            [
                7037,
                7250
            ],
            [
                7250,
                7293
            ],
            [
                7293,
                7399
            ],
            [
                7399,
                7565
            ],
            [
                7565,
                7565
            ],
            [
                7565,
                7616
            ],
            [
                7616,
                7680
            ],
            [
                7680,
                7685
            ],
            [
                7685,
                7741
            ],
            [
                7741,
                7812
            ],
            [
                7812,
                7828
            ],
            [
                7828,
                7912
            ],
            [
                7912,
                8027
            ],
            [
                8027,
                8145
            ],
            [
                8145,
                8184
            ],
            [
                8184,
                8232
            ],
            [
                8232,
                8303
            ],
            [
                8303,
                8385
            ],
            [
                8385,
                8458
            ],
            [
                8458,
                8504
            ],
            [
                8504,
                8599
            ],
            [
                8599,
                8717
            ],
            [
                8717,
                8717
            ],
            [
                8717,
                8896
            ],
            [
                8896,
                9004
            ],
            [
                9004,
                9076
            ],
            [
                9076,
                9076
            ],
            [
                9076,
                9140
            ],
            [
                9140,
                9188
            ],
            [
                9188,
                9299
            ],
            [
                9299,
                9368
            ],
            [
                9368,
                9512
            ],
            [
                9512,
                9604
            ],
            [
                9604,
                9604
            ],
            [
                9604,
                9604
            ],
            [
                9604,
                9604
            ],
            [
                9604,
                9746
            ],
            [
                9746,
                9830
            ],
            [
                9830,
                9911
            ],
            [
                9911,
                9995
            ]
        ]
    }
}