{
    "original": {
        "text": "Cathy stayed at Thrushcross Grange five weeks: till Christmas. By that time her ankle was thoroughly cured, and her manners much improved. The mistress visited her often in the interval, and commenced her plan of reform by trying to raise her self-respect with fine clothes and flattery, which she took readily; so that, instead of a wild, hatless little savage jumping into the house, and rushing to squeeze us all breathless, there \"lighted from a handsome black pony a very dignified person, with brown ringlets falling from the cover of a feathered beaver, and a long cloth habit, which she was obliged to hold up with both hands that she might sail in. Hindley lifted her from her horse, exclaiming delightedly, \"Why, Cathy, you are quite a beauty! I should scarcely have known you: you look like a lady now. Isabella Linton is not to be compared with her, is she, Frances?\" \"Isabella has not her natural advantages,\" replied his wife: \"but she must mind and not grow wild again here. Ellen, help Miss Catherine off with her things-Stay, dear, you will disarrange your curls-let me untie your hat.\"\nI removed the habit, and there shone forth beneath a grand plaid silk frock, white trousers, and burnished shoes; and, while her eyes sparkled joyfully when the dogs came bounding up to welcome her, she dared hardly touch them lest they should fawn upon her splendid garments. She kissed me gently: I was all flour making the Christmas cake, and it would not have done to give me a hug; and then she looked round for Heathcliff. Mr. and Mrs. Earnshaw watched anxiously their meeting; thinking it would enable them to judge, in some measure, what grounds they had for hoping to succeed in separating the two friends.\nHeathcliff was hard to discover, at first. If he were careless, and uncared for, before Catherine's absence, he had been ten times more so since. Nobody but I even did him the kindness to call him a dirty boy, and bid him wash himself, once a week; and children of his age seldom have a natural pleasure in soap and water. Therefore, not to mention his clothes, which had seen three months' service in mire and dust, and his thick uncombed hair, the surface of his face and hands was dismally beclouded. He might well skulk behind the settle, on beholding such a bright, graceful damsel enter the house, instead of a rough-headed counterpart of himself, as he expected. \"Is Heathcliff not here?\" she demanded, pulling off her gloves, and displaying fingers wonderfully whitened with doing nothing and staying indoors.\n\"Heathcliff, you may come forward,\" cried Mr. Hindley, enjoying his discomfiture, and gratified to see what a forbidding young blackguard he would be compelled to present himself. \"You may come and wish Miss Catherine welcome, like the other servants.\"\nCathy, catching a glimpse of her friend in his concealment, flew to embrace him; she bestowed seven or eight kisses on his cheek within the second, and then stopped, and drawing back, burst into a laugh, exclaiming, \"Why, how very black and cross you look! and how-how funny and grim! But that's because I'm used to Edgar and Isabella Linton. Well, Heathcliff, have you forgotten me?\"\nShe had some reason to put the question, for shame and pride threw double gloom over his countenance, and kept him immovable.\n\"Shake hands, Heathcliff,\" said Mr. Earnshaw, condescendingly; \"once in a way that is permitted.\"\n\"I shall not,\" replied the boy, finding his tongue at last; \"I shall not stand to be laughed at. I shall not bear it!\" And he would have broken from the circle, but Miss Cathy seized him again.\n\"I did not mean to laugh at you,\" she said; \"I could not hinder myself: Heathcliff, shake hands at least! What are you sulky for? It was only that you looked odd. If you wash your face and brush your hair, it will be all right: but you are so dirty!\"\nShe gazed concernedly at the dusky fingers she held in her own, and also at her dress; which she feared had gained no embellishment from its contact with his.\n\"You needn't have touched me!\" he answered, following her eye and snatching away his hand. \"I shall be as dirty as I please: and I like to be dirty, and I will be dirty.\"\nWith that he dashed headforemost out of the room, amid the merriment of the master and mistress, and to the serious disturbance of Catherine; who could not comprehend how her remarks should have produced such an exhibition of bad temper.\nAfter playing lady's-maid to the new-comer, and putting my cakes in the oven, and making the house and kitchen cheerful with great fires, befitting Christmas-eve, I prepared to sit down and amuse myself by singing carols, all alone; regardless of Joseph's affirmations that he considered the merry tunes I chose as next door to songs. He had retired to private prayer in his chamber, and Mr. and Mrs. Earnshaw were engaging Missy's attention by sundry gay trifles bought for her to present to the little Lintons, as an acknowledgment of their kindness. They had invited them to spend the morrow at Wuthering Heights, and the invitation had been accepted, on one condition: Mrs. Linton begged that her darlings might be kept carefully apart from that \"naughty swearing boy.\"\nUnder these circumstances I remained solitary. I smelt the rich scent of the heating spices; and admired the shining kitchen utensils, the polished clock, decked in holly, the silver mugs ranged on a tray ready to be filled with mulled ale for supper; and above all, the speckless purity of my particular care-the scoured and well-swept floor. I gave due inward applause to every object, and then I remembered how old Earnshaw used to come in when all was tidied, and call me a cant lass, and slip a shilling into my hand as a Christmas-box; and from that I went on to think of his fondness for Heathcliff, and his dread lest he should suffer neglect after death had removed him: and that naturally led me to consider the poor lad's situation now, and from singing I changed my mind to crying. It struck me soon, however, there would be more sense in endeavouring to repair some of his wrongs than shedding tears over them: I got up and walked into the court to seek him. He was not far; I found him smoothing the glossy coat of the new pony in the stable, and feeding the other beasts, according to custom.\n\"Make haste, Heathcliff!\" I said, \"the kitchen is so comfortable; and Joseph is upstairs: make haste, and let me dress you smart before Miss Cathy comes out, and then you can sit together, with the whole hearth to yourselves, and have a long chatter till bedtime.\"\nHe proceeded with his task, and never turned his head towards me.\n\"Come-are you coming?\" I continued. \"There's a little cake for each of you, nearly enough; and you'll need half-an-hour's donning.\"\nI waited five minutes, but getting no answer left him. Catherine supped with her brother and sister-in-law: Joseph and I joined at an unsociable meal, seasoned with reproofs on one side and sauciness on the other. His cake and cheese remained on the table all night for the fairies. He managed to continue work till nine o'clock, and then marched dumb and dour to his chamber. Cathy sat up late, having a world of things to order for the reception of her new friends: she came into the kitchen once to speak to her old one; but he was gone, and she only stayed to ask what was the matter with him, and then went back. In the morning he rose early; and, as it was a holiday, carried his ill-humour on to the moors; not re-appearing till the family were departed for church. Fasting and reflection seemed to have brought him to a better spirit. He hung about me for a while, and having screwed up his courage, exclaimed abruptly-\"Nelly, make me decent, I'm going to be good.\"\n\"High time, Heathcliff,\" I said; \"you _have_ grieved Catherine: she's sorry she ever came home, I daresay! It looks as if you envied her, because she is more thought of than you.\"\nThe notion of _envying_ Catherine was incomprehensible to him, but the notion of grieving her he understood clearly enough.\n\"Did she say she was grieved?\" he inquired, looking very serious.\n\"She cried when I told her you were off again this morning.\"\n\"Well, _I_ cried last night,\" he returned, \"and I had more reason to cry than she.\"\n\"Yes: you had the reason of going to bed with a proud heart and an empty stomach,\" said I. \"Proud people breed sad sorrows for themselves. But, if you be ashamed of your touchiness, you must ask pardon, mind, when she comes in. You must go up and offer to kiss her, and say-you know best what to say; only do it heartily, and not as if you thought her converted into a stranger by her grand dress. And now, though I have dinner to get ready, I'll steal time to arrange you so that Edgar Linton shall look quite a doll beside you: and that he does. You are younger, and yet, I'll be bound, you are taller and twice as broad across the shoulders; you could knock him down in a twinkling; don't you feel that you could?\"\nHeathcliff's face brightened a moment; then it was overcast afresh, and he sighed.\n\"But, Nelly, if I knocked him down twenty times, that wouldn't make him less handsome or me more so. I wish I had light hair and a fair skin, and was dressed and behaved as well, and had a chance of being as rich as he will be!\"\n\"And cried for mamma at every turn,\" I added, \"and trembled if a country lad heaved his fist against you, and sat at home all day for a shower of rain. Oh, Heathcliff, you are showing a poor spirit! Come to the glass, and I'll let you see what you should wish. Do you mark those two lines between your eyes; and those thick brows, that, instead of rising arched, sink in the middle; and that couple of black fiends, so deeply buried, who never open their windows boldly, but lurk glinting under them, like devil's spies? Wish and learn to smooth away the surly wrinkles, to raise your lids frankly, and change the fiends to confident, innocent angels, suspecting and doubting nothing, and always seeing friends where they are not sure of foes. Don't get the expression of a vicious cur that appears to know the kicks it gets are its dessert, and yet hates all the world, as well as the kicker, for what it suffers.\"\n\"In other words, I must wish for Edgar Linton's great blue eyes and even forehead,\" he replied. \"I do-and that won't help me to them.\"\n\"A good heart will help you to a bonny face, my lad,\" I continued, \"if you were a regular black; and a bad one will turn the bonniest into something worse than ugly. And now that we've done washing, and combing, and sulking-tell me whether you don't think yourself rather handsome? I'll tell you, I do. You're fit for a prince in disguise. Who knows but your father was Emperor of China, and your mother an Indian queen, each of them able to buy up, with one week's income, Wuthering Heights and Thrushcross Grange together? And you were kidnapped by wicked sailors and brought to England. Were I in your place, I would frame high notions of my birth; and the thoughts of what I was should give me courage and dignity to support the oppressions of a little farmer!\"\nSo I chattered on; and Heathcliff gradually lost his frown and began to look quite pleasant, when all at once our conversation was interrupted by a rumbling sound moving up the road and entering the court. He ran to the window and I to the door, just in time to behold the two Lintons descend from the family carriage, smothered in cloaks and furs, and the Earnshaws dismount from their horses: they often rode to church in winter. Catherine took a hand of each of the children, and brought them into the house and set them before the fire, which quickly put colour into their white faces.\nI urged my companion to hasten now and show his amiable humour, and he willingly obeyed; but ill luck would have it that, as he opened the door leading from the kitchen on one side, Hindley opened it on the other. They met, and the master, irritated at seeing him clean and cheerful, or, perhaps, eager to keep his promise to Mrs. Linton, shoved him back with a sudden thrust, and angrily bade Joseph \"keep the fellow out of the room-send him into the garret till dinner is over. He'll be cramming his fingers in the tarts and stealing the fruit, if left alone with them a minute.\"\n\"Nay, sir,\" I could not avoid answering, \"he'll touch nothing, not he: and I suppose he must have his share of the dainties as well as we.\"\n\"He shall have his share of my hand, if I catch him downstairs till dark,\" cried Hindley. \"Begone, you vagabond! What! you are attempting the coxcomb, are you? Wait till I get hold of those elegant locks-see if I won't pull them a bit longer!\"\n\"They are long enough already,\" observed Master Linton, peeping from the doorway; \"I wonder they don't make his head ache. It's like a colt's mane over his eyes!\"\nHe ventured this remark without any intention to insult; but Heathcliff's violent nature was not prepared to endure the appearance of impertinence from one whom he seemed to hate, even then, as a rival. He seized a tureen of hot apple sauce (the first thing that came under his grip) and dashed it full against the speaker's face and neck; who instantly commenced a lament that brought Isabella and Catherine hurrying to the place. Mr. Earnshaw snatched up the culprit directly and conveyed him to his chamber; where, doubtless, he administered a rough remedy to cool the fit of passion, for he appeared red and breathless. I got the dishcloth, and rather spitefully scrubbed Edgar's nose and mouth, affirming it served him right for meddling. His sister began weeping to go home, and Cathy stood by confounded, blushing for all.\n\"You should not have spoken to him!\" she expostulated with Master Linton. \"He was in a bad temper, and now you've spoilt your visit; and he'll be flogged: I hate him to be flogged! I can't eat my dinner. Why did you speak to him, Edgar?\"\n\"I didn't,\" sobbed the youth, escaping from my hands, and finishing the remainder of the purification with his cambric pocket-handkerchief. \"I promised mamma that I wouldn't say one word to him, and I didn't.\"\n\"Well, don't cry,\" replied Catherine, contemptuously; \"you're not killed. Don't make more mischief; my brother is coming: be quiet! Hush, Isabella! Has anybody hurt you?\"\n\"There, there, children-to your seats!\" cried Hindley, bustling in. \"That brute of a lad has warmed me nicely. Next time, Master Edgar, take the law into your own fists-it will give you an appetite!\"\nThe little party recovered its equanimity at sight of the fragrant feast. They were hungry after their ride, and easily consoled, since no real harm had befallen them. Mr. Earnshaw carved bountiful platefuls, and the mistress made them merry with lively talk. I waited behind her chair, and was pained to behold Catherine, with dry eyes and an indifferent air, commence cutting up the wing of a goose before her. \"An unfeeling child,\" I thought to myself; \"how lightly she dismisses her old playmate's troubles. I could not have imagined her to be so selfish.\" She lifted a mouthful to her lips: then she set it down again: her cheeks flushed, and the tears gushed over them. She slipped her fork to the floor, and hastily dived under the cloth to conceal her emotion. I did not call her unfeeling long; for I perceived she was in purgatory throughout the day, and wearying to find an opportunity of getting by herself, or paying a visit to Heathcliff, who had been locked up by the master: as I discovered, on endeavouring to introduce to him a private mess of victuals.\nIn the evening we had a dance. Cathy begged that he might be liberated then, as Isabella Linton had no partner: her entreaties were vain, and I was appointed to supply the deficiency. We got rid of all gloom in the excitement of the exercise, and our pleasure was increased by the arrival of the Gimmerton band, mustering fifteen strong: a trumpet, a trombone, clarionets, bassoons, French horns, and a bass viol, besides singers. They go the rounds of all the respectable houses, and receive contributions every Christmas, and we esteemed it a first-rate treat to hear them. After the usual carols had been sung, we set them to songs and glees. Mrs. Earnshaw loved the music, and so they gave us plenty.\nCatherine loved it too: but she said it sounded sweetest at the top of the steps, and she went up in the dark: I followed. They shut the house door below, never noting our absence, it was so full of people. She made no stay at the stairs'-head, but mounted farther, to the garret where Heathcliff was confined, and called him. He stubbornly declined answering for a while: she persevered, and finally persuaded him to hold communion with her through the boards. I let the poor things converse unmolested, till I supposed the songs were going to cease, and the singers to get some refreshment: then I clambered up the ladder to warn her. Instead of finding her outside, I heard her voice within. The little monkey had crept by the skylight of one garret, along the roof, into the skylight of the other, and it was with the utmost difficulty I could coax her out again. When she did come, Heathcliff came with her, and she insisted that I should take him into the kitchen, as my fellow-servant had gone to a neighbour's, to be removed from the sound of our \"devil's psalmody,\" as it pleased him to call it. I told them I intended by no means to encourage their tricks: but as the prisoner had never broken his fast since yesterday's dinner, I would wink at his cheating Mr. Hindley that once. He went down: I set him a stool by the fire, and offered him a quantity of good things: but he was sick and could eat little, and my attempts to entertain him were thrown away. He leant his two elbows on his knees, and his chin on his hands and remained rapt in dumb meditation. On my inquiring the subject of his thoughts, he answered gravely-\"I'm trying to settle how I shall pay Hindley back. I don't care how long I wait, if I can only do it at last. I hope he will not die before I do!\"\n\"For shame, Heathcliff!\" said I. \"It is for God to punish wicked people; we should learn to forgive.\"\n\"No, God won't have the satisfaction that I shall,\" he returned. \"I only wish I knew the best way! Let me alone, and I'll plan it out: while I'm thinking of that I don't feel pain.\"\n\"But, Mr. Lockwood, I forget these tales cannot divert you. I'm annoyed how I should dream of chattering on at such a rate; and your gruel cold, and you nodding for bed! I could have told Heathcliff's history, all that you need hear, in half a dozen words.\"\n* * * * *\nThus interrupting herself, the housekeeper rose, and proceeded to lay aside her sewing; but I felt incapable of moving from the hearth, and I was very far from nodding. \"Sit still, Mrs. Dean,\" I cried; \"do sit still another half-hour. You've done just right to tell the story leisurely. That is the method I like; and you must finish it in the same style. I am interested in every character you have mentioned, more or less.\"\n\"The clock is on the stroke of eleven, sir.\"\n\"No matter-I'm not accustomed to go to bed in the long hours. One or two is early enough for a person who lies till ten.\"\n\"You shouldn't lie till ten. There's the very prime of the morning gone long before that time. A person who has not done one-half his day's work by ten o'clock, runs a chance of leaving the other half undone.\"\n\"Nevertheless, Mrs. Dean, resume your chair; because to-morrow I intend lengthening the night till afternoon. I prognosticate for myself an obstinate cold, at least.\"\n\"I hope not, sir. Well, you must allow me to leap over some three years; during that space Mrs. Earnshaw-\"\n\"No, no, I'll allow nothing of the sort! Are you acquainted with the mood of mind in which, if you were seated alone, and the cat licking its kitten on the rug before you, you would watch the operation so intently that puss's neglect of one ear would put you seriously out of temper?\"\n\"A terribly lazy mood, I should say.\"\n\"On the contrary, a tiresomely active one. It is mine, at present; and, therefore, continue minutely. I perceive that people in these regions acquire over people in towns the value that a spider in a dungeon does over a spider in a cottage, to their various occupants; and yet the deepened attraction is not entirely owing to the situation of the looker-on. They _do_ live more in earnest, more in themselves, and less in surface, change, and frivolous external things. I could fancy a love for life here almost possible; and I was a fixed unbeliever in any love of a year's standing. One state resembles setting a hungry man down to a single dish, on which he may concentrate his entire appetite and do it justice; the other, introducing him to a table laid out by French cooks: he can perhaps extract as much enjoyment from the whole; but each part is a mere atom in his regard and remembrance.\"\n\"Oh! here we are the same as anywhere else, when you get to know us,\" observed Mrs. Dean, somewhat puzzled at my speech.\n\"Excuse me,\" I responded; \"you, my good friend, are a striking evidence against that assertion. Excepting a few provincialisms of slight consequence, you have no marks of the manners which I am habituated to consider as peculiar to your class. I am sure you have thought a great deal more than the generality of servants think. You have been compelled to cultivate your reflective faculties for want of occasions for frittering your life away in silly trifles.\"\nMrs. Dean laughed.\n\"I certainly esteem myself a steady, reasonable kind of body,\" she said; \"not exactly from living among the hills and seeing one set of faces, and one series of actions, from year's end to year's end; but I have undergone sharp discipline, which has taught me wisdom; and then, I have read more than you would fancy, Mr. Lockwood. You could not open a book in this library that I have not looked into, and got something out of also: unless it be that range of Greek and Latin, and that of French; and those I know one from another: it is as much as you can expect of a poor man's daughter. However, if I am to follow my story in true gossip's fashion, I had better go on; and instead of leaping three years, I will be content to pass to the next summer-the summer of 1778, that is nearly twenty-three years ago.\"",
        "paragraph_chars": [
            [
                0,
                1104
            ],
            [
                1104,
                1720
            ],
            [
                1720,
                2538
            ],
            [
                2538,
                2791
            ],
            [
                2791,
                3176
            ],
            [
                3176,
                3302
            ],
            [
                3302,
                3400
            ],
            [
                3400,
                3594
            ],
            [
                3594,
                3845
            ],
            [
                3845,
                4004
            ],
            [
                4004,
                4175
            ],
            [
                4175,
                4413
            ],
            [
                4413,
                5187
            ],
            [
                5187,
                6295
            ],
            [
                6295,
                6560
            ],
            [
                6560,
                6626
            ],
            [
                6626,
                6758
            ],
            [
                6758,
                7732
            ],
            [
                7732,
                7912
            ],
            [
                7912,
                8036
            ],
            [
                8036,
                8102
            ],
            [
                8102,
                8163
            ],
            [
                8163,
                8247
            ],
            [
                8247,
                8965
            ],
            [
                8965,
                9048
            ],
            [
                9048,
                9277
            ],
            [
                9277,
                10193
            ],
            [
                10193,
                10328
            ],
            [
                10328,
                11094
            ],
            [
                11094,
                11684
            ],
            [
                11684,
                12266
            ],
            [
                12266,
                12406
            ],
            [
                12406,
                12650
            ],
            [
                12650,
                12813
            ],
            [
                12813,
                13643
            ],
            [
                13643,
                13881
            ],
            [
                13881,
                14091
            ],
            [
                14091,
                14262
            ],
            [
                14262,
                14462
            ],
            [
                14462,
                15534
            ],
            [
                15534,
                16239
            ],
            [
                16239,
                18022
            ],
            [
                18022,
                18124
            ],
            [
                18124,
                18306
            ],
            [
                18306,
                18564
            ],
            [
                18564,
                18574
            ],
            [
                18574,
                19000
            ],
            [
                19000,
                19045
            ],
            [
                19045,
                19167
            ],
            [
                19167,
                19377
            ],
            [
                19377,
                19544
            ],
            [
                19544,
                19651
            ],
            [
                19651,
                19936
            ],
            [
                19936,
                19974
            ],
            [
                19974,
                20872
            ],
            [
                20872,
                20993
            ],
            [
                20993,
                21455
            ],
            [
                21455,
                21474
            ],
            [
                21474,
                22286
            ]
        ],
        "segment_chars": [
            [
                0,
                63
            ],
            [
                63,
                139
            ],
            [
                139,
                658
            ],
            [
                658,
                754
            ],
            [
                754,
                814
            ],
            [
                814,
                880
            ],
            [
                880,
                990
            ],
            [
                990,
                1104
            ],
            [
                1104,
                1381
            ],
            [
                1381,
                1533
            ],
            [
                1533,
                1720
            ],
            [
                1720,
                1763
            ],
            [
                1763,
                1866
            ],
            [
                1866,
                2043
            ],
            [
                2043,
                2224
            ],
            [
                2224,
                2390
            ],
            [
                2390,
                2416
            ],
            [
                2416,
                2538
            ],
            [
                2538,
                2718
            ],
            [
                2718,
                2791
            ],
            [
                2791,
                3048
            ],
            [
                3048,
                3076
            ],
            [
                3076,
                3134
            ],
            [
                3134,
                3176
            ],
            [
                3176,
                3302
            ],
            [
                3302,
                3400
            ],
            [
                3400,
                3497
            ],
            [
                3497,
                3519
            ],
            [
                3519,
                3594
            ],
            [
                3594,
                3700
            ],
            [
                3700,
                3724
            ],
            [
                3724,
                3757
            ],
            [
                3757,
                3845
            ],
            [
                3845,
                4004
            ],
            [
                4004,
                4035
            ],
            [
                4035,
                4095
            ],
            [
                4095,
                4175
            ],
            [
                4175,
                4413
            ],
            [
                4413,
                4748
            ],
            [
                4748,
                4966
            ],
            [
                4966,
                5187
            ],
            [
                5187,
                5234
            ],
            [
                5234,
                5531
            ],
            [
                5531,
                5981
            ],
            [
                5981,
                6159
            ],
            [
                6159,
                6295
            ],
            [
                6295,
                6321
            ],
            [
                6321,
                6560
            ],
            [
                6560,
                6626
            ],
            [
                6626,
                6649
            ],
            [
                6649,
                6662
            ],
            [
                6662,
                6758
            ],
            [
                6758,
                6813
            ],
            [
                6813,
                6972
            ],
            [
                6972,
                7041
            ],
            [
                7041,
                7135
            ],
            [
                7135,
                7376
            ],
            [
                7376,
                7531
            ],
            [
                7531,
                7601
            ],
            [
                7601,
                7732
            ],
            [
                7732,
                7839
            ],
            [
                7839,
                7912
            ],
            [
                7912,
                8036
            ],
            [
                8036,
                8067
            ],
            [
                8067,
                8102
            ],
            [
                8102,
                8163
            ],
            [
                8163,
                8247
            ],
            [
                8247,
                8338
            ],
            [
                8338,
                8386
            ],
            [
                8386,
                8475
            ],
            [
                8475,
                8645
            ],
            [
                8645,
                8795
            ],
            [
                8795,
                8965
            ],
            [
                8965,
                9048
            ],
            [
                9048,
                9149
            ],
            [
                9149,
                9277
            ],
            [
                9277,
                9429
            ],
            [
                9429,
                9476
            ],
            [
                9476,
                9538
            ],
            [
                9538,
                9798
            ],
            [
                9798,
                10021
            ],
            [
                10021,
                10193
            ],
            [
                10193,
                10289
            ],
            [
                10289,
                10328
            ],
            [
                10328,
                10494
            ],
            [
                10494,
                10610
            ],
            [
                10610,
                10631
            ],
            [
                10631,
                10668
            ],
            [
                10668,
                10853
            ],
            [
                10853,
                10918
            ],
            [
                10918,
                11094
            ],
            [
                11094,
                11300
            ],
            [
                11300,
                11526
            ],
            [
                11526,
                11684
            ],
            [
                11684,
                11898
            ],
            [
                11898,
                12164
            ],
            [
                12164,
                12266
            ],
            [
                12266,
                12406
            ],
            [
                12406,
                12496
            ],
            [
                12496,
                12519
            ],
            [
                12519,
                12525
            ],
            [
                12525,
                12566
            ],
            [
                12566,
                12650
            ],
            [
                12650,
                12773
            ],
            [
                12773,
                12813
            ],
            [
                12813,
                13016
            ],
            [
                13016,
                13245
            ],
            [
                13245,
                13437
            ],
            [
                13437,
                13557
            ],
            [
                13557,
                13643
            ],
            [
                13643,
                13680
            ],
            [
                13680,
                13717
            ],
            [
                13717,
                13824
            ],
            [
                13824,
                13847
            ],
            [
                13847,
                13881
            ],
            [
                13881,
                14021
            ],
            [
                14021,
                14091
            ],
            [
                14091,
                14165
            ],
            [
                14165,
                14223
            ],
            [
                14223,
                14239
            ],
            [
                14239,
                14262
            ],
            [
                14262,
                14302
            ],
            [
                14302,
                14330
            ],
            [
                14330,
                14373
            ],
            [
                14373,
                14462
            ],
            [
                14462,
                14536
            ],
            [
                14536,
                14630
            ],
            [
                14630,
                14722
            ],
            [
                14722,
                14875
            ],
            [
                14875,
                14974
            ],
            [
                14974,
                15023
            ],
            [
                15023,
                15138
            ],
            [
                15138,
                15231
            ],
            [
                15231,
                15534
            ],
            [
                15534,
                15565
            ],
            [
                15565,
                15718
            ],
            [
                15718,
                15965
            ],
            [
                15965,
                16110
            ],
            [
                16110,
                16180
            ],
            [
                16180,
                16239
            ],
            [
                16239,
                16362
            ],
            [
                16362,
                16446
            ],
            [
                16446,
                16566
            ],
            [
                16566,
                16701
            ],
            [
                16701,
                16876
            ],
            [
                16876,
                16934
            ],
            [
                16934,
                17107
            ],
            [
                17107,
                17344
            ],
            [
                17344,
                17530
            ],
            [
                17530,
                17707
            ],
            [
                17707,
                17809
            ],
            [
                17809,
                17926
            ],
            [
                17926,
                17985
            ],
            [
                17985,
                18022
            ],
            [
                18022,
                18047
            ],
            [
                18047,
                18055
            ],
            [
                18055,
                18124
            ],
            [
                18124,
                18189
            ],
            [
                18189,
                18223
            ],
            [
                18223,
                18306
            ],
            [
                18306,
                18366
            ],
            [
                18366,
                18476
            ],
            [
                18476,
                18564
            ],
            [
                18564,
                18574
            ],
            [
                18574,
                18743
            ],
            [
                18743,
                18809
            ],
            [
                18809,
                18861
            ],
            [
                18861,
                18930
            ],
            [
                18930,
                19000
            ],
            [
                19000,
                19045
            ],
            [
                19045,
                19107
            ],
            [
                19107,
                19167
            ],
            [
                19167,
                19196
            ],
            [
                19196,
                19262
            ],
            [
                19262,
                19377
            ],
            [
                19377,
                19487
            ],
            [
                19487,
                19544
            ],
            [
                19544,
                19562
            ],
            [
                19562,
                19651
            ],
            [
                19651,
                19692
            ],
            [
                19692,
                19936
            ],
            [
                19936,
                19974
            ],
            [
                19974,
                20017
            ],
            [
                20017,
                20076
            ],
            [
                20076,
                20332
            ],
            [
                20332,
                20444
            ],
            [
                20444,
                20559
            ],
            [
                20559,
                20872
            ],
            [
                20872,
                20877
            ],
            [
                20877,
                20993
            ],
            [
                20993,
                21089
            ],
            [
                21089,
                21237
            ],
            [
                21237,
                21321
            ],
            [
                21321,
                21455
            ],
            [
                21455,
                21474
            ],
            [
                21474,
                21805
            ],
            [
                21805,
                22064
            ],
            [
                22064,
                22286
            ]
        ],
        "overlap_chars": [
            [
                0,
                63
            ],
            [
                63,
                89
            ],
            [
                101,
                139
            ],
            [
                152,
                169
            ],
            [
                185,
                190
            ],
            [
                201,
                222
            ],
            [
                239,
                242
            ],
            [
                261,
                310
            ],
            [
                312,
                314
            ],
            [
                319,
                433
            ],
            [
                440,
                514
            ],
            [
                561,
                571
            ],
            [
                247,
                248
            ],
            [
                583,
                633
            ],
            [
                634,
                657
            ],
            [
                658,
                665
            ],
            [
                704,
                716
            ],
            [
                718,
                754
            ],
            [
                788,
                814
            ],
            [
                814,
                877
            ],
            [
                881,
                901
            ],
            [
                923,
                939
            ],
            [
                942,
                959
            ],
            [
                964,
                967
            ],
            [
                968,
                990
            ],
            [
                990,
                1036
            ],
            [
                1104,
                1117
            ],
            [
                1123,
                1146
            ],
            [
                1155,
                1162
            ],
            [
                1169,
                1179
            ],
            [
                1197,
                1200
            ],
            [
                1211,
                1216
            ],
            [
                1223,
                1286
            ],
            [
                1301,
                1347
            ],
            [
                1358,
                1381
            ],
            [
                1381,
                1449
            ],
            [
                1459,
                1462
            ],
            [
                1476,
                1533
            ],
            [
                1533,
                1572
            ],
            [
                1718,
                1720
            ],
            [
                1720,
                1742
            ],
            [
                1761,
                1763
            ],
            [
                1763,
                1866
            ],
            [
                1866,
                1954
            ],
            [
                1956,
                1967
            ],
            [
                2041,
                2043
            ],
            [
                2069,
                2080
            ],
            [
                2097,
                2110
            ],
            [
                2131,
                2136
            ],
            [
                2141,
                2144
            ],
            [
                2160,
                2164
            ],
            [
                2200,
                2203
            ],
            [
                2151,
                2159
            ],
            [
                2052,
                2053
            ],
            [
                2127,
                2130
            ],
            [
                2181,
                2199
            ],
            [
                2204,
                2215
            ],
            [
                2220,
                2224
            ],
            [
                2224,
                2299
            ],
            [
                2307,
                2322
            ],
            [
                2388,
                2389
            ],
            [
                2391,
                2413
            ],
            [
                2416,
                2538
            ],
            [
                2539,
                2550
            ],
            [
                2559,
                2571
            ],
            [
                2574,
                2618
            ],
            [
                2716,
                2718
            ],
            [
                2727,
                2788
            ],
            [
                2791,
                2796
            ],
            [
                2851,
                2919
            ],
            [
                2948,
                2960
            ],
            [
                2975,
                3006
            ],
            [
                3008,
                3048
            ],
            [
                3048,
                3051
            ],
            [
                3056,
                3076
            ],
            [
                3076,
                3134
            ],
            [
                3134,
                3173
            ],
            [
                3227,
                3236
            ],
            [
                3282,
                3290
            ],
            [
                3300,
                3302
            ],
            [
                3309,
                3326
            ],
            [
                3329,
                3364
            ],
            [
                3366,
                3397
            ],
            [
                3401,
                3412
            ],
            [
                3415,
                3459
            ],
            [
                3461,
                3495
            ],
            [
                3519,
                3536
            ],
            [
                3559,
                3594
            ],
            [
                3595,
                3625
            ],
            [
                3628,
                3636
            ],
            [
                3678,
                3700
            ],
            [
                3705,
                3718
            ],
            [
                3722,
                3724
            ],
            [
                3724,
                3751
            ],
            [
                3834,
                3842
            ],
            [
                3845,
                3952
            ],
            [
                4002,
                4004
            ],
            [
                4005,
                4032
            ],
            [
                4035,
                4047
            ],
            [
                4070,
                4095
            ],
            [
                4096,
                4172
            ],
            [
                4175,
                4194
            ],
            [
                4208,
                4330
            ],
            [
                4342,
                4383
            ],
            [
                4401,
                4413
            ],
            [
                4413,
                4445
            ],
            [
                4455,
                4577
            ],
            [
                4594,
                4598
            ],
            [
                4587,
                4589
            ],
            [
                4603,
                4633
            ],
            [
                4746,
                4748
            ],
            [
                4795,
                4796
            ],
            [
                4924,
                4925
            ],
            [
                4755,
                4765
            ],
            [
                4801,
                4822
            ],
            [
                4865,
                4924
            ],
            [
                4964,
                4966
            ],
            [
                4966,
                5000
            ],
            [
                5008,
                5162
            ],
            [
                5164,
                5184
            ],
            [
                5234,
                5263
            ],
            [
                5272,
                5325
            ],
            [
                5335,
                5340
            ],
            [
                5342,
                5457
            ],
            [
                5468,
                5480
            ],
            [
                5501,
                5531
            ],
            [
                5531,
                5532
            ],
            [
                5542,
                5548
            ],
            [
                5635,
                5638
            ],
            [
                5573,
                5621
            ],
            [
                5660,
                5662
            ],
            [
                5685,
                5695
            ],
            [
                5714,
                5723
            ],
            [
                5733,
                5822
            ],
            [
                5727,
                5732
            ],
            [
                5871,
                5875
            ],
            [
                5886,
                5938
            ],
            [
                5939,
                5951
            ],
            [
                5970,
                5980
            ],
            [
                5998,
                5999
            ],
            [
                5981,
                5983
            ],
            [
                6024,
                6034
            ],
            [
                6051,
                6084
            ],
            [
                6094,
                6110
            ],
            [
                6111,
                6123
            ],
            [
                6146,
                6159
            ],
            [
                6175,
                6186
            ],
            [
                6248,
                6259
            ],
            [
                6229,
                6242
            ],
            [
                6293,
                6295
            ],
            [
                6301,
                6318
            ],
            [
                6321,
                6328
            ],
            [
                6330,
                6384
            ],
            [
                6401,
                6423
            ],
            [
                6424,
                6447
            ],
            [
                6451,
                6557
            ],
            [
                6560,
                6562
            ],
            [
                6592,
                6626
            ],
            [
                6632,
                6646
            ],
            [
                6649,
                6662
            ],
            [
                6668,
                6688
            ],
            [
                6697,
                6700
            ],
            [
                6758,
                6766
            ],
            [
                6779,
                6813
            ],
            [
                6813,
                6878
            ],
            [
                6889,
                6908
            ],
            [
                6976,
                7041
            ],
            [
                7041,
                7043
            ],
            [
                7069,
                7104
            ],
            [
                7119,
                7135
            ],
            [
                7135,
                7140
            ],
            [
                7230,
                7268
            ],
            [
                7351,
                7354
            ],
            [
                7280,
                7292
            ],
            [
                7293,
                7297
            ],
            [
                7374,
                7375
            ],
            [
                7376,
                7409
            ],
            [
                7432,
                7470
            ],
            [
                7489,
                7504
            ],
            [
                7523,
                7531
            ],
            [
                7601,
                7603
            ],
            [
                7631,
                7634
            ],
            [
                7666,
                7684
            ],
            [
                7629,
                7630
            ],
            [
                7686,
                7707
            ],
            [
                7709,
                7729
            ],
            [
                7733,
                7754
            ],
            [
                7757,
                7764
            ],
            [
                7766,
                7769
            ],
            [
                7771,
                7775
            ],
            [
                7777,
                7839
            ],
            [
                7839,
                7868
            ],
            [
                7912,
                7925
            ],
            [
                7927,
                7934
            ],
            [
                7936,
                8019
            ],
            [
                8034,
                8036
            ],
            [
                8041,
                8064
            ],
            [
                8067,
                8069
            ],
            [
                8078,
                8102
            ],
            [
                8107,
                8137
            ],
            [
                8148,
                8160
            ],
            [
                8164,
                8169
            ],
            [
                8171,
                8172
            ],
            [
                8174,
                8190
            ],
            [
                8193,
                8205
            ],
            [
                8207,
                8244
            ],
            [
                8248,
                8327
            ],
            [
                8330,
                8338
            ],
            [
                8339,
                8357
            ],
            [
                8362,
                8386
            ],
            [
                8429,
                8448
            ],
            [
                8456,
                8475
            ],
            [
                8484,
                8511
            ],
            [
                8546,
                8598
            ],
            [
                8614,
                8624
            ],
            [
                8643,
                8645
            ],
            [
                8728,
                8775
            ],
            [
                8793,
                8795
            ],
            [
                8795,
                8819
            ],
            [
                8836,
                8931
            ],
            [
                8965,
                9048
            ],
            [
                9049,
                9149
            ],
            [
                9149,
                9197
            ],
            [
                9221,
                9225
            ],
            [
                9225,
                9252
            ],
            [
                9256,
                9260
            ],
            [
                9278,
                9311
            ],
            [
                9314,
                9322
            ],
            [
                9324,
                9353
            ],
            [
                9361,
                9369
            ],
            [
                9381,
                9429
            ],
            [
                9429,
                9476
            ],
            [
                9476,
                9487
            ],
            [
                9536,
                9538
            ],
            [
                9538,
                9544
            ],
            [
                9550,
                9612
            ],
            [
                9640,
                9644
            ],
            [
                9612,
                9613
            ],
            [
                9772,
                9776
            ],
            [
                9752,
                9771
            ],
            [
                9726,
                9731
            ],
            [
                9778,
                9798
            ],
            [
                9807,
                9875
            ],
            [
                9901,
                9910
            ],
            [
                9803,
                9806
            ],
            [
                9912,
                9920
            ],
            [
                10019,
                10021
            ],
            [
                10021,
                10058
            ],
            [
                10063,
                10067
            ],
            [
                10088,
                10093
            ],
            [
                10194,
                10256
            ],
            [
                10277,
                10289
            ],
            [
                10290,
                10325
            ],
            [
                10329,
                10379
            ],
            [
                10382,
                10394
            ],
            [
                10425,
                10461
            ],
            [
                10488,
                10494
            ],
            [
                10494,
                10539
            ],
            [
                10572,
                10577
            ],
            [
                10568,
                10571
            ],
            [
                10578,
                10610
            ],
            [
                10646,
                10668
            ],
            [
                10668,
                10747
            ],
            [
                10851,
                10853
            ],
            [
                10853,
                10916
            ],
            [
                11094,
                11191
            ],
            [
                11204,
                11256
            ],
            [
                11267,
                11270
            ],
            [
                11298,
                11300
            ],
            [
                11325,
                11326
            ],
            [
                11303,
                11306
            ],
            [
                11327,
                11344
            ],
            [
                11363,
                11378
            ],
            [
                11387,
                11391
            ],
            [
                11403,
                11464
            ],
            [
                11470,
                11526
            ],
            [
                11526,
                11572
            ],
            [
                11577,
                11633
            ],
            [
                11682,
                11684
            ],
            [
                11684,
                11731
            ],
            [
                11740,
                11776
            ],
            [
                11777,
                11785
            ],
            [
                11804,
                11827
            ],
            [
                11864,
                11865
            ],
            [
                11866,
                11873
            ],
            [
                11896,
                11898
            ],
            [
                11912,
                11967
            ],
            [
                12023,
                12038
            ],
            [
                12059,
                12084
            ],
            [
                11906,
                11907
            ],
            [
                12086,
                12164
            ],
            [
                12164,
                12206
            ],
            [
                12229,
                12263
            ],
            [
                12270,
                12275
            ],
            [
                12278,
                12279
            ],
            [
                12305,
                12306
            ],
            [
                12308,
                12327
            ],
            [
                12335,
                12340
            ],
            [
                12333,
                12335
            ],
            [
                12359,
                12373
            ],
            [
                12407,
                12468
            ],
            [
                12481,
                12496
            ],
            [
                12497,
                12519
            ],
            [
                12519,
                12525
            ],
            [
                12525,
                12566
            ],
            [
                12566,
                12647
            ],
            [
                12750,
                12752
            ],
            [
                12656,
                12679
            ],
            [
                12682,
                12731
            ],
            [
                12773,
                12810
            ],
            [
                12813,
                12844
            ],
            [
                12859,
                12884
            ],
            [
                12902,
                12921
            ],
            [
                12845,
                12848
            ],
            [
                12947,
                12964
            ],
            [
                13014,
                13016
            ],
            [
                13016,
                13053
            ],
            [
                13097,
                13110
            ],
            [
                13124,
                13142
            ],
            [
                13243,
                13245
            ],
            [
                13245,
                13281
            ],
            [
                13291,
                13294
            ],
            [
                13304,
                13372
            ],
            [
                13435,
                13436
            ],
            [
                13437,
                13496
            ],
            [
                13511,
                13512
            ],
            [
                13523,
                13557
            ],
            [
                13557,
                13581
            ],
            [
                13592,
                13623
            ],
            [
                13641,
                13643
            ],
            [
                13644,
                13677
            ],
            [
                13680,
                13683
            ],
            [
                13702,
                13717
            ],
            [
                13718,
                13749
            ],
            [
                13780,
                13824
            ],
            [
                13824,
                13847
            ],
            [
                13847,
                13878
            ],
            [
                13882,
                13890
            ],
            [
                13893,
                13909
            ],
            [
                14019,
                14021
            ],
            [
                14022,
                14088
            ],
            [
                14092,
                14107
            ],
            [
                14110,
                14144
            ],
            [
                14146,
                14165
            ],
            [
                14191,
                14223
            ],
            [
                14223,
                14239
            ],
            [
                14239,
                14259
            ],
            [
                14289,
                14299
            ],
            [
                14275,
                14285
            ],
            [
                14302,
                14330
            ],
            [
                14336,
                14373
            ],
            [
                14373,
                14459
            ],
            [
                14462,
                14488
            ],
            [
                14504,
                14519
            ],
            [
                14529,
                14536
            ],
            [
                14536,
                14552
            ],
            [
                14569,
                14590
            ],
            [
                14628,
                14630
            ],
            [
                14630,
                14649
            ],
            [
                14660,
                14722
            ],
            [
                14722,
                14723
            ],
            [
                14753,
                14766
            ],
            [
                14774,
                14822
            ],
            [
                14832,
                14842
            ],
            [
                14738,
                14741
            ],
            [
                14857,
                14862
            ],
            [
                14873,
                14874
            ],
            [
                14876,
                14894
            ],
            [
                14897,
                14906
            ],
            [
                14916,
                14917
            ],
            [
                14974,
                15020
            ],
            [
                15023,
                15078
            ],
            [
                15084,
                15119
            ],
            [
                15136,
                15138
            ],
            [
                15138,
                15231
            ],
            [
                15231,
                15259
            ],
            [
                15260,
                15264
            ],
            [
                15451,
                15452
            ],
            [
                15266,
                15271
            ],
            [
                15318,
                15321
            ],
            [
                15282,
                15302
            ],
            [
                15321,
                15322
            ],
            [
                15506,
                15507
            ],
            [
                15359,
                15361
            ],
            [
                15385,
                15451
            ],
            [
                15532,
                15534
            ],
            [
                15534,
                15565
            ],
            [
                15565,
                15585
            ],
            [
                15586,
                15594
            ],
            [
                15609,
                15681
            ],
            [
                15692,
                15694
            ],
            [
                15716,
                15718
            ],
            [
                15718,
                15759
            ],
            [
                15775,
                15844
            ],
            [
                15870,
                15965
            ],
            [
                16110,
                16119
            ],
            [
                16126,
                16132
            ],
            [
                16146,
                16180
            ],
            [
                16180,
                16209
            ],
            [
                16237,
                16239
            ],
            [
                16239,
                16348
            ],
            [
                16360,
                16361
            ],
            [
                16350,
                16360
            ],
            [
                16362,
                16366
            ],
            [
                16394,
                16399
            ],
            [
                16407,
                16418
            ],
            [
                16444,
                16446
            ],
            [
                16488,
                16495
            ],
            [
                16505,
                16566
            ],
            [
                16566,
                16568
            ],
            [
                16612,
                16656
            ],
            [
                16672,
                16692
            ],
            [
                16699,
                16701
            ],
            [
                16701,
                16722
            ],
            [
                16742,
                16748
            ],
            [
                16760,
                16774
            ],
            [
                16781,
                16783
            ],
            [
                16832,
                16875
            ],
            [
                16876,
                16934
            ],
            [
                16934,
                16961
            ],
            [
                16962,
                17008
            ],
            [
                17009,
                17060
            ],
            [
                17068,
                17078
            ],
            [
                17079,
                17107
            ],
            [
                17107,
                17115
            ],
            [
                17124,
                17209
            ],
            [
                17231,
                17256
            ],
            [
                17258,
                17260
            ],
            [
                17272,
                17293
            ],
            [
                17295,
                17302
            ],
            [
                17410,
                17412
            ],
            [
                17530,
                17532
            ],
            [
                17426,
                17429
            ],
            [
                17452,
                17479
            ],
            [
                17685,
                17688
            ],
            [
                17538,
                17553
            ],
            [
                17554,
                17590
            ],
            [
                17605,
                17654
            ],
            [
                17705,
                17707
            ],
            [
                17707,
                17715
            ],
            [
                17749,
                17770
            ],
            [
                17789,
                17791
            ],
            [
                17797,
                17809
            ],
            [
                17809,
                17873
            ],
            [
                17875,
                17926
            ],
            [
                17926,
                17985
            ],
            [
                17985,
                18007
            ],
            [
                18023,
                18044
            ],
            [
                18047,
                18055
            ],
            [
                18056,
                18121
            ],
            [
                18125,
                18173
            ],
            [
                18176,
                18189
            ],
            [
                18190,
                18223
            ],
            [
                18223,
                18253
            ],
            [
                18257,
                18303
            ],
            [
                18307,
                18324
            ],
            [
                18326,
                18366
            ],
            [
                18378,
                18383
            ],
            [
                18411,
                18413
            ],
            [
                18434,
                18444
            ],
            [
                18445,
                18458
            ],
            [
                18459,
                18476
            ],
            [
                18476,
                18514
            ],
            [
                18540,
                18561
            ],
            [
                18574,
                18621
            ],
            [
                18660,
                18672
            ],
            [
                18720,
                18733
            ],
            [
                18741,
                18742
            ],
            [
                18744,
                18747
            ],
            [
                18790,
                18807
            ],
            [
                18767,
                18774
            ],
            [
                18807,
                18809
            ],
            [
                18880,
                18886
            ],
            [
                18869,
                18872
            ],
            [
                18930,
                18964
            ],
            [
                19011,
                19013
            ],
            [
                19031,
                19037
            ],
            [
                19005,
                19010
            ],
            [
                19037,
                19042
            ],
            [
                19046,
                19057
            ],
            [
                19088,
                19090
            ],
            [
                19156,
                19164
            ],
            [
                19105,
                19106
            ],
            [
                19392,
                19402
            ],
            [
                19562,
                19566
            ],
            [
                19566,
                19615
            ],
            [
                19617,
                19648
            ],
            [
                19652,
                19692
            ],
            [
                20057,
                20065
            ],
            [
                20074,
                20076
            ],
            [
                20342,
                20395
            ],
            [
                20417,
                20442
            ],
            [
                20403,
                20404
            ],
            [
                20442,
                20444
            ],
            [
                20444,
                20464
            ],
            [
                20537,
                20539
            ],
            [
                20469,
                20495
            ],
            [
                20678,
                20680
            ],
            [
                20825,
                20827
            ],
            [
                20506,
                20507
            ],
            [
                20621,
                20622
            ],
            [
                20605,
                20609
            ],
            [
                20728,
                20746
            ],
            [
                20873,
                20877
            ],
            [
                20877,
                20939
            ],
            [
                20942,
                20978
            ],
            [
                20991,
                20993
            ],
            [
                20994,
                21003
            ],
            [
                21006,
                21018
            ],
            [
                21020,
                21044
            ],
            [
                21056,
                21089
            ],
            [
                21237,
                21286
            ],
            [
                21305,
                21319
            ],
            [
                21455,
                21474
            ],
            [
                21475,
                21486
            ],
            [
                21494,
                21534
            ],
            [
                21537,
                21546
            ],
            [
                21548,
                21587
            ],
            [
                21673,
                21745
            ],
            [
                21752,
                21805
            ],
            [
                21805,
                21874
            ],
            [
                22062,
                22064
            ],
            [
                22064,
                22071
            ],
            [
                22124,
                22188
            ],
            [
                22203,
                22227
            ],
            [
                22247,
                22251
            ],
            [
                22238,
                22246
            ],
            [
                22255,
                22284
            ]
        ],
        "row_chars": [
            [
                0,
                63
            ],
            [
                63,
                139
            ],
            [
                139,
                658
            ],
            [
                658,
                754
            ],
            [
                754,
                814
            ],
            [
                814,
                880
            ],
            [
                880,
                990
            ],
            [
                990,
                1104
            ],
            [
                1104,
                1381
            ],
            [
                1381,
                1533
            ],
            [
                1533,
                1720
            ],
            [
                1720,
                1763
            ],
            [
                1763,
                1866
            ],
            [
                1866,
                2043
            ],
            [
                2043,
                2224
            ],
            [
                2224,
                2390
            ],
            [
                2390,
                2416
            ],
            [
                2416,
                2538
            ],
            [
                2538,
                2718
            ],
            [
                2718,
                2791
            ],
            [
                2791,
                3048
            ],
            [
                3048,
                3076
            ],
            [
                3076,
                3134
            ],
            [
                3134,
                3176
            ],
            [
                3176,
                3302
            ],
            [
                3302,
                3400
            ],
            [
                3400,
                3497
            ],
            [
                3497,
                3519
            ],
            [
                3519,
                3594
            ],
            [
                3594,
                3700
            ],
            [
                3700,
                3724
            ],
            [
                3724,
                3845
            ],
            [
                3845,
                4004
            ],
            [
                4004,
                4035
            ],
            [
                4035,
                4095
            ],
            [
                4095,
                4175
            ],
            [
                4175,
                4413
            ],
            [
                4413,
                4748
            ],
            [
                4748,
                4966
            ],
            [
                4966,
                5187
            ],
            [
                5187,
                5234
            ],
            [
                5234,
                5531
            ],
            [
                5531,
                5981
            ],
            [
                5981,
                6159
            ],
            [
                6159,
                6295
            ],
            [
                6295,
                6321
            ],
            [
                6321,
                6560
            ],
            [
                6560,
                6626
            ],
            [
                6626,
                6649
            ],
            [
                6649,
                6662
            ],
            [
                6662,
                6758
            ],
            [
                6758,
                6813
            ],
            [
                6813,
                7041
            ],
            [
                7041,
                7135
            ],
            [
                7135,
                7376
            ],
            [
                7376,
                7531
            ],
            [
                7531,
                7601
            ],
            [
                7601,
                7732
            ],
            [
                7732,
                7839
            ],
            [
                7839,
                7912
            ],
            [
                7912,
                8036
            ],
            [
                8036,
                8067
            ],
            [
                8067,
                8102
            ],
            [
                8102,
                8163
            ],
            [
                8163,
                8247
            ],
            [
                8247,
                8338
            ],
            [
                8338,
                8386
            ],
            [
                8386,
                8475
            ],
            [
                8475,
                8645
            ],
            [
                8645,
                8795
            ],
            [
                8795,
                8965
            ],
            [
                8965,
                9048
            ],
            [
                9048,
                9149
            ],
            [
                9149,
                9277
            ],
            [
                9277,
                9429
            ],
            [
                9429,
                9476
            ],
            [
                9476,
                9538
            ],
            [
                9538,
                9798
            ],
            [
                9798,
                10021
            ],
            [
                10021,
                10193
            ],
            [
                10193,
                10289
            ],
            [
                10289,
                10328
            ],
            [
                10328,
                10494
            ],
            [
                10494,
                10610
            ],
            [
                10610,
                10631
            ],
            [
                10631,
                10668
            ],
            [
                10668,
                10853
            ],
            [
                10853,
                10918
            ],
            [
                10918,
                11094
            ],
            [
                11094,
                11300
            ],
            [
                11300,
                11526
            ],
            [
                11526,
                11684
            ],
            [
                11684,
                11898
            ],
            [
                11898,
                12164
            ],
            [
                12164,
                12266
            ],
            [
                12266,
                12406
            ],
            [
                12406,
                12496
            ],
            [
                12496,
                12519
            ],
            [
                12519,
                12525
            ],
            [
                12525,
                12566
            ],
            [
                12566,
                12650
            ],
            [
                12650,
                12813
            ],
            [
                12813,
                13016
            ],
            [
                13016,
                13245
            ],
            [
                13245,
                13437
            ],
            [
                13437,
                13557
            ],
            [
                13557,
                13643
            ],
            [
                13643,
                13680
            ],
            [
                13680,
                13717
            ],
            [
                13717,
                13824
            ],
            [
                13824,
                13847
            ],
            [
                13847,
                13881
            ],
            [
                13881,
                14021
            ],
            [
                14021,
                14091
            ],
            [
                14091,
                14165
            ],
            [
                14165,
                14223
            ],
            [
                14223,
                14239
            ],
            [
                14239,
                14262
            ],
            [
                14262,
                14302
            ],
            [
                14302,
                14330
            ],
            [
                14330,
                14373
            ],
            [
                14373,
                14462
            ],
            [
                14462,
                14536
            ],
            [
                14536,
                14630
            ],
            [
                14630,
                14722
            ],
            [
                14722,
                14875
            ],
            [
                14875,
                15023
            ],
            [
                15023,
                15138
            ],
            [
                15138,
                15231
            ],
            [
                15231,
                15534
            ],
            [
                15534,
                15565
            ],
            [
                15565,
                15718
            ],
            [
                15718,
                15965
            ],
            [
                15965,
                16110
            ],
            [
                16110,
                16180
            ],
            [
                16180,
                16239
            ],
            [
                16239,
                16446
            ],
            [
                16446,
                16566
            ],
            [
                16566,
                16701
            ],
            [
                16701,
                16876
            ],
            [
                16876,
                16934
            ],
            [
                16934,
                17107
            ],
            [
                17107,
                17344
            ],
            [
                17344,
                17707
            ],
            [
                17707,
                17809
            ],
            [
                17809,
                17926
            ],
            [
                17926,
                17985
            ],
            [
                17985,
                18022
            ],
            [
                18022,
                18047
            ],
            [
                18047,
                18055
            ],
            [
                18055,
                18124
            ],
            [
                18124,
                18189
            ],
            [
                18189,
                18223
            ],
            [
                18223,
                18306
            ],
            [
                18306,
                18366
            ],
            [
                18366,
                18476
            ],
            [
                18476,
                18564
            ],
            [
                18564,
                18574
            ],
            [
                18574,
                18743
            ],
            [
                18743,
                18809
            ],
            [
                18809,
                18861
            ],
            [
                18861,
                19000
            ],
            [
                19000,
                19045
            ],
            [
                19045,
                19167
            ],
            [
                19167,
                19196
            ],
            [
                19196,
                19262
            ],
            [
                19262,
                19377
            ],
            [
                19377,
                19487
            ],
            [
                19487,
                19544
            ],
            [
                19544,
                19562
            ],
            [
                19562,
                19651
            ],
            [
                19651,
                19692
            ],
            [
                19692,
                19936
            ],
            [
                19936,
                19974
            ],
            [
                19974,
                20017
            ],
            [
                20017,
                20076
            ],
            [
                20076,
                20332
            ],
            [
                20332,
                20444
            ],
            [
                20444,
                20872
            ],
            [
                20872,
                20877
            ],
            [
                20877,
                20993
            ],
            [
                20993,
                21089
            ],
            [
                21089,
                21237
            ],
            [
                21237,
                21321
            ],
            [
                21321,
                21455
            ],
            [
                21455,
                21474
            ],
            [
                21474,
                21805
            ],
            [
                21805,
                22064
            ],
            [
                22064,
                22286
            ]
        ]
    },
    "abridged": {
        "text": "Cathy stayed at Thrushcross Grange five weeks: till Christmas. By that time her ankle was cured, and her manners much improved. Mrs. Earnshaw visited her often, and began her plan of reform by offering her fine clothes and flattery, which she took readily.\nSo, instead of a wild, hatless little savage jumping into the house, and rushing to squeeze us all breathless, there alighted from a handsome black pony a very dignified person, with brown ringlets and a long riding-habit, which she was obliged to hold up with both hands so that she might sail in.\nHindley exclaimed delightedly, 'Why, Cathy, you are quite a beauty! You look like a lady now. Isabella Linton is not to be compared with her, is she, Frances?'\n'Isabella has not her beauty,' replied his wife; 'but she must mind not to grow wild again here. Ellen, help Miss Catherine off with her things.'\nI removed the riding-habit, and there shone forth a grand silk frock and polished shoes. While her eyes sparkled joyfully when the dogs came bounding up, she dared hardly touch them lest they should paw her splendid garments. She kissed me gently: I was all flour making the Christmas cake, and she could not give me a hug; and then she looked round for Heathcliff. Mr. and Mrs. Earnshaw watched anxiously.\nHeathcliff was hard to find. If he were careless, and uncared for, before Catherine's absence, he had been ten times more so since. Nobody but I even did him the kindness to call him a dirty boy, and bid him wash himself once a week. His clothes held three months' dust, his hair was uncombed, and his face and hands were dismally begrimed. He might well skulk behind the settle, on beholding such a bright, graceful girl enter the house.\n'Is Heathcliff not here?' she demanded, pulling off her gloves, and displaying fingers wonderfully whitened with doing nothing and staying indoors.\n'Heathcliff, come forward,' cried Mr. Hindley, enjoying his discomfiture. 'Come and wish Miss Catherine welcome, like the other servants.'\nCathy flew to embrace him; she bestowed seven or eight kisses on his cheek before she stopped, and burst into a laugh, exclaiming, 'Why, how very black and cross you look! and how funny and grim! But that's because I'm used to Edgar and Isabella Linton. Well, Heathcliff, have you forgotten me?'\nShame and pride kept him silent.\n'Shake hands, Heathcliff,' said Mr. Earnshaw, condescendingly; 'once in a way that is permitted.'\n'I shall not,' replied the boy, finding his tongue at last; 'I shall not stand to be laughed at!' And he would have left, but Miss Cathy seized him again.\n'I did not mean to laugh at you,' she said. 'Shake hands at least! Why are you sulky? It was only that you looked so dirty!'\nShe gazed concernedly at the dusky fingers she held in her own, and also at her dress; which she feared had been soiled.\n'You needn't have touched me!' he answered, snatching away his hand. 'I shall be as dirty as I please: and I like to be dirty, and I will be dirty.'\nWith that he dashed out of the room, amid the merriment of the master and mistress, and to the serious disturbance of Catherine; who could not understand how her remarks should have produced such bad temper.\nAfter playing lady's-maid to the newcomer, and putting my cakes in the oven, and making the house and kitchen cheerful with great fires, befitting Christmas-eve, I sat down to amuse myself by singing carols. Joseph, grumbling, retired to pray, while Mr. and Mrs. Earnshaw showed Catherine some gay trifles bought for her to present to the little Lintons. They had invited them to spend the next day at Wuthering Heights, and the invitation had been accepted, on one condition: Mrs. Linton begged that her darlings might be kept carefully apart from that 'naughty swearing boy.'\nI smelt the rich scent of the spices; and admired the shining kitchen utensils, the clock decked in holly, the silver mugs ranged on a tray ready to be filled with mulled ale for supper; and above all, the purity of my scoured and well-swept floor. I inwardly applauded it all, and then I remembered how old Earnshaw used to give me a shilling at Christmas. From that I went on to think of his fondness for Heathcliff, and his dread lest he should be neglected; and that led me to consider the poor lad's situation now, and made me change from singing to crying.\nHowever, it made more sense to try to repair some of his wrongs than shed tears over them: so I got up and went to seek him. I found him feeding the ponies in the stable.\n'Make haste, Heathcliff!' I said, 'the kitchen is so comfortable; and Joseph is upstairs: let me dress you smartly before Miss Cathy comes, and then you can sit together, with the whole hearth to yourselves, and have a long chatter till bedtime.'\nHe never turned his head towards me.\n'Are you coming?' I continued. 'There's a little cake for you.'\nI waited, but getting no answer left him. Catherine supped with her brother and sister-in-law: Joseph and I had an unsociable meal, but Heathcliff's cake and cheese remained on the table all night for the fairies. He worked till nine o'clock, and then marched to his chamber. Cathy came into the kitchen once to speak to him; but he was already gone.\nIn the morning he rose early; and carried his ill-humour on to the moors till the family had gone to church. Then he came in and exclaimed abruptly, 'Nelly, make me decent. I'm going to be good.'\n'High time, Heathcliff,' I said; 'you have grieved Catherine: she's sorry she ever came home, I daresay! It looks as if you envied her.'\nThe notion of envying Catherine was incomprehensible to him, but the notion of grieving her he understood.\n'Did she say she was grieved?' he asked, looking very serious.\n'She cried when I told her you were out this morning.'\n'Well, I cried last night,' he returned, 'and I had more reason to cry than she.'\n'Yes: you had the reason of going to bed with a proud heart and an empty stomach,' said I. 'Proud people breed sorrows for themselves. You must ask pardon when she comes in. Go up and offer to kiss her; only do it heartily, and not as if you thought her a stranger. Edgar Linton shall look quite a doll beside you. You are younger, and yet you are taller and twice as broad across the shoulders; you could knock him down in a twinkling.'\nHeathcliff's face brightened a moment; then it was overcast afresh, and he sighed.\n'But, Nelly, if I knocked him down twenty times, that wouldn't make him less handsome or me more so. I wish I had light hair and a fair skin, and was well-dressed, and had a chance of being rich!'\n'And cried for mamma at every turn,' I added, 'and trembled if a country lad shook his fist, and sat at home all day for a shower of rain. Oh, Heathcliff, you are showing a poor spirit! Come to the mirror. Do you see those two lines between your eyes; and those thick brows, that sink over your eyes, making them lurk glinting under their lids like devil's spies? Learn to smooth away the surly wrinkles, to raise your lids frankly, making your eyes confident and innocent. Don't get the expression of a vicious dog that expects only kicks.'\n'In other words, I must wish for Edgar Linton's great blue eyes,' he replied. 'I do - and that won't help me to them.'\n'A good heart will help you to a bonny face, my lad,' I continued, 'and a bad one will turn the bonniest face ugly. And now that we've done washing, and combing, don't you think yourself rather handsome? Like a prince in disguise. Who knows but your father was Emperor of China, and your mother an Indian queen? And you were kidnapped by wicked sailors and brought to England!'\nSo I chattered on; and Heathcliff gradually lost his frown and began to look quite pleasant, when our conversation was interrupted by a rumbling sound in the courtyard. I ran to the door, just as the two Lintons descended from their carriage, smothered in cloaks and furs, and the Earnshaws dismounted from their horses: they often rode to church in winter. Catherine took a hand of each of the children, brought them into the house and set them before the fire.\nI urged my companion to hasten now and show his good humour, and he willingly obeyed; but by ill luck, as he opened the door, he met Hindley. The master, irritated at seeing him clean and cheerful, shoved him back, and angrily bade Joseph, 'Keep the fellow out of the room - send him into the garret till dinner is over. He'll be cramming his fingers in the tarts, if left alone with them a minute.'\n'No, sir,' I answered, 'he'll touch nothing: and he should have his share.'\n'He shall have his share of my hand, if I catch him downstairs,' cried Hindley. 'Begone, you vagabond! What! you are attempting the coxcomb, are you? Wait till I get hold of those elegant locks - see if I won't pull them a bit longer!'\n'They are long enough already,' observed Master Linton, peeping from the doorway; 'It's like a colt's mane over his eyes!'\nHe ventured this remark without meaning to insult; but Heathcliff was not prepared to take any impertinence from him. He seized a tureen of hot apple sauce and dashed it in the speaker's face. Mr. Earnshaw snatched up the culprit and dragged him to his chamber; where, doubtless, he administered a rough remedy.\nI got the dishcloth, and rather spitefully scrubbed Edgar's face, saying it served him right for meddling. His sister began weeping, and Cathy stood by confounded.\n'You should not have spoken to him!' she reproved Master Linton. 'He was in a bad temper, and now he'll be flogged: I hate him to be flogged! I can't eat my dinner. Why did you speak to him, Edgar?'\n'I didn't,' sobbed the youth. 'I promised mamma that I wouldn't say one word to him, and I didn't.'\n'Well, don't cry,' replied Catherine, contemptuously; 'you're not killed. My brother is coming: be quiet! Hush, Isabella! Has anybody hurt you?'\n'To your seats, children!' cried Hindley, bustling in. 'That brute of a lad has warmed me nicely. Next time, Master Edgar, take the law into your own fists - it will give you an appetite!'\nThe little party recovered at sight of the feast. They were hungry, and easily consoled. Mr. Earnshaw carved generous platefuls, and the mistress made them merry with lively talk. I was pained to see Catherine, with dry eyes and an indifferent air, cutting up her goose.\n'An unfeeling child,' I thought; 'I could not have imagined her to be so selfish.' She lifted a mouthful to her lips: then she set it down: her cheeks flushed, and the tears fell. She slipped her fork to the floor, and hastily dived under the cloth to conceal her emotion. I did not call her unfeeling for long: for I saw that all day she was in purgatory, looking for a chance of paying a visit to Heathcliff, who had been locked up by the master.\nIn the evening we had a dance. Cathy begged that Heathcliff might be freed, as Isabella Linton had no partner: her entreaties were vain, and I was made to fill in instead. We got rid of all gloom in the excitement, and our pleasure was increased by the arrival of the Gimmerton band: a trumpet, a trombone, clarionets, bassoons, French horns, and a bass viol, besides singers. After the carols, we set them to songs and glees. Mrs. Earnshaw loved the music.\nCatherine loved it too: but she said it sounded sweetest at the top of the steps, and she went up in the dark. I followed; they never noted our absence. Catherine mounted to the garret where Heathcliff was confined, and called him. He would not answer; but she persevered, and finally persuaded him to talk with her through the door. I let the poor things alone, till the songs were about to end; then I clambered up the ladder to warn her.\nInstead of finding her outside, I heard her voice within. The little monkey had crept out by the skylight of one garret, along the roof, and into the skylight of the other, and it was with the greatest difficulty that I could coax her out again. When she came, Heathcliff came with her, and she insisted that I should take him into the kitchen, since Joseph had gone to a neighbour's to get away from the sound of our 'devil's music.'\nAs Heathcliff had not eaten since yesterday's dinner, I let him go down: I set him on a stool by the fire, and offered him good things: but he was sick and could eat little. He leant his chin on his hands in meditation. On my inquiring the subject of his thoughts, he answered gravely:\n'I'm trying to settle how I shall pay Hindley back. I don't care how long I wait, if I can only do it at last. I hope he will not die first!'\n'For shame, Heathcliff!' said I. 'It is for God to punish wicked people; we should learn to forgive.'\n'No, God won't have the satisfaction that I shall,' he returned. 'I only wish I knew the best way! Let me alone, and I'll plan it: while I'm thinking of that I don't feel pain.'\n'But, Mr. Lockwood,' (said Mrs. Dean) 'I forget these tales cannot divert you. How I chatter on, when your gruel is cold, and you are nodding for bed! I could have told Heathcliff's history in half a dozen words.'\nThus interrupting herself, the housekeeper rose; but I felt very far from sleeping.\n'Do sit another half-hour,' I cried. 'I like to hear the story told leisurely: I am interested in every character.'\n'It is eleven o'clock, sir.'\n'No matter - I shall lie in till ten tomorrow. Mrs. Dean, go on.'\n'Well, sir, you must allow me to leap over some three years. During that space Mrs. Earnshaw-'\n'No, no, I'll allow nothing of the sort! Continue in detail. I see that people in these lonely regions live more in earnest, more in themselves, and less in frivolous external things, than in the town. I could fancy a love of life here almost possible; it is like a simple, honest meal compared to a banquet laid out by French chefs.'\n'Oh! here we are the same as anywhere else, when you get to know us,' observed Mrs. Dean, somewhat puzzled.\n'Excuse me,' I responded; 'you, my good friend, are evidence against that assertion. I am sure you have thought a great deal more than most servants think.'\nMrs. Dean laughed.\n'I certainly judge myself a steady, reasonable kind of body,' she said; 'not exactly from living among the hills; but I have undergone sharp discipline, which has taught me wisdom; and I have read more than you would fancy, Mr. Lockwood. You could not open a book in this library that I have not looked into. However, I had better go on; and instead of leaping three years, I will pass to the next summer - that of 1778, nearly twenty-three years ago.'",
        "paragraph_chars": [
            [
                0,
                257
            ],
            [
                257,
                556
            ],
            [
                556,
                716
            ],
            [
                716,
                862
            ],
            [
                862,
                1269
            ],
            [
                1269,
                1708
            ],
            [
                1708,
                1856
            ],
            [
                1856,
                1995
            ],
            [
                1995,
                2291
            ],
            [
                2291,
                2324
            ],
            [
                2324,
                2422
            ],
            [
                2422,
                2577
            ],
            [
                2577,
                2702
            ],
            [
                2702,
                2823
            ],
            [
                2823,
                2972
            ],
            [
                2972,
                3180
            ],
            [
                3180,
                3758
            ],
            [
                3758,
                4321
            ],
            [
                4321,
                4492
            ],
            [
                4492,
                4739
            ],
            [
                4739,
                4776
            ],
            [
                4776,
                4840
            ],
            [
                4840,
                5191
            ],
            [
                5191,
                5387
            ],
            [
                5387,
                5524
            ],
            [
                5524,
                5631
            ],
            [
                5631,
                5694
            ],
            [
                5694,
                5749
            ],
            [
                5749,
                5831
            ],
            [
                5831,
                6269
            ],
            [
                6269,
                6352
            ],
            [
                6352,
                6549
            ],
            [
                6549,
                7091
            ],
            [
                7091,
                7210
            ],
            [
                7210,
                7588
            ],
            [
                7588,
                8051
            ],
            [
                8051,
                8451
            ],
            [
                8451,
                8527
            ],
            [
                8527,
                8763
            ],
            [
                8763,
                8886
            ],
            [
                8886,
                9198
            ],
            [
                9198,
                9362
            ],
            [
                9362,
                9561
            ],
            [
                9561,
                9661
            ],
            [
                9661,
                9806
            ],
            [
                9806,
                9995
            ],
            [
                9995,
                10266
            ],
            [
                10266,
                10715
            ],
            [
                10715,
                11173
            ],
            [
                11173,
                11614
            ],
            [
                11614,
                12049
            ],
            [
                12049,
                12335
            ],
            [
                12335,
                12477
            ],
            [
                12477,
                12579
            ],
            [
                12579,
                12757
            ],
            [
                12757,
                12971
            ],
            [
                12971,
                13055
            ],
            [
                13055,
                13171
            ],
            [
                13171,
                13200
            ],
            [
                13200,
                13266
            ],
            [
                13266,
                13361
            ],
            [
                13361,
                13696
            ],
            [
                13696,
                13804
            ],
            [
                13804,
                13961
            ],
            [
                13961,
                13980
            ],
            [
                13980,
                14432
            ]
        ],
        "segment_chars": [
            [
                0,
                63
            ],
            [
                63,
                128
            ],
            [
                128,
                257
            ],
            [
                257,
                556
            ],
            [
                556,
                624
            ],
            [
                624,
                650
            ],
            [
                650,
                716
            ],
            [
                716,
                813
            ],
            [
                813,
                862
            ],
            [
                862,
                951
            ],
            [
                951,
                1088
            ],
            [
                1088,
                1228
            ],
            [
                1228,
                1269
            ],
            [
                1269,
                1298
            ],
            [
                1298,
                1401
            ],
            [
                1401,
                1503
            ],
            [
                1503,
                1610
            ],
            [
                1610,
                1708
            ],
            [
                1708,
                1734
            ],
            [
                1734,
                1856
            ],
            [
                1856,
                1930
            ],
            [
                1930,
                1995
            ],
            [
                1995,
                2167
            ],
            [
                2167,
                2191
            ],
            [
                2191,
                2249
            ],
            [
                2249,
                2291
            ],
            [
                2291,
                2324
            ],
            [
                2324,
                2422
            ],
            [
                2422,
                2520
            ],
            [
                2520,
                2577
            ],
            [
                2577,
                2621
            ],
            [
                2621,
                2644
            ],
            [
                2644,
                2663
            ],
            [
                2663,
                2702
            ],
            [
                2702,
                2823
            ],
            [
                2823,
                2854
            ],
            [
                2854,
                2892
            ],
            [
                2892,
                2972
            ],
            [
                2972,
                3180
            ],
            [
                3180,
                3388
            ],
            [
                3388,
                3535
            ],
            [
                3535,
                3758
            ],
            [
                3758,
                4007
            ],
            [
                4007,
                4116
            ],
            [
                4116,
                4321
            ],
            [
                4321,
                4446
            ],
            [
                4446,
                4492
            ],
            [
                4492,
                4518
            ],
            [
                4518,
                4739
            ],
            [
                4739,
                4776
            ],
            [
                4776,
                4794
            ],
            [
                4794,
                4807
            ],
            [
                4807,
                4840
            ],
            [
                4840,
                4882
            ],
            [
                4882,
                5054
            ],
            [
                5054,
                5116
            ],
            [
                5116,
                5191
            ],
            [
                5191,
                5300
            ],
            [
                5300,
                5364
            ],
            [
                5364,
                5387
            ],
            [
                5387,
                5492
            ],
            [
                5492,
                5524
            ],
            [
                5524,
                5631
            ],
            [
                5631,
                5662
            ],
            [
                5662,
                5694
            ],
            [
                5694,
                5749
            ],
            [
                5749,
                5831
            ],
            [
                5831,
                5922
            ],
            [
                5922,
                5966
            ],
            [
                5966,
                6005
            ],
            [
                6005,
                6097
            ],
            [
                6097,
                6146
            ],
            [
                6146,
                6269
            ],
            [
                6269,
                6352
            ],
            [
                6352,
                6453
            ],
            [
                6453,
                6549
            ],
            [
                6549,
                6688
            ],
            [
                6688,
                6735
            ],
            [
                6735,
                6755
            ],
            [
                6755,
                6913
            ],
            [
                6913,
                7023
            ],
            [
                7023,
                7091
            ],
            [
                7091,
                7169
            ],
            [
                7169,
                7210
            ],
            [
                7210,
                7326
            ],
            [
                7326,
                7414
            ],
            [
                7414,
                7441
            ],
            [
                7441,
                7522
            ],
            [
                7522,
                7588
            ],
            [
                7588,
                7757
            ],
            [
                7757,
                7946
            ],
            [
                7946,
                8051
            ],
            [
                8051,
                8193
            ],
            [
                8193,
                8372
            ],
            [
                8372,
                8451
            ],
            [
                8451,
                8527
            ],
            [
                8527,
                8607
            ],
            [
                8607,
                8630
            ],
            [
                8630,
                8636
            ],
            [
                8636,
                8677
            ],
            [
                8677,
                8763
            ],
            [
                8763,
                8886
            ],
            [
                8886,
                9004
            ],
            [
                9004,
                9079
            ],
            [
                9079,
                9198
            ],
            [
                9198,
                9305
            ],
            [
                9305,
                9362
            ],
            [
                9362,
                9399
            ],
            [
                9399,
                9427
            ],
            [
                9427,
                9504
            ],
            [
                9504,
                9527
            ],
            [
                9527,
                9561
            ],
            [
                9561,
                9591
            ],
            [
                9591,
                9661
            ],
            [
                9661,
                9735
            ],
            [
                9735,
                9767
            ],
            [
                9767,
                9783
            ],
            [
                9783,
                9806
            ],
            [
                9806,
                9833
            ],
            [
                9833,
                9861
            ],
            [
                9861,
                9904
            ],
            [
                9904,
                9995
            ],
            [
                9995,
                10045
            ],
            [
                10045,
                10084
            ],
            [
                10084,
                10175
            ],
            [
                10175,
                10266
            ],
            [
                10266,
                10349
            ],
            [
                10349,
                10446
            ],
            [
                10446,
                10539
            ],
            [
                10539,
                10715
            ],
            [
                10715,
                10746
            ],
            [
                10746,
                10887
            ],
            [
                10887,
                11092
            ],
            [
                11092,
                11142
            ],
            [
                11142,
                11173
            ],
            [
                11173,
                11284
            ],
            [
                11284,
                11326
            ],
            [
                11326,
                11405
            ],
            [
                11405,
                11507
            ],
            [
                11507,
                11614
            ],
            [
                11614,
                11672
            ],
            [
                11672,
                11860
            ],
            [
                11860,
                12049
            ],
            [
                12049,
                12223
            ],
            [
                12223,
                12269
            ],
            [
                12269,
                12335
            ],
            [
                12335,
                12387
            ],
            [
                12387,
                12446
            ],
            [
                12446,
                12477
            ],
            [
                12477,
                12502
            ],
            [
                12502,
                12510
            ],
            [
                12510,
                12579
            ],
            [
                12579,
                12644
            ],
            [
                12644,
                12678
            ],
            [
                12678,
                12757
            ],
            [
                12757,
                12836
            ],
            [
                12836,
                12908
            ],
            [
                12908,
                12971
            ],
            [
                12971,
                13055
            ],
            [
                13055,
                13092
            ],
            [
                13092,
                13171
            ],
            [
                13171,
                13200
            ],
            [
                13200,
                13247
            ],
            [
                13247,
                13266
            ],
            [
                13266,
                13327
            ],
            [
                13327,
                13361
            ],
            [
                13361,
                13402
            ],
            [
                13402,
                13422
            ],
            [
                13422,
                13563
            ],
            [
                13563,
                13696
            ],
            [
                13696,
                13701
            ],
            [
                13701,
                13804
            ],
            [
                13804,
                13889
            ],
            [
                13889,
                13961
            ],
            [
                13961,
                13980
            ],
            [
                13980,
                14218
            ],
            [
                14218,
                14289
            ],
            [
                14289,
                14432
            ]
        ],
        "overlap_chars": [
            [
                0,
                63
            ],
            [
                63,
                89
            ],
            [
                90,
                128
            ],
            [
                142,
                159
            ],
            [
                159,
                164
            ],
            [
                171,
                192
            ],
            [
                202,
                205
            ],
            [
                206,
                255
            ],
            [
                257,
                259
            ],
            [
                259,
                373
            ],
            [
                380,
                454
            ],
            [
                455,
                465
            ],
            [
                472,
                473
            ],
            [
                478,
                528
            ],
            [
                532,
                555
            ],
            [
                556,
                563
            ],
            [
                574,
                586
            ],
            [
                588,
                624
            ],
            [
                624,
                650
            ],
            [
                650,
                713
            ],
            [
                717,
                737
            ],
            [
                747,
                763
            ],
            [
                766,
                783
            ],
            [
                784,
                787
            ],
            [
                791,
                813
            ],
            [
                813,
                859
            ],
            [
                862,
                875
            ],
            [
                888,
                911
            ],
            [
                912,
                919
            ],
            [
                920,
                930
            ],
            [
                931,
                934
            ],
            [
                944,
                949
            ],
            [
                951,
                1014
            ],
            [
                1014,
                1060
            ],
            [
                1065,
                1088
            ],
            [
                1088,
                1156
            ],
            [
                1167,
                1170
            ],
            [
                1171,
                1228
            ],
            [
                1228,
                1267
            ],
            [
                1267,
                1269
            ],
            [
                1269,
                1291
            ],
            [
                1296,
                1298
            ],
            [
                1298,
                1401
            ],
            [
                1401,
                1489
            ],
            [
                1490,
                1501
            ],
            [
                1501,
                1503
            ],
            [
                1503,
                1514
            ],
            [
                1520,
                1533
            ],
            [
                1534,
                1539
            ],
            [
                1540,
                1543
            ],
            [
                1544,
                1548
            ],
            [
                1549,
                1552
            ],
            [
                1553,
                1561
            ],
            [
                1561,
                1562
            ],
            [
                1563,
                1566
            ],
            [
                1567,
                1585
            ],
            [
                1591,
                1602
            ],
            [
                1606,
                1610
            ],
            [
                1610,
                1685
            ],
            [
                1691,
                1706
            ],
            [
                1706,
                1707
            ],
            [
                1709,
                1731
            ],
            [
                1734,
                1856
            ],
            [
                1857,
                1868
            ],
            [
                1869,
                1881
            ],
            [
                1884,
                1928
            ],
            [
                1928,
                1930
            ],
            [
                1931,
                1992
            ],
            [
                1995,
                2000
            ],
            [
                2001,
                2069
            ],
            [
                2081,
                2093
            ],
            [
                2094,
                2125
            ],
            [
                2127,
                2167
            ],
            [
                2167,
                2170
            ],
            [
                2171,
                2191
            ],
            [
                2191,
                2249
            ],
            [
                2249,
                2288
            ],
            [
                2297,
                2306
            ],
            [
                2307,
                2315
            ],
            [
                2322,
                2324
            ],
            [
                2331,
                2348
            ],
            [
                2351,
                2386
            ],
            [
                2388,
                2419
            ],
            [
                2423,
                2434
            ],
            [
                2437,
                2481
            ],
            [
                2483,
                2517
            ],
            [
                2520,
                2537
            ],
            [
                2542,
                2577
            ],
            [
                2578,
                2608
            ],
            [
                2611,
                2619
            ],
            [
                2622,
                2644
            ],
            [
                2648,
                2661
            ],
            [
                2661,
                2663
            ],
            [
                2663,
                2690
            ],
            [
                2691,
                2699
            ],
            [
                2702,
                2809
            ],
            [
                2821,
                2823
            ],
            [
                2824,
                2851
            ],
            [
                2854,
                2866
            ],
            [
                2867,
                2892
            ],
            [
                2893,
                2969
            ],
            [
                2972,
                2991
            ],
            [
                2992,
                3114
            ],
            [
                3126,
                3167
            ],
            [
                3168,
                3180
            ],
            [
                3180,
                3212
            ],
            [
                3221,
                3343
            ],
            [
                3348,
                3352
            ],
            [
                3353,
                3355
            ],
            [
                3356,
                3386
            ],
            [
                3386,
                3388
            ],
            [
                3394,
                3395
            ],
            [
                3405,
                3406
            ],
            [
                3407,
                3417
            ],
            [
                3430,
                3451
            ],
            [
                3474,
                3533
            ],
            [
                3533,
                3535
            ],
            [
                3535,
                3569
            ],
            [
                3579,
                3733
            ],
            [
                3735,
                3755
            ],
            [
                3758,
                3787
            ],
            [
                3788,
                3841
            ],
            [
                3842,
                3847
            ],
            [
                3848,
                3963
            ],
            [
                3964,
                3976
            ],
            [
                3977,
                4007
            ],
            [
                4007,
                4008
            ],
            [
                4009,
                4015
            ],
            [
                4031,
                4034
            ],
            [
                4034,
                4082
            ],
            [
                4088,
                4090
            ],
            [
                4091,
                4101
            ],
            [
                4105,
                4114
            ],
            [
                4116,
                4205
            ],
            [
                4218,
                4223
            ],
            [
                4224,
                4228
            ],
            [
                4229,
                4281
            ],
            [
                4297,
                4309
            ],
            [
                4310,
                4320
            ],
            [
                4328,
                4329
            ],
            [
                4330,
                4332
            ],
            [
                4338,
                4348
            ],
            [
                4356,
                4389
            ],
            [
                4395,
                4411
            ],
            [
                4415,
                4427
            ],
            [
                4433,
                4446
            ],
            [
                4446,
                4457
            ],
            [
                4458,
                4469
            ],
            [
                4477,
                4490
            ],
            [
                4490,
                4492
            ],
            [
                4498,
                4515
            ],
            [
                4518,
                4525
            ],
            [
                4527,
                4581
            ],
            [
                4582,
                4604
            ],
            [
                4607,
                4630
            ],
            [
                4630,
                4736
            ],
            [
                4739,
                4741
            ],
            [
                4742,
                4776
            ],
            [
                4777,
                4791
            ],
            [
                4794,
                4807
            ],
            [
                4813,
                4833
            ],
            [
                4834,
                4837
            ],
            [
                4840,
                4848
            ],
            [
                4848,
                4882
            ],
            [
                4882,
                4947
            ],
            [
                4952,
                4971
            ],
            [
                4989,
                5054
            ],
            [
                5054,
                5056
            ],
            [
                5064,
                5099
            ],
            [
                5100,
                5116
            ],
            [
                5116,
                5121
            ],
            [
                5122,
                5160
            ],
            [
                5161,
                5164
            ],
            [
                5164,
                5176
            ],
            [
                5185,
                5189
            ],
            [
                5189,
                5190
            ],
            [
                5191,
                5224
            ],
            [
                5225,
                5263
            ],
            [
                5264,
                5279
            ],
            [
                5292,
                5300
            ],
            [
                5305,
                5307
            ],
            [
                5316,
                5319
            ],
            [
                5320,
                5338
            ],
            [
                5338,
                5339
            ],
            [
                5341,
                5362
            ],
            [
                5364,
                5384
            ],
            [
                5388,
                5409
            ],
            [
                5412,
                5419
            ],
            [
                5421,
                5424
            ],
            [
                5425,
                5429
            ],
            [
                5430,
                5492
            ],
            [
                5492,
                5521
            ],
            [
                5524,
                5537
            ],
            [
                5538,
                5545
            ],
            [
                5546,
                5629
            ],
            [
                5629,
                5631
            ],
            [
                5636,
                5659
            ],
            [
                5662,
                5664
            ],
            [
                5670,
                5694
            ],
            [
                5699,
                5729
            ],
            [
                5734,
                5746
            ],
            [
                5750,
                5755
            ],
            [
                5756,
                5757
            ],
            [
                5758,
                5774
            ],
            [
                5777,
                5789
            ],
            [
                5791,
                5828
            ],
            [
                5832,
                5911
            ],
            [
                5914,
                5922
            ],
            [
                5923,
                5941
            ],
            [
                5942,
                5966
            ],
            [
                5966,
                5985
            ],
            [
                5986,
                6005
            ],
            [
                6005,
                6032
            ],
            [
                6032,
                6084
            ],
            [
                6085,
                6095
            ],
            [
                6095,
                6097
            ],
            [
                6097,
                6144
            ],
            [
                6144,
                6146
            ],
            [
                6146,
                6170
            ],
            [
                6171,
                6266
            ],
            [
                6269,
                6352
            ],
            [
                6353,
                6453
            ],
            [
                6453,
                6501
            ],
            [
                6502,
                6506
            ],
            [
                6514,
                6541
            ],
            [
                6542,
                6546
            ],
            [
                6550,
                6583
            ],
            [
                6586,
                6594
            ],
            [
                6596,
                6625
            ],
            [
                6632,
                6640
            ],
            [
                6640,
                6688
            ],
            [
                6688,
                6735
            ],
            [
                6735,
                6746
            ],
            [
                6753,
                6755
            ],
            [
                6755,
                6761
            ],
            [
                6766,
                6828
            ],
            [
                6829,
                6833
            ],
            [
                6848,
                6849
            ],
            [
                6857,
                6861
            ],
            [
                6862,
                6881
            ],
            [
                6882,
                6887
            ],
            [
                6893,
                6913
            ],
            [
                6913,
                6981
            ],
            [
                6999,
                7008
            ],
            [
                7009,
                7012
            ],
            [
                7013,
                7021
            ],
            [
                7021,
                7023
            ],
            [
                7023,
                7060
            ],
            [
                7065,
                7069
            ],
            [
                7083,
                7088
            ],
            [
                7092,
                7154
            ],
            [
                7157,
                7169
            ],
            [
                7170,
                7207
            ],
            [
                7211,
                7261
            ],
            [
                7264,
                7276
            ],
            [
                7278,
                7314
            ],
            [
                7320,
                7326
            ],
            [
                7326,
                7371
            ],
            [
                7372,
                7377
            ],
            [
                7378,
                7381
            ],
            [
                7382,
                7414
            ],
            [
                7419,
                7441
            ],
            [
                7441,
                7520
            ],
            [
                7520,
                7522
            ],
            [
                7522,
                7585
            ],
            [
                7588,
                7685
            ],
            [
                7686,
                7738
            ],
            [
                7742,
                7745
            ],
            [
                7755,
                7757
            ],
            [
                7757,
                7758
            ],
            [
                7759,
                7762
            ],
            [
                7763,
                7780
            ],
            [
                7784,
                7799
            ],
            [
                7810,
                7814
            ],
            [
                7821,
                7882
            ],
            [
                7890,
                7946
            ],
            [
                7946,
                7992
            ],
            [
                7993,
                8049
            ],
            [
                8049,
                8051
            ],
            [
                8051,
                8098
            ],
            [
                8104,
                8140
            ],
            [
                8144,
                8152
            ],
            [
                8152,
                8175
            ],
            [
                8175,
                8176
            ],
            [
                8184,
                8191
            ],
            [
                8191,
                8193
            ],
            [
                8193,
                8248
            ],
            [
                8249,
                8264
            ],
            [
                8264,
                8289
            ],
            [
                8289,
                8290
            ],
            [
                8292,
                8372
            ],
            [
                8372,
                8414
            ],
            [
                8414,
                8448
            ],
            [
                8454,
                8459
            ],
            [
                8462,
                8463
            ],
            [
                8472,
                8473
            ],
            [
                8475,
                8494
            ],
            [
                8494,
                8499
            ],
            [
                8500,
                8502
            ],
            [
                8510,
                8524
            ],
            [
                8528,
                8589
            ],
            [
                8592,
                8607
            ],
            [
                8608,
                8630
            ],
            [
                8630,
                8636
            ],
            [
                8636,
                8677
            ],
            [
                8677,
                8760
            ],
            [
                8763,
                8765
            ],
            [
                8769,
                8792
            ],
            [
                8795,
                8844
            ],
            [
                8846,
                8883
            ],
            [
                8886,
                8917
            ],
            [
                8926,
                8951
            ],
            [
                8952,
                8971
            ],
            [
                8977,
                8980
            ],
            [
                8981,
                8998
            ],
            [
                9002,
                9004
            ],
            [
                9004,
                9041
            ],
            [
                9042,
                9055
            ],
            [
                9059,
                9077
            ],
            [
                9077,
                9079
            ],
            [
                9079,
                9115
            ],
            [
                9116,
                9119
            ],
            [
                9128,
                9196
            ],
            [
                9196,
                9197
            ],
            [
                9198,
                9257
            ],
            [
                9262,
                9263
            ],
            [
                9271,
                9305
            ],
            [
                9305,
                9329
            ],
            [
                9329,
                9360
            ],
            [
                9360,
                9362
            ],
            [
                9363,
                9396
            ],
            [
                9399,
                9402
            ],
            [
                9412,
                9427
            ],
            [
                9428,
                9459
            ],
            [
                9460,
                9504
            ],
            [
                9504,
                9527
            ],
            [
                9527,
                9558
            ],
            [
                9562,
                9570
            ],
            [
                9573,
                9589
            ],
            [
                9589,
                9591
            ],
            [
                9592,
                9658
            ],
            [
                9662,
                9677
            ],
            [
                9680,
                9714
            ],
            [
                9716,
                9735
            ],
            [
                9735,
                9767
            ],
            [
                9767,
                9783
            ],
            [
                9783,
                9803
            ],
            [
                9810,
                9820
            ],
            [
                9820,
                9830
            ],
            [
                9833,
                9861
            ],
            [
                9867,
                9904
            ],
            [
                9904,
                9992
            ],
            [
                9995,
                10021
            ],
            [
                10022,
                10037
            ],
            [
                10038,
                10045
            ],
            [
                10045,
                10061
            ],
            [
                10061,
                10082
            ],
            [
                10082,
                10084
            ],
            [
                10084,
                10103
            ],
            [
                10113,
                10175
            ],
            [
                10175,
                10176
            ],
            [
                10177,
                10190
            ],
            [
                10195,
                10243
            ],
            [
                10244,
                10254
            ],
            [
                10255,
                10258
            ],
            [
                10259,
                10264
            ],
            [
                10264,
                10265
            ],
            [
                10267,
                10285
            ],
            [
                10288,
                10297
            ],
            [
                10297,
                10298
            ],
            [
                10300,
                10346
            ],
            [
                10349,
                10404
            ],
            [
                10404,
                10439
            ],
            [
                10444,
                10446
            ],
            [
                10446,
                10539
            ],
            [
                10539,
                10567
            ],
            [
                10572,
                10576
            ],
            [
                10576,
                10577
            ],
            [
                10578,
                10583
            ],
            [
                10597,
                10600
            ],
            [
                10601,
                10621
            ],
            [
                10621,
                10622
            ],
            [
                10635,
                10636
            ],
            [
                10644,
                10646
            ],
            [
                10647,
                10713
            ],
            [
                10713,
                10715
            ],
            [
                10715,
                10746
            ],
            [
                10746,
                10766
            ],
            [
                10775,
                10783
            ],
            [
                10789,
                10861
            ],
            [
                10867,
                10869
            ],
            [
                10885,
                10887
            ],
            [
                10887,
                10928
            ],
            [
                10928,
                10997
            ],
            [
                10997,
                11092
            ],
            [
                11092,
                11101
            ],
            [
                11102,
                11108
            ],
            [
                11108,
                11142
            ],
            [
                11142,
                11171
            ],
            [
                11171,
                11173
            ],
            [
                11173,
                11282
            ],
            [
                11282,
                11283
            ],
            [
                11284,
                11294
            ],
            [
                11296,
                11300
            ],
            [
                11301,
                11306
            ],
            [
                11313,
                11324
            ],
            [
                11324,
                11326
            ],
            [
                11336,
                11343
            ],
            [
                11344,
                11405
            ],
            [
                11405,
                11407
            ],
            [
                11430,
                11474
            ],
            [
                11480,
                11500
            ],
            [
                11505,
                11507
            ],
            [
                11507,
                11528
            ],
            [
                11534,
                11540
            ],
            [
                11541,
                11555
            ],
            [
                11562,
                11564
            ],
            [
                11570,
                11613
            ],
            [
                11614,
                11672
            ],
            [
                11672,
                11699
            ],
            [
                11704,
                11750
            ],
            [
                11755,
                11806
            ],
            [
                11816,
                11826
            ],
            [
                11832,
                11860
            ],
            [
                11860,
                11868
            ],
            [
                11873,
                11958
            ],
            [
                11972,
                11997
            ],
            [
                11998,
                12000
            ],
            [
                12010,
                12031
            ],
            [
                12033,
                12040
            ],
            [
                12049,
                12051
            ],
            [
                12052,
                12054
            ],
            [
                12063,
                12066
            ],
            [
                12077,
                12104
            ],
            [
                12109,
                12112
            ],
            [
                12116,
                12131
            ],
            [
                12135,
                12171
            ],
            [
                12172,
                12221
            ],
            [
                12221,
                12223
            ],
            [
                12223,
                12231
            ],
            [
                12232,
                12253
            ],
            [
                12254,
                12256
            ],
            [
                12257,
                12269
            ],
            [
                12269,
                12333
            ],
            [
                12336,
                12387
            ],
            [
                12387,
                12446
            ],
            [
                12446,
                12468
            ],
            [
                12478,
                12499
            ],
            [
                12502,
                12510
            ],
            [
                12511,
                12576
            ],
            [
                12580,
                12628
            ],
            [
                12631,
                12644
            ],
            [
                12645,
                12678
            ],
            [
                12678,
                12708
            ],
            [
                12708,
                12754
            ],
            [
                12758,
                12775
            ],
            [
                12796,
                12836
            ],
            [
                12836,
                12841
            ],
            [
                12850,
                12852
            ],
            [
                12859,
                12869
            ],
            [
                12873,
                12886
            ],
            [
                12891,
                12908
            ],
            [
                12908,
                12946
            ],
            [
                12947,
                12968
            ],
            [
                12971,
                13018
            ],
            [
                13018,
                13030
            ],
            [
                13031,
                13044
            ],
            [
                13053,
                13054
            ],
            [
                13059,
                13062
            ],
            [
                13063,
                13080
            ],
            [
                13083,
                13090
            ],
            [
                13090,
                13092
            ],
            [
                13093,
                13099
            ],
            [
                13108,
                13111
            ],
            [
                13134,
                13168
            ],
            [
                13175,
                13177
            ],
            [
                13178,
                13184
            ],
            [
                13187,
                13192
            ],
            [
                13192,
                13197
            ],
            [
                13201,
                13214
            ],
            [
                13225,
                13227
            ],
            [
                13228,
                13236
            ],
            [
                13245,
                13246
            ],
            [
                13247,
                13257
            ],
            [
                13267,
                13271
            ],
            [
                13276,
                13325
            ],
            [
                13327,
                13358
            ],
            [
                13362,
                13402
            ],
            [
                13402,
                13410
            ],
            [
                13420,
                13422
            ],
            [
                13464,
                13517
            ],
            [
                13518,
                13543
            ],
            [
                13543,
                13544
            ],
            [
                13561,
                13563
            ],
            [
                13563,
                13583
            ],
            [
                13584,
                13586
            ],
            [
                13587,
                13613
            ],
            [
                13614,
                13616
            ],
            [
                13617,
                13619
            ],
            [
                13625,
                13626
            ],
            [
                13633,
                13634
            ],
            [
                13656,
                13660
            ],
            [
                13669,
                13687
            ],
            [
                13697,
                13701
            ],
            [
                13701,
                13763
            ],
            [
                13766,
                13802
            ],
            [
                13802,
                13804
            ],
            [
                13805,
                13814
            ],
            [
                13817,
                13829
            ],
            [
                13831,
                13855
            ],
            [
                13856,
                13889
            ],
            [
                13889,
                13938
            ],
            [
                13944,
                13958
            ],
            [
                13961,
                13980
            ],
            [
                13981,
                13992
            ],
            [
                13999,
                14039
            ],
            [
                14042,
                14051
            ],
            [
                14053,
                14092
            ],
            [
                14092,
                14164
            ],
            [
                14165,
                14218
            ],
            [
                14218,
                14287
            ],
            [
                14287,
                14289
            ],
            [
                14289,
                14296
            ],
            [
                14296,
                14360
            ],
            [
                14361,
                14386
            ],
            [
                14387,
                14391
            ],
            [
                14392,
                14400
            ],
            [
                14401,
                14430
            ]
        ],
        "row_chars": [
            [
                0,
                63
            ],
            [
                63,
                128
            ],
            [
                128,
                556
            ],
            [
                556,
                624
            ],
            [
                624,
                650
            ],
            [
                650,
                716
            ],
            [
                716,
                813
            ],
            [
                813,
                862
            ],
            [
                862,
                1088
            ],
            [
                1088,
                1228
            ],
            [
                1228,
                1269
            ],
            [
                1269,
                1298
            ],
            [
                1298,
                1401
            ],
            [
                1401,
                1503
            ],
            [
                1503,
                1610
            ],
            [
                1610,
                1708
            ],
            [
                1708,
                1734
            ],
            [
                1734,
                1856
            ],
            [
                1856,
                1930
            ],
            [
                1930,
                1995
            ],
            [
                1995,
                2167
            ],
            [
                2167,
                2191
            ],
            [
                2191,
                2249
            ],
            [
                2249,
                2291
            ],
            [
                2291,
                2324
            ],
            [
                2324,
                2422
            ],
            [
                2422,
                2520
            ],
            [
                2520,
                2520
            ],
            [
                2520,
                2577
            ],
            [
                2577,
                2644
            ],
            [
                2644,
                2663
            ],
            [
                2663,
                2702
            ],
            [
                2702,
                2823
            ],
            [
                2823,
                2854
            ],
            [
                2854,
                2892
            ],
            [
                2892,
                2972
            ],
            [
                2972,
                3180
            ],
            [
                3180,
                3388
            ],
            [
                3388,
                3535
            ],
            [
                3535,
                3758
            ],
            [
                3758,
                3758
            ],
            [
                3758,
                4007
            ],
            [
                4007,
                4321
            ],
            [
                4321,
                4446
            ],
            [
                4446,
                4492
            ],
            [
                4492,
                4518
            ],
            [
                4518,
                4739
            ],
            [
                4739,
                4776
            ],
            [
                4776,
                4794
            ],
            [
                4794,
                4807
            ],
            [
                4807,
                4840
            ],
            [
                4840,
                4882
            ],
            [
                4882,
                5054
            ],
            [
                5054,
                5116
            ],
            [
                5116,
                5191
            ],
            [
                5191,
                5300
            ],
            [
                5300,
                5300
            ],
            [
                5300,
                5387
            ],
            [
                5387,
                5492
            ],
            [
                5492,
                5524
            ],
            [
                5524,
                5631
            ],
            [
                5631,
                5662
            ],
            [
                5662,
                5694
            ],
            [
                5694,
                5749
            ],
            [
                5749,
                5831
            ],
            [
                5831,
                5922
            ],
            [
                5922,
                5966
            ],
            [
                5966,
                6005
            ],
            [
                6005,
                6097
            ],
            [
                6097,
                6146
            ],
            [
                6146,
                6269
            ],
            [
                6269,
                6352
            ],
            [
                6352,
                6453
            ],
            [
                6453,
                6549
            ],
            [
                6549,
                6688
            ],
            [
                6688,
                6735
            ],
            [
                6735,
                6755
            ],
            [
                6755,
                6913
            ],
            [
                6913,
                7023
            ],
            [
                7023,
                7091
            ],
            [
                7091,
                7169
            ],
            [
                7169,
                7210
            ],
            [
                7210,
                7326
            ],
            [
                7326,
                7414
            ],
            [
                7414,
                7414
            ],
            [
                7414,
                7441
            ],
            [
                7441,
                7522
            ],
            [
                7522,
                7588
            ],
            [
                7588,
                7588
            ],
            [
                7588,
                7757
            ],
            [
                7757,
                7946
            ],
            [
                7946,
                8051
            ],
            [
                8051,
                8193
            ],
            [
                8193,
                8372
            ],
            [
                8372,
                8451
            ],
            [
                8451,
                8527
            ],
            [
                8527,
                8607
            ],
            [
                8607,
                8630
            ],
            [
                8630,
                8636
            ],
            [
                8636,
                8677
            ],
            [
                8677,
                8763
            ],
            [
                8763,
                8886
            ],
            [
                8886,
                9004
            ],
            [
                9004,
                9079
            ],
            [
                9079,
                9198
            ],
            [
                9198,
                9305
            ],
            [
                9305,
                9362
            ],
            [
                9362,
                9399
            ],
            [
                9399,
                9427
            ],
            [
                9427,
                9504
            ],
            [
                9504,
                9527
            ],
            [
                9527,
                9561
            ],
            [
                9561,
                9591
            ],
            [
                9591,
                9661
            ],
            [
                9661,
                9735
            ],
            [
                9735,
                9767
            ],
            [
                9767,
                9783
            ],
            [
                9783,
                9806
            ],
            [
                9806,
                9833
            ],
            [
                9833,
                9861
            ],
            [
                9861,
                9904
            ],
            [
                9904,
                9995
            ],
            [
                9995,
                10045
            ],
            [
                10045,
                10084
            ],
            [
                10084,
                10175
            ],
            [
                10175,
                10266
            ],
            [
                10266,
                10349
            ],
            [
                10349,
                10446
            ],
            [
                10446,
                10539
            ],
            [
                10539,
                10715
            ],
            [
                10715,
                10746
            ],
            [
                10746,
                10887
            ],
            [
                10887,
                11092
            ],
            [
                11092,
                11092
            ],
            [
                11092,
                11142
            ],
            [
                11142,
                11173
            ],
            [
                11173,
                11326
            ],
            [
                11326,
                11405
            ],
            [
                11405,
                11507
            ],
            [
                11507,
                11614
            ],
            [
                11614,
                11672
            ],
            [
                11672,
                11860
            ],
            [
                11860,
                12049
            ],
            [
                12049,
                12223
            ],
            [
                12223,
                12269
            ],
            [
                12269,
                12387
            ],
            [
                12387,
                12446
            ],
            [
                12446,
                12477
            ],
            [
                12477,
                12502
            ],
            [
                12502,
                12510
            ],
            [
                12510,
                12579
            ],
            [
                12579,
                12644
            ],
            [
                12644,
                12678
            ],
            [
                12678,
                12757
            ],
            [
                12757,
                12836
            ],
            [
                12836,
                12908
            ],
            [
                12908,
                12971
            ],
            [
                12971,
                12971
            ],
            [
                12971,
                13055
            ],
            [
                13055,
                13092
            ],
            [
                13092,
                13092
            ],
            [
                13092,
                13171
            ],
            [
                13171,
                13200
            ],
            [
                13200,
                13247
            ],
            [
                13247,
                13247
            ],
            [
                13247,
                13247
            ],
            [
                13247,
                13247
            ],
            [
                13247,
                13266
            ],
            [
                13266,
                13266
            ],
            [
                13266,
                13266
            ],
            [
                13266,
                13361
            ],
            [
                13361,
                13402
            ],
            [
                13402,
                13402
            ],
            [
                13402,
                13402
            ],
            [
                13402,
                13402
            ],
            [
                13402,
                13422
            ],
            [
                13422,
                13422
            ],
            [
                13422,
                13563
            ],
            [
                13563,
                13696
            ],
            [
                13696,
                13701
            ],
            [
                13701,
                13804
            ],
            [
                13804,
                13889
            ],
            [
                13889,
                13889
            ],
            [
                13889,
                13961
            ],
            [
                13961,
                13961
            ],
            [
                13961,
                13980
            ],
            [
                13980,
                14218
            ],
            [
                14218,
                14289
            ],
            [
                14289,
                14432
            ]
        ]
    }
}