{
    "original": {
        "text": "A charming introduction to a hermit's life! Four weeks' torture, tossing, and sickness! Oh, these bleak winds and bitter northern skies, and impassable roads, and dilatory country surgeons! And oh, this dearth of the human physiognomy! and, worse than all, the terrible intimation of Kenneth that I need not expect to be out of doors till spring!\nMr. Heathcliff has just honoured me with a call. About seven days ago he sent me a brace of grouse-the last of the season. Scoundrel! He is not altogether guiltless in this illness of mine; and that I had a great mind to tell him. But, alas! how could I offend a man who was charitable enough to sit at my bedside a good hour, and talk on some other subject than pills and draughts, blisters and leeches? This is quite an easy interval. I am too weak to read; yet I feel as if I could enjoy something interesting. Why not have up Mrs. Dean to finish her tale? I can recollect its chief incidents, as far as she had gone. Yes: I remember her hero had run off, and never been heard of for three years; and the heroine was married. I'll ring: she'll be delighted to find me capable of talking cheerfully. Mrs. Dean came.\n\"It wants twenty minutes, sir, to taking the medicine,\" she commenced.\n\"Away, away with it!\" I replied; \"I desire to have-\"\n\"The doctor says you must drop the powders.\"\n\"With all my heart! Don't interrupt me. Come and take your seat here. Keep your fingers from that bitter phalanx of vials. Draw your knitting out of your pocket-that will do-now continue the history of Mr. Heathcliff, from where you left off, to the present day. Did he finish his education on the Continent, and come back a gentleman? or did he get a sizar's place at college, or escape to America, and earn honours by drawing blood from his foster-country? or make a fortune more promptly on the English highways?\"\n\"He may have done a little in all these vocations, Mr. Lockwood; but I couldn't give my word for any. I stated before that I didn't know how he gained his money; neither am I aware of the means he took to raise his mind from the savage ignorance into which it was sunk: but, with your leave, I'll proceed in my own fashion, if you think it will amuse and not weary you. Are you feeling better this morning?\"\n\"Much.\"\n\"That's good news.\"\n* * * * *\nI got Miss Catherine and myself to Thrushcross Grange; and, to my agreeable disappointment, she behaved infinitely better than I dared to expect. She seemed almost over-fond of Mr. Linton; and even to his sister she showed plenty of affection. They were both very attentive to her comfort, certainly. It was not the thorn bending to the honeysuckles, but the honeysuckles embracing the thorn. There were no mutual concessions: one stood erect, and the others yielded: and who can be ill-natured and bad-tempered when they encounter neither opposition nor indifference? I observed that Mr. Edgar had a deep-rooted fear of ruffling her humour. He concealed it from her; but if ever he heard me answer sharply, or saw any other servant grow cloudy at some imperious order of hers, he would show his trouble by a frown of displeasure that never darkened on his own account. He many a time spoke sternly to me about my pertness; and averred that the stab of a knife could not inflict a worse pang than he suffered at seeing his lady vexed. Not to grieve a kind master, I learned to be less touchy; and, for the space of half a year, the gunpowder lay as harmless as sand, because no fire came near to explode it. Catherine had seasons of gloom and silence now and then: they were respected with sympathising silence by her husband, who ascribed them to an alteration in her constitution, produced by her perilous illness; as she was never subject to depression of spirits before. The return of sunshine was welcomed by answering sunshine from him. I believe I may assert that they were really in possession of deep and growing happiness.\nIt ended. Well, we _must_ be for ourselves in the long run; the mild and generous are only more justly selfish than the domineering; and it ended when circumstances caused each to feel that the one's interest was not the chief consideration in the other's thoughts. On a mellow evening in September, I was coming from the garden with a heavy basket of apples which I had been gathering. It had got dusk, and the moon looked over the high wall of the court, causing undefined shadows to lurk in the corners of the numerous projecting portions of the building. I set my burden on the house-steps by the kitchen-door, and lingered to rest, and drew in a few more breaths of the soft, sweet air; my eyes were on the moon, and my back to the entrance, when I heard a voice behind me say,-\"Nelly, is that you?\"\nIt was a deep voice, and foreign in tone; yet there was something in the manner of pronouncing my name which made it sound familiar. I turned about to discover who spoke, fearfully; for the doors were shut, and I had seen nobody on approaching the steps. Something stirred in the porch; and, moving nearer, I distinguished a tall man dressed in dark clothes, with dark face and hair. He leant against the side, and held his fingers on the latch as if intending to open for himself. \"Who can it be?\" I thought. \"Mr. Earnshaw? Oh, no! The voice has no resemblance to his.\"\n\"I have waited here an hour,\" he resumed, while I continued staring; \"and the whole of that time all round has been as still as death. I dared not enter. You do not know me? Look, I'm not a stranger!\"\nA ray fell on his features; the cheeks were sallow, and half covered with black whiskers; the brows lowering, the eyes deep-set and singular. I remembered the eyes.\n\"What!\" I cried, uncertain whether to regard him as a worldly visitor, and I raised my hands in amazement. \"What! you come back? Is it really you? Is it?\"\n\"Yes, Heathcliff,\" he replied, glancing from me up to the windows, which reflected a score of glittering moons, but showed no lights from within. \"Are they at home? where is she? Nelly, you are not glad! you needn't be so disturbed. Is she here? Speak! I want to have one word with her-your mistress. Go, and say some person from Gimmerton desires to see her.\"\n\"How will she take it?\" I exclaimed. \"What will she do? The surprise bewilders me-it will put her out of her head! And you _are_ Heathcliff! But altered! Nay, there's no comprehending it. Have you been for a soldier?\"\n\"Go and carry my message,\" he interrupted, impatiently. \"I'm in hell till you do!\"\nHe lifted the latch, and I entered; but when I got to the parlour where Mr. and Mrs. Linton were, I could not persuade myself to proceed. At length I resolved on making an excuse to ask if they would have the candles lighted, and I opened the door.\nThey sat together in a window whose lattice lay back against the wall, and displayed, beyond the garden trees, and the wild green park, the valley of Gimmerton, with a long line of mist winding nearly to its top (for very soon after you pass the chapel, as you may have noticed, the sough that runs from the marshes joins a beck which follows the bend of the glen). Wuthering Heights rose above this silvery vapour; but our old house was invisible; it rather dips down on the other side. Both the room and its occupants, and the scene they gazed on, looked wondrously peaceful. I shrank reluctantly from performing my errand; and was actually going away leaving it unsaid, after having put my question about the candles, when a sense of my folly compelled me to return, and mutter, \"A person from Gimmerton wishes to see you ma'am.\"\n\"What does he want?\" asked Mrs. Linton.\n\"I did not question him,\" I answered.\n\"Well, close the curtains, Nelly,\" she said; \"and bring up tea. I'll be back again directly.\"\nShe quitted the apartment; Mr. Edgar inquired, carelessly, who it was.\n\"Some one mistress does not expect,\" I replied. \"That Heathcliff-you recollect him, sir-who used to live at Mr. Earnshaw's.\"\n\"What! the gipsy-the ploughboy?\" he cried. \"Why did you not say so to Catherine?\"\n\"Hush! you must not call him by those names, master,\" I said. \"She'd be sadly grieved to hear you. She was nearly heartbroken when he ran off. I guess his return will make a jubilee to her.\"\nMr. Linton walked to a window on the other side of the room that overlooked the court. He unfastened it, and leant out. I suppose they were below, for he exclaimed quickly: \"Don't stand there, love! Bring the person in, if it be anyone particular.\" Ere long, I heard the click of the latch, and Catherine flew upstairs, breathless and wild; too excited to show gladness: indeed, by her face, you would rather have surmised an awful calamity.\n\"Oh, Edgar, Edgar!\" she panted, flinging her arms round his neck. \"Oh, Edgar darling! Heathcliff's come back-he is!\" And she tightened her embrace to a squeeze.\n\"Well, well,\" cried her husband, crossly, \"don't strangle me for that! He never struck me as such a marvellous treasure. There is no need to be frantic!\"\n\"I know you didn't like him,\" she answered, repressing a little the intensity of her delight. \"Yet, for my sake, you must be friends now. Shall I tell him to come up?\"\n\"Here,\" he said, \"into the parlour?\"\n\"Where else?\" she asked.\nHe looked vexed, and suggested the kitchen as a more suitable place for him. Mrs. Linton eyed him with a droll expression-half angry, half laughing at his fastidiousness.\n\"No,\" she added, after a while; \"I cannot sit in the kitchen. Set two tables here, Ellen: one for your master and Miss Isabella, being gentry; the other for Heathcliff and myself, being of the lower orders. Will that please you, dear? Or must I have a fire lighted elsewhere? If so, give directions. I'll run down and secure my guest. I'm afraid the joy is too great to be real!\"\nShe was about to dart off again; but Edgar arrested her.\n\"_You_ bid him step up,\" he said, addressing me; \"and, Catherine, try to be glad, without being absurd. The whole household need not witness the sight of your welcoming a runaway servant as a brother.\"\nI descended, and found Heathcliff waiting under the porch, evidently anticipating an invitation to enter. He followed my guidance without waste of words, and I ushered him into the presence of the master and mistress, whose flushed cheeks betrayed signs of warm talking. But the lady's glowed with another feeling when her friend appeared at the door: she sprang forward, took both his hands, and led him to Linton; and then she seized Linton's reluctant fingers and crushed them into his. Now, fully revealed by the fire and candlelight, I was amazed, more than ever, to behold the transformation of Heathcliff. He had grown a tall, athletic, well-formed man; beside whom my master seemed quite slender and youth-like. His upright carriage suggested the idea of his having been in the army. His countenance was much older in expression and decision of feature than Mr. Linton's; it looked intelligent, and retained no marks of former degradation. A half-civilised ferocity lurked yet in the depressed brows and eyes full of black fire, but it was subdued; and his manner was even dignified: quite divested of roughness, though stern for grace. My master's surprise equalled or exceeded mine: he remained for a minute at a loss how to address the ploughboy, as he had called him. Heathcliff dropped his slight hand, and stood looking at him coolly till he chose to speak.\n\"Sit down, sir,\" he said, at length. \"Mrs. Linton, recalling old times, would have me give you a cordial reception; and, of course, I am gratified when anything occurs to please her.\"\n\"And I also,\" answered Heathcliff, \"especially if it be anything in which I have a part. I shall stay an hour or two willingly.\"\nHe took a seat opposite Catherine, who kept her gaze fixed on him as if she feared he would vanish were she to remove it. He did not raise his to her often: a quick glance now and then sufficed; but it flashed back, each time more confidently, the undisguised delight he drank from hers. They were too much absorbed in their mutual joy to suffer embarrassment. Not so Mr. Edgar: he grew pale with pure annoyance: a feeling that reached its climax when his lady rose, and stepping across the rug, seized Heathcliff's hands again, and laughed like one beside herself.\n\"I shall think it a dream to-morrow!\" she cried. \"I shall not be able to believe that I have seen, and touched, and spoken to you once more. And yet, cruel Heathcliff! you don't deserve this welcome. To be absent and silent for three years, and never to think of me!\"\n\"A little more than you have thought of me,\" he murmured. \"I heard of your marriage, Cathy, not long since; and, while waiting in the yard below, I meditated this plan-just to have one glimpse of your face, a stare of surprise, perhaps, and pretended pleasure; afterwards settle my score with Hindley; and then prevent the law by doing execution on myself. Your welcome has put these ideas out of my mind; but beware of meeting me with another aspect next time! Nay, you'll not drive me off again. You were really sorry for me, were you? Well, there was cause. I've fought through a bitter life since I last heard your voice; and you must forgive me, for I struggled only for you!\"\n\"Catherine, unless we are to have cold tea, please to come to the table,\" interrupted Linton, striving to preserve his ordinary tone, and a due measure of politeness. \"Mr. Heathcliff will have a long walk, wherever he may lodge to-night; and I'm thirsty.\"\nShe took her post before the urn; and Miss Isabella came, summoned by the bell; then, having handed their chairs forward, I left the room. The meal hardly endured ten minutes. Catherine's cup was never filled: she could neither eat nor drink. Edgar had made a slop in his saucer, and scarcely swallowed a mouthful. Their guest did not protract his stay that evening above an hour longer. I asked, as he departed, if he went to Gimmerton?\n\"No, to Wuthering Heights,\" he answered: \"Mr. Earnshaw invited me, when I called this morning.\"\nMr. Earnshaw invited _him_! and _he_ called on Mr. Earnshaw! I pondered this sentence painfully, after he was gone. Is he turning out a bit of a hypocrite, and coming into the country to work mischief under a cloak? I mused: I had a presentiment in the bottom of my heart that he had better have remained away.\nAbout the middle of the night, I was wakened from my first nap by Mrs. Linton gliding into my chamber, taking a seat on my bedside, and pulling me by the hair to rouse me.\n\"I cannot rest, Ellen,\" she said, by way of apology. \"And I want some living creature to keep me company in my happiness! Edgar is sulky, because I'm glad of a thing that does not interest him: he refuses to open his mouth, except to utter pettish, silly speeches; and he affirmed I was cruel and selfish for wishing to talk when he was so sick and sleepy. He always contrives to be sick at the least cross! I gave a few sentences of commendation to Heathcliff, and he, either for a headache or a pang of envy, began to cry: so I got up and left him.\"\n\"What use is it praising Heathcliff to him?\" I answered. \"As lads they had an aversion to each other, and Heathcliff would hate just as much to hear him praised: it's human nature. Let Mr. Linton alone about him, unless you would like an open quarrel between them.\"\n\"But does it not show great weakness?\" pursued she. \"I'm not envious: I never feel hurt at the brightness of Isabella's yellow hair and the whiteness of her skin, at her dainty elegance, and the fondness all the family exhibit for her. Even you, Nelly, if we have a dispute sometimes, you back Isabella at once; and I yield like a foolish mother: I call her a darling, and flatter her into a good temper. It pleases her brother to see us cordial, and that pleases me. But they are very much alike: they are spoiled children, and fancy the world was made for their accommodation; and though I humour both, I think a smart chastisement might improve them all the same.\"\n\"You're mistaken, Mrs. Linton,\" said I. \"They humour you: I know what there would be to do if they did not. You can well afford to indulge their passing whims as long as their business is to anticipate all your desires. You may, however, fall out, at last, over something of equal consequence to both sides; and then those you term weak are very capable of being as obstinate as you.\"\n\"And then we shall fight to the death, sha'n't we, Nelly?\" she returned, laughing. \"No! I tell you, I have such faith in Linton's love, that I believe I might kill him, and he wouldn't wish to retaliate.\"\nI advised her to value him the more for his affection.\n\"I do,\" she answered, \"but he needn't resort to whining for trifles. It is childish and, instead of melting into tears because I said that Heathcliff was now worthy of anyone's regard, and it would honour the first gentleman in the country to be his friend, he ought to have said it for me, and been delighted from sympathy. He must get accustomed to him, and he may as well like him: considering how Heathcliff has reason to object to him, I'm sure he behaved excellently!\"\n\"What do you think of his going to Wuthering Heights?\" I inquired. \"He is reformed in every respect, apparently: quite a Christian: offering the right hand of fellowship to his enemies all around!\"\n\"He explained it,\" she replied. \"I wonder as much as you. He said he called to gather information concerning me from you, supposing you resided there still; and Joseph told Hindley, who came out and fell to questioning him of what he had been doing, and how he had been living; and finally, desired him to walk in. There were some persons sitting at cards; Heathcliff joined them; my brother lost some money to him, and, finding him plentifully supplied, he requested that he would come again in the evening: to which he consented. Hindley is too reckless to select his acquaintance prudently: he doesn't trouble himself to reflect on the causes he might have for mistrusting one whom he has basely injured. But Heathcliff affirms his principal reason for resuming a connection with his ancient persecutor is a wish to install himself in quarters at walking distance from the Grange, and an attachment to the house where we lived together; and likewise a hope that I shall have more opportunities of seeing him there than I could have if he settled in Gimmerton. He means to offer liberal payment for permission to lodge at the Heights; and doubtless my brother's covetousness will prompt him to accept the terms: he was always greedy; though what he grasps with one hand he flings away with the other.\"\n\"It's a nice place for a young man to fix his dwelling in!\" said I. \"Have you no fear of the consequences, Mrs. Linton?\"\n\"None for my friend,\" she replied: \"his strong head will keep him from danger; a little for Hindley: but he can't be made morally worse than he is; and I stand between him and bodily harm. The event of this evening has reconciled me to God and humanity! I had risen in angry rebellion against Providence. Oh, I've endured very, very bitter misery, Nelly! If that creature knew how bitter, he'd be ashamed to cloud its removal with idle petulance. It was kindness for him which induced me to bear it alone: had I expressed the agony I frequently felt, he would have been taught to long for its alleviation as ardently as I. However, it's over, and I'll take no revenge on his folly; I can afford to suffer anything hereafter! Should the meanest thing alive slap me on the cheek, I'd not only turn the other, but I'd ask pardon for provoking it; and, as a proof, I'll go make my peace with Edgar instantly. Good-night! I'm an angel!\"\nIn this self-complacent conviction she departed; and the success of her fulfilled resolution was obvious on the morrow: Mr. Linton had not only abjured his peevishness (though his spirits seemed still subdued by Catherine's exuberance of vivacity), but he ventured no objection to her taking Isabella with her to Wuthering Heights in the afternoon; and she rewarded him with such a summer of sweetness and affection in return as made the house a paradise for several days; both master and servants profiting from the perpetual sunshine.\nHeathcliff-Mr. Heathcliff I should say in future-used the liberty of visiting at Thrushcross Grange cautiously, at first: he seemed estimating how far its owner would bear his intrusion. Catherine, also, deemed it judicious to moderate her expressions of pleasure in receiving him; and he gradually established his right to be expected. He retained a great deal of the reserve for which his boyhood was remarkable; and that served to repress all startling demonstrations of feeling. My master's uneasiness experienced a lull, and further circumstances diverted it into another channel for a space.\nHis new source of trouble sprang from the not anticipated misfortune of Isabella Linton evincing a sudden and irresistible attraction towards the tolerated guest. She was at that time a charming young lady of eighteen; infantile in manners, though possessed of keen wit, keen feelings, and a keen temper, too, if irritated. Her brother, who loved her tenderly, was appalled at this fantastic preference. Leaving aside the degradation of an alliance with a nameless man, and the possible fact that his property, in default of heirs male, might pass into such a one's power, he had sense to comprehend Heathcliff's disposition: to know that, though his exterior was altered, his mind was unchangeable and unchanged. And he dreaded that mind: it revolted him: he shrank forebodingly from the idea of committing Isabella to its keeping. He would have recoiled still more had he been aware that her attachment rose unsolicited, and was bestowed where it awakened no reciprocation of sentiment; for the minute he discovered its existence he laid the blame on Heathcliff's deliberate designing.\nWe had all remarked, during some time, that Miss Linton fretted and pined over something. She grew cross and wearisome; snapping at and teasing Catherine continually, at the imminent risk of exhausting her limited patience. We excused her, to a certain extent, on the plea of ill-health: she was dwindling and fading before our eyes. But one day, when she had been peculiarly wayward, rejecting her breakfast, complaining that the servants did not do what she told them; that the mistress would allow her to be nothing in the house, and Edgar neglected her; that she had caught a cold with the doors being left open, and we let the parlour fire go out on purpose to vex her, with a hundred yet more frivolous accusations, Mrs. Linton peremptorily insisted that she should get to bed; and, having scolded her heartily, threatened to send for the doctor. Mention of Kenneth caused her to exclaim, instantly, that her health was perfect, and it was only Catherine's harshness which made her unhappy.\n\"How can you say I am harsh, you naughty fondling?\" cried the mistress, amazed at the unreasonable assertion. \"You are surely losing your reason. When have I been harsh, tell me?\"\n\"Yesterday,\" sobbed Isabella, \"and now!\"\n\"Yesterday!\" said her sister-in-law. \"On what occasion?\"\n\"In our walk along the moor: you told me to ramble where I pleased, while you sauntered on with Mr. Heathcliff!\"\n\"And that's your notion of harshness?\" said Catherine, laughing. \"It was no hint that your company was superfluous: we didn't care whether you kept with us or not; I merely thought Heathcliff's talk would have nothing entertaining for your ears.\"\n\"Oh, no,\" wept the young lady; \"you wished me away, because you knew I liked to be there!\"\n\"Is she sane?\" asked Mrs. Linton, appealing to me. \"I'll repeat our conversation, word for word, Isabella; and you point out any charm it could have had for you.\"\n\"I don't mind the conversation,\" she answered: \"I wanted to be with-\"\n\"Well?\" said Catherine, perceiving her hesitate to complete the sentence.\n\"With him: and I won't be always sent off!\" she continued, kindling up. \"You are a dog in the manger, Cathy, and desire no one to be loved but yourself!\"\n\"You are an impertinent little monkey!\" exclaimed Mrs. Linton, in surprise. \"But I'll not believe this idiocy! It is impossible that you can covet the admiration of Heathcliff-that you consider him an agreeable person! I hope I have misunderstood you, Isabella?\"\n\"No, you have not,\" said the infatuated girl. \"I love him more than ever you loved Edgar, and he might love me, if you would let him!\"\n\"I wouldn't be you for a kingdom, then!\" Catherine declared, emphatically: and she seemed to speak sincerely. \"Nelly, help me to convince her of her madness. Tell her what Heathcliff is: an unreclaimed creature, without refinement, without cultivation; an arid wilderness of furze and whinstone. I'd as soon put that little canary into the park on a winter's day, as recommend you to bestow your heart on him! It is deplorable ignorance of his character, child, and nothing else, which makes that dream enter your head. Pray, don't imagine that he conceals depths of benevolence and affection beneath a stern exterior! He's not a rough diamond-a pearl-containing oyster of a rustic: he's a fierce, pitiless, wolfish man. I never say to him, 'Let this or that enemy alone, because it would be ungenerous or cruel to harm them;' I say, 'Let them alone, because _I_ should hate them to be wronged:' and he'd crush you like a sparrow's egg, Isabella, if he found you a troublesome charge. I know he couldn't love a Linton; and yet he'd be quite capable of marrying your fortune and expectations: avarice is growing with him a besetting sin. There's my picture: and I'm his friend-so much so, that had he thought seriously to catch you, I should, perhaps, have held my tongue, and let you fall into his trap.\"\nMiss Linton regarded her sister-in-law with indignation.\n\"For shame! for shame!\" she repeated, angrily. \"You are worse than twenty foes, you poisonous friend!\"\n\"Ah! you won't believe me, then?\" said Catherine. \"You think I speak from wicked selfishness?\"\n\"I'm certain you do,\" retorted Isabella; \"and I shudder at you!\"\n\"Good!\" cried the other. \"Try for yourself, if that be your spirit: I have done, and yield the argument to your saucy insolence.\"-\n\"And I must suffer for her egotism!\" she sobbed, as Mrs. Linton left the room. \"All, all is against me: she has blighted my single consolation. But she uttered falsehoods, didn't she? Mr. Heathcliff is not a fiend: he has an honourable soul, and a true one, or how could he remember her?\"\n\"Banish him from your thoughts, Miss,\" I said. \"He's a bird of bad omen: no mate for you. Mrs. Linton spoke strongly, and yet I can't contradict her. She is better acquainted with his heart than I, or any one besides; and she never would represent him as worse than he is. Honest people don't hide their deeds. How has he been living? how has he got rich? why is he staying at Wuthering Heights, the house of a man whom he abhors? They say Mr. Earnshaw is worse and worse since he came. They sit up all night together continually, and Hindley has been borrowing money on his land, and does nothing but play and drink: I heard only a week ago-it was Joseph who told me-I met him at Gimmerton: 'Nelly,' he said, 'we's hae a crowner's 'quest enow, at ahr folks'. One on 'em 's a'most getten his finger cut off wi' hauding t' other fro' stickin' hisseln loike a cawlf. That's maister, yeah knaw, 'at 's soa up o' going tuh t' grand 'sizes. He's noan feared o' t' bench o' judges, norther Paul, nur Peter, nur John, nur Matthew, nor noan on 'em, not he! He fair likes-he langs to set his brazened face agean 'em! And yon bonny lad Heathcliff, yah mind, he's a rare 'un. He can girn a laugh as well 's onybody at a raight divil's jest. Does he niver say nowt of his fine living amang us, when he goes to t' Grange? This is t' way on 't:-up at sun-down: dice, brandy, cloised shutters, und can'le-light till next day at noon: then, t'fooil gangs banning und raving to his cham'er, makking dacent fowks dig thur fingers i' thur lugs fur varry shame; un' the knave, why he can caint his brass, un' ate, un' sleep, un' off to his neighbour's to gossip wi' t' wife. I' course, he tells Dame Catherine how her fathur's goold runs into his pocket, and her fathur's son gallops down t' broad road, while he flees afore to oppen t' pikes!' Now, Miss Linton, Joseph is an old rascal, but no liar; and, if his account of Heathcliff's conduct be true, you would never think of desiring such a husband, would you?\"\n\"You are leagued with the rest, Ellen!\" she replied. \"I'll not listen to your slanders. What malevolence you must have to wish to convince me that there is no happiness in the world!\"\nWhether she would have got over this fancy if left to herself, or persevered in nursing it perpetually, I cannot say: she had little time to reflect. The day after, there was a justice-meeting at the next town; my master was obliged to attend; and Mr. Heathcliff, aware of his absence, called rather earlier than usual. Catherine and Isabella were sitting in the library, on hostile terms, but silent: the latter alarmed at her recent indiscretion, and the disclosure she had made of her secret feelings in a transient fit of passion; the former, on mature consideration, really offended with her companion; and, if she laughed again at her pertness, inclined to make it no laughing matter to her. She did laugh as she saw Heathcliff pass the window. I was sweeping the hearth, and I noticed a mischievous smile on her lips. Isabella, absorbed in her meditations, or a book, remained till the door opened; and it was too late to attempt an escape, which she would gladly have done had it been practicable.\n\"Come in, that's right!\" exclaimed the mistress, gaily, pulling a chair to the fire. \"Here are two people sadly in need of a third to thaw the ice between them; and you are the very one we should both of us choose. Heathcliff, I'm proud to show you, at last, somebody that dotes on you more than myself. I expect you to feel flattered. Nay, it's not Nelly; don't look at her! My poor little sister-in-law is breaking her heart by mere contemplation of your physical and moral beauty. It lies in your own power to be Edgar's brother! No, no, Isabella, you sha'n't run off,\" she continued, arresting, with feigned playfulness, the confounded girl, who had risen indignantly. \"We were quarrelling like cats about you, Heathcliff; and I was fairly beaten in protestations of devotion and admiration: and, moreover, I was informed that if I would but have the manners to stand aside, my rival, as she will have herself to be, would shoot a shaft into your soul that would fix you for ever, and send my image into eternal oblivion!\"\n\"Catherine!\" said Isabella, calling up her dignity, and disdaining to struggle from the tight grasp that held her, \"I'd thank you to adhere to the truth and not slander me, even in joke! Mr. Heathcliff, be kind enough to bid this friend of yours release me: she forgets that you and I are not intimate acquaintances; and what amuses her is painful to me beyond expression.\"\nAs the guest answered nothing, but took his seat, and looked thoroughly indifferent what sentiments she cherished concerning him, she turned and whispered an earnest appeal for liberty to her tormentor.\n\"By no means!\" cried Mrs. Linton in answer. \"I won't be named a dog in the manger again. You _shall_ stay: now then! Heathcliff, why don't you evince satisfaction at my pleasant news? Isabella swears that the love Edgar has for me is nothing to that she entertains for you. I'm sure she made some speech of the kind; did she not, Ellen? And she has fasted ever since the day before yesterday's walk, from sorrow and rage that I despatched her out of your society under the idea of its being unacceptable.\"\n\"I think you belie her,\" said Heathcliff, twisting his chair to face them. \"She wishes to be out of my society now, at any rate!\"\nAnd he stared hard at the object of discourse, as one might do at a strange repulsive animal: a centipede from the Indies, for instance, which curiosity leads one to examine in spite of the aversion it raises. The poor thing couldn't bear that; she grew white and red in rapid succession, and, while tears beaded her lashes, bent the strength of her small fingers to loosen the firm clutch of Catherine; and perceiving that as fast as she raised one finger off her arm another closed down, and she could not remove the whole together, she began to make use of her nails; and their sharpness presently ornamented the detainer's with crescents of red.\n\"There's a tigress!\" exclaimed Mrs. Linton, setting her free, and shaking her hand with pain. \"Begone, for God's sake, and hide your vixen face! How foolish to reveal those talons to him. Can't you fancy the conclusions he'll draw? Look, Heathcliff! they are instruments that will do execution-you must beware of your eyes.\"\n\"I'd wrench them off her fingers, if they ever menaced me,\" he answered, brutally, when the door had closed after her. \"But what did you mean by teasing the creature in that manner, Cathy? You were not speaking the truth, were you?\"\n\"I assure you I was,\" she returned. \"She has been dying for your sake several weeks, and raving about you this morning, and pouring forth a deluge of abuse, because I represented your failings in a plain light, for the purpose of mitigating her adoration. But don't notice it further: I wished to punish her sauciness, that's all. I like her too well, my dear Heathcliff, to let you absolutely seize and devour her up.\"\n\"And I like her too ill to attempt it,\" said he, \"except in a very ghoulish fashion. You'd hear of odd things if I lived alone with that mawkish, waxen face: the most ordinary would be painting on its white the colours of the rainbow, and turning the blue eyes black, every day or two: they detestably resemble Linton's.\"\n\"Delectably!\" observed Catherine. \"They are dove's eyes-angel's!\"\n\"She's her brother's heir, is she not?\" he asked, after a brief silence.\n\"I should be sorry to think so,\" returned his companion. \"Half a dozen nephews shall erase her title, please heaven! Abstract your mind from the subject at present: you are too prone to covet your neighbour's goods; remember _this_ neighbour's goods are mine.\"\n\"If they were _mine_, they would be none the less that,\" said Heathcliff; \"but though Isabella Linton may be silly, she is scarcely mad; and, in short, we'll dismiss the matter, as you advise.\"\nFrom their tongues they did dismiss it; and Catherine, probably, from her thoughts. The other, I felt certain, recalled it often in the course of the evening. I saw him smile to himself-grin rather-and lapse into ominous musing whenever Mrs. Linton had occasion to be absent from the apartment.\nI determined to watch his movements. My heart invariably cleaved to the master's, in preference to Catherine's side: with reason I imagined, for he was kind, and trustful, and honourable; and she-she could not be called _opposite_, yet she seemed to allow herself such wide latitude, that I had little faith in her principles, and still less sympathy for her feelings. I wanted something to happen which might have the effect of freeing both Wuthering Heights and the Grange of Mr. Heathcliff quietly; leaving us as we had been prior to his advent. His visits were a continual nightmare to me; and, I suspected, to my master also. His abode at the Heights was an oppression past explaining. I felt that God had forsaken the stray sheep there to its own wicked wanderings, and an evil beast prowled between it and the fold, waiting his time to spring and destroy.",
        "paragraph_chars": [
            [
                0,
                347
            ],
            [
                347,
                1165
            ],
            [
                1165,
                1236
            ],
            [
                1236,
                1289
            ],
            [
                1289,
                1334
            ],
            [
                1334,
                1851
            ],
            [
                1851,
                2259
            ],
            [
                2259,
                2267
            ],
            [
                2267,
                2287
            ],
            [
                2287,
                2297
            ],
            [
                2297,
                3930
            ],
            [
                3930,
                4735
            ],
            [
                4735,
                5306
            ],
            [
                5306,
                5507
            ],
            [
                5507,
                5672
            ],
            [
                5672,
                5827
            ],
            [
                5827,
                6188
            ],
            [
                6188,
                6406
            ],
            [
                6406,
                6489
            ],
            [
                6489,
                6738
            ],
            [
                6738,
                7571
            ],
            [
                7571,
                7611
            ],
            [
                7611,
                7649
            ],
            [
                7649,
                7743
            ],
            [
                7743,
                7814
            ],
            [
                7814,
                7939
            ],
            [
                7939,
                8021
            ],
            [
                8021,
                8212
            ],
            [
                8212,
                8654
            ],
            [
                8654,
                8815
            ],
            [
                8815,
                8969
            ],
            [
                8969,
                9137
            ],
            [
                9137,
                9174
            ],
            [
                9174,
                9199
            ],
            [
                9199,
                9370
            ],
            [
                9370,
                9750
            ],
            [
                9750,
                9807
            ],
            [
                9807,
                10009
            ],
            [
                10009,
                11381
            ],
            [
                11381,
                11565
            ],
            [
                11565,
                11694
            ],
            [
                11694,
                12260
            ],
            [
                12260,
                12528
            ],
            [
                12528,
                13210
            ],
            [
                13210,
                13466
            ],
            [
                13466,
                13904
            ],
            [
                13904,
                14000
            ],
            [
                14000,
                14311
            ],
            [
                14311,
                14483
            ],
            [
                14483,
                15035
            ],
            [
                15035,
                15301
            ],
            [
                15301,
                15969
            ],
            [
                15969,
                16354
            ],
            [
                16354,
                16559
            ],
            [
                16559,
                16614
            ],
            [
                16614,
                17089
            ],
            [
                17089,
                17287
            ],
            [
                17287,
                18591
            ],
            [
                18591,
                18712
            ],
            [
                18712,
                19644
            ],
            [
                19644,
                20181
            ],
            [
                20181,
                20779
            ],
            [
                20779,
                21867
            ],
            [
                21867,
                22864
            ],
            [
                22864,
                23044
            ],
            [
                23044,
                23085
            ],
            [
                23085,
                23142
            ],
            [
                23142,
                23255
            ],
            [
                23255,
                23502
            ],
            [
                23502,
                23593
            ],
            [
                23593,
                23756
            ],
            [
                23756,
                23826
            ],
            [
                23826,
                23900
            ],
            [
                23900,
                24054
            ],
            [
                24054,
                24317
            ],
            [
                24317,
                24452
            ],
            [
                24452,
                25757
            ],
            [
                25757,
                25814
            ],
            [
                25814,
                25917
            ],
            [
                25917,
                26012
            ],
            [
                26012,
                26077
            ],
            [
                26077,
                26208
            ],
            [
                26208,
                26497
            ],
            [
                26497,
                28493
            ],
            [
                28493,
                28677
            ],
            [
                28677,
                29683
            ],
            [
                29683,
                30710
            ],
            [
                30710,
                31084
            ],
            [
                31084,
                31287
            ],
            [
                31287,
                31793
            ],
            [
                31793,
                31923
            ],
            [
                31923,
                32573
            ],
            [
                32573,
                32898
            ],
            [
                32898,
                33131
            ],
            [
                33131,
                33551
            ],
            [
                33551,
                33873
            ],
            [
                33873,
                33939
            ],
            [
                33939,
                34012
            ],
            [
                34012,
                34273
            ],
            [
                34273,
                34467
            ],
            [
                34467,
                34762
            ],
            [
                34762,
                35624
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                88
            ],
            [
                88,
                190
            ],
            [
                190,
                236
            ],
            [
                236,
                347
            ],
            [
                347,
                396
            ],
            [
                396,
                470
            ],
            [
                470,
                481
            ],
            [
                481,
                578
            ],
            [
                578,
                589
            ],
            [
                589,
                752
            ],
            [
                752,
                784
            ],
            [
                784,
                861
            ],
            [
                861,
                907
            ],
            [
                907,
                968
            ],
            [
                968,
                1076
            ],
            [
                1076,
                1149
            ],
            [
                1149,
                1165
            ],
            [
                1165,
                1236
            ],
            [
                1236,
                1258
            ],
            [
                1258,
                1289
            ],
            [
                1289,
                1334
            ],
            [
                1334,
                1354
            ],
            [
                1354,
                1374
            ],
            [
                1374,
                1404
            ],
            [
                1404,
                1457
            ],
            [
                1457,
                1597
            ],
            [
                1597,
                1670
            ],
            [
                1670,
                1793
            ],
            [
                1793,
                1851
            ],
            [
                1851,
                1953
            ],
            [
                1953,
                2221
            ],
            [
                2221,
                2259
            ],
            [
                2259,
                2267
            ],
            [
                2267,
                2287
            ],
            [
                2287,
                2297
            ],
            [
                2297,
                2443
            ],
            [
                2443,
                2541
            ],
            [
                2541,
                2598
            ],
            [
                2598,
                2690
            ],
            [
                2690,
                2866
            ],
            [
                2866,
                2939
            ],
            [
                2939,
                3167
            ],
            [
                3167,
                3332
            ],
            [
                3332,
                3505
            ],
            [
                3505,
                3772
            ],
            [
                3772,
                3840
            ],
            [
                3840,
                3930
            ],
            [
                3930,
                3940
            ],
            [
                3940,
                4196
            ],
            [
                4196,
                4317
            ],
            [
                4317,
                4489
            ],
            [
                4489,
                4735
            ],
            [
                4735,
                4868
            ],
            [
                4868,
                4990
            ],
            [
                4990,
                5119
            ],
            [
                5119,
                5217
            ],
            [
                5217,
                5234
            ],
            [
                5234,
                5245
            ],
            [
                5245,
                5260
            ],
            [
                5260,
                5268
            ],
            [
                5268,
                5306
            ],
            [
                5306,
                5441
            ],
            [
                5441,
                5460
            ],
            [
                5460,
                5480
            ],
            [
                5480,
                5507
            ],
            [
                5507,
                5649
            ],
            [
                5649,
                5672
            ],
            [
                5672,
                5680
            ],
            [
                5680,
                5779
            ],
            [
                5779,
                5786
            ],
            [
                5786,
                5801
            ],
            [
                5801,
                5819
            ],
            [
                5819,
                5827
            ],
            [
                5827,
                5973
            ],
            [
                5973,
                5992
            ],
            [
                5992,
                6006
            ],
            [
                6006,
                6031
            ],
            [
                6031,
                6060
            ],
            [
                6060,
                6073
            ],
            [
                6073,
                6080
            ],
            [
                6080,
                6128
            ],
            [
                6128,
                6188
            ],
            [
                6188,
                6212
            ],
            [
                6212,
                6225
            ],
            [
                6225,
                6244
            ],
            [
                6244,
                6303
            ],
            [
                6303,
                6329
            ],
            [
                6329,
                6342
            ],
            [
                6342,
                6376
            ],
            [
                6376,
                6406
            ],
            [
                6406,
                6462
            ],
            [
                6462,
                6489
            ],
            [
                6489,
                6627
            ],
            [
                6627,
                6738
            ],
            [
                6738,
                7104
            ],
            [
                7104,
                7226
            ],
            [
                7226,
                7316
            ],
            [
                7316,
                7571
            ],
            [
                7571,
                7592
            ],
            [
                7592,
                7611
            ],
            [
                7611,
                7649
            ],
            [
                7649,
                7713
            ],
            [
                7713,
                7743
            ],
            [
                7743,
                7814
            ],
            [
                7814,
                7862
            ],
            [
                7862,
                7939
            ],
            [
                7939,
                7946
            ],
            [
                7946,
                7972
            ],
            [
                7972,
                7982
            ],
            [
                7982,
                8021
            ],
            [
                8021,
                8028
            ],
            [
                8028,
                8083
            ],
            [
                8083,
                8120
            ],
            [
                8120,
                8164
            ],
            [
                8164,
                8212
            ],
            [
                8212,
                8299
            ],
            [
                8299,
                8332
            ],
            [
                8332,
                8411
            ],
            [
                8411,
                8461
            ],
            [
                8461,
                8654
            ],
            [
                8654,
                8674
            ],
            [
                8674,
                8720
            ],
            [
                8720,
                8740
            ],
            [
                8740,
                8771
            ],
            [
                8771,
                8815
            ],
            [
                8815,
                8886
            ],
            [
                8886,
                8936
            ],
            [
                8936,
                8969
            ],
            [
                8969,
                9063
            ],
            [
                9063,
                9107
            ],
            [
                9107,
                9137
            ],
            [
                9137,
                9174
            ],
            [
                9174,
                9188
            ],
            [
                9188,
                9199
            ],
            [
                9199,
                9276
            ],
            [
                9276,
                9370
            ],
            [
                9370,
                9432
            ],
            [
                9432,
                9577
            ],
            [
                9577,
                9605
            ],
            [
                9605,
                9646
            ],
            [
                9646,
                9670
            ],
            [
                9670,
                9705
            ],
            [
                9705,
                9750
            ],
            [
                9750,
                9807
            ],
            [
                9807,
                9911
            ],
            [
                9911,
                10009
            ],
            [
                10009,
                10115
            ],
            [
                10115,
                10280
            ],
            [
                10280,
                10499
            ],
            [
                10499,
                10622
            ],
            [
                10622,
                10729
            ],
            [
                10729,
                10801
            ],
            [
                10801,
                10957
            ],
            [
                10957,
                11154
            ],
            [
                11154,
                11289
            ],
            [
                11289,
                11381
            ],
            [
                11381,
                11418
            ],
            [
                11418,
                11565
            ],
            [
                11565,
                11654
            ],
            [
                11654,
                11694
            ],
            [
                11694,
                11816
            ],
            [
                11816,
                11982
            ],
            [
                11982,
                12055
            ],
            [
                12055,
                12260
            ],
            [
                12260,
                12298
            ],
            [
                12298,
                12309
            ],
            [
                12309,
                12401
            ],
            [
                12401,
                12428
            ],
            [
                12428,
                12460
            ],
            [
                12460,
                12528
            ],
            [
                12528,
                12586
            ],
            [
                12586,
                12885
            ],
            [
                12885,
                12990
            ],
            [
                12990,
                13026
            ],
            [
                13026,
                13066
            ],
            [
                13066,
                13089
            ],
            [
                13089,
                13210
            ],
            [
                13210,
                13377
            ],
            [
                13377,
                13466
            ],
            [
                13466,
                13605
            ],
            [
                13605,
                13642
            ],
            [
                13642,
                13709
            ],
            [
                13709,
                13781
            ],
            [
                13781,
                13854
            ],
            [
                13854,
                13904
            ],
            [
                13904,
                14000
            ],
            [
                14000,
                14028
            ],
            [
                14028,
                14061
            ],
            [
                14061,
                14116
            ],
            [
                14116,
                14216
            ],
            [
                14216,
                14311
            ],
            [
                14311,
                14483
            ],
            [
                14483,
                14536
            ],
            [
                14536,
                14605
            ],
            [
                14605,
                14840
            ],
            [
                14840,
                14891
            ],
            [
                14891,
                15035
            ],
            [
                15035,
                15080
            ],
            [
                15080,
                15092
            ],
            [
                15092,
                15216
            ],
            [
                15216,
                15301
            ],
            [
                15301,
                15340
            ],
            [
                15340,
                15353
            ],
            [
                15353,
                15537
            ],
            [
                15537,
                15706
            ],
            [
                15706,
                15769
            ],
            [
                15769,
                15969
            ],
            [
                15969,
                16009
            ],
            [
                16009,
                16077
            ],
            [
                16077,
                16189
            ],
            [
                16189,
                16354
            ],
            [
                16354,
                16413
            ],
            [
                16413,
                16437
            ],
            [
                16437,
                16442
            ],
            [
                16442,
                16559
            ],
            [
                16559,
                16614
            ],
            [
                16614,
                16683
            ],
            [
                16683,
                16939
            ],
            [
                16939,
                17089
            ],
            [
                17089,
                17144
            ],
            [
                17144,
                17156
            ],
            [
                17156,
                17287
            ],
            [
                17287,
                17319
            ],
            [
                17319,
                17345
            ],
            [
                17345,
                17602
            ],
            [
                17602,
                17819
            ],
            [
                17819,
                17995
            ],
            [
                17995,
                18350
            ],
            [
                18350,
                18591
            ],
            [
                18591,
                18651
            ],
            [
                18651,
                18659
            ],
            [
                18659,
                18712
            ],
            [
                18712,
                18901
            ],
            [
                18901,
                18966
            ],
            [
                18966,
                19017
            ],
            [
                19017,
                19067
            ],
            [
                19067,
                19159
            ],
            [
                19159,
                19335
            ],
            [
                19335,
                19437
            ],
            [
                19437,
                19617
            ],
            [
                19617,
                19629
            ],
            [
                19629,
                19644
            ],
            [
                19644,
                20181
            ],
            [
                20181,
                20368
            ],
            [
                20368,
                20518
            ],
            [
                20518,
                20664
            ],
            [
                20664,
                20779
            ],
            [
                20779,
                20942
            ],
            [
                20942,
                21103
            ],
            [
                21103,
                21183
            ],
            [
                21183,
                21493
            ],
            [
                21493,
                21612
            ],
            [
                21612,
                21867
            ],
            [
                21867,
                21957
            ],
            [
                21957,
                22091
            ],
            [
                22091,
                22201
            ],
            [
                22201,
                22720
            ],
            [
                22720,
                22864
            ],
            [
                22864,
                22916
            ],
            [
                22916,
                22974
            ],
            [
                22974,
                23010
            ],
            [
                23010,
                23044
            ],
            [
                23044,
                23085
            ],
            [
                23085,
                23098
            ],
            [
                23098,
                23122
            ],
            [
                23122,
                23142
            ],
            [
                23142,
                23255
            ],
            [
                23255,
                23294
            ],
            [
                23294,
                23320
            ],
            [
                23320,
                23502
            ],
            [
                23502,
                23593
            ],
            [
                23593,
                23608
            ],
            [
                23608,
                23644
            ],
            [
                23644,
                23756
            ],
            [
                23756,
                23826
            ],
            [
                23826,
                23834
            ],
            [
                23834,
                23900
            ],
            [
                23900,
                23944
            ],
            [
                23944,
                23972
            ],
            [
                23972,
                24054
            ],
            [
                24054,
                24094
            ],
            [
                24094,
                24130
            ],
            [
                24130,
                24165
            ],
            [
                24165,
                24273
            ],
            [
                24273,
                24317
            ],
            [
                24317,
                24363
            ],
            [
                24363,
                24452
            ],
            [
                24452,
                24493
            ],
            [
                24493,
                24562
            ],
            [
                24562,
                24610
            ],
            [
                24610,
                24748
            ],
            [
                24748,
                24862
            ],
            [
                24862,
                24972
            ],
            [
                24972,
                25071
            ],
            [
                25071,
                25173
            ],
            [
                25173,
                25437
            ],
            [
                25437,
                25589
            ],
            [
                25589,
                25757
            ],
            [
                25757,
                25814
            ],
            [
                25814,
                25826
            ],
            [
                25826,
                25838
            ],
            [
                25838,
                25861
            ],
            [
                25861,
                25917
            ],
            [
                25917,
                25922
            ],
            [
                25922,
                25951
            ],
            [
                25951,
                25967
            ],
            [
                25967,
                26012
            ],
            [
                26012,
                26077
            ],
            [
                26077,
                26085
            ],
            [
                26085,
                26102
            ],
            [
                26102,
                26208
            ],
            [
                26208,
                26245
            ],
            [
                26245,
                26287
            ],
            [
                26287,
                26352
            ],
            [
                26352,
                26392
            ],
            [
                26392,
                26497
            ],
            [
                26497,
                26544
            ],
            [
                26544,
                26587
            ],
            [
                26587,
                26647
            ],
            [
                26647,
                26770
            ],
            [
                26770,
                26808
            ],
            [
                26808,
                26832
            ],
            [
                26832,
                26853
            ],
            [
                26853,
                26928
            ],
            [
                26928,
                26984
            ],
            [
                26984,
                27257
            ],
            [
                27257,
                27362
            ],
            [
                27362,
                27433
            ],
            [
                27433,
                27546
            ],
            [
                27546,
                27605
            ],
            [
                27605,
                27662
            ],
            [
                27662,
                27727
            ],
            [
                27727,
                27806
            ],
            [
                27806,
                28152
            ],
            [
                28152,
                28322
            ],
            [
                28322,
                28493
            ],
            [
                28493,
                28533
            ],
            [
                28533,
                28546
            ],
            [
                28546,
                28581
            ],
            [
                28581,
                28677
            ],
            [
                28677,
                28827
            ],
            [
                28827,
                28997
            ],
            [
                28997,
                29375
            ],
            [
                29375,
                29428
            ],
            [
                29428,
                29502
            ],
            [
                29502,
                29683
            ],
            [
                29683,
                29708
            ],
            [
                29708,
                29768
            ],
            [
                29768,
                29898
            ],
            [
                29898,
                29987
            ],
            [
                29987,
                30019
            ],
            [
                30019,
                30059
            ],
            [
                30059,
                30167
            ],
            [
                30167,
                30216
            ],
            [
                30216,
                30356
            ],
            [
                30356,
                30710
            ],
            [
                30710,
                30723
            ],
            [
                30723,
                30897
            ],
            [
                30897,
                31084
            ],
            [
                31084,
                31287
            ],
            [
                31287,
                31302
            ],
            [
                31302,
                31331
            ],
            [
                31331,
                31376
            ],
            [
                31376,
                31404
            ],
            [
                31404,
                31471
            ],
            [
                31471,
                31561
            ],
            [
                31561,
                31624
            ],
            [
                31624,
                31793
            ],
            [
                31793,
                31868
            ],
            [
                31868,
                31923
            ],
            [
                31923,
                32133
            ],
            [
                32133,
                32573
            ],
            [
                32573,
                32594
            ],
            [
                32594,
                32667
            ],
            [
                32667,
                32718
            ],
            [
                32718,
                32761
            ],
            [
                32761,
                32805
            ],
            [
                32805,
                32823
            ],
            [
                32823,
                32898
            ],
            [
                32898,
                33017
            ],
            [
                33017,
                33087
            ],
            [
                33087,
                33131
            ],
            [
                33131,
                33167
            ],
            [
                33167,
                33387
            ],
            [
                33387,
                33462
            ],
            [
                33462,
                33551
            ],
            [
                33551,
                33636
            ],
            [
                33636,
                33873
            ],
            [
                33873,
                33887
            ],
            [
                33887,
                33907
            ],
            [
                33907,
                33939
            ],
            [
                33939,
                33979
            ],
            [
                33979,
                34012
            ],
            [
                34012,
                34069
            ],
            [
                34069,
                34129
            ],
            [
                34129,
                34273
            ],
            [
                34273,
                34467
            ],
            [
                34467,
                34551
            ],
            [
                34551,
                34626
            ],
            [
                34626,
                34762
            ],
            [
                34762,
                34799
            ],
            [
                34799,
                35131
            ],
            [
                35131,
                35311
            ],
            [
                35311,
                35393
            ],
            [
                35393,
                35453
            ],
            [
                35453,
                35624
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                63
            ],
            [
                74,
                88
            ],
            [
                88,
                162
            ],
            [
                172,
                190
            ],
            [
                190,
                202
            ],
            [
                210,
                212
            ],
            [
                217,
                222
            ],
            [
                234,
                236
            ],
            [
                247,
                260
            ],
            [
                292,
                298
            ],
            [
                304,
                347
            ],
            [
                347,
                361
            ],
            [
                371,
                396
            ],
            [
                396,
                445
            ],
            [
                468,
                470
            ],
            [
                470,
                481
            ],
            [
                481,
                486
            ],
            [
                520,
                527
            ],
            [
                535,
                536
            ],
            [
                546,
                578
            ],
            [
                589,
                719
            ],
            [
                743,
                751
            ],
            [
                789,
                805
            ],
            [
                784,
                785
            ],
            [
                877,
                886
            ],
            [
                887,
                905
            ],
            [
                859,
                860
            ],
            [
                973,
                974
            ],
            [
                984,
                1075
            ],
            [
                1388,
                1397
            ],
            [
                1402,
                1404
            ],
            [
                1462,
                1494
            ],
            [
                1507,
                1550
            ],
            [
                1595,
                1597
            ],
            [
                1597,
                1603
            ],
            [
                1628,
                1656
            ],
            [
                1659,
                1670
            ],
            [
                1670,
                1679
            ],
            [
                1715,
                1737
            ],
            [
                1791,
                1793
            ],
            [
                1793,
                1800
            ],
            [
                1803,
                1810
            ],
            [
                1825,
                1831
            ],
            [
                1840,
                1848
            ],
            [
                1852,
                1868
            ],
            [
                1881,
                1884
            ],
            [
                1900,
                1930
            ],
            [
                1951,
                1953
            ],
            [
                1953,
                1954
            ],
            [
                1980,
                2012
            ],
            [
                2045,
                2047
            ],
            [
                2062,
                2075
            ],
            [
                2080,
                2096
            ],
            [
                2119,
                2124
            ],
            [
                2143,
                2155
            ],
            [
                2173,
                2195
            ],
            [
                2206,
                2219
            ],
            [
                2297,
                2298
            ],
            [
                2303,
                2317
            ],
            [
                2329,
                2350
            ],
            [
                2318,
                2321
            ],
            [
                2389,
                2400
            ],
            [
                2412,
                2425
            ],
            [
                2441,
                2443
            ],
            [
                2443,
                2519
            ],
            [
                2530,
                2541
            ],
            [
                2541,
                2598
            ],
            [
                2598,
                2690
            ],
            [
                2728,
                2763
            ],
            [
                2866,
                2917
            ],
            [
                2927,
                2930
            ],
            [
                2937,
                2939
            ],
            [
                2969,
                2995
            ],
            [
                2960,
                2963
            ],
            [
                2996,
                3003
            ],
            [
                3073,
                3083
            ],
            [
                3106,
                3111
            ],
            [
                3003,
                3004
            ],
            [
                3221,
                3224
            ],
            [
                3182,
                3219
            ],
            [
                3330,
                3332
            ],
            [
                3346,
                3398
            ],
            [
                3412,
                3504
            ],
            [
                3505,
                3535
            ],
            [
                3548,
                3581
            ],
            [
                3608,
                3627
            ],
            [
                3680,
                3695
            ],
            [
                3705,
                3712
            ],
            [
                3770,
                3772
            ],
            [
                3772,
                3840
            ],
            [
                3840,
                3849
            ],
            [
                3863,
                3930
            ],
            [
                3930,
                3940
            ],
            [
                4107,
                4109
            ],
            [
                4102,
                4106
            ],
            [
                4110,
                4119
            ],
            [
                4143,
                4146
            ],
            [
                4171,
                4195
            ],
            [
                4201,
                4265
            ],
            [
                4272,
                4288
            ],
            [
                4315,
                4317
            ],
            [
                4317,
                4319
            ],
            [
                4328,
                4394
            ],
            [
                4405,
                4435
            ],
            [
                4487,
                4489
            ],
            [
                4489,
                4504
            ],
            [
                4524,
                4566
            ],
            [
                4576,
                4578
            ],
            [
                4601,
                4620
            ],
            [
                4675,
                4711
            ],
            [
                4646,
                4647
            ],
            [
                4714,
                4732
            ],
            [
                4735,
                4780
            ],
            [
                4791,
                4803
            ],
            [
                4808,
                4814
            ],
            [
                4858,
                4868
            ],
            [
                4868,
                4876
            ],
            [
                4906,
                4915
            ],
            [
                4904,
                4905
            ],
            [
                4917,
                4920
            ],
            [
                4946,
                4963
            ],
            [
                4988,
                4990
            ],
            [
                4990,
                5025
            ],
            [
                5042,
                5118
            ],
            [
                5218,
                5231
            ],
            [
                5234,
                5244
            ],
            [
                5307,
                5333
            ],
            [
                5336,
                5346
            ],
            [
                5373,
                5374
            ],
            [
                5376,
                5383
            ],
            [
                5413,
                5441
            ],
            [
                5441,
                5460
            ],
            [
                5460,
                5480
            ],
            [
                5486,
                5504
            ],
            [
                5507,
                5649
            ],
            [
                5649,
                5672
            ],
            [
                5673,
                5677
            ],
            [
                5680,
                5687
            ],
            [
                5765,
                5779
            ],
            [
                5801,
                5817
            ],
            [
                5828,
                5831
            ],
            [
                5833,
                5843
            ],
            [
                5846,
                5866
            ],
            [
                5875,
                5959
            ],
            [
                5965,
                5973
            ],
            [
                5974,
                5992
            ],
            [
                6060,
                6073
            ],
            [
                6080,
                6112
            ],
            [
                6126,
                6128
            ],
            [
                6128,
                6130
            ],
            [
                6132,
                6185
            ],
            [
                6248,
                6256
            ],
            [
                6273,
                6301
            ],
            [
                6212,
                6224
            ],
            [
                6317,
                6329
            ],
            [
                6376,
                6403
            ],
            [
                6407,
                6430
            ],
            [
                6433,
                6435
            ],
            [
                6449,
                6462
            ],
            [
                6463,
                6486
            ],
            [
                6514,
                6524
            ],
            [
                6510,
                6513
            ],
            [
                6561,
                6580
            ],
            [
                6543,
                6554
            ],
            [
                6625,
                6627
            ],
            [
                6738,
                6767
            ],
            [
                7067,
                7072
            ],
            [
                6813,
                6822
            ],
            [
                6853,
                6872
            ],
            [
                6809,
                6812
            ],
            [
                6874,
                6949
            ],
            [
                7104,
                7152
            ],
            [
                7224,
                7226
            ],
            [
                7288,
                7316
            ],
            [
                7316,
                7324
            ],
            [
                7337,
                7363
            ],
            [
                7409,
                7410
            ],
            [
                7521,
                7562
            ],
            [
                7457,
                7458
            ],
            [
                7563,
                7568
            ],
            [
                7650,
                7681
            ],
            [
                7684,
                7693
            ],
            [
                7713,
                7725
            ],
            [
                7732,
                7740
            ],
            [
                7743,
                7746
            ],
            [
                7755,
                7814
            ],
            [
                7820,
                7848
            ],
            [
                7851,
                7862
            ],
            [
                7868,
                7878
            ],
            [
                7902,
                7936
            ],
            [
                7940,
                7946
            ],
            [
                7946,
                7955
            ],
            [
                7972,
                7981
            ],
            [
                8022,
                8028
            ],
            [
                8028,
                8049
            ],
            [
                8064,
                8072
            ],
            [
                8075,
                8083
            ],
            [
                8087,
                8120
            ],
            [
                8120,
                8164
            ],
            [
                8164,
                8187
            ],
            [
                8193,
                8194
            ],
            [
                8203,
                8209
            ],
            [
                8507,
                8625
            ],
            [
                8635,
                8652
            ],
            [
                8652,
                8654
            ],
            [
                8655,
                8671
            ],
            [
                8674,
                8720
            ],
            [
                8721,
                8740
            ],
            [
                8740,
                8762
            ],
            [
                8816,
                8826
            ],
            [
                8829,
                8856
            ],
            [
                8858,
                8886
            ],
            [
                8886,
                8934
            ],
            [
                8970,
                8996
            ],
            [
                8999,
                9011
            ],
            [
                9061,
                9063
            ],
            [
                9064,
                9107
            ],
            [
                9107,
                9134
            ],
            [
                9138,
                9142
            ],
            [
                9145,
                9153
            ],
            [
                9155,
                9171
            ],
            [
                9175,
                9185
            ],
            [
                9199,
                9266
            ],
            [
                9274,
                9275
            ],
            [
                9371,
                9375
            ],
            [
                9430,
                9431
            ],
            [
                9385,
                9386
            ],
            [
                9400,
                9401
            ],
            [
                9432,
                9577
            ],
            [
                9577,
                9605
            ],
            [
                9605,
                9626
            ],
            [
                9635,
                9646
            ],
            [
                9670,
                9683
            ],
            [
                9695,
                9705
            ],
            [
                9705,
                9747
            ],
            [
                9750,
                9792
            ],
            [
                9802,
                9807
            ],
            [
                9814,
                9829
            ],
            [
                9832,
                9839
            ],
            [
                9852,
                9855
            ],
            [
                9857,
                9911
            ],
            [
                9911,
                10006
            ],
            [
                10009,
                10066
            ],
            [
                10113,
                10115
            ],
            [
                10115,
                10126
            ],
            [
                10181,
                10265
            ],
            [
                10278,
                10280
            ],
            [
                10280,
                10283
            ],
            [
                10323,
                10359
            ],
            [
                10379,
                10380
            ],
            [
                10361,
                10379
            ],
            [
                10400,
                10498
            ],
            [
                10499,
                10525
            ],
            [
                10535,
                10560
            ],
            [
                10578,
                10622
            ],
            [
                10622,
                10729
            ],
            [
                10729,
                10801
            ],
            [
                10801,
                10804
            ],
            [
                10892,
                10898
            ],
            [
                10826,
                10831
            ],
            [
                10846,
                10849
            ],
            [
                10870,
                10888
            ],
            [
                10912,
                10915
            ],
            [
                10899,
                10911
            ],
            [
                10925,
                10927
            ],
            [
                10859,
                10861
            ],
            [
                10937,
                10957
            ],
            [
                10957,
                11000
            ],
            [
                11021,
                11084
            ],
            [
                11090,
                11106
            ],
            [
                11119,
                11128
            ],
            [
                11152,
                11153
            ],
            [
                11154,
                11183
            ],
            [
                11196,
                11289
            ],
            [
                11289,
                11381
            ],
            [
                11386,
                11395
            ],
            [
                11398,
                11418
            ],
            [
                11420,
                11423
            ],
            [
                11424,
                11452
            ],
            [
                11464,
                11466
            ],
            [
                11472,
                11475
            ],
            [
                11478,
                11482
            ],
            [
                11495,
                11562
            ],
            [
                11570,
                11576
            ],
            [
                11579,
                11599
            ],
            [
                11601,
                11654
            ],
            [
                11654,
                11691
            ],
            [
                11694,
                11741
            ],
            [
                11747,
                11792
            ],
            [
                11814,
                11816
            ],
            [
                11816,
                11836
            ],
            [
                11837,
                11975
            ],
            [
                11980,
                11982
            ],
            [
                11982,
                12054
            ],
            [
                12055,
                12090
            ],
            [
                12096,
                12164
            ],
            [
                12165,
                12260
            ],
            [
                12261,
                12285
            ],
            [
                12298,
                12309
            ],
            [
                12310,
                12401
            ],
            [
                12401,
                12428
            ],
            [
                12428,
                12460
            ],
            [
                12460,
                12525
            ],
            [
                12529,
                12570
            ],
            [
                12573,
                12586
            ],
            [
                12587,
                12618
            ],
            [
                12634,
                12639
            ],
            [
                12674,
                12675
            ],
            [
                12701,
                12733
            ],
            [
                12787,
                12788
            ],
            [
                12765,
                12768
            ],
            [
                12789,
                12799
            ],
            [
                12800,
                12885
            ],
            [
                12885,
                12932
            ],
            [
                12995,
                13026
            ],
            [
                13026,
                13066
            ],
            [
                13066,
                13089
            ],
            [
                13089,
                13157
            ],
            [
                13183,
                13207
            ],
            [
                13211,
                13221
            ],
            [
                13254,
                13260
            ],
            [
                13264,
                13281
            ],
            [
                13284,
                13315
            ],
            [
                13325,
                13349
            ],
            [
                13354,
                13377
            ],
            [
                13380,
                13381
            ],
            [
                13382,
                13463
            ],
            [
                13504,
                13522
            ],
            [
                13544,
                13551
            ],
            [
                13491,
                13494
            ],
            [
                13586,
                13605
            ],
            [
                13605,
                13620
            ],
            [
                13629,
                13642
            ],
            [
                13642,
                13651
            ],
            [
                13680,
                13709
            ],
            [
                13709,
                13714
            ],
            [
                13750,
                13781
            ],
            [
                13781,
                13800
            ],
            [
                13814,
                13818
            ],
            [
                13838,
                13845
            ],
            [
                13852,
                13854
            ],
            [
                13854,
                13861
            ],
            [
                13861,
                13868
            ],
            [
                13877,
                13904
            ],
            [
                13905,
                13929
            ],
            [
                13932,
                13944
            ],
            [
                13946,
                13949
            ],
            [
                13950,
                13997
            ],
            [
                14013,
                14020
            ],
            [
                14022,
                14025
            ],
            [
                14026,
                14028
            ],
            [
                14061,
                14116
            ],
            [
                14119,
                14121
            ],
            [
                14160,
                14216
            ],
            [
                14216,
                14217
            ],
            [
                14272,
                14295
            ],
            [
                14305,
                14311
            ],
            [
                14311,
                14355
            ],
            [
                14374,
                14412
            ],
            [
                14481,
                14483
            ],
            [
                14484,
                14504
            ],
            [
                14507,
                14515
            ],
            [
                14534,
                14536
            ],
            [
                14605,
                14679
            ],
            [
                14723,
                14731
            ],
            [
                14748,
                14751
            ],
            [
                14764,
                14819
            ],
            [
                14823,
                14840
            ],
            [
                14840,
                14883
            ],
            [
                14889,
                14891
            ],
            [
                14891,
                14892
            ],
            [
                14898,
                14913
            ],
            [
                14914,
                14916
            ],
            [
                14933,
                14951
            ],
            [
                14994,
                15032
            ],
            [
                15036,
                15077
            ],
            [
                15080,
                15092
            ],
            [
                15093,
                15105
            ],
            [
                15125,
                15162
            ],
            [
                15176,
                15195
            ],
            [
                15302,
                15337
            ],
            [
                15348,
                15353
            ],
            [
                15354,
                15357
            ],
            [
                15373,
                15378
            ],
            [
                15362,
                15369
            ],
            [
                15407,
                15420
            ],
            [
                15428,
                15432
            ],
            [
                15467,
                15486
            ],
            [
                15535,
                15537
            ],
            [
                15565,
                15574
            ],
            [
                15545,
                15546
            ],
            [
                15617,
                15624
            ],
            [
                15613,
                15616
            ],
            [
                15650,
                15668
            ],
            [
                15704,
                15706
            ],
            [
                15706,
                15738
            ],
            [
                15746,
                15769
            ],
            [
                15769,
                15858
            ],
            [
                15878,
                15953
            ],
            [
                15970,
                15998
            ],
            [
                16001,
                16009
            ],
            [
                16015,
                16025
            ],
            [
                16075,
                16077
            ],
            [
                16139,
                16153
            ],
            [
                16097,
                16099
            ],
            [
                16171,
                16189
            ],
            [
                16189,
                16192
            ],
            [
                16207,
                16216
            ],
            [
                16198,
                16206
            ],
            [
                16332,
                16351
            ],
            [
                16413,
                16416
            ],
            [
                16435,
                16437
            ],
            [
                16454,
                16538
            ],
            [
                16547,
                16556
            ],
            [
                16637,
                16669
            ],
            [
                16681,
                16683
            ],
            [
                16703,
                16798
            ],
            [
                16872,
                16896
            ],
            [
                16937,
                16939
            ],
            [
                16939,
                16950
            ],
            [
                16962,
                16968
            ],
            [
                17055,
                17066
            ],
            [
                17017,
                17025
            ],
            [
                17067,
                17086
            ],
            [
                17090,
                17141
            ],
            [
                17144,
                17155
            ],
            [
                17345,
                17362
            ],
            [
                17431,
                17436
            ],
            [
                17363,
                17384
            ],
            [
                17396,
                17398
            ],
            [
                17442,
                17447
            ],
            [
                17460,
                17467
            ],
            [
                17506,
                17509
            ],
            [
                17513,
                17540
            ],
            [
                17578,
                17602
            ],
            [
                17602,
                17744
            ],
            [
                17796,
                17798
            ],
            [
                17769,
                17794
            ],
            [
                17817,
                17819
            ],
            [
                17819,
                17829
            ],
            [
                17834,
                17842
            ],
            [
                17881,
                17891
            ],
            [
                17911,
                17918
            ],
            [
                17933,
                17935
            ],
            [
                17951,
                17959
            ],
            [
                17963,
                17978
            ],
            [
                17986,
                17995
            ],
            [
                17995,
                18009
            ],
            [
                18325,
                18327
            ],
            [
                18175,
                18225
            ],
            [
                18348,
                18350
            ],
            [
                18350,
                18361
            ],
            [
                18399,
                18450
            ],
            [
                18464,
                18468
            ],
            [
                18476,
                18489
            ],
            [
                18660,
                18709
            ],
            [
                18713,
                18721
            ],
            [
                18817,
                18819
            ],
            [
                18734,
                18746
            ],
            [
                18791,
                18816
            ],
            [
                18864,
                18887
            ],
            [
                18895,
                18901
            ],
            [
                18901,
                18966
            ],
            [
                19017,
                19033
            ],
            [
                19040,
                19067
            ],
            [
                19067,
                19069
            ],
            [
                19084,
                19103
            ],
            [
                19106,
                19108
            ],
            [
                19148,
                19153
            ],
            [
                19157,
                19159
            ],
            [
                19159,
                19188
            ],
            [
                19197,
                19199
            ],
            [
                19203,
                19210
            ],
            [
                19333,
                19335
            ],
            [
                19335,
                19343
            ],
            [
                19394,
                19399
            ],
            [
                19417,
                19425
            ],
            [
                19435,
                19437
            ],
            [
                19561,
                19617
            ],
            [
                19617,
                19629
            ],
            [
                19629,
                19641
            ],
            [
                19644,
                19696
            ],
            [
                19712,
                19715
            ],
            [
                19701,
                19708
            ],
            [
                19737,
                19748
            ],
            [
                19697,
                19700
            ],
            [
                19764,
                19774
            ],
            [
                19779,
                19787
            ],
            [
                19796,
                19819
            ],
            [
                19832,
                19852
            ],
            [
                19890,
                19899
            ],
            [
                19925,
                19928
            ],
            [
                19936,
                19974
            ],
            [
                19991,
                19996
            ],
            [
                19856,
                19865
            ],
            [
                20001,
                20059
            ],
            [
                20070,
                20115
            ],
            [
                20179,
                20181
            ],
            [
                20181,
                20192
            ],
            [
                20194,
                20258
            ],
            [
                20262,
                20301
            ],
            [
                20366,
                20368
            ],
            [
                20368,
                20377
            ],
            [
                20417,
                20420
            ],
            [
                20436,
                20469
            ],
            [
                20521,
                20545
            ],
            [
                20568,
                20579
            ],
            [
                20550,
                20557
            ],
            [
                20662,
                20664
            ],
            [
                20664,
                20686
            ],
            [
                20701,
                20705
            ],
            [
                20705,
                20710
            ],
            [
                20766,
                20771
            ],
            [
                20777,
                20779
            ],
            [
                20779,
                20816
            ],
            [
                20851,
                20866
            ],
            [
                20876,
                20920
            ],
            [
                20940,
                20942
            ],
            [
                20942,
                21026
            ],
            [
                21040,
                21048
            ],
            [
                21063,
                21087
            ],
            [
                21101,
                21102
            ],
            [
                21103,
                21155
            ],
            [
                21171,
                21183
            ],
            [
                21183,
                21248
            ],
            [
                21352,
                21354
            ],
            [
                21379,
                21391
            ],
            [
                21413,
                21425
            ],
            [
                21342,
                21344
            ],
            [
                21430,
                21464
            ],
            [
                21482,
                21493
            ],
            [
                21493,
                21496
            ],
            [
                21508,
                21517
            ],
            [
                21522,
                21545
            ],
            [
                21559,
                21575
            ],
            [
                21587,
                21612
            ],
            [
                21612,
                21652
            ],
            [
                21664,
                21668
            ],
            [
                21832,
                21842
            ],
            [
                21768,
                21771
            ],
            [
                21669,
                21672
            ],
            [
                21865,
                21867
            ],
            [
                21867,
                21877
            ],
            [
                21906,
                21957
            ],
            [
                21957,
                21985
            ],
            [
                22089,
                22091
            ],
            [
                22091,
                22105
            ],
            [
                22128,
                22162
            ],
            [
                22177,
                22201
            ],
            [
                22201,
                22314
            ],
            [
                22537,
                22541
            ],
            [
                22425,
                22451
            ],
            [
                22484,
                22487
            ],
            [
                22338,
                22342
            ],
            [
                22488,
                22529
            ],
            [
                22398,
                22403
            ],
            [
                22547,
                22556
            ],
            [
                22561,
                22600
            ],
            [
                22614,
                22654
            ],
            [
                22685,
                22720
            ],
            [
                22773,
                22805
            ],
            [
                22806,
                22864
            ],
            [
                22881,
                22882
            ],
            [
                22886,
                22891
            ],
            [
                22916,
                22942
            ],
            [
                22972,
                22973
            ],
            [
                23045,
                23054
            ],
            [
                23057,
                23072
            ],
            [
                23086,
                23095
            ],
            [
                23143,
                23219
            ],
            [
                23230,
                23252
            ],
            [
                23256,
                23291
            ],
            [
                23294,
                23320
            ],
            [
                23419,
                23459
            ],
            [
                23414,
                23417
            ],
            [
                23460,
                23464
            ],
            [
                23394,
                23397
            ],
            [
                23503,
                23509
            ],
            [
                23512,
                23532
            ],
            [
                23534,
                23590
            ],
            [
                23804,
                23823
            ],
            [
                23827,
                23831
            ],
            [
                23834,
                23848
            ],
            [
                23898,
                23900
            ],
            [
                23901,
                23941
            ],
            [
                23973,
                24012
            ],
            [
                24020,
                24051
            ],
            [
                24055,
                24091
            ],
            [
                24094,
                24115
            ],
            [
                24128,
                24130
            ],
            [
                24131,
                24165
            ],
            [
                24187,
                24190
            ],
            [
                24239,
                24247
            ],
            [
                24219,
                24229
            ],
            [
                24255,
                24264
            ],
            [
                24271,
                24273
            ],
            [
                24273,
                24314
            ],
            [
                24318,
                24334
            ],
            [
                24337,
                24363
            ],
            [
                24364,
                24449
            ],
            [
                24453,
                24490
            ],
            [
                24493,
                24511
            ],
            [
                24560,
                24562
            ],
            [
                24563,
                24610
            ],
            [
                24610,
                24638
            ],
            [
                24654,
                24662
            ],
            [
                24664,
                24682
            ],
            [
                24703,
                24704
            ],
            [
                24713,
                24736
            ],
            [
                24741,
                24748
            ],
            [
                24748,
                24782
            ],
            [
                24797,
                24835
            ],
            [
                24843,
                24853
            ],
            [
                24857,
                24862
            ],
            [
                24978,
                25008
            ],
            [
                25045,
                25071
            ],
            [
                25071,
                25121
            ],
            [
                25133,
                25173
            ],
            [
                25352,
                25414
            ],
            [
                25417,
                25428
            ],
            [
                25435,
                25437
            ],
            [
                25475,
                25525
            ],
            [
                25542,
                25554
            ],
            [
                25574,
                25587
            ],
            [
                25929,
                25939
            ],
            [
                25862,
                25865
            ],
            [
                25951,
                25955
            ],
            [
                25757,
                25768
            ],
            [
                25812,
                25814
            ],
            [
                25918,
                25921
            ],
            [
                25968,
                26009
            ],
            [
                26013,
                26031
            ],
            [
                26034,
                26051
            ],
            [
                26078,
                26082
            ],
            [
                26085,
                26102
            ],
            [
                26107,
                26119
            ],
            [
                26143,
                26156
            ],
            [
                26252,
                26255
            ],
            [
                26255,
                26287
            ],
            [
                26352,
                26359
            ],
            [
                26378,
                26392
            ],
            [
                26392,
                26429
            ],
            [
                26454,
                26460
            ],
            [
                26444,
                26448
            ],
            [
                26464,
                26494
            ],
            [
                26498,
                26533
            ],
            [
                26536,
                26544
            ],
            [
                26545,
                26587
            ],
            [
                26832,
                26853
            ],
            [
                26853,
                26892
            ],
            [
                26906,
                26919
            ],
            [
                26926,
                26928
            ],
            [
                26928,
                26984
            ],
            [
                26984,
                27014
            ],
            [
                27026,
                27039
            ],
            [
                27082,
                27098
            ],
            [
                27104,
                27113
            ],
            [
                27076,
                27077
            ],
            [
                27068,
                27071
            ],
            [
                28215,
                28219
            ],
            [
                27623,
                27633
            ],
            [
                27210,
                27212
            ],
            [
                28224,
                28230
            ],
            [
                28319,
                28321
            ],
            [
                28547,
                28579
            ],
            [
                28523,
                28530
            ],
            [
                28533,
                28545
            ],
            [
                28873,
                28881
            ],
            [
                28831,
                28834
            ],
            [
                28840,
                28841
            ],
            [
                28888,
                28901
            ],
            [
                28939,
                28940
            ],
            [
                28921,
                28939
            ],
            [
                28963,
                28969
            ],
            [
                28950,
                28961
            ],
            [
                28995,
                28997
            ],
            [
                28997,
                29065
            ],
            [
                29373,
                29375
            ],
            [
                29389,
                29391
            ],
            [
                29400,
                29410
            ],
            [
                29416,
                29426
            ],
            [
                29453,
                29454
            ],
            [
                29459,
                29491
            ],
            [
                29426,
                29427
            ],
            [
                29684,
                29691
            ],
            [
                29732,
                29737
            ],
            [
                29766,
                29768
            ],
            [
                29869,
                29871
            ],
            [
                29798,
                29802
            ],
            [
                29814,
                29837
            ],
            [
                29887,
                29889
            ],
            [
                29842,
                29864
            ],
            [
                29896,
                29898
            ],
            [
                29898,
                29987
            ],
            [
                30019,
                30059
            ],
            [
                30059,
                30109
            ],
            [
                30165,
                30167
            ],
            [
                30167,
                30182
            ],
            [
                30187,
                30216
            ],
            [
                30216,
                30240
            ],
            [
                30243,
                30253
            ],
            [
                30256,
                30270
            ],
            [
                30354,
                30356
            ],
            [
                30357,
                30419
            ],
            [
                30500,
                30524
            ],
            [
                30549,
                30570
            ],
            [
                30604,
                30615
            ],
            [
                30624,
                30666
            ],
            [
                30711,
                30720
            ],
            [
                30723,
                30737
            ],
            [
                30753,
                30761
            ],
            [
                30826,
                30842
            ],
            [
                30850,
                30897
            ],
            [
                30897,
                30912
            ],
            [
                31031,
                31063
            ],
            [
                31084,
                31118
            ],
            [
                31138,
                31167
            ],
            [
                31212,
                31217
            ],
            [
                31229,
                31238
            ],
            [
                31269,
                31271
            ],
            [
                31272,
                31275
            ],
            [
                31285,
                31287
            ],
            [
                31288,
                31299
            ],
            [
                31302,
                31319
            ],
            [
                31329,
                31331
            ],
            [
                31376,
                31379
            ],
            [
                31381,
                31386
            ],
            [
                31388,
                31392
            ],
            [
                31402,
                31404
            ],
            [
                31404,
                31419
            ],
            [
                31423,
                31429
            ],
            [
                31469,
                31471
            ],
            [
                31471,
                31540
            ],
            [
                31552,
                31559
            ],
            [
                31927,
                31929
            ],
            [
                31930,
                31944
            ],
            [
                31968,
                32015
            ],
            [
                32131,
                32133
            ],
            [
                32133,
                32186
            ],
            [
                32187,
                32190
            ],
            [
                32210,
                32296
            ],
            [
                32316,
                32325
            ],
            [
                32547,
                32549
            ],
            [
                32306,
                32312
            ],
            [
                32417,
                32441
            ],
            [
                32456,
                32470
            ],
            [
                32476,
                32479
            ],
            [
                32384,
                32387
            ],
            [
                32504,
                32509
            ],
            [
                32487,
                32492
            ],
            [
                32571,
                32573
            ],
            [
                32579,
                32591
            ],
            [
                32594,
                32633
            ],
            [
                32665,
                32667
            ],
            [
                32668,
                32718
            ],
            [
                32718,
                32759
            ],
            [
                32899,
                32955
            ],
            [
                32958,
                32969
            ],
            [
                32971,
                33017
            ],
            [
                33087,
                33128
            ],
            [
                33132,
                33150
            ],
            [
                33157,
                33165
            ],
            [
                33165,
                33167
            ],
            [
                33172,
                33180
            ],
            [
                33220,
                33236
            ],
            [
                33214,
                33219
            ],
            [
                33286,
                33297
            ],
            [
                33310,
                33323
            ],
            [
                33385,
                33387
            ],
            [
                33416,
                33462
            ],
            [
                33462,
                33513
            ],
            [
                33525,
                33545
            ],
            [
                33552,
                33588
            ],
            [
                33591,
                33598
            ],
            [
                33634,
                33636
            ],
            [
                33636,
                33671
            ],
            [
                33678,
                33708
            ],
            [
                33733,
                33744
            ],
            [
                33758,
                33817
            ],
            [
                33835,
                33870
            ],
            [
                33880,
                33884
            ],
            [
                33887,
                33907
            ],
            [
                33913,
                33936
            ],
            [
                33943,
                33976
            ],
            [
                34013,
                34042
            ],
            [
                34045,
                34053
            ],
            [
                34067,
                34069
            ],
            [
                34070,
                34113
            ],
            [
                34127,
                34129
            ],
            [
                34138,
                34147
            ],
            [
                34153,
                34164
            ],
            [
                34175,
                34236
            ],
            [
                34238,
                34242
            ],
            [
                34244,
                34270
            ],
            [
                34486,
                34490
            ],
            [
                34551,
                34554
            ],
            [
                34505,
                34506
            ],
            [
                34560,
                34626
            ],
            [
                34626,
                34641
            ],
            [
                34642,
                34652
            ],
            [
                34695,
                34715
            ],
            [
                34735,
                34750
            ],
            [
                34760,
                34762
            ],
            [
                34762,
                34799
            ],
            [
                34891,
                34892
            ],
            [
                35113,
                35116
            ],
            [
                34799,
                34801
            ],
            [
                34834,
                34840
            ],
            [
                34901,
                34918
            ],
            [
                34934,
                34948
            ],
            [
                34957,
                34958
            ],
            [
                34861,
                34870
            ],
            [
                35129,
                35131
            ],
            [
                35315,
                35392
            ],
            [
                35453,
                35510
            ],
            [
                35515,
                35624
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                88
            ],
            [
                88,
                190
            ],
            [
                190,
                236
            ],
            [
                236,
                347
            ],
            [
                347,
                396
            ],
            [
                396,
                470
            ],
            [
                470,
                481
            ],
            [
                481,
                578
            ],
            [
                578,
                589
            ],
            [
                589,
                752
            ],
            [
                752,
                784
            ],
            [
                784,
                907
            ],
            [
                907,
                968
            ],
            [
                968,
                1076
            ],
            [
                1076,
                1149
            ],
            [
                1149,
                1165
            ],
            [
                1165,
                1236
            ],
            [
                1236,
                1258
            ],
            [
                1258,
                1289
            ],
            [
                1289,
                1334
            ],
            [
                1334,
                1354
            ],
            [
                1354,
                1374
            ],
            [
                1374,
                1404
            ],
            [
                1404,
                1457
            ],
            [
                1457,
                1597
            ],
            [
                1597,
                1670
            ],
            [
                1670,
                1793
            ],
            [
                1793,
                1851
            ],
            [
                1851,
                1953
            ],
            [
                1953,
                2221
            ],
            [
                2221,
                2259
            ],
            [
                2259,
                2267
            ],
            [
                2267,
                2287
            ],
            [
                2287,
                2297
            ],
            [
                2297,
                2443
            ],
            [
                2443,
                2541
            ],
            [
                2541,
                2598
            ],
            [
                2598,
                2690
            ],
            [
                2690,
                2866
            ],
            [
                2866,
                2939
            ],
            [
                2939,
                3332
            ],
            [
                3332,
                3505
            ],
            [
                3505,
                3772
            ],
            [
                3772,
                3840
            ],
            [
                3840,
                3930
            ],
            [
                3930,
                3940
            ],
            [
                3940,
                4196
            ],
            [
                4196,
                4317
            ],
            [
                4317,
                4489
            ],
            [
                4489,
                4735
            ],
            [
                4735,
                4868
            ],
            [
                4868,
                4990
            ],
            [
                4990,
                5119
            ],
            [
                5119,
                5217
            ],
            [
                5217,
                5234
            ],
            [
                5234,
                5245
            ],
            [
                5245,
                5260
            ],
            [
                5260,
                5268
            ],
            [
                5268,
                5306
            ],
            [
                5306,
                5441
            ],
            [
                5441,
                5460
            ],
            [
                5460,
                5480
            ],
            [
                5480,
                5507
            ],
            [
                5507,
                5649
            ],
            [
                5649,
                5672
            ],
            [
                5672,
                5680
            ],
            [
                5680,
                5779
            ],
            [
                5779,
                5786
            ],
            [
                5786,
                5801
            ],
            [
                5801,
                5819
            ],
            [
                5819,
                5827
            ],
            [
                5827,
                5973
            ],
            [
                5973,
                5992
            ],
            [
                5992,
                6006
            ],
            [
                6006,
                6031
            ],
            [
                6031,
                6060
            ],
            [
                6060,
                6073
            ],
            [
                6073,
                6080
            ],
            [
                6080,
                6128
            ],
            [
                6128,
                6188
            ],
            [
                6188,
                6212
            ],
            [
                6212,
                6303
            ],
            [
                6303,
                6329
            ],
            [
                6329,
                6342
            ],
            [
                6342,
                6376
            ],
            [
                6376,
                6406
            ],
            [
                6406,
                6462
            ],
            [
                6462,
                6489
            ],
            [
                6489,
                6627
            ],
            [
                6627,
                6738
            ],
            [
                6738,
                7104
            ],
            [
                7104,
                7226
            ],
            [
                7226,
                7316
            ],
            [
                7316,
                7571
            ],
            [
                7571,
                7592
            ],
            [
                7592,
                7611
            ],
            [
                7611,
                7649
            ],
            [
                7649,
                7743
            ],
            [
                7743,
                7814
            ],
            [
                7814,
                7862
            ],
            [
                7862,
                7939
            ],
            [
                7939,
                7946
            ],
            [
                7946,
                7972
            ],
            [
                7972,
                7982
            ],
            [
                7982,
                8021
            ],
            [
                8021,
                8028
            ],
            [
                8028,
                8083
            ],
            [
                8083,
                8120
            ],
            [
                8120,
                8164
            ],
            [
                8164,
                8212
            ],
            [
                8212,
                8299
            ],
            [
                8299,
                8332
            ],
            [
                8332,
                8411
            ],
            [
                8411,
                8461
            ],
            [
                8461,
                8654
            ],
            [
                8654,
                8674
            ],
            [
                8674,
                8720
            ],
            [
                8720,
                8740
            ],
            [
                8740,
                8771
            ],
            [
                8771,
                8815
            ],
            [
                8815,
                8886
            ],
            [
                8886,
                8936
            ],
            [
                8936,
                8969
            ],
            [
                8969,
                9063
            ],
            [
                9063,
                9107
            ],
            [
                9107,
                9137
            ],
            [
                9137,
                9174
            ],
            [
                9174,
                9188
            ],
            [
                9188,
                9199
            ],
            [
                9199,
                9276
            ],
            [
                9276,
                9370
            ],
            [
                9370,
                9577
            ],
            [
                9577,
                9605
            ],
            [
                9605,
                9646
            ],
            [
                9646,
                9670
            ],
            [
                9670,
                9705
            ],
            [
                9705,
                9750
            ],
            [
                9750,
                9807
            ],
            [
                9807,
                9911
            ],
            [
                9911,
                10009
            ],
            [
                10009,
                10115
            ],
            [
                10115,
                10280
            ],
            [
                10280,
                10499
            ],
            [
                10499,
                10622
            ],
            [
                10622,
                10729
            ],
            [
                10729,
                10801
            ],
            [
                10801,
                10957
            ],
            [
                10957,
                11154
            ],
            [
                11154,
                11289
            ],
            [
                11289,
                11381
            ],
            [
                11381,
                11418
            ],
            [
                11418,
                11565
            ],
            [
                11565,
                11654
            ],
            [
                11654,
                11694
            ],
            [
                11694,
                11816
            ],
            [
                11816,
                11982
            ],
            [
                11982,
                12055
            ],
            [
                12055,
                12260
            ],
            [
                12260,
                12298
            ],
            [
                12298,
                12309
            ],
            [
                12309,
                12401
            ],
            [
                12401,
                12428
            ],
            [
                12428,
                12460
            ],
            [
                12460,
                12528
            ],
            [
                12528,
                12586
            ],
            [
                12586,
                12885
            ],
            [
                12885,
                12990
            ],
            [
                12990,
                13026
            ],
            [
                13026,
                13066
            ],
            [
                13066,
                13089
            ],
            [
                13089,
                13210
            ],
            [
                13210,
                13377
            ],
            [
                13377,
                13466
            ],
            [
                13466,
                13605
            ],
            [
                13605,
                13642
            ],
            [
                13642,
                13709
            ],
            [
                13709,
                13781
            ],
            [
                13781,
                13854
            ],
            [
                13854,
                13904
            ],
            [
                13904,
                14000
            ],
            [
                14000,
                14028
            ],
            [
                14028,
                14061
            ],
            [
                14061,
                14116
            ],
            [
                14116,
                14216
            ],
            [
                14216,
                14311
            ],
            [
                14311,
                14483
            ],
            [
                14483,
                14536
            ],
            [
                14536,
                14605
            ],
            [
                14605,
                14840
            ],
            [
                14840,
                14891
            ],
            [
                14891,
                15035
            ],
            [
                15035,
                15080
            ],
            [
                15080,
                15092
            ],
            [
                15092,
                15216
            ],
            [
                15216,
                15301
            ],
            [
                15301,
                15340
            ],
            [
                15340,
                15353
            ],
            [
                15353,
                15537
            ],
            [
                15537,
                15706
            ],
            [
                15706,
                15769
            ],
            [
                15769,
                15969
            ],
            [
                15969,
                16009
            ],
            [
                16009,
                16077
            ],
            [
                16077,
                16189
            ],
            [
                16189,
                16354
            ],
            [
                16354,
                16413
            ],
            [
                16413,
                16437
            ],
            [
                16437,
                16442
            ],
            [
                16442,
                16559
            ],
            [
                16559,
                16614
            ],
            [
                16614,
                16683
            ],
            [
                16683,
                16939
            ],
            [
                16939,
                17089
            ],
            [
                17089,
                17144
            ],
            [
                17144,
                17156
            ],
            [
                17156,
                17287
            ],
            [
                17287,
                17319
            ],
            [
                17319,
                17345
            ],
            [
                17345,
                17602
            ],
            [
                17602,
                17819
            ],
            [
                17819,
                17995
            ],
            [
                17995,
                18350
            ],
            [
                18350,
                18591
            ],
            [
                18591,
                18651
            ],
            [
                18651,
                18659
            ],
            [
                18659,
                18712
            ],
            [
                18712,
                18901
            ],
            [
                18901,
                18966
            ],
            [
                18966,
                19017
            ],
            [
                19017,
                19067
            ],
            [
                19067,
                19159
            ],
            [
                19159,
                19335
            ],
            [
                19335,
                19437
            ],
            [
                19437,
                19617
            ],
            [
                19617,
                19629
            ],
            [
                19629,
                19644
            ],
            [
                19644,
                20181
            ],
            [
                20181,
                20368
            ],
            [
                20368,
                20664
            ],
            [
                20664,
                20779
            ],
            [
                20779,
                20942
            ],
            [
                20942,
                21103
            ],
            [
                21103,
                21183
            ],
            [
                21183,
                21493
            ],
            [
                21493,
                21612
            ],
            [
                21612,
                21867
            ],
            [
                21867,
                21957
            ],
            [
                21957,
                22091
            ],
            [
                22091,
                22201
            ],
            [
                22201,
                22720
            ],
            [
                22720,
                22864
            ],
            [
                22864,
                22916
            ],
            [
                22916,
                22974
            ],
            [
                22974,
                23010
            ],
            [
                23010,
                23044
            ],
            [
                23044,
                23085
            ],
            [
                23085,
                23098
            ],
            [
                23098,
                23122
            ],
            [
                23122,
                23142
            ],
            [
                23142,
                23255
            ],
            [
                23255,
                23294
            ],
            [
                23294,
                23320
            ],
            [
                23320,
                23502
            ],
            [
                23502,
                23593
            ],
            [
                23593,
                23608
            ],
            [
                23608,
                23644
            ],
            [
                23644,
                23756
            ],
            [
                23756,
                23826
            ],
            [
                23826,
                23834
            ],
            [
                23834,
                23900
            ],
            [
                23900,
                23944
            ],
            [
                23944,
                23972
            ],
            [
                23972,
                24054
            ],
            [
                24054,
                24094
            ],
            [
                24094,
                24130
            ],
            [
                24130,
                24165
            ],
            [
                24165,
                24273
            ],
            [
                24273,
                24317
            ],
            [
                24317,
                24363
            ],
            [
                24363,
                24452
            ],
            [
                24452,
                24493
            ],
            [
                24493,
                24562
            ],
            [
                24562,
                24610
            ],
            [
                24610,
                24748
            ],
            [
                24748,
                24862
            ],
            [
                24862,
                24972
            ],
            [
                24972,
                25071
            ],
            [
                25071,
                25173
            ],
            [
                25173,
                25437
            ],
            [
                25437,
                25589
            ],
            [
                25589,
                25757
            ],
            [
                25757,
                25967
            ],
            [
                25967,
                26012
            ],
            [
                26012,
                26077
            ],
            [
                26077,
                26085
            ],
            [
                26085,
                26102
            ],
            [
                26102,
                26208
            ],
            [
                26208,
                26245
            ],
            [
                26245,
                26287
            ],
            [
                26287,
                26352
            ],
            [
                26352,
                26392
            ],
            [
                26392,
                26497
            ],
            [
                26497,
                26544
            ],
            [
                26544,
                26587
            ],
            [
                26587,
                26647
            ],
            [
                26647,
                26770
            ],
            [
                26770,
                26808
            ],
            [
                26808,
                26832
            ],
            [
                26832,
                26853
            ],
            [
                26853,
                26928
            ],
            [
                26928,
                26984
            ],
            [
                26984,
                28322
            ],
            [
                28322,
                28493
            ],
            [
                28493,
                28581
            ],
            [
                28581,
                28677
            ],
            [
                28677,
                28827
            ],
            [
                28827,
                28997
            ],
            [
                28997,
                29375
            ],
            [
                29375,
                29502
            ],
            [
                29502,
                29683
            ],
            [
                29683,
                29708
            ],
            [
                29708,
                29768
            ],
            [
                29768,
                29898
            ],
            [
                29898,
                29987
            ],
            [
                29987,
                30019
            ],
            [
                30019,
                30059
            ],
            [
                30059,
                30167
            ],
            [
                30167,
                30216
            ],
            [
                30216,
                30356
            ],
            [
                30356,
                30710
            ],
            [
                30710,
                30723
            ],
            [
                30723,
                30897
            ],
            [
                30897,
                31084
            ],
            [
                31084,
                31287
            ],
            [
                31287,
                31302
            ],
            [
                31302,
                31331
            ],
            [
                31331,
                31376
            ],
            [
                31376,
                31404
            ],
            [
                31404,
                31471
            ],
            [
                31471,
                31561
            ],
            [
                31561,
                31624
            ],
            [
                31624,
                31793
            ],
            [
                31793,
                31868
            ],
            [
                31868,
                31923
            ],
            [
                31923,
                32133
            ],
            [
                32133,
                32573
            ],
            [
                32573,
                32594
            ],
            [
                32594,
                32667
            ],
            [
                32667,
                32718
            ],
            [
                32718,
                32761
            ],
            [
                32761,
                32805
            ],
            [
                32805,
                32823
            ],
            [
                32823,
                32898
            ],
            [
                32898,
                33017
            ],
            [
                33017,
                33087
            ],
            [
                33087,
                33131
            ],
            [
                33131,
                33167
            ],
            [
                33167,
                33387
            ],
            [
                33387,
                33462
            ],
            [
                33462,
                33551
            ],
            [
                33551,
                33636
            ],
            [
                33636,
                33873
            ],
            [
                33873,
                33887
            ],
            [
                33887,
                33907
            ],
            [
                33907,
                33939
            ],
            [
                33939,
                33979
            ],
            [
                33979,
                34012
            ],
            [
                34012,
                34069
            ],
            [
                34069,
                34129
            ],
            [
                34129,
                34273
            ],
            [
                34273,
                34467
            ],
            [
                34467,
                34626
            ],
            [
                34626,
                34762
            ],
            [
                34762,
                34799
            ],
            [
                34799,
                35131
            ],
            [
                35131,
                35311
            ],
            [
                35311,
                35393
            ],
            [
                35393,
                35453
            ],
            [
                35453,
                35624
            ]
        ]
    },
    "abridged": {
        "text": "A charming introduction to a hermit's life! Four weeks' torture and sickness! Oh, these bleak winds and bitter northern skies, and impassable roads, and slow country surgeons! And oh, this lack of human faces! Worse than all, the doctor tells me that I must not expect to be out of doors till spring!\nMr. Heathcliff honoured me with a call. About seven days ago he sent me a brace of grouse. Scoundrel! He is to blame for my illness; as I had a great mind to tell him. But how could I offend a man who was charitable enough to sit at my bedside a good hour, and talk on some other subject than pills and leeches?\nBeing too weak to read, I rang Mrs. Dean and asked her to finish her tale. I remembered her hero had run off, and never been heard of for three years; and the heroine was married.\n'Take your seat,' I said. 'Draw your knitting out of your pocket - now continue the history of Mr. Heathcliff. Did he go to the Continent, and come back an educated gentleman? or did he escape to America, and fight against the English? or make his fortune on the highways?'\n'He may have done all those, Mr. Lockwood; but I couldn't say. I don't know how he gained his money; nor how he raised his mind from its savage ignorance: but I'll proceed, if you think it will not weary you.'\nI took Miss Catherine to Thrushcross Grange (said Mrs. Dean); and she behaved much better than I expected. She seemed almost over-fond of Mr. Linton; and even to his sister she showed affection. They were both very attentive to her comfort, certainly. It was not the thorn bending to the honeysuckles, but the honeysuckles embracing the thorn. She stood erect, and the others yielded.\nI observed that Mr. Edgar had a deep-rooted fear of angering her. If ever he heard me answer her sharply, he would frown, and spoke sternly to me about my pertness. Since he was a kind master, I learned to be less touchy; and, for half a year, the gunpowder lay as harmless as sand, because no fire came near to explode it.\nCatherine had seasons of gloom now and then: they were respected by her husband, who thought they were produced by her previous illness. The return of sunshine was welcomed by answering sunshine from him. I believe that they were really in possession of deep and growing happiness.\nIt ended. Events happened to make each feel that they were not first in the other's thoughts.\nOne mellow evening in September, I was coming from the garden with a basket of apples. It was dusk, and the moon looked over the high wall of the court, causing shadows to lurk in the corners. I set my burden by the kitchen-door, and lingered to rest, drawing in the soft, sweet air, when I heard a voice behind me say, 'Nelly, is that you?'\nIt was a deep voice, and foreign in tone; yet something in its manner sounded familiar. I turned around fearfully, for I had seen nobody. Something stirred in the porch; and I distinguished a tall man dressed in dark clothes, with dark face and hair.\n'Who can it be?' I thought.\n'I have waited here an hour,' he resumed; 'and the place has been as still as death. I dared not enter. You do not know me? I'm not a stranger!'\nA ray fell on his features; the cheeks were sallow, and half covered with black whiskers; the brows lowering, the eyes deep-set and singular. I remembered the eyes.\n'What!' I cried in amazement. 'Is it really you?'\n'Yes; Heathcliff,' he replied, glancing up to the windows, which reflected a score of glittering moons, but showed no lights within. 'Are they at home? Is she here? I want to have one word with her. Go and say some person from Gimmerton desires to see her.'\n'The surprise will put her out of her head!' I exclaimed. 'Heathcliff! Have you been for a soldier?'\n'Go and carry my message,' he said impatiently. 'I'm in hell till you do!'\nI entered; and found Mr. and Mrs. Linton in the parlour. They sat together in a window which displayed the wild green park and the valley of Gimmerton, with a long line of mist winding nearly to its top. Wuthering Heights rose above this silvery vapour. All looked wondrously peaceful. I shrank from performing my errand; but I muttered, 'A person from Gimmerton wishes to see you, ma'am.'\n'Well, close the curtains, Nelly,' she said; 'I'll be back directly.'\nShe left the apartment; Mr. Edgar inquired, carelessly, who it was.\n'Some one mistress does not expect,' I replied. 'That Heathcliff who used to live at Mr. Earnshaw's.'\n'What! the gipsy?' he cried.\n'Hush! you must not call him that, master,' I said. 'She'd be sadly grieved to hear you. She was nearly heartbroken when he ran off. I guess his return will be a joy to her.'\nCatherine flew upstairs, breathless and wild; too excited to show gladness: indeed, by her face, you would rather have guessed an awful calamity had happened.\n'Oh, Edgar, Edgar!' she panted, flinging her arms round his neck. 'Oh, Edgar darling! Heathcliff's come back!'\n'Well, well,' cried her husband, crossly, 'don't strangle me for that! He never struck me as such a marvellous treasure.'\n'I know you didn't like him,' she answered. 'Yet, for my sake, you must be friends now. Shall I tell him to come up?'\n'Here,' he said, 'into the parlour?'\n'Where else?'\nHe looked vexed, and suggested the kitchen as a more suitable place.\n'No,\" said Mrs. Linton, half angry, half laughing; 'Set two tables here, Ellen: one for your master and Miss Isabella, being gentry; the other for Heathcliff and myself, being of the lower orders. Will that please you, dear? Or must I have a fire lit elsewhere? I'll run down to my guest. I'm afraid the joy is too great to be real!'\nShe was about to dart off again; but Edgar stopped her.\n'Bid him step up,' he said to me; 'and, Catherine, try to be glad, without being absurd. The whole household need not witness the sight of your welcoming a runaway servant as a brother.'\nI descended, and found Heathcliff waiting under the porch. He followed me into the presence of the master and mistress, whose flushed cheeks betrayed signs of an argument. But when her friend appeared at the door, she sprang forward, and led him to Linton; and then she seized Linton's reluctant fingers and crushed them into his.\nNow, fully revealed by the candlelight, I was amazed to behold the transformation of Heathcliff. He had grown a tall, athletic, well-formed man; beside whom my master seemed quite slender and youth-like. His upright carriage suggested the idea of his having been in the army. His face looked older and more decisive than Mr. Linton's; and intelligent, with no sign of its former degradation. A half-civilised ferocity lurked yet in the eyes full of black fire, but it was subdued; and his manner was dignified: quite without roughness.\nMy master's surprise equalled mine: he remained for a minute at a loss how to address the ploughboy, as he had called him. Heathcliff dropped his slight hand, and stood looking at him coolly till he chose to speak.\n'Sit down, sir,' he said, at length. 'Mrs. Linton, recalling old times, wishes me to receive you cordially; and, of course, I am gratified when anything occurs to please her.'\n'I also,' answered Heathcliff, 'especially if it be anything in which I have a part. I shall stay an hour or two willingly.'\nHe took a seat opposite Catherine, who kept her eyes fixed on him as if she feared he would vanish. He did not raise his gaze to her often: a quick glance now and then sufficed; but it flashed back, each time more confidently, the undisguised delight he drank from her look. They were too much absorbed in their mutual joy to suffer embarrassment.\nNot so Mr. Edgar: he grew pale with annoyance: a feeling that reached its climax when his lady rose, and, stepping across the rug, seized Heathcliff's hands again, and laughed like one beside herself.\n'I shall think it a dream tomorrow!' she cried. 'I shall not be able to believe that I have seen, and touched, and spoken to you once more. And yet, cruel Heathcliff! you don't deserve this welcome. To be absent and silent for three years, and never to think of me!'\n'A little more than you have thought of me,' he murmured. 'I heard of your marriage, Cathy; and I decided to have one glimpse of your face; and afterwards to settle my score with Hindley; and then prevent the law by doing execution on myself. Your welcome has put these ideas out of my mind. You'll not drive me off again. You were really sorry for me, were you? Well, there was cause. I've fought through a bitter life since I last heard your voice; and I struggled only for you!'\n'Catherine, please come to the table,' interrupted Linton, striving to keep his ordinary tone, and a measure of politeness. 'Mr. Heathcliff will have a long walk, wherever he may lodge to-night; and I'm thirsty.'\nMiss Isabella came; then, with the tea poured, I left the room. The meal hardly lasted ten minutes. Catherine could neither eat nor drink. Edgar scarcely swallowed a mouthful. Their guest did not stay more than an hour. I asked him, as he left, if he went to Gimmerton?\n'No, to Wuthering Heights,' he answered: 'Mr. Earnshaw invited me, when I called this morning.'\nHindley invited him! I pondered this sentence painfully, after he was gone. Was he coming into the country to work mischief under a cloak? I felt that he had better have stayed away.\nAbout the middle of the night, I was wakened by Mrs. Linton gliding into my chamber.\n'I cannot rest, Ellen,' she said. 'Edgar is sulky, because I'm glad of a thing that does not interest him: he is pettish, and said I was cruel and selfish for wishing to talk when he was sick and sleepy. He always contrives to be sick at the least thing! I said a few sentences in praise of Heathcliff, and he began to cry: so I got up and left him.'\n'What use is it praising Heathcliff to him?' I answered. 'As lads they did not like each other, and Heathcliff would hate to hear him praised.'\n'But does it not show great weakness?' said she. 'I'm never envious of Isabella's fair hair or her dainty elegance. In a dispute, I yield and call her a darling. It pleases her brother to see us friends, and that pleases me. But they are very much alike: they are spoiled children, and fancy the world was made for them; and though I humour both, I think a smart chastisement might improve them.'\n'You're mistaken, Mrs. Linton,' said I. 'They humour you. They make it their business to foresee all your desires. If you fall out, however, they can be as obstinate as you can.'\nShe laughed. 'I have such faith in Linton's love, that I believe I might kill him, and he wouldn't retaliate. But he needn't resort to whining. Instead of melting into tears because I said that Heathcliff was now worthy of anyone's regard, he ought to have said it himself. He must get used to him. I'm sure Heathcliff behaved excellently!'\n'What do you think of his going to Wuthering Heights?' I inquired.\n'He said he called there to gather information about me; and Hindley asked him what he had been doing, and desired him to walk in. There were some persons sitting at cards; Heathcliff joined them; my brother lost some money to him, and, finding him plentifully supplied, he asked him to come again in the evening. Hindley is reckless; he doesn't reflect that perhaps he should mistrust one whom he has injured. But Heathcliff says he has an attachment to the house where we lived together. He means to pay well to lodge at the Heights; and doubtless my brother's greed will lead him to accept.'\n'Have you no fear of the consequences, Mrs. Linton?'\n'None for Heathcliff,' she replied: 'a little for Hindley: but I stand between him and harm. The event of this evening has reconciled me to God and humanity! Oh, I've endured very bitter misery, Nelly! If Edgar knew how bitter, he would not be so petulant. It was kindness for him which made me bear it. However, now I can bear anything! As a proof, I'll go make my peace with Edgar instantly. Good-night! I'm an angel!'\nIn this self-complacent conviction she departed; and her success was obvious the next day. Mr. Linton not only ceased his peevishness (though he seemed still subdued), but he let her take Isabella with her to Wuthering Heights; and Catherine rewarded him with such a summer of sweetness and affection as made the house a paradise for several days.\nHeathcliff - Mr. Heathcliff I should say in future - used the liberty of visiting Thrushcross Grange cautiously, at first. Catherine wisely moderated her pleasure in receiving him; and he retained a great deal of his boyhood reserve. My master's uneasiness was lulled, and other matters distracted him for a while.\nHis new source of trouble sprang from Isabella Linton, who felt a sudden and irresistible attraction towards Heathcliff. She was at that time a charming young lady of eighteen; infantile in manners, though with keen wit, and a keen temper, too.\nHer brother, who loved her tenderly, was appalled at her preference. Leaving aside the degradation of an alliance with a nameless man, he understood Heathcliff's character. He knew that, though Heathcliff's exterior was altered, his mind was unchanged. And that mind revolted him: he shrank from the idea of giving Isabella to its keeping. He would have recoiled still more had he known that Heathcliff cared nothing for her.\nWe had all noticed for a while that Miss Linton fretted and pined over something. She grew cross and wearisome. We excused her on the plea of ill-health: she was fading before our eyes. But one day, when she had been peculiarly wayward, rejecting her breakfast, complaining that the servants did not obey her, that she had caught a cold and that we let the parlour fire go out on purpose, and a hundred more frivolous accusations, Mrs. Linton insisted that she should get to bed; and threatened to send for the doctor. Isabella exclaimed that her health was perfect, and that it was only Catherine's harshness which made her unhappy.\n'When have I been harsh?' cried the mistress, amazed.\n'Yesterday,' sobbed Isabella.\n'Yesterday! When?'\n'In our walk along the moor: you told me to ramble where I pleased, while you walked on with Mr. Heathcliff!'\n'And that's your notion of harshness?' said Catherine, laughing. 'I merely thought Heathcliff's talk would not have entertained you.'\n'Oh, no,' wept the young lady; 'you wished me away, because you knew I liked to be there! I wanted to be with-'\n'Well?' said Catherine.\n'With him: and I won't be always sent off! You are a dog in the manger, Cathy, and want no one to be loved but yourself!'\n'You are an impertinent little monkey!' exclaimed Mrs. Linton. 'But I'll not believe this idiocy! You cannot consider Heathcliff agreeable! I hope I have misunderstood you, Isabella?'\n'No, you have not,' said the infatuated girl. 'I love him more than ever you loved Edgar, and he might love me, if you would let him!'\n'I wouldn't be you for a kingdom, then!' Catherine declared. 'Nelly, help me to convince her of her madness. Tell her what Heathcliff is: a creature without refinement; a wilderness of furze and stone. I'd as soon put that little canary outside on a winter's day, as recommend you to give your heart to him! Don't imagine that he conceals kindness beneath a stern exterior! He's not a rough diamond - a pearl-containing oyster: he's a fierce, pitiless, wolfish man. He'd crush you like a sparrow's egg, Isabella, if he found you troublesome. Yet he'd be quite capable of marrying your fortune: avarice is becoming his besetting sin.'\n'I don't believe you!' said Miss Linton indignantly.\n'Ah! You think I speak from wicked selfishness?'\n'I'm certain you do,' retorted Isabella.\n'Good!' cried the other. 'Try for yourself: I have done.'\n'All is against me!' sobbed Isabella, as Mrs. Linton left the room. 'But she lied, didn't she? Mr. Heathcliff is not a fiend: he has a true soul, or how could he remember her?'\n'Banish him from your thoughts, Miss,' I said. 'He's a bird of bad omen: no mate for you. How has he got rich? Why is he staying at Wuthering Heights, with a man whom he hates? They say Mr. Earnshaw is worse and worse since he came. They sit up all night together, and Hindley does nothing but gamble and drink, pouring his gold into Heathcliff's pocket!'\n'I'll not listen to your slanders, Ellen!' she replied.\nThe next day, my master was out, and Mr. Heathcliff called in his absence. Catherine and Isabella were sitting in the library, on hostile terms. As Heathcliff passed the window, I noticed a mischievous smile on Catherine's face.\n'Come in!' she exclaimed gaily. 'We need someone to thaw the ice between us; and you are the very person. Heathcliff, I'm proud to show you, at last, somebody that dotes on you more than myself. Nay, it's not Nelly; don't look at her! My poor little sister-in-law is breaking her heart over you. It lies in your power to be Edgar's brother! No, no, Isabella, you shan't run off,' she continued, grasping her. 'We were quarrelling like cats about you, Heathcliff; and I was informed that if I would only stand aside, my rival would shoot an arrow into your soul that would fix you for ever!'\n'Catherine!' said Isabella, with dignity, 'I'd thank you to keep to the truth and not slander me, even in joke! Mr. Heathcliff, what amuses her is painful to me.'\nAs the guest answered nothing, but looked thoroughly indifferent, she whispered to Catherine to let her go.\n'By no means!' cried Mrs. Linton. 'You shall stay! Heathcliff, why aren't you pleased? Isabella swears that the love Edgar has for me is nothing to that she has for you.'\nHeathcliff stared hard at Isabella, as one might do at a strange repulsive animal. The poor thing couldn't bear that; she grew white and then red, and, while tears beaded her lashes, bent the strength of her small fingers to loosen Catherine's clutch. When she could not remove the hand, she began to use her sharp nails.\n'There's a tigress!' exclaimed Mrs. Linton, setting her free. 'Begone, for God's sake, and hide your vixen face! How foolish to reveal those talons to him!'\n'I'd wrench them off her fingers, if they ever menaced me,' he answered brutally, when the door had closed after her. 'But you were not speaking the truth, were you?'\n'I assure you I was,' returned Catherine. 'She has been raving about you, and abusing me, because I described your failings. I wished to punish her sauciness, that's all. I like her too well, my dear Heathcliff, to let you seize and devour her.'\n'And I like her too ill to attempt it,' said he. 'You'd hear of odd things if I lived with that mawkish, waxen face: I'd be painting it the colours of the rainbow, and turning the blue eyes black: they detestably resemble Linton's.'\n'Delectably!' observed Catherine. 'They are dove's eyes - angel's!'\n'She's her brother's heir, is she not?'\n'I should be sorry to think so,' she returned. 'Half a dozen nephews shall erase her title, I hope! Keep your mind off the subject: you are too prone to covet your neighbour's goods; remember this neighbour's goods are mine.'\nThey ceased to discuss the matter; but Heathcliff, I felt certain, recalled it often in the course of the evening. I saw him smile ominously to himself whenever Mrs. Linton was absent from the room.\nI determined to watch his movements. I felt for my master, for he was kind and honourable - more honourable than Catherine. Heathcliff's visits were a continual nightmare to me; and, I suspected, to my master also.\nAnd as for Wuthering Heights - I felt that God had forsaken the stray sheep there to its wicked wanderings, and an evil beast prowled between it and the fold, waiting his time to spring and destroy.",
        "paragraph_chars": [
            [
                0,
                301
            ],
            [
                301,
                613
            ],
            [
                613,
                793
            ],
            [
                793,
                1067
            ],
            [
                1067,
                1277
            ],
            [
                1277,
                1662
            ],
            [
                1662,
                1986
            ],
            [
                1986,
                2268
            ],
            [
                2268,
                2362
            ],
            [
                2362,
                2704
            ],
            [
                2704,
                2955
            ],
            [
                2955,
                2983
            ],
            [
                2983,
                3128
            ],
            [
                3128,
                3293
            ],
            [
                3293,
                3343
            ],
            [
                3343,
                3601
            ],
            [
                3601,
                3702
            ],
            [
                3702,
                3777
            ],
            [
                3777,
                4167
            ],
            [
                4167,
                4237
            ],
            [
                4237,
                4305
            ],
            [
                4305,
                4407
            ],
            [
                4407,
                4436
            ],
            [
                4436,
                4611
            ],
            [
                4611,
                4770
            ],
            [
                4770,
                4881
            ],
            [
                4881,
                5003
            ],
            [
                5003,
                5121
            ],
            [
                5121,
                5158
            ],
            [
                5158,
                5172
            ],
            [
                5172,
                5241
            ],
            [
                5241,
                5575
            ],
            [
                5575,
                5631
            ],
            [
                5631,
                5818
            ],
            [
                5818,
                6149
            ],
            [
                6149,
                6685
            ],
            [
                6685,
                6900
            ],
            [
                6900,
                7076
            ],
            [
                7076,
                7201
            ],
            [
                7201,
                7549
            ],
            [
                7549,
                7750
            ],
            [
                7750,
                8017
            ],
            [
                8017,
                8499
            ],
            [
                8499,
                8712
            ],
            [
                8712,
                8982
            ],
            [
                8982,
                9078
            ],
            [
                9078,
                9261
            ],
            [
                9261,
                9346
            ],
            [
                9346,
                9697
            ],
            [
                9697,
                9841
            ],
            [
                9841,
                10238
            ],
            [
                10238,
                10417
            ],
            [
                10417,
                10758
            ],
            [
                10758,
                10825
            ],
            [
                10825,
                11420
            ],
            [
                11420,
                11473
            ],
            [
                11473,
                11894
            ],
            [
                11894,
                12242
            ],
            [
                12242,
                12557
            ],
            [
                12557,
                12802
            ],
            [
                12802,
                13228
            ],
            [
                13228,
                13862
            ],
            [
                13862,
                13916
            ],
            [
                13916,
                13946
            ],
            [
                13946,
                13965
            ],
            [
                13965,
                14075
            ],
            [
                14075,
                14209
            ],
            [
                14209,
                14321
            ],
            [
                14321,
                14345
            ],
            [
                14345,
                14467
            ],
            [
                14467,
                14651
            ],
            [
                14651,
                14786
            ],
            [
                14786,
                15420
            ],
            [
                15420,
                15473
            ],
            [
                15473,
                15522
            ],
            [
                15522,
                15563
            ],
            [
                15563,
                15621
            ],
            [
                15621,
                15798
            ],
            [
                15798,
                16154
            ],
            [
                16154,
                16210
            ],
            [
                16210,
                16439
            ],
            [
                16439,
                17030
            ],
            [
                17030,
                17193
            ],
            [
                17193,
                17301
            ],
            [
                17301,
                17472
            ],
            [
                17472,
                17794
            ],
            [
                17794,
                17951
            ],
            [
                17951,
                18118
            ],
            [
                18118,
                18364
            ],
            [
                18364,
                18597
            ],
            [
                18597,
                18665
            ],
            [
                18665,
                18705
            ],
            [
                18705,
                18931
            ],
            [
                18931,
                19130
            ],
            [
                19130,
                19345
            ],
            [
                19345,
                19543
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                78
            ],
            [
                78,
                176
            ],
            [
                176,
                210
            ],
            [
                210,
                301
            ],
            [
                301,
                341
            ],
            [
                341,
                392
            ],
            [
                392,
                403
            ],
            [
                403,
                469
            ],
            [
                469,
                613
            ],
            [
                613,
                688
            ],
            [
                688,
                793
            ],
            [
                793,
                819
            ],
            [
                819,
                904
            ],
            [
                904,
                969
            ],
            [
                969,
                1029
            ],
            [
                1029,
                1067
            ],
            [
                1067,
                1130
            ],
            [
                1130,
                1277
            ],
            [
                1277,
                1384
            ],
            [
                1384,
                1472
            ],
            [
                1472,
                1529
            ],
            [
                1529,
                1621
            ],
            [
                1621,
                1662
            ],
            [
                1662,
                1728
            ],
            [
                1728,
                1827
            ],
            [
                1827,
                1986
            ],
            [
                1986,
                2123
            ],
            [
                2123,
                2191
            ],
            [
                2191,
                2268
            ],
            [
                2268,
                2278
            ],
            [
                2278,
                2362
            ],
            [
                2362,
                2449
            ],
            [
                2449,
                2555
            ],
            [
                2555,
                2704
            ],
            [
                2704,
                2792
            ],
            [
                2792,
                2842
            ],
            [
                2842,
                2955
            ],
            [
                2955,
                2972
            ],
            [
                2972,
                2983
            ],
            [
                2983,
                3068
            ],
            [
                3068,
                3087
            ],
            [
                3087,
                3107
            ],
            [
                3107,
                3128
            ],
            [
                3128,
                3270
            ],
            [
                3270,
                3293
            ],
            [
                3293,
                3301
            ],
            [
                3301,
                3323
            ],
            [
                3323,
                3343
            ],
            [
                3343,
                3476
            ],
            [
                3476,
                3495
            ],
            [
                3495,
                3508
            ],
            [
                3508,
                3542
            ],
            [
                3542,
                3601
            ],
            [
                3601,
                3646
            ],
            [
                3646,
                3659
            ],
            [
                3659,
                3672
            ],
            [
                3672,
                3702
            ],
            [
                3702,
                3750
            ],
            [
                3750,
                3777
            ],
            [
                3777,
                3834
            ],
            [
                3834,
                3981
            ],
            [
                3981,
                4031
            ],
            [
                4031,
                4063
            ],
            [
                4063,
                4167
            ],
            [
                4167,
                4237
            ],
            [
                4237,
                4305
            ],
            [
                4305,
                4353
            ],
            [
                4353,
                4407
            ],
            [
                4407,
                4414
            ],
            [
                4414,
                4426
            ],
            [
                4426,
                4436
            ],
            [
                4436,
                4443
            ],
            [
                4443,
                4488
            ],
            [
                4488,
                4525
            ],
            [
                4525,
                4569
            ],
            [
                4569,
                4611
            ],
            [
                4611,
                4770
            ],
            [
                4770,
                4790
            ],
            [
                4790,
                4836
            ],
            [
                4836,
                4856
            ],
            [
                4856,
                4881
            ],
            [
                4881,
                4952
            ],
            [
                4952,
                5003
            ],
            [
                5003,
                5047
            ],
            [
                5047,
                5091
            ],
            [
                5091,
                5121
            ],
            [
                5121,
                5158
            ],
            [
                5158,
                5172
            ],
            [
                5172,
                5241
            ],
            [
                5241,
                5438
            ],
            [
                5438,
                5466
            ],
            [
                5466,
                5503
            ],
            [
                5503,
                5530
            ],
            [
                5530,
                5575
            ],
            [
                5575,
                5631
            ],
            [
                5631,
                5720
            ],
            [
                5720,
                5818
            ],
            [
                5818,
                5877
            ],
            [
                5877,
                5990
            ],
            [
                5990,
                6149
            ],
            [
                6149,
                6246
            ],
            [
                6246,
                6353
            ],
            [
                6353,
                6425
            ],
            [
                6425,
                6541
            ],
            [
                6541,
                6685
            ],
            [
                6685,
                6808
            ],
            [
                6808,
                6900
            ],
            [
                6900,
                6937
            ],
            [
                6937,
                6943
            ],
            [
                6943,
                7076
            ],
            [
                7076,
                7161
            ],
            [
                7161,
                7201
            ],
            [
                7201,
                7301
            ],
            [
                7301,
                7476
            ],
            [
                7476,
                7549
            ],
            [
                7549,
                7750
            ],
            [
                7750,
                7787
            ],
            [
                7787,
                7798
            ],
            [
                7798,
                7890
            ],
            [
                7890,
                7917
            ],
            [
                7917,
                7949
            ],
            [
                7949,
                8017
            ],
            [
                8017,
                8075
            ],
            [
                8075,
                8260
            ],
            [
                8260,
                8309
            ],
            [
                8309,
                8340
            ],
            [
                8340,
                8380
            ],
            [
                8380,
                8403
            ],
            [
                8403,
                8499
            ],
            [
                8499,
                8623
            ],
            [
                8623,
                8628
            ],
            [
                8628,
                8712
            ],
            [
                8712,
                8776
            ],
            [
                8776,
                8812
            ],
            [
                8812,
                8851
            ],
            [
                8851,
                8888
            ],
            [
                8888,
                8932
            ],
            [
                8932,
                8982
            ],
            [
                8982,
                9028
            ],
            [
                9028,
                9078
            ],
            [
                9078,
                9099
            ],
            [
                9099,
                9154
            ],
            [
                9154,
                9217
            ],
            [
                9217,
                9261
            ],
            [
                9261,
                9346
            ],
            [
                9346,
                9380
            ],
            [
                9380,
                9550
            ],
            [
                9550,
                9601
            ],
            [
                9601,
                9697
            ],
            [
                9697,
                9742
            ],
            [
                9742,
                9754
            ],
            [
                9754,
                9841
            ],
            [
                9841,
                9880
            ],
            [
                9880,
                9890
            ],
            [
                9890,
                9957
            ],
            [
                9957,
                10003
            ],
            [
                10003,
                10066
            ],
            [
                10066,
                10238
            ],
            [
                10238,
                10278
            ],
            [
                10278,
                10296
            ],
            [
                10296,
                10353
            ],
            [
                10353,
                10417
            ],
            [
                10417,
                10430
            ],
            [
                10430,
                10527
            ],
            [
                10527,
                10561
            ],
            [
                10561,
                10691
            ],
            [
                10691,
                10716
            ],
            [
                10716,
                10758
            ],
            [
                10758,
                10813
            ],
            [
                10813,
                10825
            ],
            [
                10825,
                10956
            ],
            [
                10956,
                11139
            ],
            [
                11139,
                11236
            ],
            [
                11236,
                11315
            ],
            [
                11315,
                11420
            ],
            [
                11420,
                11473
            ],
            [
                11473,
                11566
            ],
            [
                11566,
                11631
            ],
            [
                11631,
                11675
            ],
            [
                11675,
                11730
            ],
            [
                11730,
                11777
            ],
            [
                11777,
                11811
            ],
            [
                11811,
                11867
            ],
            [
                11867,
                11879
            ],
            [
                11879,
                11894
            ],
            [
                11894,
                11985
            ],
            [
                11985,
                12242
            ],
            [
                12242,
                12365
            ],
            [
                12365,
                12476
            ],
            [
                12476,
                12557
            ],
            [
                12557,
                12678
            ],
            [
                12678,
                12802
            ],
            [
                12802,
                12871
            ],
            [
                12871,
                12975
            ],
            [
                12975,
                13055
            ],
            [
                13055,
                13142
            ],
            [
                13142,
                13228
            ],
            [
                13228,
                13310
            ],
            [
                13310,
                13340
            ],
            [
                13340,
                13414
            ],
            [
                13414,
                13747
            ],
            [
                13747,
                13862
            ],
            [
                13862,
                13888
            ],
            [
                13888,
                13916
            ],
            [
                13916,
                13946
            ],
            [
                13946,
                13958
            ],
            [
                13958,
                13965
            ],
            [
                13965,
                14075
            ],
            [
                14075,
                14114
            ],
            [
                14114,
                14140
            ],
            [
                14140,
                14209
            ],
            [
                14209,
                14299
            ],
            [
                14299,
                14321
            ],
            [
                14321,
                14329
            ],
            [
                14329,
                14345
            ],
            [
                14345,
                14388
            ],
            [
                14388,
                14467
            ],
            [
                14467,
                14507
            ],
            [
                14507,
                14530
            ],
            [
                14530,
                14565
            ],
            [
                14565,
                14607
            ],
            [
                14607,
                14651
            ],
            [
                14651,
                14697
            ],
            [
                14697,
                14786
            ],
            [
                14786,
                14827
            ],
            [
                14827,
                14847
            ],
            [
                14847,
                14895
            ],
            [
                14895,
                14988
            ],
            [
                14988,
                15094
            ],
            [
                15094,
                15160
            ],
            [
                15160,
                15252
            ],
            [
                15252,
                15328
            ],
            [
                15328,
                15420
            ],
            [
                15420,
                15443
            ],
            [
                15443,
                15473
            ],
            [
                15473,
                15478
            ],
            [
                15478,
                15522
            ],
            [
                15522,
                15563
            ],
            [
                15563,
                15571
            ],
            [
                15571,
                15588
            ],
            [
                15588,
                15621
            ],
            [
                15621,
                15642
            ],
            [
                15642,
                15689
            ],
            [
                15689,
                15716
            ],
            [
                15716,
                15798
            ],
            [
                15798,
                15845
            ],
            [
                15845,
                15888
            ],
            [
                15888,
                15909
            ],
            [
                15909,
                15975
            ],
            [
                15975,
                16031
            ],
            [
                16031,
                16154
            ],
            [
                16154,
                16197
            ],
            [
                16197,
                16210
            ],
            [
                16210,
                16285
            ],
            [
                16285,
                16355
            ],
            [
                16355,
                16439
            ],
            [
                16439,
                16450
            ],
            [
                16450,
                16471
            ],
            [
                16471,
                16545
            ],
            [
                16545,
                16634
            ],
            [
                16634,
                16674
            ],
            [
                16674,
                16735
            ],
            [
                16735,
                16780
            ],
            [
                16780,
                16848
            ],
            [
                16848,
                17030
            ],
            [
                17030,
                17043
            ],
            [
                17043,
                17142
            ],
            [
                17142,
                17193
            ],
            [
                17193,
                17301
            ],
            [
                17301,
                17316
            ],
            [
                17316,
                17335
            ],
            [
                17335,
                17352
            ],
            [
                17352,
                17388
            ],
            [
                17388,
                17472
            ],
            [
                17472,
                17555
            ],
            [
                17555,
                17724
            ],
            [
                17724,
                17794
            ],
            [
                17794,
                17815
            ],
            [
                17815,
                17856
            ],
            [
                17856,
                17907
            ],
            [
                17907,
                17951
            ],
            [
                17951,
                18069
            ],
            [
                18069,
                18118
            ],
            [
                18118,
                18160
            ],
            [
                18160,
                18243
            ],
            [
                18243,
                18289
            ],
            [
                18289,
                18364
            ],
            [
                18364,
                18413
            ],
            [
                18413,
                18597
            ],
            [
                18597,
                18611
            ],
            [
                18611,
                18631
            ],
            [
                18631,
                18665
            ],
            [
                18665,
                18705
            ],
            [
                18705,
                18752
            ],
            [
                18752,
                18805
            ],
            [
                18805,
                18931
            ],
            [
                18931,
                19046
            ],
            [
                19046,
                19130
            ],
            [
                19130,
                19167
            ],
            [
                19167,
                19254
            ],
            [
                19254,
                19345
            ],
            [
                19345,
                19543
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                63
            ],
            [
                64,
                78
            ],
            [
                78,
                152
            ],
            [
                158,
                176
            ],
            [
                176,
                188
            ],
            [
                194,
                196
            ],
            [
                197,
                202
            ],
            [
                208,
                210
            ],
            [
                216,
                229
            ],
            [
                246,
                252
            ],
            [
                258,
                301
            ],
            [
                301,
                315
            ],
            [
                316,
                341
            ],
            [
                341,
                390
            ],
            [
                390,
                392
            ],
            [
                392,
                403
            ],
            [
                403,
                408
            ],
            [
                425,
                432
            ],
            [
                432,
                433
            ],
            [
                437,
                469
            ],
            [
                473,
                603
            ],
            [
                604,
                612
            ],
            [
                619,
                635
            ],
            [
                637,
                638
            ],
            [
                644,
                653
            ],
            [
                668,
                686
            ],
            [
                686,
                687
            ],
            [
                688,
                689
            ],
            [
                701,
                792
            ],
            [
                799,
                808
            ],
            [
                817,
                819
            ],
            [
                825,
                857
            ],
            [
                858,
                902
            ],
            [
                902,
                904
            ],
            [
                904,
                910
            ],
            [
                917,
                945
            ],
            [
                958,
                969
            ],
            [
                969,
                978
            ],
            [
                979,
                1001
            ],
            [
                1027,
                1029
            ],
            [
                1029,
                1036
            ],
            [
                1041,
                1048
            ],
            [
                1049,
                1055
            ],
            [
                1056,
                1064
            ],
            [
                1068,
                1084
            ],
            [
                1085,
                1088
            ],
            [
                1094,
                1124
            ],
            [
                1128,
                1130
            ],
            [
                1130,
                1131
            ],
            [
                1135,
                1167
            ],
            [
                1176,
                1178
            ],
            [
                1186,
                1199
            ],
            [
                1204,
                1220
            ],
            [
                1220,
                1225
            ],
            [
                1226,
                1238
            ],
            [
                1238,
                1260
            ],
            [
                1261,
                1274
            ],
            [
                1277,
                1278
            ],
            [
                1284,
                1298
            ],
            [
                1299,
                1320
            ],
            [
                1339,
                1342
            ],
            [
                1343,
                1354
            ],
            [
                1360,
                1373
            ],
            [
                1382,
                1384
            ],
            [
                1384,
                1460
            ],
            [
                1461,
                1472
            ],
            [
                1472,
                1529
            ],
            [
                1529,
                1621
            ],
            [
                1625,
                1660
            ],
            [
                1662,
                1713
            ],
            [
                1723,
                1726
            ],
            [
                1726,
                1728
            ],
            [
                1728,
                1754
            ],
            [
                1755,
                1758
            ],
            [
                1759,
                1766
            ],
            [
                1766,
                1776
            ],
            [
                1777,
                1782
            ],
            [
                1782,
                1783
            ],
            [
                1784,
                1787
            ],
            [
                1788,
                1825
            ],
            [
                1825,
                1827
            ],
            [
                1840,
                1892
            ],
            [
                1893,
                1985
            ],
            [
                1986,
                2016
            ],
            [
                2017,
                2050
            ],
            [
                2051,
                2070
            ],
            [
                2089,
                2104
            ],
            [
                2114,
                2121
            ],
            [
                2121,
                2123
            ],
            [
                2123,
                2191
            ],
            [
                2191,
                2200
            ],
            [
                2201,
                2268
            ],
            [
                2268,
                2278
            ],
            [
                2294,
                2296
            ],
            [
                2302,
                2306
            ],
            [
                2307,
                2316
            ],
            [
                2327,
                2330
            ],
            [
                2337,
                2361
            ],
            [
                2366,
                2430
            ],
            [
                2431,
                2447
            ],
            [
                2447,
                2449
            ],
            [
                2449,
                2451
            ],
            [
                2456,
                2522
            ],
            [
                2523,
                2553
            ],
            [
                2553,
                2555
            ],
            [
                2555,
                2570
            ],
            [
                2571,
                2613
            ],
            [
                2622,
                2624
            ],
            [
                2625,
                2644
            ],
            [
                2644,
                2680
            ],
            [
                2680,
                2681
            ],
            [
                2683,
                2701
            ],
            [
                2704,
                2749
            ],
            [
                2750,
                2762
            ],
            [
                2767,
                2773
            ],
            [
                2782,
                2792
            ],
            [
                2792,
                2800
            ],
            [
                2808,
                2817
            ],
            [
                2817,
                2818
            ],
            [
                2819,
                2822
            ],
            [
                2823,
                2840
            ],
            [
                2840,
                2842
            ],
            [
                2842,
                2877
            ],
            [
                2878,
                2954
            ],
            [
                2956,
                2969
            ],
            [
                2972,
                2982
            ],
            [
                2984,
                3010
            ],
            [
                3013,
                3023
            ],
            [
                3023,
                3024
            ],
            [
                3026,
                3033
            ],
            [
                3040,
                3068
            ],
            [
                3068,
                3087
            ],
            [
                3087,
                3107
            ],
            [
                3107,
                3125
            ],
            [
                3128,
                3270
            ],
            [
                3270,
                3293
            ],
            [
                3294,
                3298
            ],
            [
                3301,
                3308
            ],
            [
                3309,
                3323
            ],
            [
                3324,
                3340
            ],
            [
                3344,
                3347
            ],
            [
                3349,
                3359
            ],
            [
                3362,
                3382
            ],
            [
                3383,
                3467
            ],
            [
                3468,
                3476
            ],
            [
                3477,
                3495
            ],
            [
                3495,
                3508
            ],
            [
                3508,
                3540
            ],
            [
                3540,
                3542
            ],
            [
                3542,
                3544
            ],
            [
                3545,
                3598
            ],
            [
                3606,
                3614
            ],
            [
                3615,
                3643
            ],
            [
                3646,
                3658
            ],
            [
                3660,
                3672
            ],
            [
                3672,
                3699
            ],
            [
                3703,
                3726
            ],
            [
                3729,
                3731
            ],
            [
                3737,
                3750
            ],
            [
                3751,
                3774
            ],
            [
                3777,
                3787
            ],
            [
                3788,
                3791
            ],
            [
                3798,
                3817
            ],
            [
                3821,
                3832
            ],
            [
                3832,
                3834
            ],
            [
                3834,
                3863
            ],
            [
                3864,
                3869
            ],
            [
                3870,
                3879
            ],
            [
                3880,
                3899
            ],
            [
                3900,
                3903
            ],
            [
                3904,
                3979
            ],
            [
                3981,
                4029
            ],
            [
                4029,
                4031
            ],
            [
                4035,
                4063
            ],
            [
                4063,
                4071
            ],
            [
                4072,
                4098
            ],
            [
                4113,
                4114
            ],
            [
                4116,
                4157
            ],
            [
                4157,
                4158
            ],
            [
                4159,
                4164
            ],
            [
                4168,
                4199
            ],
            [
                4202,
                4211
            ],
            [
                4213,
                4225
            ],
            [
                4226,
                4234
            ],
            [
                4237,
                4240
            ],
            [
                4246,
                4305
            ],
            [
                4311,
                4339
            ],
            [
                4342,
                4353
            ],
            [
                4359,
                4369
            ],
            [
                4370,
                4404
            ],
            [
                4408,
                4414
            ],
            [
                4414,
                4423
            ],
            [
                4426,
                4435
            ],
            [
                4437,
                4443
            ],
            [
                4443,
                4464
            ],
            [
                4469,
                4477
            ],
            [
                4480,
                4488
            ],
            [
                4492,
                4525
            ],
            [
                4525,
                4569
            ],
            [
                4569,
                4592
            ],
            [
                4596,
                4597
            ],
            [
                4602,
                4608
            ],
            [
                4611,
                4729
            ],
            [
                4738,
                4755
            ],
            [
                4768,
                4770
            ],
            [
                4771,
                4787
            ],
            [
                4790,
                4836
            ],
            [
                4837,
                4856
            ],
            [
                4856,
                4878
            ],
            [
                4882,
                4892
            ],
            [
                4895,
                4922
            ],
            [
                4924,
                4952
            ],
            [
                4952,
                5000
            ],
            [
                5004,
                5030
            ],
            [
                5033,
                5045
            ],
            [
                5045,
                5047
            ],
            [
                5048,
                5091
            ],
            [
                5091,
                5118
            ],
            [
                5122,
                5126
            ],
            [
                5129,
                5137
            ],
            [
                5139,
                5155
            ],
            [
                5159,
                5169
            ],
            [
                5172,
                5239
            ],
            [
                5239,
                5240
            ],
            [
                5242,
                5246
            ],
            [
                5255,
                5256
            ],
            [
                5263,
                5264
            ],
            [
                5290,
                5291
            ],
            [
                5293,
                5438
            ],
            [
                5438,
                5466
            ],
            [
                5466,
                5487
            ],
            [
                5492,
                5503
            ],
            [
                5503,
                5516
            ],
            [
                5520,
                5530
            ],
            [
                5530,
                5572
            ],
            [
                5575,
                5617
            ],
            [
                5626,
                5631
            ],
            [
                5632,
                5647
            ],
            [
                5650,
                5657
            ],
            [
                5661,
                5664
            ],
            [
                5666,
                5720
            ],
            [
                5720,
                5815
            ],
            [
                5818,
                5875
            ],
            [
                5875,
                5877
            ],
            [
                5877,
                5888
            ],
            [
                5892,
                5976
            ],
            [
                5988,
                5990
            ],
            [
                5990,
                5993
            ],
            [
                5994,
                6030
            ],
            [
                6030,
                6031
            ],
            [
                6032,
                6050
            ],
            [
                6050,
                6148
            ],
            [
                6149,
                6175
            ],
            [
                6176,
                6201
            ],
            [
                6202,
                6246
            ],
            [
                6246,
                6353
            ],
            [
                6353,
                6425
            ],
            [
                6425,
                6428
            ],
            [
                6434,
                6440
            ],
            [
                6441,
                6446
            ],
            [
                6447,
                6450
            ],
            [
                6465,
                6483
            ],
            [
                6484,
                6487
            ],
            [
                6488,
                6500
            ],
            [
                6506,
                6508
            ],
            [
                6514,
                6516
            ],
            [
                6521,
                6541
            ],
            [
                6541,
                6584
            ],
            [
                6585,
                6648
            ],
            [
                6649,
                6665
            ],
            [
                6674,
                6683
            ],
            [
                6683,
                6684
            ],
            [
                6685,
                6714
            ],
            [
                6715,
                6808
            ],
            [
                6808,
                6900
            ],
            [
                6905,
                6914
            ],
            [
                6917,
                6937
            ],
            [
                6939,
                6942
            ],
            [
                6943,
                6971
            ],
            [
                6979,
                6981
            ],
            [
                6993,
                6996
            ],
            [
                6997,
                7001
            ],
            [
                7006,
                7073
            ],
            [
                7077,
                7083
            ],
            [
                7086,
                7106
            ],
            [
                7108,
                7161
            ],
            [
                7161,
                7198
            ],
            [
                7201,
                7248
            ],
            [
                7254,
                7299
            ],
            [
                7299,
                7301
            ],
            [
                7301,
                7321
            ],
            [
                7327,
                7465
            ],
            [
                7474,
                7476
            ],
            [
                7476,
                7548
            ],
            [
                7549,
                7584
            ],
            [
                7585,
                7653
            ],
            [
                7655,
                7750
            ],
            [
                7751,
                7775
            ],
            [
                7787,
                7798
            ],
            [
                7799,
                7890
            ],
            [
                7890,
                7917
            ],
            [
                7917,
                7949
            ],
            [
                7949,
                8014
            ],
            [
                8018,
                8059
            ],
            [
                8062,
                8075
            ],
            [
                8076,
                8107
            ],
            [
                8107,
                8112
            ],
            [
                8113,
                8114
            ],
            [
                8123,
                8155
            ],
            [
                8155,
                8156
            ],
            [
                8157,
                8160
            ],
            [
                8161,
                8171
            ],
            [
                8175,
                8260
            ],
            [
                8260,
                8307
            ],
            [
                8309,
                8340
            ],
            [
                8340,
                8380
            ],
            [
                8380,
                8403
            ],
            [
                8403,
                8471
            ],
            [
                8472,
                8496
            ],
            [
                8500,
                8510
            ],
            [
                8511,
                8517
            ],
            [
                8518,
                8535
            ],
            [
                8538,
                8569
            ],
            [
                8575,
                8599
            ],
            [
                8600,
                8623
            ],
            [
                8626,
                8627
            ],
            [
                8628,
                8709
            ],
            [
                8712,
                8730
            ],
            [
                8730,
                8737
            ],
            [
                8743,
                8746
            ],
            [
                8757,
                8776
            ],
            [
                8776,
                8791
            ],
            [
                8799,
                8812
            ],
            [
                8812,
                8821
            ],
            [
                8822,
                8851
            ],
            [
                8851,
                8856
            ],
            [
                8857,
                8888
            ],
            [
                8888,
                8907
            ],
            [
                8908,
                8912
            ],
            [
                8923,
                8930
            ],
            [
                8930,
                8932
            ],
            [
                8932,
                8939
            ],
            [
                8943,
                8950
            ],
            [
                8955,
                8982
            ],
            [
                8983,
                9007
            ],
            [
                9010,
                9022
            ],
            [
                9024,
                9027
            ],
            [
                9028,
                9075
            ],
            [
                9086,
                9093
            ],
            [
                9094,
                9097
            ],
            [
                9097,
                9099
            ],
            [
                9099,
                9154
            ],
            [
                9158,
                9160
            ],
            [
                9161,
                9217
            ],
            [
                9217,
                9218
            ],
            [
                9224,
                9247
            ],
            [
                9255,
                9261
            ],
            [
                9261,
                9305
            ],
            [
                9306,
                9344
            ],
            [
                9344,
                9346
            ],
            [
                9347,
                9367
            ],
            [
                9370,
                9378
            ],
            [
                9378,
                9380
            ],
            [
                9381,
                9455
            ],
            [
                9459,
                9467
            ],
            [
                9468,
                9471
            ],
            [
                9477,
                9532
            ],
            [
                9533,
                9550
            ],
            [
                9550,
                9593
            ],
            [
                9599,
                9601
            ],
            [
                9601,
                9602
            ],
            [
                9608,
                9623
            ],
            [
                9634,
                9636
            ],
            [
                9637,
                9655
            ],
            [
                9656,
                9694
            ],
            [
                9698,
                9739
            ],
            [
                9742,
                9754
            ],
            [
                9755,
                9767
            ],
            [
                9781,
                9818
            ],
            [
                9819,
                9838
            ],
            [
                9842,
                9877
            ],
            [
                9885,
                9890
            ],
            [
                9891,
                9894
            ],
            [
                9895,
                9900
            ],
            [
                9901,
                9908
            ],
            [
                9909,
                9922
            ],
            [
                9928,
                9932
            ],
            [
                9936,
                9955
            ],
            [
                9955,
                9957
            ],
            [
                9960,
                9969
            ],
            [
                9969,
                9970
            ],
            [
                9971,
                9978
            ],
            [
                9979,
                9982
            ],
            [
                9983,
                10001
            ],
            [
                10001,
                10003
            ],
            [
                10003,
                10035
            ],
            [
                10043,
                10066
            ],
            [
                10066,
                10155
            ],
            [
                10160,
                10235
            ],
            [
                10239,
                10267
            ],
            [
                10270,
                10278
            ],
            [
                10284,
                10294
            ],
            [
                10294,
                10296
            ],
            [
                10309,
                10323
            ],
            [
                10324,
                10326
            ],
            [
                10335,
                10353
            ],
            [
                10356,
                10359
            ],
            [
                10360,
                10369
            ],
            [
                10370,
                10378
            ],
            [
                10391,
                10410
            ],
            [
                10417,
                10420
            ],
            [
                10428,
                10430
            ],
            [
                10431,
                10515
            ],
            [
                10516,
                10525
            ],
            [
                10527,
                10559
            ],
            [
                10559,
                10561
            ],
            [
                10561,
                10656
            ],
            [
                10657,
                10681
            ],
            [
                10689,
                10691
            ],
            [
                10691,
                10702
            ],
            [
                10708,
                10714
            ],
            [
                10716,
                10727
            ],
            [
                10727,
                10735
            ],
            [
                10736,
                10755
            ],
            [
                10759,
                10810
            ],
            [
                10813,
                10824
            ],
            [
                10826,
                10843
            ],
            [
                10844,
                10849
            ],
            [
                10850,
                10871
            ],
            [
                10878,
                10880
            ],
            [
                10880,
                10885
            ],
            [
                10886,
                10893
            ],
            [
                10900,
                10903
            ],
            [
                10904,
                10931
            ],
            [
                10932,
                10956
            ],
            [
                10956,
                11098
            ],
            [
                11109,
                11111
            ],
            [
                11112,
                11137
            ],
            [
                11137,
                11139
            ],
            [
                11139,
                11149
            ],
            [
                11150,
                11158
            ],
            [
                11160,
                11170
            ],
            [
                11171,
                11178
            ],
            [
                11192,
                11194
            ],
            [
                11202,
                11210
            ],
            [
                11211,
                11226
            ],
            [
                11227,
                11236
            ],
            [
                11236,
                11250
            ],
            [
                11256,
                11258
            ],
            [
                11263,
                11313
            ],
            [
                11313,
                11315
            ],
            [
                11315,
                11326
            ],
            [
                11336,
                11387
            ],
            [
                11394,
                11398
            ],
            [
                11404,
                11417
            ],
            [
                11421,
                11470
            ],
            [
                11474,
                11482
            ],
            [
                11483,
                11485
            ],
            [
                11496,
                11508
            ],
            [
                11510,
                11535
            ],
            [
                11536,
                11559
            ],
            [
                11560,
                11566
            ],
            [
                11566,
                11631
            ],
            [
                11631,
                11647
            ],
            [
                11648,
                11675
            ],
            [
                11675,
                11677
            ],
            [
                11684,
                11703
            ],
            [
                11714,
                11716
            ],
            [
                11720,
                11725
            ],
            [
                11728,
                11730
            ],
            [
                11730,
                11759
            ],
            [
                11765,
                11767
            ],
            [
                11768,
                11775
            ],
            [
                11775,
                11777
            ],
            [
                11777,
                11785
            ],
            [
                11790,
                11795
            ],
            [
                11801,
                11809
            ],
            [
                11809,
                11811
            ],
            [
                11811,
                11867
            ],
            [
                11867,
                11879
            ],
            [
                11879,
                11891
            ],
            [
                11894,
                11946
            ],
            [
                11947,
                11950
            ],
            [
                11951,
                11958
            ],
            [
                11959,
                11970
            ],
            [
                11971,
                11974
            ],
            [
                11985,
                11995
            ],
            [
                11996,
                12004
            ],
            [
                12012,
                12035
            ],
            [
                12039,
                12059
            ],
            [
                12059,
                12068
            ],
            [
                12073,
                12076
            ],
            [
                12082,
                12120
            ],
            [
                12120,
                12125
            ],
            [
                12126,
                12135
            ],
            [
                12136,
                12194
            ],
            [
                12195,
                12240
            ],
            [
                12240,
                12242
            ],
            [
                12242,
                12254
            ],
            [
                12257,
                12323
            ],
            [
                12324,
                12363
            ],
            [
                12363,
                12365
            ],
            [
                12365,
                12374
            ],
            [
                12392,
                12395
            ],
            [
                12396,
                12429
            ],
            [
                12430,
                12454
            ],
            [
                12455,
                12466
            ],
            [
                12467,
                12474
            ],
            [
                12474,
                12476
            ],
            [
                12476,
                12498
            ],
            [
                12503,
                12507
            ],
            [
                12509,
                12514
            ],
            [
                12544,
                12549
            ],
            [
                12555,
                12557
            ],
            [
                12557,
                12594
            ],
            [
                12595,
                12610
            ],
            [
                12621,
                12665
            ],
            [
                12676,
                12678
            ],
            [
                12678,
                12762
            ],
            [
                12768,
                12776
            ],
            [
                12776,
                12800
            ],
            [
                12800,
                12801
            ],
            [
                12802,
                12854
            ],
            [
                12859,
                12871
            ],
            [
                12871,
                12936
            ],
            [
                12937,
                12939
            ],
            [
                12951,
                12963
            ],
            [
                12983,
                12995
            ],
            [
                13006,
                13008
            ],
            [
                13009,
                13043
            ],
            [
                13044,
                13055
            ],
            [
                13055,
                13058
            ],
            [
                13059,
                13068
            ],
            [
                13069,
                13092
            ],
            [
                13093,
                13109
            ],
            [
                13117,
                13142
            ],
            [
                13142,
                13182
            ],
            [
                13189,
                13193
            ],
            [
                13194,
                13204
            ],
            [
                13219,
                13222
            ],
            [
                13223,
                13226
            ],
            [
                13226,
                13228
            ],
            [
                13228,
                13238
            ],
            [
                13259,
                13310
            ],
            [
                13310,
                13338
            ],
            [
                13338,
                13340
            ],
            [
                13340,
                13354
            ],
            [
                13355,
                13389
            ],
            [
                13390,
                13414
            ],
            [
                13414,
                13527
            ],
            [
                13533,
                13537
            ],
            [
                13538,
                13564
            ],
            [
                13565,
                13568
            ],
            [
                13569,
                13573
            ],
            [
                13574,
                13615
            ],
            [
                13615,
                13620
            ],
            [
                13621,
                13630
            ],
            [
                13631,
                13670
            ],
            [
                13671,
                13711
            ],
            [
                13712,
                13747
            ],
            [
                13766,
                13798
            ],
            [
                13804,
                13862
            ],
            [
                13873,
                13874
            ],
            [
                13880,
                13885
            ],
            [
                13888,
                13914
            ],
            [
                13914,
                13915
            ],
            [
                13917,
                13926
            ],
            [
                13929,
                13944
            ],
            [
                13947,
                13956
            ],
            [
                13966,
                14042
            ],
            [
                14050,
                14072
            ],
            [
                14076,
                14111
            ],
            [
                14114,
                14140
            ],
            [
                14141,
                14181
            ],
            [
                14182,
                14185
            ],
            [
                14186,
                14190
            ],
            [
                14203,
                14206
            ],
            [
                14210,
                14216
            ],
            [
                14219,
                14239
            ],
            [
                14241,
                14297
            ],
            [
                14299,
                14318
            ],
            [
                14322,
                14326
            ],
            [
                14329,
                14343
            ],
            [
                14343,
                14345
            ],
            [
                14346,
                14386
            ],
            [
                14388,
                14427
            ],
            [
                14433,
                14464
            ],
            [
                14468,
                14504
            ],
            [
                14507,
                14528
            ],
            [
                14528,
                14530
            ],
            [
                14531,
                14565
            ],
            [
                14565,
                14568
            ],
            [
                14576,
                14584
            ],
            [
                14585,
                14595
            ],
            [
                14596,
                14605
            ],
            [
                14605,
                14607
            ],
            [
                14607,
                14648
            ],
            [
                14652,
                14668
            ],
            [
                14671,
                14697
            ],
            [
                14698,
                14783
            ],
            [
                14787,
                14824
            ],
            [
                14827,
                14845
            ],
            [
                14845,
                14847
            ],
            [
                14848,
                14895
            ],
            [
                14895,
                14923
            ],
            [
                14926,
                14934
            ],
            [
                14935,
                14953
            ],
            [
                14953,
                14954
            ],
            [
                14957,
                14980
            ],
            [
                14981,
                14988
            ],
            [
                14988,
                15022
            ],
            [
                15031,
                15069
            ],
            [
                15075,
                15085
            ],
            [
                15089,
                15094
            ],
            [
                15094,
                15124
            ],
            [
                15134,
                15160
            ],
            [
                15160,
                15212
            ],
            [
                15212,
                15252
            ],
            [
                15252,
                15314
            ],
            [
                15315,
                15326
            ],
            [
                15326,
                15328
            ],
            [
                15328,
                15378
            ],
            [
                15378,
                15390
            ],
            [
                15404,
                15417
            ],
            [
                15426,
                15436
            ],
            [
                15437,
                15440
            ],
            [
                15443,
                15447
            ],
            [
                15448,
                15459
            ],
            [
                15471,
                15473
            ],
            [
                15474,
                15477
            ],
            [
                15478,
                15519
            ],
            [
                15523,
                15541
            ],
            [
                15544,
                15561
            ],
            [
                15564,
                15568
            ],
            [
                15571,
                15588
            ],
            [
                15593,
                15605
            ],
            [
                15605,
                15618
            ],
            [
                15645,
                15648
            ],
            [
                15657,
                15689
            ],
            [
                15690,
                15697
            ],
            [
                15702,
                15716
            ],
            [
                15716,
                15753
            ],
            [
                15754,
                15760
            ],
            [
                15761,
                15765
            ],
            [
                15765,
                15795
            ],
            [
                15799,
                15834
            ],
            [
                15837,
                15845
            ],
            [
                15846,
                15888
            ],
            [
                15888,
                15909
            ],
            [
                15909,
                15948
            ],
            [
                15954,
                15967
            ],
            [
                15973,
                15975
            ],
            [
                15975,
                16031
            ],
            [
                16031,
                16061
            ],
            [
                16061,
                16074
            ],
            [
                16075,
                16091
            ],
            [
                16099,
                16108
            ],
            [
                16108,
                16109
            ],
            [
                16118,
                16121
            ],
            [
                16127,
                16131
            ],
            [
                16132,
                16142
            ],
            [
                16142,
                16144
            ],
            [
                16145,
                16151
            ],
            [
                16151,
                16153
            ],
            [
                16155,
                16187
            ],
            [
                16187,
                16194
            ],
            [
                16197,
                16209
            ],
            [
                16210,
                16218
            ],
            [
                16219,
                16222
            ],
            [
                16222,
                16223
            ],
            [
                16224,
                16237
            ],
            [
                16241,
                16242
            ],
            [
                16243,
                16261
            ],
            [
                16262,
                16268
            ],
            [
                16272,
                16283
            ],
            [
                16283,
                16285
            ],
            [
                16285,
                16353
            ],
            [
                16353,
                16355
            ],
            [
                16355,
                16357
            ],
            [
                16358,
                16368
            ],
            [
                16376,
                16386
            ],
            [
                16386,
                16387
            ],
            [
                16388,
                16420
            ],
            [
                16437,
                16438
            ],
            [
                16440,
                16447
            ],
            [
                16464,
                16469
            ],
            [
                16469,
                16471
            ],
            [
                16472,
                16474
            ],
            [
                16475,
                16479
            ],
            [
                16488,
                16511
            ],
            [
                16512,
                16514
            ],
            [
                16514,
                16536
            ],
            [
                16543,
                16545
            ],
            [
                16545,
                16634
            ],
            [
                16634,
                16674
            ],
            [
                16674,
                16724
            ],
            [
                16733,
                16735
            ],
            [
                16735,
                16750
            ],
            [
                16751,
                16780
            ],
            [
                16780,
                16804
            ],
            [
                16806,
                16816
            ],
            [
                16819,
                16833
            ],
            [
                16846,
                16848
            ],
            [
                16849,
                16911
            ],
            [
                16912,
                16936
            ],
            [
                16942,
                16963
            ],
            [
                16964,
                16975
            ],
            [
                16985,
                17027
            ],
            [
                17031,
                17040
            ],
            [
                17043,
                17057
            ],
            [
                17063,
                17071
            ],
            [
                17073,
                17089
            ],
            [
                17095,
                17142
            ],
            [
                17142,
                17157
            ],
            [
                17158,
                17190
            ],
            [
                17193,
                17227
            ],
            [
                17228,
                17257
            ],
            [
                17257,
                17262
            ],
            [
                17263,
                17272
            ],
            [
                17273,
                17275
            ],
            [
                17293,
                17296
            ],
            [
                17299,
                17301
            ],
            [
                17302,
                17313
            ],
            [
                17316,
                17333
            ],
            [
                17333,
                17335
            ],
            [
                17336,
                17339
            ],
            [
                17340,
                17345
            ],
            [
                17346,
                17350
            ],
            [
                17350,
                17352
            ],
            [
                17352,
                17367
            ],
            [
                17372,
                17378
            ],
            [
                17386,
                17388
            ],
            [
                17388,
                17457
            ],
            [
                17462,
                17469
            ],
            [
                17472,
                17474
            ],
            [
                17483,
                17497
            ],
            [
                17506,
                17553
            ],
            [
                17553,
                17555
            ],
            [
                17555,
                17608
            ],
            [
                17614,
                17617
            ],
            [
                17617,
                17703
            ],
            [
                17704,
                17713
            ],
            [
                17713,
                17715
            ],
            [
                17716,
                17722
            ],
            [
                17729,
                17753
            ],
            [
                17758,
                17772
            ],
            [
                17773,
                17776
            ],
            [
                17777,
                17780
            ],
            [
                17781,
                17786
            ],
            [
                17787,
                17792
            ],
            [
                17792,
                17794
            ],
            [
                17800,
                17812
            ],
            [
                17815,
                17854
            ],
            [
                17854,
                17856
            ],
            [
                17857,
                17907
            ],
            [
                17907,
                17948
            ],
            [
                17952,
                18008
            ],
            [
                18011,
                18022
            ],
            [
                18023,
                18069
            ],
            [
                18074,
                18115
            ],
            [
                18119,
                18137
            ],
            [
                18140,
                18148
            ],
            [
                18158,
                18160
            ],
            [
                18165,
                18173
            ],
            [
                18174,
                18190
            ],
            [
                18190,
                18195
            ],
            [
                18206,
                18217
            ],
            [
                18228,
                18241
            ],
            [
                18241,
                18243
            ],
            [
                18243,
                18289
            ],
            [
                18289,
                18340
            ],
            [
                18341,
                18361
            ],
            [
                18365,
                18401
            ],
            [
                18404,
                18411
            ],
            [
                18411,
                18413
            ],
            [
                18414,
                18449
            ],
            [
                18450,
                18480
            ],
            [
                18485,
                18496
            ],
            [
                18500,
                18559
            ],
            [
                18559,
                18594
            ],
            [
                18604,
                18608
            ],
            [
                18611,
                18631
            ],
            [
                18637,
                18662
            ],
            [
                18669,
                18702
            ],
            [
                18706,
                18735
            ],
            [
                18742,
                18750
            ],
            [
                18750,
                18752
            ],
            [
                18753,
                18796
            ],
            [
                18803,
                18805
            ],
            [
                18810,
                18819
            ],
            [
                18824,
                18835
            ],
            [
                18835,
                18896
            ],
            [
                18897,
                18901
            ],
            [
                18902,
                18928
            ],
            [
                18931,
                18935
            ],
            [
                18954,
                18957
            ],
            [
                18964,
                18965
            ],
            [
                18980,
                19046
            ],
            [
                19046,
                19061
            ],
            [
                19072,
                19082
            ],
            [
                19083,
                19103
            ],
            [
                19108,
                19123
            ],
            [
                19128,
                19130
            ],
            [
                19130,
                19167
            ],
            [
                19167,
                19168
            ],
            [
                19174,
                19177
            ],
            [
                19178,
                19180
            ],
            [
                19181,
                19187
            ],
            [
                19187,
                19204
            ],
            [
                19205,
                19219
            ],
            [
                19220,
                19221
            ],
            [
                19243,
                19252
            ],
            [
                19252,
                19254
            ],
            [
                19267,
                19344
            ],
            [
                19376,
                19433
            ],
            [
                19434,
                19543
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                78
            ],
            [
                78,
                176
            ],
            [
                176,
                210
            ],
            [
                210,
                301
            ],
            [
                301,
                341
            ],
            [
                341,
                392
            ],
            [
                392,
                403
            ],
            [
                403,
                469
            ],
            [
                469,
                469
            ],
            [
                469,
                613
            ],
            [
                613,
                613
            ],
            [
                613,
                688
            ],
            [
                688,
                688
            ],
            [
                688,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                793
            ],
            [
                793,
                819
            ],
            [
                819,
                819
            ],
            [
                819,
                904
            ],
            [
                904,
                969
            ],
            [
                969,
                1029
            ],
            [
                1029,
                1067
            ],
            [
                1067,
                1130
            ],
            [
                1130,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1384
            ],
            [
                1384,
                1472
            ],
            [
                1472,
                1529
            ],
            [
                1529,
                1621
            ],
            [
                1621,
                1662
            ],
            [
                1662,
                1728
            ],
            [
                1728,
                1827
            ],
            [
                1827,
                1986
            ],
            [
                1986,
                2123
            ],
            [
                2123,
                2191
            ],
            [
                2191,
                2268
            ],
            [
                2268,
                2278
            ],
            [
                2278,
                2362
            ],
            [
                2362,
                2449
            ],
            [
                2449,
                2555
            ],
            [
                2555,
                2704
            ],
            [
                2704,
                2792
            ],
            [
                2792,
                2842
            ],
            [
                2842,
                2955
            ],
            [
                2955,
                2955
            ],
            [
                2955,
                2972
            ],
            [
                2972,
                2983
            ],
            [
                2983,
                2983
            ],
            [
                2983,
                2983
            ],
            [
                2983,
                2983
            ],
            [
                2983,
                3068
            ],
            [
                3068,
                3087
            ],
            [
                3087,
                3107
            ],
            [
                3107,
                3128
            ],
            [
                3128,
                3270
            ],
            [
                3270,
                3293
            ],
            [
                3293,
                3301
            ],
            [
                3301,
                3323
            ],
            [
                3323,
                3323
            ],
            [
                3323,
                3323
            ],
            [
                3323,
                3343
            ],
            [
                3343,
                3343
            ],
            [
                3343,
                3476
            ],
            [
                3476,
                3495
            ],
            [
                3495,
                3495
            ],
            [
                3495,
                3495
            ],
            [
                3495,
                3495
            ],
            [
                3495,
                3508
            ],
            [
                3508,
                3508
            ],
            [
                3508,
                3542
            ],
            [
                3542,
                3601
            ],
            [
                3601,
                3601
            ],
            [
                3601,
                3659
            ],
            [
                3659,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3702
            ],
            [
                3702,
                3750
            ],
            [
                3750,
                3777
            ],
            [
                3777,
                3834
            ],
            [
                3834,
                3834
            ],
            [
                3834,
                3981
            ],
            [
                3981,
                4031
            ],
            [
                4031,
                4063
            ],
            [
                4063,
                4167
            ],
            [
                4167,
                4167
            ],
            [
                4167,
                4167
            ],
            [
                4167,
                4167
            ],
            [
                4167,
                4237
            ],
            [
                4237,
                4305
            ],
            [
                4305,
                4353
            ],
            [
                4353,
                4407
            ],
            [
                4407,
                4414
            ],
            [
                4414,
                4426
            ],
            [
                4426,
                4436
            ],
            [
                4436,
                4436
            ],
            [
                4436,
                4443
            ],
            [
                4443,
                4488
            ],
            [
                4488,
                4525
            ],
            [
                4525,
                4569
            ],
            [
                4569,
                4611
            ],
            [
                4611,
                4611
            ],
            [
                4611,
                4611
            ],
            [
                4611,
                4611
            ],
            [
                4611,
                4611
            ],
            [
                4611,
                4770
            ],
            [
                4770,
                4790
            ],
            [
                4790,
                4836
            ],
            [
                4836,
                4856
            ],
            [
                4856,
                4881
            ],
            [
                4881,
                4881
            ],
            [
                4881,
                4952
            ],
            [
                4952,
                5003
            ],
            [
                5003,
                5003
            ],
            [
                5003,
                5047
            ],
            [
                5047,
                5091
            ],
            [
                5091,
                5121
            ],
            [
                5121,
                5158
            ],
            [
                5158,
                5172
            ],
            [
                5172,
                5172
            ],
            [
                5172,
                5241
            ],
            [
                5241,
                5241
            ],
            [
                5241,
                5438
            ],
            [
                5438,
                5466
            ],
            [
                5466,
                5503
            ],
            [
                5503,
                5503
            ],
            [
                5503,
                5530
            ],
            [
                5530,
                5575
            ],
            [
                5575,
                5631
            ],
            [
                5631,
                5720
            ],
            [
                5720,
                5818
            ],
            [
                5818,
                5877
            ],
            [
                5877,
                5990
            ],
            [
                5990,
                6149
            ],
            [
                6149,
                6246
            ],
            [
                6246,
                6353
            ],
            [
                6353,
                6425
            ],
            [
                6425,
                6541
            ],
            [
                6541,
                6685
            ],
            [
                6685,
                6808
            ],
            [
                6808,
                6900
            ],
            [
                6900,
                6937
            ],
            [
                6937,
                7076
            ],
            [
                7076,
                7161
            ],
            [
                7161,
                7201
            ],
            [
                7201,
                7301
            ],
            [
                7301,
                7476
            ],
            [
                7476,
                7549
            ],
            [
                7549,
                7750
            ],
            [
                7750,
                7787
            ],
            [
                7787,
                7798
            ],
            [
                7798,
                7890
            ],
            [
                7890,
                7917
            ],
            [
                7917,
                7949
            ],
            [
                7949,
                8017
            ],
            [
                8017,
                8075
            ],
            [
                8075,
                8260
            ],
            [
                8260,
                8309
            ],
            [
                8309,
                8340
            ],
            [
                8340,
                8380
            ],
            [
                8380,
                8403
            ],
            [
                8403,
                8499
            ],
            [
                8499,
                8623
            ],
            [
                8623,
                8712
            ],
            [
                8712,
                8776
            ],
            [
                8776,
                8812
            ],
            [
                8812,
                8851
            ],
            [
                8851,
                8888
            ],
            [
                8888,
                8932
            ],
            [
                8932,
                8982
            ],
            [
                8982,
                9078
            ],
            [
                9078,
                9099
            ],
            [
                9099,
                9099
            ],
            [
                9099,
                9154
            ],
            [
                9154,
                9217
            ],
            [
                9217,
                9261
            ],
            [
                9261,
                9346
            ],
            [
                9346,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9550
            ],
            [
                9550,
                9601
            ],
            [
                9601,
                9697
            ],
            [
                9697,
                9742
            ],
            [
                9742,
                9754
            ],
            [
                9754,
                9841
            ],
            [
                9841,
                9841
            ],
            [
                9841,
                9880
            ],
            [
                9880,
                9890
            ],
            [
                9890,
                9957
            ],
            [
                9957,
                10003
            ],
            [
                10003,
                10066
            ],
            [
                10066,
                10238
            ],
            [
                10238,
                10278
            ],
            [
                10278,
                10296
            ],
            [
                10296,
                10353
            ],
            [
                10353,
                10417
            ],
            [
                10417,
                10417
            ],
            [
                10417,
                10430
            ],
            [
                10430,
                10430
            ],
            [
                10430,
                10527
            ],
            [
                10527,
                10527
            ],
            [
                10527,
                10561
            ],
            [
                10561,
                10691
            ],
            [
                10691,
                10758
            ],
            [
                10758,
                10813
            ],
            [
                10813,
                10825
            ],
            [
                10825,
                10825
            ],
            [
                10825,
                10825
            ],
            [
                10825,
                10825
            ],
            [
                10825,
                10956
            ],
            [
                10956,
                11139
            ],
            [
                11139,
                11236
            ],
            [
                11236,
                11315
            ],
            [
                11315,
                11420
            ],
            [
                11420,
                11420
            ],
            [
                11420,
                11420
            ],
            [
                11420,
                11473
            ],
            [
                11473,
                11566
            ],
            [
                11566,
                11631
            ],
            [
                11631,
                11631
            ],
            [
                11631,
                11675
            ],
            [
                11675,
                11730
            ],
            [
                11730,
                11777
            ],
            [
                11777,
                11811
            ],
            [
                11811,
                11867
            ],
            [
                11867,
                11879
            ],
            [
                11879,
                11894
            ],
            [
                11894,
                12242
            ],
            [
                12242,
                12365
            ],
            [
                12365,
                12476
            ],
            [
                12476,
                12557
            ],
            [
                12557,
                12678
            ],
            [
                12678,
                12802
            ],
            [
                12802,
                12871
            ],
            [
                12871,
                13055
            ],
            [
                13055,
                13142
            ],
            [
                13142,
                13228
            ],
            [
                13228,
                13310
            ],
            [
                13310,
                13340
            ],
            [
                13340,
                13414
            ],
            [
                13414,
                13747
            ],
            [
                13747,
                13862
            ],
            [
                13862,
                13888
            ],
            [
                13888,
                13916
            ],
            [
                13916,
                13916
            ],
            [
                13916,
                13916
            ],
            [
                13916,
                13946
            ],
            [
                13946,
                13958
            ],
            [
                13958,
                13958
            ],
            [
                13958,
                13965
            ],
            [
                13965,
                14075
            ],
            [
                14075,
                14114
            ],
            [
                14114,
                14140
            ],
            [
                14140,
                14209
            ],
            [
                14209,
                14299
            ],
            [
                14299,
                14299
            ],
            [
                14299,
                14299
            ],
            [
                14299,
                14299
            ],
            [
                14299,
                14321
            ],
            [
                14321,
                14329
            ],
            [
                14329,
                14345
            ],
            [
                14345,
                14388
            ],
            [
                14388,
                14388
            ],
            [
                14388,
                14467
            ],
            [
                14467,
                14507
            ],
            [
                14507,
                14530
            ],
            [
                14530,
                14565
            ],
            [
                14565,
                14607
            ],
            [
                14607,
                14651
            ],
            [
                14651,
                14697
            ],
            [
                14697,
                14786
            ],
            [
                14786,
                14827
            ],
            [
                14827,
                14847
            ],
            [
                14847,
                14895
            ],
            [
                14895,
                14988
            ],
            [
                14988,
                15094
            ],
            [
                15094,
                15094
            ],
            [
                15094,
                15160
            ],
            [
                15160,
                15252
            ],
            [
                15252,
                15328
            ],
            [
                15328,
                15420
            ],
            [
                15420,
                15420
            ],
            [
                15420,
                15478
            ],
            [
                15478,
                15522
            ],
            [
                15522,
                15563
            ],
            [
                15563,
                15571
            ],
            [
                15571,
                15588
            ],
            [
                15588,
                15621
            ],
            [
                15621,
                15642
            ],
            [
                15642,
                15689
            ],
            [
                15689,
                15689
            ],
            [
                15689,
                15716
            ],
            [
                15716,
                15798
            ],
            [
                15798,
                15845
            ],
            [
                15845,
                15888
            ],
            [
                15888,
                15888
            ],
            [
                15888,
                15888
            ],
            [
                15888,
                15888
            ],
            [
                15888,
                15888
            ],
            [
                15888,
                15909
            ],
            [
                15909,
                15975
            ],
            [
                15975,
                16031
            ],
            [
                16031,
                16154
            ],
            [
                16154,
                16154
            ],
            [
                16154,
                16210
            ],
            [
                16210,
                16210
            ],
            [
                16210,
                16210
            ],
            [
                16210,
                16285
            ],
            [
                16285,
                16355
            ],
            [
                16355,
                16439
            ],
            [
                16439,
                16439
            ],
            [
                16439,
                16450
            ],
            [
                16450,
                16471
            ],
            [
                16471,
                16545
            ],
            [
                16545,
                16634
            ],
            [
                16634,
                16634
            ],
            [
                16634,
                16674
            ],
            [
                16674,
                16735
            ],
            [
                16735,
                16780
            ],
            [
                16780,
                16848
            ],
            [
                16848,
                17030
            ],
            [
                17030,
                17043
            ],
            [
                17043,
                17142
            ],
            [
                17142,
                17193
            ],
            [
                17193,
                17301
            ],
            [
                17301,
                17316
            ],
            [
                17316,
                17335
            ],
            [
                17335,
                17335
            ],
            [
                17335,
                17352
            ],
            [
                17352,
                17388
            ],
            [
                17388,
                17472
            ],
            [
                17472,
                17472
            ],
            [
                17472,
                17472
            ],
            [
                17472,
                17472
            ],
            [
                17472,
                17472
            ],
            [
                17472,
                17555
            ],
            [
                17555,
                17794
            ],
            [
                17794,
                17815
            ],
            [
                17815,
                17856
            ],
            [
                17856,
                17907
            ],
            [
                17907,
                17951
            ],
            [
                17951,
                17951
            ],
            [
                17951,
                17951
            ],
            [
                17951,
                17951
            ],
            [
                17951,
                18069
            ],
            [
                18069,
                18069
            ],
            [
                18069,
                18118
            ],
            [
                18118,
                18160
            ],
            [
                18160,
                18243
            ],
            [
                18243,
                18289
            ],
            [
                18289,
                18364
            ],
            [
                18364,
                18413
            ],
            [
                18413,
                18597
            ],
            [
                18597,
                18611
            ],
            [
                18611,
                18631
            ],
            [
                18631,
                18665
            ],
            [
                18665,
                18705
            ],
            [
                18705,
                18705
            ],
            [
                18705,
                18752
            ],
            [
                18752,
                18805
            ],
            [
                18805,
                18931
            ],
            [
                18931,
                18931
            ],
            [
                18931,
                19046
            ],
            [
                19046,
                19130
            ],
            [
                19130,
                19167
            ],
            [
                19167,
                19254
            ],
            [
                19254,
                19254
            ],
            [
                19254,
                19345
            ],
            [
                19345,
                19345
            ],
            [
                19345,
                19543
            ]
        ]
    }
}