{
    "original": {
        "text": "About thirty years ago Miss Maria Ward, of Huntingdon, with only seven thousand pounds, had the good luck to captivate Sir Thomas Bertram, of Mansfield Park, in the county of Northampton, and to be thereby raised to the rank of a baronet's lady, with all the comforts and consequences of an handsome house and large income. All Huntingdon exclaimed on the greatness of the match, and her uncle, the lawyer, himself, allowed her to be at least three thousand pounds short of any equitable claim to it. She had two sisters to be benefited by her elevation; and such of their acquaintance as thought Miss Ward and Miss Frances quite as handsome as Miss Maria, did not scruple to predict their marrying with almost equal advantage. But there certainly are not so many men of large fortune in the world as there are pretty women to deserve them. Miss Ward, at the end of half a dozen years, found herself obliged to be attached to the Rev. Mr. Norris, a friend of her brother-in-law, with scarcely any private fortune, and Miss Frances fared yet worse. Miss Ward's match, indeed, when it came to the point, was not contemptible: Sir Thomas being happily able to give his friend an income in the living of Mansfield; and Mr. and Mrs. Norris began their career of conjugal felicity with very little less than a thousand a year. But Miss Frances married, in the common phrase, to disoblige her family, and by fixing on a lieutenant of marines, without education, fortune, or connexions, did it very thoroughly. She could hardly have made a more untoward choice. Sir Thomas Bertram had interest, which, from principle as well as pride-from a general wish of doing right, and a desire of seeing all that were connected with him in situations of respectability, he would have been glad to exert for the advantage of Lady Bertram's sister; but her husband's profession was such as no interest could reach; and before he had time to devise any other method of assisting them, an absolute breach between the sisters had taken place. It was the natural result of the conduct of each party, and such as a very imprudent marriage almost always produces. To save herself from useless remonstrance, Mrs. Price never wrote to her family on the subject till actually married. Lady Bertram, who was a woman of very tranquil feelings, and a temper remarkably easy and indolent, would have contented herself with merely giving up her sister, and thinking no more of the matter; but Mrs. Norris had a spirit of activity, which could not be satisfied till she had written a long and angry letter to Fanny, to point out the folly of her conduct, and threaten her with all its possible ill consequences. Mrs. Price, in her turn, was injured and angry; and an answer, which comprehended each sister in its bitterness, and bestowed such very disrespectful reflections on the pride of Sir Thomas as Mrs. Norris could not possibly keep to herself, put an end to all intercourse between them for a considerable period.\nTheir homes were so distant, and the circles in which they moved so distinct, as almost to preclude the means of ever hearing of each other's existence during the eleven following years, or, at least, to make it very wonderful to Sir Thomas that Mrs. Norris should ever have it in her power to tell them, as she now and then did, in an angry voice, that Fanny had got another child. By the end of eleven years, however, Mrs. Price could no longer afford to cherish pride or resentment, or to lose one connexion that might possibly assist her. A large and still increasing family, an husband disabled for active service, but not the less equal to company and good liquor, and a very small income to supply their wants, made her eager to regain the friends she had so carelessly sacrificed; and she addressed Lady Bertram in a letter which spoke so much contrition and despondence, such a superfluity of children, and such a want of almost everything else, as could not but dispose them all to a reconciliation. She was preparing for her ninth lying-in; and after bewailing the circumstance, and imploring their countenance as sponsors to the expected child, she could not conceal how important she felt they might be to the future maintenance of the eight already in being. Her eldest was a boy of ten years old, a fine spirited fellow, who longed to be out in the world; but what could she do? Was there any chance of his being hereafter useful to Sir Thomas in the concerns of his West Indian property? No situation would be beneath him; or what did Sir Thomas think of Woolwich? or how could a boy be sent out to the East?\nThe letter was not unproductive. It re-established peace and kindness. Sir Thomas sent friendly advice and professions, Lady Bertram dispatched money and baby-linen, and Mrs. Norris wrote the letters.\nSuch were its immediate effects, and within a twelvemonth a more important advantage to Mrs. Price resulted from it. Mrs. Norris was often observing to the others that she could not get her poor sister and her family out of her head, and that, much as they had all done for her, she seemed to be wanting to do more; and at length she could not but own it to be her wish that poor Mrs. Price should be relieved from the charge and expense of one child entirely out of her great number. \"What if they were among them to undertake the care of her eldest daughter, a girl now nine years old, of an age to require more attention than her poor mother could possibly give? The trouble and expense of it to them would be nothing, compared with the benevolence of the action.\" Lady Bertram agreed with her instantly. \"I think we cannot do better,\" said she; \"let us send for the child.\"\nSir Thomas could not give so instantaneous and unqualified a consent. He debated and hesitated;-it was a serious charge;-a girl so brought up must be adequately provided for, or there would be cruelty instead of kindness in taking her from her family. He thought of his own four children, of his two sons, of cousins in love, etc.;-but no sooner had he deliberately begun to state his objections, than Mrs. Norris interrupted him with a reply to them all, whether stated or not.\n\"My dear Sir Thomas, I perfectly comprehend you, and do justice to the generosity and delicacy of your notions, which indeed are quite of a piece with your general conduct; and I entirely agree with you in the main as to the propriety of doing everything one could by way of providing for a child one had in a manner taken into one's own hands; and I am sure I should be the last person in the world to withhold my mite upon such an occasion. Having no children of my own, who should I look to in any little matter I may ever have to bestow, but the children of my sisters?-and I am sure Mr. Norris is too just-but you know I am a woman of few words and professions. Do not let us be frightened from a good deed by a trifle. Give a girl an education, and introduce her properly into the world, and ten to one but she has the means of settling well, without farther expense to anybody. A niece of ours, Sir Thomas, I may say, or at least of _yours_, would not grow up in this neighbourhood without many advantages. I don't say she would be so handsome as her cousins. I dare say she would not; but she would be introduced into the society of this country under such very favourable circumstances as, in all human probability, would get her a creditable establishment. You are thinking of your sons-but do not you know that, of all things upon earth, _that_ is the least likely to happen, brought up as they would be, always together like brothers and sisters? It is morally impossible. I never knew an instance of it. It is, in fact, the only sure way of providing against the connexion. Suppose her a pretty girl, and seen by Tom or Edmund for the first time seven years hence, and I dare say there would be mischief. The very idea of her having been suffered to grow up at a distance from us all in poverty and neglect, would be enough to make either of the dear, sweet-tempered boys in love with her. But breed her up with them from this time, and suppose her even to have the beauty of an angel, and she will never be more to either than a sister.\"\n\"There is a great deal of truth in what you say,\" replied Sir Thomas, \"and far be it from me to throw any fanciful impediment in the way of a plan which would be so consistent with the relative situations of each. I only meant to observe that it ought not to be lightly engaged in, and that to make it really serviceable to Mrs. Price, and creditable to ourselves, we must secure to the child, or consider ourselves engaged to secure to her hereafter, as circumstances may arise, the provision of a gentlewoman, if no such establishment should offer as you are so sanguine in expecting.\"\n\"I thoroughly understand you,\" cried Mrs. Norris, \"you are everything that is generous and considerate, and I am sure we shall never disagree on this point. Whatever I can do, as you well know, I am always ready enough to do for the good of those I love; and, though I could never feel for this little girl the hundredth part of the regard I bear your own dear children, nor consider her, in any respect, so much my own, I should hate myself if I were capable of neglecting her. Is not she a sister's child? and could I bear to see her want while I had a bit of bread to give her? My dear Sir Thomas, with all my faults I have a warm heart; and, poor as I am, would rather deny myself the necessaries of life than do an ungenerous thing. So, if you are not against it, I will write to my poor sister tomorrow, and make the proposal; and, as soon as matters are settled, _I_ will engage to get the child to Mansfield; _you_ shall have no trouble about it. My own trouble, you know, I never regard. I will send Nanny to London on purpose, and she may have a bed at her cousin the saddler's, and the child be appointed to meet her there. They may easily get her from Portsmouth to town by the coach, under the care of any creditable person that may chance to be going. I dare say there is always some reputable tradesman's wife or other going up.\"\nExcept to the attack on Nanny's cousin, Sir Thomas no longer made any objection, and a more respectable, though less economical rendezvous being accordingly substituted, everything was considered as settled, and the pleasures of so benevolent a scheme were already enjoyed. The division of gratifying sensations ought not, in strict justice, to have been equal; for Sir Thomas was fully resolved to be the real and consistent patron of the selected child, and Mrs. Norris had not the least intention of being at any expense whatever in her maintenance. As far as walking, talking, and contriving reached, she was thoroughly benevolent, and nobody knew better how to dictate liberality to others; but her love of money was equal to her love of directing, and she knew quite as well how to save her own as to spend that of her friends. Having married on a narrower income than she had been used to look forward to, she had, from the first, fancied a very strict line of economy necessary; and what was begun as a matter of prudence, soon grew into a matter of choice, as an object of that needful solicitude which there were no children to supply. Had there been a family to provide for, Mrs. Norris might never have saved her money; but having no care of that kind, there was nothing to impede her frugality, or lessen the comfort of making a yearly addition to an income which they had never lived up to. Under this infatuating principle, counteracted by no real affection for her sister, it was impossible for her to aim at more than the credit of projecting and arranging so expensive a charity; though perhaps she might so little know herself as to walk home to the Parsonage, after this conversation, in the happy belief of being the most liberal-minded sister and aunt in the world.\nWhen the subject was brought forward again, her views were more fully explained; and, in reply to Lady Bertram's calm inquiry of \"Where shall the child come to first, sister, to you or to us?\" Sir Thomas heard with some surprise that it would be totally out of Mrs. Norris's power to take any share in the personal charge of her. He had been considering her as a particularly welcome addition at the Parsonage, as a desirable companion to an aunt who had no children of her own; but he found himself wholly mistaken. Mrs. Norris was sorry to say that the little girl's staying with them, at least as things then were, was quite out of the question. Poor Mr. Norris's indifferent state of health made it an impossibility: he could no more bear the noise of a child than he could fly; if, indeed, he should ever get well of his gouty complaints, it would be a different matter: she should then be glad to take her turn, and think nothing of the inconvenience; but just now, poor Mr. Norris took up every moment of her time, and the very mention of such a thing she was sure would distract him.\n\"Then she had better come to us,\" said Lady Bertram, with the utmost composure. After a short pause Sir Thomas added with dignity, \"Yes, let her home be in this house. We will endeavour to do our duty by her, and she will, at least, have the advantage of companions of her own age, and of a regular instructress.\"\n\"Very true,\" cried Mrs. Norris, \"which are both very important considerations; and it will be just the same to Miss Lee whether she has three girls to teach, or only two-there can be no difference. I only wish I could be more useful; but you see I do all in my power. I am not one of those that spare their own trouble; and Nanny shall fetch her, however it may put me to inconvenience to have my chief counsellor away for three days. I suppose, sister, you will put the child in the little white attic, near the old nurseries. It will be much the best place for her, so near Miss Lee, and not far from the girls, and close by the housemaids, who could either of them help to dress her, you know, and take care of her clothes, for I suppose you would not think it fair to expect Ellis to wait on her as well as the others. Indeed, I do not see that you could possibly place her anywhere else.\"\nLady Bertram made no opposition.\n\"I hope she will prove a well-disposed girl,\" continued Mrs. Norris, \"and be sensible of her uncommon good fortune in having such friends.\"\n\"Should her disposition be really bad,\" said Sir Thomas, \"we must not, for our own children's sake, continue her in the family; but there is no reason to expect so great an evil. We shall probably see much to wish altered in her, and must prepare ourselves for gross ignorance, some meanness of opinions, and very distressing vulgarity of manner; but these are not incurable faults; nor, I trust, can they be dangerous for her associates. Had my daughters been _younger_ than herself, I should have considered the introduction of such a companion as a matter of very serious moment; but, as it is, I hope there can be nothing to fear for _them_, and everything to hope for _her_, from the association.\"\n\"That is exactly what I think,\" cried Mrs. Norris, \"and what I was saying to my husband this morning. It will be an education for the child, said I, only being with her cousins; if Miss Lee taught her nothing, she would learn to be good and clever from _them_.\"\n\"I hope she will not tease my poor pug,\" said Lady Bertram; \"I have but just got Julia to leave it alone.\"\n\"There will be some difficulty in our way, Mrs. Norris,\" observed Sir Thomas, \"as to the distinction proper to be made between the girls as they grow up: how to preserve in the minds of my _daughters_ the consciousness of what they are, without making them think too lowly of their cousin; and how, without depressing her spirits too far, to make her remember that she is not a _Miss Bertram_. I should wish to see them very good friends, and would, on no account, authorise in my girls the smallest degree of arrogance towards their relation; but still they cannot be equals. Their rank, fortune, rights, and expectations will always be different. It is a point of great delicacy, and you must assist us in our endeavours to choose exactly the right line of conduct.\"\nMrs. Norris was quite at his service; and though she perfectly agreed with him as to its being a most difficult thing, encouraged him to hope that between them it would be easily managed.\nIt will be readily believed that Mrs. Norris did not write to her sister in vain. Mrs. Price seemed rather surprised that a girl should be fixed on, when she had so many fine boys, but accepted the offer most thankfully, assuring them of her daughter's being a very well-disposed, good-humoured girl, and trusting they would never have cause to throw her off. She spoke of her farther as somewhat delicate and puny, but was sanguine in the hope of her being materially better for change of air. Poor woman! she probably thought change of air might agree with many of her children.",
        "paragraph_chars": [
            [
                0,
                2986
            ],
            [
                2986,
                4611
            ],
            [
                4611,
                4812
            ],
            [
                4812,
                5690
            ],
            [
                5690,
                6169
            ],
            [
                6169,
                8221
            ],
            [
                8221,
                8809
            ],
            [
                8809,
                10154
            ],
            [
                10154,
                11942
            ],
            [
                11942,
                13034
            ],
            [
                13034,
                13348
            ],
            [
                13348,
                14242
            ],
            [
                14242,
                14275
            ],
            [
                14275,
                14415
            ],
            [
                14415,
                15118
            ],
            [
                15118,
                15380
            ],
            [
                15380,
                15487
            ],
            [
                15487,
                16256
            ],
            [
                16256,
                16444
            ],
            [
                16444,
                17024
            ]
        ],
        "segment_chars": [
            [
                0,
                324
            ],
            [
                324,
                501
            ],
            [
                501,
                728
            ],
            [
                728,
                841
            ],
            [
                841,
                1048
            ],
            [
                1048,
                1321
            ],
            [
                1321,
                1503
            ],
            [
                1503,
                1554
            ],
            [
                1554,
                2019
            ],
            [
                2019,
                2137
            ],
            [
                2137,
                2255
            ],
            [
                2255,
                2676
            ],
            [
                2676,
                2986
            ],
            [
                2986,
                3369
            ],
            [
                3369,
                3529
            ],
            [
                3529,
                3996
            ],
            [
                3996,
                4259
            ],
            [
                4259,
                4380
            ],
            [
                4380,
                4490
            ],
            [
                4490,
                4567
            ],
            [
                4567,
                4611
            ],
            [
                4611,
                4644
            ],
            [
                4644,
                4682
            ],
            [
                4682,
                4812
            ],
            [
                4812,
                4929
            ],
            [
                4929,
                5297
            ],
            [
                5297,
                5478
            ],
            [
                5478,
                5580
            ],
            [
                5580,
                5620
            ],
            [
                5620,
                5690
            ],
            [
                5690,
                5760
            ],
            [
                5760,
                5942
            ],
            [
                5942,
                6169
            ],
            [
                6169,
                6612
            ],
            [
                6612,
                6836
            ],
            [
                6836,
                6894
            ],
            [
                6894,
                7054
            ],
            [
                7054,
                7183
            ],
            [
                7183,
                7236
            ],
            [
                7236,
                7436
            ],
            [
                7436,
                7628
            ],
            [
                7628,
                7654
            ],
            [
                7654,
                7686
            ],
            [
                7686,
                7756
            ],
            [
                7756,
                7887
            ],
            [
                7887,
                8072
            ],
            [
                8072,
                8221
            ],
            [
                8221,
                8435
            ],
            [
                8435,
                8809
            ],
            [
                8809,
                8966
            ],
            [
                8966,
                9288
            ],
            [
                9288,
                9317
            ],
            [
                9317,
                9390
            ],
            [
                9390,
                9547
            ],
            [
                9547,
                9764
            ],
            [
                9764,
                9806
            ],
            [
                9806,
                9944
            ],
            [
                9944,
                10075
            ],
            [
                10075,
                10154
            ],
            [
                10154,
                10428
            ],
            [
                10428,
                10707
            ],
            [
                10707,
                10988
            ],
            [
                10988,
                11300
            ],
            [
                11300,
                11559
            ],
            [
                11559,
                11942
            ],
            [
                11942,
                12135
            ],
            [
                12135,
                12272
            ],
            [
                12272,
                12459
            ],
            [
                12459,
                12591
            ],
            [
                12591,
                13034
            ],
            [
                13034,
                13114
            ],
            [
                13114,
                13202
            ],
            [
                13202,
                13348
            ],
            [
                13348,
                13546
            ],
            [
                13546,
                13616
            ],
            [
                13616,
                13783
            ],
            [
                13783,
                13876
            ],
            [
                13876,
                14171
            ],
            [
                14171,
                14242
            ],
            [
                14242,
                14275
            ],
            [
                14275,
                14415
            ],
            [
                14415,
                14594
            ],
            [
                14594,
                14854
            ],
            [
                14854,
                15118
            ],
            [
                15118,
                15220
            ],
            [
                15220,
                15380
            ],
            [
                15380,
                15487
            ],
            [
                15487,
                15881
            ],
            [
                15881,
                16064
            ],
            [
                16064,
                16136
            ],
            [
                16136,
                16256
            ],
            [
                16256,
                16444
            ],
            [
                16444,
                16526
            ],
            [
                16526,
                16804
            ],
            [
                16804,
                16939
            ],
            [
                16939,
                16951
            ],
            [
                16951,
                17024
            ]
        ],
        "overlap_chars": [
            [
                0,
                156
            ],
            [
                158,
                250
            ],
            [
                291,
                324
            ],
            [
                501,
                523
            ],
            [
                540,
                554
            ],
            [
                728,
                731
            ],
            [
                597,
                623
            ],
            [
                589,
                596
            ],
            [
                673,
                675
            ],
            [
                524,
                526
            ],
            [
                624,
                656
            ],
            [
                732,
                737
            ],
            [
                748,
                763
            ],
            [
                764,
                767
            ],
            [
                785,
                841
            ],
            [
                841,
                851
            ],
            [
                866,
                913
            ],
            [
                923,
                1047
            ],
            [
                1048,
                1065
            ],
            [
                1102,
                1134
            ],
            [
                1141,
                1209
            ],
            [
                1319,
                1321
            ],
            [
                1321,
                1346
            ],
            [
                1367,
                1502
            ],
            [
                1554,
                1572
            ],
            [
                1585,
                1586
            ],
            [
                1631,
                1684
            ],
            [
                1699,
                1717
            ],
            [
                1735,
                1742
            ],
            [
                1592,
                1593
            ],
            [
                1754,
                1764
            ],
            [
                1784,
                1787
            ],
            [
                1805,
                1871
            ],
            [
                1881,
                1892
            ],
            [
                1898,
                1907
            ],
            [
                1920,
                1930
            ],
            [
                1937,
                2018
            ],
            [
                2019,
                2025
            ],
            [
                2079,
                2137
            ],
            [
                2137,
                2157
            ],
            [
                2166,
                2216
            ],
            [
                2232,
                2255
            ],
            [
                2255,
                2268
            ],
            [
                2277,
                2287
            ],
            [
                2293,
                2310
            ],
            [
                2312,
                2315
            ],
            [
                2336,
                2340
            ],
            [
                2318,
                2324
            ],
            [
                2353,
                2441
            ],
            [
                2452,
                2469
            ],
            [
                2502,
                2617
            ],
            [
                2674,
                2675
            ],
            [
                2676,
                2727
            ],
            [
                2787,
                2788
            ],
            [
                2812,
                2825
            ],
            [
                2731,
                2744
            ],
            [
                2868,
                2964
            ],
            [
                2978,
                2985
            ],
            [
                3040,
                3044
            ],
            [
                3112,
                3125
            ],
            [
                3138,
                3148
            ],
            [
                3149,
                3155
            ],
            [
                3166,
                3171
            ],
            [
                3015,
                3018
            ],
            [
                3216,
                3226
            ],
            [
                3227,
                3368
            ],
            [
                3369,
                3450
            ],
            [
                3460,
                3482
            ],
            [
                3487,
                3507
            ],
            [
                3517,
                3529
            ],
            [
                3529,
                3536
            ],
            [
                3558,
                3604
            ],
            [
                3606,
                3609
            ],
            [
                3541,
                3546
            ],
            [
                3623,
                3631
            ],
            [
                3644,
                3680
            ],
            [
                3702,
                3728
            ],
            [
                3733,
                3740
            ],
            [
                3773,
                3782
            ],
            [
                3793,
                3805
            ],
            [
                3809,
                3829
            ],
            [
                3830,
                3848
            ],
            [
                3864,
                3949
            ],
            [
                3975,
                3996
            ],
            [
                3996,
                4017
            ],
            [
                4058,
                4061
            ],
            [
                4018,
                4027
            ],
            [
                4136,
                4141
            ],
            [
                4036,
                4041
            ],
            [
                4147,
                4187
            ],
            [
                4193,
                4208
            ],
            [
                4216,
                4234
            ],
            [
                4235,
                4240
            ],
            [
                4257,
                4259
            ],
            [
                4259,
                4292
            ],
            [
                4296,
                4355
            ],
            [
                4380,
                4413
            ],
            [
                4424,
                4490
            ],
            [
                4525,
                4527
            ],
            [
                4609,
                4611
            ],
            [
                4611,
                4621
            ],
            [
                4647,
                4682
            ],
            [
                4682,
                4713
            ],
            [
                4729,
                4812
            ],
            [
                4849,
                4857
            ],
            [
                4870,
                4929
            ],
            [
                4929,
                5013
            ],
            [
                5029,
                5044
            ],
            [
                5126,
                5145
            ],
            [
                5164,
                5230
            ],
            [
                5242,
                5271
            ],
            [
                5295,
                5297
            ],
            [
                5297,
                5315
            ],
            [
                5327,
                5398
            ],
            [
                5476,
                5478
            ],
            [
                5478,
                5489
            ],
            [
                5516,
                5580
            ],
            [
                5580,
                5620
            ],
            [
                5620,
                5690
            ],
            [
                5690,
                5710
            ],
            [
                5751,
                5758
            ],
            [
                5716,
                5718
            ],
            [
                5758,
                5760
            ],
            [
                5760,
                5762
            ],
            [
                5775,
                5811
            ],
            [
                5813,
                5817
            ],
            [
                5832,
                5867
            ],
            [
                5874,
                5882
            ],
            [
                5921,
                5942
            ],
            [
                5942,
                6042
            ],
            [
                6056,
                6119
            ],
            [
                6167,
                6169
            ],
            [
                6169,
                6221
            ],
            [
                6346,
                6383
            ],
            [
                6610,
                6612
            ],
            [
                6836,
                6894
            ],
            [
                6894,
                6977
            ],
            [
                6982,
                7054
            ],
            [
                7054,
                7064
            ],
            [
                7069,
                7082
            ],
            [
                7118,
                7123
            ],
            [
                7128,
                7135
            ],
            [
                7166,
                7183
            ],
            [
                7236,
                7260
            ],
            [
                7205,
                7234
            ],
            [
                7260,
                7275
            ],
            [
                7408,
                7420
            ],
            [
                7434,
                7436
            ],
            [
                7436,
                7469
            ],
            [
                7486,
                7490
            ],
            [
                7525,
                7527
            ],
            [
                7545,
                7583
            ],
            [
                7601,
                7626
            ],
            [
                7686,
                7701
            ],
            [
                7711,
                7756
            ],
            [
                7756,
                7887
            ],
            [
                8072,
                8075
            ],
            [
                8082,
                8098
            ],
            [
                8166,
                8221
            ],
            [
                8221,
                8230
            ],
            [
                8247,
                8289
            ],
            [
                8433,
                8435
            ],
            [
                8435,
                8463
            ],
            [
                8586,
                8593
            ],
            [
                8604,
                8613
            ],
            [
                8673,
                8675
            ],
            [
                8718,
                8743
            ],
            [
                8758,
                8764
            ],
            [
                8806,
                8809
            ],
            [
                8809,
                8911
            ],
            [
                8964,
                8966
            ],
            [
                9003,
                9020
            ],
            [
                9028,
                9033
            ],
            [
                8966,
                8980
            ],
            [
                9034,
                9037
            ],
            [
                9050,
                9179
            ],
            [
                9230,
                9255
            ],
            [
                9283,
                9288
            ],
            [
                9429,
                9522
            ],
            [
                9529,
                9539
            ],
            [
                9545,
                9547
            ],
            [
                9547,
                9645
            ],
            [
                9680,
                9681
            ],
            [
                9683,
                9725
            ],
            [
                9727,
                9730
            ],
            [
                9732,
                9753
            ],
            [
                9762,
                9764
            ],
            [
                9764,
                9806
            ],
            [
                9806,
                9833
            ],
            [
                9844,
                9911
            ],
            [
                9928,
                9944
            ],
            [
                9944,
                9963
            ],
            [
                9968,
                9986
            ],
            [
                9992,
                10075
            ],
            [
                10075,
                10106
            ],
            [
                10117,
                10154
            ],
            [
                10239,
                10298
            ],
            [
                10311,
                10338
            ],
            [
                10353,
                10360
            ],
            [
                10426,
                10428
            ],
            [
                10524,
                10534
            ],
            [
                10541,
                10564
            ],
            [
                10580,
                10593
            ],
            [
                10603,
                10707
            ],
            [
                10801,
                10853
            ],
            [
                10912,
                10954
            ],
            [
                10866,
                10871
            ],
            [
                10955,
                10988
            ],
            [
                10988,
                11007
            ],
            [
                11017,
                11023
            ],
            [
                11065,
                11099
            ],
            [
                11102,
                11113
            ],
            [
                11122,
                11149
            ],
            [
                11160,
                11162
            ],
            [
                11175,
                11218
            ],
            [
                11298,
                11300
            ],
            [
                11397,
                11399
            ],
            [
                11317,
                11338
            ],
            [
                11417,
                11460
            ],
            [
                11384,
                11385
            ],
            [
                11767,
                11770
            ],
            [
                11811,
                11896
            ],
            [
                11912,
                11942
            ],
            [
                11942,
                11962
            ],
            [
                11979,
                12021
            ],
            [
                12028,
                12135
            ],
            [
                12135,
                12272
            ],
            [
                12272,
                12304
            ],
            [
                12318,
                12325
            ],
            [
                12368,
                12380
            ],
            [
                12335,
                12351
            ],
            [
                12419,
                12441
            ],
            [
                12449,
                12459
            ],
            [
                12459,
                12528
            ],
            [
                12560,
                12591
            ],
            [
                12591,
                12661
            ],
            [
                12914,
                12962
            ],
            [
                13032,
                13034
            ],
            [
                13034,
                13091
            ],
            [
                13103,
                13114
            ],
            [
                13138,
                13150
            ],
            [
                13163,
                13202
            ],
            [
                13247,
                13271
            ],
            [
                13289,
                13319
            ],
            [
                13323,
                13348
            ],
            [
                13348,
                13378
            ],
            [
                13544,
                13546
            ],
            [
                13546,
                13616
            ],
            [
                13672,
                13709
            ],
            [
                13720,
                13733
            ],
            [
                13714,
                13716
            ],
            [
                13734,
                13783
            ],
            [
                13783,
                13850
            ],
            [
                13874,
                13876
            ],
            [
                13876,
                13886
            ],
            [
                13892,
                13915
            ],
            [
                13966,
                14000
            ],
            [
                14016,
                14073
            ],
            [
                14242,
                14275
            ],
            [
                14275,
                14342
            ],
            [
                14415,
                14594
            ],
            [
                14594,
                14596
            ],
            [
                14649,
                14723
            ],
            [
                14729,
                14801
            ],
            [
                14812,
                14854
            ],
            [
                14854,
                14875
            ],
            [
                14898,
                14966
            ],
            [
                14977,
                14989
            ],
            [
                14967,
                14973
            ],
            [
                14996,
                15012
            ],
            [
                15020,
                15052
            ],
            [
                15054,
                15058
            ],
            [
                15059,
                15087
            ],
            [
                15089,
                15092
            ],
            [
                15093,
                15118
            ],
            [
                15118,
                15170
            ],
            [
                15220,
                15257
            ],
            [
                15265,
                15370
            ],
            [
                15372,
                15376
            ],
            [
                15377,
                15380
            ],
            [
                15380,
                15447
            ],
            [
                15452,
                15487
            ],
            [
                15487,
                15517
            ],
            [
                15528,
                15587
            ],
            [
                15595,
                15675
            ],
            [
                15688,
                15864
            ],
            [
                15866,
                15878
            ],
            [
                15881,
                15935
            ],
            [
                15952,
                15973
            ],
            [
                15997,
                16034
            ],
            [
                16041,
                16064
            ],
            [
                16136,
                16256
            ],
            [
                16256,
                16292
            ],
            [
                16373,
                16374
            ],
            [
                16294,
                16297
            ],
            [
                16375,
                16444
            ],
            [
                16477,
                16526
            ],
            [
                16526,
                16543
            ],
            [
                16551,
                16647
            ],
            [
                16653,
                16743
            ],
            [
                16802,
                16804
            ],
            [
                16804,
                16820
            ],
            [
                16829,
                16849
            ],
            [
                16858,
                16863
            ],
            [
                16889,
                16901
            ],
            [
                16913,
                16939
            ],
            [
                16939,
                16951
            ],
            [
                16951,
                17024
            ]
        ],
        "row_chars": [
            [
                0,
                324
            ],
            [
                324,
                501
            ],
            [
                501,
                841
            ],
            [
                841,
                1048
            ],
            [
                1048,
                1321
            ],
            [
                1321,
                1503
            ],
            [
                1503,
                1554
            ],
            [
                1554,
                2019
            ],
            [
                2019,
                2137
            ],
            [
                2137,
                2255
            ],
            [
                2255,
                2676
            ],
            [
                2676,
                2986
            ],
            [
                2986,
                3369
            ],
            [
                3369,
                3529
            ],
            [
                3529,
                3996
            ],
            [
                3996,
                4259
            ],
            [
                4259,
                4380
            ],
            [
                4380,
                4490
            ],
            [
                4490,
                4611
            ],
            [
                4611,
                4682
            ],
            [
                4682,
                4812
            ],
            [
                4812,
                4929
            ],
            [
                4929,
                5297
            ],
            [
                5297,
                5478
            ],
            [
                5478,
                5580
            ],
            [
                5580,
                5620
            ],
            [
                5620,
                5690
            ],
            [
                5690,
                5760
            ],
            [
                5760,
                5942
            ],
            [
                5942,
                6169
            ],
            [
                6169,
                6612
            ],
            [
                6612,
                6836
            ],
            [
                6836,
                6894
            ],
            [
                6894,
                7054
            ],
            [
                7054,
                7183
            ],
            [
                7183,
                7436
            ],
            [
                7436,
                7628
            ],
            [
                7628,
                7654
            ],
            [
                7654,
                7686
            ],
            [
                7686,
                7756
            ],
            [
                7756,
                7887
            ],
            [
                7887,
                8072
            ],
            [
                8072,
                8221
            ],
            [
                8221,
                8435
            ],
            [
                8435,
                8809
            ],
            [
                8809,
                8966
            ],
            [
                8966,
                9288
            ],
            [
                9288,
                9317
            ],
            [
                9317,
                9390
            ],
            [
                9390,
                9547
            ],
            [
                9547,
                9764
            ],
            [
                9764,
                9806
            ],
            [
                9806,
                9944
            ],
            [
                9944,
                10075
            ],
            [
                10075,
                10154
            ],
            [
                10154,
                10428
            ],
            [
                10428,
                10707
            ],
            [
                10707,
                10988
            ],
            [
                10988,
                11300
            ],
            [
                11300,
                11942
            ],
            [
                11942,
                12135
            ],
            [
                12135,
                12272
            ],
            [
                12272,
                12459
            ],
            [
                12459,
                12591
            ],
            [
                12591,
                13034
            ],
            [
                13034,
                13114
            ],
            [
                13114,
                13202
            ],
            [
                13202,
                13348
            ],
            [
                13348,
                13546
            ],
            [
                13546,
                13616
            ],
            [
                13616,
                13783
            ],
            [
                13783,
                13876
            ],
            [
                13876,
                14171
            ],
            [
                14171,
                14242
            ],
            [
                14242,
                14275
            ],
            [
                14275,
                14415
            ],
            [
                14415,
                14594
            ],
            [
                14594,
                14854
            ],
            [
                14854,
                15118
            ],
            [
                15118,
                15380
            ],
            [
                15380,
                15487
            ],
            [
                15487,
                15881
            ],
            [
                15881,
                16064
            ],
            [
                16064,
                16136
            ],
            [
                16136,
                16256
            ],
            [
                16256,
                16444
            ],
            [
                16444,
                16526
            ],
            [
                16526,
                16804
            ],
            [
                16804,
                16939
            ],
            [
                16939,
                16951
            ],
            [
                16951,
                17024
            ]
        ]
    },
    "abridged": {
        "text": "About thirty years ago Miss Maria Ward, of Huntingdon, with only seven thousand pounds, had the good luck to captivate Sir Thomas Bertram, of Mansfield Park in the county of Northampton, and to be thereby raised to the rank of a baronet's lady, with a handsome house and large income. She had two sisters to benefit from her elevation; but while Miss Ward and Miss Frances were thought to be quite as handsome as Miss Maria, there are not so many rich men in the world as there are pretty women to deserve them. Miss Ward, after half a dozen years, found herself obliged to be married to the Rev. Mr. Norris, a friend of her brother-in-law, with scarcely any private fortune, and Miss Frances fared yet worse.\nMiss Ward's match was not contemptible: Sir Thomas was happily able to give his friend an income in the living of Mansfield. But Miss Frances married, as they say, to disoblige her family, and by fixing on a lieutenant of marines, without education, fortune, or connexions, did it very thoroughly.\nSir Thomas Bertram, having a general wish of doing right, and a desire of seeing those connected with him respectably situated, would have gladly used his influence for Lady Bertram's sister; but her husband's profession was such as no influence could reach. Before he could devise any method of assisting them, an absolute breach between the sisters had taken place.\nIt was such as a very imprudent marriage almost always produces. To save herself from remonstrance, Mrs. Price never wrote to her family about her marriage till actually married. Lady Bertram, a woman of tranquil feelings and an easy temper, would have contented herself with merely giving up her sister, and thinking no more of it; but Mrs. Norris could not be satisfied till she had written a long and angry letter to Fanny, to point out the folly of her conduct.\nMrs. Price, in her turn, was injured and angry; and her bitter, disrespectful answer, which Mrs. Norris could not possibly keep to herself, put an end to all intercourse between them for a long period. They hardly heard of each other during the next eleven years; and Sir Thomas was surprised that Mrs. Norris should ever have it in her power to tell them, as she now and then did, in an angry voice, that Fanny had got another child.\nBy the end of eleven years, however, Mrs. Price could no longer afford to cherish resentment, or to lose a connexion that might assist her. A large family, an husband disabled for active service but still equal to good liquor, and a very small income, made her eager to regain her friends; and she sent Lady Bertram a letter which spoke of so much contrition, such a superfluity of children, and such a want of almost everything else, as could only lead to a reconciliation. She was preparing for the arrival of her ninth child; and could not conceal how important she felt her relatives might be to the maintenance of the other eight. Her eldest was a boy of ten years, a fine spirited fellow, who longed to be out in the world. Was there any chance of his being useful to Sir Thomas in the concerns of his West Indian property? or elsewhere?\nThe letter re-established peace and kindness. Sir Thomas sent friendly advice, Lady Bertram dispatched money and baby-linen, and Mrs. Norris wrote the letters.\nWithin a year a more important advantage to Mrs. Price resulted from it. Mrs. Norris was often observing to the others that she could not get her poor sister out of her head; and at length she owned it to be her wish that poor Mrs. Price should be relieved from the expense of one child entirely. \"What if they were to undertake the care of her eldest daughter, a girl now nine years old? The trouble would be nothing, compared with the benevolence of the action.\" Lady Bertram agreed with her instantly. \"I think we cannot do better,\" said she; \"let us send for the child.\"\nSir Thomas could not consent so swiftly. He hesitated;-it was a serious charge;-the girl must be adequately provided for, or it would be cruel to take her from her family. He thought of his own four children, of his two sons, of cousins in love, etc.;-but no sooner had he begun to state his objections, than Mrs. Norris interrupted him.\n\"My dear Sir Thomas, I perfectly comprehend you, and I entirely agree with you in the main. Do not let us be frightened from a good deed by a trifle. Give a girl an education, and introduce her properly into the world, and ten to one she has the means of settling well, without farther expense to anybody. A niece of yours, Sir Thomas, would grow up here with many advantages. I dare say she would not be so handsome as her cousins; but she would probably make a creditable marriage. You are thinking of your sons-but that is unlikely to happen, brought up as they would be like brothers and sisters. It is, in fact, a sure way of providing against the connexion. Suppose her a pretty girl, and seen by Tom or Edmund for the first time seven years hence, and I dare say there would be mischief. But bring her up with them now, and she will never be more to either than a sister.\"\n\"There is much truth in what you say,\" replied Sir Thomas. \"I only meant to observe that we must provide for the child as a gentlewoman, if no such marriage should occur.\"\n\"I thoroughly understand you,\" cried Mrs. Norris, \"you are everything that is generous and considerate. I am always ready to do whatever I can for those I love; and, though I could never feel for this little girl the hundredth part of the regard I bear your own dear children, I should hate myself if I neglected her. I have a warm heart; and, poor as I am, would rather deny myself the necessaries of life than be ungenerous. So, if you are not against it, I will write to my poor sister tomorrow, and make the proposal; and I will engage to get the child to Mansfield; you shall have no trouble. My own trouble, you know, I never regard. I will send Nanny to London, and she may have a bed at her cousin the saddler's, and the child may meet her there. They may easily get the child from Portsmouth to London by the coach, under the care of any creditable person that may chance to be going. I dare say there is always some tradesman's wife or other going up.\"\nA more respectable, though less economical rendezvous being substituted, everything was settled. Sir Thomas was resolved to be the real patron of the child, and Mrs. Norris had not the least intention of being at any expense whatever in her maintenance. Nobody knew better how to dictate liberality to others; but she knew quite as well how to save her own money as to spend that of her friends. Having married on a narrow income, she had, from the first, fancied very strict economy necessary; and what began as prudence, soon grew into a matter of choice. With no family to provide for, there was nothing to impede her frugality; yet she walked home to the Parsonage, after this conversation, in the happy belief of being the most generous sister and aunt in the world.\nWhen the subject was raised again, her views were more fully explained. In reply to Lady Bertram's calm inquiry of \"Where shall the child come to first, sister, to you or to us?\" Sir Thomas heard with some surprise that it would be totally out of Mrs. Norris's power to take any share in the personal charge of her. He had been considering her as a welcome companion to Mrs Norris at the Parsonage; but he found himself mistaken. Mrs. Norris was sorry to say that the little girl's staying with them was quite out of the question. Poor Mr. Norris's indifferent state of health made it an impossibility. Poor Mr. Norris took up every moment of her time.\n\"Then she had better come to us,\" said Lady Bertram, with composure. Sir Thomas added, \"Yes, let her home be in this house. She will, at least, have companions of her own age, and a regular instructress.\"\n\"Very true,\" cried Mrs. Norris. \"I only wish I could be more useful; but you see I do all in my power. Nanny shall fetch her, however it may inconvenience me to have my chief counsellor away for three days. I suppose, sister, you will put the child in the little white attic. It will be the best place for her, close by the housemaids, who could help to dress her, you know, and take care of her clothes.\"\nLady Bertram made no opposition.\n\"I hope she will prove a well-disposed girl,\" continued Mrs. Norris.\n\"Should her disposition be really bad,\" said Sir Thomas, \"we must not, for our own children's sake, continue her in the family; but there is no reason to expect so great an evil. We must prepare ourselves for gross ignorance, some meanness of opinions, and distressing vulgarity of manner; but these are not incurable faults; nor can they be dangerous for her associates. Had my daughters been younger, I should have considered the introduction of such a companion as a very serious matter; but, as it is, there can be nothing to fear for them, and everything to hope for her, from the association.\"\n\"That is exactly what I think,\" cried Mrs. Norris, \"It will be an education for the child, only being with her cousins; if Miss Lee taught her nothing, she would learn to be good and clever from them.\"\n\"I hope she will not tease my poor pug,\" said Lady Bertram; \"I have only just got Julia to leave it alone.\"\n\"There will be some difficulty, Mrs. Norris,\" observed Sir Thomas, \"as to the distinction to be made between the girls as they grow up: how to preserve in the minds of my daughters the consciousness of what they are, without making them think too lowly of their cousin; and how, without depressing her spirits too far, to make her remember that she is not a Miss Bertram. I should wish to see them very good friends, and would not authorise in my girls any arrogance towards their relation; but they cannot be equals. It is a point of great delicacy, and you must assist us in our endeavours to choose exactly the right line of conduct.\"\nMrs. Norris was quite at his service, and encouraged him to hope that between them it would be easily managed.\nMrs. Norris did not write to her sister in vain. Mrs. Price seemed surprised that a girl should be fixed on, when she had so many fine boys, but accepted the offer thankfully, assuring them of her daughter's being a very well-disposed, good-humoured girl. She spoke of her as somewhat delicate, but hoped of her being better for change of air. Poor woman! she probably thought change of air might agree with many of her children.",
        "paragraph_chars": [
            [
                0,
                710
            ],
            [
                710,
                1008
            ],
            [
                1008,
                1376
            ],
            [
                1376,
                1842
            ],
            [
                1842,
                2277
            ],
            [
                2277,
                3121
            ],
            [
                3121,
                3281
            ],
            [
                3281,
                3856
            ],
            [
                3856,
                4194
            ],
            [
                4194,
                5074
            ],
            [
                5074,
                5246
            ],
            [
                5246,
                6209
            ],
            [
                6209,
                6981
            ],
            [
                6981,
                7634
            ],
            [
                7634,
                7839
            ],
            [
                7839,
                8245
            ],
            [
                8245,
                8278
            ],
            [
                8278,
                8347
            ],
            [
                8347,
                8947
            ],
            [
                8947,
                9149
            ],
            [
                9149,
                9257
            ],
            [
                9257,
                9895
            ],
            [
                9895,
                10006
            ],
            [
                10006,
                10435
            ]
        ],
        "segment_chars": [
            [
                0,
                285
            ],
            [
                285,
                512
            ],
            [
                512,
                710
            ],
            [
                710,
                835
            ],
            [
                835,
                1008
            ],
            [
                1008,
                1267
            ],
            [
                1267,
                1376
            ],
            [
                1376,
                1441
            ],
            [
                1441,
                1555
            ],
            [
                1555,
                1842
            ],
            [
                1842,
                2044
            ],
            [
                2044,
                2277
            ],
            [
                2277,
                2417
            ],
            [
                2417,
                2752
            ],
            [
                2752,
                2913
            ],
            [
                2913,
                3007
            ],
            [
                3007,
                3107
            ],
            [
                3107,
                3121
            ],
            [
                3121,
                3167
            ],
            [
                3167,
                3281
            ],
            [
                3281,
                3354
            ],
            [
                3354,
                3578
            ],
            [
                3578,
                3670
            ],
            [
                3670,
                3746
            ],
            [
                3746,
                3786
            ],
            [
                3786,
                3856
            ],
            [
                3856,
                3897
            ],
            [
                3897,
                4028
            ],
            [
                4028,
                4194
            ],
            [
                4194,
                4286
            ],
            [
                4286,
                4344
            ],
            [
                4344,
                4500
            ],
            [
                4500,
                4571
            ],
            [
                4571,
                4678
            ],
            [
                4678,
                4795
            ],
            [
                4795,
                4858
            ],
            [
                4858,
                4989
            ],
            [
                4989,
                5074
            ],
            [
                5074,
                5133
            ],
            [
                5133,
                5246
            ],
            [
                5246,
                5350
            ],
            [
                5350,
                5564
            ],
            [
                5564,
                5673
            ],
            [
                5673,
                5844
            ],
            [
                5844,
                5886
            ],
            [
                5886,
                6001
            ],
            [
                6001,
                6140
            ],
            [
                6140,
                6209
            ],
            [
                6209,
                6306
            ],
            [
                6306,
                6463
            ],
            [
                6463,
                6605
            ],
            [
                6605,
                6767
            ],
            [
                6767,
                6981
            ],
            [
                6981,
                7053
            ],
            [
                7053,
                7160
            ],
            [
                7160,
                7297
            ],
            [
                7297,
                7411
            ],
            [
                7411,
                7512
            ],
            [
                7512,
                7584
            ],
            [
                7584,
                7634
            ],
            [
                7634,
                7703
            ],
            [
                7703,
                7758
            ],
            [
                7758,
                7839
            ],
            [
                7839,
                7871
            ],
            [
                7871,
                7942
            ],
            [
                7942,
                8046
            ],
            [
                8046,
                8115
            ],
            [
                8115,
                8245
            ],
            [
                8245,
                8278
            ],
            [
                8278,
                8347
            ],
            [
                8347,
                8526
            ],
            [
                8526,
                8719
            ],
            [
                8719,
                8947
            ],
            [
                8947,
                9149
            ],
            [
                9149,
                9257
            ],
            [
                9257,
                9629
            ],
            [
                9629,
                9775
            ],
            [
                9775,
                9895
            ],
            [
                9895,
                10006
            ],
            [
                10006,
                10055
            ],
            [
                10055,
                10262
            ],
            [
                10262,
                10350
            ],
            [
                10350,
                10362
            ],
            [
                10362,
                10435
            ]
        ],
        "overlap_chars": [
            [
                0,
                156
            ],
            [
                157,
                249
            ],
            [
                252,
                285
            ],
            [
                285,
                307
            ],
            [
                321,
                335
            ],
            [
                336,
                339
            ],
            [
                346,
                372
            ],
            [
                378,
                385
            ],
            [
                386,
                388
            ],
            [
                389,
                391
            ],
            [
                392,
                424
            ],
            [
                425,
                430
            ],
            [
                431,
                446
            ],
            [
                452,
                455
            ],
            [
                456,
                512
            ],
            [
                512,
                522
            ],
            [
                529,
                576
            ],
            [
                585,
                709
            ],
            [
                710,
                727
            ],
            [
                728,
                760
            ],
            [
                765,
                833
            ],
            [
                833,
                835
            ],
            [
                835,
                860
            ],
            [
                872,
                1007
            ],
            [
                1008,
                1026
            ],
            [
                1026,
                1027
            ],
            [
                1035,
                1088
            ],
            [
                1095,
                1113
            ],
            [
                1114,
                1121
            ],
            [
                1134,
                1135
            ],
            [
                1136,
                1146
            ],
            [
                1173,
                1176
            ],
            [
                1177,
                1243
            ],
            [
                1254,
                1265
            ],
            [
                1267,
                1276
            ],
            [
                1283,
                1293
            ],
            [
                1294,
                1375
            ],
            [
                1376,
                1382
            ],
            [
                1383,
                1441
            ],
            [
                1441,
                1461
            ],
            [
                1462,
                1512
            ],
            [
                1532,
                1555
            ],
            [
                1555,
                1568
            ],
            [
                1569,
                1579
            ],
            [
                1580,
                1597
            ],
            [
                1598,
                1601
            ],
            [
                1605,
                1609
            ],
            [
                1610,
                1616
            ],
            [
                1616,
                1704
            ],
            [
                1707,
                1724
            ],
            [
                1725,
                1840
            ],
            [
                1840,
                1841
            ],
            [
                1842,
                1893
            ],
            [
                1904,
                1905
            ],
            [
                1906,
                1919
            ],
            [
                1920,
                1933
            ],
            [
                1934,
                2030
            ],
            [
                2036,
                2043
            ],
            [
                2044,
                2048
            ],
            [
                2062,
                2075
            ],
            [
                2076,
                2086
            ],
            [
                2092,
                2098
            ],
            [
                2099,
                2104
            ],
            [
                2106,
                2109
            ],
            [
                2110,
                2120
            ],
            [
                2135,
                2276
            ],
            [
                2277,
                2358
            ],
            [
                2359,
                2381
            ],
            [
                2384,
                2404
            ],
            [
                2405,
                2417
            ],
            [
                2417,
                2424
            ],
            [
                2425,
                2471
            ],
            [
                2472,
                2475
            ],
            [
                2476,
                2481
            ],
            [
                2482,
                2490
            ],
            [
                2491,
                2527
            ],
            [
                2527,
                2553
            ],
            [
                2558,
                2565
            ],
            [
                2565,
                2574
            ],
            [
                2580,
                2592
            ],
            [
                2593,
                2613
            ],
            [
                2617,
                2635
            ],
            [
                2635,
                2720
            ],
            [
                2731,
                2752
            ],
            [
                2752,
                2773
            ],
            [
                2774,
                2777
            ],
            [
                2789,
                2798
            ],
            [
                2799,
                2804
            ],
            [
                2804,
                2809
            ],
            [
                2810,
                2850
            ],
            [
                2865,
                2880
            ],
            [
                2881,
                2899
            ],
            [
                2906,
                2911
            ],
            [
                2911,
                2913
            ],
            [
                2913,
                2946
            ],
            [
                2946,
                3005
            ],
            [
                3007,
                3040
            ],
            [
                3041,
                3107
            ],
            [
                3107,
                3109
            ],
            [
                3119,
                3121
            ],
            [
                3121,
                3131
            ],
            [
                3132,
                3167
            ],
            [
                3167,
                3198
            ],
            [
                3198,
                3281
            ],
            [
                3281,
                3289
            ],
            [
                3295,
                3354
            ],
            [
                3354,
                3438
            ],
            [
                3439,
                3454
            ],
            [
                3454,
                3473
            ],
            [
                3480,
                3546
            ],
            [
                3547,
                3576
            ],
            [
                3576,
                3578
            ],
            [
                3578,
                3596
            ],
            [
                3597,
                3668
            ],
            [
                3668,
                3670
            ],
            [
                3670,
                3681
            ],
            [
                3682,
                3746
            ],
            [
                3746,
                3786
            ],
            [
                3786,
                3856
            ],
            [
                3856,
                3876
            ],
            [
                3877,
                3884
            ],
            [
                3885,
                3887
            ],
            [
                3895,
                3897
            ],
            [
                3897,
                3899
            ],
            [
                3900,
                3936
            ],
            [
                3940,
                3944
            ],
            [
                3945,
                3980
            ],
            [
                3984,
                3992
            ],
            [
                4007,
                4028
            ],
            [
                4028,
                4128
            ],
            [
                4129,
                4192
            ],
            [
                4192,
                4194
            ],
            [
                4194,
                4246
            ],
            [
                4247,
                4284
            ],
            [
                4284,
                4286
            ],
            [
                4286,
                4344
            ],
            [
                4344,
                4427
            ],
            [
                4428,
                4500
            ],
            [
                4500,
                4510
            ],
            [
                4516,
                4529
            ],
            [
                4530,
                4535
            ],
            [
                4536,
                4543
            ],
            [
                4554,
                4571
            ],
            [
                4571,
                4595
            ],
            [
                4596,
                4625
            ],
            [
                4625,
                4640
            ],
            [
                4655,
                4667
            ],
            [
                4676,
                4678
            ],
            [
                4678,
                4711
            ],
            [
                4712,
                4716
            ],
            [
                4717,
                4719
            ],
            [
                4729,
                4767
            ],
            [
                4768,
                4793
            ],
            [
                4795,
                4810
            ],
            [
                4813,
                4858
            ],
            [
                4858,
                4989
            ],
            [
                4989,
                4992
            ],
            [
                4999,
                5015
            ],
            [
                5019,
                5074
            ],
            [
                5074,
                5083
            ],
            [
                5089,
                5131
            ],
            [
                5131,
                5133
            ],
            [
                5134,
                5162
            ],
            [
                5163,
                5170
            ],
            [
                5183,
                5192
            ],
            [
                5193,
                5195
            ],
            [
                5196,
                5221
            ],
            [
                5231,
                5237
            ],
            [
                5243,
                5246
            ],
            [
                5246,
                5348
            ],
            [
                5348,
                5350
            ],
            [
                5350,
                5367
            ],
            [
                5368,
                5373
            ],
            [
                5374,
                5388
            ],
            [
                5389,
                5392
            ],
            [
                5393,
                5522
            ],
            [
                5523,
                5548
            ],
            [
                5559,
                5564
            ],
            [
                5564,
                5657
            ],
            [
                5661,
                5671
            ],
            [
                5671,
                5673
            ],
            [
                5673,
                5771
            ],
            [
                5772,
                5773
            ],
            [
                5774,
                5816
            ],
            [
                5817,
                5820
            ],
            [
                5821,
                5842
            ],
            [
                5842,
                5844
            ],
            [
                5844,
                5886
            ],
            [
                5886,
                5913
            ],
            [
                5913,
                5980
            ],
            [
                5985,
                6001
            ],
            [
                6001,
                6020
            ],
            [
                6031,
                6049
            ],
            [
                6057,
                6140
            ],
            [
                6140,
                6171
            ],
            [
                6172,
                6209
            ],
            [
                6209,
                6268
            ],
            [
                6269,
                6296
            ],
            [
                6297,
                6304
            ],
            [
                6304,
                6306
            ],
            [
                6310,
                6320
            ],
            [
                6321,
                6344
            ],
            [
                6345,
                6358
            ],
            [
                6359,
                6463
            ],
            [
                6470,
                6522
            ],
            [
                6523,
                6565
            ],
            [
                6566,
                6571
            ],
            [
                6572,
                6605
            ],
            [
                6605,
                6624
            ],
            [
                6632,
                6638
            ],
            [
                6638,
                6672
            ],
            [
                6673,
                6684
            ],
            [
                6685,
                6712
            ],
            [
                6719,
                6721
            ],
            [
                6722,
                6765
            ],
            [
                6765,
                6767
            ],
            [
                6772,
                6774
            ],
            [
                6775,
                6796
            ],
            [
                6796,
                6839
            ],
            [
                6839,
                6840
            ],
            [
                6845,
                6848
            ],
            [
                6856,
                6941
            ],
            [
                6951,
                6981
            ],
            [
                6981,
                7001
            ],
            [
                7009,
                7051
            ],
            [
                7053,
                7160
            ],
            [
                7160,
                7297
            ],
            [
                7297,
                7329
            ],
            [
                7330,
                7337
            ],
            [
                7338,
                7350
            ],
            [
                7362,
                7378
            ],
            [
                7378,
                7400
            ],
            [
                7401,
                7411
            ],
            [
                7411,
                7480
            ],
            [
                7481,
                7512
            ],
            [
                7512,
                7582
            ],
            [
                7584,
                7632
            ],
            [
                7632,
                7634
            ],
            [
                7634,
                7691
            ],
            [
                7692,
                7703
            ],
            [
                7707,
                7719
            ],
            [
                7719,
                7758
            ],
            [
                7758,
                7782
            ],
            [
                7783,
                7813
            ],
            [
                7814,
                7839
            ],
            [
                7839,
                7869
            ],
            [
                7869,
                7871
            ],
            [
                7872,
                7942
            ],
            [
                7942,
                7979
            ],
            [
                7980,
                7993
            ],
            [
                7994,
                7996
            ],
            [
                7997,
                8046
            ],
            [
                8046,
                8113
            ],
            [
                8113,
                8115
            ],
            [
                8115,
                8125
            ],
            [
                8126,
                8149
            ],
            [
                8150,
                8184
            ],
            [
                8185,
                8242
            ],
            [
                8245,
                8278
            ],
            [
                8278,
                8345
            ],
            [
                8347,
                8526
            ],
            [
                8526,
                8528
            ],
            [
                8529,
                8603
            ],
            [
                8604,
                8676
            ],
            [
                8677,
                8719
            ],
            [
                8719,
                8740
            ],
            [
                8748,
                8816
            ],
            [
                8817,
                8829
            ],
            [
                8830,
                8836
            ],
            [
                8836,
                8852
            ],
            [
                8853,
                8885
            ],
            [
                8886,
                8890
            ],
            [
                8890,
                8918
            ],
            [
                8919,
                8922
            ],
            [
                8922,
                8947
            ],
            [
                8947,
                8999
            ],
            [
                8999,
                9036
            ],
            [
                9036,
                9141
            ],
            [
                9142,
                9146
            ],
            [
                9146,
                9149
            ],
            [
                9149,
                9216
            ],
            [
                9222,
                9257
            ],
            [
                9257,
                9287
            ],
            [
                9287,
                9346
            ],
            [
                9347,
                9427
            ],
            [
                9438,
                9614
            ],
            [
                9615,
                9627
            ],
            [
                9629,
                9683
            ],
            [
                9688,
                9709
            ],
            [
                9714,
                9751
            ],
            [
                9752,
                9775
            ],
            [
                9775,
                9895
            ],
            [
                9895,
                9931
            ],
            [
                9931,
                9932
            ],
            [
                9933,
                9936
            ],
            [
                9937,
                10006
            ],
            [
                10006,
                10055
            ],
            [
                10055,
                10072
            ],
            [
                10073,
                10169
            ],
            [
                10170,
                10260
            ],
            [
                10260,
                10262
            ],
            [
                10262,
                10278
            ],
            [
                10279,
                10299
            ],
            [
                10299,
                10304
            ],
            [
                10311,
                10323
            ],
            [
                10324,
                10350
            ],
            [
                10350,
                10362
            ],
            [
                10362,
                10435
            ]
        ],
        "row_chars": [
            [
                0,
                285
            ],
            [
                285,
                285
            ],
            [
                285,
                512
            ],
            [
                512,
                710
            ],
            [
                710,
                835
            ],
            [
                835,
                1008
            ],
            [
                1008,
                1008
            ],
            [
                1008,
                1376
            ],
            [
                1376,
                1441
            ],
            [
                1441,
                1555
            ],
            [
                1555,
                1842
            ],
            [
                1842,
                2044
            ],
            [
                2044,
                2277
            ],
            [
                2277,
                2417
            ],
            [
                2417,
                2752
            ],
            [
                2752,
                2913
            ],
            [
                2913,
                3007
            ],
            [
                3007,
                3107
            ],
            [
                3107,
                3121
            ],
            [
                3121,
                3167
            ],
            [
                3167,
                3281
            ],
            [
                3281,
                3354
            ],
            [
                3354,
                3578
            ],
            [
                3578,
                3670
            ],
            [
                3670,
                3746
            ],
            [
                3746,
                3786
            ],
            [
                3786,
                3856
            ],
            [
                3856,
                3897
            ],
            [
                3897,
                4028
            ],
            [
                4028,
                4194
            ],
            [
                4194,
                4286
            ],
            [
                4286,
                4286
            ],
            [
                4286,
                4344
            ],
            [
                4344,
                4500
            ],
            [
                4500,
                4571
            ],
            [
                4571,
                4678
            ],
            [
                4678,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4858
            ],
            [
                4858,
                4989
            ],
            [
                4989,
                4989
            ],
            [
                4989,
                5074
            ],
            [
                5074,
                5133
            ],
            [
                5133,
                5246
            ],
            [
                5246,
                5350
            ],
            [
                5350,
                5564
            ],
            [
                5564,
                5564
            ],
            [
                5564,
                5564
            ],
            [
                5564,
                5673
            ],
            [
                5673,
                5844
            ],
            [
                5844,
                5886
            ],
            [
                5886,
                6001
            ],
            [
                6001,
                6140
            ],
            [
                6140,
                6209
            ],
            [
                6209,
                6306
            ],
            [
                6306,
                6463
            ],
            [
                6463,
                6605
            ],
            [
                6605,
                6767
            ],
            [
                6767,
                6981
            ],
            [
                6981,
                7160
            ],
            [
                7160,
                7297
            ],
            [
                7297,
                7411
            ],
            [
                7411,
                7512
            ],
            [
                7512,
                7634
            ],
            [
                7634,
                7703
            ],
            [
                7703,
                7758
            ],
            [
                7758,
                7839
            ],
            [
                7839,
                7871
            ],
            [
                7871,
                7942
            ],
            [
                7942,
                8046
            ],
            [
                8046,
                8115
            ],
            [
                8115,
                8245
            ],
            [
                8245,
                8245
            ],
            [
                8245,
                8278
            ],
            [
                8278,
                8347
            ],
            [
                8347,
                8526
            ],
            [
                8526,
                8719
            ],
            [
                8719,
                8947
            ],
            [
                8947,
                9149
            ],
            [
                9149,
                9257
            ],
            [
                9257,
                9629
            ],
            [
                9629,
                9775
            ],
            [
                9775,
                9775
            ],
            [
                9775,
                9895
            ],
            [
                9895,
                10006
            ],
            [
                10006,
                10055
            ],
            [
                10055,
                10262
            ],
            [
                10262,
                10350
            ],
            [
                10350,
                10362
            ],
            [
                10362,
                10435
            ]
        ]
    }
}