{
    "original": {
        "text": "The little girl performed her long journey in safety; and at Northampton was met by Mrs. Norris, who thus regaled in the credit of being foremost to welcome her, and in the importance of leading her in to the others, and recommending her to their kindness.\nFanny Price was at this time just ten years old, and though there might not be much in her first appearance to captivate, there was, at least, nothing to disgust her relations. She was small of her age, with no glow of complexion, nor any other striking beauty; exceedingly timid and shy, and shrinking from notice; but her air, though awkward, was not vulgar, her voice was sweet, and when she spoke her countenance was pretty. Sir Thomas and Lady Bertram received her very kindly; and Sir Thomas, seeing how much she needed encouragement, tried to be all that was conciliating: but he had to work against a most untoward gravity of deportment; and Lady Bertram, without taking half so much trouble, or speaking one word where he spoke ten, by the mere aid of a good-humoured smile, became immediately the less awful character of the two.\nThe young people were all at home, and sustained their share in the introduction very well, with much good humour, and no embarrassment, at least on the part of the sons, who, at seventeen and sixteen, and tall of their age, had all the grandeur of men in the eyes of their little cousin. The two girls were more at a loss from being younger and in greater awe of their father, who addressed them on the occasion with rather an injudicious particularity. But they were too much used to company and praise to have anything like natural shyness; and their confidence increasing from their cousin's total want of it, they were soon able to take a full survey of her face and her frock in easy indifference.\nThey were a remarkably fine family, the sons very well-looking, the daughters decidedly handsome, and all of them well-grown and forward of their age, which produced as striking a difference between the cousins in person, as education had given to their address; and no one would have supposed the girls so nearly of an age as they really were. There were in fact but two years between the youngest and Fanny. Julia Bertram was only twelve, and Maria but a year older. The little visitor meanwhile was as unhappy as possible. Afraid of everybody, ashamed of herself, and longing for the home she had left, she knew not how to look up, and could scarcely speak to be heard, or without crying. Mrs. Norris had been talking to her the whole way from Northampton of her wonderful good fortune, and the extraordinary degree of gratitude and good behaviour which it ought to produce, and her consciousness of misery was therefore increased by the idea of its being a wicked thing for her not to be happy. The fatigue, too, of so long a journey, became soon no trifling evil. In vain were the well-meant condescensions of Sir Thomas, and all the officious prognostications of Mrs. Norris that she would be a good girl; in vain did Lady Bertram smile and make her sit on the sofa with herself and pug, and vain was even the sight of a gooseberry tart towards giving her comfort; she could scarcely swallow two mouthfuls before tears interrupted her, and sleep seeming to be her likeliest friend, she was taken to finish her sorrows in bed.\n\"This is not a very promising beginning,\" said Mrs. Norris, when Fanny had left the room. \"After all that I said to her as we came along, I thought she would have behaved better; I told her how much might depend upon her acquitting herself well at first. I wish there may not be a little sulkiness of temper-her poor mother had a good deal; but we must make allowances for such a child-and I do not know that her being sorry to leave her home is really against her, for, with all its faults, it _was_ her home, and she cannot as yet understand how much she has changed for the better; but then there is moderation in all things.\"\nIt required a longer time, however, than Mrs. Norris was inclined to allow, to reconcile Fanny to the novelty of Mansfield Park, and the separation from everybody she had been used to. Her feelings were very acute, and too little understood to be properly attended to. Nobody meant to be unkind, but nobody put themselves out of their way to secure her comfort.\nThe holiday allowed to the Miss Bertrams the next day, on purpose to afford leisure for getting acquainted with, and entertaining their young cousin, produced little union. They could not but hold her cheap on finding that she had but two sashes, and had never learned French; and when they perceived her to be little struck with the duet they were so good as to play, they could do no more than make her a generous present of some of their least valued toys, and leave her to herself, while they adjourned to whatever might be the favourite holiday sport of the moment, making artificial flowers or wasting gold paper.\nFanny, whether near or from her cousins, whether in the schoolroom, the drawing-room, or the shrubbery, was equally forlorn, finding something to fear in every person and place. She was disheartened by Lady Bertram's silence, awed by Sir Thomas's grave looks, and quite overcome by Mrs. Norris's admonitions. Her elder cousins mortified her by reflections on her size, and abashed her by noticing her shyness: Miss Lee wondered at her ignorance, and the maid-servants sneered at her clothes; and when to these sorrows was added the idea of the brothers and sisters among whom she had always been important as playfellow, instructress, and nurse, the despondence that sunk her little heart was severe.\nThe grandeur of the house astonished, but could not console her. The rooms were too large for her to move in with ease: whatever she touched she expected to injure, and she crept about in constant terror of something or other; often retreating towards her own chamber to cry; and the little girl who was spoken of in the drawing-room when she left it at night as seeming so desirably sensible of her peculiar good fortune, ended every day's sorrows by sobbing herself to sleep. A week had passed in this way, and no suspicion of it conveyed by her quiet passive manner, when she was found one morning by her cousin Edmund, the youngest of the sons, sitting crying on the attic stairs.\n\"My dear little cousin,\" said he, with all the gentleness of an excellent nature, \"what can be the matter?\" And sitting down by her, he was at great pains to overcome her shame in being so surprised, and persuade her to speak openly. Was she ill? or was anybody angry with her? or had she quarrelled with Maria and Julia? or was she puzzled about anything in her lesson that he could explain? Did she, in short, want anything he could possibly get her, or do for her? For a long while no answer could be obtained beyond a \"no, no-not at all-no, thank you\"; but he still persevered; and no sooner had he begun to revert to her own home, than her increased sobs explained to him where the grievance lay. He tried to console her.\n\"You are sorry to leave Mama, my dear little Fanny,\" said he, \"which shows you to be a very good girl; but you must remember that you are with relations and friends, who all love you, and wish to make you happy. Let us walk out in the park, and you shall tell me all about your brothers and sisters.\"\nOn pursuing the subject, he found that, dear as all these brothers and sisters generally were, there was one among them who ran more in her thoughts than the rest. It was William whom she talked of most, and wanted most to see. William, the eldest, a year older than herself, her constant companion and friend; her advocate with her mother (of whom he was the darling) in every distress. \"William did not like she should come away; he had told her he should miss her very much indeed.\" \"But William will write to you, I dare say.\" \"Yes, he had promised he would, but he had told _her_ to write first.\" \"And when shall you do it?\" She hung her head and answered hesitatingly, \"she did not know; she had not any paper.\"\n\"If that be all your difficulty, I will furnish you with paper and every other material, and you may write your letter whenever you choose. Would it make you happy to write to William?\"\n\"Yes, very.\"\n\"Then let it be done now. Come with me into the breakfast-room, we shall find everything there, and be sure of having the room to ourselves.\"\n\"But, cousin, will it go to the post?\"\n\"Yes, depend upon me it shall: it shall go with the other letters; and, as your uncle will frank it, it will cost William nothing.\"\n\"My uncle!\" repeated Fanny, with a frightened look.\n\"Yes, when you have written the letter, I will take it to my father to frank.\"\nFanny thought it a bold measure, but offered no further resistance; and they went together into the breakfast-room, where Edmund prepared her paper, and ruled her lines with all the goodwill that her brother could himself have felt, and probably with somewhat more exactness. He continued with her the whole time of her writing, to assist her with his penknife or his orthography, as either were wanted; and added to these attentions, which she felt very much, a kindness to her brother which delighted her beyond all the rest. He wrote with his own hand his love to his cousin William, and sent him half a guinea under the seal. Fanny's feelings on the occasion were such as she believed herself incapable of expressing; but her countenance and a few artless words fully conveyed all their gratitude and delight, and her cousin began to find her an interesting object. He talked to her more, and, from all that she said, was convinced of her having an affectionate heart, and a strong desire of doing right; and he could perceive her to be farther entitled to attention by great sensibility of her situation, and great timidity. He had never knowingly given her pain, but he now felt that she required more positive kindness; and with that view endeavoured, in the first place, to lessen her fears of them all, and gave her especially a great deal of good advice as to playing with Maria and Julia, and being as merry as possible.\nFrom this day Fanny grew more comfortable. She felt that she had a friend, and the kindness of her cousin Edmund gave her better spirits with everybody else. The place became less strange, and the people less formidable; and if there were some amongst them whom she could not cease to fear, she began at least to know their ways, and to catch the best manner of conforming to them. The little rusticities and awkwardnesses which had at first made grievous inroads on the tranquillity of all, and not least of herself, necessarily wore away, and she was no longer materially afraid to appear before her uncle, nor did her aunt Norris's voice make her start very much. To her cousins she became occasionally an acceptable companion. Though unworthy, from inferiority of age and strength, to be their constant associate, their pleasures and schemes were sometimes of a nature to make a third very useful, especially when that third was of an obliging, yielding temper; and they could not but own, when their aunt inquired into her faults, or their brother Edmund urged her claims to their kindness, that \"Fanny was good-natured enough.\"\nEdmund was uniformly kind himself; and she had nothing worse to endure on the part of Tom than that sort of merriment which a young man of seventeen will always think fair with a child of ten. He was just entering into life, full of spirits, and with all the liberal dispositions of an eldest son, who feels born only for expense and enjoyment. His kindness to his little cousin was consistent with his situation and rights: he made her some very pretty presents, and laughed at her.\nAs her appearance and spirits improved, Sir Thomas and Mrs. Norris thought with greater satisfaction of their benevolent plan; and it was pretty soon decided between them that, though far from clever, she showed a tractable disposition, and seemed likely to give them little trouble. A mean opinion of her abilities was not confined to _them_. Fanny could read, work, and write, but she had been taught nothing more; and as her cousins found her ignorant of many things with which they had been long familiar, they thought her prodigiously stupid, and for the first two or three weeks were continually bringing some fresh report of it into the drawing-room. \"Dear mama, only think, my cousin cannot put the map of Europe together-or my cousin cannot tell the principal rivers in Russia-or, she never heard of Asia Minor-or she does not know the difference between water-colours and crayons!-How strange!-Did you ever hear anything so stupid?\"\n\"My dear,\" their considerate aunt would reply, \"it is very bad, but you must not expect everybody to be as forward and quick at learning as yourself.\"\n\"But, aunt, she is really so very ignorant!-Do you know, we asked her last night which way she would go to get to Ireland; and she said, she should cross to the Isle of Wight. She thinks of nothing but the Isle of Wight, and she calls it _the_ _Island_, as if there were no other island in the world. I am sure I should have been ashamed of myself, if I had not known better long before I was so old as she is. I cannot remember the time when I did not know a great deal that she has not the least notion of yet. How long ago it is, aunt, since we used to repeat the chronological order of the kings of England, with the dates of their accession, and most of the principal events of their reigns!\"\n\"Yes,\" added the other; \"and of the Roman emperors as low as Severus; besides a great deal of the heathen mythology, and all the metals, semi-metals, planets, and distinguished philosophers.\"\n\"Very true indeed, my dears, but you are blessed with wonderful memories, and your poor cousin has probably none at all. There is a vast deal of difference in memories, as well as in everything else, and therefore you must make allowance for your cousin, and pity her deficiency. And remember that, if you are ever so forward and clever yourselves, you should always be modest; for, much as you know already, there is a great deal more for you to learn.\"\n\"Yes, I know there is, till I am seventeen. But I must tell you another thing of Fanny, so odd and so stupid. Do you know, she says she does not want to learn either music or drawing.\"\n\"To be sure, my dear, that is very stupid indeed, and shows a great want of genius and emulation. But, all things considered, I do not know whether it is not as well that it should be so, for, though you know (owing to me) your papa and mama are so good as to bring her up with you, it is not at all necessary that she should be as accomplished as you are;-on the contrary, it is much more desirable that there should be a difference.\"\nSuch were the counsels by which Mrs. Norris assisted to form her nieces' minds; and it is not very wonderful that, with all their promising talents and early information, they should be entirely deficient in the less common acquirements of self-knowledge, generosity and humility. In everything but disposition they were admirably taught. Sir Thomas did not know what was wanting, because, though a truly anxious father, he was not outwardly affectionate, and the reserve of his manner repressed all the flow of their spirits before him.\nTo the education of her daughters Lady Bertram paid not the smallest attention. She had not time for such cares. She was a woman who spent her days in sitting, nicely dressed, on a sofa, doing some long piece of needlework, of little use and no beauty, thinking more of her pug than her children, but very indulgent to the latter when it did not put herself to inconvenience, guided in everything important by Sir Thomas, and in smaller concerns by her sister. Had she possessed greater leisure for the service of her girls, she would probably have supposed it unnecessary, for they were under the care of a governess, with proper masters, and could want nothing more. As for Fanny's being stupid at learning, \"she could only say it was very unlucky, but some people _were_ stupid, and Fanny must take more pains: she did not know what else was to be done; and, except her being so dull, she must add she saw no harm in the poor little thing, and always found her very handy and quick in carrying messages, and fetching what she wanted.\"\nFanny, with all her faults of ignorance and timidity, was fixed at Mansfield Park, and learning to transfer in its favour much of her attachment to her former home, grew up there not unhappily among her cousins. There was no positive ill-nature in Maria or Julia; and though Fanny was often mortified by their treatment of her, she thought too lowly of her own claims to feel injured by it.\nFrom about the time of her entering the family, Lady Bertram, in consequence of a little ill-health, and a great deal of indolence, gave up the house in town, which she had been used to occupy every spring, and remained wholly in the country, leaving Sir Thomas to attend his duty in Parliament, with whatever increase or diminution of comfort might arise from her absence. In the country, therefore, the Miss Bertrams continued to exercise their memories, practise their duets, and grow tall and womanly: and their father saw them becoming in person, manner, and accomplishments, everything that could satisfy his anxiety. His eldest son was careless and extravagant, and had already given him much uneasiness; but his other children promised him nothing but good. His daughters, he felt, while they retained the name of Bertram, must be giving it new grace, and in quitting it, he trusted, would extend its respectable alliances; and the character of Edmund, his strong good sense and uprightness of mind, bid most fairly for utility, honour, and happiness to himself and all his connexions. He was to be a clergyman.\nAmid the cares and the complacency which his own children suggested, Sir Thomas did not forget to do what he could for the children of Mrs. Price: he assisted her liberally in the education and disposal of her sons as they became old enough for a determinate pursuit; and Fanny, though almost totally separated from her family, was sensible of the truest satisfaction in hearing of any kindness towards them, or of anything at all promising in their situation or conduct. Once, and once only, in the course of many years, had she the happiness of being with William. Of the rest she saw nothing: nobody seemed to think of her ever going amongst them again, even for a visit, nobody at home seemed to want her; but William determining, soon after her removal, to be a sailor, was invited to spend a week with his sister in Northamptonshire before he went to sea. Their eager affection in meeting, their exquisite delight in being together, their hours of happy mirth, and moments of serious conference, may be imagined; as well as the sanguine views and spirits of the boy even to the last, and the misery of the girl when he left her. Luckily the visit happened in the Christmas holidays, when she could directly look for comfort to her cousin Edmund; and he told her such charming things of what William was to do, and be hereafter, in consequence of his profession, as made her gradually admit that the separation might have some use. Edmund's friendship never failed her: his leaving Eton for Oxford made no change in his kind dispositions, and only afforded more frequent opportunities of proving them. Without any display of doing more than the rest, or any fear of doing too much, he was always true to her interests, and considerate of her feelings, trying to make her good qualities understood, and to conquer the diffidence which prevented their being more apparent; giving her advice, consolation, and encouragement.\nKept back as she was by everybody else, his single support could not bring her forward; but his attentions were otherwise of the highest importance in assisting the improvement of her mind, and extending its pleasures. He knew her to be clever, to have a quick apprehension as well as good sense, and a fondness for reading, which, properly directed, must be an education in itself. Miss Lee taught her French, and heard her read the daily portion of history; but he recommended the books which charmed her leisure hours, he encouraged her taste, and corrected her judgment: he made reading useful by talking to her of what she read, and heightened its attraction by judicious praise. In return for such services she loved him better than anybody in the world except William: her heart was divided between the two.",
        "paragraph_chars": [
            [
                0,
                257
            ],
            [
                257,
                1097
            ],
            [
                1097,
                1801
            ],
            [
                1801,
                3333
            ],
            [
                3333,
                3963
            ],
            [
                3963,
                4325
            ],
            [
                4325,
                4945
            ],
            [
                4945,
                5646
            ],
            [
                5646,
                6331
            ],
            [
                6331,
                7058
            ],
            [
                7058,
                7359
            ],
            [
                7359,
                8077
            ],
            [
                8077,
                8263
            ],
            [
                8263,
                8276
            ],
            [
                8276,
                8418
            ],
            [
                8418,
                8457
            ],
            [
                8457,
                8589
            ],
            [
                8589,
                8641
            ],
            [
                8641,
                8720
            ],
            [
                8720,
                10152
            ],
            [
                10152,
                11286
            ],
            [
                11286,
                11770
            ],
            [
                11770,
                12713
            ],
            [
                12713,
                12864
            ],
            [
                12864,
                13562
            ],
            [
                13562,
                13754
            ],
            [
                13754,
                14209
            ],
            [
                14209,
                14394
            ],
            [
                14394,
                14830
            ],
            [
                14830,
                15368
            ],
            [
                15368,
                16406
            ],
            [
                16406,
                16797
            ],
            [
                16797,
                17917
            ],
            [
                17917,
                19844
            ],
            [
                19844,
                20658
            ]
        ],
        "segment_chars": [
            [
                0,
                257
            ],
            [
                257,
                434
            ],
            [
                434,
                686
            ],
            [
                686,
                1097
            ],
            [
                1097,
                1386
            ],
            [
                1386,
                1552
            ],
            [
                1552,
                1801
            ],
            [
                1801,
                2146
            ],
            [
                2146,
                2211
            ],
            [
                2211,
                2270
            ],
            [
                2270,
                2327
            ],
            [
                2327,
                2493
            ],
            [
                2493,
                2800
            ],
            [
                2800,
                2870
            ],
            [
                2870,
                3333
            ],
            [
                3333,
                3423
            ],
            [
                3423,
                3588
            ],
            [
                3588,
                3963
            ],
            [
                3963,
                4148
            ],
            [
                4148,
                4232
            ],
            [
                4232,
                4325
            ],
            [
                4325,
                4498
            ],
            [
                4498,
                4945
            ],
            [
                4945,
                5123
            ],
            [
                5123,
                5254
            ],
            [
                5254,
                5646
            ],
            [
                5646,
                5711
            ],
            [
                5711,
                6124
            ],
            [
                6124,
                6331
            ],
            [
                6331,
                6439
            ],
            [
                6439,
                6565
            ],
            [
                6565,
                6578
            ],
            [
                6578,
                6609
            ],
            [
                6609,
                6653
            ],
            [
                6653,
                6724
            ],
            [
                6724,
                6799
            ],
            [
                6799,
                7033
            ],
            [
                7033,
                7058
            ],
            [
                7058,
                7270
            ],
            [
                7270,
                7359
            ],
            [
                7359,
                7523
            ],
            [
                7523,
                7587
            ],
            [
                7587,
                7747
            ],
            [
                7747,
                7845
            ],
            [
                7845,
                7890
            ],
            [
                7890,
                7961
            ],
            [
                7961,
                7989
            ],
            [
                7989,
                8077
            ],
            [
                8077,
                8217
            ],
            [
                8217,
                8263
            ],
            [
                8263,
                8276
            ],
            [
                8276,
                8302
            ],
            [
                8302,
                8418
            ],
            [
                8418,
                8457
            ],
            [
                8457,
                8589
            ],
            [
                8589,
                8601
            ],
            [
                8601,
                8641
            ],
            [
                8641,
                8720
            ],
            [
                8720,
                8996
            ],
            [
                8996,
                9248
            ],
            [
                9248,
                9350
            ],
            [
                9350,
                9590
            ],
            [
                9590,
                9850
            ],
            [
                9850,
                10152
            ],
            [
                10152,
                10195
            ],
            [
                10195,
                10310
            ],
            [
                10310,
                10534
            ],
            [
                10534,
                10819
            ],
            [
                10819,
                10883
            ],
            [
                10883,
                11286
            ],
            [
                11286,
                11479
            ],
            [
                11479,
                11631
            ],
            [
                11631,
                11770
            ],
            [
                11770,
                12054
            ],
            [
                12054,
                12114
            ],
            [
                12114,
                12428
            ],
            [
                12428,
                12713
            ],
            [
                12713,
                12864
            ],
            [
                12864,
                13040
            ],
            [
                13040,
                13165
            ],
            [
                13165,
                13275
            ],
            [
                13275,
                13377
            ],
            [
                13377,
                13562
            ],
            [
                13562,
                13754
            ],
            [
                13754,
                13875
            ],
            [
                13875,
                14034
            ],
            [
                14034,
                14209
            ],
            [
                14209,
                14253
            ],
            [
                14253,
                14319
            ],
            [
                14319,
                14394
            ],
            [
                14394,
                14492
            ],
            [
                14492,
                14830
            ],
            [
                14830,
                15111
            ],
            [
                15111,
                15169
            ],
            [
                15169,
                15368
            ],
            [
                15368,
                15448
            ],
            [
                15448,
                15481
            ],
            [
                15481,
                15829
            ],
            [
                15829,
                16037
            ],
            [
                16037,
                16406
            ],
            [
                16406,
                16618
            ],
            [
                16618,
                16797
            ],
            [
                16797,
                17171
            ],
            [
                17171,
                17421
            ],
            [
                17421,
                17563
            ],
            [
                17563,
                17891
            ],
            [
                17891,
                17917
            ],
            [
                17917,
                18389
            ],
            [
                18389,
                18484
            ],
            [
                18484,
                18779
            ],
            [
                18779,
                19052
            ],
            [
                19052,
                19354
            ],
            [
                19354,
                19524
            ],
            [
                19524,
                19844
            ],
            [
                19844,
                20063
            ],
            [
                20063,
                20227
            ],
            [
                20227,
                20529
            ],
            [
                20529,
                20658
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                26,
                95
            ],
            [
                255,
                257
            ],
            [
                257,
                272
            ],
            [
                286,
                347
            ],
            [
                354,
                434
            ],
            [
                434,
                447
            ],
            [
                451,
                685
            ],
            [
                686,
                754
            ],
            [
                798,
                809
            ],
            [
                823,
                863
            ],
            [
                880,
                956
            ],
            [
                997,
                1097
            ],
            [
                1097,
                1135
            ],
            [
                1189,
                1210
            ],
            [
                1232,
                1298
            ],
            [
                1322,
                1386
            ],
            [
                1386,
                1473
            ],
            [
                1550,
                1552
            ],
            [
                1552,
                1555
            ],
            [
                1645,
                1692
            ],
            [
                1699,
                1740
            ],
            [
                1746,
                1801
            ],
            [
                1801,
                1845
            ],
            [
                1851,
                1878
            ],
            [
                1889,
                1925
            ],
            [
                1941,
                1966
            ],
            [
                1979,
                1980
            ],
            [
                1970,
                1978
            ],
            [
                1981,
                2011
            ],
            [
                2062,
                2063
            ],
            [
                2068,
                2107
            ],
            [
                2012,
                2014
            ],
            [
                2121,
                2146
            ],
            [
                2146,
                2211
            ],
            [
                2211,
                2228
            ],
            [
                2234,
                2251
            ],
            [
                2256,
                2269
            ],
            [
                2270,
                2327
            ],
            [
                2327,
                2493
            ],
            [
                2493,
                2632
            ],
            [
                2652,
                2686
            ],
            [
                2704,
                2800
            ],
            [
                2800,
                2839
            ],
            [
                2855,
                2863
            ],
            [
                2868,
                2870
            ],
            [
                3172,
                3212
            ],
            [
                2913,
                2915
            ],
            [
                3128,
                3143
            ],
            [
                3213,
                3246
            ],
            [
                3289,
                3333
            ],
            [
                3333,
                3423
            ],
            [
                3423,
                3510
            ],
            [
                3586,
                3588
            ],
            [
                3588,
                3589
            ],
            [
                3595,
                3827
            ],
            [
                3829,
                3832
            ],
            [
                3834,
                3842
            ],
            [
                3960,
                3963
            ],
            [
                3963,
                3976
            ],
            [
                3984,
                3997
            ],
            [
                4037,
                4090
            ],
            [
                4146,
                4148
            ],
            [
                4148,
                4181
            ],
            [
                4210,
                4232
            ],
            [
                4232,
                4325
            ],
            [
                4348,
                4365
            ],
            [
                4337,
                4344
            ],
            [
                4329,
                4336
            ],
            [
                4366,
                4379
            ],
            [
                4345,
                4347
            ],
            [
                4401,
                4436
            ],
            [
                4455,
                4473
            ],
            [
                4496,
                4498
            ],
            [
                4809,
                4810
            ],
            [
                4543,
                4600
            ],
            [
                4692,
                4698
            ],
            [
                4726,
                4788
            ],
            [
                4795,
                4809
            ],
            [
                4943,
                4945
            ],
            [
                4945,
                4950
            ],
            [
                4984,
                5123
            ],
            [
                5123,
                5240
            ],
            [
                5252,
                5254
            ],
            [
                5254,
                5271
            ],
            [
                5318,
                5435
            ],
            [
                5441,
                5476
            ],
            [
                5482,
                5528
            ],
            [
                5536,
                5646
            ],
            [
                5646,
                5711
            ],
            [
                5711,
                5735
            ],
            [
                5764,
                5849
            ],
            [
                6067,
                6068
            ],
            [
                5873,
                5889
            ],
            [
                5744,
                5746
            ],
            [
                5898,
                5925
            ],
            [
                6069,
                6123
            ],
            [
                6124,
                6154
            ],
            [
                6159,
                6331
            ],
            [
                6331,
                6439
            ],
            [
                6439,
                6488
            ],
            [
                6535,
                6565
            ],
            [
                6565,
                6578
            ],
            [
                6578,
                6609
            ],
            [
                6609,
                6653
            ],
            [
                6653,
                6723
            ],
            [
                6799,
                6871
            ],
            [
                6885,
                6894
            ],
            [
                6901,
                6933
            ],
            [
                6953,
                6975
            ],
            [
                6986,
                7000
            ],
            [
                7008,
                7033
            ],
            [
                7033,
                7058
            ],
            [
                7058,
                7270
            ],
            [
                7270,
                7320
            ],
            [
                7325,
                7359
            ],
            [
                7359,
                7361
            ],
            [
                7382,
                7397
            ],
            [
                7454,
                7523
            ],
            [
                7523,
                7587
            ],
            [
                7587,
                7647
            ],
            [
                7662,
                7668
            ],
            [
                7745,
                7747
            ],
            [
                7747,
                7835
            ],
            [
                7842,
                7845
            ],
            [
                7845,
                7890
            ],
            [
                7890,
                7894
            ],
            [
                7920,
                7937
            ],
            [
                7939,
                7942
            ],
            [
                7944,
                7961
            ],
            [
                7961,
                7989
            ],
            [
                7989,
                8038
            ],
            [
                8057,
                8077
            ],
            [
                8077,
                8139
            ],
            [
                8164,
                8217
            ],
            [
                8217,
                8263
            ],
            [
                8263,
                8276
            ],
            [
                8276,
                8302
            ],
            [
                8302,
                8370
            ],
            [
                8415,
                8418
            ],
            [
                8418,
                8457
            ],
            [
                8457,
                8462
            ],
            [
                8488,
                8589
            ],
            [
                8589,
                8601
            ],
            [
                8601,
                8641
            ],
            [
                8641,
                8645
            ],
            [
                8679,
                8720
            ],
            [
                8720,
                8725
            ],
            [
                8757,
                8933
            ],
            [
                8942,
                8970
            ],
            [
                8980,
                8996
            ],
            [
                8996,
                8998
            ],
            [
                9049,
                9062
            ],
            [
                9122,
                9127
            ],
            [
                9181,
                9226
            ],
            [
                9246,
                9248
            ],
            [
                9248,
                9286
            ],
            [
                9291,
                9350
            ],
            [
                9350,
                9357
            ],
            [
                9450,
                9465
            ],
            [
                9472,
                9504
            ],
            [
                9446,
                9449
            ],
            [
                9511,
                9520
            ],
            [
                9532,
                9590
            ],
            [
                9590,
                9616
            ],
            [
                9642,
                9698
            ],
            [
                9706,
                9732
            ],
            [
                9751,
                9754
            ],
            [
                9834,
                9848
            ],
            [
                9616,
                9617
            ],
            [
                9733,
                9735
            ],
            [
                10036,
                10044
            ],
            [
                10072,
                10152
            ],
            [
                10152,
                10195
            ],
            [
                10195,
                10310
            ],
            [
                10310,
                10371
            ],
            [
                10532,
                10534
            ],
            [
                10697,
                10714
            ],
            [
                10726,
                10792
            ],
            [
                10802,
                10807
            ],
            [
                10798,
                10801
            ],
            [
                10813,
                10819
            ],
            [
                10819,
                10883
            ],
            [
                10970,
                10985
            ],
            [
                10998,
                11099
            ],
            [
                11110,
                11126
            ],
            [
                11248,
                11286
            ],
            [
                11286,
                11311
            ],
            [
                11319,
                11479
            ],
            [
                11479,
                11544
            ],
            [
                11566,
                11631
            ],
            [
                11631,
                11698
            ],
            [
                11709,
                11770
            ],
            [
                11770,
                11907
            ],
            [
                11915,
                11927
            ],
            [
                11941,
                11974
            ],
            [
                11984,
                11993
            ],
            [
                12005,
                12054
            ],
            [
                12054,
                12055
            ],
            [
                12061,
                12071
            ],
            [
                12076,
                12105
            ],
            [
                12107,
                12111
            ],
            [
                12191,
                12404
            ],
            [
                12426,
                12427
            ],
            [
                12428,
                12502
            ],
            [
                12520,
                12556
            ],
            [
                12593,
                12661
            ],
            [
                12674,
                12713
            ],
            [
                12713,
                12746
            ],
            [
                12747,
                12819
            ],
            [
                12832,
                12864
            ],
            [
                12864,
                13040
            ],
            [
                13089,
                13101
            ],
            [
                13066,
                13069
            ],
            [
                13116,
                13165
            ],
            [
                13275,
                13321
            ],
            [
                13375,
                13377
            ],
            [
                13377,
                13430
            ],
            [
                13445,
                13480
            ],
            [
                13494,
                13499
            ],
            [
                13485,
                13490
            ],
            [
                13559,
                13562
            ],
            [
                13562,
                13590
            ],
            [
                13594,
                13612
            ],
            [
                13677,
                13754
            ],
            [
                13754,
                13875
            ],
            [
                13968,
                13976
            ],
            [
                14013,
                14034
            ],
            [
                14034,
                14051
            ],
            [
                14103,
                14135
            ],
            [
                14163,
                14209
            ],
            [
                14209,
                14253
            ],
            [
                14253,
                14299
            ],
            [
                14311,
                14319
            ],
            [
                14319,
                14331
            ],
            [
                14341,
                14394
            ],
            [
                14394,
                14442
            ],
            [
                14490,
                14492
            ],
            [
                14492,
                14519
            ],
            [
                14677,
                14682
            ],
            [
                14555,
                14585
            ],
            [
                14542,
                14551
            ],
            [
                14694,
                14750
            ],
            [
                14768,
                14830
            ],
            [
                14830,
                14873
            ],
            [
                14891,
                14919
            ],
            [
                14939,
                14977
            ],
            [
                14999,
                15037
            ],
            [
                15070,
                15111
            ],
            [
                15111,
                15169
            ],
            [
                15169,
                15209
            ],
            [
                15211,
                15250
            ],
            [
                15290,
                15368
            ],
            [
                15368,
                15448
            ],
            [
                15448,
                15481
            ],
            [
                15481,
                15645
            ],
            [
                15646,
                15668
            ],
            [
                15674,
                15686
            ],
            [
                15698,
                15713
            ],
            [
                15729,
                15829
            ],
            [
                15882,
                15891
            ],
            [
                15951,
                15986
            ],
            [
                16008,
                16017
            ],
            [
                16023,
                16037
            ],
            [
                16037,
                16079
            ],
            [
                16098,
                16134
            ],
            [
                16136,
                16140
            ],
            [
                16142,
                16153
            ],
            [
                16269,
                16314
            ],
            [
                16322,
                16342
            ],
            [
                16353,
                16387
            ],
            [
                16403,
                16406
            ],
            [
                16406,
                16492
            ],
            [
                16571,
                16618
            ],
            [
                16618,
                16797
            ],
            [
                16797,
                16857
            ],
            [
                16929,
                16949
            ],
            [
                17002,
                17091
            ],
            [
                17158,
                17161
            ],
            [
                17169,
                17171
            ],
            [
                17171,
                17228
            ],
            [
                17280,
                17301
            ],
            [
                17303,
                17393
            ],
            [
                17394,
                17399
            ],
            [
                17419,
                17421
            ],
            [
                17421,
                17540
            ],
            [
                17545,
                17563
            ],
            [
                17563,
                17576
            ],
            [
                17675,
                17694
            ],
            [
                17706,
                17855
            ],
            [
                17889,
                17891
            ],
            [
                17891,
                17917
            ],
            [
                17990,
                18000
            ],
            [
                18018,
                18062
            ],
            [
                18064,
                18110
            ],
            [
                18120,
                18131
            ],
            [
                18183,
                18194
            ],
            [
                18272,
                18324
            ],
            [
                18387,
                18389
            ],
            [
                18404,
                18408
            ],
            [
                18389,
                18394
            ],
            [
                18410,
                18412
            ],
            [
                18432,
                18484
            ],
            [
                18484,
                18542
            ],
            [
                18562,
                18566
            ],
            [
                18625,
                18638
            ],
            [
                18572,
                18573
            ],
            [
                18639,
                18650
            ],
            [
                18676,
                18735
            ],
            [
                18756,
                18778
            ],
            [
                18779,
                18818
            ],
            [
                18829,
                18870
            ],
            [
                18877,
                18946
            ],
            [
                19015,
                19021
            ],
            [
                19034,
                19052
            ],
            [
                19052,
                19120
            ],
            [
                19130,
                19167
            ],
            [
                19352,
                19354
            ],
            [
                19354,
                19441
            ],
            [
                19522,
                19524
            ],
            [
                19604,
                19617
            ],
            [
                19645,
                19723
            ],
            [
                19793,
                19844
            ],
            [
                19844,
                19887
            ],
            [
                19895,
                19902
            ],
            [
                19903,
                19994
            ],
            [
                20024,
                20032
            ],
            [
                20061,
                20063
            ],
            [
                20063,
                20088
            ],
            [
                20141,
                20144
            ],
            [
                20089,
                20096
            ],
            [
                20145,
                20167
            ],
            [
                20225,
                20227
            ],
            [
                20227,
                20417
            ],
            [
                20527,
                20529
            ],
            [
                20529,
                20658
            ]
        ],
        "row_chars": [
            [
                0,
                257
            ],
            [
                257,
                434
            ],
            [
                434,
                686
            ],
            [
                686,
                1097
            ],
            [
                1097,
                1386
            ],
            [
                1386,
                1552
            ],
            [
                1552,
                1801
            ],
            [
                1801,
                2146
            ],
            [
                2146,
                2211
            ],
            [
                2211,
                2270
            ],
            [
                2270,
                2327
            ],
            [
                2327,
                2493
            ],
            [
                2493,
                2800
            ],
            [
                2800,
                2870
            ],
            [
                2870,
                3333
            ],
            [
                3333,
                3423
            ],
            [
                3423,
                3588
            ],
            [
                3588,
                3963
            ],
            [
                3963,
                4148
            ],
            [
                4148,
                4232
            ],
            [
                4232,
                4325
            ],
            [
                4325,
                4498
            ],
            [
                4498,
                4945
            ],
            [
                4945,
                5123
            ],
            [
                5123,
                5254
            ],
            [
                5254,
                5646
            ],
            [
                5646,
                5711
            ],
            [
                5711,
                6124
            ],
            [
                6124,
                6331
            ],
            [
                6331,
                6439
            ],
            [
                6439,
                6565
            ],
            [
                6565,
                6578
            ],
            [
                6578,
                6609
            ],
            [
                6609,
                6653
            ],
            [
                6653,
                6724
            ],
            [
                6724,
                6799
            ],
            [
                6799,
                7033
            ],
            [
                7033,
                7058
            ],
            [
                7058,
                7270
            ],
            [
                7270,
                7359
            ],
            [
                7359,
                7523
            ],
            [
                7523,
                7587
            ],
            [
                7587,
                7747
            ],
            [
                7747,
                7845
            ],
            [
                7845,
                7890
            ],
            [
                7890,
                7961
            ],
            [
                7961,
                7989
            ],
            [
                7989,
                8077
            ],
            [
                8077,
                8217
            ],
            [
                8217,
                8263
            ],
            [
                8263,
                8276
            ],
            [
                8276,
                8302
            ],
            [
                8302,
                8418
            ],
            [
                8418,
                8457
            ],
            [
                8457,
                8589
            ],
            [
                8589,
                8601
            ],
            [
                8601,
                8641
            ],
            [
                8641,
                8720
            ],
            [
                8720,
                8996
            ],
            [
                8996,
                9248
            ],
            [
                9248,
                9350
            ],
            [
                9350,
                9590
            ],
            [
                9590,
                10152
            ],
            [
                10152,
                10195
            ],
            [
                10195,
                10310
            ],
            [
                10310,
                10534
            ],
            [
                10534,
                10819
            ],
            [
                10819,
                10883
            ],
            [
                10883,
                11286
            ],
            [
                11286,
                11479
            ],
            [
                11479,
                11631
            ],
            [
                11631,
                11770
            ],
            [
                11770,
                12054
            ],
            [
                12054,
                12114
            ],
            [
                12114,
                12428
            ],
            [
                12428,
                12713
            ],
            [
                12713,
                12864
            ],
            [
                12864,
                13040
            ],
            [
                13040,
                13165
            ],
            [
                13165,
                13275
            ],
            [
                13275,
                13377
            ],
            [
                13377,
                13562
            ],
            [
                13562,
                13754
            ],
            [
                13754,
                13875
            ],
            [
                13875,
                14034
            ],
            [
                14034,
                14209
            ],
            [
                14209,
                14253
            ],
            [
                14253,
                14319
            ],
            [
                14319,
                14394
            ],
            [
                14394,
                14492
            ],
            [
                14492,
                14830
            ],
            [
                14830,
                15111
            ],
            [
                15111,
                15169
            ],
            [
                15169,
                15368
            ],
            [
                15368,
                15448
            ],
            [
                15448,
                15481
            ],
            [
                15481,
                15829
            ],
            [
                15829,
                16037
            ],
            [
                16037,
                16406
            ],
            [
                16406,
                16618
            ],
            [
                16618,
                16797
            ],
            [
                16797,
                17171
            ],
            [
                17171,
                17421
            ],
            [
                17421,
                17563
            ],
            [
                17563,
                17891
            ],
            [
                17891,
                17917
            ],
            [
                17917,
                18389
            ],
            [
                18389,
                18484
            ],
            [
                18484,
                18779
            ],
            [
                18779,
                19052
            ],
            [
                19052,
                19354
            ],
            [
                19354,
                19524
            ],
            [
                19524,
                19844
            ],
            [
                19844,
                20063
            ],
            [
                20063,
                20227
            ],
            [
                20227,
                20529
            ],
            [
                20529,
                20658
            ]
        ]
    },
    "abridged": {
        "text": "The little girl made her long journey in safety; and at Northampton was met by Mrs. Norris.\nFanny Price was just ten years old, and though there might not be much in her appearance to captivate, there was, at least, nothing to disgust her relations. She was small for her age, with no glow of complexion, nor any other striking beauty; exceedingly timid and shy, and shrinking from notice; but her air, though awkward, was not vulgar, her voice was sweet, and when she spoke her countenance was pretty.\nSir Thomas and Lady Bertram received her very kindly; and Sir Thomas tried to be conciliating: but he had to work against his gravity of deportment; and Lady Bertram, without taking half so much trouble, by the mere aid of a good-humoured smile, became immediately the less awful character of the two.\nThe young people were all at home, and received Fanny with much good humour, at least on the part of the sons, who, at seventeen and sixteen, had all the grandeur of men in the eyes of their little cousin. The two girls were more at a loss from being younger and in greater awe of their father. But, their confidence increasing from their cousin's want of it, they were soon able to take a survey of her face and her frock in easy indifference.\nThey were a remarkably fine family, the sons well-looking, the daughters handsome, and all of them well-grown for their age, which produced a striking difference between the cousins; no one would have supposed the girls so close in age as they really were. There were in fact but two years between the youngest and Fanny. Julia Bertram was twelve, and Maria a year older.\nThe little visitor meanwhile was as unhappy as possible. Afraid of everybody, ashamed of herself, and longing for the home she had left, she knew not how to look up, and could scarcely speak to be heard, or without crying. Mrs. Norris had been talking to her the whole way from Northampton of her wonderful good fortune, and the extraordinary degree of gratitude which it ought to produce, and her misery was therefore increased by the idea of its being a wicked thing for her not to be happy. The fatigue, too, of so long a journey, was not trifling. She could scarcely swallow two mouthfuls of gooseberry tart before tears interrupted her, and she was taken to finish her sorrows in bed.\n\"This is not a very promising beginning,\" said Mrs. Norris, when Fanny had left the room. \"After all that I said to her as we came along, I thought she would have behaved better. I hope there may not be a little sulkiness of temper-her poor mother had a good deal; but we must make allowances for such a child-and I do not know that her being sorry to leave her home is really against her, for, with all its faults, it was her home.\"\nIt required a long time, however, to reconcile Fanny to the novelty of Mansfield Park. Her feelings were very acute, and not properly attended to. Nobody meant to be unkind, but nobody put themselves out of their way to secure her comfort.\nThe Miss Bertrams were allowed a holiday the next day, to give them leisure for getting acquainted with their young cousin. However, having found that she had but two sashes, and had never learned French, they made her a generous present of some of their least valued toys, and left her to herself.\nFanny, whether in the schoolroom, the drawing-room, or the shrubbery, was equally forlorn, finding something to fear in every person and place. She was disheartened by Lady Bertram's silence, awed by Sir Thomas's grave looks, and quite overcome by Mrs. Norris's scoldings. Her elder cousins abashed her by noticing her shyness: Miss Lee wondered at her ignorance, and the maid-servants sneered at her clothes. When to these sorrows was added the memory of the brothers and sisters among whom she had been important as playfellow, instructress, and nurse, the despondence that sunk her little heart was severe.\nThe grandeur of the house astonished, but could not console her. The rooms were too large: whatever she touched she expected to injure, and she crept about in constant terror, often retreating to her own chamber to cry; and ended every day's sorrows by sobbing herself to sleep.\nA week had passed in this way, with no suspicion of it conveyed by her quiet passive manner, when she was found one morning by her cousin Edmund, the youngest of the sons, sitting crying on the attic stairs.\n\"My dear little cousin,\" said he, with all the gentleness of an excellent nature, \"what can be the matter?\" And sitting down by her, he was at great pains to persuade her to speak openly. Was she ill? or was anybody angry with her? or had she quarrelled with Maria and Julia? or was she puzzled about anything in her lesson that he could explain?\nFor a long while no answer could be obtained beyond a \"no, no-not at all\"; but he persevered; and no sooner had he mentioned her own home, than her sobs explained where the grievance lay. He tried to console her.\n\"You are sorry to leave Mama, my dear little Fanny,\" said he, \"which shows you to be a very good girl; but you must remember that you are with relations and friends, who all love you, and wish to make you happy. Let us walk out in the park, and you shall tell me about your brothers and sisters.\"\nOn doing this, he found that there was one among them who ran more in her thoughts than the rest. It was William whom she talked of most, and wanted most to see. William, the eldest, a year older than herself, her constant friend. \"William did not like she should come away; he had told her he should miss her very much.\" \"But William will write to you, I dare say.\" \"Yes, but he had told her to write first.\" \"And when shall you do it?\" She hung her head and answered hesitatingly, \"she had not any paper.\"\n\"If that be all your difficulty, I will furnish you with paper, and you may write your letter whenever you choose. Would it make you happy to write to William?\"\n\"Yes, very.\"\n\"Then let it be done now. Come with me into the breakfast-room, we shall find everything there.\"\n\"But, cousin, will it go to the post?\"\n\"Yes, it shall go with the other letters; and, as your uncle will frank it, it will cost William nothing.\"\n\"My uncle!\" repeated Fanny, with a frightened look.\n\"Yes, I will take it to my father to frank.\"\nFanny offered no further resistance; and they went together into the breakfast-room, where Edmund prepared her paper, and ruled her lines with all the goodwill that her brother could have felt, and probably with more exactness. He stayed to assist her; and showed a kindness to her brother which delighted her. He wrote with his own hand his love to cousin William, and sent him half a guinea under the seal. Fanny's countenance and artless words fully conveyed all her gratitude, and her cousin began to find her an interesting object. He talked to her more, and was convinced of her having an affectionate heart, and a desire of doing right; and perceiving her great timidity, he gave her much good advice as to playing with Maria and Julia, and being as merry as possible.\nFrom this day Fanny grew more comfortable. She felt that she had a friend, and the kindness of her cousin Edmund gave her better spirits with everybody else. The place became less strange, and the people less formidable. She was no longer afraid to appear before her uncle, nor did her aunt Norris's voice startle her so much. To her cousins she became occasionally an acceptable companion. Their pleasures were sometimes of a nature to make a third very useful, especially when that third was of an obliging temper; and they owned that \"Fanny was good-natured enough.\"\nEdmund was uniformly kind; and she had nothing worse to endure on the part of Tom than that sort of merriment which a young man of seventeen will always think fair with a child of ten. He was just entering into life, full of spirits, and with all the liberality of an eldest son, who feels born only for expense and enjoyment. His kindness to his little cousin was consistent with his situation: he made her some very pretty presents, and laughed at her.\nAs her appearance and spirits improved, Sir Thomas and Mrs. Norris thought with greater satisfaction of their benevolent plan; and it was soon decided that, though far from clever, she was tractable, and seemed likely to give them little trouble. A poor opinion of Fanny's abilities was not confined to them. As her cousins found her ignorant of many things with which they had been long familiar, they thought her prodigiously stupid, and for the first two or three weeks were continually bringing some fresh report of it.\n\"Dear mama, only think, my cousin cannot put the map of Europe together-or tell the principal rivers in Russia-she does not know the difference between water-colours and crayons!-Did you ever hear anything so stupid?\"\n\"My dear,\" their considerate aunt Norris would reply, \"it is very bad, but you must not expect everybody to be as quick at learning as yourself.\"\n\"But, aunt, she is really so very ignorant!-Do you know, we asked her last night which way she would go to get to Ireland; and she said, she should cross to the Isle of Wight. She calls it the Island, as if there were no other island in the world. I cannot remember the time when I did not know much more than her. How long ago it is, aunt, since we used to repeat the order of the kings of England, with their dates!\"\n\"Yes,\" added the other; \"and the Roman emperors, and all the metals, semi-metals, planets, and distinguished philosophers.\"\n\"Very true indeed, my dears, but you are blessed with wonderful memories, and your poor cousin has probably none at all. You must pity her deficiency. And remember that you should always be modest; for there is a great deal more for you to learn.\"\n\"Yes, I know there is, till I am seventeen. But I must tell you another thing of Fanny, so stupid. Do you know, she does not want to learn either music or drawing.\"\n\"To be sure, my dear, that is very stupid indeed. But, all things considered, it is well that it should be so, for it is not necessary that she should be as accomplished as you are; it is much more desirable that there should be a difference.\"\nSuch were the counsels by which Mrs. Norris formed her nieces' minds; and it is no wonder that, with all their promising talents, they should be entirely deficient in self-knowledge, generosity and humility. In everything but disposition they were admirably taught. Sir Thomas did not know what was wanting because, though a truly anxious father, the reserve of his manner repressed all the flow of their spirits before him.\nTo the education of her daughters Lady Bertram paid not the smallest attention. She had not time for such cares. She was a woman who spent her days in sitting, nicely dressed, on a sofa, doing some long piece of needlework, of little use and no beauty, thinking more of her pug dog than her children, but indulgent to them when it did not cause her inconvenience, guided in everything important by Sir Thomas, and in smaller concerns by her sister. Her girls were under the care of a governess, and could need nothing more. As for Fanny's being stupid at learning, \"it was very unlucky, but some people were stupid, and she saw no harm in the poor little thing, and found her very handy in carrying messages, and fetching things.\"\nFanny, with all her faults of ignorance and timidity, was fixed at Mansfield Park, and grew up there not unhappily among her cousins. There was no positive ill-nature in Maria or Julia; and though Fanny was often mortified by their treatment of her, she thought too lowly of her own claims to feel injured by it.\nFrom about the time of her entering the family, Lady Bertram gave up the house in London, and remained wholly in the country, leaving Sir Thomas to attend his duty in Parliament without her. In the country, therefore, the Miss Bertrams continued to grow tall and womanly; and their father saw them becoming in person, manner, and accomplishments, everything that he could wish. His eldest son was careless and extravagant, and had already given him much uneasiness; but his other children promised nothing but good. His daughters, he trusted, would make respectable alliances; and the character of Edmund, his strong good sense and uprightness of mind, bid most fairly for utility, honour, and happiness. He was to be a clergyman.\nSir Thomas did what he could for the children of Mrs. Price. He assisted her liberally in the education and careers of her sons; and Fanny had true satisfaction in hearing of any kindness towards them. Only once, in those years, had she the happiness of being with William. Of the rest she saw nothing: nobody seemed to think of her visiting them; but William, determining to be a sailor, was invited to spend a week with his sister before he went to sea.\nTheir eager affection in meeting, their delight in being together, their hours of mirth, and moments of serious conference, may be imagined; as well as her misery when he left her. Luckily the visit happened in the Christmas holidays, when she could look for comfort to her cousin Edmund. Edmund's friendship never failed her: his leaving Eton for Oxford made no change in his kindness. He was always considerate of her feelings, trying to make her good qualities understood, and giving her advice, consolation, and encouragement.\nKept back as she was by everybody else, his support alone could not bring her forward; but his attentions were otherwise of the highest importance in improving her mind. He knew her to be clever, and to have a fondness for reading. Miss Lee taught her French, and heard her read the daily portion of history; but he recommended the books which charmed her leisure hours, he encouraged her taste, and corrected her judgment. In return for such services she loved him better than anybody in the world except William: her heart was divided between the two.",
        "paragraph_chars": [
            [
                0,
                92
            ],
            [
                92,
                503
            ],
            [
                503,
                805
            ],
            [
                805,
                1250
            ],
            [
                1250,
                1622
            ],
            [
                1622,
                2312
            ],
            [
                2312,
                2746
            ],
            [
                2746,
                2986
            ],
            [
                2986,
                3285
            ],
            [
                3285,
                3895
            ],
            [
                3895,
                4174
            ],
            [
                4174,
                4382
            ],
            [
                4382,
                4729
            ],
            [
                4729,
                4942
            ],
            [
                4942,
                5239
            ],
            [
                5239,
                5747
            ],
            [
                5747,
                5908
            ],
            [
                5908,
                5921
            ],
            [
                5921,
                6018
            ],
            [
                6018,
                6057
            ],
            [
                6057,
                6164
            ],
            [
                6164,
                6216
            ],
            [
                6216,
                6261
            ],
            [
                6261,
                7037
            ],
            [
                7037,
                7607
            ],
            [
                7607,
                8062
            ],
            [
                8062,
                8586
            ],
            [
                8586,
                8804
            ],
            [
                8804,
                8950
            ],
            [
                8950,
                9369
            ],
            [
                9369,
                9493
            ],
            [
                9493,
                9741
            ],
            [
                9741,
                9906
            ],
            [
                9906,
                10150
            ],
            [
                10150,
                10575
            ],
            [
                10575,
                11306
            ],
            [
                11306,
                11619
            ],
            [
                11619,
                12350
            ],
            [
                12350,
                12806
            ],
            [
                12806,
                13337
            ],
            [
                13337,
                13890
            ]
        ],
        "segment_chars": [
            [
                0,
                92
            ],
            [
                92,
                250
            ],
            [
                250,
                503
            ],
            [
                503,
                805
            ],
            [
                805,
                1011
            ],
            [
                1011,
                1100
            ],
            [
                1100,
                1250
            ],
            [
                1250,
                1507
            ],
            [
                1507,
                1572
            ],
            [
                1572,
                1622
            ],
            [
                1622,
                1679
            ],
            [
                1679,
                1845
            ],
            [
                1845,
                2116
            ],
            [
                2116,
                2174
            ],
            [
                2174,
                2312
            ],
            [
                2312,
                2402
            ],
            [
                2402,
                2491
            ],
            [
                2491,
                2746
            ],
            [
                2746,
                2833
            ],
            [
                2833,
                2893
            ],
            [
                2893,
                2986
            ],
            [
                2986,
                3110
            ],
            [
                3110,
                3285
            ],
            [
                3285,
                3429
            ],
            [
                3429,
                3558
            ],
            [
                3558,
                3695
            ],
            [
                3695,
                3895
            ],
            [
                3895,
                3960
            ],
            [
                3960,
                4174
            ],
            [
                4174,
                4382
            ],
            [
                4382,
                4490
            ],
            [
                4490,
                4570
            ],
            [
                4570,
                4583
            ],
            [
                4583,
                4614
            ],
            [
                4614,
                4658
            ],
            [
                4658,
                4729
            ],
            [
                4729,
                4917
            ],
            [
                4917,
                4942
            ],
            [
                4942,
                5154
            ],
            [
                5154,
                5239
            ],
            [
                5239,
                5337
            ],
            [
                5337,
                5401
            ],
            [
                5401,
                5470
            ],
            [
                5470,
                5561
            ],
            [
                5561,
                5606
            ],
            [
                5606,
                5649
            ],
            [
                5649,
                5677
            ],
            [
                5677,
                5747
            ],
            [
                5747,
                5862
            ],
            [
                5862,
                5908
            ],
            [
                5908,
                5921
            ],
            [
                5921,
                5947
            ],
            [
                5947,
                6018
            ],
            [
                6018,
                6057
            ],
            [
                6057,
                6164
            ],
            [
                6164,
                6176
            ],
            [
                6176,
                6216
            ],
            [
                6216,
                6261
            ],
            [
                6261,
                6489
            ],
            [
                6489,
                6572
            ],
            [
                6572,
                6670
            ],
            [
                6670,
                6798
            ],
            [
                6798,
                7037
            ],
            [
                7037,
                7080
            ],
            [
                7080,
                7195
            ],
            [
                7195,
                7258
            ],
            [
                7258,
                7364
            ],
            [
                7364,
                7428
            ],
            [
                7428,
                7607
            ],
            [
                7607,
                7792
            ],
            [
                7792,
                7934
            ],
            [
                7934,
                8062
            ],
            [
                8062,
                8309
            ],
            [
                8309,
                8371
            ],
            [
                8371,
                8586
            ],
            [
                8586,
                8804
            ],
            [
                8804,
                8950
            ],
            [
                8950,
                9126
            ],
            [
                9126,
                9198
            ],
            [
                9198,
                9265
            ],
            [
                9265,
                9369
            ],
            [
                9369,
                9493
            ],
            [
                9493,
                9614
            ],
            [
                9614,
                9644
            ],
            [
                9644,
                9741
            ],
            [
                9741,
                9785
            ],
            [
                9785,
                9840
            ],
            [
                9840,
                9906
            ],
            [
                9906,
                9956
            ],
            [
                9956,
                10150
            ],
            [
                10150,
                10358
            ],
            [
                10358,
                10416
            ],
            [
                10416,
                10575
            ],
            [
                10575,
                10655
            ],
            [
                10655,
                10688
            ],
            [
                10688,
                11024
            ],
            [
                11024,
                11099
            ],
            [
                11099,
                11306
            ],
            [
                11306,
                11440
            ],
            [
                11440,
                11619
            ],
            [
                11619,
                11810
            ],
            [
                11810,
                11997
            ],
            [
                11997,
                12135
            ],
            [
                12135,
                12324
            ],
            [
                12324,
                12350
            ],
            [
                12350,
                12411
            ],
            [
                12411,
                12552
            ],
            [
                12552,
                12624
            ],
            [
                12624,
                12806
            ],
            [
                12806,
                12987
            ],
            [
                12987,
                13095
            ],
            [
                13095,
                13193
            ],
            [
                13193,
                13337
            ],
            [
                13337,
                13507
            ],
            [
                13507,
                13569
            ],
            [
                13569,
                13761
            ],
            [
                13761,
                13890
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                21,
                90
            ],
            [
                90,
                92
            ],
            [
                92,
                107
            ],
            [
                108,
                169
            ],
            [
                170,
                250
            ],
            [
                250,
                263
            ],
            [
                268,
                502
            ],
            [
                503,
                571
            ],
            [
                572,
                583
            ],
            [
                584,
                624
            ],
            [
                629,
                705
            ],
            [
                705,
                805
            ],
            [
                805,
                843
            ],
            [
                859,
                880
            ],
            [
                880,
                946
            ],
            [
                947,
                1011
            ],
            [
                1011,
                1098
            ],
            [
                1098,
                1100
            ],
            [
                1100,
                1103
            ],
            [
                1105,
                1152
            ],
            [
                1153,
                1194
            ],
            [
                1195,
                1250
            ],
            [
                1250,
                1294
            ],
            [
                1295,
                1322
            ],
            [
                1323,
                1359
            ],
            [
                1364,
                1389
            ],
            [
                1390,
                1391
            ],
            [
                1392,
                1400
            ],
            [
                1401,
                1431
            ],
            [
                1431,
                1432
            ],
            [
                1433,
                1472
            ],
            [
                1479,
                1481
            ],
            [
                1482,
                1507
            ],
            [
                1507,
                1572
            ],
            [
                1572,
                1589
            ],
            [
                1590,
                1607
            ],
            [
                1608,
                1621
            ],
            [
                1622,
                1679
            ],
            [
                1679,
                1845
            ],
            [
                1845,
                1984
            ],
            [
                1985,
                2019
            ],
            [
                2020,
                2116
            ],
            [
                2116,
                2155
            ],
            [
                2164,
                2172
            ],
            [
                2172,
                2174
            ],
            [
                2174,
                2214
            ],
            [
                2215,
                2217
            ],
            [
                2218,
                2233
            ],
            [
                2234,
                2267
            ],
            [
                2268,
                2312
            ],
            [
                2312,
                2402
            ],
            [
                2402,
                2489
            ],
            [
                2489,
                2491
            ],
            [
                2491,
                2492
            ],
            [
                2498,
                2730
            ],
            [
                2731,
                2734
            ],
            [
                2735,
                2743
            ],
            [
                2743,
                2746
            ],
            [
                2746,
                2759
            ],
            [
                2765,
                2778
            ],
            [
                2778,
                2831
            ],
            [
                2831,
                2833
            ],
            [
                2833,
                2866
            ],
            [
                2871,
                2893
            ],
            [
                2893,
                2986
            ],
            [
                2986,
                3003
            ],
            [
                3009,
                3016
            ],
            [
                3019,
                3026
            ],
            [
                3027,
                3040
            ],
            [
                3041,
                3043
            ],
            [
                3054,
                3089
            ],
            [
                3090,
                3108
            ],
            [
                3108,
                3110
            ],
            [
                3117,
                3118
            ],
            [
                3132,
                3189
            ],
            [
                3189,
                3195
            ],
            [
                3201,
                3263
            ],
            [
                3269,
                3283
            ],
            [
                3283,
                3285
            ],
            [
                3285,
                3290
            ],
            [
                3290,
                3429
            ],
            [
                3429,
                3546
            ],
            [
                3556,
                3558
            ],
            [
                3558,
                3575
            ],
            [
                3576,
                3693
            ],
            [
                3695,
                3730
            ],
            [
                3738,
                3784
            ],
            [
                3785,
                3895
            ],
            [
                3895,
                3960
            ],
            [
                3960,
                3984
            ],
            [
                3984,
                4069
            ],
            [
                4069,
                4070
            ],
            [
                4071,
                4087
            ],
            [
                4088,
                4090
            ],
            [
                4091,
                4118
            ],
            [
                4119,
                4173
            ],
            [
                4174,
                4204
            ],
            [
                4210,
                4382
            ],
            [
                4382,
                4490
            ],
            [
                4490,
                4539
            ],
            [
                4540,
                4570
            ],
            [
                4570,
                4583
            ],
            [
                4583,
                4614
            ],
            [
                4614,
                4658
            ],
            [
                4658,
                4728
            ],
            [
                4729,
                4801
            ],
            [
                4801,
                4810
            ],
            [
                4811,
                4843
            ],
            [
                4854,
                4876
            ],
            [
                4877,
                4891
            ],
            [
                4892,
                4917
            ],
            [
                4917,
                4942
            ],
            [
                4942,
                5154
            ],
            [
                5154,
                5204
            ],
            [
                5205,
                5239
            ],
            [
                5239,
                5241
            ],
            [
                5252,
                5267
            ],
            [
                5268,
                5337
            ],
            [
                5337,
                5401
            ],
            [
                5401,
                5461
            ],
            [
                5462,
                5468
            ],
            [
                5468,
                5470
            ],
            [
                5470,
                5558
            ],
            [
                5558,
                5561
            ],
            [
                5561,
                5606
            ],
            [
                5606,
                5610
            ],
            [
                5610,
                5627
            ],
            [
                5628,
                5631
            ],
            [
                5632,
                5649
            ],
            [
                5649,
                5677
            ],
            [
                5677,
                5726
            ],
            [
                5727,
                5747
            ],
            [
                5747,
                5809
            ],
            [
                5809,
                5862
            ],
            [
                5862,
                5908
            ],
            [
                5908,
                5921
            ],
            [
                5921,
                5947
            ],
            [
                5947,
                6015
            ],
            [
                6015,
                6018
            ],
            [
                6018,
                6057
            ],
            [
                6057,
                6062
            ],
            [
                6063,
                6164
            ],
            [
                6164,
                6176
            ],
            [
                6176,
                6216
            ],
            [
                6216,
                6220
            ],
            [
                6220,
                6261
            ],
            [
                6261,
                6266
            ],
            [
                6267,
                6443
            ],
            [
                6444,
                6472
            ],
            [
                6473,
                6489
            ],
            [
                6489,
                6491
            ],
            [
                6499,
                6512
            ],
            [
                6512,
                6517
            ],
            [
                6525,
                6570
            ],
            [
                6570,
                6572
            ],
            [
                6572,
                6610
            ],
            [
                6611,
                6670
            ],
            [
                6670,
                6677
            ],
            [
                6678,
                6693
            ],
            [
                6694,
                6726
            ],
            [
                6727,
                6730
            ],
            [
                6731,
                6740
            ],
            [
                6740,
                6798
            ],
            [
                6798,
                6824
            ],
            [
                6825,
                6881
            ],
            [
                6882,
                6908
            ],
            [
                6920,
                6923
            ],
            [
                6924,
                6938
            ],
            [
                6938,
                6939
            ],
            [
                6940,
                6942
            ],
            [
                6943,
                6951
            ],
            [
                6957,
                7037
            ],
            [
                7037,
                7080
            ],
            [
                7080,
                7195
            ],
            [
                7195,
                7256
            ],
            [
                7256,
                7258
            ],
            [
                7258,
                7275
            ],
            [
                7276,
                7342
            ],
            [
                7343,
                7348
            ],
            [
                7351,
                7354
            ],
            [
                7358,
                7364
            ],
            [
                7364,
                7428
            ],
            [
                7428,
                7443
            ],
            [
                7444,
                7545
            ],
            [
                7546,
                7562
            ],
            [
                7569,
                7607
            ],
            [
                7607,
                7632
            ],
            [
                7632,
                7792
            ],
            [
                7792,
                7857
            ],
            [
                7869,
                7934
            ],
            [
                7934,
                8001
            ],
            [
                8001,
                8062
            ],
            [
                8062,
                8199
            ],
            [
                8200,
                8212
            ],
            [
                8213,
                8246
            ],
            [
                8251,
                8260
            ],
            [
                8260,
                8309
            ],
            [
                8309,
                8310
            ],
            [
                8316,
                8326
            ],
            [
                8335,
                8364
            ],
            [
                8365,
                8369
            ],
            [
                8371,
                8584
            ],
            [
                8584,
                8585
            ],
            [
                8586,
                8660
            ],
            [
                8661,
                8697
            ],
            [
                8697,
                8765
            ],
            [
                8765,
                8804
            ],
            [
                8804,
                8837
            ],
            [
                8845,
                8917
            ],
            [
                8918,
                8950
            ],
            [
                8950,
                9126
            ],
            [
                9126,
                9138
            ],
            [
                9139,
                9142
            ],
            [
                9149,
                9198
            ],
            [
                9198,
                9244
            ],
            [
                9263,
                9265
            ],
            [
                9265,
                9318
            ],
            [
                9319,
                9354
            ],
            [
                9355,
                9360
            ],
            [
                9361,
                9366
            ],
            [
                9366,
                9369
            ],
            [
                9369,
                9397
            ],
            [
                9398,
                9416
            ],
            [
                9416,
                9493
            ],
            [
                9493,
                9614
            ],
            [
                9614,
                9622
            ],
            [
                9623,
                9644
            ],
            [
                9644,
                9661
            ],
            [
                9662,
                9694
            ],
            [
                9695,
                9741
            ],
            [
                9741,
                9785
            ],
            [
                9785,
                9831
            ],
            [
                9832,
                9840
            ],
            [
                9840,
                9852
            ],
            [
                9853,
                9906
            ],
            [
                9906,
                9954
            ],
            [
                9954,
                9956
            ],
            [
                9956,
                9983
            ],
            [
                9984,
                9989
            ],
            [
                9990,
                10020
            ],
            [
                10021,
                10030
            ],
            [
                10031,
                10087
            ],
            [
                10088,
                10150
            ],
            [
                10150,
                10193
            ],
            [
                10201,
                10229
            ],
            [
                10240,
                10278
            ],
            [
                10278,
                10316
            ],
            [
                10317,
                10358
            ],
            [
                10358,
                10416
            ],
            [
                10416,
                10456
            ],
            [
                10457,
                10496
            ],
            [
                10497,
                10575
            ],
            [
                10575,
                10655
            ],
            [
                10655,
                10688
            ],
            [
                10688,
                10852
            ],
            [
                10857,
                10879
            ],
            [
                10880,
                10892
            ],
            [
                10898,
                10913
            ],
            [
                10924,
                11024
            ],
            [
                11024,
                11033
            ],
            [
                11034,
                11069
            ],
            [
                11070,
                11079
            ],
            [
                11085,
                11099
            ],
            [
                11099,
                11141
            ],
            [
                11141,
                11177
            ],
            [
                11178,
                11182
            ],
            [
                11183,
                11194
            ],
            [
                11195,
                11240
            ],
            [
                11241,
                11261
            ],
            [
                11262,
                11296
            ],
            [
                11303,
                11306
            ],
            [
                11306,
                11392
            ],
            [
                11393,
                11440
            ],
            [
                11440,
                11619
            ],
            [
                11619,
                11679
            ],
            [
                11680,
                11700
            ],
            [
                11707,
                11796
            ],
            [
                11805,
                11808
            ],
            [
                11808,
                11810
            ],
            [
                11810,
                11867
            ],
            [
                11868,
                11889
            ],
            [
                11891,
                11981
            ],
            [
                11985,
                11990
            ],
            [
                11995,
                11997
            ],
            [
                11997,
                12116
            ],
            [
                12117,
                12135
            ],
            [
                12135,
                12148
            ],
            [
                12148,
                12167
            ],
            [
                12173,
                12322
            ],
            [
                12322,
                12324
            ],
            [
                12324,
                12350
            ],
            [
                12354,
                12364
            ],
            [
                12365,
                12409
            ],
            [
                12411,
                12457
            ],
            [
                12466,
                12477
            ],
            [
                12477,
                12488
            ],
            [
                12498,
                12550
            ],
            [
                12550,
                12552
            ],
            [
                12552,
                12556
            ],
            [
                12557,
                12562
            ],
            [
                12563,
                12565
            ],
            [
                12572,
                12624
            ],
            [
                12624,
                12682
            ],
            [
                12692,
                12696
            ],
            [
                12696,
                12709
            ],
            [
                12709,
                12710
            ],
            [
                12711,
                12722
            ],
            [
                12723,
                12782
            ],
            [
                12783,
                12805
            ],
            [
                12806,
                12845
            ],
            [
                12846,
                12887
            ],
            [
                12888,
                12957
            ],
            [
                12962,
                12968
            ],
            [
                12969,
                12987
            ],
            [
                12987,
                13055
            ],
            [
                13056,
                13093
            ],
            [
                13093,
                13095
            ],
            [
                13095,
                13182
            ],
            [
                13191,
                13193
            ],
            [
                13193,
                13206
            ],
            [
                13207,
                13285
            ],
            [
                13286,
                13337
            ],
            [
                13337,
                13380
            ],
            [
                13381,
                13388
            ],
            [
                13395,
                13486
            ],
            [
                13497,
                13505
            ],
            [
                13505,
                13507
            ],
            [
                13507,
                13532
            ],
            [
                13533,
                13536
            ],
            [
                13537,
                13544
            ],
            [
                13545,
                13567
            ],
            [
                13567,
                13569
            ],
            [
                13569,
                13759
            ],
            [
                13759,
                13761
            ],
            [
                13761,
                13890
            ]
        ],
        "row_chars": [
            [
                0,
                92
            ],
            [
                92,
                250
            ],
            [
                250,
                503
            ],
            [
                503,
                805
            ],
            [
                805,
                1011
            ],
            [
                1011,
                1100
            ],
            [
                1100,
                1250
            ],
            [
                1250,
                1507
            ],
            [
                1507,
                1572
            ],
            [
                1572,
                1622
            ],
            [
                1622,
                1679
            ],
            [
                1679,
                1845
            ],
            [
                1845,
                2116
            ],
            [
                2116,
                2174
            ],
            [
                2174,
                2312
            ],
            [
                2312,
                2402
            ],
            [
                2402,
                2491
            ],
            [
                2491,
                2746
            ],
            [
                2746,
                2833
            ],
            [
                2833,
                2893
            ],
            [
                2893,
                2986
            ],
            [
                2986,
                3110
            ],
            [
                3110,
                3285
            ],
            [
                3285,
                3429
            ],
            [
                3429,
                3558
            ],
            [
                3558,
                3895
            ],
            [
                3895,
                3960
            ],
            [
                3960,
                4174
            ],
            [
                4174,
                4382
            ],
            [
                4382,
                4490
            ],
            [
                4490,
                4570
            ],
            [
                4570,
                4583
            ],
            [
                4583,
                4614
            ],
            [
                4614,
                4658
            ],
            [
                4658,
                4729
            ],
            [
                4729,
                4729
            ],
            [
                4729,
                4917
            ],
            [
                4917,
                4942
            ],
            [
                4942,
                5154
            ],
            [
                5154,
                5239
            ],
            [
                5239,
                5337
            ],
            [
                5337,
                5401
            ],
            [
                5401,
                5470
            ],
            [
                5470,
                5561
            ],
            [
                5561,
                5606
            ],
            [
                5606,
                5649
            ],
            [
                5649,
                5677
            ],
            [
                5677,
                5747
            ],
            [
                5747,
                5862
            ],
            [
                5862,
                5908
            ],
            [
                5908,
                5921
            ],
            [
                5921,
                5947
            ],
            [
                5947,
                6018
            ],
            [
                6018,
                6057
            ],
            [
                6057,
                6164
            ],
            [
                6164,
                6176
            ],
            [
                6176,
                6216
            ],
            [
                6216,
                6261
            ],
            [
                6261,
                6489
            ],
            [
                6489,
                6572
            ],
            [
                6572,
                6670
            ],
            [
                6670,
                6798
            ],
            [
                6798,
                7037
            ],
            [
                7037,
                7080
            ],
            [
                7080,
                7195
            ],
            [
                7195,
                7258
            ],
            [
                7258,
                7364
            ],
            [
                7364,
                7428
            ],
            [
                7428,
                7607
            ],
            [
                7607,
                7792
            ],
            [
                7792,
                7934
            ],
            [
                7934,
                8062
            ],
            [
                8062,
                8309
            ],
            [
                8309,
                8371
            ],
            [
                8371,
                8586
            ],
            [
                8586,
                8804
            ],
            [
                8804,
                8950
            ],
            [
                8950,
                9126
            ],
            [
                9126,
                9198
            ],
            [
                9198,
                9198
            ],
            [
                9198,
                9265
            ],
            [
                9265,
                9369
            ],
            [
                9369,
                9493
            ],
            [
                9493,
                9614
            ],
            [
                9614,
                9644
            ],
            [
                9644,
                9741
            ],
            [
                9741,
                9785
            ],
            [
                9785,
                9840
            ],
            [
                9840,
                9906
            ],
            [
                9906,
                9956
            ],
            [
                9956,
                10150
            ],
            [
                10150,
                10358
            ],
            [
                10358,
                10416
            ],
            [
                10416,
                10575
            ],
            [
                10575,
                10655
            ],
            [
                10655,
                10688
            ],
            [
                10688,
                11024
            ],
            [
                11024,
                11099
            ],
            [
                11099,
                11306
            ],
            [
                11306,
                11440
            ],
            [
                11440,
                11619
            ],
            [
                11619,
                11810
            ],
            [
                11810,
                11997
            ],
            [
                11997,
                12135
            ],
            [
                12135,
                12324
            ],
            [
                12324,
                12350
            ],
            [
                12350,
                12552
            ],
            [
                12552,
                12624
            ],
            [
                12624,
                12806
            ],
            [
                12806,
                12987
            ],
            [
                12987,
                13095
            ],
            [
                13095,
                13193
            ],
            [
                13193,
                13337
            ],
            [
                13337,
                13507
            ],
            [
                13507,
                13569
            ],
            [
                13569,
                13761
            ],
            [
                13761,
                13890
            ]
        ]
    }
}