{
    "original": {
        "text": "The day at Sotherton, with all its imperfections, afforded the Miss Bertrams much more agreeable feelings than were derived from the letters from Antigua, which soon afterwards reached Mansfield. It was much pleasanter to think of Henry Crawford than of their father; and to think of their father in England again within a certain period, which these letters obliged them to do, was a most unwelcome exercise.\nNovember was the black month fixed for his return. Sir Thomas wrote of it with as much decision as experience and anxiety could authorise. His business was so nearly concluded as to justify him in proposing to take his passage in the September packet, and he consequently looked forward with the hope of being with his beloved family again early in November.\nMaria was more to be pitied than Julia; for to her the father brought a husband, and the return of the friend most solicitous for her happiness would unite her to the lover, on whom she had chosen that happiness should depend. It was a gloomy prospect, and all she could do was to throw a mist over it, and hope when the mist cleared away she should see something else. It would hardly be _early_ in November, there were generally delays, a bad passage or _something_; that favouring _something_ which everybody who shuts their eyes while they look, or their understandings while they reason, feels the comfort of. It would probably be the middle of November at least; the middle of November was three months off. Three months comprised thirteen weeks. Much might happen in thirteen weeks.\nSir Thomas would have been deeply mortified by a suspicion of half that his daughters felt on the subject of his return, and would hardly have found consolation in a knowledge of the interest it excited in the breast of another young lady. Miss Crawford, on walking up with her brother to spend the evening at Mansfield Park, heard the good news; and though seeming to have no concern in the affair beyond politeness, and to have vented all her feelings in a quiet congratulation, heard it with an attention not so easily satisfied. Mrs. Norris gave the particulars of the letters, and the subject was dropt; but after tea, as Miss Crawford was standing at an open window with Edmund and Fanny looking out on a twilight scene, while the Miss Bertrams, Mr. Rushworth, and Henry Crawford were all busy with candles at the pianoforte, she suddenly revived it by turning round towards the group, and saying, \"How happy Mr. Rushworth looks! He is thinking of November.\"\nEdmund looked round at Mr. Rushworth too, but had nothing to say.\n\"Your father's return will be a very interesting event.\"\n\"It will, indeed, after such an absence; an absence not only long, but including so many dangers.\"\n\"It will be the forerunner also of other interesting events: your sister's marriage, and your taking orders.\"\n\"Yes.\"\n\"Don't be affronted,\" said she, laughing, \"but it does put me in mind of some of the old heathen heroes, who, after performing great exploits in a foreign land, offered sacrifices to the gods on their safe return.\"\n\"There is no sacrifice in the case,\" replied Edmund, with a serious smile, and glancing at the pianoforte again; \"it is entirely her own doing.\"\n\"Oh yes I know it is. I was merely joking. She has done no more than what every young woman would do; and I have no doubt of her being extremely happy. My other sacrifice, of course, you do not understand.\"\n\"My taking orders, I assure you, is quite as voluntary as Maria's marrying.\"\n\"It is fortunate that your inclination and your father's convenience should accord so well. There is a very good living kept for you, I understand, hereabouts.\"\n\"Which you suppose has biassed me?\"\n\"But _that_ I am sure it has not,\" cried Fanny.\n\"Thank you for your good word, Fanny, but it is more than I would affirm myself. On the contrary, the knowing that there was such a provision for me probably did bias me. Nor can I think it wrong that it should. There was no natural disinclination to be overcome, and I see no reason why a man should make a worse clergyman for knowing that he will have a competence early in life. I was in safe hands. I hope I should not have been influenced myself in a wrong way, and I am sure my father was too conscientious to have allowed it. I have no doubt that I was biased, but I think it was blamelessly.\"\n\"It is the same sort of thing,\" said Fanny, after a short pause, \"as for the son of an admiral to go into the navy, or the son of a general to be in the army, and nobody sees anything wrong in that. Nobody wonders that they should prefer the line where their friends can serve them best, or suspects them to be less in earnest in it than they appear.\"\n\"No, my dear Miss Price, and for reasons good. The profession, either navy or army, is its own justification. It has everything in its favour: heroism, danger, bustle, fashion. Soldiers and sailors are always acceptable in society. Nobody can wonder that men are soldiers and sailors.\"\n\"But the motives of a man who takes orders with the certainty of preferment may be fairly suspected, you think?\" said Edmund. \"To be justified in your eyes, he must do it in the most complete uncertainty of any provision.\"\n\"What! take orders without a living! No; that is madness indeed; absolute madness.\"\n\"Shall I ask you how the church is to be filled, if a man is neither to take orders with a living nor without? No; for you certainly would not know what to say. But I must beg some advantage to the clergyman from your own argument. As he cannot be influenced by those feelings which you rank highly as temptation and reward to the soldier and sailor in their choice of a profession, as heroism, and noise, and fashion, are all against him, he ought to be less liable to the suspicion of wanting sincerity or good intentions in the choice of his.\"\n\"Oh! no doubt he is very sincere in preferring an income ready made, to the trouble of working for one; and has the best intentions of doing nothing all the rest of his days but eat, drink, and grow fat. It is indolence, Mr. Bertram, indeed. Indolence and love of ease; a want of all laudable ambition, of taste for good company, or of inclination to take the trouble of being agreeable, which make men clergymen. A clergyman has nothing to do but be slovenly and selfish-read the newspaper, watch the weather, and quarrel with his wife. His curate does all the work, and the business of his own life is to dine.\"\n\"There are such clergymen, no doubt, but I think they are not so common as to justify Miss Crawford in esteeming it their general character. I suspect that in this comprehensive and (may I say) commonplace censure, you are not judging from yourself, but from prejudiced persons, whose opinions you have been in the habit of hearing. It is impossible that your own observation can have given you much knowledge of the clergy. You can have been personally acquainted with very few of a set of men you condemn so conclusively. You are speaking what you have been told at your uncle's table.\"\n\"I speak what appears to me the general opinion; and where an opinion is general, it is usually correct. Though _I_ have not seen much of the domestic lives of clergymen, it is seen by too many to leave any deficiency of information.\"\n\"Where any one body of educated men, of whatever denomination, are condemned indiscriminately, there must be a deficiency of information, or (smiling) of something else. Your uncle, and his brother admirals, perhaps knew little of clergymen beyond the chaplains whom, good or bad, they were always wishing away.\"\n\"Poor William! He has met with great kindness from the chaplain of the Antwerp,\" was a tender apostrophe of Fanny's, very much to the purpose of her own feelings if not of the conversation.\n\"I have been so little addicted to take my opinions from my uncle,\" said Miss Crawford, \"that I can hardly suppose-and since you push me so hard, I must observe, that I am not entirely without the means of seeing what clergymen are, being at this present time the guest of my own brother, Dr. Grant. And though Dr. Grant is most kind and obliging to me, and though he is really a gentleman, and, I dare say, a good scholar and clever, and often preaches good sermons, and is very respectable, _I_ see him to be an indolent, selfish _bon_ _vivant_, who must have his palate consulted in everything; who will not stir a finger for the convenience of any one; and who, moreover, if the cook makes a blunder, is out of humour with his excellent wife. To own the truth, Henry and I were partly driven out this very evening by a disappointment about a green goose, which he could not get the better of. My poor sister was forced to stay and bear it.\"\n\"I do not wonder at your disapprobation, upon my word. It is a great defect of temper, made worse by a very faulty habit of self-indulgence; and to see your sister suffering from it must be exceedingly painful to such feelings as yours. Fanny, it goes against us. We cannot attempt to defend Dr. Grant.\"\n\"No,\" replied Fanny, \"but we need not give up his profession for all that; because, whatever profession Dr. Grant had chosen, he would have taken a-not a good temper into it; and as he must, either in the navy or army, have had a great many more people under his command than he has now, I think more would have been made unhappy by him as a sailor or soldier than as a clergyman. Besides, I cannot but suppose that whatever there may be to wish otherwise in Dr. Grant would have been in a greater danger of becoming worse in a more active and worldly profession, where he would have had less time and obligation-where he might have escaped that knowledge of himself, the _frequency_, at least, of that knowledge which it is impossible he should escape as he is now. A man-a sensible man like Dr. Grant, cannot be in the habit of teaching others their duty every week, cannot go to church twice every Sunday, and preach such very good sermons in so good a manner as he does, without being the better for it himself. It must make him think; and I have no doubt that he oftener endeavours to restrain himself than he would if he had been anything but a clergyman.\"\n\"We cannot prove to the contrary, to be sure; but I wish you a better fate, Miss Price, than to be the wife of a man whose amiableness depends upon his own sermons; for though he may preach himself into a good-humour every Sunday, it will be bad enough to have him quarrelling about green geese from Monday morning till Saturday night.\"\n\"I think the man who could often quarrel with Fanny,\" said Edmund affectionately, \"must be beyond the reach of any sermons.\"\nFanny turned farther into the window; and Miss Crawford had only time to say, in a pleasant manner, \"I fancy Miss Price has been more used to deserve praise than to hear it\"; when, being earnestly invited by the Miss Bertrams to join in a glee, she tripped off to the instrument, leaving Edmund looking after her in an ecstasy of admiration of all her many virtues, from her obliging manners down to her light and graceful tread.\n\"There goes good-humour, I am sure,\" said he presently. \"There goes a temper which would never give pain! How well she walks! and how readily she falls in with the inclination of others! joining them the moment she is asked. What a pity,\" he added, after an instant's reflection, \"that she should have been in such hands!\"\nFanny agreed to it, and had the pleasure of seeing him continue at the window with her, in spite of the expected glee; and of having his eyes soon turned, like hers, towards the scene without, where all that was solemn, and soothing, and lovely, appeared in the brilliancy of an unclouded night, and the contrast of the deep shade of the woods. Fanny spoke her feelings. \"Here's harmony!\" said she; \"here's repose! Here's what may leave all painting and all music behind, and what poetry only can attempt to describe! Here's what may tranquillise every care, and lift the heart to rapture! When I look out on such a night as this, I feel as if there could be neither wickedness nor sorrow in the world; and there certainly would be less of both if the sublimity of Nature were more attended to, and people were carried more out of themselves by contemplating such a scene.\"\n\"I like to hear your enthusiasm, Fanny. It is a lovely night, and they are much to be pitied who have not been taught to feel, in some degree, as you do; who have not, at least, been given a taste for Nature in early life. They lose a great deal.\"\n\"_You_ taught me to think and feel on the subject, cousin.\"\n\"I had a very apt scholar. There's Arcturus looking very bright.\"\n\"Yes, and the Bear. I wish I could see Cassiopeia.\"\n\"We must go out on the lawn for that. Should you be afraid?\"\n\"Not in the least. It is a great while since we have had any star-gazing.\"\n\"Yes; I do not know how it has happened.\" The glee began. \"We will stay till this is finished, Fanny,\" said he, turning his back on the window; and as it advanced, she had the mortification of seeing him advance too, moving forward by gentle degrees towards the instrument, and when it ceased, he was close by the singers, among the most urgent in requesting to hear the glee again.\nFanny sighed alone at the window till scolded away by Mrs. Norris's threats of catching cold.",
        "paragraph_chars": [
            [
                0,
                410
            ],
            [
                410,
                769
            ],
            [
                769,
                1559
            ],
            [
                1559,
                2524
            ],
            [
                2524,
                2590
            ],
            [
                2590,
                2647
            ],
            [
                2647,
                2746
            ],
            [
                2746,
                2856
            ],
            [
                2856,
                2863
            ],
            [
                2863,
                3078
            ],
            [
                3078,
                3223
            ],
            [
                3223,
                3430
            ],
            [
                3430,
                3507
            ],
            [
                3507,
                3668
            ],
            [
                3668,
                3704
            ],
            [
                3704,
                3752
            ],
            [
                3752,
                4353
            ],
            [
                4353,
                4705
            ],
            [
                4705,
                4991
            ],
            [
                4991,
                5214
            ],
            [
                5214,
                5298
            ],
            [
                5298,
                5845
            ],
            [
                5845,
                6459
            ],
            [
                6459,
                7048
            ],
            [
                7048,
                7283
            ],
            [
                7283,
                7596
            ],
            [
                7596,
                7786
            ],
            [
                7786,
                8731
            ],
            [
                8731,
                9035
            ],
            [
                9035,
                10198
            ],
            [
                10198,
                10535
            ],
            [
                10535,
                10660
            ],
            [
                10660,
                11090
            ],
            [
                11090,
                11413
            ],
            [
                11413,
                12287
            ],
            [
                12287,
                12535
            ],
            [
                12535,
                12595
            ],
            [
                12595,
                12661
            ],
            [
                12661,
                12713
            ],
            [
                12713,
                12774
            ],
            [
                12774,
                12849
            ],
            [
                12849,
                13232
            ],
            [
                13232,
                13325
            ]
        ],
        "segment_chars": [
            [
                0,
                196
            ],
            [
                196,
                410
            ],
            [
                410,
                461
            ],
            [
                461,
                549
            ],
            [
                549,
                769
            ],
            [
                769,
                996
            ],
            [
                996,
                1139
            ],
            [
                1139,
                1384
            ],
            [
                1384,
                1483
            ],
            [
                1483,
                1522
            ],
            [
                1522,
                1559
            ],
            [
                1559,
                1799
            ],
            [
                1799,
                2092
            ],
            [
                2092,
                2495
            ],
            [
                2495,
                2524
            ],
            [
                2524,
                2590
            ],
            [
                2590,
                2647
            ],
            [
                2647,
                2746
            ],
            [
                2746,
                2856
            ],
            [
                2856,
                2863
            ],
            [
                2863,
                3078
            ],
            [
                3078,
                3223
            ],
            [
                3223,
                3245
            ],
            [
                3245,
                3266
            ],
            [
                3266,
                3375
            ],
            [
                3375,
                3430
            ],
            [
                3430,
                3507
            ],
            [
                3507,
                3599
            ],
            [
                3599,
                3668
            ],
            [
                3668,
                3704
            ],
            [
                3704,
                3752
            ],
            [
                3752,
                3833
            ],
            [
                3833,
                3923
            ],
            [
                3923,
                3964
            ],
            [
                3964,
                4134
            ],
            [
                4134,
                4155
            ],
            [
                4155,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4552
            ],
            [
                4552,
                4705
            ],
            [
                4705,
                4752
            ],
            [
                4752,
                4815
            ],
            [
                4815,
                4882
            ],
            [
                4882,
                4937
            ],
            [
                4937,
                4991
            ],
            [
                4991,
                5104
            ],
            [
                5104,
                5117
            ],
            [
                5117,
                5214
            ],
            [
                5214,
                5221
            ],
            [
                5221,
                5251
            ],
            [
                5251,
                5298
            ],
            [
                5298,
                5409
            ],
            [
                5409,
                5459
            ],
            [
                5459,
                5530
            ],
            [
                5530,
                5845
            ],
            [
                5845,
                5850
            ],
            [
                5850,
                6049
            ],
            [
                6049,
                6087
            ],
            [
                6087,
                6259
            ],
            [
                6259,
                6383
            ],
            [
                6383,
                6459
            ],
            [
                6459,
                6600
            ],
            [
                6600,
                6792
            ],
            [
                6792,
                6884
            ],
            [
                6884,
                6983
            ],
            [
                6983,
                7048
            ],
            [
                7048,
                7153
            ],
            [
                7153,
                7283
            ],
            [
                7283,
                7453
            ],
            [
                7453,
                7596
            ],
            [
                7596,
                7611
            ],
            [
                7611,
                7786
            ],
            [
                7786,
                8086
            ],
            [
                8086,
                8533
            ],
            [
                8533,
                8683
            ],
            [
                8683,
                8731
            ],
            [
                8731,
                8786
            ],
            [
                8786,
                8968
            ],
            [
                8968,
                8995
            ],
            [
                8995,
                9035
            ],
            [
                9035,
                9416
            ],
            [
                9416,
                9802
            ],
            [
                9802,
                10051
            ],
            [
                10051,
                10198
            ],
            [
                10198,
                10535
            ],
            [
                10535,
                10660
            ],
            [
                10660,
                11090
            ],
            [
                11090,
                11146
            ],
            [
                11146,
                11196
            ],
            [
                11196,
                11216
            ],
            [
                11216,
                11277
            ],
            [
                11277,
                11315
            ],
            [
                11315,
                11413
            ],
            [
                11413,
                11758
            ],
            [
                11758,
                11784
            ],
            [
                11784,
                11802
            ],
            [
                11802,
                11828
            ],
            [
                11828,
                11931
            ],
            [
                11931,
                12003
            ],
            [
                12003,
                12287
            ],
            [
                12287,
                12327
            ],
            [
                12327,
                12510
            ],
            [
                12510,
                12535
            ],
            [
                12535,
                12595
            ],
            [
                12595,
                12622
            ],
            [
                12622,
                12661
            ],
            [
                12661,
                12681
            ],
            [
                12681,
                12713
            ],
            [
                12713,
                12751
            ],
            [
                12751,
                12774
            ],
            [
                12774,
                12793
            ],
            [
                12793,
                12849
            ],
            [
                12849,
                12891
            ],
            [
                12891,
                12907
            ],
            [
                12907,
                13232
            ],
            [
                13232,
                13325
            ]
        ],
        "overlap_chars": [
            [
                0,
                49
            ],
            [
                59,
                110
            ],
            [
                129,
                196
            ],
            [
                196,
                266
            ],
            [
                408,
                410
            ],
            [
                410,
                461
            ],
            [
                461,
                471
            ],
            [
                553,
                561
            ],
            [
                569,
                585
            ],
            [
                666,
                668
            ],
            [
                589,
                591
            ],
            [
                637,
                665
            ],
            [
                682,
                696
            ],
            [
                617,
                619
            ],
            [
                714,
                769
            ],
            [
                769,
                883
            ],
            [
                895,
                996
            ],
            [
                996,
                1080
            ],
            [
                1081,
                1139
            ],
            [
                1139,
                1157
            ],
            [
                1159,
                1164
            ],
            [
                1166,
                1206
            ],
            [
                1236,
                1237
            ],
            [
                1384,
                1464
            ],
            [
                1478,
                1483
            ],
            [
                1522,
                1559
            ],
            [
                1559,
                1605
            ],
            [
                1631,
                1644
            ],
            [
                1678,
                1722
            ],
            [
                1779,
                1797
            ],
            [
                1742,
                1750
            ],
            [
                1797,
                1799
            ],
            [
                1799,
                1812
            ],
            [
                1885,
                1904
            ],
            [
                1828,
                1832
            ],
            [
                2057,
                2066
            ],
            [
                2090,
                2092
            ],
            [
                2172,
                2185
            ],
            [
                2200,
                2215
            ],
            [
                2224,
                2358
            ],
            [
                2372,
                2403
            ],
            [
                2426,
                2450
            ],
            [
                2455,
                2495
            ],
            [
                2495,
                2524
            ],
            [
                2524,
                2590
            ],
            [
                2590,
                2647
            ],
            [
                2647,
                2663
            ],
            [
                2743,
                2746
            ],
            [
                2746,
                2772
            ],
            [
                2778,
                2856
            ],
            [
                2856,
                2863
            ],
            [
                2863,
                2940
            ],
            [
                2948,
                2978
            ],
            [
                2990,
                3078
            ],
            [
                3078,
                3223
            ],
            [
                3223,
                3230
            ],
            [
                3243,
                3245
            ],
            [
                3245,
                3250
            ],
            [
                3258,
                3266
            ],
            [
                3266,
                3375
            ],
            [
                3378,
                3430
            ],
            [
                3430,
                3507
            ],
            [
                3507,
                3533
            ],
            [
                3546,
                3599
            ],
            [
                3599,
                3653
            ],
            [
                3665,
                3668
            ],
            [
                3668,
                3690
            ],
            [
                3699,
                3704
            ],
            [
                3704,
                3705
            ],
            [
                3716,
                3752
            ],
            [
                3752,
                3762
            ],
            [
                3781,
                3833
            ],
            [
                3833,
                3849
            ],
            [
                3854,
                3893
            ],
            [
                3901,
                3923
            ],
            [
                3923,
                3964
            ],
            [
                4020,
                4134
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4395
            ],
            [
                4416,
                4552
            ],
            [
                4552,
                4639
            ],
            [
                4702,
                4705
            ],
            [
                4705,
                4752
            ],
            [
                4752,
                4815
            ],
            [
                4815,
                4882
            ],
            [
                4882,
                4937
            ],
            [
                4937,
                4991
            ],
            [
                4991,
                5073
            ],
            [
                5081,
                5104
            ],
            [
                5104,
                5117
            ],
            [
                5117,
                5164
            ],
            [
                5174,
                5214
            ],
            [
                5214,
                5221
            ],
            [
                5221,
                5251
            ],
            [
                5251,
                5277
            ],
            [
                5295,
                5298
            ],
            [
                5298,
                5409
            ],
            [
                5409,
                5459
            ],
            [
                5459,
                5530
            ],
            [
                5681,
                5716
            ],
            [
                5536,
                5542
            ],
            [
                5733,
                5746
            ],
            [
                5747,
                5752
            ],
            [
                5664,
                5666
            ],
            [
                5793,
                5802
            ],
            [
                5648,
                5650
            ],
            [
                5839,
                5842
            ],
            [
                5657,
                5663
            ],
            [
                5842,
                5845
            ],
            [
                5845,
                5850
            ],
            [
                5850,
                5997
            ],
            [
                6010,
                6049
            ],
            [
                6049,
                6077
            ],
            [
                6113,
                6124
            ],
            [
                6138,
                6195
            ],
            [
                6222,
                6259
            ],
            [
                6259,
                6316
            ],
            [
                6381,
                6383
            ],
            [
                6383,
                6459
            ],
            [
                6459,
                6499
            ],
            [
                6508,
                6533
            ],
            [
                6598,
                6600
            ],
            [
                6600,
                6636
            ],
            [
                6665,
                6681
            ],
            [
                6686,
                6693
            ],
            [
                6713,
                6792
            ],
            [
                6792,
                6813
            ],
            [
                6850,
                6853
            ],
            [
                6835,
                6843
            ],
            [
                6854,
                6884
            ],
            [
                6983,
                7048
            ],
            [
                7048,
                7061
            ],
            [
                7076,
                7153
            ],
            [
                7186,
                7189
            ],
            [
                7199,
                7217
            ],
            [
                7225,
                7283
            ],
            [
                7283,
                7293
            ],
            [
                7298,
                7318
            ],
            [
                7346,
                7453
            ],
            [
                7453,
                7549
            ],
            [
                7564,
                7596
            ],
            [
                7596,
                7611
            ],
            [
                7611,
                7689
            ],
            [
                7701,
                7786
            ],
            [
                7786,
                7788
            ],
            [
                7958,
                7961
            ],
            [
                7821,
                7875
            ],
            [
                7901,
                7904
            ],
            [
                7880,
                7885
            ],
            [
                7999,
                8024
            ],
            [
                8046,
                8058
            ],
            [
                8075,
                8086
            ],
            [
                8086,
                8156
            ],
            [
                8213,
                8253
            ],
            [
                8182,
                8183
            ],
            [
                8283,
                8317
            ],
            [
                8319,
                8322
            ],
            [
                8325,
                8331
            ],
            [
                8332,
                8533
            ],
            [
                8551,
                8567
            ],
            [
                8575,
                8683
            ],
            [
                8683,
                8731
            ],
            [
                8731,
                8770
            ],
            [
                8784,
                8786
            ],
            [
                8786,
                8817
            ],
            [
                8872,
                8940
            ],
            [
                8966,
                8968
            ],
            [
                8968,
                8995
            ],
            [
                8995,
                9035
            ],
            [
                9035,
                9060
            ],
            [
                9119,
                9213
            ],
            [
                9233,
                9252
            ],
            [
                9321,
                9371
            ],
            [
                9395,
                9416
            ],
            [
                9416,
                9424
            ],
            [
                9558,
                9567
            ],
            [
                9579,
                9598
            ],
            [
                9654,
                9702
            ],
            [
                9748,
                9787
            ],
            [
                9797,
                9802
            ],
            [
                9802,
                9807
            ],
            [
                9839,
                9845
            ],
            [
                9874,
                9902
            ],
            [
                9944,
                9977
            ],
            [
                9998,
                10051
            ],
            [
                10051,
                10073
            ],
            [
                10195,
                10198
            ],
            [
                10198,
                10431
            ],
            [
                10440,
                10504
            ],
            [
                10513,
                10535
            ],
            [
                10535,
                10561
            ],
            [
                10568,
                10660
            ],
            [
                10660,
                10672
            ],
            [
                10696,
                10736
            ],
            [
                10758,
                10846
            ],
            [
                10857,
                11003
            ],
            [
                11008,
                11051
            ],
            [
                11057,
                11063
            ],
            [
                11074,
                11090
            ],
            [
                11090,
                11134
            ],
            [
                11144,
                11146
            ],
            [
                11146,
                11196
            ],
            [
                11196,
                11216
            ],
            [
                11216,
                11235
            ],
            [
                11269,
                11277
            ],
            [
                11315,
                11326
            ],
            [
                11371,
                11413
            ],
            [
                11413,
                11425
            ],
            [
                11431,
                11554
            ],
            [
                11560,
                11578
            ],
            [
                11604,
                11611
            ],
            [
                11625,
                11632
            ],
            [
                11637,
                11657
            ],
            [
                11591,
                11596
            ],
            [
                11659,
                11707
            ],
            [
                11756,
                11758
            ],
            [
                11758,
                11783
            ],
            [
                11784,
                11802
            ],
            [
                11802,
                11828
            ],
            [
                11828,
                11931
            ],
            [
                11931,
                12003
            ],
            [
                12003,
                12287
            ],
            [
                12287,
                12327
            ],
            [
                12353,
                12412
            ],
            [
                12430,
                12439
            ],
            [
                12535,
                12536
            ],
            [
                12537,
                12540
            ],
            [
                12542,
                12595
            ],
            [
                12595,
                12622
            ],
            [
                12622,
                12661
            ],
            [
                12661,
                12681
            ],
            [
                12681,
                12713
            ],
            [
                12713,
                12751
            ],
            [
                12751,
                12774
            ],
            [
                12774,
                12793
            ],
            [
                12793,
                12849
            ],
            [
                12849,
                12891
            ],
            [
                12891,
                12907
            ],
            [
                12907,
                13121
            ],
            [
                13127,
                13232
            ],
            [
                13232,
                13264
            ],
            [
                13265,
                13325
            ]
        ],
        "row_chars": [
            [
                0,
                196
            ],
            [
                196,
                410
            ],
            [
                410,
                461
            ],
            [
                461,
                769
            ],
            [
                769,
                996
            ],
            [
                996,
                1139
            ],
            [
                1139,
                1483
            ],
            [
                1483,
                1522
            ],
            [
                1522,
                1559
            ],
            [
                1559,
                1799
            ],
            [
                1799,
                2092
            ],
            [
                2092,
                2495
            ],
            [
                2495,
                2524
            ],
            [
                2524,
                2590
            ],
            [
                2590,
                2647
            ],
            [
                2647,
                2746
            ],
            [
                2746,
                2856
            ],
            [
                2856,
                2863
            ],
            [
                2863,
                3078
            ],
            [
                3078,
                3223
            ],
            [
                3223,
                3245
            ],
            [
                3245,
                3266
            ],
            [
                3266,
                3375
            ],
            [
                3375,
                3430
            ],
            [
                3430,
                3507
            ],
            [
                3507,
                3599
            ],
            [
                3599,
                3668
            ],
            [
                3668,
                3704
            ],
            [
                3704,
                3752
            ],
            [
                3752,
                3833
            ],
            [
                3833,
                3923
            ],
            [
                3923,
                3964
            ],
            [
                3964,
                4134
            ],
            [
                4134,
                4155
            ],
            [
                4155,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4552
            ],
            [
                4552,
                4705
            ],
            [
                4705,
                4752
            ],
            [
                4752,
                4815
            ],
            [
                4815,
                4882
            ],
            [
                4882,
                4937
            ],
            [
                4937,
                4991
            ],
            [
                4991,
                5104
            ],
            [
                5104,
                5117
            ],
            [
                5117,
                5214
            ],
            [
                5214,
                5221
            ],
            [
                5221,
                5251
            ],
            [
                5251,
                5298
            ],
            [
                5298,
                5409
            ],
            [
                5409,
                5459
            ],
            [
                5459,
                5530
            ],
            [
                5530,
                5845
            ],
            [
                5845,
                5850
            ],
            [
                5850,
                6049
            ],
            [
                6049,
                6259
            ],
            [
                6259,
                6383
            ],
            [
                6383,
                6459
            ],
            [
                6459,
                6600
            ],
            [
                6600,
                6792
            ],
            [
                6792,
                6884
            ],
            [
                6884,
                6983
            ],
            [
                6983,
                7048
            ],
            [
                7048,
                7153
            ],
            [
                7153,
                7283
            ],
            [
                7283,
                7453
            ],
            [
                7453,
                7596
            ],
            [
                7596,
                7611
            ],
            [
                7611,
                7786
            ],
            [
                7786,
                8086
            ],
            [
                8086,
                8533
            ],
            [
                8533,
                8683
            ],
            [
                8683,
                8731
            ],
            [
                8731,
                8786
            ],
            [
                8786,
                8968
            ],
            [
                8968,
                8995
            ],
            [
                8995,
                9035
            ],
            [
                9035,
                9416
            ],
            [
                9416,
                9802
            ],
            [
                9802,
                10051
            ],
            [
                10051,
                10198
            ],
            [
                10198,
                10535
            ],
            [
                10535,
                10660
            ],
            [
                10660,
                11090
            ],
            [
                11090,
                11146
            ],
            [
                11146,
                11196
            ],
            [
                11196,
                11216
            ],
            [
                11216,
                11277
            ],
            [
                11277,
                11315
            ],
            [
                11315,
                11413
            ],
            [
                11413,
                11758
            ],
            [
                11758,
                11784
            ],
            [
                11784,
                11802
            ],
            [
                11802,
                11828
            ],
            [
                11828,
                11931
            ],
            [
                11931,
                12003
            ],
            [
                12003,
                12287
            ],
            [
                12287,
                12327
            ],
            [
                12327,
                12510
            ],
            [
                12510,
                12535
            ],
            [
                12535,
                12595
            ],
            [
                12595,
                12622
            ],
            [
                12622,
                12661
            ],
            [
                12661,
                12681
            ],
            [
                12681,
                12713
            ],
            [
                12713,
                12751
            ],
            [
                12751,
                12774
            ],
            [
                12774,
                12793
            ],
            [
                12793,
                12849
            ],
            [
                12849,
                12891
            ],
            [
                12891,
                12907
            ],
            [
                12907,
                13232
            ],
            [
                13232,
                13325
            ]
        ]
    },
    "abridged": {
        "text": "The day at Sotherton, with all its imperfections, gave the Miss Bertrams much more agreeable feelings than the letters from Antigua, which soon afterwards reached Mansfield. It was much pleasanter to think of Henry Crawford than of their father.\nNovember was the black month fixed for his return. Sir Thomas's business being nearly concluded, he proposed to sail in the September packet, and looked forward to being with his beloved family again early in November.\nMaria was more to be pitied than Julia; for to her the father brought a husband, and the return of the friend most anxious for her happiness would unite her to the lover, on whom she had chosen that happiness should depend. It was a gloomy prospect, and all she could do was to throw a mist over it, and hope that when the mist cleared away she should see something else. It would hardly be early in November, there were generally delays; it would probably be the middle of November at least; the middle of November was thirteen weeks off. Much might happen in thirteen weeks.\nSir Thomas would have been deeply mortified by his daughters' feelings, and would hardly have found consolation in another young lady's interest. Miss Crawford heard the good news with attention. After tea, as she was standing at a window with Edmund and Fanny looking out on a twilight scene, while the Miss Bertrams, Mr. Rushworth, and Henry Crawford were all busy at the pianoforte, she suddenly turned round towards the group, saying, \"How happy Mr. Rushworth looks! He is thinking of November.\"\nEdmund looked round at Mr. Rushworth too, but had nothing to say.\n\"Your father's return will be a very interesting event.\"\n\"It will, indeed.\"\n\"It will be the forerunner of other interesting events: your sister's marriage, and your taking orders.\"\n\"Yes.\"\n\"Don't be affronted,\" said she, laughing, \"but it does put me in mind of some old heathen heroes, who, after great exploits in a foreign land, offered sacrifices to the gods on their safe return.\"\n\"There is no sacrifice in the case,\" replied Edmund, with a serious smile, and glancing at the pianoforte again; \"it is entirely her own doing.\"\n\"Oh yes. I was joking. She has done no more than what every young woman would do; and I have no doubt of her being extremely happy. The other sacrifice, of course, you do not understand.\"\n\"My taking orders, I assure you, is quite as voluntary as Maria's marrying.\"\n\"It is fortunate that your wish and your father's convenience should accord so well. There is a very good living kept for you, I understand.\"\n\"Which you suppose has biased me?\"\n\"I am sure it has not,\" cried Fanny.\n\"Thank you, Fanny, but it is more than I would affirm myself. On the contrary, knowing that there was such a provision probably did bias me. Nor can I think it wrong that it should. I see no reason why a man should make a worse clergyman for knowing that he will have a competence early in life. I have no doubt that I was biased, but I think it was blamelessly.\"\n\"It is the same sort of thing,\" said Fanny, \"as for the son of an admiral to go into the navy, or the son of a general to be in the army, and nobody sees anything wrong in that. Nobody wonders that they should prefer the line where their friends can serve them best.\"\n\"No, my dear Miss Price, and for reasons good. The profession, either navy or army, is its own justification. It has everything in its favour: heroism, danger, bustle, fashion. Soldiers and sailors are always acceptable in society. Nobody can wonder that men are soldiers and sailors.\"\n\"But the motives of a man who takes orders with the certainty of preferment may be suspected, you think?\" said Edmund. \"To be justified in your eyes, he must do it in complete uncertainty of any provision.\"\n\"What! take orders without a living! No; that is madness indeed.\"\n\"Shall I ask you how the church is to be filled, if a man is neither to take orders with a living nor without? No; for you certainly would not know what to say. But I must beg some advantage to the clergyman from your own argument. As heroism, and noise, and fashion, cannot tempt him, he ought not to be suspected of lacking sincerity in his choice.\"\n\"Oh! no doubt he is very sincere in preferring an income ready made, to the trouble of working for one; and has the best intentions of doing nothing all his days but eat, drink, and grow fat. It is indolence, Mr. Bertram; a want of ambition, of taste for good company, or of inclination to be agreeable, which make men clergymen. A clergyman has nothing to do but be slovenly and selfish. His curate does all the work, and the business of his own life is to dine.\"\n\"There are such clergymen, no doubt, but they are not so common as you suppose. I suspect that in this comprehensive censure, you are judging from prejudiced persons, whose opinions you have been in the habit of hearing. It is impossible that you can have much knowledge of the clergy. You are speaking what you have been told at your uncle's table.\"\n\"I speak what is the general opinion; and where an opinion is general, it is usually correct. The lives of clergymen are seen by too many to leave any deficiency of information.\"\n\"Where any body of educated men are condemned indiscriminately, there must be a deficiency of information, or (smiling) of something else. Your uncle, and his brother admirals, perhaps knew little of clergymen beyond the chaplains whom they were always wishing away.\"\n\"Poor William! He has met with great kindness from the chaplain of the Antwerp,\" was a tender remark of Fanny's, very much to the purpose of her own feelings if not of the conversation.\n\"I do not take my opinions from my uncle,\" said Miss Crawford, \"and I can see what clergymen are, being the guest of Dr. Grant. And though Dr. Grant is most kind and obliging to me, and though he is clever, and often preaches good sermons, I see him to be an indolent, selfish bon vivant, who must have his palate consulted in everything; who will not stir a finger for the convenience of any one; and who, moreover, if the cook makes a blunder, is out of humour with his excellent wife. Henry and I were driven out this very evening by a disappointment about a green goose, which he could not get the better of. My poor sister was forced to stay and bear it.\"\n\"I do not wonder at your disapprobation. It is a great defect of temper, and to see your sister suffering from it must be exceedingly painful. Fanny, it goes against us. We cannot attempt to defend Dr. Grant.\"\n\"No,\" replied Fanny, \"but whatever profession Dr. Grant had chosen, he would have taken a-not a good temper into it; and in the navy or army, I think more would have been made unhappy by him than as a clergyman. Besides, in a more worldly profession, he might have escaped that knowledge of himself, which it is impossible he should escape now. A man cannot teach others their duty every week and preach such very good sermons as he does, without being the better for it himself. It must make him think.\"\n\"We cannot prove to the contrary, to be sure; but I wish you a better fate, Miss Price, than to be the wife of a man whose amiableness depends upon his own sermons; for though he may preach himself into a good-humour every Sunday, it is still bad enough to have him quarrelling about green geese from Monday till Saturday night.\"\n\"I think the man who could quarrel with Fanny,\" said Edmund affectionately, \"must be beyond the reach of any sermons.\"\nFanny turned away; and Miss Crawford had only time to say pleasantly, \"I fancy Miss Price has been more used to deserve praise than to hear it\"; when, being invited by the Miss Bertrams to join in a glee, she tripped off to the instrument, leaving Edmund looking after her in an ecstasy of admiration of her many virtues, from her obliging manners to her graceful tread.\n\"There goes good-humour, I am sure,\" said he. \"There goes a temper which would never give pain! How well she walks! and how readily she pleases others! What a pity that she should have been in such hands!\"\nFanny agreed, and had the pleasure of seeing him continue at the window with her, in spite of the expected glee; and of having his eyes turned, like hers, outside, where a solemn, soothing, and lovely scene appeared in the brilliancy of an unclouded night. Fanny spoke her feelings.\n\"Here's harmony!\" said she; \"here's repose! Here's what may leave all painting and all music behind, and what poetry only can attempt to describe! Here's what may tranquillise every care, and lift the heart to rapture! When I look out on such a night as this, I feel as if there could be neither wickedness nor sorrow in the world; and there certainly would be less of both if the sublimity of Nature were more attended to, and people were carried more out of themselves by contemplating such a scene.\"\n\"I like to hear your enthusiasm, Fanny. They are much to be pitied who have not been taught to feel as you do.\"\n\"You taught me to think and feel on the subject, cousin.\"\n\"I had a very apt scholar. There's Arcturus looking very bright.\"\n\"Yes, and the Bear. I wish I could see Cassiopeia.\"\n\"We must go out on the lawn for that. Should you be afraid?\"\n\"Not in the least. It is a great while since we have had any star-gazing.\"\n\"Yes; I do not know how it has happened.\" The glee began. \"We will stay till this is finished, Fanny,\" said he, turning his back on the window; and as it advanced, she had the mortification of seeing him advance too, moving forward by gentle degrees towards the instrument. When it ceased, he was close by the singers, among the most urgent in requesting to hear the glee again.\nFanny sighed alone at the window, till scolded away by Mrs. Norris's threats of catching cold.",
        "paragraph_chars": [
            [
                0,
                246
            ],
            [
                246,
                465
            ],
            [
                465,
                1042
            ],
            [
                1042,
                1542
            ],
            [
                1542,
                1608
            ],
            [
                1608,
                1665
            ],
            [
                1665,
                1684
            ],
            [
                1684,
                1789
            ],
            [
                1789,
                1796
            ],
            [
                1796,
                1993
            ],
            [
                1993,
                2138
            ],
            [
                2138,
                2326
            ],
            [
                2326,
                2403
            ],
            [
                2403,
                2545
            ],
            [
                2545,
                2580
            ],
            [
                2580,
                2617
            ],
            [
                2617,
                2981
            ],
            [
                2981,
                3249
            ],
            [
                3249,
                3535
            ],
            [
                3535,
                3742
            ],
            [
                3742,
                3808
            ],
            [
                3808,
                4160
            ],
            [
                4160,
                4625
            ],
            [
                4625,
                4976
            ],
            [
                4976,
                5155
            ],
            [
                5155,
                5423
            ],
            [
                5423,
                5609
            ],
            [
                5609,
                6270
            ],
            [
                6270,
                6480
            ],
            [
                6480,
                6985
            ],
            [
                6985,
                7315
            ],
            [
                7315,
                7434
            ],
            [
                7434,
                7805
            ],
            [
                7805,
                8011
            ],
            [
                8011,
                8294
            ],
            [
                8294,
                8797
            ],
            [
                8797,
                8909
            ],
            [
                8909,
                8967
            ],
            [
                8967,
                9033
            ],
            [
                9033,
                9085
            ],
            [
                9085,
                9146
            ],
            [
                9146,
                9221
            ],
            [
                9221,
                9600
            ],
            [
                9600,
                9694
            ]
        ],
        "segment_chars": [
            [
                0,
                174
            ],
            [
                174,
                246
            ],
            [
                246,
                297
            ],
            [
                297,
                465
            ],
            [
                465,
                689
            ],
            [
                689,
                837
            ],
            [
                837,
                1005
            ],
            [
                1005,
                1042
            ],
            [
                1042,
                1188
            ],
            [
                1188,
                1238
            ],
            [
                1238,
                1513
            ],
            [
                1513,
                1542
            ],
            [
                1542,
                1608
            ],
            [
                1608,
                1665
            ],
            [
                1665,
                1684
            ],
            [
                1684,
                1789
            ],
            [
                1789,
                1796
            ],
            [
                1796,
                1993
            ],
            [
                1993,
                2138
            ],
            [
                2138,
                2147
            ],
            [
                2147,
                2161
            ],
            [
                2161,
                2270
            ],
            [
                2270,
                2326
            ],
            [
                2326,
                2403
            ],
            [
                2403,
                2488
            ],
            [
                2488,
                2545
            ],
            [
                2545,
                2580
            ],
            [
                2580,
                2617
            ],
            [
                2617,
                2679
            ],
            [
                2679,
                2758
            ],
            [
                2758,
                2799
            ],
            [
                2799,
                2913
            ],
            [
                2913,
                2981
            ],
            [
                2981,
                3159
            ],
            [
                3159,
                3249
            ],
            [
                3249,
                3296
            ],
            [
                3296,
                3359
            ],
            [
                3359,
                3426
            ],
            [
                3426,
                3481
            ],
            [
                3481,
                3535
            ],
            [
                3535,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3742
            ],
            [
                3742,
                3749
            ],
            [
                3749,
                3779
            ],
            [
                3779,
                3808
            ],
            [
                3808,
                3919
            ],
            [
                3919,
                3969
            ],
            [
                3969,
                4040
            ],
            [
                4040,
                4160
            ],
            [
                4160,
                4165
            ],
            [
                4165,
                4352
            ],
            [
                4352,
                4490
            ],
            [
                4490,
                4549
            ],
            [
                4549,
                4625
            ],
            [
                4625,
                4705
            ],
            [
                4705,
                4846
            ],
            [
                4846,
                4911
            ],
            [
                4911,
                4976
            ],
            [
                4976,
                5070
            ],
            [
                5070,
                5155
            ],
            [
                5155,
                5294
            ],
            [
                5294,
                5423
            ],
            [
                5423,
                5438
            ],
            [
                5438,
                5609
            ],
            [
                5609,
                5737
            ],
            [
                5737,
                6097
            ],
            [
                6097,
                6222
            ],
            [
                6222,
                6270
            ],
            [
                6270,
                6311
            ],
            [
                6311,
                6413
            ],
            [
                6413,
                6440
            ],
            [
                6440,
                6480
            ],
            [
                6480,
                6692
            ],
            [
                6692,
                6825
            ],
            [
                6825,
                6960
            ],
            [
                6960,
                6985
            ],
            [
                6985,
                7315
            ],
            [
                7315,
                7434
            ],
            [
                7434,
                7805
            ],
            [
                7805,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7901,
                7921
            ],
            [
                7921,
                7957
            ],
            [
                7957,
                8011
            ],
            [
                8011,
                8268
            ],
            [
                8268,
                8294
            ],
            [
                8294,
                8312
            ],
            [
                8312,
                8338
            ],
            [
                8338,
                8441
            ],
            [
                8441,
                8513
            ],
            [
                8513,
                8797
            ],
            [
                8797,
                8837
            ],
            [
                8837,
                8909
            ],
            [
                8909,
                8967
            ],
            [
                8967,
                8994
            ],
            [
                8994,
                9033
            ],
            [
                9033,
                9053
            ],
            [
                9053,
                9085
            ],
            [
                9085,
                9123
            ],
            [
                9123,
                9146
            ],
            [
                9146,
                9165
            ],
            [
                9165,
                9221
            ],
            [
                9221,
                9263
            ],
            [
                9263,
                9279
            ],
            [
                9279,
                9495
            ],
            [
                9495,
                9600
            ],
            [
                9600,
                9694
            ]
        ],
        "overlap_chars": [
            [
                0,
                49
            ],
            [
                55,
                106
            ],
            [
                107,
                174
            ],
            [
                174,
                244
            ],
            [
                244,
                246
            ],
            [
                246,
                297
            ],
            [
                297,
                307
            ],
            [
                310,
                318
            ],
            [
                325,
                341
            ],
            [
                343,
                345
            ],
            [
                355,
                357
            ],
            [
                363,
                391
            ],
            [
                392,
                406
            ],
            [
                407,
                409
            ],
            [
                410,
                465
            ],
            [
                465,
                579
            ],
            [
                588,
                689
            ],
            [
                689,
                773
            ],
            [
                779,
                837
            ],
            [
                837,
                855
            ],
            [
                856,
                861
            ],
            [
                862,
                902
            ],
            [
                902,
                903
            ],
            [
                904,
                984
            ],
            [
                1000,
                1005
            ],
            [
                1005,
                1042
            ],
            [
                1042,
                1088
            ],
            [
                1089,
                1102
            ],
            [
                1112,
                1156
            ],
            [
                1157,
                1175
            ],
            [
                1178,
                1186
            ],
            [
                1186,
                1188
            ],
            [
                1188,
                1201
            ],
            [
                1202,
                1221
            ],
            [
                1222,
                1226
            ],
            [
                1227,
                1236
            ],
            [
                1236,
                1238
            ],
            [
                1238,
                1251
            ],
            [
                1256,
                1271
            ],
            [
                1274,
                1408
            ],
            [
                1409,
                1440
            ],
            [
                1448,
                1472
            ],
            [
                1473,
                1513
            ],
            [
                1513,
                1542
            ],
            [
                1542,
                1608
            ],
            [
                1608,
                1665
            ],
            [
                1665,
                1681
            ],
            [
                1681,
                1684
            ],
            [
                1684,
                1710
            ],
            [
                1711,
                1789
            ],
            [
                1789,
                1796
            ],
            [
                1796,
                1873
            ],
            [
                1874,
                1904
            ],
            [
                1905,
                1993
            ],
            [
                1993,
                2138
            ],
            [
                2138,
                2145
            ],
            [
                2145,
                2147
            ],
            [
                2147,
                2152
            ],
            [
                2153,
                2161
            ],
            [
                2161,
                2270
            ],
            [
                2274,
                2326
            ],
            [
                2326,
                2403
            ],
            [
                2403,
                2429
            ],
            [
                2435,
                2488
            ],
            [
                2488,
                2542
            ],
            [
                2542,
                2545
            ],
            [
                2545,
                2567
            ],
            [
                2575,
                2580
            ],
            [
                2580,
                2581
            ],
            [
                2581,
                2617
            ],
            [
                2617,
                2627
            ],
            [
                2627,
                2679
            ],
            [
                2679,
                2695
            ],
            [
                2696,
                2735
            ],
            [
                2736,
                2758
            ],
            [
                2758,
                2799
            ],
            [
                2799,
                2913
            ],
            [
                2913,
                2981
            ],
            [
                2981,
                3023
            ],
            [
                3023,
                3159
            ],
            [
                3159,
                3246
            ],
            [
                3246,
                3249
            ],
            [
                3249,
                3296
            ],
            [
                3296,
                3359
            ],
            [
                3359,
                3426
            ],
            [
                3426,
                3481
            ],
            [
                3481,
                3535
            ],
            [
                3535,
                3617
            ],
            [
                3618,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3701
            ],
            [
                3702,
                3742
            ],
            [
                3742,
                3749
            ],
            [
                3749,
                3779
            ],
            [
                3779,
                3805
            ],
            [
                3805,
                3808
            ],
            [
                3808,
                3919
            ],
            [
                3919,
                3969
            ],
            [
                3969,
                4040
            ],
            [
                4040,
                4075
            ],
            [
                4076,
                4082
            ],
            [
                4089,
                4102
            ],
            [
                4107,
                4112
            ],
            [
                4123,
                4125
            ],
            [
                4134,
                4143
            ],
            [
                4144,
                4146
            ],
            [
                4147,
                4150
            ],
            [
                4151,
                4157
            ],
            [
                4157,
                4160
            ],
            [
                4160,
                4165
            ],
            [
                4165,
                4312
            ],
            [
                4313,
                4352
            ],
            [
                4352,
                4380
            ],
            [
                4380,
                4391
            ],
            [
                4392,
                4449
            ],
            [
                4453,
                4490
            ],
            [
                4490,
                4547
            ],
            [
                4547,
                4549
            ],
            [
                4549,
                4625
            ],
            [
                4625,
                4665
            ],
            [
                4666,
                4691
            ],
            [
                4703,
                4705
            ],
            [
                4705,
                4741
            ],
            [
                4742,
                4758
            ],
            [
                4759,
                4766
            ],
            [
                4767,
                4846
            ],
            [
                4846,
                4867
            ],
            [
                4868,
                4871
            ],
            [
                4872,
                4880
            ],
            [
                4881,
                4911
            ],
            [
                4911,
                4976
            ],
            [
                4976,
                4989
            ],
            [
                4993,
                5070
            ],
            [
                5070,
                5073
            ],
            [
                5074,
                5092
            ],
            [
                5097,
                5155
            ],
            [
                5155,
                5165
            ],
            [
                5166,
                5186
            ],
            [
                5187,
                5294
            ],
            [
                5294,
                5390
            ],
            [
                5391,
                5423
            ],
            [
                5423,
                5438
            ],
            [
                5438,
                5516
            ],
            [
                5524,
                5609
            ],
            [
                5609,
                5611
            ],
            [
                5615,
                5618
            ],
            [
                5619,
                5673
            ],
            [
                5673,
                5676
            ],
            [
                5677,
                5682
            ],
            [
                5687,
                5712
            ],
            [
                5713,
                5725
            ],
            [
                5726,
                5737
            ],
            [
                5737,
                5807
            ],
            [
                5808,
                5848
            ],
            [
                5849,
                5850
            ],
            [
                5851,
                5885
            ],
            [
                5886,
                5889
            ],
            [
                5890,
                5896
            ],
            [
                5896,
                6097
            ],
            [
                6097,
                6113
            ],
            [
                6114,
                6222
            ],
            [
                6222,
                6270
            ],
            [
                6270,
                6309
            ],
            [
                6309,
                6311
            ],
            [
                6311,
                6342
            ],
            [
                6343,
                6411
            ],
            [
                6411,
                6413
            ],
            [
                6413,
                6440
            ],
            [
                6440,
                6480
            ],
            [
                6480,
                6505
            ],
            [
                6506,
                6600
            ],
            [
                6601,
                6620
            ],
            [
                6620,
                6670
            ],
            [
                6671,
                6692
            ],
            [
                6692,
                6700
            ],
            [
                6701,
                6710
            ],
            [
                6711,
                6730
            ],
            [
                6731,
                6779
            ],
            [
                6780,
                6819
            ],
            [
                6820,
                6825
            ],
            [
                6825,
                6830
            ],
            [
                6831,
                6837
            ],
            [
                6844,
                6872
            ],
            [
                6873,
                6906
            ],
            [
                6907,
                6960
            ],
            [
                6960,
                6982
            ],
            [
                6982,
                6985
            ],
            [
                6985,
                7218
            ],
            [
                7228,
                7292
            ],
            [
                7293,
                7315
            ],
            [
                7315,
                7341
            ],
            [
                7342,
                7434
            ],
            [
                7434,
                7446
            ],
            [
                7451,
                7491
            ],
            [
                7502,
                7590
            ],
            [
                7591,
                7737
            ],
            [
                7738,
                7781
            ],
            [
                7782,
                7788
            ],
            [
                7789,
                7805
            ],
            [
                7805,
                7849
            ],
            [
                7849,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7901,
                7921
            ],
            [
                7921,
                7940
            ],
            [
                7949,
                7957
            ],
            [
                7957,
                7968
            ],
            [
                7969,
                8011
            ],
            [
                8011,
                8023
            ],
            [
                8023,
                8146
            ],
            [
                8147,
                8165
            ],
            [
                8173,
                8180
            ],
            [
                8183,
                8190
            ],
            [
                8191,
                8211
            ],
            [
                8212,
                8217
            ],
            [
                8218,
                8266
            ],
            [
                8266,
                8268
            ],
            [
                8268,
                8293
            ],
            [
                8294,
                8312
            ],
            [
                8312,
                8338
            ],
            [
                8338,
                8441
            ],
            [
                8441,
                8513
            ],
            [
                8513,
                8797
            ],
            [
                8797,
                8837
            ],
            [
                8837,
                8896
            ],
            [
                8897,
                8906
            ],
            [
                8909,
                8910
            ],
            [
                8910,
                8913
            ],
            [
                8914,
                8967
            ],
            [
                8967,
                8994
            ],
            [
                8994,
                9033
            ],
            [
                9033,
                9053
            ],
            [
                9053,
                9085
            ],
            [
                9085,
                9123
            ],
            [
                9123,
                9146
            ],
            [
                9146,
                9165
            ],
            [
                9165,
                9221
            ],
            [
                9221,
                9263
            ],
            [
                9263,
                9279
            ],
            [
                9279,
                9493
            ],
            [
                9495,
                9600
            ],
            [
                9600,
                9632
            ],
            [
                9634,
                9694
            ]
        ],
        "row_chars": [
            [
                0,
                174
            ],
            [
                174,
                246
            ],
            [
                246,
                297
            ],
            [
                297,
                465
            ],
            [
                465,
                689
            ],
            [
                689,
                837
            ],
            [
                837,
                1005
            ],
            [
                1005,
                1005
            ],
            [
                1005,
                1042
            ],
            [
                1042,
                1188
            ],
            [
                1188,
                1238
            ],
            [
                1238,
                1513
            ],
            [
                1513,
                1542
            ],
            [
                1542,
                1608
            ],
            [
                1608,
                1665
            ],
            [
                1665,
                1684
            ],
            [
                1684,
                1789
            ],
            [
                1789,
                1796
            ],
            [
                1796,
                1993
            ],
            [
                1993,
                2138
            ],
            [
                2138,
                2147
            ],
            [
                2147,
                2161
            ],
            [
                2161,
                2270
            ],
            [
                2270,
                2326
            ],
            [
                2326,
                2403
            ],
            [
                2403,
                2488
            ],
            [
                2488,
                2545
            ],
            [
                2545,
                2580
            ],
            [
                2580,
                2617
            ],
            [
                2617,
                2679
            ],
            [
                2679,
                2758
            ],
            [
                2758,
                2799
            ],
            [
                2799,
                2913
            ],
            [
                2913,
                2913
            ],
            [
                2913,
                2913
            ],
            [
                2913,
                2981
            ],
            [
                2981,
                3159
            ],
            [
                3159,
                3249
            ],
            [
                3249,
                3296
            ],
            [
                3296,
                3359
            ],
            [
                3359,
                3426
            ],
            [
                3426,
                3481
            ],
            [
                3481,
                3535
            ],
            [
                3535,
                3641
            ],
            [
                3641,
                3654
            ],
            [
                3654,
                3742
            ],
            [
                3742,
                3749
            ],
            [
                3749,
                3779
            ],
            [
                3779,
                3808
            ],
            [
                3808,
                3919
            ],
            [
                3919,
                3969
            ],
            [
                3969,
                4040
            ],
            [
                4040,
                4160
            ],
            [
                4160,
                4165
            ],
            [
                4165,
                4352
            ],
            [
                4352,
                4490
            ],
            [
                4490,
                4549
            ],
            [
                4549,
                4625
            ],
            [
                4625,
                4705
            ],
            [
                4705,
                4846
            ],
            [
                4846,
                4911
            ],
            [
                4911,
                4911
            ],
            [
                4911,
                4976
            ],
            [
                4976,
                5070
            ],
            [
                5070,
                5155
            ],
            [
                5155,
                5294
            ],
            [
                5294,
                5423
            ],
            [
                5423,
                5438
            ],
            [
                5438,
                5609
            ],
            [
                5609,
                5737
            ],
            [
                5737,
                6097
            ],
            [
                6097,
                6222
            ],
            [
                6222,
                6270
            ],
            [
                6270,
                6311
            ],
            [
                6311,
                6413
            ],
            [
                6413,
                6440
            ],
            [
                6440,
                6480
            ],
            [
                6480,
                6692
            ],
            [
                6692,
                6825
            ],
            [
                6825,
                6960
            ],
            [
                6960,
                6985
            ],
            [
                6985,
                7315
            ],
            [
                7315,
                7434
            ],
            [
                7434,
                7805
            ],
            [
                7805,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7901,
                7921
            ],
            [
                7921,
                7957
            ],
            [
                7957,
                7957
            ],
            [
                7957,
                8011
            ],
            [
                8011,
                8268
            ],
            [
                8268,
                8294
            ],
            [
                8294,
                8312
            ],
            [
                8312,
                8338
            ],
            [
                8338,
                8441
            ],
            [
                8441,
                8513
            ],
            [
                8513,
                8797
            ],
            [
                8797,
                8837
            ],
            [
                8837,
                8909
            ],
            [
                8909,
                8909
            ],
            [
                8909,
                8967
            ],
            [
                8967,
                8994
            ],
            [
                8994,
                9033
            ],
            [
                9033,
                9053
            ],
            [
                9053,
                9085
            ],
            [
                9085,
                9123
            ],
            [
                9123,
                9146
            ],
            [
                9146,
                9165
            ],
            [
                9165,
                9221
            ],
            [
                9221,
                9263
            ],
            [
                9263,
                9279
            ],
            [
                9279,
                9600
            ],
            [
                9600,
                9694
            ]
        ]
    }
}