{
    "original": {
        "text": "Sir Thomas was to return in November, and his eldest son had duties to call him earlier home. The approach of September brought tidings of Mr. Bertram, first in a letter to the gamekeeper and then in a letter to Edmund; and by the end of August he arrived himself, to be gay, agreeable, and gallant again as occasion served, or Miss Crawford demanded; to tell of races and Weymouth, and parties and friends, to which she might have listened six weeks before with some interest, and altogether to give her the fullest conviction, by the power of actual comparison, of her preferring his younger brother.\nIt was very vexatious, and she was heartily sorry for it; but so it was; and so far from now meaning to marry the elder, she did not even want to attract him beyond what the simplest claims of conscious beauty required: his lengthened absence from Mansfield, without anything but pleasure in view, and his own will to consult, made it perfectly clear that he did not care about her; and his indifference was so much more than equalled by her own, that were he now to step forth the owner of Mansfield Park, the Sir Thomas complete, which he was to be in time, she did not believe she could accept him.\nThe season and duties which brought Mr. Bertram back to Mansfield took Mr. Crawford into Norfolk. Everingham could not do without him in the beginning of September. He went for a fortnight-a fortnight of such dullness to the Miss Bertrams as ought to have put them both on their guard, and made even Julia admit, in her jealousy of her sister, the absolute necessity of distrusting his attentions, and wishing him not to return; and a fortnight of sufficient leisure, in the intervals of shooting and sleeping, to have convinced the gentleman that he ought to keep longer away, had he been more in the habit of examining his own motives, and of reflecting to what the indulgence of his idle vanity was tending; but, thoughtless and selfish from prosperity and bad example, he would not look beyond the present moment. The sisters, handsome, clever, and encouraging, were an amusement to his sated mind; and finding nothing in Norfolk to equal the social pleasures of Mansfield, he gladly returned to it at the time appointed, and was welcomed thither quite as gladly by those whom he came to trifle with further.\nMaria, with only Mr. Rushworth to attend to her, and doomed to the repeated details of his day's sport, good or bad, his boast of his dogs, his jealousy of his neighbours, his doubts of their qualifications, and his zeal after poachers, subjects which will not find their way to female feelings without some talent on one side or some attachment on the other, had missed Mr. Crawford grievously; and Julia, unengaged and unemployed, felt all the right of missing him much more. Each sister believed herself the favourite. Julia might be justified in so doing by the hints of Mrs. Grant, inclined to credit what she wished, and Maria by the hints of Mr. Crawford himself. Everything returned into the same channel as before his absence; his manners being to each so animated and agreeable as to lose no ground with either, and just stopping short of the consistence, the steadiness, the solicitude, and the warmth which might excite general notice.\nFanny was the only one of the party who found anything to dislike; but since the day at Sotherton, she could never see Mr. Crawford with either sister without observation, and seldom without wonder or censure; and had her confidence in her own judgment been equal to her exercise of it in every other respect, had she been sure that she was seeing clearly, and judging candidly, she would probably have made some important communications to her usual confidant. As it was, however, she only hazarded a hint, and the hint was lost. \"I am rather surprised,\" said she, \"that Mr. Crawford should come back again so soon, after being here so long before, full seven weeks; for I had understood he was so very fond of change and moving about, that I thought something would certainly occur, when he was once gone, to take him elsewhere. He is used to much gayer places than Mansfield.\"\n\"It is to his credit,\" was Edmund's answer; \"and I dare say it gives his sister pleasure. She does not like his unsettled habits.\"\n\"What a favourite he is with my cousins!\"\n\"Yes, his manners to women are such as must please. Mrs. Grant, I believe, suspects him of a preference for Julia; I have never seen much symptom of it, but I wish it may be so. He has no faults but what a serious attachment would remove.\"\n\"If Miss Bertram were not engaged,\" said Fanny cautiously, \"I could sometimes almost think that he admired her more than Julia.\"\n\"Which is, perhaps, more in favour of his liking Julia best, than you, Fanny, may be aware; for I believe it often happens that a man, before he has quite made up his own mind, will distinguish the sister or intimate friend of the woman he is really thinking of more than the woman herself. Crawford has too much sense to stay here if he found himself in any danger from Maria; and I am not at all afraid for her, after such a proof as she has given that her feelings are not strong.\"\nFanny supposed she must have been mistaken, and meant to think differently in future; but with all that submission to Edmund could do, and all the help of the coinciding looks and hints which she occasionally noticed in some of the others, and which seemed to say that Julia was Mr. Crawford's choice, she knew not always what to think. She was privy, one evening, to the hopes of her aunt Norris on the subject, as well as to her feelings, and the feelings of Mrs. Rushworth, on a point of some similarity, and could not help wondering as she listened; and glad would she have been not to be obliged to listen, for it was while all the other young people were dancing, and she sitting, most unwillingly, among the chaperons at the fire, longing for the re-entrance of her elder cousin, on whom all her own hopes of a partner then depended. It was Fanny's first ball, though without the preparation or splendour of many a young lady's first ball, being the thought only of the afternoon, built on the late acquisition of a violin player in the servants' hall, and the possibility of raising five couple with the help of Mrs. Grant and a new intimate friend of Mr. Bertram's just arrived on a visit. It had, however, been a very happy one to Fanny through four dances, and she was quite grieved to be losing even a quarter of an hour. While waiting and wishing, looking now at the dancers and now at the door, this dialogue between the two above-mentioned ladies was forced on her-\n\"I think, ma'am,\" said Mrs. Norris, her eyes directed towards Mr. Rushworth and Maria, who were partners for the second time, \"we shall see some happy faces again now.\"\n\"Yes, ma'am, indeed,\" replied the other, with a stately simper, \"there will be some satisfaction in looking on _now_, and I think it was rather a pity they should have been obliged to part. Young folks in their situation should be excused complying with the common forms. I wonder my son did not propose it.\"\n\"I dare say he did, ma'am. Mr. Rushworth is never remiss. But dear Maria has such a strict sense of propriety, so much of that true delicacy which one seldom meets with nowadays, Mrs. Rushworth-that wish of avoiding particularity! Dear ma'am, only look at her face at this moment; how different from what it was the two last dances!\"\nMiss Bertram did indeed look happy, her eyes were sparkling with pleasure, and she was speaking with great animation, for Julia and her partner, Mr. Crawford, were close to her; they were all in a cluster together. How she had looked before, Fanny could not recollect, for she had been dancing with Edmund herself, and had not thought about her.\nMrs. Norris continued, \"It is quite delightful, ma'am, to see young people so properly happy, so well suited, and so much the thing! I cannot but think of dear Sir Thomas's delight. And what do you say, ma'am, to the chance of another match? Mr. Rushworth has set a good example, and such things are very catching.\"\nMrs. Rushworth, who saw nothing but her son, was quite at a loss.\n\"The couple above, ma'am. Do you see no symptoms there?\"\n\"Oh dear! Miss Julia and Mr. Crawford. Yes, indeed, a very pretty match. What is his property?\"\n\"Four thousand a year.\"\n\"Very well. Those who have not more must be satisfied with what they have. Four thousand a year is a pretty estate, and he seems a very genteel, steady young man, so I hope Miss Julia will be very happy.\"\n\"It is not a settled thing, ma'am, yet. We only speak of it among friends. But I have very little doubt it _will_ be. He is growing extremely particular in his attentions.\"\nFanny could listen no farther. Listening and wondering were all suspended for a time, for Mr. Bertram was in the room again; and though feeling it would be a great honour to be asked by him, she thought it must happen. He came towards their little circle; but instead of asking her to dance, drew a chair near her, and gave her an account of the present state of a sick horse, and the opinion of the groom, from whom he had just parted. Fanny found that it was not to be, and in the modesty of her nature immediately felt that she had been unreasonable in expecting it. When he had told of his horse, he took a newspaper from the table, and looking over it, said in a languid way, \"If you want to dance, Fanny, I will stand up with you.\" With more than equal civility the offer was declined; she did not wish to dance. \"I am glad of it,\" said he, in a much brisker tone, and throwing down the newspaper again, \"for I am tired to death. I only wonder how the good people can keep it up so long. They had need be _all_ in love, to find any amusement in such folly; and so they are, I fancy. If you look at them you may see they are so many couple of lovers-all but Yates and Mrs. Grant-and, between ourselves, she, poor woman, must want a lover as much as any one of them. A desperate dull life hers must be with the doctor,\" making a sly face as he spoke towards the chair of the latter, who proving, however, to be close at his elbow, made so instantaneous a change of expression and subject necessary, as Fanny, in spite of everything, could hardly help laughing at. \"A strange business this in America, Dr. Grant! What is your opinion? I always come to you to know what I am to think of public matters.\"\n\"My dear Tom,\" cried his aunt soon afterwards, \"as you are not dancing, I dare say you will have no objection to join us in a rubber; shall you?\" Then leaving her seat, and coming to him to enforce the proposal, added in a whisper, \"We want to make a table for Mrs. Rushworth, you know. Your mother is quite anxious about it, but cannot very well spare time to sit down herself, because of her fringe. Now, you and I and Dr. Grant will just do; and though _we_ play but half-crowns, you know, you may bet half-guineas with _him_.\"\n\"I should be most happy,\" replied he aloud, and jumping up with alacrity, \"it would give me the greatest pleasure; but that I am this moment going to dance. Come, Fanny,\" taking her hand, \"do not be dawdling any longer, or the dance will be over.\"\nFanny was led off very willingly, though it was impossible for her to feel much gratitude towards her cousin, or distinguish, as he certainly did, between the selfishness of another person and his own.\n\"A pretty modest request upon my word,\" he indignantly exclaimed as they walked away. \"To want to nail me to a card-table for the next two hours with herself and Dr. Grant, who are always quarrelling, and that poking old woman, who knows no more of whist than of algebra. I wish my good aunt would be a little less busy! And to ask me in such a way too! without ceremony, before them all, so as to leave me no possibility of refusing. _That_ is what I dislike most particularly. It raises my spleen more than anything, to have the pretence of being asked, of being given a choice, and at the same time addressed in such a way as to oblige one to do the very thing, whatever it be! If I had not luckily thought of standing up with you I could not have got out of it. It is a great deal too bad. But when my aunt has got a fancy in her head, nothing can stop her.\"",
        "paragraph_chars": [
            [
                0,
                603
            ],
            [
                603,
                1205
            ],
            [
                1205,
                2318
            ],
            [
                2318,
                3266
            ],
            [
                3266,
                4146
            ],
            [
                4146,
                4277
            ],
            [
                4277,
                4319
            ],
            [
                4319,
                4559
            ],
            [
                4559,
                4688
            ],
            [
                4688,
                5173
            ],
            [
                5173,
                6654
            ],
            [
                6654,
                6823
            ],
            [
                6823,
                7132
            ],
            [
                7132,
                7466
            ],
            [
                7466,
                7812
            ],
            [
                7812,
                8128
            ],
            [
                8128,
                8194
            ],
            [
                8194,
                8251
            ],
            [
                8251,
                8347
            ],
            [
                8347,
                8371
            ],
            [
                8371,
                8576
            ],
            [
                8576,
                8749
            ],
            [
                8749,
                10455
            ],
            [
                10455,
                10986
            ],
            [
                10986,
                11234
            ],
            [
                11234,
                11436
            ],
            [
                11436,
                12298
            ]
        ],
        "segment_chars": [
            [
                0,
                94
            ],
            [
                94,
                603
            ],
            [
                603,
                1205
            ],
            [
                1205,
                1303
            ],
            [
                1303,
                1370
            ],
            [
                1370,
                2023
            ],
            [
                2023,
                2318
            ],
            [
                2318,
                2796
            ],
            [
                2796,
                2840
            ],
            [
                2840,
                2989
            ],
            [
                2989,
                3266
            ],
            [
                3266,
                3728
            ],
            [
                3728,
                3797
            ],
            [
                3797,
                4097
            ],
            [
                4097,
                4146
            ],
            [
                4146,
                4236
            ],
            [
                4236,
                4277
            ],
            [
                4277,
                4319
            ],
            [
                4319,
                4371
            ],
            [
                4371,
                4497
            ],
            [
                4497,
                4559
            ],
            [
                4559,
                4688
            ],
            [
                4688,
                4979
            ],
            [
                4979,
                5173
            ],
            [
                5173,
                5510
            ],
            [
                5510,
                6014
            ],
            [
                6014,
                6372
            ],
            [
                6372,
                6507
            ],
            [
                6507,
                6654
            ],
            [
                6654,
                6823
            ],
            [
                6823,
                7013
            ],
            [
                7013,
                7095
            ],
            [
                7095,
                7132
            ],
            [
                7132,
                7159
            ],
            [
                7159,
                7190
            ],
            [
                7190,
                7363
            ],
            [
                7363,
                7466
            ],
            [
                7466,
                7681
            ],
            [
                7681,
                7812
            ],
            [
                7812,
                7945
            ],
            [
                7945,
                7994
            ],
            [
                7994,
                8054
            ],
            [
                8054,
                8128
            ],
            [
                8128,
                8194
            ],
            [
                8194,
                8220
            ],
            [
                8220,
                8251
            ],
            [
                8251,
                8261
            ],
            [
                8261,
                8290
            ],
            [
                8290,
                8324
            ],
            [
                8324,
                8347
            ],
            [
                8347,
                8371
            ],
            [
                8371,
                8383
            ],
            [
                8383,
                8446
            ],
            [
                8446,
                8576
            ],
            [
                8576,
                8616
            ],
            [
                8616,
                8651
            ],
            [
                8651,
                8694
            ],
            [
                8694,
                8749
            ],
            [
                8749,
                8780
            ],
            [
                8780,
                8968
            ],
            [
                8968,
                9186
            ],
            [
                9186,
                9319
            ],
            [
                9319,
                9487
            ],
            [
                9487,
                9568
            ],
            [
                9568,
                9685
            ],
            [
                9685,
                9743
            ],
            [
                9743,
                9838
            ],
            [
                9838,
                10020
            ],
            [
                10020,
                10317
            ],
            [
                10317,
                10365
            ],
            [
                10365,
                10387
            ],
            [
                10387,
                10455
            ],
            [
                10455,
                10601
            ],
            [
                10601,
                10742
            ],
            [
                10742,
                10857
            ],
            [
                10857,
                10986
            ],
            [
                10986,
                11143
            ],
            [
                11143,
                11234
            ],
            [
                11234,
                11436
            ],
            [
                11436,
                11522
            ],
            [
                11522,
                11708
            ],
            [
                11708,
                11757
            ],
            [
                11757,
                11790
            ],
            [
                11790,
                11871
            ],
            [
                11871,
                11915
            ],
            [
                11915,
                12117
            ],
            [
                12117,
                12202
            ],
            [
                12202,
                12230
            ],
            [
                12230,
                12298
            ]
        ],
        "overlap_chars": [
            [
                227,
                244
            ],
            [
                139,
                141
            ],
            [
                143,
                150
            ],
            [
                248,
                255
            ],
            [
                263,
                298
            ],
            [
                305,
                307
            ],
            [
                328,
                368
            ],
            [
                383,
                495
            ],
            [
                501,
                504
            ],
            [
                582,
                603
            ],
            [
                603,
                679
            ],
            [
                683,
                821
            ],
            [
                823,
                826
            ],
            [
                838,
                860
            ],
            [
                930,
                937
            ],
            [
                948,
                989
            ],
            [
                1055,
                1066
            ],
            [
                1081,
                1108
            ],
            [
                1161,
                1205
            ],
            [
                1205,
                1215
            ],
            [
                1227,
                1303
            ],
            [
                1370,
                1469
            ],
            [
                1475,
                1510
            ],
            [
                1549,
                1552
            ],
            [
                1623,
                1625
            ],
            [
                1575,
                1583
            ],
            [
                1587,
                1601
            ],
            [
                1632,
                1672
            ],
            [
                1693,
                1781
            ],
            [
                1914,
                2014
            ],
            [
                2021,
                2023
            ],
            [
                2023,
                2111
            ],
            [
                2183,
                2204
            ],
            [
                2172,
                2182
            ],
            [
                2139,
                2141
            ],
            [
                2239,
                2247
            ],
            [
                2256,
                2308
            ],
            [
                2316,
                2318
            ],
            [
                2318,
                2380
            ],
            [
                2385,
                2421
            ],
            [
                2448,
                2461
            ],
            [
                2478,
                2488
            ],
            [
                2462,
                2470
            ],
            [
                2524,
                2553
            ],
            [
                2676,
                2723
            ],
            [
                2751,
                2796
            ],
            [
                2796,
                2840
            ],
            [
                2840,
                2904
            ],
            [
                2941,
                2989
            ],
            [
                2989,
                3052
            ],
            [
                3054,
                3065
            ],
            [
                3072,
                3079
            ],
            [
                3080,
                3082
            ],
            [
                3096,
                3148
            ],
            [
                3158,
                3166
            ],
            [
                3220,
                3266
            ],
            [
                3280,
                3284
            ],
            [
                3266,
                3271
            ],
            [
                3306,
                3424
            ],
            [
                3457,
                3474
            ],
            [
                3480,
                3523
            ],
            [
                3643,
                3668
            ],
            [
                3546,
                3551
            ],
            [
                3530,
                3532
            ],
            [
                3726,
                3728
            ],
            [
                3728,
                3737
            ],
            [
                3746,
                3797
            ],
            [
                3797,
                3802
            ],
            [
                3810,
                3881
            ],
            [
                3932,
                3984
            ],
            [
                4003,
                4007
            ],
            [
                4056,
                4058
            ],
            [
                4028,
                4033
            ],
            [
                4086,
                4097
            ],
            [
                4097,
                4146
            ],
            [
                4146,
                4191
            ],
            [
                4215,
                4225
            ],
            [
                4240,
                4277
            ],
            [
                4277,
                4319
            ],
            [
                4319,
                4371
            ],
            [
                4371,
                4435
            ],
            [
                4478,
                4495
            ],
            [
                4559,
                4688
            ],
            [
                4688,
                4707
            ],
            [
                4713,
                4747
            ],
            [
                4778,
                4895
            ],
            [
                4905,
                4930
            ],
            [
                4938,
                4979
            ],
            [
                4979,
                5069
            ],
            [
                5124,
                5137
            ],
            [
                5115,
                5120
            ],
            [
                5097,
                5100
            ],
            [
                5138,
                5173
            ],
            [
                5173,
                5215
            ],
            [
                5257,
                5262
            ],
            [
                5475,
                5510
            ],
            [
                5541,
                5585
            ],
            [
                5510,
                5513
            ],
            [
                5685,
                5709
            ],
            [
                5637,
                5638
            ],
            [
                5789,
                5850
            ],
            [
                5514,
                5517
            ],
            [
                5851,
                5858
            ],
            [
                5865,
                5876
            ],
            [
                5878,
                5897
            ],
            [
                5909,
                5998
            ],
            [
                6004,
                6013
            ],
            [
                6014,
                6118
            ],
            [
                6296,
                6297
            ],
            [
                6130,
                6137
            ],
            [
                6143,
                6145
            ],
            [
                6138,
                6142
            ],
            [
                6150,
                6160
            ],
            [
                6167,
                6173
            ],
            [
                6191,
                6231
            ],
            [
                6233,
                6236
            ],
            [
                6264,
                6268
            ],
            [
                6276,
                6292
            ],
            [
                6308,
                6372
            ],
            [
                6414,
                6419
            ],
            [
                6378,
                6388
            ],
            [
                6375,
                6378
            ],
            [
                6389,
                6393
            ],
            [
                6396,
                6406
            ],
            [
                6420,
                6444
            ],
            [
                6449,
                6452
            ],
            [
                6459,
                6507
            ],
            [
                6507,
                6533
            ],
            [
                6582,
                6603
            ],
            [
                6561,
                6564
            ],
            [
                6652,
                6654
            ],
            [
                6654,
                6689
            ],
            [
                6716,
                6739
            ],
            [
                6778,
                6823
            ],
            [
                6823,
                6827
            ],
            [
                6834,
                6888
            ],
            [
                6945,
                6959
            ],
            [
                6967,
                6990
            ],
            [
                7004,
                7013
            ],
            [
                7013,
                7076
            ],
            [
                7199,
                7325
            ],
            [
                7375,
                7396
            ],
            [
                7411,
                7466
            ],
            [
                7466,
                7500
            ],
            [
                7642,
                7643
            ],
            [
                7502,
                7539
            ],
            [
                7582,
                7642
            ],
            [
                7679,
                7681
            ],
            [
                7681,
                7771
            ],
            [
                7810,
                7812
            ],
            [
                7812,
                7889
            ],
            [
                7909,
                7920
            ],
            [
                7943,
                7945
            ],
            [
                7994,
                8054
            ],
            [
                8096,
                8128
            ],
            [
                8128,
                8176
            ],
            [
                8183,
                8194
            ],
            [
                8194,
                8218
            ],
            [
                8251,
                8254
            ],
            [
                8259,
                8261
            ],
            [
                8261,
                8290
            ],
            [
                8290,
                8293
            ],
            [
                8301,
                8324
            ],
            [
                8324,
                8347
            ],
            [
                8347,
                8371
            ],
            [
                8371,
                8383
            ],
            [
                8491,
                8501
            ],
            [
                8507,
                8576
            ],
            [
                8576,
                8616
            ],
            [
                8651,
                8682
            ],
            [
                8684,
                8688
            ],
            [
                8690,
                8694
            ],
            [
                8694,
                8749
            ],
            [
                8749,
                8780
            ],
            [
                8841,
                8866
            ],
            [
                8872,
                8931
            ],
            [
                8932,
                8968
            ],
            [
                8968,
                9045
            ],
            [
                9046,
                9053
            ],
            [
                9062,
                9124
            ],
            [
                9184,
                9186
            ],
            [
                9186,
                9224
            ],
            [
                9254,
                9319
            ],
            [
                9348,
                9389
            ],
            [
                9407,
                9487
            ],
            [
                9487,
                9491
            ],
            [
                9502,
                9567
            ],
            [
                9568,
                9578
            ],
            [
                9584,
                9595
            ],
            [
                9606,
                9611
            ],
            [
                9657,
                9685
            ],
            [
                9685,
                9702
            ],
            [
                9712,
                9743
            ],
            [
                9743,
                9747
            ],
            [
                9757,
                9759
            ],
            [
                9761,
                9764
            ],
            [
                9766,
                9810
            ],
            [
                10455,
                10484
            ],
            [
                10500,
                10526
            ],
            [
                10538,
                10575
            ],
            [
                10587,
                10601
            ],
            [
                10667,
                10742
            ],
            [
                10862,
                10885
            ],
            [
                10898,
                10903
            ],
            [
                10938,
                10977
            ],
            [
                10979,
                10982
            ],
            [
                10983,
                10986
            ],
            [
                10986,
                11022
            ],
            [
                11028,
                11029
            ],
            [
                11034,
                11061
            ],
            [
                11101,
                11104
            ],
            [
                11110,
                11143
            ],
            [
                11143,
                11234
            ],
            [
                11234,
                11342
            ],
            [
                11434,
                11436
            ],
            [
                11436,
                11437
            ],
            [
                11461,
                11478
            ],
            [
                11491,
                11522
            ],
            [
                11522,
                11585
            ],
            [
                11641,
                11662
            ],
            [
                11706,
                11708
            ],
            [
                11757,
                11790
            ],
            [
                11825,
                11869
            ],
            [
                11963,
                11975
            ],
            [
                11992,
                12037
            ],
            [
                12079,
                12099
            ],
            [
                12115,
                12117
            ],
            [
                12117,
                12202
            ],
            [
                12230,
                12298
            ]
        ],
        "row_chars": [
            [
                0,
                94
            ],
            [
                94,
                603
            ],
            [
                603,
                1205
            ],
            [
                1205,
                1303
            ],
            [
                1303,
                1370
            ],
            [
                1370,
                2023
            ],
            [
                2023,
                2318
            ],
            [
                2318,
                2796
            ],
            [
                2796,
                2840
            ],
            [
                2840,
                2989
            ],
            [
                2989,
                3266
            ],
            [
                3266,
                3728
            ],
            [
                3728,
                3797
            ],
            [
                3797,
                4097
            ],
            [
                4097,
                4146
            ],
            [
                4146,
                4277
            ],
            [
                4277,
                4319
            ],
            [
                4319,
                4371
            ],
            [
                4371,
                4497
            ],
            [
                4497,
                4559
            ],
            [
                4559,
                4688
            ],
            [
                4688,
                4979
            ],
            [
                4979,
                5173
            ],
            [
                5173,
                5510
            ],
            [
                5510,
                6014
            ],
            [
                6014,
                6372
            ],
            [
                6372,
                6507
            ],
            [
                6507,
                6654
            ],
            [
                6654,
                6823
            ],
            [
                6823,
                7013
            ],
            [
                7013,
                7095
            ],
            [
                7095,
                7132
            ],
            [
                7132,
                7159
            ],
            [
                7159,
                7190
            ],
            [
                7190,
                7363
            ],
            [
                7363,
                7466
            ],
            [
                7466,
                7681
            ],
            [
                7681,
                7812
            ],
            [
                7812,
                7945
            ],
            [
                7945,
                7994
            ],
            [
                7994,
                8054
            ],
            [
                8054,
                8128
            ],
            [
                8128,
                8194
            ],
            [
                8194,
                8220
            ],
            [
                8220,
                8251
            ],
            [
                8251,
                8261
            ],
            [
                8261,
                8290
            ],
            [
                8290,
                8324
            ],
            [
                8324,
                8347
            ],
            [
                8347,
                8371
            ],
            [
                8371,
                8383
            ],
            [
                8383,
                8446
            ],
            [
                8446,
                8576
            ],
            [
                8576,
                8616
            ],
            [
                8616,
                8651
            ],
            [
                8651,
                8694
            ],
            [
                8694,
                8749
            ],
            [
                8749,
                8780
            ],
            [
                8780,
                8968
            ],
            [
                8968,
                9186
            ],
            [
                9186,
                9319
            ],
            [
                9319,
                9487
            ],
            [
                9487,
                9568
            ],
            [
                9568,
                9685
            ],
            [
                9685,
                9743
            ],
            [
                9743,
                9838
            ],
            [
                9838,
                10020
            ],
            [
                10020,
                10317
            ],
            [
                10317,
                10365
            ],
            [
                10365,
                10387
            ],
            [
                10387,
                10455
            ],
            [
                10455,
                10601
            ],
            [
                10601,
                10742
            ],
            [
                10742,
                10857
            ],
            [
                10857,
                10986
            ],
            [
                10986,
                11143
            ],
            [
                11143,
                11234
            ],
            [
                11234,
                11436
            ],
            [
                11436,
                11522
            ],
            [
                11522,
                11708
            ],
            [
                11708,
                11757
            ],
            [
                11757,
                11790
            ],
            [
                11790,
                11871
            ],
            [
                11871,
                11915
            ],
            [
                11915,
                12117
            ],
            [
                12117,
                12202
            ],
            [
                12202,
                12230
            ],
            [
                12230,
                12298
            ]
        ]
    },
    "abridged": {
        "text": "At the end of August Mr Tom Bertram arrived, to be gay, agreeable, and gallant as Miss Crawford demanded; to tell of races and parties and friends, to which she might have listened six weeks before with some interest, and altogether to convince her that she preferred his younger brother.\nIt was very vexatious, and she was heartily sorry for it; but so it was; and far from now meaning to marry the elder, she did not even want to attract him beyond what the simplest claims of conscious beauty required. His long absence from Mansfield made it clear that he did not care about her; and were he now the owner of Mansfield Park, she did not believe she could accept him.\nThe season which brought Mr. Bertram back to Mansfield took Mr. Crawford into Norfolk. He went for a fortnight-a fortnight of such dullness to the Miss Bertrams as ought to have put them on their guard, and made even Julia see the need to distrust his attentions; and a fortnight of sufficient leisure, between shooting and sleeping, to have convinced the gentleman that he ought to keep longer away; but, thoughtless and selfish from prosperity and bad example, he would not look beyond the present. The sisters, handsome, clever, and encouraging, were an amusement to his sated mind; and he gladly returned to Mansfield, to be welcomed quite as gladly by those whom he came to trifle with.\nMaria, with only Mr. Rushworth to attend to her, and doomed to hear repeated details of his day's sport, his dogs, his neighbours' jealousy, and his zeal after poachers, had missed Mr. Crawford grievously; and Julia felt all the right of missing him much more. Each sister believed herself the favourite. Julia might be justified in so doing by the hints of Mrs. Grant, and Maria by the hints of Mr. Crawford himself. Everything returned into the same channel as before his absence. His manners to each were so agreeable as to lose no ground with either, and just stopped short of the warmth which might excite general notice.\nOnly Fanny found anything to dislike; but since the day at Sotherton, she could never see Mr. Crawford with either sister without wonder or censure. Had her confidence in her own judgment been greater, she would probably have spoken of it to Edmund. As it was, she only hazarded a hint, and the hint was lost. \"I am surprised,\" said she, \"that Mr. Crawford should come back again so soon; for I had understood he was so very fond of change that he would go elsewhere. He is used to much gayer places than Mansfield.\"\n\"It is to his credit,\" was Edmund's answer; \"His sister does not like his unsettled habits.\"\n\"What a favourite he is with my cousins!\"\n\"Yes, his manners to women are such as must please. Mrs. Grant, I believe, suspects him of a preference for Julia; I wish it may be so.\"\n\"If Miss Bertram were not engaged,\" said Fanny cautiously, \"I could sometimes almost think that he admired her more than Julia.\"\n\"Which is, perhaps, in favour of his liking Julia best; for I believe it often happens that a man, before he has quite made up his own mind, will distinguish the sister or friend of the woman he is thinking of more than the woman herself. Crawford has too much sense to stay here if he found himself in any danger from Maria; and she has given proof by her engagement that her feelings are not strong.\"\nFanny supposed she must have been mistaken; but she knew not always what to think. Hearing the hopes of her aunt Norris on the subject, she could not help wondering. It was while all the other young people were dancing, and she was sitting unwillingly among the chaperons, longing for the re-entrance of her elder cousin, on whom all her own hopes of a partner depended.\nIt was Fanny's first ball, though without the preparation or splendour of many a young lady's first ball. It had been thought of only that afternoon, on the strength of a violin player in the servants' hall; and five couples were found with the help of a new intimate friend of Mr. Bertram's just arrived on a visit. Fanny, however, had been very happy through four dances, and was grieved to be losing even a quarter of an hour. While waiting and wishing, she heard this dialogue between Mrs Norris and Mrs Rushworth-\n\"I think, ma'am,\" said Mrs. Norris, watching Mr. Rushworth and Maria, \"we shall see some happy faces again now.\"\n\"Yes, indeed,\" replied the other, with a stately simper, \"I think it was a pity they should have had to part. Young folks in their situation should be excused complying with custom.\"\n\"Dear Maria has such a strict sense of propriety, so much of that true delicacy which one seldom meets with nowadays, Mrs. Rushworth. Only look at her face; how different from what it was the two last dances!\"\nMiss Bertram did indeed look happy; her eyes were sparkling with pleasure, for Julia and her partner, Mr. Crawford, were close to her. How she had looked before, Fanny could not recollect, for she had been dancing with Edmund.\nMrs. Norris continued, \"It is quite delightful, ma'am, to see young people so well suited! And what do you say, ma'am, to the chance of another match? Such things are very catching.\"\nMrs. Rushworth, who saw nothing but her son, was at a loss.\n\"The couple above, ma'am.\"\n\"Oh! Miss Julia and Mr. Crawford. Yes, a very pretty match. What is his property?\"\n\"Four thousand a year.\"\n\"Very well. He seems a genteel, steady young man, so I hope Miss Julia will be very happy.\"\n\"It is not a settled thing, ma'am, yet. But I have very little doubt it will be. He is growing extremely particular in his attentions.\"\nFanny could listen no farther. Mr. Bertram was in the room; and though feeling it would be a great honour to be asked to dance by him, she thought it must happen. He came towards their little circle; but instead of asking her to dance, drew up a chair, and gave her an account of the present state of a sick horse. Fanny found that it was not to be, and immediately felt that she had been unreasonable in expecting it. Next, he took a newspaper from the table, and said in a languid way, \"If you want to dance, Fanny, I will stand up with you.\" With equal civility the offer was declined; she did not wish to dance.\n\"I am glad,\" said he, more briskly, \"for I am tired to death. I only wonder how people can keep it up so long. They must be all in love, to find any amusement in such folly.\"\n\"My dear Tom,\" cried his aunt, \"as you are not dancing, you will have no objection to join us at cards; shall you?\" She added in a whisper, \"We want to make a table for Mrs. Rushworth, you know. You and I and Dr. Grant; and you know, you may bet half-guineas with him.\"\n\"I should be most happy,\" replied he, jumping up with alacrity, \"but I am this moment going to dance. Come, Fanny,\" taking her hand, \"do not be dawdling any longer, or the dance will be over.\"\nFanny was led off very willingly, though it was impossible for her to feel much gratitude towards her cousin.\n\"Upon my word,\" he exclaimed as they walked away. \"To want to nail me to a card-table for the next two hours with that poking old woman. And to ask me in such a way too! so as to leave me no possibility of refusing! I hate the pretence of being given a choice, and at the same time obliged to do the very thing! If I had not luckily thought of standing up with you I could not have got out of it. But when my aunt has got a fancy in her head, nothing can stop her.\"",
        "paragraph_chars": [
            [
                0,
                289
            ],
            [
                289,
                671
            ],
            [
                671,
                1363
            ],
            [
                1363,
                1990
            ],
            [
                1990,
                2507
            ],
            [
                2507,
                2600
            ],
            [
                2600,
                2642
            ],
            [
                2642,
                2779
            ],
            [
                2779,
                2908
            ],
            [
                2908,
                3311
            ],
            [
                3311,
                3682
            ],
            [
                3682,
                4201
            ],
            [
                4201,
                4314
            ],
            [
                4314,
                4497
            ],
            [
                4497,
                4707
            ],
            [
                4707,
                4934
            ],
            [
                4934,
                5117
            ],
            [
                5117,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5403
            ],
            [
                5403,
                5539
            ],
            [
                5539,
                6155
            ],
            [
                6155,
                6330
            ],
            [
                6330,
                6600
            ],
            [
                6600,
                6793
            ],
            [
                6793,
                6903
            ],
            [
                6903,
                7368
            ]
        ],
        "segment_chars": [
            [
                0,
                289
            ],
            [
                289,
                506
            ],
            [
                506,
                671
            ],
            [
                671,
                758
            ],
            [
                758,
                1172
            ],
            [
                1172,
                1363
            ],
            [
                1363,
                1624
            ],
            [
                1624,
                1668
            ],
            [
                1668,
                1781
            ],
            [
                1781,
                1846
            ],
            [
                1846,
                1990
            ],
            [
                1990,
                2139
            ],
            [
                2139,
                2240
            ],
            [
                2240,
                2300
            ],
            [
                2300,
                2458
            ],
            [
                2458,
                2507
            ],
            [
                2507,
                2600
            ],
            [
                2600,
                2642
            ],
            [
                2642,
                2694
            ],
            [
                2694,
                2779
            ],
            [
                2779,
                2908
            ],
            [
                2908,
                3147
            ],
            [
                3147,
                3311
            ],
            [
                3311,
                3394
            ],
            [
                3394,
                3477
            ],
            [
                3477,
                3682
            ],
            [
                3682,
                3788
            ],
            [
                3788,
                3999
            ],
            [
                3999,
                4112
            ],
            [
                4112,
                4201
            ],
            [
                4201,
                4314
            ],
            [
                4314,
                4424
            ],
            [
                4424,
                4497
            ],
            [
                4497,
                4631
            ],
            [
                4631,
                4707
            ],
            [
                4707,
                4842
            ],
            [
                4842,
                4934
            ],
            [
                4934,
                5025
            ],
            [
                5025,
                5085
            ],
            [
                5085,
                5117
            ],
            [
                5117,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5209
            ],
            [
                5209,
                5238
            ],
            [
                5238,
                5264
            ],
            [
                5264,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5323
            ],
            [
                5323,
                5403
            ],
            [
                5403,
                5443
            ],
            [
                5443,
                5484
            ],
            [
                5484,
                5539
            ],
            [
                5539,
                5570
            ],
            [
                5570,
                5702
            ],
            [
                5702,
                5854
            ],
            [
                5854,
                5958
            ],
            [
                5958,
                6084
            ],
            [
                6084,
                6155
            ],
            [
                6155,
                6217
            ],
            [
                6217,
                6266
            ],
            [
                6266,
                6330
            ],
            [
                6330,
                6446
            ],
            [
                6446,
                6525
            ],
            [
                6525,
                6600
            ],
            [
                6600,
                6702
            ],
            [
                6702,
                6793
            ],
            [
                6793,
                6903
            ],
            [
                6903,
                6953
            ],
            [
                6953,
                7040
            ],
            [
                7040,
                7073
            ],
            [
                7073,
                7119
            ],
            [
                7119,
                7215
            ],
            [
                7215,
                7300
            ],
            [
                7300,
                7368
            ]
        ],
        "overlap_chars": [
            [
                3,
                20
            ],
            [
                21,
                23
            ],
            [
                28,
                35
            ],
            [
                36,
                43
            ],
            [
                43,
                78
            ],
            [
                79,
                81
            ],
            [
                82,
                122
            ],
            [
                123,
                235
            ],
            [
                245,
                248
            ],
            [
                268,
                289
            ],
            [
                289,
                365
            ],
            [
                366,
                504
            ],
            [
                506,
                509
            ],
            [
                515,
                537
            ],
            [
                538,
                545
            ],
            [
                546,
                587
            ],
            [
                588,
                599
            ],
            [
                600,
                627
            ],
            [
                627,
                671
            ],
            [
                671,
                681
            ],
            [
                682,
                758
            ],
            [
                758,
                857
            ],
            [
                858,
                893
            ],
            [
                898,
                901
            ],
            [
                907,
                909
            ],
            [
                910,
                918
            ],
            [
                919,
                933
            ],
            [
                933,
                973
            ],
            [
                982,
                1070
            ],
            [
                1070,
                1170
            ],
            [
                1170,
                1172
            ],
            [
                1172,
                1260
            ],
            [
                1261,
                1282
            ],
            [
                1283,
                1293
            ],
            [
                1294,
                1296
            ],
            [
                1300,
                1308
            ],
            [
                1309,
                1361
            ],
            [
                1361,
                1363
            ],
            [
                1363,
                1425
            ],
            [
                1431,
                1467
            ],
            [
                1468,
                1481
            ],
            [
                1482,
                1492
            ],
            [
                1494,
                1502
            ],
            [
                1502,
                1531
            ],
            [
                1531,
                1578
            ],
            [
                1579,
                1624
            ],
            [
                1624,
                1668
            ],
            [
                1668,
                1732
            ],
            [
                1733,
                1781
            ],
            [
                1781,
                1844
            ],
            [
                1846,
                1857
            ],
            [
                1858,
                1865
            ],
            [
                1871,
                1873
            ],
            [
                1874,
                1926
            ],
            [
                1935,
                1943
            ],
            [
                1944,
                1990
            ],
            [
                1990,
                1994
            ],
            [
                1995,
                2000
            ],
            [
                2001,
                2119
            ],
            [
                2120,
                2137
            ],
            [
                2139,
                2182
            ],
            [
                2190,
                2215
            ],
            [
                2223,
                2228
            ],
            [
                2229,
                2231
            ],
            [
                2238,
                2240
            ],
            [
                2240,
                2249
            ],
            [
                2249,
                2300
            ],
            [
                2300,
                2305
            ],
            [
                2306,
                2377
            ],
            [
                2377,
                2429
            ],
            [
                2430,
                2434
            ],
            [
                2435,
                2437
            ],
            [
                2438,
                2443
            ],
            [
                2447,
                2458
            ],
            [
                2458,
                2507
            ],
            [
                2507,
                2552
            ],
            [
                2552,
                2562
            ],
            [
                2563,
                2600
            ],
            [
                2600,
                2642
            ],
            [
                2642,
                2694
            ],
            [
                2694,
                2758
            ],
            [
                2759,
                2776
            ],
            [
                2779,
                2908
            ],
            [
                2908,
                2927
            ],
            [
                2928,
                2962
            ],
            [
                2962,
                3079
            ],
            [
                3080,
                3105
            ],
            [
                3106,
                3147
            ],
            [
                3147,
                3237
            ],
            [
                3238,
                3251
            ],
            [
                3252,
                3257
            ],
            [
                3261,
                3264
            ],
            [
                3276,
                3311
            ],
            [
                3311,
                3353
            ],
            [
                3353,
                3358
            ],
            [
                3359,
                3394
            ],
            [
                3402,
                3446
            ],
            [
                3447,
                3450
            ],
            [
                3451,
                3475
            ],
            [
                3475,
                3476
            ],
            [
                3477,
                3538
            ],
            [
                3539,
                3542
            ],
            [
                3543,
                3550
            ],
            [
                3551,
                3562
            ],
            [
                3563,
                3582
            ],
            [
                3582,
                3671
            ],
            [
                3672,
                3681
            ],
            [
                3682,
                3786
            ],
            [
                3786,
                3787
            ],
            [
                3800,
                3807
            ],
            [
                3808,
                3810
            ],
            [
                3811,
                3815
            ],
            [
                3821,
                3831
            ],
            [
                3832,
                3838
            ],
            [
                3848,
                3888
            ],
            [
                3890,
                3893
            ],
            [
                3894,
                3898
            ],
            [
                3918,
                3934
            ],
            [
                3935,
                3999
            ],
            [
                3999,
                4004
            ],
            [
                4004,
                4014
            ],
            [
                4015,
                4018
            ],
            [
                4019,
                4023
            ],
            [
                4024,
                4034
            ],
            [
                4035,
                4059
            ],
            [
                4060,
                4063
            ],
            [
                4064,
                4112
            ],
            [
                4112,
                4138
            ],
            [
                4149,
                4170
            ],
            [
                4182,
                4185
            ],
            [
                4199,
                4201
            ],
            [
                4201,
                4236
            ],
            [
                4246,
                4269
            ],
            [
                4269,
                4314
            ],
            [
                4314,
                4318
            ],
            [
                4318,
                4372
            ],
            [
                4372,
                4386
            ],
            [
                4387,
                4410
            ],
            [
                4415,
                4424
            ],
            [
                4424,
                4487
            ],
            [
                4503,
                4629
            ],
            [
                4631,
                4652
            ],
            [
                4652,
                4707
            ],
            [
                4707,
                4741
            ],
            [
                4741,
                4742
            ],
            [
                4743,
                4780
            ],
            [
                4780,
                4840
            ],
            [
                4840,
                4842
            ],
            [
                4842,
                4932
            ],
            [
                4932,
                4934
            ],
            [
                4934,
                5011
            ],
            [
                5012,
                5023
            ],
            [
                5023,
                5025
            ],
            [
                5025,
                5085
            ],
            [
                5085,
                5117
            ],
            [
                5117,
                5165
            ],
            [
                5166,
                5177
            ],
            [
                5177,
                5201
            ],
            [
                5204,
                5207
            ],
            [
                5207,
                5209
            ],
            [
                5209,
                5238
            ],
            [
                5238,
                5241
            ],
            [
                5241,
                5264
            ],
            [
                5264,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5323
            ],
            [
                5323,
                5333
            ],
            [
                5334,
                5403
            ],
            [
                5403,
                5443
            ],
            [
                5443,
                5474
            ],
            [
                5475,
                5479
            ],
            [
                5480,
                5484
            ],
            [
                5484,
                5539
            ],
            [
                5539,
                5570
            ],
            [
                5572,
                5597
            ],
            [
                5597,
                5656
            ],
            [
                5666,
                5702
            ],
            [
                5702,
                5779
            ],
            [
                5783,
                5790
            ],
            [
                5790,
                5852
            ],
            [
                5852,
                5854
            ],
            [
                5854,
                5892
            ],
            [
                5893,
                5958
            ],
            [
                5962,
                6003
            ],
            [
                6004,
                6084
            ],
            [
                6084,
                6088
            ],
            [
                6089,
                6154
            ],
            [
                6155,
                6165
            ],
            [
                6165,
                6176
            ],
            [
                6182,
                6187
            ],
            [
                6189,
                6217
            ],
            [
                6217,
                6234
            ],
            [
                6235,
                6266
            ],
            [
                6266,
                6270
            ],
            [
                6276,
                6278
            ],
            [
                6279,
                6282
            ],
            [
                6283,
                6327
            ],
            [
                6330,
                6359
            ],
            [
                6359,
                6385
            ],
            [
                6386,
                6423
            ],
            [
                6432,
                6446
            ],
            [
                6450,
                6525
            ],
            [
                6525,
                6548
            ],
            [
                6548,
                6553
            ],
            [
                6554,
                6593
            ],
            [
                6594,
                6597
            ],
            [
                6597,
                6600
            ],
            [
                6600,
                6636
            ],
            [
                6636,
                6637
            ],
            [
                6638,
                6665
            ],
            [
                6665,
                6668
            ],
            [
                6669,
                6702
            ],
            [
                6702,
                6793
            ],
            [
                6793,
                6901
            ],
            [
                6901,
                6903
            ],
            [
                6903,
                6904
            ],
            [
                6904,
                6921
            ],
            [
                6922,
                6953
            ],
            [
                6953,
                7016
            ],
            [
                7017,
                7038
            ],
            [
                7038,
                7040
            ],
            [
                7040,
                7073
            ],
            [
                7073,
                7117
            ],
            [
                7126,
                7138
            ],
            [
                7139,
                7184
            ],
            [
                7193,
                7213
            ],
            [
                7213,
                7215
            ],
            [
                7215,
                7300
            ],
            [
                7300,
                7368
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                289
            ],
            [
                289,
                671
            ],
            [
                671,
                758
            ],
            [
                758,
                758
            ],
            [
                758,
                1172
            ],
            [
                1172,
                1363
            ],
            [
                1363,
                1624
            ],
            [
                1624,
                1668
            ],
            [
                1668,
                1781
            ],
            [
                1781,
                1990
            ],
            [
                1990,
                2240
            ],
            [
                2240,
                2300
            ],
            [
                2300,
                2458
            ],
            [
                2458,
                2507
            ],
            [
                2507,
                2600
            ],
            [
                2600,
                2642
            ],
            [
                2642,
                2694
            ],
            [
                2694,
                2779
            ],
            [
                2779,
                2779
            ],
            [
                2779,
                2908
            ],
            [
                2908,
                3147
            ],
            [
                3147,
                3311
            ],
            [
                3311,
                3394
            ],
            [
                3394,
                3682
            ],
            [
                3682,
                3999
            ],
            [
                3999,
                4112
            ],
            [
                4112,
                4201
            ],
            [
                4201,
                4314
            ],
            [
                4314,
                4424
            ],
            [
                4424,
                4497
            ],
            [
                4497,
                4497
            ],
            [
                4497,
                4497
            ],
            [
                4497,
                4497
            ],
            [
                4497,
                4631
            ],
            [
                4631,
                4707
            ],
            [
                4707,
                4842
            ],
            [
                4842,
                4934
            ],
            [
                4934,
                5025
            ],
            [
                5025,
                5025
            ],
            [
                5025,
                5085
            ],
            [
                5085,
                5117
            ],
            [
                5117,
                5177
            ],
            [
                5177,
                5204
            ],
            [
                5204,
                5204
            ],
            [
                5204,
                5209
            ],
            [
                5209,
                5238
            ],
            [
                5238,
                5264
            ],
            [
                5264,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5323
            ],
            [
                5323,
                5323
            ],
            [
                5323,
                5403
            ],
            [
                5403,
                5443
            ],
            [
                5443,
                5443
            ],
            [
                5443,
                5484
            ],
            [
                5484,
                5539
            ],
            [
                5539,
                5570
            ],
            [
                5570,
                5702
            ],
            [
                5702,
                5854
            ],
            [
                5854,
                5958
            ],
            [
                5958,
                6084
            ],
            [
                6084,
                6155
            ],
            [
                6155,
                6217
            ],
            [
                6217,
                6266
            ],
            [
                6266,
                6330
            ],
            [
                6330,
                6330
            ],
            [
                6330,
                6330
            ],
            [
                6330,
                6330
            ],
            [
                6330,
                6330
            ],
            [
                6330,
                6330
            ],
            [
                6330,
                6446
            ],
            [
                6446,
                6525
            ],
            [
                6525,
                6525
            ],
            [
                6525,
                6600
            ],
            [
                6600,
                6702
            ],
            [
                6702,
                6793
            ],
            [
                6793,
                6903
            ],
            [
                6903,
                6953
            ],
            [
                6953,
                7040
            ],
            [
                7040,
                7040
            ],
            [
                7040,
                7073
            ],
            [
                7073,
                7119
            ],
            [
                7119,
                7119
            ],
            [
                7119,
                7215
            ],
            [
                7215,
                7300
            ],
            [
                7300,
                7300
            ],
            [
                7300,
                7368
            ]
        ]
    }
}