{
    "original": {
        "text": "Fanny seemed nearer being right than Edmund had supposed. The business of finding a play that would suit everybody proved to be no trifle; and the carpenter had received his orders and taken his measurements, had suggested and removed at least two sets of difficulties, and having made the necessity of an enlargement of plan and expense fully evident, was already at work, while a play was still to seek. Other preparations were also in hand. An enormous roll of green baize had arrived from Northampton, and been cut out by Mrs. Norris (with a saving by her good management of full three-quarters of a yard), and was actually forming into a curtain by the housemaids, and still the play was wanting; and as two or three days passed away in this manner, Edmund began almost to hope that none might ever be found.\nThere were, in fact, so many things to be attended to, so many people to be pleased, so many best characters required, and, above all, such a need that the play should be at once both tragedy and comedy, that there did seem as little chance of a decision as anything pursued by youth and zeal could hold out.\nOn the tragic side were the Miss Bertrams, Henry Crawford, and Mr. Yates; on the comic, Tom Bertram, not _quite_ alone, because it was evident that Mary Crawford's wishes, though politely kept back, inclined the same way: but his determinateness and his power seemed to make allies unnecessary; and, independent of this great irreconcilable difference, they wanted a piece containing very few characters in the whole, but every character first-rate, and three principal women. All the best plays were run over in vain. Neither Hamlet, nor Macbeth, nor Othello, nor Douglas, nor The Gamester, presented anything that could satisfy even the tragedians; and The Rivals, The School for Scandal, Wheel of Fortune, Heir at Law, and a long et cetera, were successively dismissed with yet warmer objections. No piece could be proposed that did not supply somebody with a difficulty, and on one side or the other it was a continual repetition of, \"Oh no, _that_ will never do! Let us have no ranting tragedies. Too many characters. Not a tolerable woman's part in the play. Anything but _that_, my dear Tom. It would be impossible to fill it up. One could not expect anybody to take such a part. Nothing but buffoonery from beginning to end. _That_ might do, perhaps, but for the low parts. If I _must_ give my opinion, I have always thought it the most insipid play in the English language. _I_ do not wish to make objections; I shall be happy to be of any use, but I think we could not chuse worse.\"\nFanny looked on and listened, not unamused to observe the selfishness which, more or less disguised, seemed to govern them all, and wondering how it would end. For her own gratification she could have wished that something might be acted, for she had never seen even half a play, but everything of higher consequence was against it.\n\"This will never do,\" said Tom Bertram at last. \"We are wasting time most abominably. Something must be fixed on. No matter what, so that something is chosen. We must not be so nice. A few characters too many must not frighten us. We must _double_ them. We must descend a little. If a part is insignificant, the greater our credit in making anything of it. From this moment I make no difficulties. I take any part you chuse to give me, so as it be comic. Let it but be comic, I condition for nothing more.\"\nFor about the fifth time he then proposed the Heir at Law, doubting only whether to prefer Lord Duberley or Dr. Pangloss for himself; and very earnestly, but very unsuccessfully, trying to persuade the others that there were some fine tragic parts in the rest of the Dramatis Person.\nThe pause which followed this fruitless effort was ended by the same speaker, who, taking up one of the many volumes of plays that lay on the table, and turning it over, suddenly exclaimed-\"Lovers' Vows! And why should not Lovers' Vows do for _us_ as well as for the Ravenshaws? How came it never to be thought of before? It strikes me as if it would do exactly. What say you all? Here are two capital tragic parts for Yates and Crawford, and here is the rhyming Butler for me, if nobody else wants it; a trifling part, but the sort of thing I should not dislike, and, as I said before, I am determined to take anything and do my best. And as for the rest, they may be filled up by anybody. It is only Count Cassel and Anhalt.\"\nThe suggestion was generally welcome. Everybody was growing weary of indecision, and the first idea with everybody was, that nothing had been proposed before so likely to suit them all. Mr. Yates was particularly pleased: he had been sighing and longing to do the Baron at Ecclesford, had grudged every rant of Lord Ravenshaw's, and been forced to re-rant it all in his own room. The storm through Baron Wildenheim was the height of his theatrical ambition; and with the advantage of knowing half the scenes by heart already, he did now, with the greatest alacrity, offer his services for the part. To do him justice, however, he did not resolve to appropriate it; for remembering that there was some very good ranting-ground in Frederick, he professed an equal willingness for that. Henry Crawford was ready to take either. Whichever Mr. Yates did not chuse would perfectly satisfy him, and a short parley of compliment ensued. Miss Bertram, feeling all the interest of an Agatha in the question, took on her to decide it, by observing to Mr. Yates that this was a point in which height and figure ought to be considered, and that _his_ being the tallest, seemed to fit him peculiarly for the Baron. She was acknowledged to be quite right, and the two parts being accepted accordingly, she was certain of the proper Frederick. Three of the characters were now cast, besides Mr. Rushworth, who was always answered for by Maria as willing to do anything; when Julia, meaning, like her sister, to be Agatha, began to be scrupulous on Miss Crawford's account.\n\"This is not behaving well by the absent,\" said she. \"Here are not women enough. Amelia and Agatha may do for Maria and me, but here is nothing for your sister, Mr. Crawford.\"\nMr. Crawford desired _that_ might not be thought of: he was very sure his sister had no wish of acting but as she might be useful, and that she would not allow herself to be considered in the present case. But this was immediately opposed by Tom Bertram, who asserted the part of Amelia to be in every respect the property of Miss Crawford, if she would accept it. \"It falls as naturally, as necessarily to her,\" said he, \"as Agatha does to one or other of my sisters. It can be no sacrifice on their side, for it is highly comic.\"\nA short silence followed. Each sister looked anxious; for each felt the best claim to Agatha, and was hoping to have it pressed on her by the rest. Henry Crawford, who meanwhile had taken up the play, and with seeming carelessness was turning over the first act, soon settled the business.\n\"I must entreat Miss _Julia_ Bertram,\" said he, \"not to engage in the part of Agatha, or it will be the ruin of all my solemnity. You must not, indeed you must not\" (turning to her). \"I could not stand your countenance dressed up in woe and paleness. The many laughs we have had together would infallibly come across me, and Frederick and his knapsack would be obliged to run away.\"\nPleasantly, courteously, it was spoken; but the manner was lost in the matter to Julia's feelings. She saw a glance at Maria which confirmed the injury to herself: it was a scheme, a trick; she was slighted, Maria was preferred; the smile of triumph which Maria was trying to suppress shewed how well it was understood; and before Julia could command herself enough to speak, her brother gave his weight against her too, by saying, \"Oh yes! Maria must be Agatha. Maria will be the best Agatha. Though Julia fancies she prefers tragedy, I would not trust her in it. There is nothing of tragedy about her. She has not the look of it. Her features are not tragic features, and she walks too quick, and speaks too quick, and would not keep her countenance. She had better do the old countrywoman: the Cottager's wife; you had, indeed, Julia. Cottager's wife is a very pretty part, I assure you. The old lady relieves the high-flown benevolence of her husband with a good deal of spirit. You shall be Cottager's wife.\"\n\"Cottager's wife!\" cried Mr. Yates. \"What are you talking of? The most trivial, paltry, insignificant part; the merest commonplace; not a tolerable speech in the whole. Your sister do that! It is an insult to propose it. At Ecclesford the governess was to have done it. We all agreed that it could not be offered to anybody else. A little more justice, Mr. Manager, if you please. You do not deserve the office, if you cannot appreciate the talents of your company a little better.\"\n\"Why, as to _that_, my good friend, till I and my company have really acted there must be some guesswork; but I mean no disparagement to Julia. We cannot have two Agathas, and we must have one Cottager's wife; and I am sure I set her the example of moderation myself in being satisfied with the old Butler. If the part is trifling she will have more credit in making something of it; and if she is so desperately bent against everything humorous, let her take Cottager's speeches instead of Cottager's wife's, and so change the parts all through; _he_ is solemn and pathetic enough, I am sure. It could make no difference in the play, and as for Cottager himself, when he has got his wife's speeches, _I_ would undertake him with all my heart.\"\n\"With all your partiality for Cottager's wife,\" said Henry Crawford, \"it will be impossible to make anything of it fit for your sister, and we must not suffer her good-nature to be imposed on. We must not _allow_ her to accept the part. She must not be left to her own complaisance. Her talents will be wanted in Amelia. Amelia is a character more difficult to be well represented than even Agatha. I consider Amelia is the most difficult character in the whole piece. It requires great powers, great nicety, to give her playfulness and simplicity without extravagance. I have seen good actresses fail in the part. Simplicity, indeed, is beyond the reach of almost every actress by profession. It requires a delicacy of feeling which they have not. It requires a gentlewoman-a Julia Bertram. You _will_ undertake it, I hope?\" turning to her with a look of anxious entreaty, which softened her a little; but while she hesitated what to say, her brother again interposed with Miss Crawford's better claim.\n\"No, no, Julia must not be Amelia. It is not at all the part for her. She would not like it. She would not do well. She is too tall and robust. Amelia should be a small, light, girlish, skipping figure. It is fit for Miss Crawford, and Miss Crawford only. She looks the part, and I am persuaded will do it admirably.\"\nWithout attending to this, Henry Crawford continued his supplication. \"You must oblige us,\" said he, \"indeed you must. When you have studied the character, I am sure you will feel it suit you. Tragedy may be your choice, but it will certainly appear that comedy chuses _you_. You will be to visit me in prison with a basket of provisions; you will not refuse to visit me in prison? I think I see you coming in with your basket.\"\nThe influence of his voice was felt. Julia wavered; but was he only trying to soothe and pacify her, and make her overlook the previous affront? She distrusted him. The slight had been most determined. He was, perhaps, but at treacherous play with her. She looked suspiciously at her sister; Maria's countenance was to decide it: if she were vexed and alarmed-but Maria looked all serenity and satisfaction, and Julia well knew that on this ground Maria could not be happy but at her expense. With hasty indignation, therefore, and a tremulous voice, she said to him, \"You do not seem afraid of not keeping your countenance when I come in with a basket of provisions-though one might have supposed-but it is only as Agatha that I was to be so overpowering!\" She stopped-Henry Crawford looked rather foolish, and as if he did not know what to say. Tom Bertram began again-\n\"Miss Crawford must be Amelia. She will be an excellent Amelia.\"\n\"Do not be afraid of _my_ wanting the character,\" cried Julia, with angry quickness: \"I am _not_ to be Agatha, and I am sure I will do nothing else; and as to Amelia, it is of all parts in the world the most disgusting to me. I quite detest her. An odious, little, pert, unnatural, impudent girl. I have always protested against comedy, and this is comedy in its worst form.\" And so saying, she walked hastily out of the room, leaving awkward feelings to more than one, but exciting small compassion in any except Fanny, who had been a quiet auditor of the whole, and who could not think of her as under the agitations of _jealousy_ without great pity.\nA short silence succeeded her leaving them; but her brother soon returned to business and Lovers' Vows, and was eagerly looking over the play, with Mr. Yates's help, to ascertain what scenery would be necessary-while Maria and Henry Crawford conversed together in an under-voice, and the declaration with which she began of, \"I am sure I would give up the part to Julia most willingly, but that though I shall probably do it very ill, I feel persuaded _she_ would do it worse,\" was doubtless receiving all the compliments it called for.\nWhen this had lasted some time, the division of the party was completed by Tom Bertram and Mr. Yates walking off together to consult farther in the room now beginning to be called _the_ _Theatre_, and Miss Bertram's resolving to go down to the Parsonage herself with the offer of Amelia to Miss Crawford; and Fanny remained alone.\nThe first use she made of her solitude was to take up the volume which had been left on the table, and begin to acquaint herself with the play of which she had heard so much. Her curiosity was all awake, and she ran through it with an eagerness which was suspended only by intervals of astonishment, that it could be chosen in the present instance, that it could be proposed and accepted in a private theatre! Agatha and Amelia appeared to her in their different ways so totally improper for home representation-the situation of one, and the language of the other, so unfit to be expressed by any woman of modesty, that she could hardly suppose her cousins could be aware of what they were engaging in; and longed to have them roused as soon as possible by the remonstrance which Edmund would certainly make.",
        "paragraph_chars": [
            [
                0,
                814
            ],
            [
                814,
                1123
            ],
            [
                1123,
                2616
            ],
            [
                2616,
                2949
            ],
            [
                2949,
                3456
            ],
            [
                3456,
                3740
            ],
            [
                3740,
                4468
            ],
            [
                4468,
                6025
            ],
            [
                6025,
                6201
            ],
            [
                6201,
                6733
            ],
            [
                6733,
                7023
            ],
            [
                7023,
                7406
            ],
            [
                7406,
                8420
            ],
            [
                8420,
                8903
            ],
            [
                8903,
                9648
            ],
            [
                9648,
                10652
            ],
            [
                10652,
                10970
            ],
            [
                10970,
                11399
            ],
            [
                11399,
                12271
            ],
            [
                12271,
                12336
            ],
            [
                12336,
                12989
            ],
            [
                12989,
                13526
            ],
            [
                13526,
                13857
            ],
            [
                13857,
                14665
            ]
        ],
        "segment_chars": [
            [
                0,
                58
            ],
            [
                58,
                406
            ],
            [
                406,
                444
            ],
            [
                444,
                814
            ],
            [
                814,
                1123
            ],
            [
                1123,
                1600
            ],
            [
                1600,
                1642
            ],
            [
                1642,
                1923
            ],
            [
                1923,
                2091
            ],
            [
                2091,
                2125
            ],
            [
                2125,
                2146
            ],
            [
                2146,
                2188
            ],
            [
                2188,
                2222
            ],
            [
                2222,
                2260
            ],
            [
                2260,
                2310
            ],
            [
                2310,
                2356
            ],
            [
                2356,
                2405
            ],
            [
                2405,
                2506
            ],
            [
                2506,
                2616
            ],
            [
                2616,
                2776
            ],
            [
                2776,
                2949
            ],
            [
                2949,
                2997
            ],
            [
                2997,
                3035
            ],
            [
                3035,
                3063
            ],
            [
                3063,
                3108
            ],
            [
                3108,
                3132
            ],
            [
                3132,
                3180
            ],
            [
                3180,
                3203
            ],
            [
                3203,
                3229
            ],
            [
                3229,
                3306
            ],
            [
                3306,
                3347
            ],
            [
                3347,
                3404
            ],
            [
                3404,
                3456
            ],
            [
                3456,
                3740
            ],
            [
                3740,
                3944
            ],
            [
                3944,
                4019
            ],
            [
                4019,
                4062
            ],
            [
                4062,
                4103
            ],
            [
                4103,
                4121
            ],
            [
                4121,
                4376
            ],
            [
                4376,
                4431
            ],
            [
                4431,
                4468
            ],
            [
                4468,
                4506
            ],
            [
                4506,
                4654
            ],
            [
                4654,
                4848
            ],
            [
                4848,
                5067
            ],
            [
                5067,
                5252
            ],
            [
                5252,
                5293
            ],
            [
                5293,
                5397
            ],
            [
                5397,
                5669
            ],
            [
                5669,
                5796
            ],
            [
                5796,
                6025
            ],
            [
                6025,
                6078
            ],
            [
                6078,
                6106
            ],
            [
                6106,
                6201
            ],
            [
                6201,
                6407
            ],
            [
                6407,
                6566
            ],
            [
                6566,
                6670
            ],
            [
                6670,
                6733
            ],
            [
                6733,
                6759
            ],
            [
                6759,
                6881
            ],
            [
                6881,
                7023
            ],
            [
                7023,
                7153
            ],
            [
                7153,
                7206
            ],
            [
                7206,
                7274
            ],
            [
                7274,
                7406
            ],
            [
                7406,
                7505
            ],
            [
                7505,
                7847
            ],
            [
                7847,
                7869
            ],
            [
                7869,
                7900
            ],
            [
                7900,
                7971
            ],
            [
                7971,
                8010
            ],
            [
                8010,
                8038
            ],
            [
                8038,
                8159
            ],
            [
                8159,
                8244
            ],
            [
                8244,
                8297
            ],
            [
                8297,
                8389
            ],
            [
                8389,
                8420
            ],
            [
                8420,
                8439
            ],
            [
                8439,
                8456
            ],
            [
                8456,
                8482
            ],
            [
                8482,
                8589
            ],
            [
                8589,
                8610
            ],
            [
                8610,
                8641
            ],
            [
                8641,
                8690
            ],
            [
                8690,
                8750
            ],
            [
                8750,
                8801
            ],
            [
                8801,
                8903
            ],
            [
                8903,
                9047
            ],
            [
                9047,
                9210
            ],
            [
                9210,
                9497
            ],
            [
                9497,
                9648
            ],
            [
                9648,
                9841
            ],
            [
                9841,
                9885
            ],
            [
                9885,
                9931
            ],
            [
                9931,
                9969
            ],
            [
                9969,
                10047
            ],
            [
                10047,
                10117
            ],
            [
                10117,
                10218
            ],
            [
                10218,
                10263
            ],
            [
                10263,
                10342
            ],
            [
                10342,
                10397
            ],
            [
                10397,
                10440
            ],
            [
                10440,
                10474
            ],
            [
                10474,
                10652
            ],
            [
                10652,
                10687
            ],
            [
                10687,
                10722
            ],
            [
                10722,
                10745
            ],
            [
                10745,
                10768
            ],
            [
                10768,
                10796
            ],
            [
                10796,
                10855
            ],
            [
                10855,
                10908
            ],
            [
                10908,
                10970
            ],
            [
                10970,
                11040
            ],
            [
                11040,
                11089
            ],
            [
                11089,
                11163
            ],
            [
                11163,
                11246
            ],
            [
                11246,
                11352
            ],
            [
                11352,
                11399
            ],
            [
                11399,
                11436
            ],
            [
                11436,
                11544
            ],
            [
                11544,
                11564
            ],
            [
                11564,
                11601
            ],
            [
                11601,
                11652
            ],
            [
                11652,
                11892
            ],
            [
                11892,
                12157
            ],
            [
                12157,
                12246
            ],
            [
                12246,
                12271
            ],
            [
                12271,
                12302
            ],
            [
                12302,
                12336
            ],
            [
                12336,
                12562
            ],
            [
                12562,
                12582
            ],
            [
                12582,
                12633
            ],
            [
                12633,
                12712
            ],
            [
                12712,
                12989
            ],
            [
                12989,
                13526
            ],
            [
                13526,
                13857
            ],
            [
                13857,
                14032
            ],
            [
                14032,
                14267
            ],
            [
                14267,
                14665
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                74,
                160
            ],
            [
                185,
                208
            ],
            [
                181,
                184
            ],
            [
                268,
                269
            ],
            [
                303,
                325
            ],
            [
                351,
                405
            ],
            [
                406,
                429
            ],
            [
                435,
                444
            ],
            [
                444,
                509
            ],
            [
                510,
                618
            ],
            [
                636,
                650
            ],
            [
                668,
                700
            ],
            [
                755,
                814
            ],
            [
                814,
                833
            ],
            [
                867,
                1037
            ],
            [
                1041,
                1068
            ],
            [
                1121,
                1123
            ],
            [
                1123,
                1227
            ],
            [
                1229,
                1234
            ],
            [
                1236,
                1250
            ],
            [
                1271,
                1343
            ],
            [
                1476,
                1526
            ],
            [
                1539,
                1599
            ],
            [
                1600,
                1642
            ],
            [
                1642,
                1682
            ],
            [
                1715,
                1813
            ],
            [
                1845,
                1871
            ],
            [
                1885,
                1894
            ],
            [
                1921,
                1923
            ],
            [
                1923,
                1969
            ],
            [
                1984,
                1996
            ],
            [
                2061,
                2068
            ],
            [
                2070,
                2074
            ],
            [
                2076,
                2091
            ],
            [
                2091,
                2125
            ],
            [
                2125,
                2146
            ],
            [
                2146,
                2188
            ],
            [
                2188,
                2200
            ],
            [
                2202,
                2206
            ],
            [
                2207,
                2220
            ],
            [
                2616,
                2631
            ],
            [
                2644,
                2645
            ],
            [
                2742,
                2776
            ],
            [
                2802,
                2877
            ],
            [
                2888,
                2949
            ],
            [
                2949,
                2997
            ],
            [
                2997,
                3017
            ],
            [
                3023,
                3035
            ],
            [
                3035,
                3063
            ],
            [
                3063,
                3108
            ],
            [
                3132,
                3180
            ],
            [
                3180,
                3187
            ],
            [
                3189,
                3195
            ],
            [
                3197,
                3203
            ],
            [
                3306,
                3347
            ],
            [
                3347,
                3366
            ],
            [
                3373,
                3404
            ],
            [
                3425,
                3456
            ],
            [
                3456,
                3514
            ],
            [
                3635,
                3641
            ],
            [
                3619,
                3633
            ],
            [
                3642,
                3706
            ],
            [
                3738,
                3740
            ],
            [
                3740,
                3796
            ],
            [
                3821,
                3832
            ],
            [
                3878,
                3887
            ],
            [
                3908,
                3944
            ],
            [
                3948,
                3982
            ],
            [
                3984,
                3986
            ],
            [
                3988,
                4019
            ],
            [
                4103,
                4115
            ],
            [
                4119,
                4121
            ],
            [
                4121,
                4241
            ],
            [
                4374,
                4376
            ],
            [
                4376,
                4431
            ],
            [
                4431,
                4468
            ],
            [
                4468,
                4486
            ],
            [
                4497,
                4506
            ],
            [
                4506,
                4547
            ],
            [
                4652,
                4654
            ],
            [
                4654,
                4701
            ],
            [
                4714,
                4848
            ],
            [
                4930,
                4996
            ],
            [
                5001,
                5004
            ],
            [
                5040,
                5067
            ],
            [
                5084,
                5085
            ],
            [
                5137,
                5251
            ],
            [
                5252,
                5293
            ],
            [
                5397,
                5418
            ],
            [
                5423,
                5465
            ],
            [
                5488,
                5490
            ],
            [
                5492,
                5522
            ],
            [
                5601,
                5604
            ],
            [
                5549,
                5555
            ],
            [
                5625,
                5669
            ],
            [
                5669,
                5712
            ],
            [
                5759,
                5796
            ],
            [
                5796,
                5865
            ],
            [
                5873,
                6025
            ],
            [
                6078,
                6104
            ],
            [
                6065,
                6077
            ],
            [
                6106,
                6201
            ],
            [
                6201,
                6221
            ],
            [
                6223,
                6227
            ],
            [
                6229,
                6253
            ],
            [
                6271,
                6281
            ],
            [
                6369,
                6374
            ],
            [
                6324,
                6330
            ],
            [
                6405,
                6407
            ],
            [
                6407,
                6410
            ],
            [
                6443,
                6454
            ],
            [
                6460,
                6493
            ],
            [
                6511,
                6540
            ],
            [
                6564,
                6566
            ],
            [
                6566,
                6588
            ],
            [
                6605,
                6670
            ],
            [
                6670,
                6733
            ],
            [
                6733,
                6759
            ],
            [
                6759,
                6881
            ],
            [
                6881,
                6995
            ],
            [
                7001,
                7023
            ],
            [
                7023,
                7043
            ],
            [
                7045,
                7050
            ],
            [
                7052,
                7153
            ],
            [
                7174,
                7206
            ],
            [
                7206,
                7259
            ],
            [
                7272,
                7274
            ],
            [
                7274,
                7357
            ],
            [
                7375,
                7406
            ],
            [
                7406,
                7469
            ],
            [
                7484,
                7505
            ],
            [
                7505,
                7576
            ],
            [
                7587,
                7690
            ],
            [
                7698,
                7793
            ],
            [
                7836,
                7847
            ],
            [
                7847,
                7869
            ],
            [
                7900,
                7971
            ],
            [
                7971,
                8010
            ],
            [
                8159,
                8242
            ],
            [
                8244,
                8259
            ],
            [
                8439,
                8456
            ],
            [
                8456,
                8482
            ],
            [
                8482,
                8506
            ],
            [
                8522,
                8526
            ],
            [
                8587,
                8589
            ],
            [
                8589,
                8610
            ],
            [
                8610,
                8641
            ],
            [
                8641,
                8690
            ],
            [
                8750,
                8799
            ],
            [
                8903,
                8908
            ],
            [
                9013,
                9047
            ],
            [
                9047,
                9111
            ],
            [
                9208,
                9210
            ],
            [
                9210,
                9247
            ],
            [
                9253,
                9285
            ],
            [
                9648,
                9649
            ],
            [
                9788,
                9799
            ],
            [
                9807,
                9822
            ],
            [
                9826,
                9839
            ],
            [
                9693,
                9715
            ],
            [
                9839,
                9841
            ],
            [
                9841,
                9852
            ],
            [
                9854,
                9859
            ],
            [
                9861,
                9885
            ],
            [
                9931,
                9969
            ],
            [
                9969,
                10008
            ],
            [
                10012,
                10016
            ],
            [
                10029,
                10047
            ],
            [
                10047,
                10117
            ],
            [
                10117,
                10141
            ],
            [
                10157,
                10218
            ],
            [
                10218,
                10263
            ],
            [
                10397,
                10440
            ],
            [
                10440,
                10443
            ],
            [
                10445,
                10449
            ],
            [
                10451,
                10474
            ],
            [
                10474,
                10574
            ],
            [
                10586,
                10616
            ],
            [
                10650,
                10652
            ],
            [
                10652,
                10687
            ],
            [
                10768,
                10796
            ],
            [
                10796,
                10855
            ],
            [
                10855,
                10906
            ],
            [
                10970,
                11040
            ],
            [
                11040,
                11069
            ],
            [
                11087,
                11089
            ],
            [
                11089,
                11152
            ],
            [
                11153,
                11163
            ],
            [
                11163,
                11231
            ],
            [
                11240,
                11243
            ],
            [
                11246,
                11352
            ],
            [
                11352,
                11399
            ],
            [
                11436,
                11476
            ],
            [
                11488,
                11544
            ],
            [
                11544,
                11564
            ],
            [
                11601,
                11617
            ],
            [
                11622,
                11652
            ],
            [
                11652,
                11698
            ],
            [
                11711,
                11805
            ],
            [
                11890,
                11892
            ],
            [
                11892,
                11925
            ],
            [
                11948,
                12157
            ],
            [
                12157,
                12205
            ],
            [
                12244,
                12246
            ],
            [
                12246,
                12271
            ],
            [
                12271,
                12302
            ],
            [
                12302,
                12336
            ],
            [
                12336,
                12356
            ],
            [
                12358,
                12360
            ],
            [
                12362,
                12426
            ],
            [
                12428,
                12431
            ],
            [
                12433,
                12450
            ],
            [
                12461,
                12502
            ],
            [
                12562,
                12582
            ],
            [
                12582,
                12616
            ],
            [
                12627,
                12633
            ],
            [
                12633,
                12712
            ],
            [
                12716,
                12762
            ],
            [
                12810,
                12860
            ],
            [
                12927,
                12930
            ],
            [
                12987,
                12989
            ],
            [
                12989,
                13004
            ],
            [
                13031,
                13074
            ],
            [
                13091,
                13130
            ],
            [
                13155,
                13267
            ],
            [
                13139,
                13140
            ],
            [
                13325,
                13373
            ],
            [
                13464,
                13466
            ],
            [
                13312,
                13315
            ],
            [
                13375,
                13378
            ],
            [
                13384,
                13440
            ],
            [
                13300,
                13303
            ],
            [
                13447,
                13464
            ],
            [
                13601,
                13626
            ],
            [
                13635,
                13638
            ],
            [
                13648,
                13658
            ],
            [
                13667,
                13705
            ],
            [
                13558,
                13561
            ],
            [
                13727,
                13739
            ],
            [
                13752,
                13779
            ],
            [
                13788,
                13857
            ],
            [
                13871,
                13874
            ],
            [
                13908,
                13968
            ],
            [
                13991,
                13999
            ],
            [
                14030,
                14032
            ],
            [
                14032,
                14049
            ],
            [
                14054,
                14129
            ],
            [
                14143,
                14155
            ],
            [
                14206,
                14267
            ],
            [
                14267,
                14296
            ],
            [
                14434,
                14436
            ],
            [
                14325,
                14344
            ],
            [
                14368,
                14430
            ],
            [
                14345,
                14348
            ],
            [
                14450,
                14453
            ],
            [
                14454,
                14459
            ],
            [
                14470,
                14558
            ],
            [
                14564,
                14665
            ]
        ],
        "row_chars": [
            [
                0,
                58
            ],
            [
                58,
                406
            ],
            [
                406,
                444
            ],
            [
                444,
                814
            ],
            [
                814,
                1123
            ],
            [
                1123,
                1600
            ],
            [
                1600,
                1642
            ],
            [
                1642,
                1923
            ],
            [
                1923,
                2091
            ],
            [
                2091,
                2125
            ],
            [
                2125,
                2146
            ],
            [
                2146,
                2188
            ],
            [
                2188,
                2222
            ],
            [
                2222,
                2260
            ],
            [
                2260,
                2310
            ],
            [
                2310,
                2356
            ],
            [
                2356,
                2405
            ],
            [
                2405,
                2506
            ],
            [
                2506,
                2616
            ],
            [
                2616,
                2776
            ],
            [
                2776,
                2949
            ],
            [
                2949,
                2997
            ],
            [
                2997,
                3035
            ],
            [
                3035,
                3063
            ],
            [
                3063,
                3108
            ],
            [
                3108,
                3132
            ],
            [
                3132,
                3180
            ],
            [
                3180,
                3203
            ],
            [
                3203,
                3229
            ],
            [
                3229,
                3306
            ],
            [
                3306,
                3347
            ],
            [
                3347,
                3404
            ],
            [
                3404,
                3456
            ],
            [
                3456,
                3740
            ],
            [
                3740,
                3944
            ],
            [
                3944,
                4019
            ],
            [
                4019,
                4062
            ],
            [
                4062,
                4103
            ],
            [
                4103,
                4121
            ],
            [
                4121,
                4376
            ],
            [
                4376,
                4431
            ],
            [
                4431,
                4468
            ],
            [
                4468,
                4506
            ],
            [
                4506,
                4654
            ],
            [
                4654,
                4848
            ],
            [
                4848,
                5067
            ],
            [
                5067,
                5252
            ],
            [
                5252,
                5293
            ],
            [
                5293,
                5397
            ],
            [
                5397,
                5669
            ],
            [
                5669,
                5796
            ],
            [
                5796,
                6025
            ],
            [
                6025,
                6106
            ],
            [
                6106,
                6201
            ],
            [
                6201,
                6407
            ],
            [
                6407,
                6566
            ],
            [
                6566,
                6670
            ],
            [
                6670,
                6733
            ],
            [
                6733,
                6759
            ],
            [
                6759,
                6881
            ],
            [
                6881,
                7023
            ],
            [
                7023,
                7153
            ],
            [
                7153,
                7206
            ],
            [
                7206,
                7274
            ],
            [
                7274,
                7406
            ],
            [
                7406,
                7505
            ],
            [
                7505,
                7847
            ],
            [
                7847,
                7869
            ],
            [
                7869,
                7900
            ],
            [
                7900,
                7971
            ],
            [
                7971,
                8010
            ],
            [
                8010,
                8038
            ],
            [
                8038,
                8159
            ],
            [
                8159,
                8244
            ],
            [
                8244,
                8297
            ],
            [
                8297,
                8389
            ],
            [
                8389,
                8420
            ],
            [
                8420,
                8439
            ],
            [
                8439,
                8456
            ],
            [
                8456,
                8482
            ],
            [
                8482,
                8589
            ],
            [
                8589,
                8610
            ],
            [
                8610,
                8641
            ],
            [
                8641,
                8690
            ],
            [
                8690,
                8750
            ],
            [
                8750,
                8801
            ],
            [
                8801,
                8903
            ],
            [
                8903,
                9047
            ],
            [
                9047,
                9210
            ],
            [
                9210,
                9497
            ],
            [
                9497,
                9648
            ],
            [
                9648,
                9841
            ],
            [
                9841,
                9885
            ],
            [
                9885,
                9931
            ],
            [
                9931,
                9969
            ],
            [
                9969,
                10047
            ],
            [
                10047,
                10117
            ],
            [
                10117,
                10218
            ],
            [
                10218,
                10263
            ],
            [
                10263,
                10342
            ],
            [
                10342,
                10397
            ],
            [
                10397,
                10440
            ],
            [
                10440,
                10474
            ],
            [
                10474,
                10652
            ],
            [
                10652,
                10687
            ],
            [
                10687,
                10722
            ],
            [
                10722,
                10745
            ],
            [
                10745,
                10768
            ],
            [
                10768,
                10796
            ],
            [
                10796,
                10855
            ],
            [
                10855,
                10908
            ],
            [
                10908,
                10970
            ],
            [
                10970,
                11040
            ],
            [
                11040,
                11089
            ],
            [
                11089,
                11163
            ],
            [
                11163,
                11246
            ],
            [
                11246,
                11352
            ],
            [
                11352,
                11399
            ],
            [
                11399,
                11436
            ],
            [
                11436,
                11544
            ],
            [
                11544,
                11564
            ],
            [
                11564,
                11601
            ],
            [
                11601,
                11652
            ],
            [
                11652,
                11892
            ],
            [
                11892,
                12157
            ],
            [
                12157,
                12246
            ],
            [
                12246,
                12271
            ],
            [
                12271,
                12302
            ],
            [
                12302,
                12336
            ],
            [
                12336,
                12582
            ],
            [
                12582,
                12633
            ],
            [
                12633,
                12712
            ],
            [
                12712,
                12989
            ],
            [
                12989,
                13526
            ],
            [
                13526,
                13857
            ],
            [
                13857,
                14032
            ],
            [
                14032,
                14267
            ],
            [
                14267,
                14665
            ]
        ]
    },
    "abridged": {
        "text": "Fanny seemed nearer being right than Edmund had supposed. Finding a play that would suit everybody proved to be no trifle; and the carpenter had taken his measurements, and, with an enlargement of plan, was already at work, while a play was still to seek.\nOther preparations were in hand. An enormous roll of green baize had arrived from Northampton, and had been cut out by Mrs. Norris (with a saving by her good management of full three-quarters of a yard), and was being made into a curtain, and still the play was wanting. Edmund began almost to hope that none might ever be found.\nThere were, in fact, so many people to be pleased, so many best characters required, and, above all, such a need that the play should be at once both tragedy and comedy, that there did seem little chance of a decision.\nOn the tragic side were the Miss Bertrams, Henry Crawford, and Mr. Yates; on the comic, Tom Bertram, not quite alone, because Mary Crawford's wishes, though politely kept back, inclined the same way. They wanted a piece containing very few characters, but every character first-rate, and three principal women.\nAll the best plays were run over in vain. Neither Hamlet, nor Macbeth, nor Othello presented anything that could satisfy even the tragedians; and The Rivals, The School for Scandal, and a long et cetera, were dismissed. No piece could be proposed that did not supply a difficulty. \"Oh no, that will never do! Let us have no ranting tragedies. Too many characters. Not a tolerable woman's part in the play. Anything but that, my dear Tom.\"\nFanny looked on, amused, and wondering how it would end. She could have wished that something might be acted, for she had never seen a play, but everything of higher consequence was against it.\n\"This will never do,\" said Tom Bertram at last. \"We are wasting time abominably. Something must be fixed on. No matter what, so that something is chosen. A few characters too many must not frighten us. We must double them. From this moment I make no difficulties. I take any part you choose to give me, so as it be comic. I condition for nothing more.\"\nFor about the fifth time he then proposed the Heir at Law, trying unsuccessfully to persuade the others that there were some fine tragic parts in it.\nThe pause which followed this fruitless effort was ended when Tom, taking up a volume from the table, suddenly exclaimed-\"Lovers' Vows! Why should not Lovers' Vows do for us as well as for the Ravenshaws? What say you? Here are two capital tragic parts for Yates and Crawford, and here is the rhyming Butler for me, if nobody else wants it. And as for the rest, they may be filled up by anybody. It is only Count Cassel and Anhalt.\"\nThe suggestion was welcome. Everybody was growing weary of indecision. Mr. Yates was particularly pleased: he had been longing to do the Baron at Ecclesford, had grudged every rant of Lord Ravenshaw's, and been forced to re-rant it all in his own room. With the advantage of knowing half the scenes by heart already, he now offered his services for the part. Then, remembering that there was some very good ranting-ground in Frederick, he professed an equal willingness for that.\nHenry Crawford was ready to take either. Miss Bertram, feeling the interest of an Agatha in the question, decided it by observing to Mr. Yates that his height seemed to fit him peculiarly for the Baron. She was acknowledged to be quite right, and was certain of the proper Frederick. Three of the characters were now cast, besides Mr. Rushworth, who was answered for by Maria as willing to do anything; when Julia, meaning, like her sister, to be Agatha, began to be scrupulous on Miss Crawford's account.\n\"Here are not women enough,\" said she. \"Amelia and Agatha may do for Maria and me, but here is nothing for your sister, Mr. Crawford.\"\nMr. Crawford desired that might not be thought of: his sister wished only to be useful. But Tom Bertram asserted the part of Amelia to be the property of Miss Crawford. \"It falls as naturally to her,\" said he, \"as Agatha does to one or other of my sisters. It can be no sacrifice on their side, for it is highly comic.\"\nA short silence followed. Each sister looked anxious; for each felt the best claim to Agatha, and was hoping to have it pressed on her by the rest. Henry Crawford, who meanwhile had taken up the play, and with seeming carelessness was turning over the first act, settled the business.\n\"I must entreat Miss Julia Bertram,\" said he, \"not to engage in the part of Agatha, or it will be the ruin of all my solemnity. Indeed you must not\" (turning to her). \"I could not stand your countenance dressed up in woe. The many laughs we have had together would infallibly come across me, and Frederick would be obliged to run away.\"\nPleasantly, courteously, it was spoken; but the manner was lost to Julia's feelings. She saw a glance at Maria which confirmed the injury to herself: it was a trick; she was slighted, Maria was preferred; the smile of triumph which Maria was trying to suppress showed how well it was understood; and before Julia could command herself enough to speak, her brother said, \"Oh yes! Maria must be Agatha. Though Julia fancies she prefers tragedy, I would not trust her in it. There is nothing of tragedy about her. She had better do the old countrywoman: the Cottager's wife; you had, indeed, Julia.\"\n\"Cottager's wife!\" cried Mr. Yates. \"What are you talking of? The most trivial, paltry part. Your sister do that! It is an insult to propose it. At Ecclesford the governess was to have done it. A little more justice, Mr. Manager, if you please.\"\n\"Why, I mean no disparagement to Julia. We cannot have two Agathas, and we must have one Cottager's wife. If the part is trifling she will have credit in making something of it.\"\n\"We must not let her good-nature be imposed on,\" said Henry Crawford. \"We must not allow her to accept the part. Her talents will be wanted in Amelia. Amelia is a character more difficult to act well than even Agatha. I consider Amelia is the most difficult character in the whole piece. It requires great powers to give her playfulness and simplicity without extravagance. I have seen good actresses fail in the part. It requires a gentlewoman-a Julia Bertram. You will undertake it, I hope?\" turning to her with a look of anxious entreaty, which softened her a little; but while she hesitated, her brother again interposed.\n\"No, no, Julia must not be Amelia. She is too tall and robust. Amelia should be a small, light, girlish, skipping figure. It is fit for Miss Crawford, and Miss Crawford only.\"\nWithout attending to this, Henry Crawford continued his supplication. \"You must oblige us,\" said he. \"When you have studied the character, I am sure you will feel it will suit you. Tragedy may be your choice, but it will certainly appear that comedy chooses you. You will be to visit me in prison with a basket of provisions; you will not refuse to visit me in prison? I think I see you coming in with your basket.\"\nJulia wavered; but was he only trying to pacify her, and make her overlook the previous affront? She distrusted him. He was, perhaps, at treacherous play with her. She looked suspiciously at her sister; Maria's face was to decide it: if she were vexed and alarmed-but Maria looked all serenity and satisfaction. With hasty indignation, therefore, she said to him, \"You do not seem afraid of not keeping your countenance when I come in with a basket of provisions-though one might have supposed-but it is only as Agatha that I was to be so overpowering!\" She stopped-Henry Crawford looked rather foolish. Tom Bertram began again-\n\"Miss Crawford must be Amelia. She will be an excellent Amelia.\"\n\"Do not be afraid of my wanting the character,\" cried Julia, with angry quickness: \"I am not to be Agatha, and I will do nothing else; and as to Amelia, I quite detest her. An odious, little, pert, unnatural girl. I have always protested against comedy, and this is comedy in its worst form.\" So saying, she walked hastily out of the room, exciting small compassion in any except Fanny, who pitied her jealousy.\nA short silence followed; but her brother soon returned to business, and was eagerly looking over the play to ascertain what scenery would be necessary-while Maria and Henry Crawford conversed together in an under-voice. \"I would give up the part to Julia most willingly,\" said Maria, \"but though I shall probably do it very ill, I feel persuaded she would do it worse.\"\nTom Bertram and Mr. Yates walked off to consult in the room now beginning to be called the Theatre; Miss Bertram resolved to go down to the Parsonage with the offer of Amelia to Miss Crawford; and Fanny remained alone.\nShe took up the volume which had been left on the table, and begin to read the play. Her curiosity was awake, and she ran through it with an eagerness which was suspended only by astonishment that it could be proposed and accepted in a private theatre! Agatha and Amelia appeared to be so totally improper-the situation of one, and the language of the other, so unfit for any modest woman, that she could hardly suppose her cousins could be aware of what they were engaging in. She longed to have them roused as soon as possible by the remonstrance which Edmund would certainly make.",
        "paragraph_chars": [
            [
                0,
                256
            ],
            [
                256,
                586
            ],
            [
                586,
                805
            ],
            [
                805,
                1116
            ],
            [
                1116,
                1555
            ],
            [
                1555,
                1749
            ],
            [
                1749,
                2102
            ],
            [
                2102,
                2252
            ],
            [
                2252,
                2685
            ],
            [
                2685,
                3165
            ],
            [
                3165,
                3671
            ],
            [
                3671,
                3806
            ],
            [
                3806,
                4126
            ],
            [
                4126,
                4411
            ],
            [
                4411,
                4748
            ],
            [
                4748,
                5345
            ],
            [
                5345,
                5591
            ],
            [
                5591,
                5770
            ],
            [
                5770,
                6396
            ],
            [
                6396,
                6572
            ],
            [
                6572,
                6988
            ],
            [
                6988,
                7617
            ],
            [
                7617,
                7682
            ],
            [
                7682,
                8094
            ],
            [
                8094,
                8465
            ],
            [
                8465,
                8684
            ],
            [
                8684,
                9267
            ]
        ],
        "segment_chars": [
            [
                0,
                58
            ],
            [
                58,
                256
            ],
            [
                256,
                289
            ],
            [
                289,
                527
            ],
            [
                527,
                586
            ],
            [
                586,
                805
            ],
            [
                805,
                1005
            ],
            [
                1005,
                1116
            ],
            [
                1116,
                1158
            ],
            [
                1158,
                1336
            ],
            [
                1336,
                1397
            ],
            [
                1397,
                1425
            ],
            [
                1425,
                1459
            ],
            [
                1459,
                1480
            ],
            [
                1480,
                1522
            ],
            [
                1522,
                1555
            ],
            [
                1555,
                1612
            ],
            [
                1612,
                1749
            ],
            [
                1749,
                1797
            ],
            [
                1797,
                1830
            ],
            [
                1830,
                1858
            ],
            [
                1858,
                1903
            ],
            [
                1903,
                1951
            ],
            [
                1951,
                1972
            ],
            [
                1972,
                2013
            ],
            [
                2013,
                2071
            ],
            [
                2071,
                2102
            ],
            [
                2102,
                2252
            ],
            [
                2252,
                2388
            ],
            [
                2388,
                2457
            ],
            [
                2457,
                2471
            ],
            [
                2471,
                2593
            ],
            [
                2593,
                2648
            ],
            [
                2648,
                2685
            ],
            [
                2685,
                2713
            ],
            [
                2713,
                2756
            ],
            [
                2756,
                2938
            ],
            [
                2938,
                3044
            ],
            [
                3044,
                3165
            ],
            [
                3165,
                3206
            ],
            [
                3206,
                3368
            ],
            [
                3368,
                3449
            ],
            [
                3449,
                3671
            ],
            [
                3671,
                3710
            ],
            [
                3710,
                3806
            ],
            [
                3806,
                3894
            ],
            [
                3894,
                3975
            ],
            [
                3975,
                4063
            ],
            [
                4063,
                4126
            ],
            [
                4126,
                4152
            ],
            [
                4152,
                4274
            ],
            [
                4274,
                4411
            ],
            [
                4411,
                4539
            ],
            [
                4539,
                4578
            ],
            [
                4578,
                4633
            ],
            [
                4633,
                4748
            ],
            [
                4748,
                4833
            ],
            [
                4833,
                5127
            ],
            [
                5127,
                5149
            ],
            [
                5149,
                5220
            ],
            [
                5220,
                5259
            ],
            [
                5259,
                5345
            ],
            [
                5345,
                5364
            ],
            [
                5364,
                5381
            ],
            [
                5381,
                5407
            ],
            [
                5407,
                5438
            ],
            [
                5438,
                5459
            ],
            [
                5459,
                5490
            ],
            [
                5490,
                5539
            ],
            [
                5539,
                5591
            ],
            [
                5591,
                5631
            ],
            [
                5631,
                5697
            ],
            [
                5697,
                5770
            ],
            [
                5770,
                5840
            ],
            [
                5840,
                5883
            ],
            [
                5883,
                5921
            ],
            [
                5921,
                5988
            ],
            [
                5988,
                6058
            ],
            [
                6058,
                6144
            ],
            [
                6144,
                6189
            ],
            [
                6189,
                6232
            ],
            [
                6232,
                6264
            ],
            [
                6264,
                6396
            ],
            [
                6396,
                6431
            ],
            [
                6431,
                6459
            ],
            [
                6459,
                6518
            ],
            [
                6518,
                6572
            ],
            [
                6572,
                6642
            ],
            [
                6642,
                6673
            ],
            [
                6673,
                6753
            ],
            [
                6753,
                6835
            ],
            [
                6835,
                6941
            ],
            [
                6941,
                6988
            ],
            [
                6988,
                7085
            ],
            [
                7085,
                7105
            ],
            [
                7105,
                7152
            ],
            [
                7152,
                7300
            ],
            [
                7300,
                7542
            ],
            [
                7542,
                7592
            ],
            [
                7592,
                7617
            ],
            [
                7617,
                7648
            ],
            [
                7648,
                7682
            ],
            [
                7682,
                7855
            ],
            [
                7855,
                7896
            ],
            [
                7896,
                7975
            ],
            [
                7975,
                8094
            ],
            [
                8094,
                8315
            ],
            [
                8315,
                8465
            ],
            [
                8465,
                8684
            ],
            [
                8684,
                8769
            ],
            [
                8769,
                8937
            ],
            [
                8937,
                9162
            ],
            [
                9162,
                9267
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                58,
                144
            ],
            [
                145,
                168
            ],
            [
                169,
                172
            ],
            [
                172,
                173
            ],
            [
                179,
                201
            ],
            [
                201,
                255
            ],
            [
                256,
                279
            ],
            [
                280,
                289
            ],
            [
                289,
                354
            ],
            [
                359,
                467
            ],
            [
                479,
                493
            ],
            [
                493,
                525
            ],
            [
                527,
                586
            ],
            [
                586,
                605
            ],
            [
                605,
                775
            ],
            [
                776,
                803
            ],
            [
                803,
                805
            ],
            [
                805,
                909
            ],
            [
                910,
                915
            ],
            [
                916,
                930
            ],
            [
                931,
                1003
            ],
            [
                1005,
                1055
            ],
            [
                1055,
                1115
            ],
            [
                1116,
                1158
            ],
            [
                1158,
                1198
            ],
            [
                1199,
                1297
            ],
            [
                1298,
                1324
            ],
            [
                1325,
                1334
            ],
            [
                1334,
                1336
            ],
            [
                1336,
                1382
            ],
            [
                1383,
                1395
            ],
            [
                1397,
                1404
            ],
            [
                1405,
                1409
            ],
            [
                1410,
                1425
            ],
            [
                1425,
                1459
            ],
            [
                1459,
                1480
            ],
            [
                1480,
                1522
            ],
            [
                1522,
                1534
            ],
            [
                1535,
                1539
            ],
            [
                1539,
                1552
            ],
            [
                1555,
                1570
            ],
            [
                1570,
                1571
            ],
            [
                1578,
                1612
            ],
            [
                1612,
                1687
            ],
            [
                1688,
                1749
            ],
            [
                1749,
                1797
            ],
            [
                1797,
                1817
            ],
            [
                1818,
                1830
            ],
            [
                1830,
                1858
            ],
            [
                1858,
                1903
            ],
            [
                1903,
                1951
            ],
            [
                1951,
                1958
            ],
            [
                1959,
                1965
            ],
            [
                1966,
                1972
            ],
            [
                1972,
                2013
            ],
            [
                2013,
                2032
            ],
            [
                2040,
                2071
            ],
            [
                2071,
                2102
            ],
            [
                2102,
                2160
            ],
            [
                2161,
                2167
            ],
            [
                2168,
                2182
            ],
            [
                2183,
                2247
            ],
            [
                2250,
                2252
            ],
            [
                2252,
                2308
            ],
            [
                2317,
                2328
            ],
            [
                2343,
                2352
            ],
            [
                2352,
                2388
            ],
            [
                2388,
                2422
            ],
            [
                2423,
                2425
            ],
            [
                2426,
                2457
            ],
            [
                2457,
                2469
            ],
            [
                2469,
                2471
            ],
            [
                2471,
                2591
            ],
            [
                2591,
                2593
            ],
            [
                2593,
                2648
            ],
            [
                2648,
                2685
            ],
            [
                2685,
                2703
            ],
            [
                2704,
                2713
            ],
            [
                2713,
                2754
            ],
            [
                2754,
                2756
            ],
            [
                2756,
                2803
            ],
            [
                2804,
                2938
            ],
            [
                2938,
                3004
            ],
            [
                3005,
                3008
            ],
            [
                3017,
                3044
            ],
            [
                3048,
                3049
            ],
            [
                3050,
                3164
            ],
            [
                3165,
                3206
            ],
            [
                3206,
                3227
            ],
            [
                3228,
                3270
            ],
            [
                3279,
                3281
            ],
            [
                3282,
                3312
            ],
            [
                3313,
                3316
            ],
            [
                3317,
                3323
            ],
            [
                3324,
                3368
            ],
            [
                3368,
                3411
            ],
            [
                3412,
                3449
            ],
            [
                3449,
                3518
            ],
            [
                3519,
                3671
            ],
            [
                3671,
                3697
            ],
            [
                3697,
                3709
            ],
            [
                3711,
                3806
            ],
            [
                3806,
                3826
            ],
            [
                3827,
                3831
            ],
            [
                3832,
                3856
            ],
            [
                3857,
                3867
            ],
            [
                3880,
                3885
            ],
            [
                3886,
                3892
            ],
            [
                3892,
                3894
            ],
            [
                3894,
                3897
            ],
            [
                3898,
                3909
            ],
            [
                3910,
                3943
            ],
            [
                3944,
                3973
            ],
            [
                3973,
                3975
            ],
            [
                3975,
                3997
            ],
            [
                3998,
                4063
            ],
            [
                4063,
                4126
            ],
            [
                4126,
                4152
            ],
            [
                4152,
                4274
            ],
            [
                4274,
                4388
            ],
            [
                4389,
                4411
            ],
            [
                4411,
                4431
            ],
            [
                4432,
                4437
            ],
            [
                4438,
                4539
            ],
            [
                4546,
                4578
            ],
            [
                4578,
                4631
            ],
            [
                4631,
                4633
            ],
            [
                4633,
                4716
            ],
            [
                4717,
                4748
            ],
            [
                4748,
                4811
            ],
            [
                4812,
                4833
            ],
            [
                4833,
                4904
            ],
            [
                4905,
                5008
            ],
            [
                5016,
                5111
            ],
            [
                5116,
                5127
            ],
            [
                5127,
                5149
            ],
            [
                5149,
                5220
            ],
            [
                5220,
                5259
            ],
            [
                5259,
                5342
            ],
            [
                5346,
                5361
            ],
            [
                5364,
                5381
            ],
            [
                5381,
                5407
            ],
            [
                5407,
                5431
            ],
            [
                5432,
                5436
            ],
            [
                5436,
                5438
            ],
            [
                5438,
                5459
            ],
            [
                5459,
                5490
            ],
            [
                5490,
                5539
            ],
            [
                5539,
                5588
            ],
            [
                5591,
                5596
            ],
            [
                5597,
                5631
            ],
            [
                5631,
                5695
            ],
            [
                5695,
                5697
            ],
            [
                5697,
                5734
            ],
            [
                5735,
                5767
            ],
            [
                5770,
                5771
            ],
            [
                5771,
                5782
            ],
            [
                5787,
                5802
            ],
            [
                5803,
                5816
            ],
            [
                5816,
                5838
            ],
            [
                5838,
                5840
            ],
            [
                5841,
                5852
            ],
            [
                5853,
                5858
            ],
            [
                5859,
                5883
            ],
            [
                5883,
                5921
            ],
            [
                5921,
                5960
            ],
            [
                5965,
                5969
            ],
            [
                5970,
                5988
            ],
            [
                5988,
                6058
            ],
            [
                6058,
                6082
            ],
            [
                6083,
                6144
            ],
            [
                6144,
                6189
            ],
            [
                6189,
                6232
            ],
            [
                6232,
                6235
            ],
            [
                6236,
                6240
            ],
            [
                6241,
                6264
            ],
            [
                6264,
                6364
            ],
            [
                6364,
                6394
            ],
            [
                6394,
                6396
            ],
            [
                6396,
                6431
            ],
            [
                6431,
                6459
            ],
            [
                6459,
                6518
            ],
            [
                6518,
                6569
            ],
            [
                6572,
                6642
            ],
            [
                6642,
                6671
            ],
            [
                6671,
                6673
            ],
            [
                6674,
                6737
            ],
            [
                6743,
                6753
            ],
            [
                6753,
                6821
            ],
            [
                6830,
                6833
            ],
            [
                6835,
                6941
            ],
            [
                6941,
                6988
            ],
            [
                6988,
                7028
            ],
            [
                7029,
                7085
            ],
            [
                7085,
                7105
            ],
            [
                7105,
                7121
            ],
            [
                7122,
                7152
            ],
            [
                7152,
                7198
            ],
            [
                7204,
                7298
            ],
            [
                7298,
                7300
            ],
            [
                7300,
                7333
            ],
            [
                7333,
                7542
            ],
            [
                7542,
                7590
            ],
            [
                7590,
                7592
            ],
            [
                7592,
                7617
            ],
            [
                7617,
                7648
            ],
            [
                7648,
                7682
            ],
            [
                7682,
                7702
            ],
            [
                7703,
                7705
            ],
            [
                7706,
                7770
            ],
            [
                7771,
                7774
            ],
            [
                7775,
                7792
            ],
            [
                7793,
                7834
            ],
            [
                7835,
                7855
            ],
            [
                7855,
                7889
            ],
            [
                7890,
                7896
            ],
            [
                7896,
                7975
            ],
            [
                7975,
                8021
            ],
            [
                8022,
                8072
            ],
            [
                8080,
                8083
            ],
            [
                8092,
                8094
            ],
            [
                8094,
                8109
            ],
            [
                8118,
                8161
            ],
            [
                8161,
                8200
            ],
            [
                8201,
                8313
            ],
            [
                8313,
                8314
            ],
            [
                8316,
                8364
            ],
            [
                8364,
                8366
            ],
            [
                8377,
                8380
            ],
            [
                8380,
                8383
            ],
            [
                8384,
                8440
            ],
            [
                8441,
                8444
            ],
            [
                8445,
                8462
            ],
            [
                8465,
                8490
            ],
            [
                8498,
                8501
            ],
            [
                8502,
                8512
            ],
            [
                8513,
                8551
            ],
            [
                8552,
                8555
            ],
            [
                8565,
                8577
            ],
            [
                8587,
                8614
            ],
            [
                8615,
                8684
            ],
            [
                8684,
                8687
            ],
            [
                8693,
                8753
            ],
            [
                8759,
                8767
            ],
            [
                8767,
                8769
            ],
            [
                8769,
                8786
            ],
            [
                8787,
                8862
            ],
            [
                8863,
                8875
            ],
            [
                8876,
                8937
            ],
            [
                8937,
                8966
            ],
            [
                8967,
                8969
            ],
            [
                8970,
                8989
            ],
            [
                8989,
                9051
            ],
            [
                9052,
                9055
            ],
            [
                9056,
                9059
            ],
            [
                9067,
                9072
            ],
            [
                9072,
                9160
            ],
            [
                9166,
                9267
            ]
        ],
        "row_chars": [
            [
                0,
                58
            ],
            [
                58,
                256
            ],
            [
                256,
                289
            ],
            [
                289,
                586
            ],
            [
                586,
                805
            ],
            [
                805,
                1116
            ],
            [
                1116,
                1158
            ],
            [
                1158,
                1336
            ],
            [
                1336,
                1425
            ],
            [
                1425,
                1459
            ],
            [
                1459,
                1480
            ],
            [
                1480,
                1522
            ],
            [
                1522,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1612
            ],
            [
                1612,
                1749
            ],
            [
                1749,
                1797
            ],
            [
                1797,
                1830
            ],
            [
                1830,
                1858
            ],
            [
                1858,
                1903
            ],
            [
                1903,
                1903
            ],
            [
                1903,
                1951
            ],
            [
                1951,
                1972
            ],
            [
                1972,
                1972
            ],
            [
                1972,
                1972
            ],
            [
                1972,
                2013
            ],
            [
                2013,
                2071
            ],
            [
                2071,
                2102
            ],
            [
                2102,
                2252
            ],
            [
                2252,
                2388
            ],
            [
                2388,
                2457
            ],
            [
                2457,
                2457
            ],
            [
                2457,
                2457
            ],
            [
                2457,
                2471
            ],
            [
                2471,
                2593
            ],
            [
                2593,
                2648
            ],
            [
                2648,
                2685
            ],
            [
                2685,
                2713
            ],
            [
                2713,
                2756
            ],
            [
                2756,
                2938
            ],
            [
                2938,
                3044
            ],
            [
                3044,
                3165
            ],
            [
                3165,
                3206
            ],
            [
                3206,
                3206
            ],
            [
                3206,
                3368
            ],
            [
                3368,
                3449
            ],
            [
                3449,
                3671
            ],
            [
                3671,
                3710
            ],
            [
                3710,
                3806
            ],
            [
                3806,
                3894
            ],
            [
                3894,
                3975
            ],
            [
                3975,
                4063
            ],
            [
                4063,
                4126
            ],
            [
                4126,
                4152
            ],
            [
                4152,
                4274
            ],
            [
                4274,
                4411
            ],
            [
                4411,
                4539
            ],
            [
                4539,
                4578
            ],
            [
                4578,
                4633
            ],
            [
                4633,
                4748
            ],
            [
                4748,
                4833
            ],
            [
                4833,
                5127
            ],
            [
                5127,
                5149
            ],
            [
                5149,
                5149
            ],
            [
                5149,
                5220
            ],
            [
                5220,
                5259
            ],
            [
                5259,
                5259
            ],
            [
                5259,
                5259
            ],
            [
                5259,
                5345
            ],
            [
                5345,
                5364
            ],
            [
                5364,
                5364
            ],
            [
                5364,
                5364
            ],
            [
                5364,
                5364
            ],
            [
                5364,
                5381
            ],
            [
                5381,
                5407
            ],
            [
                5407,
                5438
            ],
            [
                5438,
                5459
            ],
            [
                5459,
                5490
            ],
            [
                5490,
                5539
            ],
            [
                5539,
                5539
            ],
            [
                5539,
                5591
            ],
            [
                5591,
                5591
            ],
            [
                5591,
                5631
            ],
            [
                5631,
                5697
            ],
            [
                5697,
                5770
            ],
            [
                5770,
                5770
            ],
            [
                5770,
                5840
            ],
            [
                5840,
                5883
            ],
            [
                5883,
                5883
            ],
            [
                5883,
                5921
            ],
            [
                5921,
                5988
            ],
            [
                5988,
                6058
            ],
            [
                6058,
                6144
            ],
            [
                6144,
                6189
            ],
            [
                6189,
                6189
            ],
            [
                6189,
                6189
            ],
            [
                6189,
                6232
            ],
            [
                6232,
                6264
            ],
            [
                6264,
                6396
            ],
            [
                6396,
                6431
            ],
            [
                6431,
                6431
            ],
            [
                6431,
                6431
            ],
            [
                6431,
                6431
            ],
            [
                6431,
                6459
            ],
            [
                6459,
                6518
            ],
            [
                6518,
                6572
            ],
            [
                6572,
                6572
            ],
            [
                6572,
                6642
            ],
            [
                6642,
                6673
            ],
            [
                6673,
                6753
            ],
            [
                6753,
                6835
            ],
            [
                6835,
                6941
            ],
            [
                6941,
                6988
            ],
            [
                6988,
                6988
            ],
            [
                6988,
                7085
            ],
            [
                7085,
                7105
            ],
            [
                7105,
                7105
            ],
            [
                7105,
                7152
            ],
            [
                7152,
                7300
            ],
            [
                7300,
                7542
            ],
            [
                7542,
                7592
            ],
            [
                7592,
                7617
            ],
            [
                7617,
                7648
            ],
            [
                7648,
                7682
            ],
            [
                7682,
                7855
            ],
            [
                7855,
                7896
            ],
            [
                7896,
                7975
            ],
            [
                7975,
                8094
            ],
            [
                8094,
                8465
            ],
            [
                8465,
                8684
            ],
            [
                8684,
                8769
            ],
            [
                8769,
                8937
            ],
            [
                8937,
                9267
            ]
        ]
    }
}