{
    "original": {
        "text": "Miss Crawford accepted the part very readily; and soon after Miss Bertram's return from the Parsonage, Mr. Rushworth arrived, and another character was consequently cast. He had the offer of Count Cassel and Anhalt, and at first did not know which to chuse, and wanted Miss Bertram to direct him; but upon being made to understand the different style of the characters, and which was which, and recollecting that he had once seen the play in London, and had thought Anhalt a very stupid fellow, he soon decided for the Count. Miss Bertram approved the decision, for the less he had to learn the better; and though she could not sympathise in his wish that the Count and Agatha might be to act together, nor wait very patiently while he was slowly turning over the leaves with the hope of still discovering such a scene, she very kindly took his part in hand, and curtailed every speech that admitted being shortened; besides pointing out the necessity of his being very much dressed, and chusing his colours. Mr. Rushworth liked the idea of his finery very well, though affecting to despise it; and was too much engaged with what his own appearance would be to think of the others, or draw any of those conclusions, or feel any of that displeasure which Maria had been half prepared for.\nThus much was settled before Edmund, who had been out all the morning, knew anything of the matter; but when he entered the drawing-room before dinner, the buzz of discussion was high between Tom, Maria, and Mr. Yates; and Mr. Rushworth stepped forward with great alacrity to tell him the agreeable news.\n\"We have got a play,\" said he. \"It is to be Lovers' Vows; and I am to be Count Cassel, and am to come in first with a blue dress and a pink satin cloak, and afterwards am to have another fine fancy suit, by way of a shooting-dress. I do not know how I shall like it.\"\nFanny's eyes followed Edmund, and her heart beat for him as she heard this speech, and saw his look, and felt what his sensations must be.\n\"Lovers' Vows!\" in a tone of the greatest amazement, was his only reply to Mr. Rushworth, and he turned towards his brother and sisters as if hardly doubting a contradiction.\n\"Yes,\" cried Mr. Yates. \"After all our debatings and difficulties, we find there is nothing that will suit us altogether so well, nothing so unexceptionable, as Lovers' Vows. The wonder is that it should not have been thought of before. My stupidity was abominable, for here we have all the advantage of what I saw at Ecclesford; and it is so useful to have anything of a model! We have cast almost every part.\"\n\"But what do you do for women?\" said Edmund gravely, and looking at Maria.\nMaria blushed in spite of herself as she answered, \"I take the part which Lady Ravenshaw was to have done, and\" (with a bolder eye) \"Miss Crawford is to be Amelia.\"\n\"I should not have thought it the sort of play to be so easily filled up, with _us_,\" replied Edmund, turning away to the fire, where sat his mother, aunt, and Fanny, and seating himself with a look of great vexation.\nMr. Rushworth followed him to say, \"I come in three times, and have two-and-forty speeches. That's something, is not it? But I do not much like the idea of being so fine. I shall hardly know myself in a blue dress and a pink satin cloak.\"\nEdmund could not answer him. In a few minutes Mr. Bertram was called out of the room to satisfy some doubts of the carpenter; and being accompanied by Mr. Yates, and followed soon afterwards by Mr. Rushworth, Edmund almost immediately took the opportunity of saying, \"I cannot, before Mr. Yates, speak what I feel as to this play, without reflecting on his friends at Ecclesford; but I must now, my dear Maria, tell _you_, that I think it exceedingly unfit for private representation, and that I hope you will give it up. I cannot but suppose you _will_ when you have read it carefully over. Read only the first act aloud to either your mother or aunt, and see how you can approve it. It will not be necessary to send you to your _father's_ judgment, I am convinced.\"\n\"We see things very differently,\" cried Maria. \"I am perfectly acquainted with the play, I assure you; and with a very few omissions, and so forth, which will be made, of course, I can see nothing objectionable in it; and _I_ am not the _only_ young woman you find who thinks it very fit for private representation.\"\n\"I am sorry for it,\" was his answer; \"but in this matter it is _you_ who are to lead. _You_ must set the example. If others have blundered, it is your place to put them right, and shew them what true delicacy is. In all points of decorum _your_ conduct must be law to the rest of the party.\"\nThis picture of her consequence had some effect, for no one loved better to lead than Maria; and with far more good-humour she answered, \"I am much obliged to you, Edmund; you mean very well, I am sure: but I still think you see things too strongly; and I really cannot undertake to harangue all the rest upon a subject of this kind. _There_ would be the greatest indecorum, I think.\"\n\"Do you imagine that I could have such an idea in my head? No; let your conduct be the only harangue. Say that, on examining the part, you feel yourself unequal to it; that you find it requiring more exertion and confidence than you can be supposed to have. Say this with firmness, and it will be quite enough. All who can distinguish will understand your motive. The play will be given up, and your delicacy honoured as it ought.\"\n\"Do not act anything improper, my dear,\" said Lady Bertram. \"Sir Thomas would not like it.-Fanny, ring the bell; I must have my dinner.-To be sure, Julia is dressed by this time.\"\n\"I am convinced, madam,\" said Edmund, preventing Fanny, \"that Sir Thomas would not like it.\"\n\"There, my dear, do you hear what Edmund says?\"\n\"If I were to decline the part,\" said Maria, with renewed zeal, \"Julia would certainly take it.\"\n\"What!\" cried Edmund, \"if she knew your reasons!\"\n\"Oh! she might think the difference between us-the difference in our situations-that _she_ need not be so scrupulous as _I_ might feel necessary. I am sure she would argue so. No; you must excuse me; I cannot retract my consent; it is too far settled, everybody would be so disappointed, Tom would be quite angry; and if we are so very nice, we shall never act anything.\"\n\"I was just going to say the very same thing,\" said Mrs. Norris. \"If every play is to be objected to, you will act nothing, and the preparations will be all so much money thrown away, and I am sure _that_ would be a discredit to us all. I do not know the play; but, as Maria says, if there is anything a little too warm (and it is so with most of them) it can be easily left out. We must not be over-precise, Edmund. As Mr. Rushworth is to act too, there can be no harm. I only wish Tom had known his own mind when the carpenters began, for there was the loss of half a day's work about those side-doors. The curtain will be a good job, however. The maids do their work very well, and I think we shall be able to send back some dozens of the rings. There is no occasion to put them so very close together. I _am_ of some use, I hope, in preventing waste and making the most of things. There should always be one steady head to superintend so many young ones. I forgot to tell Tom of something that happened to me this very day. I had been looking about me in the poultry-yard, and was just coming out, when who should I see but Dick Jackson making up to the servants' hall-door with two bits of deal board in his hand, bringing them to father, you may be sure; mother had chanced to send him of a message to father, and then father had bid him bring up them two bits of board, for he could not no how do without them. I knew what all this meant, for the servants' dinner-bell was ringing at the very moment over our heads; and as I hate such encroaching people (the Jacksons are very encroaching, I have always said so: just the sort of people to get all they can), I said to the boy directly (a great lubberly fellow of ten years old, you know, who ought to be ashamed of himself), '_I'll_ take the boards to your father, Dick, so get you home again as fast as you can.' The boy looked very silly, and turned away without offering a word, for I believe I might speak pretty sharp; and I dare say it will cure him of coming marauding about the house for one while. I hate such greediness-so good as your father is to the family, employing the man all the year round!\"\nNobody was at the trouble of an answer; the others soon returned; and Edmund found that to have endeavoured to set them right must be his only satisfaction.\nDinner passed heavily. Mrs. Norris related again her triumph over Dick Jackson, but neither play nor preparation were otherwise much talked of, for Edmund's disapprobation was felt even by his brother, though he would not have owned it. Maria, wanting Henry Crawford's animating support, thought the subject better avoided. Mr. Yates, who was trying to make himself agreeable to Julia, found her gloom less impenetrable on any topic than that of his regret at her secession from their company; and Mr. Rushworth, having only his own part and his own dress in his head, had soon talked away all that could be said of either.\nBut the concerns of the theatre were suspended only for an hour or two: there was still a great deal to be settled; and the spirits of evening giving fresh courage, Tom, Maria, and Mr. Yates, soon after their being reassembled in the drawing-room, seated themselves in committee at a separate table, with the play open before them, and were just getting deep in the subject when a most welcome interruption was given by the entrance of Mr. and Miss Crawford, who, late and dark and dirty as it was, could not help coming, and were received with the most grateful joy.\n\"Well, how do you go on?\" and \"What have you settled?\" and \"Oh! we can do nothing without you,\" followed the first salutations; and Henry Crawford was soon seated with the other three at the table, while his sister made her way to Lady Bertram, and with pleasant attention was complimenting _her_. \"I must really congratulate your ladyship,\" said she, \"on the play being chosen; for though you have borne it with exemplary patience, I am sure you must be sick of all our noise and difficulties. The actors may be glad, but the bystanders must be infinitely more thankful for a decision; and I do sincerely give you joy, madam, as well as Mrs. Norris, and everybody else who is in the same predicament,\" glancing half fearfully, half slyly, beyond Fanny to Edmund.\nShe was very civilly answered by Lady Bertram, but Edmund said nothing. His being only a bystander was not disclaimed. After continuing in chat with the party round the fire a few minutes, Miss Crawford returned to the party round the table; and standing by them, seemed to interest herself in their arrangements till, as if struck by a sudden recollection, she exclaimed, \"My good friends, you are most composedly at work upon these cottages and alehouses, inside and out; but pray let me know my fate in the meanwhile. Who is to be Anhalt? What gentleman among you am I to have the pleasure of making love to?\"\nFor a moment no one spoke; and then many spoke together to tell the same melancholy truth, that they had not yet got any Anhalt. \"Mr. Rushworth was to be Count Cassel, but no one had yet undertaken Anhalt.\"\n\"I had my choice of the parts,\" said Mr. Rushworth; \"but I thought I should like the Count best, though I do not much relish the finery I am to have.\"\n\"You chose very wisely, I am sure,\" replied Miss Crawford, with a brightened look; \"Anhalt is a heavy part.\"\n\"_The_ _Count_ has two-and-forty speeches,\" returned Mr. Rushworth, \"which is no trifle.\"\n\"I am not at all surprised,\" said Miss Crawford, after a short pause, \"at this want of an Anhalt. Amelia deserves no better. Such a forward young lady may well frighten the men.\"\n\"I should be but too happy in taking the part, if it were possible,\" cried Tom; \"but, unluckily, the Butler and Anhalt are in together. I will not entirely give it up, however; I will try what can be done-I will look it over again.\"\n\"Your _brother_ should take the part,\" said Mr. Yates, in a low voice. \"Do not you think he would?\"\n\"_I_ shall not ask him,\" replied Tom, in a cold, determined manner.\nMiss Crawford talked of something else, and soon afterwards rejoined the party at the fire.\n\"They do not want me at all,\" said she, seating herself. \"I only puzzle them, and oblige them to make civil speeches. Mr. Edmund Bertram, as you do not act yourself, you will be a disinterested adviser; and, therefore, I apply to _you_. What shall we do for an Anhalt? Is it practicable for any of the others to double it? What is your advice?\"\n\"My advice,\" said he calmly, \"is that you change the play.\"\n\"_I_ should have no objection,\" she replied; \"for though I should not particularly dislike the part of Amelia if well supported, that is, if everything went well, I shall be sorry to be an inconvenience; but as they do not chuse to hear your advice at _that_ _table_\" (looking round), \"it certainly will not be taken.\"\nEdmund said no more.\n\"If _any_ part could tempt _you_ to act, I suppose it would be Anhalt,\" observed the lady archly, after a short pause; \"for he is a clergyman, you know.\"\n\"_That_ circumstance would by no means tempt me,\" he replied, \"for I should be sorry to make the character ridiculous by bad acting. It must be very difficult to keep Anhalt from appearing a formal, solemn lecturer; and the man who chuses the profession itself is, perhaps, one of the last who would wish to represent it on the stage.\"\nMiss Crawford was silenced, and with some feelings of resentment and mortification, moved her chair considerably nearer the tea-table, and gave all her attention to Mrs. Norris, who was presiding there.\n\"Fanny,\" cried Tom Bertram, from the other table, where the conference was eagerly carrying on, and the conversation incessant, \"we want your services.\"\nFanny was up in a moment, expecting some errand; for the habit of employing her in that way was not yet overcome, in spite of all that Edmund could do.\n\"Oh! we do not want to disturb you from your seat. We do not want your _present_ services. We shall only want you in our play. You must be Cottager's wife.\"\n\"Me!\" cried Fanny, sitting down again with a most frightened look. \"Indeed you must excuse me. I could not act anything if you were to give me the world. No, indeed, I cannot act.\"\n\"Indeed, but you must, for we cannot excuse you. It need not frighten you: it is a nothing of a part, a mere nothing, not above half a dozen speeches altogether, and it will not much signify if nobody hears a word you say; so you may be as creep-mouse as you like, but we must have you to look at.\"\n\"If you are afraid of half a dozen speeches,\" cried Mr. Rushworth, \"what would you do with such a part as mine? I have forty-two to learn.\"\n\"It is not that I am afraid of learning by heart,\" said Fanny, shocked to find herself at that moment the only speaker in the room, and to feel that almost every eye was upon her; \"but I really cannot act.\"\n\"Yes, yes, you can act well enough for _us_. Learn your part, and we will teach you all the rest. You have only two scenes, and as I shall be Cottager, I'll put you in and push you about, and you will do it very well, I'll answer for it.\"\n\"No, indeed, Mr. Bertram, you must excuse me. You cannot have an idea. It would be absolutely impossible for me. If I were to undertake it, I should only disappoint you.\"\n\"Phoo! Phoo! Do not be so shamefaced. You'll do it very well. Every allowance will be made for you. We do not expect perfection. You must get a brown gown, and a white apron, and a mob cap, and we must make you a few wrinkles, and a little of the crowsfoot at the corner of your eyes, and you will be a very proper, little old woman.\"\n\"You must excuse me, indeed you must excuse me,\" cried Fanny, growing more and more red from excessive agitation, and looking distressfully at Edmund, who was kindly observing her; but unwilling to exasperate his brother by interference, gave her only an encouraging smile. Her entreaty had no effect on Tom: he only said again what he had said before; and it was not merely Tom, for the requisition was now backed by Maria, and Mr. Crawford, and Mr. Yates, with an urgency which differed from his but in being more gentle or more ceremonious, and which altogether was quite overpowering to Fanny; and before she could breathe after it, Mrs. Norris completed the whole by thus addressing her in a whisper at once angry and audible-\"What a piece of work here is about nothing: I am quite ashamed of you, Fanny, to make such a difficulty of obliging your cousins in a trifle of this sort-so kind as they are to you! Take the part with a good grace, and let us hear no more of the matter, I entreat.\"\n\"Do not urge her, madam,\" said Edmund. \"It is not fair to urge her in this manner. You see she does not like to act. Let her chuse for herself, as well as the rest of us. Her judgment may be quite as safely trusted. Do not urge her any more.\"\n\"I am not going to urge her,\" replied Mrs. Norris sharply; \"but I shall think her a very obstinate, ungrateful girl, if she does not do what her aunt and cousins wish her-very ungrateful, indeed, considering who and what she is.\"\nEdmund was too angry to speak; but Miss Crawford, looking for a moment with astonished eyes at Mrs. Norris, and then at Fanny, whose tears were beginning to shew themselves, immediately said, with some keenness, \"I do not like my situation: this _place_ is too hot for me,\" and moved away her chair to the opposite side of the table, close to Fanny, saying to her, in a kind, low whisper, as she placed herself, \"Never mind, my dear Miss Price, this is a cross evening: everybody is cross and teasing, but do not let us mind them\"; and with pointed attention continued to talk to her and endeavour to raise her spirits, in spite of being out of spirits herself. By a look at her brother she prevented any farther entreaty from the theatrical board, and the really good feelings by which she was almost purely governed were rapidly restoring her to all the little she had lost in Edmund's favour.\nFanny did not love Miss Crawford; but she felt very much obliged to her for her present kindness; and when, from taking notice of her work, and wishing _she_ could work as well, and begging for the pattern, and supposing Fanny was now preparing for her _appearance_, as of course she would come out when her cousin was married, Miss Crawford proceeded to inquire if she had heard lately from her brother at sea, and said that she had quite a curiosity to see him, and imagined him a very fine young man, and advised Fanny to get his picture drawn before he went to sea again-she could not help admitting it to be very agreeable flattery, or help listening, and answering with more animation than she had intended.\nThe consultation upon the play still went on, and Miss Crawford's attention was first called from Fanny by Tom Bertram's telling her, with infinite regret, that he found it absolutely impossible for him to undertake the part of Anhalt in addition to the Butler: he had been most anxiously trying to make it out to be feasible, but it would not do; he must give it up. \"But there will not be the smallest difficulty in filling it,\" he added. \"We have but to speak the word; we may pick and chuse. I could name, at this moment, at least six young men within six miles of us, who are wild to be admitted into our company, and there are one or two that would not disgrace us: I should not be afraid to trust either of the Olivers or Charles Maddox. Tom Oliver is a very clever fellow, and Charles Maddox is as gentlemanlike a man as you will see anywhere, so I will take my horse early to-morrow morning and ride over to Stoke, and settle with one of them.\"\nWhile he spoke, Maria was looking apprehensively round at Edmund in full expectation that he must oppose such an enlargement of the plan as this: so contrary to all their first protestations; but Edmund said nothing. After a moment's thought, Miss Crawford calmly replied, \"As far as I am concerned, I can have no objection to anything that you all think eligible. Have I ever seen either of the gentlemen? Yes, Mr. Charles Maddox dined at my sister's one day, did not he, Henry? A quiet-looking young man. I remember him. Let _him_ be applied to, if you please, for it will be less unpleasant to me than to have a perfect stranger.\"\nCharles Maddox was to be the man. Tom repeated his resolution of going to him early on the morrow; and though Julia, who had scarcely opened her lips before, observed, in a sarcastic manner, and with a glance first at Maria and then at Edmund, that \"the Mansfield theatricals would enliven the whole neighbourhood exceedingly,\" Edmund still held his peace, and shewed his feelings only by a determined gravity.\n\"I am not very sanguine as to our play,\" said Miss Crawford, in an undervoice to Fanny, after some consideration; \"and I can tell Mr. Maddox that I shall shorten some of _his_ speeches, and a great many of _my_ _own_, before we rehearse together. It will be very disagreeable, and by no means what I expected.\"",
        "paragraph_chars": [
            [
                0,
                1288
            ],
            [
                1288,
                1593
            ],
            [
                1593,
                1861
            ],
            [
                1861,
                2000
            ],
            [
                2000,
                2175
            ],
            [
                2175,
                2587
            ],
            [
                2587,
                2662
            ],
            [
                2662,
                2827
            ],
            [
                2827,
                3045
            ],
            [
                3045,
                3284
            ],
            [
                3284,
                4052
            ],
            [
                4052,
                4369
            ],
            [
                4369,
                4661
            ],
            [
                4661,
                5046
            ],
            [
                5046,
                5478
            ],
            [
                5478,
                5658
            ],
            [
                5658,
                5751
            ],
            [
                5751,
                5799
            ],
            [
                5799,
                5896
            ],
            [
                5896,
                5946
            ],
            [
                5946,
                6318
            ],
            [
                6318,
                8486
            ],
            [
                8486,
                8643
            ],
            [
                8643,
                9267
            ],
            [
                9267,
                9835
            ],
            [
                9835,
                10599
            ],
            [
                10599,
                11212
            ],
            [
                11212,
                11419
            ],
            [
                11419,
                11570
            ],
            [
                11570,
                11679
            ],
            [
                11679,
                11769
            ],
            [
                11769,
                11948
            ],
            [
                11948,
                12181
            ],
            [
                12181,
                12281
            ],
            [
                12281,
                12349
            ],
            [
                12349,
                12441
            ],
            [
                12441,
                12786
            ],
            [
                12786,
                12846
            ],
            [
                12846,
                13165
            ],
            [
                13165,
                13186
            ],
            [
                13186,
                13340
            ],
            [
                13340,
                13676
            ],
            [
                13676,
                13879
            ],
            [
                13879,
                14032
            ],
            [
                14032,
                14184
            ],
            [
                14184,
                14341
            ],
            [
                14341,
                14522
            ],
            [
                14522,
                14821
            ],
            [
                14821,
                14961
            ],
            [
                14961,
                15168
            ],
            [
                15168,
                15407
            ],
            [
                15407,
                15578
            ],
            [
                15578,
                15913
            ],
            [
                15913,
                16911
            ],
            [
                16911,
                17154
            ],
            [
                17154,
                17384
            ],
            [
                17384,
                18280
            ],
            [
                18280,
                18994
            ],
            [
                18994,
                19948
            ],
            [
                19948,
                20582
            ],
            [
                20582,
                20993
            ],
            [
                20993,
                21303
            ]
        ],
        "segment_chars": [
            [
                0,
                171
            ],
            [
                171,
                526
            ],
            [
                526,
                1009
            ],
            [
                1009,
                1288
            ],
            [
                1288,
                1593
            ],
            [
                1593,
                1624
            ],
            [
                1624,
                1825
            ],
            [
                1825,
                1861
            ],
            [
                1861,
                2000
            ],
            [
                2000,
                2016
            ],
            [
                2016,
                2175
            ],
            [
                2175,
                2199
            ],
            [
                2199,
                2350
            ],
            [
                2350,
                2412
            ],
            [
                2412,
                2554
            ],
            [
                2554,
                2587
            ],
            [
                2587,
                2619
            ],
            [
                2619,
                2662
            ],
            [
                2662,
                2827
            ],
            [
                2827,
                3045
            ],
            [
                3045,
                3137
            ],
            [
                3137,
                3166
            ],
            [
                3166,
                3216
            ],
            [
                3216,
                3284
            ],
            [
                3284,
                3313
            ],
            [
                3313,
                3806
            ],
            [
                3806,
                3876
            ],
            [
                3876,
                3969
            ],
            [
                3969,
                4052
            ],
            [
                4052,
                4099
            ],
            [
                4099,
                4369
            ],
            [
                4369,
                4455
            ],
            [
                4455,
                4483
            ],
            [
                4483,
                4582
            ],
            [
                4582,
                4661
            ],
            [
                4661,
                4995
            ],
            [
                4995,
                5046
            ],
            [
                5046,
                5105
            ],
            [
                5105,
                5148
            ],
            [
                5148,
                5304
            ],
            [
                5304,
                5357
            ],
            [
                5357,
                5410
            ],
            [
                5410,
                5478
            ],
            [
                5478,
                5538
            ],
            [
                5538,
                5658
            ],
            [
                5658,
                5751
            ],
            [
                5751,
                5799
            ],
            [
                5799,
                5896
            ],
            [
                5896,
                5904
            ],
            [
                5904,
                5946
            ],
            [
                5946,
                5951
            ],
            [
                5951,
                6092
            ],
            [
                6092,
                6122
            ],
            [
                6122,
                6318
            ],
            [
                6318,
                6383
            ],
            [
                6383,
                6555
            ],
            [
                6555,
                6698
            ],
            [
                6698,
                6735
            ],
            [
                6735,
                6789
            ],
            [
                6789,
                6923
            ],
            [
                6923,
                6964
            ],
            [
                6964,
                7067
            ],
            [
                7067,
                7124
            ],
            [
                7124,
                7203
            ],
            [
                7203,
                7277
            ],
            [
                7277,
                7346
            ],
            [
                7346,
                7736
            ],
            [
                7736,
                8190
            ],
            [
                8190,
                8383
            ],
            [
                8383,
                8486
            ],
            [
                8486,
                8643
            ],
            [
                8643,
                8666
            ],
            [
                8666,
                8880
            ],
            [
                8880,
                8967
            ],
            [
                8967,
                9267
            ],
            [
                9267,
                9835
            ],
            [
                9835,
                9861
            ],
            [
                9861,
                9890
            ],
            [
                9890,
                9899
            ],
            [
                9899,
                10133
            ],
            [
                10133,
                10330
            ],
            [
                10330,
                10599
            ],
            [
                10599,
                10671
            ],
            [
                10671,
                10718
            ],
            [
                10718,
                11120
            ],
            [
                11120,
                11141
            ],
            [
                11141,
                11212
            ],
            [
                11212,
                11341
            ],
            [
                11341,
                11419
            ],
            [
                11419,
                11570
            ],
            [
                11570,
                11679
            ],
            [
                11679,
                11769
            ],
            [
                11769,
                11867
            ],
            [
                11867,
                11894
            ],
            [
                11894,
                11948
            ],
            [
                11948,
                12084
            ],
            [
                12084,
                12181
            ],
            [
                12181,
                12252
            ],
            [
                12252,
                12281
            ],
            [
                12281,
                12349
            ],
            [
                12349,
                12441
            ],
            [
                12441,
                12498
            ],
            [
                12498,
                12559
            ],
            [
                12559,
                12678
            ],
            [
                12678,
                12710
            ],
            [
                12710,
                12764
            ],
            [
                12764,
                12786
            ],
            [
                12786,
                12846
            ],
            [
                12846,
                13165
            ],
            [
                13165,
                13186
            ],
            [
                13186,
                13340
            ],
            [
                13340,
                13473
            ],
            [
                13473,
                13676
            ],
            [
                13676,
                13879
            ],
            [
                13879,
                14032
            ],
            [
                14032,
                14184
            ],
            [
                14184,
                14189
            ],
            [
                14189,
                14235
            ],
            [
                14235,
                14275
            ],
            [
                14275,
                14311
            ],
            [
                14311,
                14341
            ],
            [
                14341,
                14347
            ],
            [
                14347,
                14408
            ],
            [
                14408,
                14436
            ],
            [
                14436,
                14495
            ],
            [
                14495,
                14522
            ],
            [
                14522,
                14571
            ],
            [
                14571,
                14821
            ],
            [
                14821,
                14933
            ],
            [
                14933,
                14961
            ],
            [
                14961,
                15168
            ],
            [
                15168,
                15213
            ],
            [
                15213,
                15266
            ],
            [
                15266,
                15407
            ],
            [
                15407,
                15453
            ],
            [
                15453,
                15478
            ],
            [
                15478,
                15520
            ],
            [
                15520,
                15578
            ],
            [
                15578,
                15585
            ],
            [
                15585,
                15591
            ],
            [
                15591,
                15616
            ],
            [
                15616,
                15640
            ],
            [
                15640,
                15678
            ],
            [
                15678,
                15707
            ],
            [
                15707,
                15913
            ],
            [
                15913,
                16187
            ],
            [
                16187,
                16827
            ],
            [
                16827,
                16911
            ],
            [
                16911,
                16950
            ],
            [
                16950,
                16994
            ],
            [
                16994,
                17028
            ],
            [
                17028,
                17082
            ],
            [
                17082,
                17127
            ],
            [
                17127,
                17154
            ],
            [
                17154,
                17384
            ],
            [
                17384,
                18046
            ],
            [
                18046,
                18280
            ],
            [
                18280,
                18994
            ],
            [
                18994,
                19362
            ],
            [
                19362,
                19435
            ],
            [
                19435,
                19490
            ],
            [
                19490,
                19739
            ],
            [
                19739,
                19948
            ],
            [
                19948,
                20165
            ],
            [
                20165,
                20313
            ],
            [
                20313,
                20355
            ],
            [
                20355,
                20428
            ],
            [
                20428,
                20455
            ],
            [
                20455,
                20471
            ],
            [
                20471,
                20582
            ],
            [
                20582,
                20616
            ],
            [
                20616,
                20993
            ],
            [
                20993,
                21240
            ],
            [
                21240,
                21303
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                37,
                49
            ],
            [
                103,
                125
            ],
            [
                130,
                151
            ],
            [
                165,
                171
            ],
            [
                171,
                250
            ],
            [
                256,
                257
            ],
            [
                297,
                300
            ],
            [
                395,
                438
            ],
            [
                448,
                497
            ],
            [
                503,
                510
            ],
            [
                515,
                525
            ],
            [
                526,
                547
            ],
            [
                560,
                601
            ],
            [
                607,
                676
            ],
            [
                689,
                787
            ],
            [
                794,
                964
            ],
            [
                975,
                982
            ],
            [
                1007,
                1009
            ],
            [
                1009,
                1069
            ],
            [
                1080,
                1106
            ],
            [
                1112,
                1124
            ],
            [
                1130,
                1148
            ],
            [
                1158,
                1160
            ],
            [
                1219,
                1230
            ],
            [
                1170,
                1173
            ],
            [
                1236,
                1268
            ],
            [
                1274,
                1288
            ],
            [
                1288,
                1328
            ],
            [
                1338,
                1345
            ],
            [
                1350,
                1375
            ],
            [
                1386,
                1424
            ],
            [
                1438,
                1471
            ],
            [
                1483,
                1484
            ],
            [
                1507,
                1545
            ],
            [
                1552,
                1593
            ],
            [
                1593,
                1624
            ],
            [
                1624,
                1710
            ],
            [
                1728,
                1779
            ],
            [
                1785,
                1825
            ],
            [
                1825,
                1861
            ],
            [
                1861,
                1924
            ],
            [
                1966,
                2000
            ],
            [
                2000,
                2016
            ],
            [
                2016,
                2060
            ],
            [
                2066,
                2071
            ],
            [
                2088,
                2135
            ],
            [
                2173,
                2175
            ],
            [
                2175,
                2199
            ],
            [
                2199,
                2200
            ],
            [
                2242,
                2284
            ],
            [
                2296,
                2303
            ],
            [
                2348,
                2350
            ],
            [
                2554,
                2587
            ],
            [
                2587,
                2619
            ],
            [
                2619,
                2639
            ],
            [
                2644,
                2662
            ],
            [
                2662,
                2827
            ],
            [
                2827,
                2905
            ],
            [
                2907,
                2909
            ],
            [
                2910,
                2941
            ],
            [
                3014,
                3045
            ],
            [
                3045,
                3071
            ],
            [
                3080,
                3137
            ],
            [
                3137,
                3166
            ],
            [
                3166,
                3178
            ],
            [
                3184,
                3216
            ],
            [
                3216,
                3247
            ],
            [
                3265,
                3284
            ],
            [
                3284,
                3307
            ],
            [
                3311,
                3313
            ],
            [
                3332,
                3368
            ],
            [
                3475,
                3477
            ],
            [
                3395,
                3408
            ],
            [
                3444,
                3449
            ],
            [
                3420,
                3444
            ],
            [
                3410,
                3413
            ],
            [
                3478,
                3491
            ],
            [
                3571,
                3572
            ],
            [
                3493,
                3499
            ],
            [
                3549,
                3552
            ],
            [
                3680,
                3694
            ],
            [
                3668,
                3674
            ],
            [
                3695,
                3699
            ],
            [
                3701,
                3704
            ],
            [
                3707,
                3719
            ],
            [
                3604,
                3613
            ],
            [
                3723,
                3752
            ],
            [
                3804,
                3806
            ],
            [
                3806,
                3807
            ],
            [
                3827,
                3830
            ],
            [
                3832,
                3836
            ],
            [
                3857,
                3859
            ],
            [
                3874,
                3876
            ],
            [
                3876,
                3880
            ],
            [
                3886,
                3908
            ],
            [
                3916,
                3927
            ],
            [
                3935,
                3967
            ],
            [
                4099,
                4139
            ],
            [
                4139,
                4140
            ],
            [
                4155,
                4185
            ],
            [
                4141,
                4142
            ],
            [
                4237,
                4273
            ],
            [
                4231,
                4232
            ],
            [
                4278,
                4288
            ],
            [
                4290,
                4294
            ],
            [
                4296,
                4307
            ],
            [
                4317,
                4330
            ],
            [
                4336,
                4351
            ],
            [
                4366,
                4369
            ],
            [
                4369,
                4425
            ],
            [
                4433,
                4436
            ],
            [
                4461,
                4483
            ],
            [
                4483,
                4548
            ],
            [
                4554,
                4580
            ],
            [
                4661,
                4708
            ],
            [
                4752,
                4803
            ],
            [
                4809,
                4841
            ],
            [
                4847,
                4916
            ],
            [
                4924,
                4970
            ],
            [
                4973,
                4980
            ],
            [
                5046,
                5068
            ],
            [
                5103,
                5105
            ],
            [
                5105,
                5148
            ],
            [
                5148,
                5212
            ],
            [
                5302,
                5304
            ],
            [
                5357,
                5360
            ],
            [
                5381,
                5410
            ],
            [
                5410,
                5478
            ],
            [
                5478,
                5538
            ],
            [
                5538,
                5612
            ],
            [
                5655,
                5658
            ],
            [
                5658,
                5751
            ],
            [
                5751,
                5799
            ],
            [
                5799,
                5893
            ],
            [
                5951,
                5966
            ],
            [
                6026,
                6030
            ],
            [
                6032,
                6035
            ],
            [
                6037,
                6065
            ],
            [
                6090,
                6092
            ],
            [
                6146,
                6184
            ],
            [
                6189,
                6232
            ],
            [
                6258,
                6276
            ],
            [
                6286,
                6318
            ],
            [
                6318,
                6346
            ],
            [
                6352,
                6383
            ],
            [
                6383,
                6384
            ],
            [
                6446,
                6470
            ],
            [
                6475,
                6500
            ],
            [
                6553,
                6555
            ],
            [
                6555,
                6582
            ],
            [
                6599,
                6637
            ],
            [
                6671,
                6698
            ],
            [
                6735,
                6789
            ],
            [
                6789,
                6923
            ],
            [
                6923,
                6964
            ],
            [
                7003,
                7067
            ],
            [
                7124,
                7125
            ],
            [
                7127,
                7129
            ],
            [
                7131,
                7171
            ],
            [
                7201,
                7203
            ],
            [
                7203,
                7277
            ],
            [
                7277,
                7330
            ],
            [
                7344,
                7346
            ],
            [
                7425,
                7465
            ],
            [
                7496,
                7536
            ],
            [
                7562,
                7578
            ],
            [
                7346,
                7347
            ],
            [
                7377,
                7380
            ],
            [
                7393,
                7394
            ],
            [
                7734,
                7736
            ],
            [
                7984,
                8010
            ],
            [
                7762,
                7763
            ],
            [
                7780,
                7781
            ],
            [
                8103,
                8107
            ],
            [
                8109,
                8124
            ],
            [
                8139,
                8168
            ],
            [
                8187,
                8190
            ],
            [
                8190,
                8240
            ],
            [
                8250,
                8256
            ],
            [
                8298,
                8334
            ],
            [
                8342,
                8371
            ],
            [
                8376,
                8383
            ],
            [
                8383,
                8405
            ],
            [
                8483,
                8486
            ],
            [
                8486,
                8492
            ],
            [
                8574,
                8576
            ],
            [
                8518,
                8524
            ],
            [
                8641,
                8643
            ],
            [
                8643,
                8666
            ],
            [
                8666,
                8760
            ],
            [
                8771,
                8843
            ],
            [
                8878,
                8880
            ],
            [
                8880,
                8885
            ],
            [
                8931,
                8967
            ],
            [
                8967,
                9044
            ],
            [
                9045,
                9049
            ],
            [
                9063,
                9065
            ],
            [
                9135,
                9267
            ],
            [
                9267,
                9270
            ],
            [
                9464,
                9469
            ],
            [
                9323,
                9337
            ],
            [
                9430,
                9431
            ],
            [
                9387,
                9401
            ],
            [
                9271,
                9274
            ],
            [
                9402,
                9409
            ],
            [
                9417,
                9430
            ],
            [
                9432,
                9457
            ],
            [
                9299,
                9303
            ],
            [
                9515,
                9521
            ],
            [
                9546,
                9548
            ],
            [
                9287,
                9290
            ],
            [
                9560,
                9565
            ],
            [
                9567,
                9598
            ],
            [
                9641,
                9645
            ],
            [
                9703,
                9724
            ],
            [
                9789,
                9811
            ],
            [
                9821,
                9835
            ],
            [
                9967,
                10079
            ],
            [
                9940,
                9943
            ],
            [
                10133,
                10135
            ],
            [
                10148,
                10217
            ],
            [
                10268,
                10305
            ],
            [
                10316,
                10330
            ],
            [
                10358,
                10391
            ],
            [
                10397,
                10427
            ],
            [
                10441,
                10472
            ],
            [
                10490,
                10546
            ],
            [
                10591,
                10599
            ],
            [
                10650,
                10671
            ],
            [
                10718,
                10723
            ],
            [
                10773,
                10844
            ],
            [
                10863,
                10989
            ],
            [
                11077,
                11101
            ],
            [
                11118,
                11120
            ],
            [
                11120,
                11141
            ],
            [
                11141,
                11212
            ],
            [
                11212,
                11279
            ],
            [
                11285,
                11340
            ],
            [
                11419,
                11420
            ],
            [
                11476,
                11514
            ],
            [
                11448,
                11458
            ],
            [
                11460,
                11469
            ],
            [
                11514,
                11515
            ],
            [
                11471,
                11472
            ],
            [
                11516,
                11570
            ],
            [
                11570,
                11580
            ],
            [
                11586,
                11679
            ],
            [
                11679,
                11680
            ],
            [
                11681,
                11684
            ],
            [
                11687,
                11692
            ],
            [
                11694,
                11769
            ],
            [
                11769,
                11778
            ],
            [
                11786,
                11816
            ],
            [
                11837,
                11867
            ],
            [
                11867,
                11894
            ],
            [
                11894,
                11948
            ],
            [
                11948,
                11957
            ],
            [
                11985,
                12084
            ],
            [
                12123,
                12152
            ],
            [
                12178,
                12181
            ],
            [
                12181,
                12186
            ],
            [
                12188,
                12195
            ],
            [
                12197,
                12234
            ],
            [
                12250,
                12251
            ],
            [
                12281,
                12282
            ],
            [
                12283,
                12284
            ],
            [
                12286,
                12317
            ],
            [
                12324,
                12328
            ],
            [
                12347,
                12349
            ],
            [
                12349,
                12441
            ],
            [
                12441,
                12461
            ],
            [
                12468,
                12479
            ],
            [
                12496,
                12498
            ],
            [
                12559,
                12670
            ],
            [
                12672,
                12675
            ],
            [
                12678,
                12710
            ],
            [
                12764,
                12786
            ],
            [
                12786,
                12846
            ],
            [
                12846,
                12847
            ],
            [
                12848,
                12849
            ],
            [
                12851,
                12892
            ],
            [
                12896,
                12955
            ],
            [
                13048,
                13068
            ],
            [
                13075,
                13094
            ],
            [
                12973,
                12974
            ],
            [
                13132,
                13165
            ],
            [
                13165,
                13186
            ],
            [
                13186,
                13189
            ],
            [
                13191,
                13194
            ],
            [
                13196,
                13212
            ],
            [
                13214,
                13217
            ],
            [
                13219,
                13340
            ],
            [
                13340,
                13341
            ],
            [
                13342,
                13346
            ],
            [
                13361,
                13366
            ],
            [
                13379,
                13471
            ],
            [
                13676,
                13702
            ],
            [
                13766,
                13775
            ],
            [
                13789,
                13810
            ],
            [
                13815,
                13819
            ],
            [
                13824,
                13852
            ],
            [
                13877,
                13879
            ],
            [
                13879,
                13906
            ],
            [
                14007,
                14032
            ],
            [
                14032,
                14079
            ],
            [
                14182,
                14184
            ],
            [
                14184,
                14189
            ],
            [
                14189,
                14235
            ],
            [
                14275,
                14277
            ],
            [
                14284,
                14311
            ],
            [
                14311,
                14341
            ],
            [
                14341,
                14347
            ],
            [
                14347,
                14385
            ],
            [
                14391,
                14408
            ],
            [
                14408,
                14436
            ],
            [
                14507,
                14522
            ],
            [
                14522,
                14523
            ],
            [
                14531,
                14543
            ],
            [
                14569,
                14571
            ],
            [
                14571,
                14623
            ],
            [
                14640,
                14643
            ],
            [
                14650,
                14671
            ],
            [
                14682,
                14699
            ],
            [
                14705,
                14785
            ],
            [
                14818,
                14821
            ],
            [
                14821,
                14822
            ],
            [
                14886,
                14887
            ],
            [
                14933,
                14949
            ],
            [
                14856,
                14886
            ],
            [
                14961,
                15039
            ],
            [
                15051,
                15055
            ],
            [
                15117,
                15168
            ],
            [
                15168,
                15169
            ],
            [
                15179,
                15206
            ],
            [
                15208,
                15210
            ],
            [
                15266,
                15290
            ],
            [
                15404,
                15407
            ],
            [
                15407,
                15453
            ],
            [
                15478,
                15520
            ],
            [
                15547,
                15578
            ],
            [
                15578,
                15585
            ],
            [
                15678,
                15707
            ],
            [
                15707,
                15808
            ],
            [
                15867,
                15892
            ],
            [
                15894,
                15913
            ],
            [
                15913,
                15914
            ],
            [
                15941,
                15974
            ],
            [
                16016,
                16133
            ],
            [
                16149,
                16187
            ],
            [
                16187,
                16221
            ],
            [
                16266,
                16291
            ],
            [
                16407,
                16410
            ],
            [
                16313,
                16370
            ],
            [
                16457,
                16460
            ],
            [
                16550,
                16561
            ],
            [
                16601,
                16607
            ],
            [
                16376,
                16378
            ],
            [
                16626,
                16631
            ],
            [
                16610,
                16617
            ],
            [
                16643,
                16665
            ],
            [
                16674,
                16776
            ],
            [
                16777,
                16785
            ],
            [
                16798,
                16825
            ],
            [
                16911,
                16950
            ],
            [
                16994,
                17026
            ],
            [
                17154,
                17320
            ],
            [
                17324,
                17384
            ],
            [
                17384,
                17441
            ],
            [
                17455,
                17540
            ],
            [
                17556,
                17574
            ],
            [
                17594,
                17629
            ],
            [
                17631,
                17636
            ],
            [
                17638,
                17655
            ],
            [
                17541,
                17544
            ],
            [
                17662,
                17667
            ],
            [
                17673,
                17682
            ],
            [
                17718,
                17771
            ],
            [
                17794,
                17919
            ],
            [
                17943,
                18046
            ],
            [
                18137,
                18228
            ],
            [
                18260,
                18280
            ],
            [
                18280,
                18331
            ],
            [
                18352,
                18359
            ],
            [
                18368,
                18387
            ],
            [
                18348,
                18351
            ],
            [
                18414,
                18418
            ],
            [
                18606,
                18709
            ],
            [
                18507,
                18510
            ],
            [
                18732,
                18782
            ],
            [
                18854,
                18917
            ],
            [
                18937,
                18994
            ],
            [
                19044,
                19073
            ],
            [
                19080,
                19132
            ],
            [
                19142,
                19166
            ],
            [
                19178,
                19188
            ],
            [
                19197,
                19199
            ],
            [
                19210,
                19254
            ],
            [
                19360,
                19362
            ],
            [
                19362,
                19377
            ],
            [
                19398,
                19435
            ],
            [
                19435,
                19436
            ],
            [
                19467,
                19482
            ],
            [
                19488,
                19490
            ],
            [
                19490,
                19502
            ],
            [
                19529,
                19542
            ],
            [
                19567,
                19665
            ],
            [
                19739,
                19754
            ],
            [
                19760,
                19796
            ],
            [
                19814,
                19815
            ],
            [
                19800,
                19813
            ],
            [
                19816,
                19819
            ],
            [
                19844,
                19855
            ],
            [
                19898,
                19907
            ],
            [
                19916,
                19948
            ],
            [
                19964,
                19969
            ],
            [
                19982,
                19996
            ],
            [
                20003,
                20012
            ],
            [
                19962,
                19963
            ],
            [
                20033,
                20052
            ],
            [
                20088,
                20092
            ],
            [
                20061,
                20084
            ],
            [
                20092,
                20093
            ],
            [
                20140,
                20165
            ],
            [
                20165,
                20222
            ],
            [
                20248,
                20313
            ],
            [
                20313,
                20355
            ],
            [
                20355,
                20399
            ],
            [
                20407,
                20428
            ],
            [
                20428,
                20455
            ],
            [
                20471,
                20474
            ],
            [
                20476,
                20479
            ],
            [
                20481,
                20552
            ],
            [
                20561,
                20582
            ],
            [
                20616,
                20655
            ],
            [
                20666,
                20697
            ],
            [
                20740,
                20748
            ],
            [
                20826,
                20942
            ],
            [
                20950,
                20993
            ],
            [
                21039,
                21052
            ],
            [
                21034,
                21038
            ],
            [
                21071,
                21080
            ],
            [
                20993,
                20994
            ],
            [
                21112,
                21162
            ],
            [
                21164,
                21167
            ],
            [
                21169,
                21198
            ],
            [
                21200,
                21202
            ],
            [
                21205,
                21208
            ],
            [
                21209,
                21240
            ],
            [
                21240,
                21303
            ]
        ],
        "row_chars": [
            [
                0,
                171
            ],
            [
                171,
                526
            ],
            [
                526,
                1009
            ],
            [
                1009,
                1288
            ],
            [
                1288,
                1593
            ],
            [
                1593,
                1624
            ],
            [
                1624,
                1825
            ],
            [
                1825,
                1861
            ],
            [
                1861,
                2000
            ],
            [
                2000,
                2016
            ],
            [
                2016,
                2175
            ],
            [
                2175,
                2199
            ],
            [
                2199,
                2350
            ],
            [
                2350,
                2412
            ],
            [
                2412,
                2554
            ],
            [
                2554,
                2587
            ],
            [
                2587,
                2619
            ],
            [
                2619,
                2662
            ],
            [
                2662,
                2827
            ],
            [
                2827,
                3045
            ],
            [
                3045,
                3137
            ],
            [
                3137,
                3166
            ],
            [
                3166,
                3216
            ],
            [
                3216,
                3284
            ],
            [
                3284,
                3313
            ],
            [
                3313,
                3806
            ],
            [
                3806,
                3876
            ],
            [
                3876,
                3969
            ],
            [
                3969,
                4052
            ],
            [
                4052,
                4099
            ],
            [
                4099,
                4369
            ],
            [
                4369,
                4483
            ],
            [
                4483,
                4582
            ],
            [
                4582,
                4661
            ],
            [
                4661,
                4995
            ],
            [
                4995,
                5046
            ],
            [
                5046,
                5105
            ],
            [
                5105,
                5148
            ],
            [
                5148,
                5304
            ],
            [
                5304,
                5357
            ],
            [
                5357,
                5410
            ],
            [
                5410,
                5478
            ],
            [
                5478,
                5538
            ],
            [
                5538,
                5658
            ],
            [
                5658,
                5751
            ],
            [
                5751,
                5799
            ],
            [
                5799,
                5896
            ],
            [
                5896,
                5904
            ],
            [
                5904,
                5946
            ],
            [
                5946,
                5951
            ],
            [
                5951,
                6092
            ],
            [
                6092,
                6122
            ],
            [
                6122,
                6318
            ],
            [
                6318,
                6383
            ],
            [
                6383,
                6555
            ],
            [
                6555,
                6698
            ],
            [
                6698,
                6735
            ],
            [
                6735,
                6789
            ],
            [
                6789,
                6923
            ],
            [
                6923,
                6964
            ],
            [
                6964,
                7067
            ],
            [
                7067,
                7124
            ],
            [
                7124,
                7203
            ],
            [
                7203,
                7277
            ],
            [
                7277,
                7346
            ],
            [
                7346,
                7736
            ],
            [
                7736,
                8190
            ],
            [
                8190,
                8383
            ],
            [
                8383,
                8486
            ],
            [
                8486,
                8643
            ],
            [
                8643,
                8666
            ],
            [
                8666,
                8880
            ],
            [
                8880,
                8967
            ],
            [
                8967,
                9267
            ],
            [
                9267,
                9835
            ],
            [
                9835,
                9861
            ],
            [
                9861,
                9890
            ],
            [
                9890,
                9899
            ],
            [
                9899,
                10133
            ],
            [
                10133,
                10330
            ],
            [
                10330,
                10599
            ],
            [
                10599,
                10671
            ],
            [
                10671,
                10718
            ],
            [
                10718,
                11120
            ],
            [
                11120,
                11141
            ],
            [
                11141,
                11212
            ],
            [
                11212,
                11341
            ],
            [
                11341,
                11419
            ],
            [
                11419,
                11570
            ],
            [
                11570,
                11679
            ],
            [
                11679,
                11769
            ],
            [
                11769,
                11867
            ],
            [
                11867,
                11894
            ],
            [
                11894,
                11948
            ],
            [
                11948,
                12084
            ],
            [
                12084,
                12181
            ],
            [
                12181,
                12252
            ],
            [
                12252,
                12281
            ],
            [
                12281,
                12349
            ],
            [
                12349,
                12441
            ],
            [
                12441,
                12498
            ],
            [
                12498,
                12559
            ],
            [
                12559,
                12678
            ],
            [
                12678,
                12710
            ],
            [
                12710,
                12764
            ],
            [
                12764,
                12786
            ],
            [
                12786,
                12846
            ],
            [
                12846,
                13165
            ],
            [
                13165,
                13186
            ],
            [
                13186,
                13340
            ],
            [
                13340,
                13473
            ],
            [
                13473,
                13676
            ],
            [
                13676,
                13879
            ],
            [
                13879,
                14032
            ],
            [
                14032,
                14184
            ],
            [
                14184,
                14189
            ],
            [
                14189,
                14235
            ],
            [
                14235,
                14275
            ],
            [
                14275,
                14311
            ],
            [
                14311,
                14341
            ],
            [
                14341,
                14347
            ],
            [
                14347,
                14408
            ],
            [
                14408,
                14436
            ],
            [
                14436,
                14495
            ],
            [
                14495,
                14522
            ],
            [
                14522,
                14571
            ],
            [
                14571,
                14821
            ],
            [
                14821,
                14961
            ],
            [
                14961,
                15168
            ],
            [
                15168,
                15213
            ],
            [
                15213,
                15266
            ],
            [
                15266,
                15407
            ],
            [
                15407,
                15453
            ],
            [
                15453,
                15478
            ],
            [
                15478,
                15520
            ],
            [
                15520,
                15578
            ],
            [
                15578,
                15585
            ],
            [
                15585,
                15591
            ],
            [
                15591,
                15616
            ],
            [
                15616,
                15640
            ],
            [
                15640,
                15678
            ],
            [
                15678,
                15707
            ],
            [
                15707,
                15913
            ],
            [
                15913,
                16187
            ],
            [
                16187,
                16827
            ],
            [
                16827,
                16911
            ],
            [
                16911,
                16950
            ],
            [
                16950,
                16994
            ],
            [
                16994,
                17028
            ],
            [
                17028,
                17082
            ],
            [
                17082,
                17127
            ],
            [
                17127,
                17154
            ],
            [
                17154,
                17384
            ],
            [
                17384,
                18046
            ],
            [
                18046,
                18280
            ],
            [
                18280,
                18994
            ],
            [
                18994,
                19362
            ],
            [
                19362,
                19435
            ],
            [
                19435,
                19490
            ],
            [
                19490,
                19948
            ],
            [
                19948,
                20165
            ],
            [
                20165,
                20313
            ],
            [
                20313,
                20355
            ],
            [
                20355,
                20428
            ],
            [
                20428,
                20455
            ],
            [
                20455,
                20471
            ],
            [
                20471,
                20582
            ],
            [
                20582,
                20616
            ],
            [
                20616,
                20993
            ],
            [
                20993,
                21240
            ],
            [
                21240,
                21303
            ]
        ]
    },
    "abridged": {
        "text": "Miss Crawford accepted the part readily; and when Mr. Rushworth arrived, another character was cast. He had the offer of Count Cassel and Anhalt, and at first did not know which to choose, but recollecting that he had once seen the play, and had thought Anhalt a very stupid fellow, he decided on the Count.\nMiss Bertram approved, for the less he had to learn the better. Though she could not sympathise in his wish that the Count and Agatha act together, nor wait very patiently while he was slowly turning over the leaves with the hope of discovering such a scene, she very kindly took his part in hand, and curtailed every speech that admitted being shortened; besides pointing out the necessity of his being finely dressed. Mr. Rushworth liked the idea of his finery very well, though pretending to despise it; and was too engaged with his own appearance to feel any of the displeasure which Maria had been prepared for.\nThus much was settled before Edmund, who was out all morning, knew anything of it; but when he entered the drawing-room, the buzz of discussion was high, and Mr. Rushworth stepped forward with alacrity to tell him the agreeable news.\n\"We have got a play,\" said he. \"It is to be Lovers' Vows; and I am to be Count Cassel, and am to come in first with a pink satin cloak, and afterwards am to have another fancy suit, by way of a shooting-dress. I do not know how I shall like it.\"\nFanny's eyes followed Edmund, and her heart beat for him as she felt what his sensations must be.\n\"Lovers' Vows!\" in a tone of the greatest amazement, was his reply, and he turned towards his brother and sisters.\n\"Yes,\" cried Mr. Yates. \"We find there is nothing that will suit us so well. We have cast almost every part.\"\n\"But what do you do for women?\" said Edmund gravely, looking at Maria.\nMaria blushed in spite of herself as she answered, \"I take the part which Lady Ravenshaw was to have done, and\" (with a bolder eye) \"Miss Crawford is to be Amelia.\"\n\"I should not have thought it the sort of play to be so easily filled up, with us,\" replied Edmund, turning away with a look of great vexation.\nMr. Rushworth followed him. \"I come in three times, and have two-and-forty speeches. That's something, is not it? But I do not like the idea of being so fine. I shall hardly know myself in a pink satin cloak.\"\nEdmund could not answer. Mr. Bertram was called out of the room by the carpenter, and was accompanied by Mr. Yates and Mr. Rushworth. Edmund then said, \"My dear Maria, I must tell you that I think this play exceedingly unfit for private performance. I hope you will give it up. Read the first act aloud to your mother, and see how you can approve it.\"\n\"I am perfectly acquainted with the play;\" cried Maria, \"and with a very few omissions, I see nothing objectionable in it; and I am not the only young woman who thinks it fit for private performance.\"\n\"I am sorry for it,\" was his answer; \"but in this matter you must set the example. If others have blundered, it is your place to put them right, and show them what true delicacy is.\"\nThis picture of her consequence had some effect; and with far more good-humour she answered, \"I am obliged to you, Edmund; you mean well, I am sure: but I still think you see things too strongly; and I cannot undertake to harangue all the rest upon the subject.\"\n\"Do you imagine that I meant that? No; let your conduct be the only harangue. Say that, on examining the part, you feel yourself unequal to it. All will understand your motive. The play will be given up, and your delicacy honoured as it ought.\"\n\"Do not act anything improper, my dear,\" said Lady Bertram. \"Sir Thomas would not like it.-Fanny, ring the bell; I must have my dinner.\"\n\"I am convinced, madam,\" said Edmund, preventing Fanny, \"that Sir Thomas would not like it.\"\n\"There, my dear, do you hear what Edmund says?\"\n\"If I were to decline the part,\" said Maria, with renewed zeal, \"Julia would certainly take it. She might think that she need not be so scrupulous as me. I cannot retract my consent; it is too settled, everybody would be so disappointed; and if we are so fastidious, we shall never act anything.\"\n\"I was just going to say the same thing,\" said Mrs. Norris. \"The preparations will be so much money thrown away. I do not know the play; but if there is anything a little too warm it can be easily left out. As Mr. Rushworth is to act too, there can be no harm. I only wish Tom had known his own mind when the carpenters began, for there was the loss of half a day's work about those side-doors. The curtain will be a good job, however. I think we shall be able to send back some dozens of the rings. I am of some use, I hope, in preventing waste. There should always be one steady head to superintend so many young ones. I forgot to tell Tom of something that happened to me today. Who should I see but Dick Jackson making off with two bits of deal board in his hand, pilfered you may be sure; I hate such encroaching people as the Jacksons, who get all they can. I said to the boy directly, 'I'll take the boards, Dick, so get you home again.' The boy looked very silly, and turned away without a word; and I dare say it will cure him of marauding about the house for a while. I hate such greediness!\"\nNobody troubled to answer.\nDinner passed heavily. Mrs. Norris related again her triumph over Dick Jackson, but neither play nor preparation were much talked of, for Edmund's disapprobation was felt even by his brother. Maria thought the subject better avoided. Mr. Yates, who was trying to make himself agreeable to Julia, found her gloom was less on other topics; and Mr. Rushworth, having only his own part and his own dress in his head, had soon talked away all that could be said of either.\nBut after an hour or two, the spirits of the evening gave fresh courage. Tom, Maria, and Mr. Yates were seated at the table with the play open before them, when Mr. and Miss Crawford entered and were received with grateful joy.\nHenry Crawford was soon seated with the other three at the table, while his sister made her way to Lady Bertram, by the fire.\n\"I congratulate your ladyship,\" said she, \"on the play being chosen; for I am sure you must be sick of all our difficulties. The bystanders must be infinitely thankful for a decision; and I give you joy, madam, as well as everybody else who is in the same predicament,\" glancing at Edmund.\nEdmund said nothing. After chatting a few minutes, Miss Crawford returned to the party round the table; and seemed to interest herself in their arrangements till, as if struck by a sudden recollection, she exclaimed, \"My good friends, pray let me know my fate. Who is to be Anhalt? What gentleman among you am I to have the pleasure of making love to?\"\nFor a moment no one spoke; and then many spoke together to tell the melancholy truth, that they had not yet got any Anhalt.\n\"I thought I should like the Count best,\" said Mr Rushworth, \"though I do not much relish the finery I am to have.\"\n\"You chose wisely, I am sure,\" replied Miss Crawford, with a brightened look; \"Anhalt is a heavy part.\"\n\"The Count has two-and-forty speeches,\" returned Mr. Rushworth, \"which is no trifle.\"\n\"I am not surprised,\" said Miss Crawford, \"at this want of an Anhalt. Amelia deserves no better. Such a forward young lady may well frighten the men.\"\n\"I should take the part, if it were possible,\" cried Tom; \"but, unluckily, the Butler and Anhalt are in together. However; I will try what can be done.\"\n\"Your brother should take the part,\" said Mr. Yates.\n\"I shall not ask him,\" replied Tom coldly.\nMiss Crawford talked of something else, and soon afterwards rejoined the party at the fire.\n\"They do not want me,\" said she. \"Mr. Edmund Bertram, as you do not act yourself, you will be a disinterested adviser; and, therefore, I apply to you. What shall we do for an Anhalt? What is your advice?\"\n\"My advice,\" said he calmly, \"is that you change the play.\"\n\"I should have no objection,\" she replied; \"though I should not particularly dislike the part of Amelia; but as they do not choose to hear your advice, it certainly will not be taken.\"\nEdmund said no more.\n\"If any part could tempt you to act, I suppose it would be Anhalt,\" observed the lady archly, after a short pause; \"for he is a clergyman, you know.\"\n\"That would not tempt me,\" he replied, \"for I should be sorry to make the character ridiculous by bad acting.\"\nMiss Crawford was silenced. Moving her chair nearer the tea-table, she gave her attention to Mrs. Norris.\n\"Fanny,\" cried Tom Bertram, \"we want your services.\"\nFanny was up in a moment, expecting some errand.\n\"Oh! we do not want to disturb you from your seat. We only want you in our play. You must be Cottager's wife.\"\n\"Me!\" cried Fanny, sitting down again with a frightened look. \"Indeed you must excuse me. I cannot act.\"\n\"But you must. It need not frighten you: it is a nothing of a part, not half a dozen speeches, and it will not signify if nobody hears a word you say; so you may be as creep-mouse as you like.\"\n\"Why, I have forty-two speeches,\" cried Mr. Rushworth.\n\"It is not that I am afraid of learning by heart,\" said Fanny, shocked to find that every eye was upon her; \"but I really cannot act.\"\n\"You can act well enough for us. You have only two scenes.\"\n\"No, indeed, Mr. Bertram, you must excuse me. It would be absolutely impossible for me. I should only disappoint you.\"\n\"Phoo! We do not expect perfection. You must get a brown gown, and a white apron, and a mob cap, and we must make you a few wrinkles, and you will be a very proper little old woman.\"\n\"Indeed you must excuse me,\" cried Fanny, in agitation, and looking distressfully at Edmund, who was kindly observing her; but unwilling to exasperate his brother, gave her only an encouraging smile. Her entreaty had no effect on Tom: and it was not merely Tom. His request was now backed by Maria, and Mr. Crawford, and Mr. Yates, and Mrs. Norris addressed her in an angry whisper-\"What a piece of work about nothing: I am quite ashamed of you, Fanny, to make such a difficulty of obliging your cousins in such a trifle-so kind as they are to you!\"\n\"Do not urge her, madam,\" said Edmund. \"You see she does not like to act.\"\n\"I am not going to urge her,\" replied Mrs. Norris sharply; \"but I shall think her a very obstinate, ungrateful girl, if she does not do what her aunt and cousins wish-very ungrateful, indeed, considering who and what she is.\"\nEdmund was too angry to speak; but Miss Crawford, looking with astonished eyes at Mrs. Norris, and then at Fanny, whose tears were beginning to show, immediately said, \"I do not like my situation: this place is too hot for me.\" She moved her chair close to Fanny, saying to her, in a kind, low whisper, \"Never mind, my dear Miss Price, this is a cross evening: everybody is cross and teasing, but do not let us mind them\"; and continued to talk to her and endeavour to raise her spirits, in spite of being out of spirits herself. The really good feelings by which she was almost purely governed were rapidly restoring her in Edmund's favour.\nFanny did not love Miss Crawford; but she felt very grateful for her kindness; and when, after talking about her needlework, Miss Crawford proceeded to inquire if she had heard lately from her brother at sea, and said that she was curious to see him, and imagined him a very fine young man-she could not help admitting it to be very agreeable flattery, and answering with more animation than she had intended.\nMiss Crawford's attention was called from Fanny by Tom Bertram's telling her, with regret, that he found it impossible to take the part of Anhalt in addition to the Butler. \"But there will no difficulty in filling it,\" he added. \"We may pick and choose. I could name six young men who are wild to be admitted into our company, and there are one or two that would not disgrace us: Tom Oliver is a clever fellow, and Charles Maddox is a gentlemanlike man, so I will ride over tomorrow, and settle with one of them.\"\nMaria looked apprehensively at Edmund, expecting that he must oppose this enlargement of the plan: but Edmund said nothing. After a moment's thought, Miss Crawford calmly replied, \"I can have no objection to anything that you all think eligible. Have I ever seen either of the gentlemen? Yes, Mr. Charles Maddox dined at my sister's, did not he, Henry? A quiet-looking young man. Let him be applied to, if you please, for it will be less unpleasant to me than a perfect stranger.\"\nTom repeated his resolution of going to Charles Maddox on the morrow; and though Julia observed sarcastically that \"the Mansfield theatricals would enliven the whole neighbourhood exceedingly,\" Edmund still held his peace, and showed his feelings only by a determined gravity.\nMiss Crawford said quietly to Fanny, \"I can tell Mr. Maddox that I shall shorten some of his speeches, and a great many of my own, before we rehearse together. It will be very disagreeable, and by no means what I expected.\"",
        "paragraph_chars": [
            [
                0,
                308
            ],
            [
                308,
                925
            ],
            [
                925,
                1159
            ],
            [
                1159,
                1405
            ],
            [
                1405,
                1503
            ],
            [
                1503,
                1618
            ],
            [
                1618,
                1728
            ],
            [
                1728,
                1799
            ],
            [
                1799,
                1964
            ],
            [
                1964,
                2108
            ],
            [
                2108,
                2318
            ],
            [
                2318,
                2670
            ],
            [
                2670,
                2871
            ],
            [
                2871,
                3054
            ],
            [
                3054,
                3317
            ],
            [
                3317,
                3562
            ],
            [
                3562,
                3699
            ],
            [
                3699,
                3792
            ],
            [
                3792,
                3840
            ],
            [
                3840,
                4137
            ],
            [
                4137,
                5240
            ],
            [
                5240,
                5267
            ],
            [
                5267,
                5735
            ],
            [
                5735,
                5963
            ],
            [
                5963,
                6089
            ],
            [
                6089,
                6379
            ],
            [
                6379,
                6732
            ],
            [
                6732,
                6856
            ],
            [
                6856,
                6972
            ],
            [
                6972,
                7076
            ],
            [
                7076,
                7162
            ],
            [
                7162,
                7313
            ],
            [
                7313,
                7466
            ],
            [
                7466,
                7519
            ],
            [
                7519,
                7562
            ],
            [
                7562,
                7654
            ],
            [
                7654,
                7859
            ],
            [
                7859,
                7919
            ],
            [
                7919,
                8104
            ],
            [
                8104,
                8125
            ],
            [
                8125,
                8275
            ],
            [
                8275,
                8386
            ],
            [
                8386,
                8492
            ],
            [
                8492,
                8545
            ],
            [
                8545,
                8594
            ],
            [
                8594,
                8705
            ],
            [
                8705,
                8810
            ],
            [
                8810,
                9004
            ],
            [
                9004,
                9059
            ],
            [
                9059,
                9194
            ],
            [
                9194,
                9254
            ],
            [
                9254,
                9373
            ],
            [
                9373,
                9556
            ],
            [
                9556,
                10106
            ],
            [
                10106,
                10181
            ],
            [
                10181,
                10407
            ],
            [
                10407,
                11049
            ],
            [
                11049,
                11459
            ],
            [
                11459,
                11973
            ],
            [
                11973,
                12454
            ],
            [
                12454,
                12731
            ],
            [
                12731,
                12954
            ]
        ],
        "segment_chars": [
            [
                0,
                101
            ],
            [
                101,
                308
            ],
            [
                308,
                372
            ],
            [
                372,
                728
            ],
            [
                728,
                925
            ],
            [
                925,
                1159
            ],
            [
                1159,
                1190
            ],
            [
                1190,
                1369
            ],
            [
                1369,
                1405
            ],
            [
                1405,
                1503
            ],
            [
                1503,
                1519
            ],
            [
                1519,
                1618
            ],
            [
                1618,
                1642
            ],
            [
                1642,
                1695
            ],
            [
                1695,
                1728
            ],
            [
                1728,
                1760
            ],
            [
                1760,
                1799
            ],
            [
                1799,
                1964
            ],
            [
                1964,
                2108
            ],
            [
                2108,
                2136
            ],
            [
                2136,
                2193
            ],
            [
                2193,
                2222
            ],
            [
                2222,
                2267
            ],
            [
                2267,
                2318
            ],
            [
                2318,
                2343
            ],
            [
                2343,
                2452
            ],
            [
                2452,
                2568
            ],
            [
                2568,
                2596
            ],
            [
                2596,
                2670
            ],
            [
                2670,
                2871
            ],
            [
                2871,
                2954
            ],
            [
                2954,
                3054
            ],
            [
                3054,
                3317
            ],
            [
                3317,
                3352
            ],
            [
                3352,
                3395
            ],
            [
                3395,
                3461
            ],
            [
                3461,
                3494
            ],
            [
                3494,
                3562
            ],
            [
                3562,
                3622
            ],
            [
                3622,
                3699
            ],
            [
                3699,
                3792
            ],
            [
                3792,
                3840
            ],
            [
                3840,
                3936
            ],
            [
                3936,
                3994
            ],
            [
                3994,
                4137
            ],
            [
                4137,
                4197
            ],
            [
                4197,
                4250
            ],
            [
                4250,
                4344
            ],
            [
                4344,
                4398
            ],
            [
                4398,
                4532
            ],
            [
                4532,
                4573
            ],
            [
                4573,
                4637
            ],
            [
                4637,
                4684
            ],
            [
                4684,
                4758
            ],
            [
                4758,
                4819
            ],
            [
                4819,
                5001
            ],
            [
                5001,
                5082
            ],
            [
                5082,
                5215
            ],
            [
                5215,
                5240
            ],
            [
                5240,
                5267
            ],
            [
                5267,
                5290
            ],
            [
                5290,
                5459
            ],
            [
                5459,
                5501
            ],
            [
                5501,
                5735
            ],
            [
                5735,
                5808
            ],
            [
                5808,
                5963
            ],
            [
                5963,
                6089
            ],
            [
                6089,
                6214
            ],
            [
                6214,
                6379
            ],
            [
                6379,
                6400
            ],
            [
                6400,
                6640
            ],
            [
                6640,
                6661
            ],
            [
                6661,
                6732
            ],
            [
                6732,
                6856
            ],
            [
                6856,
                6972
            ],
            [
                6972,
                7076
            ],
            [
                7076,
                7162
            ],
            [
                7162,
                7232
            ],
            [
                7232,
                7259
            ],
            [
                7259,
                7313
            ],
            [
                7313,
                7427
            ],
            [
                7427,
                7466
            ],
            [
                7466,
                7519
            ],
            [
                7519,
                7562
            ],
            [
                7562,
                7654
            ],
            [
                7654,
                7687
            ],
            [
                7687,
                7805
            ],
            [
                7805,
                7837
            ],
            [
                7837,
                7859
            ],
            [
                7859,
                7919
            ],
            [
                7919,
                8104
            ],
            [
                8104,
                8125
            ],
            [
                8125,
                8275
            ],
            [
                8275,
                8386
            ],
            [
                8386,
                8414
            ],
            [
                8414,
                8492
            ],
            [
                8492,
                8545
            ],
            [
                8545,
                8594
            ],
            [
                8594,
                8599
            ],
            [
                8599,
                8645
            ],
            [
                8645,
                8675
            ],
            [
                8675,
                8705
            ],
            [
                8705,
                8711
            ],
            [
                8711,
                8767
            ],
            [
                8767,
                8795
            ],
            [
                8795,
                8810
            ],
            [
                8810,
                8825
            ],
            [
                8825,
                9004
            ],
            [
                9004,
                9059
            ],
            [
                9059,
                9194
            ],
            [
                9194,
                9227
            ],
            [
                9227,
                9254
            ],
            [
                9254,
                9300
            ],
            [
                9300,
                9342
            ],
            [
                9342,
                9373
            ],
            [
                9373,
                9380
            ],
            [
                9380,
                9409
            ],
            [
                9409,
                9556
            ],
            [
                9556,
                9756
            ],
            [
                9756,
                9818
            ],
            [
                9818,
                10106
            ],
            [
                10106,
                10145
            ],
            [
                10145,
                10181
            ],
            [
                10181,
                10407
            ],
            [
                10407,
                10635
            ],
            [
                10635,
                10937
            ],
            [
                10937,
                11049
            ],
            [
                11049,
                11459
            ],
            [
                11459,
                11632
            ],
            [
                11632,
                11688
            ],
            [
                11688,
                11713
            ],
            [
                11713,
                11973
            ],
            [
                11973,
                12097
            ],
            [
                12097,
                12219
            ],
            [
                12219,
                12261
            ],
            [
                12261,
                12326
            ],
            [
                12326,
                12353
            ],
            [
                12353,
                12454
            ],
            [
                12454,
                12731
            ],
            [
                12731,
                12891
            ],
            [
                12891,
                12954
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                32,
                44
            ],
            [
                50,
                72
            ],
            [
                73,
                94
            ],
            [
                95,
                101
            ],
            [
                101,
                180
            ],
            [
                187,
                188
            ],
            [
                189,
                192
            ],
            [
                193,
                236
            ],
            [
                236,
                285
            ],
            [
                286,
                293
            ],
            [
                297,
                307
            ],
            [
                308,
                329
            ],
            [
                329,
                370
            ],
            [
                372,
                441
            ],
            [
                442,
                540
            ],
            [
                541,
                711
            ],
            [
                719,
                726
            ],
            [
                726,
                728
            ],
            [
                728,
                788
            ],
            [
                800,
                826
            ],
            [
                827,
                839
            ],
            [
                840,
                858
            ],
            [
                859,
                861
            ],
            [
                862,
                873
            ],
            [
                874,
                877
            ],
            [
                878,
                910
            ],
            [
                911,
                925
            ],
            [
                925,
                965
            ],
            [
                970,
                977
            ],
            [
                978,
                1003
            ],
            [
                1006,
                1044
            ],
            [
                1044,
                1077
            ],
            [
                1077,
                1078
            ],
            [
                1079,
                1117
            ],
            [
                1118,
                1159
            ],
            [
                1159,
                1190
            ],
            [
                1190,
                1276
            ],
            [
                1277,
                1328
            ],
            [
                1329,
                1369
            ],
            [
                1369,
                1405
            ],
            [
                1405,
                1468
            ],
            [
                1469,
                1503
            ],
            [
                1503,
                1519
            ],
            [
                1519,
                1563
            ],
            [
                1564,
                1569
            ],
            [
                1569,
                1616
            ],
            [
                1616,
                1618
            ],
            [
                1618,
                1642
            ],
            [
                1642,
                1643
            ],
            [
                1643,
                1685
            ],
            [
                1686,
                1693
            ],
            [
                1693,
                1695
            ],
            [
                1695,
                1728
            ],
            [
                1728,
                1760
            ],
            [
                1760,
                1780
            ],
            [
                1781,
                1799
            ],
            [
                1799,
                1964
            ],
            [
                1964,
                2042
            ],
            [
                2043,
                2045
            ],
            [
                2045,
                2076
            ],
            [
                2077,
                2108
            ],
            [
                2108,
                2134
            ],
            [
                2136,
                2193
            ],
            [
                2193,
                2222
            ],
            [
                2222,
                2234
            ],
            [
                2235,
                2267
            ],
            [
                2267,
                2298
            ],
            [
                2299,
                2318
            ],
            [
                2318,
                2341
            ],
            [
                2341,
                2343
            ],
            [
                2345,
                2381
            ],
            [
                2382,
                2384
            ],
            [
                2385,
                2398
            ],
            [
                2398,
                2403
            ],
            [
                2408,
                2432
            ],
            [
                2433,
                2436
            ],
            [
                2437,
                2450
            ],
            [
                2450,
                2451
            ],
            [
                2452,
                2458
            ],
            [
                2468,
                2471
            ],
            [
                2471,
                2485
            ],
            [
                2486,
                2492
            ],
            [
                2493,
                2497
            ],
            [
                2498,
                2501
            ],
            [
                2502,
                2514
            ],
            [
                2515,
                2524
            ],
            [
                2525,
                2554
            ],
            [
                2566,
                2568
            ],
            [
                2568,
                2569
            ],
            [
                2575,
                2578
            ],
            [
                2579,
                2583
            ],
            [
                2589,
                2591
            ],
            [
                2594,
                2596
            ],
            [
                2596,
                2600
            ],
            [
                2601,
                2623
            ],
            [
                2624,
                2635
            ],
            [
                2635,
                2667
            ],
            [
                2670,
                2710
            ],
            [
                2724,
                2725
            ],
            [
                2727,
                2757
            ],
            [
                2758,
                2759
            ],
            [
                2760,
                2796
            ],
            [
                2797,
                2798
            ],
            [
                2799,
                2809
            ],
            [
                2810,
                2814
            ],
            [
                2815,
                2826
            ],
            [
                2827,
                2840
            ],
            [
                2841,
                2856
            ],
            [
                2868,
                2871
            ],
            [
                2871,
                2927
            ],
            [
                2928,
                2931
            ],
            [
                2932,
                2954
            ],
            [
                2954,
                3019
            ],
            [
                3025,
                3051
            ],
            [
                3054,
                3101
            ],
            [
                3101,
                3152
            ],
            [
                3153,
                3185
            ],
            [
                3186,
                3255
            ],
            [
                3256,
                3302
            ],
            [
                3307,
                3314
            ],
            [
                3317,
                3339
            ],
            [
                3350,
                3352
            ],
            [
                3352,
                3395
            ],
            [
                3395,
                3459
            ],
            [
                3459,
                3461
            ],
            [
                3461,
                3464
            ],
            [
                3465,
                3494
            ],
            [
                3494,
                3562
            ],
            [
                3562,
                3622
            ],
            [
                3622,
                3696
            ],
            [
                3696,
                3699
            ],
            [
                3699,
                3792
            ],
            [
                3792,
                3840
            ],
            [
                3840,
                3934
            ],
            [
                3936,
                3951
            ],
            [
                3952,
                3956
            ],
            [
                3957,
                3960
            ],
            [
                3961,
                3989
            ],
            [
                3992,
                3994
            ],
            [
                3994,
                4032
            ],
            [
                4033,
                4076
            ],
            [
                4076,
                4094
            ],
            [
                4105,
                4137
            ],
            [
                4137,
                4165
            ],
            [
                4166,
                4197
            ],
            [
                4197,
                4198
            ],
            [
                4198,
                4222
            ],
            [
                4223,
                4248
            ],
            [
                4248,
                4250
            ],
            [
                4250,
                4277
            ],
            [
                4278,
                4316
            ],
            [
                4317,
                4344
            ],
            [
                4344,
                4398
            ],
            [
                4398,
                4532
            ],
            [
                4532,
                4573
            ],
            [
                4573,
                4637
            ],
            [
                4637,
                4638
            ],
            [
                4639,
                4641
            ],
            [
                4642,
                4682
            ],
            [
                4682,
                4684
            ],
            [
                4684,
                4758
            ],
            [
                4758,
                4811
            ],
            [
                4817,
                4819
            ],
            [
                4819,
                4859
            ],
            [
                4864,
                4904
            ],
            [
                4914,
                4930
            ],
            [
                4931,
                4932
            ],
            [
                4965,
                4968
            ],
            [
                4977,
                4978
            ],
            [
                4999,
                5001
            ],
            [
                5001,
                5027
            ],
            [
                5027,
                5028
            ],
            [
                5029,
                5030
            ],
            [
                5030,
                5034
            ],
            [
                5035,
                5050
            ],
            [
                5050,
                5079
            ],
            [
                5079,
                5082
            ],
            [
                5082,
                5132
            ],
            [
                5133,
                5139
            ],
            [
                5139,
                5175
            ],
            [
                5176,
                5205
            ],
            [
                5208,
                5215
            ],
            [
                5215,
                5237
            ],
            [
                5237,
                5240
            ],
            [
                5240,
                5246
            ],
            [
                5256,
                5258
            ],
            [
                5259,
                5265
            ],
            [
                5265,
                5267
            ],
            [
                5267,
                5290
            ],
            [
                5290,
                5384
            ],
            [
                5385,
                5457
            ],
            [
                5457,
                5459
            ],
            [
                5459,
                5464
            ],
            [
                5465,
                5501
            ],
            [
                5501,
                5578
            ],
            [
                5583,
                5587
            ],
            [
                5588,
                5590
            ],
            [
                5603,
                5735
            ],
            [
                5735,
                5738
            ],
            [
                5739,
                5744
            ],
            [
                5745,
                5759
            ],
            [
                5759,
                5760
            ],
            [
                5761,
                5775
            ],
            [
                5776,
                5779
            ],
            [
                5780,
                5787
            ],
            [
                5793,
                5806
            ],
            [
                5808,
                5833
            ],
            [
                5834,
                5838
            ],
            [
                5839,
                5845
            ],
            [
                5846,
                5848
            ],
            [
                5849,
                5852
            ],
            [
                5853,
                5858
            ],
            [
                5859,
                5890
            ],
            [
                5891,
                5895
            ],
            [
                5896,
                5917
            ],
            [
                5926,
                5948
            ],
            [
                5949,
                5963
            ],
            [
                5963,
                6075
            ],
            [
                6079,
                6082
            ],
            [
                6089,
                6091
            ],
            [
                6092,
                6161
            ],
            [
                6162,
                6199
            ],
            [
                6200,
                6214
            ],
            [
                6214,
                6247
            ],
            [
                6248,
                6278
            ],
            [
                6279,
                6310
            ],
            [
                6311,
                6367
            ],
            [
                6371,
                6379
            ],
            [
                6379,
                6400
            ],
            [
                6400,
                6405
            ],
            [
                6415,
                6486
            ],
            [
                6487,
                6613
            ],
            [
                6614,
                6638
            ],
            [
                6638,
                6640
            ],
            [
                6640,
                6661
            ],
            [
                6661,
                6732
            ],
            [
                6732,
                6799
            ],
            [
                6800,
                6855
            ],
            [
                6856,
                6857
            ],
            [
                6857,
                6895
            ],
            [
                6895,
                6905
            ],
            [
                6906,
                6915
            ],
            [
                6915,
                6916
            ],
            [
                6917,
                6918
            ],
            [
                6918,
                6972
            ],
            [
                6972,
                6982
            ],
            [
                6983,
                7076
            ],
            [
                7076,
                7077
            ],
            [
                7077,
                7080
            ],
            [
                7081,
                7086
            ],
            [
                7087,
                7162
            ],
            [
                7162,
                7171
            ],
            [
                7172,
                7202
            ],
            [
                7202,
                7232
            ],
            [
                7232,
                7259
            ],
            [
                7259,
                7313
            ],
            [
                7313,
                7322
            ],
            [
                7328,
                7427
            ],
            [
                7434,
                7463
            ],
            [
                7463,
                7466
            ],
            [
                7466,
                7471
            ],
            [
                7472,
                7479
            ],
            [
                7480,
                7517
            ],
            [
                7517,
                7518
            ],
            [
                7519,
                7520
            ],
            [
                7520,
                7521
            ],
            [
                7522,
                7553
            ],
            [
                7554,
                7558
            ],
            [
                7560,
                7562
            ],
            [
                7562,
                7654
            ],
            [
                7654,
                7674
            ],
            [
                7674,
                7685
            ],
            [
                7685,
                7687
            ],
            [
                7688,
                7799
            ],
            [
                7800,
                7803
            ],
            [
                7805,
                7837
            ],
            [
                7837,
                7859
            ],
            [
                7859,
                7919
            ],
            [
                7919,
                7920
            ],
            [
                7920,
                7921
            ],
            [
                7922,
                7963
            ],
            [
                7963,
                8022
            ],
            [
                8022,
                8042
            ],
            [
                8050,
                8069
            ],
            [
                8069,
                8070
            ],
            [
                8071,
                8104
            ],
            [
                8104,
                8125
            ],
            [
                8125,
                8128
            ],
            [
                8129,
                8132
            ],
            [
                8133,
                8149
            ],
            [
                8150,
                8153
            ],
            [
                8154,
                8275
            ],
            [
                8275,
                8276
            ],
            [
                8276,
                8280
            ],
            [
                8281,
                8286
            ],
            [
                8291,
                8383
            ],
            [
                8386,
                8412
            ],
            [
                8421,
                8430
            ],
            [
                8431,
                8452
            ],
            [
                8457,
                8461
            ],
            [
                8462,
                8490
            ],
            [
                8490,
                8492
            ],
            [
                8492,
                8519
            ],
            [
                8520,
                8545
            ],
            [
                8545,
                8592
            ],
            [
                8592,
                8594
            ],
            [
                8594,
                8599
            ],
            [
                8599,
                8645
            ],
            [
                8645,
                8647
            ],
            [
                8648,
                8675
            ],
            [
                8675,
                8705
            ],
            [
                8705,
                8711
            ],
            [
                8711,
                8749
            ],
            [
                8750,
                8767
            ],
            [
                8767,
                8795
            ],
            [
                8795,
                8810
            ],
            [
                8810,
                8811
            ],
            [
                8811,
                8823
            ],
            [
                8823,
                8825
            ],
            [
                8825,
                8877
            ],
            [
                8878,
                8881
            ],
            [
                8882,
                8903
            ],
            [
                8903,
                8920
            ],
            [
                8921,
                9001
            ],
            [
                9001,
                9004
            ],
            [
                9004,
                9005
            ],
            [
                9008,
                9009
            ],
            [
                9010,
                9026
            ],
            [
                9027,
                9057
            ],
            [
                9059,
                9137
            ],
            [
                9138,
                9142
            ],
            [
                9143,
                9194
            ],
            [
                9194,
                9195
            ],
            [
                9195,
                9222
            ],
            [
                9223,
                9225
            ],
            [
                9227,
                9251
            ],
            [
                9251,
                9254
            ],
            [
                9254,
                9300
            ],
            [
                9300,
                9342
            ],
            [
                9342,
                9373
            ],
            [
                9373,
                9380
            ],
            [
                9380,
                9409
            ],
            [
                9409,
                9510
            ],
            [
                9511,
                9536
            ],
            [
                9537,
                9556
            ],
            [
                9556,
                9557
            ],
            [
                9564,
                9597
            ],
            [
                9601,
                9718
            ],
            [
                9718,
                9756
            ],
            [
                9756,
                9790
            ],
            [
                9791,
                9816
            ],
            [
                9818,
                9821
            ],
            [
                9830,
                9887
            ],
            [
                9888,
                9891
            ],
            [
                9892,
                9903
            ],
            [
                9914,
                9920
            ],
            [
                9921,
                9923
            ],
            [
                9924,
                9929
            ],
            [
                9930,
                9937
            ],
            [
                9937,
                9959
            ],
            [
                9960,
                10062
            ],
            [
                10068,
                10076
            ],
            [
                10076,
                10103
            ],
            [
                10106,
                10145
            ],
            [
                10146,
                10178
            ],
            [
                10181,
                10347
            ],
            [
                10347,
                10407
            ],
            [
                10407,
                10464
            ],
            [
                10465,
                10550
            ],
            [
                10555,
                10573
            ],
            [
                10573,
                10608
            ],
            [
                10609,
                10614
            ],
            [
                10615,
                10632
            ],
            [
                10635,
                10638
            ],
            [
                10639,
                10644
            ],
            [
                10645,
                10654
            ],
            [
                10655,
                10708
            ],
            [
                10708,
                10833
            ],
            [
                10834,
                10937
            ],
            [
                10937,
                11028
            ],
            [
                11029,
                11049
            ],
            [
                11049,
                11100
            ],
            [
                11110,
                11117
            ],
            [
                11118,
                11137
            ],
            [
                11158,
                11161
            ],
            [
                11168,
                11172
            ],
            [
                11172,
                11275
            ],
            [
                11276,
                11279
            ],
            [
                11288,
                11338
            ],
            [
                11338,
                11401
            ],
            [
                11402,
                11459
            ],
            [
                11459,
                11488
            ],
            [
                11489,
                11541
            ],
            [
                11542,
                11566
            ],
            [
                11567,
                11577
            ],
            [
                11578,
                11580
            ],
            [
                11586,
                11630
            ],
            [
                11630,
                11632
            ],
            [
                11632,
                11647
            ],
            [
                11651,
                11688
            ],
            [
                11688,
                11689
            ],
            [
                11689,
                11704
            ],
            [
                11711,
                11713
            ],
            [
                11713,
                11725
            ],
            [
                11726,
                11739
            ],
            [
                11740,
                11838
            ],
            [
                11839,
                11854
            ],
            [
                11855,
                11891
            ],
            [
                11892,
                11893
            ],
            [
                11894,
                11907
            ],
            [
                11908,
                11911
            ],
            [
                11911,
                11922
            ],
            [
                11923,
                11932
            ],
            [
                11941,
                11973
            ],
            [
                11973,
                11978
            ],
            [
                11986,
                12000
            ],
            [
                12001,
                12010
            ],
            [
                12010,
                12011
            ],
            [
                12022,
                12041
            ],
            [
                12042,
                12046
            ],
            [
                12047,
                12070
            ],
            [
                12070,
                12071
            ],
            [
                12072,
                12097
            ],
            [
                12097,
                12154
            ],
            [
                12154,
                12219
            ],
            [
                12219,
                12261
            ],
            [
                12261,
                12305
            ],
            [
                12305,
                12326
            ],
            [
                12326,
                12353
            ],
            [
                12353,
                12356
            ],
            [
                12357,
                12360
            ],
            [
                12361,
                12432
            ],
            [
                12433,
                12454
            ],
            [
                12454,
                12493
            ],
            [
                12509,
                12540
            ],
            [
                12541,
                12549
            ],
            [
                12564,
                12680
            ],
            [
                12688,
                12731
            ],
            [
                12731,
                12744
            ],
            [
                12745,
                12749
            ],
            [
                12758,
                12767
            ],
            [
                12768,
                12769
            ],
            [
                12769,
                12819
            ],
            [
                12820,
                12823
            ],
            [
                12824,
                12853
            ],
            [
                12854,
                12856
            ],
            [
                12857,
                12860
            ],
            [
                12860,
                12891
            ],
            [
                12891,
                12954
            ]
        ],
        "row_chars": [
            [
                0,
                101
            ],
            [
                101,
                308
            ],
            [
                308,
                728
            ],
            [
                728,
                925
            ],
            [
                925,
                1159
            ],
            [
                1159,
                1190
            ],
            [
                1190,
                1369
            ],
            [
                1369,
                1405
            ],
            [
                1405,
                1503
            ],
            [
                1503,
                1519
            ],
            [
                1519,
                1618
            ],
            [
                1618,
                1642
            ],
            [
                1642,
                1695
            ],
            [
                1695,
                1695
            ],
            [
                1695,
                1695
            ],
            [
                1695,
                1728
            ],
            [
                1728,
                1760
            ],
            [
                1760,
                1799
            ],
            [
                1799,
                1964
            ],
            [
                1964,
                2108
            ],
            [
                2108,
                2193
            ],
            [
                2193,
                2222
            ],
            [
                2222,
                2267
            ],
            [
                2267,
                2318
            ],
            [
                2318,
                2343
            ],
            [
                2343,
                2568
            ],
            [
                2568,
                2596
            ],
            [
                2596,
                2670
            ],
            [
                2670,
                2670
            ],
            [
                2670,
                2670
            ],
            [
                2670,
                2871
            ],
            [
                2871,
                2954
            ],
            [
                2954,
                3054
            ],
            [
                3054,
                3054
            ],
            [
                3054,
                3317
            ],
            [
                3317,
                3317
            ],
            [
                3317,
                3352
            ],
            [
                3352,
                3395
            ],
            [
                3395,
                3461
            ],
            [
                3461,
                3461
            ],
            [
                3461,
                3494
            ],
            [
                3494,
                3562
            ],
            [
                3562,
                3622
            ],
            [
                3622,
                3699
            ],
            [
                3699,
                3792
            ],
            [
                3792,
                3840
            ],
            [
                3840,
                3936
            ],
            [
                3936,
                3936
            ],
            [
                3936,
                3936
            ],
            [
                3936,
                3936
            ],
            [
                3936,
                3994
            ],
            [
                3994,
                3994
            ],
            [
                3994,
                4137
            ],
            [
                4137,
                4197
            ],
            [
                4197,
                4250
            ],
            [
                4250,
                4344
            ],
            [
                4344,
                4344
            ],
            [
                4344,
                4398
            ],
            [
                4398,
                4532
            ],
            [
                4532,
                4573
            ],
            [
                4573,
                4637
            ],
            [
                4637,
                4637
            ],
            [
                4637,
                4684
            ],
            [
                4684,
                4758
            ],
            [
                4758,
                4819
            ],
            [
                4819,
                5001
            ],
            [
                5001,
                5082
            ],
            [
                5082,
                5215
            ],
            [
                5215,
                5240
            ],
            [
                5240,
                5267
            ],
            [
                5267,
                5290
            ],
            [
                5290,
                5459
            ],
            [
                5459,
                5501
            ],
            [
                5501,
                5735
            ],
            [
                5735,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                5963
            ],
            [
                5963,
                6089
            ],
            [
                6089,
                6214
            ],
            [
                6214,
                6379
            ],
            [
                6379,
                6400
            ],
            [
                6400,
                6400
            ],
            [
                6400,
                6640
            ],
            [
                6640,
                6661
            ],
            [
                6661,
                6732
            ],
            [
                6732,
                6856
            ],
            [
                6856,
                6856
            ],
            [
                6856,
                6972
            ],
            [
                6972,
                7076
            ],
            [
                7076,
                7162
            ],
            [
                7162,
                7232
            ],
            [
                7232,
                7259
            ],
            [
                7259,
                7313
            ],
            [
                7313,
                7427
            ],
            [
                7427,
                7466
            ],
            [
                7466,
                7519
            ],
            [
                7519,
                7519
            ],
            [
                7519,
                7562
            ],
            [
                7562,
                7654
            ],
            [
                7654,
                7687
            ],
            [
                7687,
                7687
            ],
            [
                7687,
                7805
            ],
            [
                7805,
                7837
            ],
            [
                7837,
                7837
            ],
            [
                7837,
                7859
            ],
            [
                7859,
                7919
            ],
            [
                7919,
                8104
            ],
            [
                8104,
                8125
            ],
            [
                8125,
                8275
            ],
            [
                8275,
                8386
            ],
            [
                8386,
                8386
            ],
            [
                8386,
                8492
            ],
            [
                8492,
                8545
            ],
            [
                8545,
                8594
            ],
            [
                8594,
                8599
            ],
            [
                8599,
                8645
            ],
            [
                8645,
                8645
            ],
            [
                8645,
                8675
            ],
            [
                8675,
                8705
            ],
            [
                8705,
                8711
            ],
            [
                8711,
                8767
            ],
            [
                8767,
                8795
            ],
            [
                8795,
                8795
            ],
            [
                8795,
                8810
            ],
            [
                8810,
                8825
            ],
            [
                8825,
                9004
            ],
            [
                9004,
                9059
            ],
            [
                9059,
                9194
            ],
            [
                9194,
                9227
            ],
            [
                9227,
                9227
            ],
            [
                9227,
                9254
            ],
            [
                9254,
                9300
            ],
            [
                9300,
                9300
            ],
            [
                9300,
                9342
            ],
            [
                9342,
                9373
            ],
            [
                9373,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9409
            ],
            [
                9409,
                9556
            ],
            [
                9556,
                9756
            ],
            [
                9756,
                10106
            ],
            [
                10106,
                10106
            ],
            [
                10106,
                10145
            ],
            [
                10145,
                10145
            ],
            [
                10145,
                10181
            ],
            [
                10181,
                10181
            ],
            [
                10181,
                10181
            ],
            [
                10181,
                10181
            ],
            [
                10181,
                10407
            ],
            [
                10407,
                10937
            ],
            [
                10937,
                11049
            ],
            [
                11049,
                11459
            ],
            [
                11459,
                11632
            ],
            [
                11632,
                11688
            ],
            [
                11688,
                11713
            ],
            [
                11713,
                11973
            ],
            [
                11973,
                12097
            ],
            [
                12097,
                12219
            ],
            [
                12219,
                12261
            ],
            [
                12261,
                12326
            ],
            [
                12326,
                12353
            ],
            [
                12353,
                12353
            ],
            [
                12353,
                12454
            ],
            [
                12454,
                12454
            ],
            [
                12454,
                12731
            ],
            [
                12731,
                12891
            ],
            [
                12891,
                12954
            ]
        ]
    }
}