{
    "original": {
        "text": "It was not in Miss Crawford's power to talk Fanny into any real forgetfulness of what had passed. When the evening was over, she went to bed full of it, her nerves still agitated by the shock of such an attack from her cousin Tom, so public and so persevered in, and her spirits sinking under her aunt's unkind reflection and reproach. To be called into notice in such a manner, to hear that it was but the prelude to something so infinitely worse, to be told that she must do what was so impossible as to act; and then to have the charge of obstinacy and ingratitude follow it, enforced with such a hint at the dependence of her situation, had been too distressing at the time to make the remembrance when she was alone much less so, especially with the superadded dread of what the morrow might produce in continuation of the subject. Miss Crawford had protected her only for the time; and if she were applied to again among themselves with all the authoritative urgency that Tom and Maria were capable of, and Edmund perhaps away, what should she do? She fell asleep before she could answer the question, and found it quite as puzzling when she awoke the next morning. The little white attic, which had continued her sleeping-room ever since her first entering the family, proving incompetent to suggest any reply, she had recourse, as soon as she was dressed, to another apartment more spacious and more meet for walking about in and thinking, and of which she had now for some time been almost equally mistress. It had been their school-room; so called till the Miss Bertrams would not allow it to be called so any longer, and inhabited as such to a later period. There Miss Lee had lived, and there they had read and written, and talked and laughed, till within the last three years, when she had quitted them. The room had then become useless, and for some time was quite deserted, except by Fanny, when she visited her plants, or wanted one of the books, which she was still glad to keep there, from the deficiency of space and accommodation in her little chamber above: but gradually, as her value for the comforts of it increased, she had added to her possessions, and spent more of her time there; and having nothing to oppose her, had so naturally and so artlessly worked herself into it, that it was now generally admitted to be hers. The East room, as it had been called ever since Maria Bertram was sixteen, was now considered Fanny's, almost as decidedly as the white attic: the smallness of the one making the use of the other so evidently reasonable that the Miss Bertrams, with every superiority in their own apartments which their own sense of superiority could demand, were entirely approving it; and Mrs. Norris, having stipulated for there never being a fire in it on Fanny's account, was tolerably resigned to her having the use of what nobody else wanted, though the terms in which she sometimes spoke of the indulgence seemed to imply that it was the best room in the house.\nThe aspect was so favourable that even without a fire it was habitable in many an early spring and late autumn morning to such a willing mind as Fanny's; and while there was a gleam of sunshine she hoped not to be driven from it entirely, even when winter came. The comfort of it in her hours of leisure was extreme. She could go there after anything unpleasant below, and find immediate consolation in some pursuit, or some train of thought at hand. Her plants, her books-of which she had been a collector from the first hour of her commanding a shilling-her writing-desk, and her works of charity and ingenuity, were all within her reach; or if indisposed for employment, if nothing but musing would do, she could scarcely see an object in that room which had not an interesting remembrance connected with it. Everything was a friend, or bore her thoughts to a friend; and though there had been sometimes much of suffering to her; though her motives had often been misunderstood, her feelings disregarded, and her comprehension undervalued; though she had known the pains of tyranny, of ridicule, and neglect, yet almost every recurrence of either had led to something consolatory: her aunt Bertram had spoken for her, or Miss Lee had been encouraging, or, what was yet more frequent or more dear, Edmund had been her champion and her friend: he had supported her cause or explained her meaning, he had told her not to cry, or had given her some proof of affection which made her tears delightful; and the whole was now so blended together, so harmonised by distance, that every former affliction had its charm. The room was most dear to her, and she would not have changed its furniture for the handsomest in the house, though what had been originally plain had suffered all the ill-usage of children; and its greatest elegancies and ornaments were a faded footstool of Julia's work, too ill done for the drawing-room, three transparencies, made in a rage for transparencies, for the three lower panes of one window, where Tintern Abbey held its station between a cave in Italy and a moonlight lake in Cumberland, a collection of family profiles, thought unworthy of being anywhere else, over the mantelpiece, and by their side, and pinned against the wall, a small sketch of a ship sent four years ago from the Mediterranean by William, with H.M.S. Antwerp at the bottom, in letters as tall as the mainmast.\nTo this nest of comforts Fanny now walked down to try its influence on an agitated, doubting spirit, to see if by looking at Edmund's profile she could catch any of his counsel, or by giving air to her geraniums she might inhale a breeze of mental strength herself. But she had more than fears of her own perseverance to remove: she had begun to feel undecided as to what she _ought_ _to_ _do_; and as she walked round the room her doubts were increasing. Was she _right_ in refusing what was so warmly asked, so strongly wished for-what might be so essential to a scheme on which some of those to whom she owed the greatest complaisance had set their hearts? Was it not ill-nature, selfishness, and a fear of exposing herself? And would Edmund's judgment, would his persuasion of Sir Thomas's disapprobation of the whole, be enough to justify her in a determined denial in spite of all the rest? It would be so horrible to her to act that she was inclined to suspect the truth and purity of her own scruples; and as she looked around her, the claims of her cousins to being obliged were strengthened by the sight of present upon present that she had received from them. The table between the windows was covered with work-boxes and netting-boxes which had been given her at different times, principally by Tom; and she grew bewildered as to the amount of the debt which all these kind remembrances produced. A tap at the door roused her in the midst of this attempt to find her way to her duty, and her gentle \"Come in\" was answered by the appearance of one, before whom all her doubts were wont to be laid. Her eyes brightened at the sight of Edmund.\n\"Can I speak with you, Fanny, for a few minutes?\" said he.\n\"Yes, certainly.\"\n\"I want to consult. I want your opinion.\"\n\"My opinion!\" she cried, shrinking from such a compliment, highly as it gratified her.\n\"Yes, your advice and opinion. I do not know what to do. This acting scheme gets worse and worse, you see. They have chosen almost as bad a play as they could, and now, to complete the business, are going to ask the help of a young man very slightly known to any of us. This is the end of all the privacy and propriety which was talked about at first. I know no harm of Charles Maddox; but the excessive intimacy which must spring from his being admitted among us in this manner is highly objectionable, the _more_ than intimacy-the familiarity. I cannot think of it with any patience; and it does appear to me an evil of such magnitude as must, _if_ _possible_, be prevented. Do not you see it in the same light?\"\n\"Yes; but what can be done? Your brother is so determined.\"\n\"There is but _one_ thing to be done, Fanny. I must take Anhalt myself. I am well aware that nothing else will quiet Tom.\"\nFanny could not answer him.\n\"It is not at all what I like,\" he continued. \"No man can like being driven into the _appearance_ of such inconsistency. After being known to oppose the scheme from the beginning, there is absurdity in the face of my joining them _now_, when they are exceeding their first plan in every respect; but I can think of no other alternative. Can you, Fanny?\"\n\"No,\" said Fanny slowly, \"not immediately, but-\"\n\"But what? I see your judgment is not with me. Think it a little over. Perhaps you are not so much aware as I am of the mischief that _may_, of the unpleasantness that _must_ arise from a young man's being received in this manner: domesticated among us; authorised to come at all hours, and placed suddenly on a footing which must do away all restraints. To think only of the licence which every rehearsal must tend to create. It is all very bad! Put yourself in Miss Crawford's place, Fanny. Consider what it would be to act Amelia with a stranger. She has a right to be felt for, because she evidently feels for herself. I heard enough of what she said to you last night to understand her unwillingness to be acting with a stranger; and as she probably engaged in the part with different expectations-perhaps without considering the subject enough to know what was likely to be-it would be ungenerous, it would be really wrong to expose her to it. Her feelings ought to be respected. Does it not strike you so, Fanny? You hesitate.\"\n\"I am sorry for Miss Crawford; but I am more sorry to see you drawn in to do what you had resolved against, and what you are known to think will be disagreeable to my uncle. It will be such a triumph to the others!\"\n\"They will not have much cause of triumph when they see how infamously I act. But, however, triumph there certainly will be, and I must brave it. But if I can be the means of restraining the publicity of the business, of limiting the exhibition, of concentrating our folly, I shall be well repaid. As I am now, I have no influence, I can do nothing: I have offended them, and they will not hear me; but when I have put them in good-humour by this concession, I am not without hopes of persuading them to confine the representation within a much smaller circle than they are now in the high road for. This will be a material gain. My object is to confine it to Mrs. Rushworth and the Grants. Will not this be worth gaining?\"\n\"Yes, it will be a great point.\"\n\"But still it has not your approbation. Can you mention any other measure by which I have a chance of doing equal good?\"\n\"No, I cannot think of anything else.\"\n\"Give me your approbation, then, Fanny. I am not comfortable without it.\"\n\"Oh, cousin!\"\n\"If you are against me, I ought to distrust myself, and yet-But it is absolutely impossible to let Tom go on in this way, riding about the country in quest of anybody who can be persuaded to act-no matter whom: the look of a gentleman is to be enough. I thought _you_ would have entered more into Miss Crawford's feelings.\"\n\"No doubt she will be very glad. It must be a great relief to her,\" said Fanny, trying for greater warmth of manner.\n\"She never appeared more amiable than in her behaviour to you last night. It gave her a very strong claim on my goodwill.\"\n\"She _was_ very kind, indeed, and I am glad to have her spared\"...\nShe could not finish the generous effusion. Her conscience stopt her in the middle, but Edmund was satisfied.\n\"I shall walk down immediately after breakfast,\" said he, \"and am sure of giving pleasure there. And now, dear Fanny, I will not interrupt you any longer. You want to be reading. But I could not be easy till I had spoken to you, and come to a decision. Sleeping or waking, my head has been full of this matter all night. It is an evil, but I am certainly making it less than it might be. If Tom is up, I shall go to him directly and get it over, and when we meet at breakfast we shall be all in high good-humour at the prospect of acting the fool together with such unanimity. _You_, in the meanwhile, will be taking a trip into China, I suppose. How does Lord Macartney go on?\"-opening a volume on the table and then taking up some others. \"And here are Crabbe's Tales, and the Idler, at hand to relieve you, if you tire of your great book. I admire your little establishment exceedingly; and as soon as I am gone, you will empty your head of all this nonsense of acting, and sit comfortably down to your table. But do not stay here to be cold.\"\nHe went; but there was no reading, no China, no composure for Fanny. He had told her the most extraordinary, the most inconceivable, the most unwelcome news; and she could think of nothing else. To be acting! After all his objections-objections so just and so public! After all that she had heard him say, and seen him look, and known him to be feeling. Could it be possible? Edmund so inconsistent! Was he not deceiving himself? Was he not wrong? Alas! it was all Miss Crawford's doing. She had seen her influence in every speech, and was miserable. The doubts and alarms as to her own conduct, which had previously distressed her, and which had all slept while she listened to him, were become of little consequence now. This deeper anxiety swallowed them up. Things should take their course; she cared not how it ended. Her cousins might attack, but could hardly tease her. She was beyond their reach; and if at last obliged to yield-no matter-it was all misery now.",
        "paragraph_chars": [
            [
                0,
                3001
            ],
            [
                3001,
                5413
            ],
            [
                5413,
                7066
            ],
            [
                7066,
                7125
            ],
            [
                7125,
                7143
            ],
            [
                7143,
                7185
            ],
            [
                7185,
                7272
            ],
            [
                7272,
                7987
            ],
            [
                7987,
                8047
            ],
            [
                8047,
                8170
            ],
            [
                8170,
                8198
            ],
            [
                8198,
                8552
            ],
            [
                8552,
                8601
            ],
            [
                8601,
                9636
            ],
            [
                9636,
                9852
            ],
            [
                9852,
                10576
            ],
            [
                10576,
                10609
            ],
            [
                10609,
                10730
            ],
            [
                10730,
                10769
            ],
            [
                10769,
                10843
            ],
            [
                10843,
                10857
            ],
            [
                10857,
                11181
            ],
            [
                11181,
                11298
            ],
            [
                11298,
                11421
            ],
            [
                11421,
                11488
            ],
            [
                11488,
                11598
            ],
            [
                11598,
                12645
            ],
            [
                12645,
                13614
            ]
        ],
        "segment_chars": [
            [
                0,
                98
            ],
            [
                98,
                336
            ],
            [
                336,
                837
            ],
            [
                837,
                1054
            ],
            [
                1054,
                1172
            ],
            [
                1172,
                1517
            ],
            [
                1517,
                1669
            ],
            [
                1669,
                1817
            ],
            [
                1817,
                2348
            ],
            [
                2348,
                3001
            ],
            [
                3001,
                3263
            ],
            [
                3263,
                3318
            ],
            [
                3318,
                3452
            ],
            [
                3452,
                3813
            ],
            [
                3813,
                4615
            ],
            [
                4615,
                5354
            ],
            [
                5354,
                5413
            ],
            [
                5413,
                5679
            ],
            [
                5679,
                5869
            ],
            [
                5869,
                6073
            ],
            [
                6073,
                6141
            ],
            [
                6141,
                6310
            ],
            [
                6310,
                6584
            ],
            [
                6584,
                6822
            ],
            [
                6822,
                7022
            ],
            [
                7022,
                7066
            ],
            [
                7066,
                7116
            ],
            [
                7116,
                7125
            ],
            [
                7125,
                7143
            ],
            [
                7143,
                7163
            ],
            [
                7163,
                7185
            ],
            [
                7185,
                7199
            ],
            [
                7199,
                7272
            ],
            [
                7272,
                7303
            ],
            [
                7303,
                7329
            ],
            [
                7329,
                7379
            ],
            [
                7379,
                7542
            ],
            [
                7542,
                7624
            ],
            [
                7624,
                7818
            ],
            [
                7818,
                7949
            ],
            [
                7949,
                7987
            ],
            [
                7987,
                8015
            ],
            [
                8015,
                8047
            ],
            [
                8047,
                8092
            ],
            [
                8092,
                8119
            ],
            [
                8119,
                8170
            ],
            [
                8170,
                8198
            ],
            [
                8198,
                8244
            ],
            [
                8244,
                8319
            ],
            [
                8319,
                8535
            ],
            [
                8535,
                8552
            ],
            [
                8552,
                8601
            ],
            [
                8601,
                8612
            ],
            [
                8612,
                8648
            ],
            [
                8648,
                8672
            ],
            [
                8672,
                8956
            ],
            [
                8956,
                9028
            ],
            [
                9028,
                9048
            ],
            [
                9048,
                9094
            ],
            [
                9094,
                9151
            ],
            [
                9151,
                9224
            ],
            [
                9224,
                9551
            ],
            [
                9551,
                9587
            ],
            [
                9587,
                9621
            ],
            [
                9621,
                9636
            ],
            [
                9636,
                9810
            ],
            [
                9810,
                9852
            ],
            [
                9852,
                9930
            ],
            [
                9930,
                9998
            ],
            [
                9998,
                10150
            ],
            [
                10150,
                10452
            ],
            [
                10452,
                10482
            ],
            [
                10482,
                10543
            ],
            [
                10543,
                10576
            ],
            [
                10576,
                10609
            ],
            [
                10609,
                10649
            ],
            [
                10649,
                10730
            ],
            [
                10730,
                10769
            ],
            [
                10769,
                10809
            ],
            [
                10809,
                10843
            ],
            [
                10843,
                10857
            ],
            [
                10857,
                11109
            ],
            [
                11109,
                11181
            ],
            [
                11181,
                11214
            ],
            [
                11214,
                11298
            ],
            [
                11298,
                11372
            ],
            [
                11372,
                11421
            ],
            [
                11421,
                11488
            ],
            [
                11488,
                11532
            ],
            [
                11532,
                11598
            ],
            [
                11598,
                11695
            ],
            [
                11695,
                11753
            ],
            [
                11753,
                11777
            ],
            [
                11777,
                11851
            ],
            [
                11851,
                11919
            ],
            [
                11919,
                11986
            ],
            [
                11986,
                12175
            ],
            [
                12175,
                12245
            ],
            [
                12245,
                12275
            ],
            [
                12275,
                12339
            ],
            [
                12339,
                12440
            ],
            [
                12440,
                12611
            ],
            [
                12611,
                12645
            ],
            [
                12645,
                12714
            ],
            [
                12714,
                12840
            ],
            [
                12840,
                12854
            ],
            [
                12854,
                12913
            ],
            [
                12913,
                12999
            ],
            [
                12999,
                13021
            ],
            [
                13021,
                13045
            ],
            [
                13045,
                13075
            ],
            [
                13075,
                13093
            ],
            [
                13093,
                13099
            ],
            [
                13099,
                13133
            ],
            [
                13133,
                13196
            ],
            [
                13196,
                13368
            ],
            [
                13368,
                13407
            ],
            [
                13407,
                13468
            ],
            [
                13468,
                13522
            ],
            [
                13522,
                13614
            ]
        ],
        "overlap_chars": [
            [
                14,
                27
            ],
            [
                7,
                10
            ],
            [
                44,
                49
            ],
            [
                64,
                70
            ],
            [
                81,
                98
            ],
            [
                125,
                178
            ],
            [
                263,
                310
            ],
            [
                326,
                336
            ],
            [
                449,
                574
            ],
            [
                639,
                649
            ],
            [
                654,
                665
            ],
            [
                733,
                754
            ],
            [
                760,
                804
            ],
            [
                835,
                837
            ],
            [
                837,
                920
            ],
            [
                1032,
                1053
            ],
            [
                1054,
                1172
            ],
            [
                1172,
                1195
            ],
            [
                1461,
                1468
            ],
            [
                1274,
                1275
            ],
            [
                1311,
                1321
            ],
            [
                1336,
                1362
            ],
            [
                1296,
                1298
            ],
            [
                1264,
                1267
            ],
            [
                1535,
                1546
            ],
            [
                1667,
                1669
            ],
            [
                1790,
                1794
            ],
            [
                1675,
                1687
            ],
            [
                1803,
                1815
            ],
            [
                1730,
                1731
            ],
            [
                1817,
                1829
            ],
            [
                1835,
                1841
            ],
            [
                1873,
                1905
            ],
            [
                1977,
                1982
            ],
            [
                1923,
                1926
            ],
            [
                1956,
                1961
            ],
            [
                1669,
                1674
            ],
            [
                2077,
                2078
            ],
            [
                2083,
                2092
            ],
            [
                2139,
                2207
            ],
            [
                1693,
                1698
            ],
            [
                2348,
                2361
            ],
            [
                2423,
                2441
            ],
            [
                2342,
                2347
            ],
            [
                2573,
                2638
            ],
            [
                2688,
                2752
            ],
            [
                2301,
                2305
            ],
            [
                1699,
                1704
            ],
            [
                2763,
                2768
            ],
            [
                2339,
                2341
            ],
            [
                2775,
                2811
            ],
            [
                2822,
                2844
            ],
            [
                2856,
                2887
            ],
            [
                2907,
                2926
            ],
            [
                2094,
                2096
            ],
            [
                2966,
                3001
            ],
            [
                3035,
                3054
            ],
            [
                3238,
                3239
            ],
            [
                3146,
                3151
            ],
            [
                3267,
                3274
            ],
            [
                3165,
                3170
            ],
            [
                3281,
                3304
            ],
            [
                3316,
                3318
            ],
            [
                3337,
                3369
            ],
            [
                3318,
                3327
            ],
            [
                3374,
                3403
            ],
            [
                3452,
                3473
            ],
            [
                3416,
                3417
            ],
            [
                3557,
                3599
            ],
            [
                3613,
                3614
            ],
            [
                3620,
                3644
            ],
            [
                3675,
                3813
            ],
            [
                3813,
                3836
            ],
            [
                3870,
                3875
            ],
            [
                3862,
                3863
            ],
            [
                3913,
                3915
            ],
            [
                4185,
                4258
            ],
            [
                4301,
                4329
            ],
            [
                3932,
                3933
            ],
            [
                4346,
                4372
            ],
            [
                4397,
                4499
            ],
            [
                4613,
                4614
            ],
            [
                4615,
                4730
            ],
            [
                4810,
                4833
            ],
            [
                4848,
                4922
            ],
            [
                5118,
                5191
            ],
            [
                4806,
                4809
            ],
            [
                5262,
                5354
            ],
            [
                5354,
                5413
            ],
            [
                5679,
                5682
            ],
            [
                5774,
                5776
            ],
            [
                5438,
                5443
            ],
            [
                5819,
                5840
            ],
            [
                5481,
                5483
            ],
            [
                5416,
                5420
            ],
            [
                5495,
                5496
            ],
            [
                5841,
                5869
            ],
            [
                5869,
                5876
            ],
            [
                5878,
                5883
            ],
            [
                5885,
                5908
            ],
            [
                5926,
                5945
            ],
            [
                6071,
                6073
            ],
            [
                6073,
                6083
            ],
            [
                6096,
                6141
            ],
            [
                6310,
                6384
            ],
            [
                6395,
                6447
            ],
            [
                6451,
                6478
            ],
            [
                6496,
                6584
            ],
            [
                6584,
                6593
            ],
            [
                6614,
                6635
            ],
            [
                6653,
                6748
            ],
            [
                6820,
                6822
            ],
            [
                6822,
                6850
            ],
            [
                6907,
                7022
            ],
            [
                7022,
                7066
            ],
            [
                7066,
                7094
            ],
            [
                7113,
                7116
            ],
            [
                7116,
                7125
            ],
            [
                7125,
                7143
            ],
            [
                7163,
                7185
            ],
            [
                7185,
                7199
            ],
            [
                7199,
                7272
            ],
            [
                7272,
                7276
            ],
            [
                7301,
                7303
            ],
            [
                7303,
                7329
            ],
            [
                7329,
                7379
            ],
            [
                7379,
                7439
            ],
            [
                7467,
                7530
            ],
            [
                7538,
                7542
            ],
            [
                7542,
                7560
            ],
            [
                7569,
                7590
            ],
            [
                7622,
                7624
            ],
            [
                7624,
                7711
            ],
            [
                7733,
                7735
            ],
            [
                7751,
                7774
            ],
            [
                7816,
                7818
            ],
            [
                7836,
                7838
            ],
            [
                7877,
                7890
            ],
            [
                7912,
                7917
            ],
            [
                7919,
                7921
            ],
            [
                7933,
                7947
            ],
            [
                7987,
                8015
            ],
            [
                8015,
                8047
            ],
            [
                8047,
                8048
            ],
            [
                8092,
                8117
            ],
            [
                8083,
                8091
            ],
            [
                8140,
                8170
            ],
            [
                8170,
                8198
            ],
            [
                8198,
                8208
            ],
            [
                8216,
                8242
            ],
            [
                8376,
                8377
            ],
            [
                8244,
                8245
            ],
            [
                8494,
                8535
            ],
            [
                8535,
                8552
            ],
            [
                8552,
                8601
            ],
            [
                8612,
                8648
            ],
            [
                8648,
                8656
            ],
            [
                8666,
                8672
            ],
            [
                8672,
                8691
            ],
            [
                8700,
                8705
            ],
            [
                8742,
                8768
            ],
            [
                8770,
                8774
            ],
            [
                8776,
                8830
            ],
            [
                8954,
                8956
            ],
            [
                8959,
                8964
            ],
            [
                8970,
                9011
            ],
            [
                9020,
                9028
            ],
            [
                9028,
                9033
            ],
            [
                9038,
                9048
            ],
            [
                9048,
                9094
            ],
            [
                9224,
                9308
            ],
            [
                9319,
                9355
            ],
            [
                9367,
                9404
            ],
            [
                9505,
                9551
            ],
            [
                9587,
                9621
            ],
            [
                9621,
                9636
            ],
            [
                9636,
                9756
            ],
            [
                9770,
                9810
            ],
            [
                9810,
                9852
            ],
            [
                9852,
                9930
            ],
            [
                9998,
                10010
            ],
            [
                10039,
                10069
            ],
            [
                10082,
                10096
            ],
            [
                10124,
                10136
            ],
            [
                10142,
                10150
            ],
            [
                10150,
                10182
            ],
            [
                10200,
                10201
            ],
            [
                10251,
                10312
            ],
            [
                10495,
                10497
            ],
            [
                10348,
                10367
            ],
            [
                10383,
                10411
            ],
            [
                10182,
                10183
            ],
            [
                10509,
                10543
            ],
            [
                10543,
                10576
            ],
            [
                10576,
                10609
            ],
            [
                10609,
                10635
            ],
            [
                10647,
                10649
            ],
            [
                10770,
                10795
            ],
            [
                10802,
                10809
            ],
            [
                10809,
                10843
            ],
            [
                10843,
                10857
            ],
            [
                10857,
                10916
            ],
            [
                10952,
                10962
            ],
            [
                10979,
                11051
            ],
            [
                11107,
                11109
            ],
            [
                11109,
                11118
            ],
            [
                11120,
                11123
            ],
            [
                11125,
                11181
            ],
            [
                11214,
                11298
            ],
            [
                11298,
                11370
            ],
            [
                11421,
                11425
            ],
            [
                11427,
                11430
            ],
            [
                11432,
                11483
            ],
            [
                11488,
                11508
            ],
            [
                11570,
                11598
            ],
            [
                11598,
                11599
            ],
            [
                11699,
                11751
            ],
            [
                11644,
                11654
            ],
            [
                11751,
                11753
            ],
            [
                11777,
                11825
            ],
            [
                11849,
                11851
            ],
            [
                11871,
                11919
            ],
            [
                12000,
                12013
            ],
            [
                11989,
                11992
            ],
            [
                12018,
                12153
            ],
            [
                12173,
                12175
            ],
            [
                12176,
                12179
            ],
            [
                12180,
                12244
            ],
            [
                12275,
                12306
            ],
            [
                12337,
                12339
            ],
            [
                12339,
                12383
            ],
            [
                12392,
                12440
            ],
            [
                12440,
                12559
            ],
            [
                12569,
                12609
            ],
            [
                12645,
                12714
            ],
            [
                12714,
                12752
            ],
            [
                12776,
                12840
            ],
            [
                12840,
                12854
            ],
            [
                12854,
                12878
            ],
            [
                12911,
                12913
            ],
            [
                12999,
                13021
            ],
            [
                13021,
                13045
            ],
            [
                13045,
                13075
            ],
            [
                13075,
                13092
            ],
            [
                13093,
                13099
            ],
            [
                13099,
                13133
            ],
            [
                13133,
                13196
            ],
            [
                13196,
                13206
            ],
            [
                13218,
                13277
            ],
            [
                13329,
                13368
            ],
            [
                13368,
                13407
            ],
            [
                13440,
                13468
            ],
            [
                13468,
                13497
            ],
            [
                13522,
                13614
            ]
        ],
        "row_chars": [
            [
                0,
                98
            ],
            [
                98,
                336
            ],
            [
                336,
                837
            ],
            [
                837,
                1054
            ],
            [
                1054,
                1172
            ],
            [
                1172,
                1669
            ],
            [
                1669,
                3001
            ],
            [
                3001,
                3318
            ],
            [
                3318,
                3813
            ],
            [
                3813,
                4615
            ],
            [
                4615,
                5354
            ],
            [
                5354,
                5413
            ],
            [
                5413,
                5869
            ],
            [
                5869,
                6073
            ],
            [
                6073,
                6141
            ],
            [
                6141,
                6310
            ],
            [
                6310,
                6584
            ],
            [
                6584,
                6822
            ],
            [
                6822,
                7022
            ],
            [
                7022,
                7066
            ],
            [
                7066,
                7116
            ],
            [
                7116,
                7125
            ],
            [
                7125,
                7143
            ],
            [
                7143,
                7163
            ],
            [
                7163,
                7185
            ],
            [
                7185,
                7199
            ],
            [
                7199,
                7272
            ],
            [
                7272,
                7303
            ],
            [
                7303,
                7329
            ],
            [
                7329,
                7379
            ],
            [
                7379,
                7542
            ],
            [
                7542,
                7624
            ],
            [
                7624,
                7818
            ],
            [
                7818,
                7949
            ],
            [
                7949,
                7987
            ],
            [
                7987,
                8015
            ],
            [
                8015,
                8047
            ],
            [
                8047,
                8119
            ],
            [
                8119,
                8170
            ],
            [
                8170,
                8198
            ],
            [
                8198,
                8535
            ],
            [
                8535,
                8552
            ],
            [
                8552,
                8601
            ],
            [
                8601,
                8612
            ],
            [
                8612,
                8648
            ],
            [
                8648,
                8672
            ],
            [
                8672,
                8956
            ],
            [
                8956,
                9028
            ],
            [
                9028,
                9048
            ],
            [
                9048,
                9094
            ],
            [
                9094,
                9151
            ],
            [
                9151,
                9224
            ],
            [
                9224,
                9551
            ],
            [
                9551,
                9587
            ],
            [
                9587,
                9621
            ],
            [
                9621,
                9636
            ],
            [
                9636,
                9810
            ],
            [
                9810,
                9852
            ],
            [
                9852,
                9930
            ],
            [
                9930,
                9998
            ],
            [
                9998,
                10150
            ],
            [
                10150,
                10543
            ],
            [
                10543,
                10576
            ],
            [
                10576,
                10609
            ],
            [
                10609,
                10649
            ],
            [
                10649,
                10730
            ],
            [
                10730,
                10769
            ],
            [
                10769,
                10809
            ],
            [
                10809,
                10843
            ],
            [
                10843,
                10857
            ],
            [
                10857,
                11109
            ],
            [
                11109,
                11181
            ],
            [
                11181,
                11214
            ],
            [
                11214,
                11298
            ],
            [
                11298,
                11372
            ],
            [
                11372,
                11421
            ],
            [
                11421,
                11488
            ],
            [
                11488,
                11598
            ],
            [
                11598,
                11753
            ],
            [
                11753,
                11777
            ],
            [
                11777,
                11851
            ],
            [
                11851,
                11919
            ],
            [
                11919,
                11986
            ],
            [
                11986,
                12175
            ],
            [
                12175,
                12245
            ],
            [
                12245,
                12275
            ],
            [
                12275,
                12339
            ],
            [
                12339,
                12440
            ],
            [
                12440,
                12611
            ],
            [
                12611,
                12645
            ],
            [
                12645,
                12714
            ],
            [
                12714,
                12840
            ],
            [
                12840,
                12854
            ],
            [
                12854,
                12913
            ],
            [
                12913,
                12999
            ],
            [
                12999,
                13021
            ],
            [
                13021,
                13045
            ],
            [
                13045,
                13075
            ],
            [
                13075,
                13093
            ],
            [
                13093,
                13099
            ],
            [
                13099,
                13133
            ],
            [
                13133,
                13196
            ],
            [
                13196,
                13368
            ],
            [
                13368,
                13407
            ],
            [
                13407,
                13468
            ],
            [
                13468,
                13614
            ]
        ]
    },
    "abridged": {
        "text": "Miss Crawford could not make Fanny forget what had passed. She went to bed full of it, her nerves still agitated and her spirits sinking under her aunt's unkind reproach. To be told that she must do what was so impossible as to act; and then to have the charge of obstinacy and ingratitude follow, had been distressing, especially with the added dread of what the morrow might produce. Miss Crawford had protected her only for the time; and if she were applied to again, what should she do?\nShe fell asleep before she could answer the question, and found it quite as puzzling when she awoke the next morning. The little white attic, where she had always slept, suggesting no reply, she went as soon as she was dressed to the old school-room. When Miss Lee had quitted them, the room had become quite deserted, except by Fanny, who still kept her books there: gradually, she had added to her possessions, and spent more of her time there, and the East room was now considered hers. The Miss Bertrams, with every superiority in their own apartments, were entirely approving it; and Mrs. Norris, having stipulated that there should never be a fire in it on Fanny's account, was resigned to her having what nobody else wanted, though she sometimes spoke as if it was the best room in the house.\nEven without a fire, Fanny found great comfort there in her hours of leisure. After anything unpleasant below, she could find immediate consolation in her plants, her books, her writing-desk, and her works of charity, all within her reach; or if nothing but musing would do, she could scarcely see an object in that room which had not an interesting remembrance connected with it. Everything was a friend; and held a memory of how her aunt Bertram had spoken for her, or Miss Lee had been encouraging, or how Edmund had been her champion; he had supported her cause, he had told her not to cry, or had given her some proof of affection which made her tears delightful.\nThe room was most dear to her, and she would not have changed its furniture for the handsomest in the house, though its greatest elegancies were a faded footstool of Julia's work, too ill done for the drawing-room, a collection of family profiles, thought unworthy of being anywhere else, and a small sketch of a ship sent four years ago from the Mediterranean by William, with H.M.S. Antwerp at the bottom, in letters as tall as the mainmast.\nBut as Fanny walked round the room on this morning, her doubts were increasing. Was she right in refusing what was so strongly wished for? Was it not selfishness, and a fear of exposing herself? It would be so horrible to her to act that she was inclined to suspect the purity of her own scruples; and as she looked around, the claims of her cousins were strengthened by the sight of present upon present that she had received from them. The table was covered with work-boxes which had been given her at different times, principally by Tom; and she grew bewildered. A tap at the door roused her, and her gentle \"Come in\" was answered by the appearance of one, before whom all her doubts were wont to be laid. Her eyes brightened at the sight of Edmund.\n\"Can I speak with you, Fanny?\" said he.\n\"Yes, certainly.\"\n\"I want your opinion.\"\n\"My opinion!\" she cried, shrinking from such a compliment, highly as it gratified her.\n\"Yes. I do not know what to do. This acting scheme gets worse and worse, you see. They have chosen almost as bad a play as they could, and now are going to ask the help of a young man very slightly known to us. This is the end of privacy and propriety. I know no harm of Charles Maddox; but the excessive intimacy which must spring from his joining us is highly objectionable. It appears to me an evil that must, if possible, be prevented.\"\n\"Yes; but what can be done? Your brother is so determined.\"\n\"I must take Anhalt myself, Fanny. Nothing else will quiet Tom.\"\nFanny could not answer him.\n\"It is not what I like,\" he continued, \"but I can think of no other alternative. Can you, Fanny?\"\n\"No,\" said Fanny slowly, \"not immediately, but-\"\n\"I see your judgment is not with me. Think it over. Perhaps you are not aware of the unpleasantness that must arise from a young man's being received in this manner. Think of the licence which every rehearsal must create. It is very bad! Put yourself in Miss Crawford's place, Fanny. I heard enough of what she said to you last night to understand her unwillingness to act with a stranger; and as she probably took the part with different expectations-it would be really wrong to expose her to it. Does it not strike you so, Fanny? You hesitate.\"\n\"I am sorry for Miss Crawford; but I am more sorry to see you drawn in to do what you had resolved against, and what you think will be disagreeable to my uncle. It will be such a triumph to the others!\"\n\"They will not have much cause of triumph when they see how infamously I act. But if I can restrain the publicity of the business, and limit the exhibition, I shall be repaid. As I am now, I have no influence: but when I have put them in good-humour by this concession, I hope to persuade them to confine the play within a much smaller circle, to Mrs. Rushworth and the Grants. Will not this be worth gaining?\"\n\"Yes, it will be a great point.\"\n\"But still it has not your approval. Give me your approbation, Fanny. I am not comfortable without it.\"\n\"Oh, cousin!\"\n\"If you are against me, I ought to distrust myself, and yet I cannot let Tom go riding about the country in quest of anybody who can be persuaded to act. I thought you would have entered more into Miss Crawford's feelings.\"\n\"It must be a great relief to her,\" said Fanny, trying for greater warmth of manner.\n\"She never appeared more amiable than in her behaviour to you last night.\"\n\"She was very kind, indeed, and I am glad to have her spared...\"\nShe could not finish, but Edmund was satisfied.\n\"Now, dear Fanny, I will not interrupt you any longer,\" said he. \"But I could not be easy till I had spoken to you. My head has been full of this matter all night. I shall go to Tom directly and get it over, and when we meet at breakfast we shall be all in high good-humour at the prospect of acting the fool together. You, in the meanwhile, will be taking a trip into China, I suppose.\"-opening a volume on the table. \"And here are Crabbe's Tales, and the Idler, to relieve you, if you tire of your great book. I admire your little establishment exceedingly; and as soon as I am gone, you will empty your head of all this nonsense, and sit comfortably down to your table.\"\nHe went; but there was no reading, no China, no composure for Fanny. He had told her the most extraordinary, the most unwelcome news; and she could think of nothing else. To be acting! After all his objections! Could it be possible? Edmund so inconsistent! Was he not deceiving himself? Was he not wrong?\nAlas! it was all Miss Crawford's doing. She had seen her influence in every speech, and was miserable. The doubts as to her own conduct, which had previously distressed her, were become of little consequence now. This deeper anxiety swallowed them up. She cared not how it ended. Her cousins might attack, but she was beyond their reach; and if at last obliged to yield-no matter-it was all misery now.",
        "paragraph_chars": [
            [
                0,
                491
            ],
            [
                491,
                1291
            ],
            [
                1291,
                1960
            ],
            [
                1960,
                2404
            ],
            [
                2404,
                3157
            ],
            [
                3157,
                3197
            ],
            [
                3197,
                3215
            ],
            [
                3215,
                3238
            ],
            [
                3238,
                3325
            ],
            [
                3325,
                3766
            ],
            [
                3766,
                3826
            ],
            [
                3826,
                3891
            ],
            [
                3891,
                3919
            ],
            [
                3919,
                4017
            ],
            [
                4017,
                4066
            ],
            [
                4066,
                4613
            ],
            [
                4613,
                4816
            ],
            [
                4816,
                5227
            ],
            [
                5227,
                5260
            ],
            [
                5260,
                5364
            ],
            [
                5364,
                5378
            ],
            [
                5378,
                5602
            ],
            [
                5602,
                5687
            ],
            [
                5687,
                5762
            ],
            [
                5762,
                5827
            ],
            [
                5827,
                5875
            ],
            [
                5875,
                6549
            ],
            [
                6549,
                6854
            ],
            [
                6854,
                7256
            ]
        ],
        "segment_chars": [
            [
                0,
                59
            ],
            [
                59,
                171
            ],
            [
                171,
                386
            ],
            [
                386,
                491
            ],
            [
                491,
                609
            ],
            [
                609,
                742
            ],
            [
                742,
                981
            ],
            [
                981,
                1291
            ],
            [
                1291,
                1369
            ],
            [
                1369,
                1672
            ],
            [
                1672,
                1960
            ],
            [
                1960,
                2345
            ],
            [
                2345,
                2404
            ],
            [
                2404,
                2484
            ],
            [
                2484,
                2543
            ],
            [
                2543,
                2599
            ],
            [
                2599,
                2842
            ],
            [
                2842,
                2970
            ],
            [
                2970,
                3113
            ],
            [
                3113,
                3157
            ],
            [
                3157,
                3188
            ],
            [
                3188,
                3197
            ],
            [
                3197,
                3215
            ],
            [
                3215,
                3238
            ],
            [
                3238,
                3252
            ],
            [
                3252,
                3325
            ],
            [
                3325,
                3331
            ],
            [
                3331,
                3357
            ],
            [
                3357,
                3407
            ],
            [
                3407,
                3536
            ],
            [
                3536,
                3578
            ],
            [
                3578,
                3702
            ],
            [
                3702,
                3766
            ],
            [
                3766,
                3794
            ],
            [
                3794,
                3826
            ],
            [
                3826,
                3861
            ],
            [
                3861,
                3891
            ],
            [
                3891,
                3919
            ],
            [
                3919,
                4000
            ],
            [
                4000,
                4017
            ],
            [
                4017,
                4066
            ],
            [
                4066,
                4103
            ],
            [
                4103,
                4118
            ],
            [
                4118,
                4232
            ],
            [
                4232,
                4288
            ],
            [
                4288,
                4304
            ],
            [
                4304,
                4350
            ],
            [
                4350,
                4564
            ],
            [
                4564,
                4598
            ],
            [
                4598,
                4613
            ],
            [
                4613,
                4774
            ],
            [
                4774,
                4816
            ],
            [
                4816,
                4894
            ],
            [
                4894,
                4992
            ],
            [
                4992,
                5194
            ],
            [
                5194,
                5227
            ],
            [
                5227,
                5260
            ],
            [
                5260,
                5297
            ],
            [
                5297,
                5330
            ],
            [
                5330,
                5364
            ],
            [
                5364,
                5378
            ],
            [
                5378,
                5532
            ],
            [
                5532,
                5602
            ],
            [
                5602,
                5687
            ],
            [
                5687,
                5762
            ],
            [
                5762,
                5827
            ],
            [
                5827,
                5875
            ],
            [
                5875,
                5940
            ],
            [
                5940,
                5991
            ],
            [
                5991,
                6039
            ],
            [
                6039,
                6194
            ],
            [
                6194,
                6261
            ],
            [
                6261,
                6294
            ],
            [
                6294,
                6387
            ],
            [
                6387,
                6549
            ],
            [
                6549,
                6618
            ],
            [
                6618,
                6720
            ],
            [
                6720,
                6734
            ],
            [
                6734,
                6760
            ],
            [
                6760,
                6782
            ],
            [
                6782,
                6806
            ],
            [
                6806,
                6836
            ],
            [
                6836,
                6854
            ],
            [
                6854,
                6860
            ],
            [
                6860,
                6894
            ],
            [
                6894,
                6957
            ],
            [
                6957,
                7067
            ],
            [
                7067,
                7106
            ],
            [
                7106,
                7134
            ],
            [
                7134,
                7256
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                20,
                23
            ],
            [
                29,
                34
            ],
            [
                35,
                41
            ],
            [
                42,
                59
            ],
            [
                59,
                112
            ],
            [
                113,
                160
            ],
            [
                161,
                171
            ],
            [
                171,
                296
            ],
            [
                296,
                306
            ],
            [
                307,
                318
            ],
            [
                318,
                339
            ],
            [
                340,
                384
            ],
            [
                384,
                386
            ],
            [
                386,
                469
            ],
            [
                469,
                490
            ],
            [
                491,
                609
            ],
            [
                609,
                632
            ],
            [
                639,
                646
            ],
            [
                659,
                660
            ],
            [
                675,
                685
            ],
            [
                691,
                717
            ],
            [
                718,
                720
            ],
            [
                721,
                724
            ],
            [
                729,
                740
            ],
            [
                740,
                742
            ],
            [
                742,
                746
            ],
            [
                747,
                759
            ],
            [
                760,
                772
            ],
            [
                772,
                773
            ],
            [
                774,
                786
            ],
            [
                787,
                793
            ],
            [
                794,
                826
            ],
            [
                831,
                836
            ],
            [
                842,
                845
            ],
            [
                846,
                851
            ],
            [
                852,
                857
            ],
            [
                857,
                858
            ],
            [
                859,
                868
            ],
            [
                868,
                936
            ],
            [
                936,
                941
            ],
            [
                942,
                955
            ],
            [
                956,
                974
            ],
            [
                975,
                980
            ],
            [
                981,
                1046
            ],
            [
                1046,
                1110
            ],
            [
                1111,
                1115
            ],
            [
                1116,
                1121
            ],
            [
                1129,
                1134
            ],
            [
                1135,
                1137
            ],
            [
                1138,
                1174
            ],
            [
                1175,
                1197
            ],
            [
                1198,
                1229
            ],
            [
                1230,
                1249
            ],
            [
                1250,
                1252
            ],
            [
                1256,
                1291
            ],
            [
                1291,
                1310
            ],
            [
                1310,
                1311
            ],
            [
                1312,
                1317
            ],
            [
                1330,
                1337
            ],
            [
                1338,
                1343
            ],
            [
                1344,
                1367
            ],
            [
                1367,
                1369
            ],
            [
                1369,
                1401
            ],
            [
                1402,
                1411
            ],
            [
                1412,
                1441
            ],
            [
                1442,
                1463
            ],
            [
                1463,
                1464
            ],
            [
                1465,
                1507
            ],
            [
                1507,
                1508
            ],
            [
                1509,
                1533
            ],
            [
                1534,
                1672
            ],
            [
                1672,
                1695
            ],
            [
                1695,
                1700
            ],
            [
                1706,
                1707
            ],
            [
                1715,
                1717
            ],
            [
                1722,
                1795
            ],
            [
                1800,
                1828
            ],
            [
                1828,
                1829
            ],
            [
                1830,
                1856
            ],
            [
                1856,
                1958
            ],
            [
                1958,
                1959
            ],
            [
                1960,
                2075
            ],
            [
                2076,
                2099
            ],
            [
                2100,
                2174
            ],
            [
                2175,
                2248
            ],
            [
                2249,
                2252
            ],
            [
                2253,
                2345
            ],
            [
                2345,
                2404
            ],
            [
                2404,
                2407
            ],
            [
                2408,
                2410
            ],
            [
                2411,
                2416
            ],
            [
                2417,
                2438
            ],
            [
                2439,
                2441
            ],
            [
                2442,
                2446
            ],
            [
                2454,
                2455
            ],
            [
                2456,
                2484
            ],
            [
                2484,
                2491
            ],
            [
                2492,
                2497
            ],
            [
                2498,
                2521
            ],
            [
                2522,
                2541
            ],
            [
                2541,
                2543
            ],
            [
                2543,
                2553
            ],
            [
                2554,
                2599
            ],
            [
                2599,
                2673
            ],
            [
                2674,
                2726
            ],
            [
                2726,
                2753
            ],
            [
                2754,
                2842
            ],
            [
                2842,
                2851
            ],
            [
                2852,
                2873
            ],
            [
                2873,
                2968
            ],
            [
                2968,
                2970
            ],
            [
                2970,
                2998
            ],
            [
                2998,
                3113
            ],
            [
                3113,
                3157
            ],
            [
                3157,
                3185
            ],
            [
                3185,
                3188
            ],
            [
                3188,
                3197
            ],
            [
                3197,
                3215
            ],
            [
                3216,
                3238
            ],
            [
                3238,
                3252
            ],
            [
                3252,
                3325
            ],
            [
                3325,
                3329
            ],
            [
                3329,
                3331
            ],
            [
                3331,
                3357
            ],
            [
                3357,
                3407
            ],
            [
                3407,
                3467
            ],
            [
                3468,
                3531
            ],
            [
                3532,
                3536
            ],
            [
                3536,
                3554
            ],
            [
                3555,
                3576
            ],
            [
                3576,
                3578
            ],
            [
                3578,
                3665
            ],
            [
                3674,
                3676
            ],
            [
                3677,
                3700
            ],
            [
                3700,
                3702
            ],
            [
                3702,
                3704
            ],
            [
                3713,
                3726
            ],
            [
                3732,
                3737
            ],
            [
                3738,
                3740
            ],
            [
                3749,
                3763
            ],
            [
                3766,
                3794
            ],
            [
                3794,
                3826
            ],
            [
                3826,
                3827
            ],
            [
                3827,
                3852
            ],
            [
                3852,
                3860
            ],
            [
                3861,
                3891
            ],
            [
                3891,
                3919
            ],
            [
                3919,
                3929
            ],
            [
                3930,
                3956
            ],
            [
                3956,
                3957
            ],
            [
                3958,
                3959
            ],
            [
                3959,
                4000
            ],
            [
                4000,
                4017
            ],
            [
                4017,
                4066
            ],
            [
                4067,
                4103
            ],
            [
                4103,
                4111
            ],
            [
                4112,
                4118
            ],
            [
                4118,
                4137
            ],
            [
                4138,
                4143
            ],
            [
                4144,
                4170
            ],
            [
                4171,
                4175
            ],
            [
                4176,
                4230
            ],
            [
                4230,
                4232
            ],
            [
                4232,
                4237
            ],
            [
                4238,
                4279
            ],
            [
                4280,
                4288
            ],
            [
                4288,
                4293
            ],
            [
                4294,
                4304
            ],
            [
                4304,
                4350
            ],
            [
                4350,
                4434
            ],
            [
                4439,
                4475
            ],
            [
                4481,
                4518
            ],
            [
                4518,
                4564
            ],
            [
                4564,
                4598
            ],
            [
                4598,
                4613
            ],
            [
                4613,
                4733
            ],
            [
                4734,
                4774
            ],
            [
                4774,
                4816
            ],
            [
                4816,
                4894
            ],
            [
                4894,
                4906
            ],
            [
                4916,
                4946
            ],
            [
                4957,
                4971
            ],
            [
                4971,
                4983
            ],
            [
                4984,
                4992
            ],
            [
                4992,
                5024
            ],
            [
                5024,
                5025
            ],
            [
                5026,
                5087
            ],
            [
                5093,
                5095
            ],
            [
                5105,
                5124
            ],
            [
                5130,
                5158
            ],
            [
                5158,
                5159
            ],
            [
                5160,
                5194
            ],
            [
                5194,
                5227
            ],
            [
                5227,
                5260
            ],
            [
                5260,
                5286
            ],
            [
                5295,
                5297
            ],
            [
                5297,
                5322
            ],
            [
                5323,
                5330
            ],
            [
                5330,
                5364
            ],
            [
                5364,
                5378
            ],
            [
                5378,
                5437
            ],
            [
                5447,
                5457
            ],
            [
                5458,
                5530
            ],
            [
                5530,
                5532
            ],
            [
                5532,
                5541
            ],
            [
                5542,
                5545
            ],
            [
                5546,
                5602
            ],
            [
                5603,
                5687
            ],
            [
                5687,
                5759
            ],
            [
                5762,
                5766
            ],
            [
                5767,
                5770
            ],
            [
                5771,
                5822
            ],
            [
                5827,
                5847
            ],
            [
                5847,
                5875
            ],
            [
                5875,
                5876
            ],
            [
                5876,
                5928
            ],
            [
                5928,
                5938
            ],
            [
                5938,
                5940
            ],
            [
                5941,
                5989
            ],
            [
                5989,
                5991
            ],
            [
                5991,
                6039
            ],
            [
                6039,
                6052
            ],
            [
                6053,
                6056
            ],
            [
                6057,
                6192
            ],
            [
                6192,
                6194
            ],
            [
                6194,
                6197
            ],
            [
                6197,
                6261
            ],
            [
                6261,
                6292
            ],
            [
                6292,
                6294
            ],
            [
                6294,
                6338
            ],
            [
                6339,
                6387
            ],
            [
                6387,
                6506
            ],
            [
                6506,
                6546
            ],
            [
                6549,
                6618
            ],
            [
                6618,
                6656
            ],
            [
                6656,
                6720
            ],
            [
                6720,
                6734
            ],
            [
                6734,
                6758
            ],
            [
                6758,
                6760
            ],
            [
                6760,
                6782
            ],
            [
                6782,
                6806
            ],
            [
                6806,
                6836
            ],
            [
                6836,
                6853
            ],
            [
                6854,
                6860
            ],
            [
                6860,
                6894
            ],
            [
                6894,
                6957
            ],
            [
                6957,
                6967
            ],
            [
                6968,
                7027
            ],
            [
                7028,
                7067
            ],
            [
                7067,
                7106
            ],
            [
                7106,
                7134
            ],
            [
                7134,
                7163
            ],
            [
                7164,
                7256
            ]
        ],
        "row_chars": [
            [
                0,
                59
            ],
            [
                59,
                171
            ],
            [
                171,
                386
            ],
            [
                386,
                491
            ],
            [
                491,
                609
            ],
            [
                609,
                742
            ],
            [
                742,
                1291
            ],
            [
                1291,
                1369
            ],
            [
                1369,
                1672
            ],
            [
                1672,
                1960
            ],
            [
                1960,
                2345
            ],
            [
                2345,
                2404
            ],
            [
                2404,
                2484
            ],
            [
                2484,
                2543
            ],
            [
                2543,
                2599
            ],
            [
                2599,
                2599
            ],
            [
                2599,
                2842
            ],
            [
                2842,
                2970
            ],
            [
                2970,
                3113
            ],
            [
                3113,
                3157
            ],
            [
                3157,
                3188
            ],
            [
                3188,
                3197
            ],
            [
                3197,
                3215
            ],
            [
                3215,
                3215
            ],
            [
                3215,
                3238
            ],
            [
                3238,
                3252
            ],
            [
                3252,
                3325
            ],
            [
                3325,
                3331
            ],
            [
                3331,
                3357
            ],
            [
                3357,
                3407
            ],
            [
                3407,
                3536
            ],
            [
                3536,
                3578
            ],
            [
                3578,
                3702
            ],
            [
                3702,
                3766
            ],
            [
                3766,
                3766
            ],
            [
                3766,
                3794
            ],
            [
                3794,
                3826
            ],
            [
                3826,
                3861
            ],
            [
                3861,
                3891
            ],
            [
                3891,
                3919
            ],
            [
                3919,
                4000
            ],
            [
                4000,
                4017
            ],
            [
                4017,
                4066
            ],
            [
                4066,
                4066
            ],
            [
                4066,
                4103
            ],
            [
                4103,
                4118
            ],
            [
                4118,
                4232
            ],
            [
                4232,
                4288
            ],
            [
                4288,
                4304
            ],
            [
                4304,
                4350
            ],
            [
                4350,
                4350
            ],
            [
                4350,
                4350
            ],
            [
                4350,
                4564
            ],
            [
                4564,
                4564
            ],
            [
                4564,
                4598
            ],
            [
                4598,
                4613
            ],
            [
                4613,
                4774
            ],
            [
                4774,
                4816
            ],
            [
                4816,
                4894
            ],
            [
                4894,
                4894
            ],
            [
                4894,
                4992
            ],
            [
                4992,
                5194
            ],
            [
                5194,
                5227
            ],
            [
                5227,
                5260
            ],
            [
                5260,
                5297
            ],
            [
                5297,
                5297
            ],
            [
                5297,
                5297
            ],
            [
                5297,
                5330
            ],
            [
                5330,
                5364
            ],
            [
                5364,
                5378
            ],
            [
                5378,
                5532
            ],
            [
                5532,
                5602
            ],
            [
                5602,
                5602
            ],
            [
                5602,
                5687
            ],
            [
                5687,
                5762
            ],
            [
                5762,
                5762
            ],
            [
                5762,
                5827
            ],
            [
                5827,
                5875
            ],
            [
                5875,
                5940
            ],
            [
                5940,
                5940
            ],
            [
                5940,
                5991
            ],
            [
                5991,
                6039
            ],
            [
                6039,
                6039
            ],
            [
                6039,
                6194
            ],
            [
                6194,
                6261
            ],
            [
                6261,
                6261
            ],
            [
                6261,
                6294
            ],
            [
                6294,
                6387
            ],
            [
                6387,
                6549
            ],
            [
                6549,
                6549
            ],
            [
                6549,
                6618
            ],
            [
                6618,
                6720
            ],
            [
                6720,
                6734
            ],
            [
                6734,
                6760
            ],
            [
                6760,
                6760
            ],
            [
                6760,
                6782
            ],
            [
                6782,
                6806
            ],
            [
                6806,
                6836
            ],
            [
                6836,
                6854
            ],
            [
                6854,
                6860
            ],
            [
                6860,
                6894
            ],
            [
                6894,
                6957
            ],
            [
                6957,
                7067
            ],
            [
                7067,
                7106
            ],
            [
                7106,
                7134
            ],
            [
                7134,
                7256
            ]
        ]
    }
}