{
    "original": {
        "text": "Everything was now in a regular train: theatre, actors, actresses, and dresses, were all getting forward; but though no other great impediments arose, Fanny found, before many days were past, that it was not all uninterrupted enjoyment to the party themselves, and that she had not to witness the continuance of such unanimity and delight as had been almost too much for her at first. Everybody began to have their vexation. Edmund had many. Entirely against _his_ judgment, a scene-painter arrived from town, and was at work, much to the increase of the expenses, and, what was worse, of the eclat of their proceedings; and his brother, instead of being really guided by him as to the privacy of the representation, was giving an invitation to every family who came in his way. Tom himself began to fret over the scene-painter's slow progress, and to feel the miseries of waiting. He had learned his part-all his parts, for he took every trifling one that could be united with the Butler, and began to be impatient to be acting; and every day thus unemployed was tending to increase his sense of the insignificance of all his parts together, and make him more ready to regret that some other play had not been chosen.\nFanny, being always a very courteous listener, and often the only listener at hand, came in for the complaints and the distresses of most of them. _She_ knew that Mr. Yates was in general thought to rant dreadfully; that Mr. Yates was disappointed in Henry Crawford; that Tom Bertram spoke so quick he would be unintelligible; that Mrs. Grant spoiled everything by laughing; that Edmund was behindhand with his part, and that it was misery to have anything to do with Mr. Rushworth, who was wanting a prompter through every speech. She knew, also, that poor Mr. Rushworth could seldom get anybody to rehearse with him: _his_ complaint came before her as well as the rest; and so decided to her eye was her cousin Maria's avoidance of him, and so needlessly often the rehearsal of the first scene between her and Mr. Crawford, that she had soon all the terror of other complaints from _him_. So far from being all satisfied and all enjoying, she found everybody requiring something they had not, and giving occasion of discontent to the others. Everybody had a part either too long or too short; nobody would attend as they ought; nobody would remember on which side they were to come in; nobody but the complainer would observe any directions.\nFanny believed herself to derive as much innocent enjoyment from the play as any of them; Henry Crawford acted well, and it was a pleasure to _her_ to creep into the theatre, and attend the rehearsal of the first act, in spite of the feelings it excited in some speeches for Maria. Maria, she also thought, acted well, too well; and after the first rehearsal or two, Fanny began to be their only audience; and sometimes as prompter, sometimes as spectator, was often very useful. As far as she could judge, Mr. Crawford was considerably the best actor of all: he had more confidence than Edmund, more judgment than Tom, more talent and taste than Mr. Yates. She did not like him as a man, but she must admit him to be the best actor, and on this point there were not many who differed from her. Mr. Yates, indeed, exclaimed against his tameness and insipidity; and the day came at last, when Mr. Rushworth turned to her with a black look, and said, \"Do you think there is anything so very fine in all this? For the life and soul of me, I cannot admire him; and, between ourselves, to see such an undersized, little, mean-looking man, set up for a fine actor, is very ridiculous in my opinion.\"\nFrom this moment there was a return of his former jealousy, which Maria, from increasing hopes of Crawford, was at little pains to remove; and the chances of Mr. Rushworth's ever attaining to the knowledge of his two-and-forty speeches became much less. As to his ever making anything _tolerable_ of them, nobody had the smallest idea of that except his mother; _she_, indeed, regretted that his part was not more considerable, and deferred coming over to Mansfield till they were forward enough in their rehearsal to comprehend all his scenes; but the others aspired at nothing beyond his remembering the catchword, and the first line of his speech, and being able to follow the prompter through the rest. Fanny, in her pity and kindheartedness, was at great pains to teach him how to learn, giving him all the helps and directions in her power, trying to make an artificial memory for him, and learning every word of his part herself, but without his being much the forwarder.\nMany uncomfortable, anxious, apprehensive feelings she certainly had; but with all these, and other claims on her time and attention, she was as far from finding herself without employment or utility amongst them, as without a companion in uneasiness; quite as far from having no demand on her leisure as on her compassion. The gloom of her first anticipations was proved to have been unfounded. She was occasionally useful to all; she was perhaps as much at peace as any.\nThere was a great deal of needlework to be done, moreover, in which her help was wanted; and that Mrs. Norris thought her quite as well off as the rest, was evident by the manner in which she claimed it-\"Come, Fanny,\" she cried, \"these are fine times for you, but you must not be always walking from one room to the other, and doing the lookings-on at your ease, in this way; I want you here. I have been slaving myself till I can hardly stand, to contrive Mr. Rushworth's cloak without sending for any more satin; and now I think you may give me your help in putting it together. There are but three seams; you may do them in a trice. It would be lucky for me if I had nothing but the executive part to do. _You_ are best off, I can tell you: but if nobody did more than _you_, we should not get on very fast.\"\nFanny took the work very quietly, without attempting any defence; but her kinder aunt Bertram observed on her behalf-\n\"One cannot wonder, sister, that Fanny _should_ be delighted: it is all new to her, you know; you and I used to be very fond of a play ourselves, and so am I still; and as soon as I am a little more at leisure, _I_ mean to look in at their rehearsals too. What is the play about, Fanny? you have never told me.\"\n\"Oh! sister, pray do not ask her now; for Fanny is not one of those who can talk and work at the same time. It is about Lovers' Vows.\"\n\"I believe,\" said Fanny to her aunt Bertram, \"there will be three acts rehearsed to-morrow evening, and that will give you an opportunity of seeing all the actors at once.\"\n\"You had better stay till the curtain is hung,\" interposed Mrs. Norris; \"the curtain will be hung in a day or two-there is very little sense in a play without a curtain-and I am much mistaken if you do not find it draw up into very handsome festoons.\"\nLady Bertram seemed quite resigned to waiting. Fanny did not share her aunt's composure: she thought of the morrow a great deal, for if the three acts were rehearsed, Edmund and Miss Crawford would then be acting together for the first time; the third act would bring a scene between them which interested her most particularly, and which she was longing and dreading to see how they would perform. The whole subject of it was love-a marriage of love was to be described by the gentleman, and very little short of a declaration of love be made by the lady.\nShe had read and read the scene again with many painful, many wondering emotions, and looked forward to their representation of it as a circumstance almost too interesting. She did not _believe_ they had yet rehearsed it, even in private.\nThe morrow came, the plan for the evening continued, and Fanny's consideration of it did not become less agitated. She worked very diligently under her aunt's directions, but her diligence and her silence concealed a very absent, anxious mind; and about noon she made her escape with her work to the East room, that she might have no concern in another, and, as she deemed it, most unnecessary rehearsal of the first act, which Henry Crawford was just proposing, desirous at once of having her time to herself, and of avoiding the sight of Mr. Rushworth. A glimpse, as she passed through the hall, of the two ladies walking up from the Parsonage made no change in her wish of retreat, and she worked and meditated in the East room, undisturbed, for a quarter of an hour, when a gentle tap at the door was followed by the entrance of Miss Crawford.\n\"Am I right? Yes; this is the East room. My dear Miss Price, I beg your pardon, but I have made my way to you on purpose to entreat your help.\"\nFanny, quite surprised, endeavoured to shew herself mistress of the room by her civilities, and looked at the bright bars of her empty grate with concern.\n\"Thank you; I am quite warm, very warm. Allow me to stay here a little while, and do have the goodness to hear me my third act. I have brought my book, and if you would but rehearse it with me, I should be _so_ obliged! I came here to-day intending to rehearse it with Edmund-by ourselves-against the evening, but he is not in the way; and if he _were_, I do not think I could go through it with _him_, till I have hardened myself a little; for really there is a speech or two. You will be so good, won't you?\"\nFanny was most civil in her assurances, though she could not give them in a very steady voice.\n\"Have you ever happened to look at the part I mean?\" continued Miss Crawford, opening her book. \"Here it is. I did not think much of it at first-but, upon my word. There, look at _that_ speech, and _that_, and _that_. How am I ever to look him in the face and say such things? Could you do it? But then he is your cousin, which makes all the difference. You must rehearse it with me, that I may fancy _you_ him, and get on by degrees. You _have_ a look of _his_ sometimes.\"\n\"Have I? I will do my best with the greatest readiness; but I must _read_ the part, for I can say very little of it.\"\n\"_None_ of it, I suppose. You are to have the book, of course. Now for it. We must have two chairs at hand for you to bring forward to the front of the stage. There-very good school-room chairs, not made for a theatre, I dare say; much more fitted for little girls to sit and kick their feet against when they are learning a lesson. What would your governess and your uncle say to see them used for such a purpose? Could Sir Thomas look in upon us just now, he would bless himself, for we are rehearsing all over the house. Yates is storming away in the dining-room. I heard him as I came upstairs, and the theatre is engaged of course by those indefatigable rehearsers, Agatha and Frederick. If _they_ are not perfect, I _shall_ be surprised. By the bye, I looked in upon them five minutes ago, and it happened to be exactly at one of the times when they were trying _not_ to embrace, and Mr. Rushworth was with me. I thought he began to look a little queer, so I turned it off as well as I could, by whispering to him, 'We shall have an excellent Agatha; there is something so _maternal_ in her manner, so completely _maternal_ in her voice and countenance.' Was not that well done of me? He brightened up directly. Now for my soliloquy.\"\nShe began, and Fanny joined in with all the modest feeling which the idea of representing Edmund was so strongly calculated to inspire; but with looks and voice so truly feminine as to be no very good picture of a man. With such an Anhalt, however, Miss Crawford had courage enough; and they had got through half the scene, when a tap at the door brought a pause, and the entrance of Edmund, the next moment, suspended it all.\nSurprise, consciousness, and pleasure appeared in each of the three on this unexpected meeting; and as Edmund was come on the very same business that had brought Miss Crawford, consciousness and pleasure were likely to be more than momentary in _them_. He too had his book, and was seeking Fanny, to ask her to rehearse with him, and help him to prepare for the evening, without knowing Miss Crawford to be in the house; and great was the joy and animation of being thus thrown together, of comparing schemes, and sympathising in praise of Fanny's kind offices.\n_She_ could not equal them in their warmth. _Her_ spirits sank under the glow of theirs, and she felt herself becoming too nearly nothing to both to have any comfort in having been sought by either. They must now rehearse together. Edmund proposed, urged, entreated it, till the lady, not very unwilling at first, could refuse no longer, and Fanny was wanted only to prompt and observe them. She was invested, indeed, with the office of judge and critic, and earnestly desired to exercise it and tell them all their faults; but from doing so every feeling within her shrank-she could not, would not, dared not attempt it: had she been otherwise qualified for criticism, her conscience must have restrained her from venturing at disapprobation. She believed herself to feel too much of it in the aggregate for honesty or safety in particulars. To prompt them must be enough for her; and it was sometimes _more_ than enough; for she could not always pay attention to the book. In watching them she forgot herself; and, agitated by the increasing spirit of Edmund's manner, had once closed the page and turned away exactly as he wanted help. It was imputed to very reasonable weariness, and she was thanked and pitied; but she deserved their pity more than she hoped they would ever surmise. At last the scene was over, and Fanny forced herself to add her praise to the compliments each was giving the other; and when again alone and able to recall the whole, she was inclined to believe their performance would, indeed, have such nature and feeling in it as must ensure their credit, and make it a very suffering exhibition to herself. Whatever might be its effect, however, she must stand the brunt of it again that very day.\nThe first regular rehearsal of the three first acts was certainly to take place in the evening: Mrs. Grant and the Crawfords were engaged to return for that purpose as soon as they could after dinner; and every one concerned was looking forward with eagerness. There seemed a general diffusion of cheerfulness on the occasion. Tom was enjoying such an advance towards the end; Edmund was in spirits from the morning's rehearsal, and little vexations seemed everywhere smoothed away. All were alert and impatient; the ladies moved soon, the gentlemen soon followed them, and with the exception of Lady Bertram, Mrs. Norris, and Julia, everybody was in the theatre at an early hour; and having lighted it up as well as its unfinished state admitted, were waiting only the arrival of Mrs. Grant and the Crawfords to begin.\nThey did not wait long for the Crawfords, but there was no Mrs. Grant. She could not come. Dr. Grant, professing an indisposition, for which he had little credit with his fair sister-in-law, could not spare his wife.\n\"Dr. Grant is ill,\" said she, with mock solemnity. \"He has been ill ever since he did not eat any of the pheasant today. He fancied it tough, sent away his plate, and has been suffering ever since\".\nHere was disappointment! Mrs. Grant's non-attendance was sad indeed. Her pleasant manners and cheerful conformity made her always valuable amongst them; but _now_ she was absolutely necessary. They could not act, they could not rehearse with any satisfaction without her. The comfort of the whole evening was destroyed. What was to be done? Tom, as Cottager, was in despair. After a pause of perplexity, some eyes began to be turned towards Fanny, and a voice or two to say, \"If Miss Price would be so good as to _read_ the part.\" She was immediately surrounded by supplications; everybody asked it; even Edmund said, \"Do, Fanny, if it is not _very_ disagreeable to you.\"\nBut Fanny still hung back. She could not endure the idea of it. Why was not Miss Crawford to be applied to as well? Or why had not she rather gone to her own room, as she had felt to be safest, instead of attending the rehearsal at all? She had known it would irritate and distress her; she had known it her duty to keep away. She was properly punished.\n\"You have only to _read_ the part,\" said Henry Crawford, with renewed entreaty.\n\"And I do believe she can say every word of it,\" added Maria, \"for she could put Mrs. Grant right the other day in twenty places. Fanny, I am sure you know the part.\"\nFanny could not say she did _not_; and as they all persevered, as Edmund repeated his wish, and with a look of even fond dependence on her good-nature, she must yield. She would do her best. Everybody was satisfied; and she was left to the tremors of a most palpitating heart, while the others prepared to begin.\nThey _did_ begin; and being too much engaged in their own noise to be struck by an unusual noise in the other part of the house, had proceeded some way when the door of the room was thrown open, and Julia, appearing at it, with a face all aghast, exclaimed, \"My father is come! He is in the hall at this moment.\"",
        "paragraph_chars": [
            [
                0,
                1219
            ],
            [
                1219,
                2463
            ],
            [
                2463,
                3657
            ],
            [
                3657,
                4636
            ],
            [
                4636,
                5109
            ],
            [
                5109,
                5921
            ],
            [
                5921,
                6039
            ],
            [
                6039,
                6351
            ],
            [
                6351,
                6486
            ],
            [
                6486,
                6659
            ],
            [
                6659,
                6911
            ],
            [
                6911,
                7468
            ],
            [
                7468,
                7707
            ],
            [
                7707,
                8555
            ],
            [
                8555,
                8699
            ],
            [
                8699,
                8854
            ],
            [
                8854,
                9365
            ],
            [
                9365,
                9460
            ],
            [
                9460,
                9934
            ],
            [
                9934,
                10052
            ],
            [
                10052,
                11293
            ],
            [
                11293,
                11720
            ],
            [
                11720,
                12282
            ],
            [
                12282,
                14007
            ],
            [
                14007,
                14827
            ],
            [
                14827,
                15044
            ],
            [
                15044,
                15243
            ],
            [
                15243,
                15915
            ],
            [
                15915,
                16269
            ],
            [
                16269,
                16349
            ],
            [
                16349,
                16516
            ],
            [
                16516,
                16829
            ],
            [
                16829,
                17141
            ]
        ],
        "segment_chars": [
            [
                0,
                385
            ],
            [
                385,
                425
            ],
            [
                425,
                442
            ],
            [
                442,
                779
            ],
            [
                779,
                882
            ],
            [
                882,
                1219
            ],
            [
                1219,
                1366
            ],
            [
                1366,
                1751
            ],
            [
                1751,
                2110
            ],
            [
                2110,
                2263
            ],
            [
                2263,
                2463
            ],
            [
                2463,
                2745
            ],
            [
                2745,
                2943
            ],
            [
                2943,
                3121
            ],
            [
                3121,
                3258
            ],
            [
                3258,
                3470
            ],
            [
                3470,
                3657
            ],
            [
                3657,
                3911
            ],
            [
                3911,
                4364
            ],
            [
                4364,
                4636
            ],
            [
                4636,
                4960
            ],
            [
                4960,
                5032
            ],
            [
                5032,
                5109
            ],
            [
                5109,
                5502
            ],
            [
                5502,
                5690
            ],
            [
                5690,
                5745
            ],
            [
                5745,
                5817
            ],
            [
                5817,
                5921
            ],
            [
                5921,
                6039
            ],
            [
                6039,
                6295
            ],
            [
                6295,
                6326
            ],
            [
                6326,
                6351
            ],
            [
                6351,
                6356
            ],
            [
                6356,
                6459
            ],
            [
                6459,
                6486
            ],
            [
                6486,
                6659
            ],
            [
                6659,
                6911
            ],
            [
                6911,
                6958
            ],
            [
                6958,
                7310
            ],
            [
                7310,
                7468
            ],
            [
                7468,
                7641
            ],
            [
                7641,
                7707
            ],
            [
                7707,
                7822
            ],
            [
                7822,
                8262
            ],
            [
                8262,
                8555
            ],
            [
                8555,
                8568
            ],
            [
                8568,
                8596
            ],
            [
                8596,
                8699
            ],
            [
                8699,
                8854
            ],
            [
                8854,
                8894
            ],
            [
                8894,
                8982
            ],
            [
                8982,
                9074
            ],
            [
                9074,
                9332
            ],
            [
                9332,
                9365
            ],
            [
                9365,
                9460
            ],
            [
                9460,
                9513
            ],
            [
                9513,
                9556
            ],
            [
                9556,
                9569
            ],
            [
                9569,
                9624
            ],
            [
                9624,
                9678
            ],
            [
                9678,
                9737
            ],
            [
                9737,
                9754
            ],
            [
                9754,
                9814
            ],
            [
                9814,
                9895
            ],
            [
                9895,
                9934
            ],
            [
                9934,
                9943
            ],
            [
                9943,
                10052
            ],
            [
                10052,
                10078
            ],
            [
                10078,
                10115
            ],
            [
                10115,
                10127
            ],
            [
                10127,
                10211
            ],
            [
                10211,
                10385
            ],
            [
                10385,
                10467
            ],
            [
                10467,
                10576
            ],
            [
                10576,
                10619
            ],
            [
                10619,
                10745
            ],
            [
                10745,
                10796
            ],
            [
                10796,
                10969
            ],
            [
                10969,
                11213
            ],
            [
                11213,
                11243
            ],
            [
                11243,
                11270
            ],
            [
                11270,
                11293
            ],
            [
                11293,
                11512
            ],
            [
                11512,
                11720
            ],
            [
                11720,
                11973
            ],
            [
                11973,
                12282
            ],
            [
                12282,
                12326
            ],
            [
                12326,
                12481
            ],
            [
                12481,
                12514
            ],
            [
                12514,
                12674
            ],
            [
                12674,
                13026
            ],
            [
                13026,
                13125
            ],
            [
                13125,
                13257
            ],
            [
                13257,
                13421
            ],
            [
                13421,
                13571
            ],
            [
                13571,
                13916
            ],
            [
                13916,
                14007
            ],
            [
                14007,
                14268
            ],
            [
                14268,
                14334
            ],
            [
                14334,
                14490
            ],
            [
                14490,
                14827
            ],
            [
                14827,
                14898
            ],
            [
                14898,
                14918
            ],
            [
                14918,
                15044
            ],
            [
                15044,
                15095
            ],
            [
                15095,
                15165
            ],
            [
                15165,
                15243
            ],
            [
                15243,
                15268
            ],
            [
                15268,
                15312
            ],
            [
                15312,
                15436
            ],
            [
                15436,
                15515
            ],
            [
                15515,
                15563
            ],
            [
                15563,
                15584
            ],
            [
                15584,
                15618
            ],
            [
                15618,
                15774
            ],
            [
                15774,
                15915
            ],
            [
                15915,
                15942
            ],
            [
                15942,
                15979
            ],
            [
                15979,
                16031
            ],
            [
                16031,
                16152
            ],
            [
                16152,
                16242
            ],
            [
                16242,
                16269
            ],
            [
                16269,
                16349
            ],
            [
                16349,
                16479
            ],
            [
                16479,
                16516
            ],
            [
                16516,
                16684
            ],
            [
                16684,
                16707
            ],
            [
                16707,
                16829
            ],
            [
                16829,
                17107
            ],
            [
                17107,
                17141
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                32,
                109
            ],
            [
                151,
                162
            ],
            [
                192,
                248
            ],
            [
                383,
                385
            ],
            [
                385,
                425
            ],
            [
                425,
                442
            ],
            [
                451,
                458
            ],
            [
                460,
                463
            ],
            [
                465,
                526
            ],
            [
                551,
                563
            ],
            [
                619,
                636
            ],
            [
                717,
                779
            ],
            [
                779,
                804
            ],
            [
                843,
                882
            ],
            [
                882,
                993
            ],
            [
                1060,
                1063
            ],
            [
                1006,
                1028
            ],
            [
                1217,
                1219
            ],
            [
                1219,
                1231
            ],
            [
                1239,
                1265
            ],
            [
                1303,
                1329
            ],
            [
                1349,
                1366
            ],
            [
                1367,
                1370
            ],
            [
                1372,
                1508
            ],
            [
                1512,
                1517
            ],
            [
                1544,
                1705
            ],
            [
                1718,
                1751
            ],
            [
                1751,
                1837
            ],
            [
                1891,
                1897
            ],
            [
                1921,
                1937
            ],
            [
                1953,
                1981
            ],
            [
                2050,
                2053
            ],
            [
                1999,
                2014
            ],
            [
                2031,
                2049
            ],
            [
                1917,
                1920
            ],
            [
                2058,
                2062
            ],
            [
                2078,
                2102
            ],
            [
                2104,
                2107
            ],
            [
                2110,
                2141
            ],
            [
                2158,
                2159
            ],
            [
                2170,
                2179
            ],
            [
                2190,
                2212
            ],
            [
                2261,
                2263
            ],
            [
                2263,
                2463
            ],
            [
                2463,
                2468
            ],
            [
                2499,
                2536
            ],
            [
                2553,
                2604
            ],
            [
                2606,
                2609
            ],
            [
                2611,
                2745
            ],
            [
                2745,
                2750
            ],
            [
                2756,
                2760
            ],
            [
                2770,
                2790
            ],
            [
                2941,
                2942
            ],
            [
                2830,
                2867
            ],
            [
                2750,
                2751
            ],
            [
                2873,
                2918
            ],
            [
                2943,
                2986
            ],
            [
                3000,
                3121
            ],
            [
                3121,
                3141
            ],
            [
                3150,
                3195
            ],
            [
                3256,
                3258
            ],
            [
                3328,
                3470
            ],
            [
                3470,
                3518
            ],
            [
                3544,
                3569
            ],
            [
                3592,
                3595
            ],
            [
                3597,
                3624
            ],
            [
                3630,
                3657
            ],
            [
                3657,
                3699
            ],
            [
                3707,
                3835
            ],
            [
                3866,
                3911
            ],
            [
                3911,
                3941
            ],
            [
                3948,
                3952
            ],
            [
                3954,
                3999
            ],
            [
                4017,
                4018
            ],
            [
                4128,
                4132
            ],
            [
                4217,
                4258
            ],
            [
                4278,
                4364
            ],
            [
                4364,
                4448
            ],
            [
                4502,
                4636
            ],
            [
                4636,
                4640
            ],
            [
                4665,
                4714
            ],
            [
                4719,
                4724
            ],
            [
                4736,
                4749
            ],
            [
                4759,
                4777
            ],
            [
                4781,
                4824
            ],
            [
                4958,
                4960
            ],
            [
                5032,
                5109
            ],
            [
                5109,
                5201
            ],
            [
                5207,
                5260
            ],
            [
                5311,
                5395
            ],
            [
                5455,
                5470
            ],
            [
                5483,
                5502
            ],
            [
                5502,
                5521
            ],
            [
                5529,
                5607
            ],
            [
                5612,
                5623
            ],
            [
                5628,
                5631
            ],
            [
                5640,
                5647
            ],
            [
                5661,
                5665
            ],
            [
                5653,
                5655
            ],
            [
                5666,
                5690
            ],
            [
                5690,
                5745
            ],
            [
                5857,
                5880
            ],
            [
                5818,
                5821
            ],
            [
                5886,
                5921
            ],
            [
                5921,
                5954
            ],
            [
                5987,
                6023
            ],
            [
                6037,
                6039
            ],
            [
                6039,
                6077
            ],
            [
                6079,
                6085
            ],
            [
                6087,
                6132
            ],
            [
                6141,
                6173
            ],
            [
                6183,
                6188
            ],
            [
                6219,
                6249
            ],
            [
                6195,
                6196
            ],
            [
                6254,
                6289
            ],
            [
                6293,
                6295
            ],
            [
                6295,
                6326
            ],
            [
                6326,
                6351
            ],
            [
                6351,
                6356
            ],
            [
                6356,
                6398
            ],
            [
                6427,
                6459
            ],
            [
                6459,
                6486
            ],
            [
                6486,
                6585
            ],
            [
                6605,
                6608
            ],
            [
                6634,
                6648
            ],
            [
                6656,
                6659
            ],
            [
                6659,
                6772
            ],
            [
                6828,
                6831
            ],
            [
                6854,
                6857
            ],
            [
                6865,
                6872
            ],
            [
                6878,
                6911
            ],
            [
                6911,
                6958
            ],
            [
                6958,
                7151
            ],
            [
                7153,
                7220
            ],
            [
                7226,
                7310
            ],
            [
                7310,
                7403
            ],
            [
                7409,
                7446
            ],
            [
                7450,
                7468
            ],
            [
                7468,
                7524
            ],
            [
                7530,
                7548
            ],
            [
                7639,
                7641
            ],
            [
                7641,
                7652
            ],
            [
                7663,
                7707
            ],
            [
                7707,
                7723
            ],
            [
                7760,
                7769
            ],
            [
                7826,
                7832
            ],
            [
                7838,
                7895
            ],
            [
                7912,
                7949
            ],
            [
                7820,
                7821
            ],
            [
                7955,
                8017
            ],
            [
                8206,
                8208
            ],
            [
                8052,
                8059
            ],
            [
                8089,
                8153
            ],
            [
                8159,
                8168
            ],
            [
                8260,
                8262
            ],
            [
                8396,
                8555
            ],
            [
                8555,
                8568
            ],
            [
                8568,
                8596
            ],
            [
                8596,
                8645
            ],
            [
                8676,
                8699
            ],
            [
                8699,
                8705
            ],
            [
                8712,
                8722
            ],
            [
                8779,
                8782
            ],
            [
                8789,
                8808
            ],
            [
                8816,
                8854
            ],
            [
                8854,
                8881
            ],
            [
                8892,
                8894
            ],
            [
                8894,
                8910
            ],
            [
                8916,
                8935
            ],
            [
                8939,
                8982
            ],
            [
                8982,
                9059
            ],
            [
                9061,
                9063
            ],
            [
                9065,
                9074
            ],
            [
                9074,
                9080
            ],
            [
                9086,
                9129
            ],
            [
                9162,
                9177
            ],
            [
                9081,
                9085
            ],
            [
                9188,
                9199
            ],
            [
                9201,
                9205
            ],
            [
                9206,
                9249
            ],
            [
                9251,
                9254
            ],
            [
                9255,
                9332
            ],
            [
                9332,
                9365
            ],
            [
                9365,
                9460
            ],
            [
                9460,
                9513
            ],
            [
                9513,
                9556
            ],
            [
                9569,
                9624
            ],
            [
                9624,
                9638
            ],
            [
                9640,
                9644
            ],
            [
                9646,
                9657
            ],
            [
                9659,
                9663
            ],
            [
                9678,
                9686
            ],
            [
                9692,
                9737
            ],
            [
                9737,
                9754
            ],
            [
                9754,
                9757
            ],
            [
                9763,
                9814
            ],
            [
                9814,
                9860
            ],
            [
                9862,
                9865
            ],
            [
                9867,
                9895
            ],
            [
                9895,
                9898
            ],
            [
                9900,
                9904
            ],
            [
                9906,
                9915
            ],
            [
                9917,
                9920
            ],
            [
                9922,
                9934
            ],
            [
                9934,
                9943
            ],
            [
                9943,
                9960
            ],
            [
                9988,
                10000
            ],
            [
                10002,
                10006
            ],
            [
                10008,
                10052
            ],
            [
                10052,
                10053
            ],
            [
                10054,
                10058
            ],
            [
                10060,
                10078
            ],
            [
                10127,
                10150
            ],
            [
                10159,
                10162
            ],
            [
                10187,
                10211
            ],
            [
                10211,
                10246
            ],
            [
                10293,
                10351
            ],
            [
                10383,
                10385
            ],
            [
                10385,
                10467
            ],
            [
                10473,
                10483
            ],
            [
                10467,
                10472
            ],
            [
                10497,
                10499
            ],
            [
                10505,
                10576
            ],
            [
                10576,
                10617
            ],
            [
                10649,
                10690
            ],
            [
                10723,
                10745
            ],
            [
                10796,
                10847
            ],
            [
                10878,
                10880
            ],
            [
                10870,
                10877
            ],
            [
                10881,
                10919
            ],
            [
                10921,
                10924
            ],
            [
                10926,
                10969
            ],
            [
                10969,
                11016
            ],
            [
                11065,
                11130
            ],
            [
                11160,
                11170
            ],
            [
                11142,
                11155
            ],
            [
                11210,
                11213
            ],
            [
                11213,
                11243
            ],
            [
                11243,
                11270
            ],
            [
                11270,
                11293
            ],
            [
                11293,
                11323
            ],
            [
                11429,
                11456
            ],
            [
                11463,
                11512
            ],
            [
                11512,
                11639
            ],
            [
                11655,
                11684
            ],
            [
                11702,
                11714
            ],
            [
                11718,
                11720
            ],
            [
                11720,
                11774
            ],
            [
                11788,
                11814
            ],
            [
                11823,
                11895
            ],
            [
                11973,
                12015
            ],
            [
                12017,
                12049
            ],
            [
                12091,
                12120
            ],
            [
                12127,
                12139
            ],
            [
                12145,
                12162
            ],
            [
                12177,
                12206
            ],
            [
                12228,
                12282
            ],
            [
                12283,
                12286
            ],
            [
                12288,
                12326
            ],
            [
                12327,
                12330
            ],
            [
                12332,
                12480
            ],
            [
                12481,
                12514
            ],
            [
                12514,
                12520
            ],
            [
                12538,
                12585
            ],
            [
                12594,
                12674
            ],
            [
                12674,
                12681
            ],
            [
                12741,
                12761
            ],
            [
                12778,
                12809
            ],
            [
                12849,
                12855
            ],
            [
                12810,
                12814
            ],
            [
                12705,
                12708
            ],
            [
                13024,
                13026
            ],
            [
                13125,
                13154
            ],
            [
                13162,
                13184
            ],
            [
                13186,
                13190
            ],
            [
                13192,
                13208
            ],
            [
                13257,
                13352
            ],
            [
                13362,
                13421
            ],
            [
                13421,
                13561
            ],
            [
                13569,
                13570
            ],
            [
                13571,
                13686
            ],
            [
                13692,
                13708
            ],
            [
                13737,
                13809
            ],
            [
                13821,
                13875
            ],
            [
                13878,
                13882
            ],
            [
                13904,
                13916
            ],
            [
                13953,
                13963
            ],
            [
                13970,
                14007
            ],
            [
                14007,
                14010
            ],
            [
                14025,
                14062
            ],
            [
                14073,
                14101
            ],
            [
                14206,
                14211
            ],
            [
                14222,
                14268
            ],
            [
                14581,
                14669
            ],
            [
                14676,
                14681
            ],
            [
                14541,
                14542
            ],
            [
                14760,
                14827
            ],
            [
                14827,
                14898
            ],
            [
                14898,
                14918
            ],
            [
                14918,
                14928
            ],
            [
                15016,
                15044
            ],
            [
                15243,
                15268
            ],
            [
                15456,
                15479
            ],
            [
                15502,
                15515
            ],
            [
                15563,
                15584
            ],
            [
                15618,
                15631
            ],
            [
                15645,
                15656
            ],
            [
                15669,
                15702
            ],
            [
                15716,
                15755
            ],
            [
                15757,
                15761
            ],
            [
                15763,
                15774
            ],
            [
                15774,
                15821
            ],
            [
                15841,
                15885
            ],
            [
                15887,
                15891
            ],
            [
                15893,
                15915
            ],
            [
                15919,
                15924
            ],
            [
                15946,
                15979
            ],
            [
                16034,
                16049
            ],
            [
                16057,
                16061
            ],
            [
                16062,
                16068
            ],
            [
                16073,
                16077
            ],
            [
                16107,
                16143
            ],
            [
                16150,
                16152
            ],
            [
                16202,
                16242
            ],
            [
                16242,
                16269
            ],
            [
                16269,
                16286
            ],
            [
                16288,
                16292
            ],
            [
                16294,
                16324
            ],
            [
                16347,
                16349
            ],
            [
                16349,
                16350
            ],
            [
                16354,
                16409
            ],
            [
                16477,
                16479
            ],
            [
                16479,
                16516
            ],
            [
                16555,
                16607
            ],
            [
                16668,
                16684
            ],
            [
                16684,
                16707
            ],
            [
                16707,
                16768
            ],
            [
                16774,
                16829
            ],
            [
                16829,
                16833
            ],
            [
                16835,
                16838
            ],
            [
                16840,
                16895
            ],
            [
                16909,
                17022
            ],
            [
                17028,
                17051
            ],
            [
                17059,
                17063
            ],
            [
                17068,
                17107
            ],
            [
                17107,
                17141
            ]
        ],
        "row_chars": [
            [
                0,
                385
            ],
            [
                385,
                425
            ],
            [
                425,
                442
            ],
            [
                442,
                779
            ],
            [
                779,
                882
            ],
            [
                882,
                1219
            ],
            [
                1219,
                1366
            ],
            [
                1366,
                1751
            ],
            [
                1751,
                2110
            ],
            [
                2110,
                2263
            ],
            [
                2263,
                2463
            ],
            [
                2463,
                2745
            ],
            [
                2745,
                2943
            ],
            [
                2943,
                3121
            ],
            [
                3121,
                3258
            ],
            [
                3258,
                3470
            ],
            [
                3470,
                3657
            ],
            [
                3657,
                3911
            ],
            [
                3911,
                4364
            ],
            [
                4364,
                4636
            ],
            [
                4636,
                4960
            ],
            [
                4960,
                5032
            ],
            [
                5032,
                5109
            ],
            [
                5109,
                5502
            ],
            [
                5502,
                5690
            ],
            [
                5690,
                5745
            ],
            [
                5745,
                5817
            ],
            [
                5817,
                5921
            ],
            [
                5921,
                6039
            ],
            [
                6039,
                6295
            ],
            [
                6295,
                6326
            ],
            [
                6326,
                6351
            ],
            [
                6351,
                6356
            ],
            [
                6356,
                6459
            ],
            [
                6459,
                6486
            ],
            [
                6486,
                6659
            ],
            [
                6659,
                6911
            ],
            [
                6911,
                6958
            ],
            [
                6958,
                7310
            ],
            [
                7310,
                7468
            ],
            [
                7468,
                7641
            ],
            [
                7641,
                7707
            ],
            [
                7707,
                8262
            ],
            [
                8262,
                8555
            ],
            [
                8555,
                8568
            ],
            [
                8568,
                8596
            ],
            [
                8596,
                8699
            ],
            [
                8699,
                8854
            ],
            [
                8854,
                8894
            ],
            [
                8894,
                8982
            ],
            [
                8982,
                9074
            ],
            [
                9074,
                9332
            ],
            [
                9332,
                9365
            ],
            [
                9365,
                9460
            ],
            [
                9460,
                9513
            ],
            [
                9513,
                9556
            ],
            [
                9556,
                9569
            ],
            [
                9569,
                9624
            ],
            [
                9624,
                9678
            ],
            [
                9678,
                9737
            ],
            [
                9737,
                9754
            ],
            [
                9754,
                9814
            ],
            [
                9814,
                9895
            ],
            [
                9895,
                9934
            ],
            [
                9934,
                9943
            ],
            [
                9943,
                10052
            ],
            [
                10052,
                10078
            ],
            [
                10078,
                10115
            ],
            [
                10115,
                10127
            ],
            [
                10127,
                10211
            ],
            [
                10211,
                10385
            ],
            [
                10385,
                10467
            ],
            [
                10467,
                10576
            ],
            [
                10576,
                10745
            ],
            [
                10745,
                10796
            ],
            [
                10796,
                10969
            ],
            [
                10969,
                11213
            ],
            [
                11213,
                11243
            ],
            [
                11243,
                11270
            ],
            [
                11270,
                11293
            ],
            [
                11293,
                11512
            ],
            [
                11512,
                11720
            ],
            [
                11720,
                11973
            ],
            [
                11973,
                12282
            ],
            [
                12282,
                12326
            ],
            [
                12326,
                12481
            ],
            [
                12481,
                12514
            ],
            [
                12514,
                12674
            ],
            [
                12674,
                13026
            ],
            [
                13026,
                13125
            ],
            [
                13125,
                13421
            ],
            [
                13421,
                13571
            ],
            [
                13571,
                13916
            ],
            [
                13916,
                14007
            ],
            [
                14007,
                14268
            ],
            [
                14268,
                14334
            ],
            [
                14334,
                14490
            ],
            [
                14490,
                14827
            ],
            [
                14827,
                14898
            ],
            [
                14898,
                14918
            ],
            [
                14918,
                15044
            ],
            [
                15044,
                15095
            ],
            [
                15095,
                15165
            ],
            [
                15165,
                15243
            ],
            [
                15243,
                15268
            ],
            [
                15268,
                15312
            ],
            [
                15312,
                15436
            ],
            [
                15436,
                15515
            ],
            [
                15515,
                15563
            ],
            [
                15563,
                15584
            ],
            [
                15584,
                15618
            ],
            [
                15618,
                15774
            ],
            [
                15774,
                15915
            ],
            [
                15915,
                15979
            ],
            [
                15979,
                16031
            ],
            [
                16031,
                16152
            ],
            [
                16152,
                16242
            ],
            [
                16242,
                16269
            ],
            [
                16269,
                16349
            ],
            [
                16349,
                16479
            ],
            [
                16479,
                16516
            ],
            [
                16516,
                16684
            ],
            [
                16684,
                16707
            ],
            [
                16707,
                16829
            ],
            [
                16829,
                17107
            ],
            [
                17107,
                17141
            ]
        ]
    },
    "abridged": {
        "text": "Everything was now in train: theatre, actors, actresses, and dresses, were all getting forward; but Fanny found that it was not all uninterrupted enjoyment to the party. Everybody began to have their vexation. Edmund had many. Against his judgment, a scene-painter arrived from town, and was at work, increasing the expenses; and his brother was giving an invitation to every family who came in his way. Tom himself began to fret, and to feel the miseries of waiting. He had learned his part-all his parts, for he took every trifling one that could be united with the Butler, and was impatient to be acting.\nFanny, being a very courteous listener, came in for the complaints of most of them. She knew that Mr. Yates was in general thought to rant dreadfully; that Mr. Yates was disappointed in Henry Crawford; that Tom Bertram spoke too quick; that Mrs. Grant spoiled everything by laughing; that Edmund was behindhand with his part, and that it was misery to have anything to do with Mr. Rushworth, who needed a prompter through every speech. She knew, also, that poor Mr. Rushworth could seldom get anybody to rehearse with him: and so decidedly did her cousin Maria avoid him, and so needlessly often did she rehearse the first scene with Mr. Crawford, that Fanny was soon terrified of other complaints from him.\nSo far from being all satisfied, everybody required something they had not. Everybody had a part either too long or too short; nobody would attend as they ought; nobody would remember on which side they were to come in; nobody but the complainer would observe any directions.\nFanny derived much innocent enjoyment from the play. Henry Crawford acted well, and it was a pleasure to her to creep into the theatre, and attend the rehearsal of the first act, in spite of the feelings it excited in some speeches for Maria. Maria also acted well, too well. Fanny began to be their only audience, sometimes as prompter, sometimes as spectator.\nAs far as she could judge, Mr. Crawford was the best actor of all: he had more confidence than Edmund, more judgment than Tom, more talent and taste than Mr. Yates. She did not like him, but she must admit him to be the best actor. The day came at last, when Mr. Rushworth turned to her with a black look, and said, \"Do you think there is anything so very fine in all this? For the life and soul of me, I cannot admire him. To see such an undersized man set up for a fine actor, is ridiculous in my opinion.\"\nFrom this moment there was a return of his jealousy, which Maria, from increasing hopes of Crawford, was at little pains to remove; and the chances of Mr. Rushworth's ever learning his two-and-forty speeches became much less. As to his ever making anything tolerable of them, nobody had the smallest idea of that; they aspired at nothing beyond his remembering the first line of his speech, and being able to follow the prompter through the rest. Fanny, in her pity and kindheartedness, was at great pains to teach him how to learn, trying to make an artificial memory for him, and learning every word of his part herself, but without his being much the forwarder.\nMany apprehensive feelings she certainly had; but with these claims on her attention, she was far from finding herself without employment. She was occasionally useful to all; she was perhaps as much at peace as any.\nThere was a great deal of needlework to be done, moreover, in which her help was wanted; and Mrs. Norris thought her quite as well off as the rest-\"Come, Fanny,\" she cried, \"these are fine times for you, but you must not be always looking on at your ease; I want you here. I have been slaving till I can hardly stand, to contrive Mr. Rushworth's cloak without sending for more satin; now you may help me in putting it together. There are but three seams; you may do them in a trice. If nobody did more than you, we should not get on very fast.\"\nFanny took the work very quietly, but her kinder aunt Bertram observed-\n\"One cannot wonder, sister, that Fanny should be delighted: it is all new to her, you know; I used to be very fond of a play, and when I am a little more at leisure, I mean to look in at their rehearsals. What is the play about, Fanny? you have never told me.\"\n\"Oh! sister, pray do not ask her now; for Fanny cannot talk and work at the same time. It is about Lovers' Vows.\"\n\"I believe,\" said Fanny to her aunt Bertram, \"there will be three acts rehearsed to-morrow evening, when you may see all the actors.\"\n\"You had better stay till the curtain is hung,\" interposed Mrs. Norris; \"the curtain will be hung in a day or two, and you will find it draws up into very handsome festoons.\"\nLady Bertram seemed quite resigned to waiting. Fanny did not share her aunt's composure: she thought of the morrow a great deal, for if the three acts were rehearsed, Edmund and Miss Crawford would then be acting together for the first time. The third act would bring a scene between them which interested her particularly, and which she was longing and dreading to see how they would perform. The whole subject of it was love-a marriage of love was to be described by the gentleman, and little short of a declaration of love made by the lady.\nShe had read and read the scene again with many painful, wondering emotions. She did not believe they had yet rehearsed it, even in private.\nThe morrow came, and Fanny worked diligently under her aunt's directions, but her diligence concealed a very absent, anxious mind. About noon she made her escape with her work to the East room, to avoid another unnecessary rehearsal of the first act, which Henry Crawford was proposing. She worked and meditated in the East room, undisturbed, for a quarter of an hour, when a gentle tap at the door was followed by the entrance of Miss Crawford.\n\"Am I right? Yes; this is the East room. My dear Miss Price, I beg your pardon, but I have come to entreat your help.\"\nFanny, surprised, answered civilly, and looked at the bars of her empty grate with concern.\n\"Thank you; I am quite warm. Allow me to stay a little while, and have the goodness to hear me my third act. I have brought my book, and if you would but rehearse it with me, I should be so obliged! I came to-day intending to rehearse it with Edmund, but he is not here; and if he were, I do not think I could go through it with him, till I have hardened myself a little; for really there is a speech or two. You will be so good, won't you?\"\nFanny was most civil in her assurances, though she could not give them in a very steady voice.\n\"Have you ever happened to look at the part I mean?\" continued Miss Crawford, opening her book. \"I did not think much of it at first-but, upon my word. There, look at that speech, and that. How am I to look him in the face and say such things? Could you do it? But he is your cousin, which makes all the difference. You must rehearse it with me, that I may fancy you him, and get on by degrees. You have a look of his sometimes.\"\n\"Have I? I will do my best; but I must read the part, for I can say very little of it.\"\n\"None of it, I suppose. We must have two chairs for the front of the stage. There-very good school-room chairs, fitted for little girls to sit and kick their feet against. What would your governess and your uncle say to see them used for such a purpose? If Sir Thomas could see us now, he would bless himself, for we are rehearsing all over the house. Yates is storming away in the dining-room, and the theatre is engaged of course by Agatha and Frederick. By the bye, I looked in upon them five minutes ago, at exactly one of the times when they were trying not to embrace, and Mr. Rushworth was with me. I thought he began to look a little queer, so I whispered to him, 'We shall have an excellent Agatha; there is something so completely maternal in her manner.' Was not that well done of me? He brightened up directly. Now for my soliloquy.\"\nShe began, and Fanny joined in, but with looks and voice so feminine as to be no very good picture of a man. With such an Anhalt, however, Miss Crawford had courage enough; and they had got through half the scene, when a tap at the door, and the entrance of Edmund, suspended it.\nSurprise, consciousness, and pleasure appeared in each on this unexpected meeting. Edmund was come on the very same business that had brought Miss Crawford. He too had his book, and was seeking Fanny to ask her to rehearse with him, without knowing Miss Crawford was in the house. Great was the joy of being thus thrown together, and sympathising in praise of Fanny's kind offices.\nShe could not equal them in their warmth. Her spirits sank under the glow of theirs, and she felt herself becoming too nearly nothing to both to have any comfort in having been sought by either.\nThey must now rehearse together. Edmund entreated it, till the lady, not very unwilling, could refuse no longer, and Fanny was wanted only to prompt and observe them. She was earnestly desired to tell them all their faults; but shrank from the task. To prompt them must be enough; and it was sometimes more than enough; for in watching them she forgot herself; and, agitated by the increasing spirit of Edmund's manner, closed the page and turned away exactly as he wanted help. It was imputed to very reasonable weariness, and she was thanked and pitied; but she deserved their pity more than she hoped they would ever guess.\nAt last the scene was over, and Fanny forced herself to add her praise to the compliments each was giving the other. When again alone, she was inclined to believe their performance would, indeed, have such feeling in it as must ensure their credit, and make it very painful to herself. However, she must bear the brunt of it again that very day.\nThe rehearsal of the three first acts was to take place in the evening; and everyone concerned was looking forward with eagerness. With the exception of Lady Bertram, Mrs. Norris, and Julia, everybody was in the theatre early, waiting only the arrival of Mrs. Grant and the Crawfords to begin.\nThey did not wait long for the Crawfords, but there was no Mrs. Grant. She could not come. Dr. Grant, who was ill, could not spare his wife.\nHere was disappointment! They could not rehearse without her. What was to be done? After a pause, some eyes were turned towards Fanny, and a voice said, \"If Miss Price would be so good as to read the part.\" She was immediately surrounded by supplications; even Edmund said, \"Do, Fanny, if it is not very disagreeable to you.\"\nFanny could not endure the idea of it. Why had not she gone safely to her room, instead of attending the rehearsal? She had known it her duty to keep away. She was properly punished.\n\"You have only to read the part,\" said Henry Crawford.\n\"I do believe she can say every word of it,\" added Maria. \"Fanny, I am sure you know the part.\"\nAs they all persevered, as Edmund repeated his wish, she must yield. She would do her best. Everybody was satisfied; and she was left to the tremors of a palpitating heart, while the others prepared to begin.\nThey did begin; and being too much engaged in their own noise to notice an unusual noise in the other part of the house, had proceeded some way when the door of the room was thrown open. Julia, appearing at it, her face aghast, exclaimed, \"My father is come! He is in the hall at this moment.\"",
        "paragraph_chars": [
            [
                0,
                608
            ],
            [
                608,
                1316
            ],
            [
                1316,
                1592
            ],
            [
                1592,
                1954
            ],
            [
                1954,
                2463
            ],
            [
                2463,
                3128
            ],
            [
                3128,
                3344
            ],
            [
                3344,
                3889
            ],
            [
                3889,
                3961
            ],
            [
                3961,
                4222
            ],
            [
                4222,
                4336
            ],
            [
                4336,
                4470
            ],
            [
                4470,
                4645
            ],
            [
                4645,
                5189
            ],
            [
                5189,
                5330
            ],
            [
                5330,
                5776
            ],
            [
                5776,
                5895
            ],
            [
                5895,
                5987
            ],
            [
                5987,
                6429
            ],
            [
                6429,
                6524
            ],
            [
                6524,
                6954
            ],
            [
                6954,
                7042
            ],
            [
                7042,
                7888
            ],
            [
                7888,
                8168
            ],
            [
                8168,
                8550
            ],
            [
                8550,
                8745
            ],
            [
                8745,
                9372
            ],
            [
                9372,
                9718
            ],
            [
                9718,
                10012
            ],
            [
                10012,
                10153
            ],
            [
                10153,
                10479
            ],
            [
                10479,
                10662
            ],
            [
                10662,
                10717
            ],
            [
                10717,
                10813
            ],
            [
                10813,
                11022
            ],
            [
                11022,
                11315
            ]
        ],
        "segment_chars": [
            [
                0,
                170
            ],
            [
                170,
                210
            ],
            [
                210,
                227
            ],
            [
                227,
                404
            ],
            [
                404,
                468
            ],
            [
                468,
                608
            ],
            [
                608,
                692
            ],
            [
                692,
                1044
            ],
            [
                1044,
                1316
            ],
            [
                1316,
                1392
            ],
            [
                1392,
                1592
            ],
            [
                1592,
                1645
            ],
            [
                1645,
                1835
            ],
            [
                1835,
                1868
            ],
            [
                1868,
                1954
            ],
            [
                1954,
                2119
            ],
            [
                2119,
                2186
            ],
            [
                2186,
                2328
            ],
            [
                2328,
                2378
            ],
            [
                2378,
                2463
            ],
            [
                2463,
                2689
            ],
            [
                2689,
                2910
            ],
            [
                2910,
                3128
            ],
            [
                3128,
                3267
            ],
            [
                3267,
                3344
            ],
            [
                3344,
                3617
            ],
            [
                3617,
                3772
            ],
            [
                3772,
                3827
            ],
            [
                3827,
                3889
            ],
            [
                3889,
                3961
            ],
            [
                3961,
                4166
            ],
            [
                4166,
                4197
            ],
            [
                4197,
                4222
            ],
            [
                4222,
                4227
            ],
            [
                4227,
                4309
            ],
            [
                4309,
                4336
            ],
            [
                4336,
                4470
            ],
            [
                4470,
                4645
            ],
            [
                4645,
                4692
            ],
            [
                4692,
                4887
            ],
            [
                4887,
                5039
            ],
            [
                5039,
                5189
            ],
            [
                5189,
                5266
            ],
            [
                5266,
                5330
            ],
            [
                5330,
                5461
            ],
            [
                5461,
                5617
            ],
            [
                5617,
                5776
            ],
            [
                5776,
                5789
            ],
            [
                5789,
                5817
            ],
            [
                5817,
                5895
            ],
            [
                5895,
                5987
            ],
            [
                5987,
                6016
            ],
            [
                6016,
                6096
            ],
            [
                6096,
                6186
            ],
            [
                6186,
                6396
            ],
            [
                6396,
                6429
            ],
            [
                6429,
                6524
            ],
            [
                6524,
                6577
            ],
            [
                6577,
                6620
            ],
            [
                6620,
                6676
            ],
            [
                6676,
                6714
            ],
            [
                6714,
                6768
            ],
            [
                6768,
                6785
            ],
            [
                6785,
                6840
            ],
            [
                6840,
                6919
            ],
            [
                6919,
                6954
            ],
            [
                6954,
                6963
            ],
            [
                6963,
                7042
            ],
            [
                7042,
                7066
            ],
            [
                7066,
                7118
            ],
            [
                7118,
                7214
            ],
            [
                7214,
                7296
            ],
            [
                7296,
                7394
            ],
            [
                7394,
                7499
            ],
            [
                7499,
                7648
            ],
            [
                7648,
                7808
            ],
            [
                7808,
                7838
            ],
            [
                7838,
                7865
            ],
            [
                7865,
                7888
            ],
            [
                7888,
                7997
            ],
            [
                7997,
                8168
            ],
            [
                8168,
                8251
            ],
            [
                8251,
                8325
            ],
            [
                8325,
                8449
            ],
            [
                8449,
                8550
            ],
            [
                8550,
                8592
            ],
            [
                8592,
                8745
            ],
            [
                8745,
                8778
            ],
            [
                8778,
                8912
            ],
            [
                8912,
                8995
            ],
            [
                8995,
                9224
            ],
            [
                9224,
                9372
            ],
            [
                9372,
                9489
            ],
            [
                9489,
                9658
            ],
            [
                9658,
                9718
            ],
            [
                9718,
                9849
            ],
            [
                9849,
                10012
            ],
            [
                10012,
                10083
            ],
            [
                10083,
                10103
            ],
            [
                10103,
                10153
            ],
            [
                10153,
                10178
            ],
            [
                10178,
                10215
            ],
            [
                10215,
                10236
            ],
            [
                10236,
                10360
            ],
            [
                10360,
                10479
            ],
            [
                10479,
                10518
            ],
            [
                10518,
                10595
            ],
            [
                10595,
                10635
            ],
            [
                10635,
                10662
            ],
            [
                10662,
                10717
            ],
            [
                10717,
                10775
            ],
            [
                10775,
                10813
            ],
            [
                10813,
                10882
            ],
            [
                10882,
                10905
            ],
            [
                10905,
                11022
            ],
            [
                11022,
                11209
            ],
            [
                11209,
                11281
            ],
            [
                11281,
                11315
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                22,
                99
            ],
            [
                100,
                111
            ],
            [
                112,
                168
            ],
            [
                168,
                170
            ],
            [
                170,
                210
            ],
            [
                210,
                227
            ],
            [
                227,
                234
            ],
            [
                235,
                238
            ],
            [
                239,
                300
            ],
            [
                312,
                324
            ],
            [
                324,
                341
            ],
            [
                342,
                404
            ],
            [
                404,
                429
            ],
            [
                429,
                468
            ],
            [
                468,
                579
            ],
            [
                580,
                583
            ],
            [
                584,
                606
            ],
            [
                606,
                608
            ],
            [
                608,
                620
            ],
            [
                621,
                647
            ],
            [
                648,
                674
            ],
            [
                675,
                692
            ],
            [
                692,
                695
            ],
            [
                696,
                832
            ],
            [
                837,
                842
            ],
            [
                842,
                1003
            ],
            [
                1011,
                1044
            ],
            [
                1044,
                1130
            ],
            [
                1131,
                1137
            ],
            [
                1152,
                1168
            ],
            [
                1175,
                1203
            ],
            [
                1208,
                1211
            ],
            [
                1221,
                1236
            ],
            [
                1242,
                1260
            ],
            [
                1267,
                1270
            ],
            [
                1271,
                1275
            ],
            [
                1286,
                1310
            ],
            [
                1311,
                1314
            ],
            [
                1316,
                1347
            ],
            [
                1347,
                1348
            ],
            [
                1349,
                1358
            ],
            [
                1368,
                1390
            ],
            [
                1390,
                1392
            ],
            [
                1392,
                1592
            ],
            [
                1592,
                1597
            ],
            [
                1606,
                1643
            ],
            [
                1645,
                1696
            ],
            [
                1697,
                1700
            ],
            [
                1701,
                1835
            ],
            [
                1835,
                1840
            ],
            [
                1841,
                1845
            ],
            [
                1846,
                1866
            ],
            [
                1866,
                1867
            ],
            [
                1868,
                1905
            ],
            [
                1905,
                1906
            ],
            [
                1907,
                1952
            ],
            [
                1954,
                1997
            ],
            [
                1998,
                2119
            ],
            [
                2119,
                2139
            ],
            [
                2139,
                2184
            ],
            [
                2184,
                2186
            ],
            [
                2186,
                2328
            ],
            [
                2328,
                2376
            ],
            [
                2378,
                2403
            ],
            [
                2404,
                2407
            ],
            [
                2408,
                2435
            ],
            [
                2436,
                2463
            ],
            [
                2463,
                2505
            ],
            [
                2506,
                2634
            ],
            [
                2644,
                2689
            ],
            [
                2689,
                2719
            ],
            [
                2725,
                2729
            ],
            [
                2730,
                2775
            ],
            [
                2775,
                2776
            ],
            [
                2777,
                2781
            ],
            [
                2782,
                2823
            ],
            [
                2824,
                2910
            ],
            [
                2910,
                2994
            ],
            [
                2994,
                3128
            ],
            [
                3128,
                3132
            ],
            [
                3133,
                3182
            ],
            [
                3183,
                3188
            ],
            [
                3189,
                3202
            ],
            [
                3203,
                3221
            ],
            [
                3222,
                3265
            ],
            [
                3265,
                3267
            ],
            [
                3267,
                3344
            ],
            [
                3344,
                3436
            ],
            [
                3437,
                3490
            ],
            [
                3490,
                3574
            ],
            [
                3583,
                3598
            ],
            [
                3598,
                3617
            ],
            [
                3617,
                3636
            ],
            [
                3637,
                3715
            ],
            [
                3716,
                3727
            ],
            [
                3728,
                3731
            ],
            [
                3732,
                3739
            ],
            [
                3740,
                3744
            ],
            [
                3745,
                3747
            ],
            [
                3748,
                3772
            ],
            [
                3772,
                3827
            ],
            [
                3827,
                3850
            ],
            [
                3851,
                3854
            ],
            [
                3854,
                3889
            ],
            [
                3889,
                3922
            ],
            [
                3923,
                3959
            ],
            [
                3959,
                3961
            ],
            [
                3961,
                3999
            ],
            [
                4000,
                4006
            ],
            [
                4007,
                4052
            ],
            [
                4053,
                4085
            ],
            [
                4085,
                4090
            ],
            [
                4096,
                4126
            ],
            [
                4127,
                4128
            ],
            [
                4129,
                4164
            ],
            [
                4164,
                4166
            ],
            [
                4166,
                4197
            ],
            [
                4197,
                4222
            ],
            [
                4222,
                4227
            ],
            [
                4227,
                4269
            ],
            [
                4277,
                4309
            ],
            [
                4309,
                4336
            ],
            [
                4336,
                4435
            ],
            [
                4441,
                4444
            ],
            [
                4453,
                4467
            ],
            [
                4467,
                4470
            ],
            [
                4470,
                4583
            ],
            [
                4585,
                4588
            ],
            [
                4589,
                4592
            ],
            [
                4598,
                4605
            ],
            [
                4612,
                4645
            ],
            [
                4645,
                4692
            ],
            [
                4692,
                4885
            ],
            [
                4887,
                4954
            ],
            [
                4955,
                5039
            ],
            [
                5039,
                5132
            ],
            [
                5133,
                5170
            ],
            [
                5171,
                5189
            ],
            [
                5189,
                5245
            ],
            [
                5246,
                5264
            ],
            [
                5264,
                5266
            ],
            [
                5266,
                5277
            ],
            [
                5286,
                5330
            ],
            [
                5330,
                5346
            ],
            [
                5347,
                5356
            ],
            [
                5357,
                5363
            ],
            [
                5364,
                5421
            ],
            [
                5422,
                5459
            ],
            [
                5459,
                5460
            ],
            [
                5461,
                5523
            ],
            [
                5524,
                5526
            ],
            [
                5533,
                5540
            ],
            [
                5541,
                5605
            ],
            [
                5606,
                5615
            ],
            [
                5615,
                5617
            ],
            [
                5617,
                5776
            ],
            [
                5776,
                5789
            ],
            [
                5789,
                5817
            ],
            [
                5817,
                5866
            ],
            [
                5872,
                5895
            ],
            [
                5895,
                5901
            ],
            [
                5902,
                5912
            ],
            [
                5922,
                5925
            ],
            [
                5929,
                5948
            ],
            [
                5949,
                5987
            ],
            [
                5987,
                6014
            ],
            [
                6014,
                6016
            ],
            [
                6016,
                6032
            ],
            [
                6033,
                6052
            ],
            [
                6053,
                6096
            ],
            [
                6096,
                6173
            ],
            [
                6174,
                6176
            ],
            [
                6177,
                6186
            ],
            [
                6186,
                6192
            ],
            [
                6193,
                6236
            ],
            [
                6236,
                6251
            ],
            [
                6252,
                6256
            ],
            [
                6256,
                6267
            ],
            [
                6268,
                6272
            ],
            [
                6272,
                6315
            ],
            [
                6316,
                6319
            ],
            [
                6319,
                6396
            ],
            [
                6396,
                6429
            ],
            [
                6429,
                6524
            ],
            [
                6524,
                6577
            ],
            [
                6577,
                6620
            ],
            [
                6621,
                6676
            ],
            [
                6676,
                6690
            ],
            [
                6691,
                6695
            ],
            [
                6696,
                6707
            ],
            [
                6708,
                6712
            ],
            [
                6714,
                6722
            ],
            [
                6723,
                6768
            ],
            [
                6768,
                6785
            ],
            [
                6785,
                6788
            ],
            [
                6789,
                6840
            ],
            [
                6840,
                6886
            ],
            [
                6887,
                6890
            ],
            [
                6891,
                6919
            ],
            [
                6919,
                6922
            ],
            [
                6923,
                6927
            ],
            [
                6928,
                6937
            ],
            [
                6938,
                6941
            ],
            [
                6942,
                6954
            ],
            [
                6954,
                6963
            ],
            [
                6963,
                6980
            ],
            [
                6980,
                6992
            ],
            [
                6993,
                6997
            ],
            [
                6998,
                7042
            ],
            [
                7042,
                7043
            ],
            [
                7043,
                7047
            ],
            [
                7048,
                7066
            ],
            [
                7066,
                7089
            ],
            [
                7090,
                7093
            ],
            [
                7094,
                7118
            ],
            [
                7118,
                7153
            ],
            [
                7154,
                7212
            ],
            [
                7212,
                7214
            ],
            [
                7214,
                7296
            ],
            [
                7299,
                7309
            ],
            [
                7310,
                7315
            ],
            [
                7320,
                7322
            ],
            [
                7323,
                7394
            ],
            [
                7394,
                7435
            ],
            [
                7435,
                7476
            ],
            [
                7477,
                7499
            ],
            [
                7499,
                7550
            ],
            [
                7551,
                7553
            ],
            [
                7554,
                7561
            ],
            [
                7562,
                7600
            ],
            [
                7601,
                7604
            ],
            [
                7605,
                7648
            ],
            [
                7648,
                7695
            ],
            [
                7706,
                7771
            ],
            [
                7772,
                7782
            ],
            [
                7792,
                7805
            ],
            [
                7805,
                7808
            ],
            [
                7808,
                7838
            ],
            [
                7838,
                7865
            ],
            [
                7865,
                7888
            ],
            [
                7888,
                7918
            ],
            [
                7920,
                7947
            ],
            [
                7948,
                7997
            ],
            [
                7997,
                8124
            ],
            [
                8124,
                8153
            ],
            [
                8154,
                8166
            ],
            [
                8166,
                8168
            ],
            [
                8168,
                8222
            ],
            [
                8223,
                8249
            ],
            [
                8251,
                8323
            ],
            [
                8325,
                8367
            ],
            [
                8368,
                8400
            ],
            [
                8401,
                8430
            ],
            [
                8435,
                8447
            ],
            [
                8449,
                8466
            ],
            [
                8467,
                8496
            ],
            [
                8496,
                8550
            ],
            [
                8550,
                8553
            ],
            [
                8554,
                8592
            ],
            [
                8592,
                8595
            ],
            [
                8596,
                8744
            ],
            [
                8745,
                8778
            ],
            [
                8778,
                8784
            ],
            [
                8785,
                8832
            ],
            [
                8832,
                8912
            ],
            [
                8912,
                8919
            ],
            [
                8920,
                8940
            ],
            [
                8941,
                8972
            ],
            [
                8973,
                8979
            ],
            [
                8980,
                8984
            ],
            [
                8985,
                8988
            ],
            [
                8993,
                8995
            ],
            [
                8995,
                9024
            ],
            [
                9024,
                9046
            ],
            [
                9047,
                9051
            ],
            [
                9052,
                9068
            ],
            [
                9069,
                9164
            ],
            [
                9165,
                9224
            ],
            [
                9224,
                9364
            ],
            [
                9370,
                9371
            ],
            [
                9372,
                9487
            ],
            [
                9489,
                9505
            ],
            [
                9505,
                9577
            ],
            [
                9578,
                9632
            ],
            [
                9633,
                9637
            ],
            [
                9646,
                9658
            ],
            [
                9665,
                9675
            ],
            [
                9681,
                9718
            ],
            [
                9718,
                9721
            ],
            [
                9722,
                9759
            ],
            [
                9760,
                9788
            ],
            [
                9788,
                9793
            ],
            [
                9803,
                9849
            ],
            [
                9849,
                9937
            ],
            [
                9938,
                9943
            ],
            [
                9943,
                9944
            ],
            [
                9945,
                10012
            ],
            [
                10012,
                10083
            ],
            [
                10083,
                10103
            ],
            [
                10103,
                10113
            ],
            [
                10125,
                10153
            ],
            [
                10153,
                10178
            ],
            [
                10178,
                10201
            ],
            [
                10202,
                10215
            ],
            [
                10215,
                10236
            ],
            [
                10236,
                10249
            ],
            [
                10249,
                10260
            ],
            [
                10266,
                10299
            ],
            [
                10304,
                10343
            ],
            [
                10344,
                10348
            ],
            [
                10349,
                10360
            ],
            [
                10360,
                10407
            ],
            [
                10407,
                10451
            ],
            [
                10452,
                10456
            ],
            [
                10457,
                10479
            ],
            [
                10479,
                10484
            ],
            [
                10485,
                10518
            ],
            [
                10518,
                10533
            ],
            [
                10534,
                10538
            ],
            [
                10546,
                10552
            ],
            [
                10553,
                10557
            ],
            [
                10557,
                10593
            ],
            [
                10593,
                10595
            ],
            [
                10595,
                10635
            ],
            [
                10635,
                10662
            ],
            [
                10662,
                10679
            ],
            [
                10680,
                10684
            ],
            [
                10685,
                10715
            ],
            [
                10715,
                10717
            ],
            [
                10717,
                10718
            ],
            [
                10718,
                10773
            ],
            [
                10773,
                10775
            ],
            [
                10776,
                10813
            ],
            [
                10813,
                10865
            ],
            [
                10866,
                10882
            ],
            [
                10882,
                10905
            ],
            [
                10905,
                10966
            ],
            [
                10967,
                11022
            ],
            [
                11022,
                11026
            ],
            [
                11027,
                11030
            ],
            [
                11031,
                11086
            ],
            [
                11094,
                11207
            ],
            [
                11209,
                11232
            ],
            [
                11237,
                11241
            ],
            [
                11242,
                11281
            ],
            [
                11281,
                11315
            ]
        ],
        "row_chars": [
            [
                0,
                170
            ],
            [
                170,
                210
            ],
            [
                210,
                227
            ],
            [
                227,
                404
            ],
            [
                404,
                468
            ],
            [
                468,
                608
            ],
            [
                608,
                692
            ],
            [
                692,
                1044
            ],
            [
                1044,
                1316
            ],
            [
                1316,
                1392
            ],
            [
                1392,
                1592
            ],
            [
                1592,
                1835
            ],
            [
                1835,
                1954
            ],
            [
                1954,
                2119
            ],
            [
                2119,
                2186
            ],
            [
                2186,
                2328
            ],
            [
                2328,
                2463
            ],
            [
                2463,
                2689
            ],
            [
                2689,
                2910
            ],
            [
                2910,
                3128
            ],
            [
                3128,
                3267
            ],
            [
                3267,
                3267
            ],
            [
                3267,
                3344
            ],
            [
                3344,
                3617
            ],
            [
                3617,
                3772
            ],
            [
                3772,
                3827
            ],
            [
                3827,
                3827
            ],
            [
                3827,
                3889
            ],
            [
                3889,
                3961
            ],
            [
                3961,
                4166
            ],
            [
                4166,
                4197
            ],
            [
                4197,
                4222
            ],
            [
                4222,
                4227
            ],
            [
                4227,
                4309
            ],
            [
                4309,
                4336
            ],
            [
                4336,
                4470
            ],
            [
                4470,
                4645
            ],
            [
                4645,
                4692
            ],
            [
                4692,
                5039
            ],
            [
                5039,
                5189
            ],
            [
                5189,
                5266
            ],
            [
                5266,
                5330
            ],
            [
                5330,
                5617
            ],
            [
                5617,
                5776
            ],
            [
                5776,
                5789
            ],
            [
                5789,
                5817
            ],
            [
                5817,
                5895
            ],
            [
                5895,
                5987
            ],
            [
                5987,
                6016
            ],
            [
                6016,
                6096
            ],
            [
                6096,
                6186
            ],
            [
                6186,
                6396
            ],
            [
                6396,
                6429
            ],
            [
                6429,
                6524
            ],
            [
                6524,
                6577
            ],
            [
                6577,
                6620
            ],
            [
                6620,
                6620
            ],
            [
                6620,
                6676
            ],
            [
                6676,
                6714
            ],
            [
                6714,
                6768
            ],
            [
                6768,
                6785
            ],
            [
                6785,
                6840
            ],
            [
                6840,
                6919
            ],
            [
                6919,
                6954
            ],
            [
                6954,
                6963
            ],
            [
                6963,
                7042
            ],
            [
                7042,
                7066
            ],
            [
                7066,
                7066
            ],
            [
                7066,
                7066
            ],
            [
                7066,
                7118
            ],
            [
                7118,
                7214
            ],
            [
                7214,
                7296
            ],
            [
                7296,
                7394
            ],
            [
                7394,
                7499
            ],
            [
                7499,
                7499
            ],
            [
                7499,
                7648
            ],
            [
                7648,
                7808
            ],
            [
                7808,
                7838
            ],
            [
                7838,
                7865
            ],
            [
                7865,
                7888
            ],
            [
                7888,
                7997
            ],
            [
                7997,
                8168
            ],
            [
                8168,
                8325
            ],
            [
                8325,
                8550
            ],
            [
                8550,
                8592
            ],
            [
                8592,
                8745
            ],
            [
                8745,
                8778
            ],
            [
                8778,
                8912
            ],
            [
                8912,
                8995
            ],
            [
                8995,
                8995
            ],
            [
                8995,
                9224
            ],
            [
                9224,
                9372
            ],
            [
                9372,
                9658
            ],
            [
                9658,
                9718
            ],
            [
                9718,
                9849
            ],
            [
                9849,
                9849
            ],
            [
                9849,
                9849
            ],
            [
                9849,
                10012
            ],
            [
                10012,
                10083
            ],
            [
                10083,
                10103
            ],
            [
                10103,
                10153
            ],
            [
                10153,
                10153
            ],
            [
                10153,
                10153
            ],
            [
                10153,
                10153
            ],
            [
                10153,
                10178
            ],
            [
                10178,
                10178
            ],
            [
                10178,
                10178
            ],
            [
                10178,
                10215
            ],
            [
                10215,
                10215
            ],
            [
                10215,
                10236
            ],
            [
                10236,
                10236
            ],
            [
                10236,
                10360
            ],
            [
                10360,
                10479
            ],
            [
                10479,
                10518
            ],
            [
                10518,
                10518
            ],
            [
                10518,
                10595
            ],
            [
                10595,
                10635
            ],
            [
                10635,
                10662
            ],
            [
                10662,
                10717
            ],
            [
                10717,
                10775
            ],
            [
                10775,
                10813
            ],
            [
                10813,
                10882
            ],
            [
                10882,
                10905
            ],
            [
                10905,
                11022
            ],
            [
                11022,
                11281
            ],
            [
                11281,
                11315
            ]
        ]
    }
}