{
    "original": {
        "text": "Edmund's first object the next morning was to see his father alone, and give him a fair statement of the whole acting scheme, defending his own share in it as far only as he could then, in a soberer moment, feel his motives to deserve, and acknowledging, with perfect ingenuousness, that his concession had been attended with such partial good as to make his judgment in it very doubtful. He was anxious, while vindicating himself, to say nothing unkind of the others: but there was only one amongst them whose conduct he could mention without some necessity of defence or palliation. \"We have all been more or less to blame,\" said he, \"every one of us, excepting Fanny. Fanny is the only one who has judged rightly throughout; who has been consistent. _Her_ feelings have been steadily against it from first to last. She never ceased to think of what was due to you. You will find Fanny everything you could wish.\"\nSir Thomas saw all the impropriety of such a scheme among such a party, and at such a time, as strongly as his son had ever supposed he must; he felt it too much, indeed, for many words; and having shaken hands with Edmund, meant to try to lose the disagreeable impression, and forget how much he had been forgotten himself as soon as he could, after the house had been cleared of every object enforcing the remembrance, and restored to its proper state. He did not enter into any remonstrance with his other children: he was more willing to believe they felt their error than to run the risk of investigation. The reproof of an immediate conclusion of everything, the sweep of every preparation, would be sufficient.\nThere was one person, however, in the house, whom he could not leave to learn his sentiments merely through his conduct. He could not help giving Mrs. Norris a hint of his having hoped that her advice might have been interposed to prevent what her judgment must certainly have disapproved. The young people had been very inconsiderate in forming the plan; they ought to have been capable of a better decision themselves; but they were young; and, excepting Edmund, he believed, of unsteady characters; and with greater surprise, therefore, he must regard her acquiescence in their wrong measures, her countenance of their unsafe amusements, than that such measures and such amusements should have been suggested. Mrs. Norris was a little confounded and as nearly being silenced as ever she had been in her life; for she was ashamed to confess having never seen any of the impropriety which was so glaring to Sir Thomas, and would not have admitted that her influence was insufficient-that she might have talked in vain. Her only resource was to get out of the subject as fast as possible, and turn the current of Sir Thomas's ideas into a happier channel. She had a great deal to insinuate in her own praise as to _general_ attention to the interest and comfort of his family, much exertion and many sacrifices to glance at in the form of hurried walks and sudden removals from her own fireside, and many excellent hints of distrust and economy to Lady Bertram and Edmund to detail, whereby a most considerable saving had always arisen, and more than one bad servant been detected. But her chief strength lay in Sotherton. Her greatest support and glory was in having formed the connexion with the Rushworths. _There_ she was impregnable. She took to herself all the credit of bringing Mr. Rushworth's admiration of Maria to any effect. \"If I had not been active,\" said she, \"and made a point of being introduced to his mother, and then prevailed on my sister to pay the first visit, I am as certain as I sit here that nothing would have come of it; for Mr. Rushworth is the sort of amiable modest young man who wants a great deal of encouragement, and there were girls enough on the catch for him if we had been idle. But I left no stone unturned. I was ready to move heaven and earth to persuade my sister, and at last I did persuade her. You know the distance to Sotherton; it was in the middle of winter, and the roads almost impassable, but I did persuade her.\"\n\"I know how great, how justly great, your influence is with Lady Bertram and her children, and am the more concerned that it should not have been-\"\n\"My dear Sir Thomas, if you had seen the state of the roads _that_ day! I thought we should never have got through them, though we had the four horses of course; and poor old coachman would attend us, out of his great love and kindness, though he was hardly able to sit the box on account of the rheumatism which I had been doctoring him for ever since Michaelmas. I cured him at last; but he was very bad all the winter-and this was such a day, I could not help going to him up in his room before we set off to advise him not to venture: he was putting on his wig; so I said, 'Coachman, you had much better not go; your Lady and I shall be very safe; you know how steady Stephen is, and Charles has been upon the leaders so often now, that I am sure there is no fear.' But, however, I soon found it would not do; he was bent upon going, and as I hate to be worrying and officious, I said no more; but my heart quite ached for him at every jolt, and when we got into the rough lanes about Stoke, where, what with frost and snow upon beds of stones, it was worse than anything you can imagine, I was quite in an agony about him. And then the poor horses too! To see them straining away! You know how I always feel for the horses. And when we got to the bottom of Sandcroft Hill, what do you think I did? You will laugh at me; but I got out and walked up. I did indeed. It might not be saving them much, but it was something, and I could not bear to sit at my ease and be dragged up at the expense of those noble animals. I caught a dreadful cold, but _that_ I did not regard. My object was accomplished in the visit.\"\n\"I hope we shall always think the acquaintance worth any trouble that might be taken to establish it. There is nothing very striking in Mr. Rushworth's manners, but I was pleased last night with what appeared to be his opinion on one subject: his decided preference of a quiet family party to the bustle and confusion of acting. He seemed to feel exactly as one could wish.\"\n\"Yes, indeed, and the more you know of him the better you will like him. He is not a shining character, but he has a thousand good qualities; and is so disposed to look up to you, that I am quite laughed at about it, for everybody considers it as my doing. 'Upon my word, Mrs. Norris,' said Mrs. Grant the other day, 'if Mr. Rushworth were a son of your own, he could not hold Sir Thomas in greater respect.'\"\nSir Thomas gave up the point, foiled by her evasions, disarmed by her flattery; and was obliged to rest satisfied with the conviction that where the present pleasure of those she loved was at stake, her kindness did sometimes overpower her judgment.\nIt was a busy morning with him. Conversation with any of them occupied but a small part of it. He had to reinstate himself in all the wonted concerns of his Mansfield life: to see his steward and his bailiff; to examine and compute, and, in the intervals of business, to walk into his stables and his gardens, and nearest plantations; but active and methodical, he had not only done all this before he resumed his seat as master of the house at dinner, he had also set the carpenter to work in pulling down what had been so lately put up in the billiard-room, and given the scene-painter his dismissal long enough to justify the pleasing belief of his being then at least as far off as Northampton. The scene-painter was gone, having spoilt only the floor of one room, ruined all the coachman's sponges, and made five of the under-servants idle and dissatisfied; and Sir Thomas was in hopes that another day or two would suffice to wipe away every outward memento of what had been, even to the destruction of every unbound copy of Lovers' Vows in the house, for he was burning all that met his eye.\nMr. Yates was beginning now to understand Sir Thomas's intentions, though as far as ever from understanding their source. He and his friend had been out with their guns the chief of the morning, and Tom had taken the opportunity of explaining, with proper apologies for his father's particularity, what was to be expected. Mr. Yates felt it as acutely as might be supposed. To be a second time disappointed in the same way was an instance of very severe ill-luck; and his indignation was such, that had it not been for delicacy towards his friend, and his friend's youngest sister, he believed he should certainly attack the baronet on the absurdity of his proceedings, and argue him into a little more rationality. He believed this very stoutly while he was in Mansfield Wood, and all the way home; but there was a something in Sir Thomas, when they sat round the same table, which made Mr. Yates think it wiser to let him pursue his own way, and feel the folly of it without opposition. He had known many disagreeable fathers before, and often been struck with the inconveniences they occasioned, but never, in the whole course of his life, had he seen one of that class so unintelligibly moral, so infamously tyrannical as Sir Thomas. He was not a man to be endured but for his children's sake, and he might be thankful to his fair daughter Julia that Mr. Yates did yet mean to stay a few days longer under his roof.\nThe evening passed with external smoothness, though almost every mind was ruffled; and the music which Sir Thomas called for from his daughters helped to conceal the want of real harmony. Maria was in a good deal of agitation. It was of the utmost consequence to her that Crawford should now lose no time in declaring himself, and she was disturbed that even a day should be gone by without seeming to advance that point. She had been expecting to see him the whole morning, and all the evening, too, was still expecting him. Mr. Rushworth had set off early with the great news for Sotherton; and she had fondly hoped for such an immediate _eclaircissement_ as might save him the trouble of ever coming back again. But they had seen no one from the Parsonage, not a creature, and had heard no tidings beyond a friendly note of congratulation and inquiry from Mrs. Grant to Lady Bertram. It was the first day for many, many weeks, in which the families had been wholly divided. Four-and-twenty hours had never passed before, since August began, without bringing them together in some way or other. It was a sad, anxious day; and the morrow, though differing in the sort of evil, did by no means bring less. A few moments of feverish enjoyment were followed by hours of acute suffering. Henry Crawford was again in the house: he walked up with Dr. Grant, who was anxious to pay his respects to Sir Thomas, and at rather an early hour they were ushered into the breakfast-room, where were most of the family. Sir Thomas soon appeared, and Maria saw with delight and agitation the introduction of the man she loved to her father. Her sensations were indefinable, and so were they a few minutes afterwards upon hearing Henry Crawford, who had a chair between herself and Tom, ask the latter in an undervoice whether there were any plans for resuming the play after the present happy interruption (with a courteous glance at Sir Thomas), because, in that case, he should make a point of returning to Mansfield at any time required by the party: he was going away immediately, being to meet his uncle at Bath without delay; but if there were any prospect of a renewal of Lovers' Vows, he should hold himself positively engaged, he should break through every other claim, he should absolutely condition with his uncle for attending them whenever he might be wanted. The play should not be lost by _his_ absence.\n\"From Bath, Norfolk, London, York, wherever I may be,\" said he; \"I will attend you from any place in England, at an hour's notice.\"\nIt was well at that moment that Tom had to speak, and not his sister. He could immediately say with easy fluency, \"I am sorry you are going; but as to our play, _that_ is all over-entirely at an end\" (looking significantly at his father). \"The painter was sent off yesterday, and very little will remain of the theatre to-morrow. I knew how _that_ would be from the first. It is early for Bath. You will find nobody there.\"\n\"It is about my uncle's usual time.\"\n\"When do you think of going?\"\n\"I may, perhaps, get as far as Banbury to-day.\"\n\"Whose stables do you use at Bath?\" was the next question; and while this branch of the subject was under discussion, Maria, who wanted neither pride nor resolution, was preparing to encounter her share of it with tolerable calmness.\nTo her he soon turned, repeating much of what he had already said, with only a softened air and stronger expressions of regret. But what availed his expressions or his air? He was going, and, if not voluntarily going, voluntarily intending to stay away; for, excepting what might be due to his uncle, his engagements were all self-imposed. He might talk of necessity, but she knew his independence. The hand which had so pressed hers to his heart! the hand and the heart were alike motionless and passive now! Her spirit supported her, but the agony of her mind was severe. She had not long to endure what arose from listening to language which his actions contradicted, or to bury the tumult of her feelings under the restraint of society; for general civilities soon called his notice from her, and the farewell visit, as it then became openly acknowledged, was a very short one. He was gone-he had touched her hand for the last time, he had made his parting bow, and she might seek directly all that solitude could do for her. Henry Crawford was gone, gone from the house, and within two hours afterwards from the parish; and so ended all the hopes his selfish vanity had raised in Maria and Julia Bertram.\nJulia could rejoice that he was gone. His presence was beginning to be odious to her; and if Maria gained him not, she was now cool enough to dispense with any other revenge. She did not want exposure to be added to desertion. Henry Crawford gone, she could even pity her sister.\nWith a purer spirit did Fanny rejoice in the intelligence. She heard it at dinner, and felt it a blessing. By all the others it was mentioned with regret; and his merits honoured with due gradation of feeling-from the sincerity of Edmund's too partial regard, to the unconcern of his mother speaking entirely by rote. Mrs. Norris began to look about her, and wonder that his falling in love with Julia had come to nothing; and could almost fear that she had been remiss herself in forwarding it; but with so many to care for, how was it possible for even _her_ activity to keep pace with her wishes?\nAnother day or two, and Mr. Yates was gone likewise. In _his_ departure Sir Thomas felt the chief interest: wanting to be alone with his family, the presence of a stranger superior to Mr. Yates must have been irksome; but of him, trifling and confident, idle and expensive, it was every way vexatious. In himself he was wearisome, but as the friend of Tom and the admirer of Julia he became offensive. Sir Thomas had been quite indifferent to Mr. Crawford's going or staying: but his good wishes for Mr. Yates's having a pleasant journey, as he walked with him to the hall-door, were given with genuine satisfaction. Mr. Yates had staid to see the destruction of every theatrical preparation at Mansfield, the removal of everything appertaining to the play: he left the house in all the soberness of its general character; and Sir Thomas hoped, in seeing him out of it, to be rid of the worst object connected with the scheme, and the last that must be inevitably reminding him of its existence.\nMrs. Norris contrived to remove one article from his sight that might have distressed him. The curtain, over which she had presided with such talent and such success, went off with her to her cottage, where she happened to be particularly in want of green baize.",
        "paragraph_chars": [
            [
                0,
                916
            ],
            [
                916,
                1634
            ],
            [
                1634,
                4101
            ],
            [
                4101,
                4249
            ],
            [
                4249,
                5866
            ],
            [
                5866,
                6241
            ],
            [
                6241,
                6651
            ],
            [
                6651,
                6901
            ],
            [
                6901,
                8000
            ],
            [
                8000,
                9420
            ],
            [
                9420,
                11824
            ],
            [
                11824,
                11956
            ],
            [
                11956,
                12380
            ],
            [
                12380,
                12417
            ],
            [
                12417,
                12447
            ],
            [
                12447,
                12495
            ],
            [
                12495,
                12729
            ],
            [
                12729,
                13939
            ],
            [
                13939,
                14219
            ],
            [
                14219,
                14819
            ],
            [
                14819,
                15815
            ],
            [
                15815,
                16077
            ]
        ],
        "segment_chars": [
            [
                0,
                389
            ],
            [
                389,
                585
            ],
            [
                585,
                671
            ],
            [
                671,
                753
            ],
            [
                753,
                818
            ],
            [
                818,
                868
            ],
            [
                868,
                916
            ],
            [
                916,
                1371
            ],
            [
                1371,
                1527
            ],
            [
                1527,
                1634
            ],
            [
                1634,
                1755
            ],
            [
                1755,
                1924
            ],
            [
                1924,
                2347
            ],
            [
                2347,
                2654
            ],
            [
                2654,
                2790
            ],
            [
                2790,
                3216
            ],
            [
                3216,
                3257
            ],
            [
                3257,
                3344
            ],
            [
                3344,
                3373
            ],
            [
                3373,
                3471
            ],
            [
                3471,
                3853
            ],
            [
                3853,
                3883
            ],
            [
                3883,
                3975
            ],
            [
                3975,
                4101
            ],
            [
                4101,
                4249
            ],
            [
                4249,
                4321
            ],
            [
                4321,
                4614
            ],
            [
                4614,
                5019
            ],
            [
                5019,
                5377
            ],
            [
                5377,
                5407
            ],
            [
                5407,
                5435
            ],
            [
                5435,
                5478
            ],
            [
                5478,
                5552
            ],
            [
                5552,
                5603
            ],
            [
                5603,
                5617
            ],
            [
                5617,
                5769
            ],
            [
                5769,
                5824
            ],
            [
                5824,
                5866
            ],
            [
                5866,
                5968
            ],
            [
                5968,
                6195
            ],
            [
                6195,
                6241
            ],
            [
                6241,
                6314
            ],
            [
                6314,
                6498
            ],
            [
                6498,
                6651
            ],
            [
                6651,
                6901
            ],
            [
                6901,
                6933
            ],
            [
                6933,
                6996
            ],
            [
                6996,
                7600
            ],
            [
                7600,
                8000
            ],
            [
                8000,
                8122
            ],
            [
                8122,
                8323
            ],
            [
                8323,
                8374
            ],
            [
                8374,
                8716
            ],
            [
                8716,
                8989
            ],
            [
                8989,
                9238
            ],
            [
                9238,
                9420
            ],
            [
                9420,
                9608
            ],
            [
                9608,
                9647
            ],
            [
                9647,
                9842
            ],
            [
                9842,
                9946
            ],
            [
                9946,
                10135
            ],
            [
                10135,
                10307
            ],
            [
                10307,
                10397
            ],
            [
                10397,
                10517
            ],
            [
                10517,
                10626
            ],
            [
                10626,
                10705
            ],
            [
                10705,
                10926
            ],
            [
                10926,
                11046
            ],
            [
                11046,
                11778
            ],
            [
                11778,
                11824
            ],
            [
                11824,
                11956
            ],
            [
                11956,
                12026
            ],
            [
                12026,
                12195
            ],
            [
                12195,
                12286
            ],
            [
                12286,
                12329
            ],
            [
                12329,
                12351
            ],
            [
                12351,
                12380
            ],
            [
                12380,
                12417
            ],
            [
                12417,
                12447
            ],
            [
                12447,
                12495
            ],
            [
                12495,
                12531
            ],
            [
                12531,
                12729
            ],
            [
                12729,
                12857
            ],
            [
                12857,
                12902
            ],
            [
                12902,
                13069
            ],
            [
                13069,
                13128
            ],
            [
                13128,
                13177
            ],
            [
                13177,
                13239
            ],
            [
                13239,
                13303
            ],
            [
                13303,
                13611
            ],
            [
                13611,
                13759
            ],
            [
                13759,
                13939
            ],
            [
                13939,
                13977
            ],
            [
                13977,
                14114
            ],
            [
                14114,
                14166
            ],
            [
                14166,
                14219
            ],
            [
                14219,
                14278
            ],
            [
                14278,
                14326
            ],
            [
                14326,
                14537
            ],
            [
                14537,
                14819
            ],
            [
                14819,
                14872
            ],
            [
                14872,
                15121
            ],
            [
                15121,
                15221
            ],
            [
                15221,
                15436
            ],
            [
                15436,
                15815
            ],
            [
                15815,
                15906
            ],
            [
                15906,
                16077
            ]
        ],
        "overlap_chars": [
            [
                0,
                179
            ],
            [
                207,
                234
            ],
            [
                387,
                389
            ],
            [
                389,
                403
            ],
            [
                432,
                491
            ],
            [
                505,
                543
            ],
            [
                549,
                569
            ],
            [
                583,
                584
            ],
            [
                585,
                602
            ],
            [
                616,
                637
            ],
            [
                654,
                671
            ],
            [
                671,
                676
            ],
            [
                697,
                726
            ],
            [
                751,
                753
            ],
            [
                754,
                757
            ],
            [
                759,
                818
            ],
            [
                818,
                868
            ],
            [
                868,
                916
            ],
            [
                916,
                953
            ],
            [
                1320,
                1323
            ],
            [
                961,
                967
            ],
            [
                1008,
                1034
            ],
            [
                1040,
                1048
            ],
            [
                1107,
                1139
            ],
            [
                1049,
                1051
            ],
            [
                1140,
                1188
            ],
            [
                1240,
                1250
            ],
            [
                1267,
                1285
            ],
            [
                1341,
                1371
            ],
            [
                1371,
                1381
            ],
            [
                1397,
                1402
            ],
            [
                1410,
                1441
            ],
            [
                1447,
                1487
            ],
            [
                1525,
                1526
            ],
            [
                1634,
                1664
            ],
            [
                1703,
                1705
            ],
            [
                1679,
                1686
            ],
            [
                1753,
                1755
            ],
            [
                1755,
                1757
            ],
            [
                1862,
                1864
            ],
            [
                1780,
                1791
            ],
            [
                1819,
                1823
            ],
            [
                1813,
                1818
            ],
            [
                1835,
                1845
            ],
            [
                1922,
                1924
            ],
            [
                1990,
                2098
            ],
            [
                2112,
                2134
            ],
            [
                2345,
                2346
            ],
            [
                2099,
                2101
            ],
            [
                2189,
                2192
            ],
            [
                2250,
                2273
            ],
            [
                2347,
                2389
            ],
            [
                2397,
                2476
            ],
            [
                2477,
                2552
            ],
            [
                2652,
                2654
            ],
            [
                2654,
                2721
            ],
            [
                2788,
                2790
            ],
            [
                2790,
                2813
            ],
            [
                2824,
                2847
            ],
            [
                3012,
                3015
            ],
            [
                2916,
                2944
            ],
            [
                2884,
                2887
            ],
            [
                3115,
                3126
            ],
            [
                3132,
                3155
            ],
            [
                3163,
                3169
            ],
            [
                3214,
                3215
            ],
            [
                3216,
                3257
            ],
            [
                3257,
                3269
            ],
            [
                3282,
                3344
            ],
            [
                3345,
                3350
            ],
            [
                3352,
                3373
            ],
            [
                3373,
                3381
            ],
            [
                3393,
                3407
            ],
            [
                3469,
                3471
            ],
            [
                3471,
                3513
            ],
            [
                3571,
                3617
            ],
            [
                3653,
                3704
            ],
            [
                3519,
                3520
            ],
            [
                3725,
                3751
            ],
            [
                3768,
                3781
            ],
            [
                3851,
                3853
            ],
            [
                3853,
                3883
            ],
            [
                3883,
                3941
            ],
            [
                3973,
                3975
            ],
            [
                3975,
                4101
            ],
            [
                4101,
                4118
            ],
            [
                4138,
                4246
            ],
            [
                4249,
                4308
            ],
            [
                4310,
                4314
            ],
            [
                4316,
                4321
            ],
            [
                4321,
                4363
            ],
            [
                4368,
                4399
            ],
            [
                4409,
                4449
            ],
            [
                4486,
                4518
            ],
            [
                4527,
                4614
            ],
            [
                4614,
                4669
            ],
            [
                4931,
                4936
            ],
            [
                4818,
                4824
            ],
            [
                4718,
                4724
            ],
            [
                4824,
                4863
            ],
            [
                5016,
                5019
            ],
            [
                5019,
                5022
            ],
            [
                5063,
                5106
            ],
            [
                5120,
                5244
            ],
            [
                5342,
                5377
            ],
            [
                5377,
                5407
            ],
            [
                5435,
                5478
            ],
            [
                5482,
                5552
            ],
            [
                5552,
                5603
            ],
            [
                5603,
                5617
            ],
            [
                5617,
                5769
            ],
            [
                5769,
                5798
            ],
            [
                5800,
                5804
            ],
            [
                5806,
                5824
            ],
            [
                5824,
                5866
            ],
            [
                5866,
                5968
            ],
            [
                5968,
                6060
            ],
            [
                6081,
                6169
            ],
            [
                6184,
                6193
            ],
            [
                6241,
                6253
            ],
            [
                6312,
                6314
            ],
            [
                6314,
                6498
            ],
            [
                6498,
                6651
            ],
            [
                6651,
                6669
            ],
            [
                6679,
                6703
            ],
            [
                6705,
                6749
            ],
            [
                6755,
                6789
            ],
            [
                6850,
                6862
            ],
            [
                6867,
                6876
            ],
            [
                6887,
                6901
            ],
            [
                6901,
                6922
            ],
            [
                6928,
                6933
            ],
            [
                6996,
                7034
            ],
            [
                7042,
                7112
            ],
            [
                7182,
                7193
            ],
            [
                7132,
                7133
            ],
            [
                7202,
                7209
            ],
            [
                7121,
                7124
            ],
            [
                7223,
                7239
            ],
            [
                7137,
                7138
            ],
            [
                7240,
                7299
            ],
            [
                7346,
                7407
            ],
            [
                7142,
                7145
            ],
            [
                7598,
                7600
            ],
            [
                7600,
                7634
            ],
            [
                7642,
                7646
            ],
            [
                7635,
                7641
            ],
            [
                7647,
                7778
            ],
            [
                7792,
                7915
            ],
            [
                7924,
                8000
            ],
            [
                8000,
                8065
            ],
            [
                8120,
                8122
            ],
            [
                8122,
                8168
            ],
            [
                8193,
                8206
            ],
            [
                8298,
                8323
            ],
            [
                8323,
                8340
            ],
            [
                8344,
                8351
            ],
            [
                8372,
                8374
            ],
            [
                8374,
                8426
            ],
            [
                8447,
                8467
            ],
            [
                8499,
                8668
            ],
            [
                8714,
                8715
            ],
            [
                8716,
                8745
            ],
            [
                8782,
                8864
            ],
            [
                8870,
                8942
            ],
            [
                8987,
                8989
            ],
            [
                8989,
                9035
            ],
            [
                9099,
                9108
            ],
            [
                9143,
                9158
            ],
            [
                9173,
                9175
            ],
            [
                9212,
                9238
            ],
            [
                9302,
                9364
            ],
            [
                9378,
                9420
            ],
            [
                9420,
                9471
            ],
            [
                9479,
                9608
            ],
            [
                9608,
                9647
            ],
            [
                9647,
                9791
            ],
            [
                9800,
                9842
            ],
            [
                9842,
                9885
            ],
            [
                9893,
                9898
            ],
            [
                9921,
                9946
            ],
            [
                9946,
                9971
            ],
            [
                9998,
                10059
            ],
            [
                10078,
                10135
            ],
            [
                10135,
                10179
            ],
            [
                10196,
                10243
            ],
            [
                10274,
                10306
            ],
            [
                10517,
                10558
            ],
            [
                10592,
                10596
            ],
            [
                10624,
                10626
            ],
            [
                10626,
                10705
            ],
            [
                10705,
                10772
            ],
            [
                10824,
                10827
            ],
            [
                10852,
                10893
            ],
            [
                10924,
                10925
            ],
            [
                10926,
                10936
            ],
            [
                10942,
                11046
            ],
            [
                11046,
                11148
            ],
            [
                11191,
                11194
            ],
            [
                11186,
                11189
            ],
            [
                11206,
                11273
            ],
            [
                11148,
                11149
            ],
            [
                11352,
                11457
            ],
            [
                11776,
                11777
            ],
            [
                11459,
                11488
            ],
            [
                11496,
                11521
            ],
            [
                11535,
                11620
            ],
            [
                11632,
                11640
            ],
            [
                11182,
                11185
            ],
            [
                11651,
                11682
            ],
            [
                11824,
                11851
            ],
            [
                11857,
                11906
            ],
            [
                11934,
                11956
            ],
            [
                11988,
                11991
            ],
            [
                12068,
                12100
            ],
            [
                12107,
                12115
            ],
            [
                12124,
                12126
            ],
            [
                12145,
                12154
            ],
            [
                12024,
                12025
            ],
            [
                12196,
                12235
            ],
            [
                12241,
                12274
            ],
            [
                12284,
                12286
            ],
            [
                12329,
                12351
            ],
            [
                12351,
                12380
            ],
            [
                12380,
                12386
            ],
            [
                12393,
                12417
            ],
            [
                12417,
                12447
            ],
            [
                12447,
                12495
            ],
            [
                12495,
                12531
            ],
            [
                12531,
                12568
            ],
            [
                12591,
                12660
            ],
            [
                12704,
                12729
            ],
            [
                12729,
                12761
            ],
            [
                12770,
                12857
            ],
            [
                12857,
                12902
            ],
            [
                12902,
                12919
            ],
            [
                12959,
                13069
            ],
            [
                13069,
                13128
            ],
            [
                13128,
                13177
            ],
            [
                13181,
                13189
            ],
            [
                13194,
                13239
            ],
            [
                13239,
                13303
            ],
            [
                13303,
                13319
            ],
            [
                13403,
                13437
            ],
            [
                13468,
                13473
            ],
            [
                13530,
                13548
            ],
            [
                13589,
                13611
            ],
            [
                13611,
                13664
            ],
            [
                13757,
                13759
            ],
            [
                13759,
                13808
            ],
            [
                13816,
                13939
            ],
            [
                13939,
                13977
            ],
            [
                13977,
                14023
            ],
            [
                14112,
                14114
            ],
            [
                14166,
                14219
            ],
            [
                14219,
                14263
            ],
            [
                14276,
                14278
            ],
            [
                14278,
                14326
            ],
            [
                14326,
                14373
            ],
            [
                14537,
                14557
            ],
            [
                14578,
                14640
            ],
            [
                14535,
                14536
            ],
            [
                14819,
                14872
            ],
            [
                15221,
                15307
            ],
            [
                15380,
                15382
            ],
            [
                15319,
                15328
            ],
            [
                15398,
                15436
            ],
            [
                15650,
                15684
            ],
            [
                15585,
                15594
            ],
            [
                15687,
                15737
            ],
            [
                15488,
                15498
            ],
            [
                15738,
                15749
            ],
            [
                15463,
                15466
            ],
            [
                15523,
                15524
            ],
            [
                15750,
                15771
            ],
            [
                15783,
                15815
            ],
            [
                15815,
                15906
            ],
            [
                15906,
                15967
            ],
            [
                15973,
                16077
            ]
        ],
        "row_chars": [
            [
                0,
                389
            ],
            [
                389,
                585
            ],
            [
                585,
                671
            ],
            [
                671,
                753
            ],
            [
                753,
                818
            ],
            [
                818,
                868
            ],
            [
                868,
                916
            ],
            [
                916,
                1371
            ],
            [
                1371,
                1527
            ],
            [
                1527,
                1634
            ],
            [
                1634,
                1755
            ],
            [
                1755,
                1924
            ],
            [
                1924,
                2347
            ],
            [
                2347,
                2654
            ],
            [
                2654,
                2790
            ],
            [
                2790,
                3216
            ],
            [
                3216,
                3257
            ],
            [
                3257,
                3344
            ],
            [
                3344,
                3373
            ],
            [
                3373,
                3471
            ],
            [
                3471,
                3853
            ],
            [
                3853,
                3883
            ],
            [
                3883,
                3975
            ],
            [
                3975,
                4101
            ],
            [
                4101,
                4249
            ],
            [
                4249,
                4321
            ],
            [
                4321,
                4614
            ],
            [
                4614,
                5019
            ],
            [
                5019,
                5377
            ],
            [
                5377,
                5407
            ],
            [
                5407,
                5435
            ],
            [
                5435,
                5478
            ],
            [
                5478,
                5552
            ],
            [
                5552,
                5603
            ],
            [
                5603,
                5617
            ],
            [
                5617,
                5769
            ],
            [
                5769,
                5824
            ],
            [
                5824,
                5866
            ],
            [
                5866,
                5968
            ],
            [
                5968,
                6195
            ],
            [
                6195,
                6241
            ],
            [
                6241,
                6314
            ],
            [
                6314,
                6498
            ],
            [
                6498,
                6651
            ],
            [
                6651,
                6901
            ],
            [
                6901,
                6933
            ],
            [
                6933,
                6996
            ],
            [
                6996,
                7600
            ],
            [
                7600,
                8000
            ],
            [
                8000,
                8122
            ],
            [
                8122,
                8323
            ],
            [
                8323,
                8374
            ],
            [
                8374,
                8716
            ],
            [
                8716,
                8989
            ],
            [
                8989,
                9238
            ],
            [
                9238,
                9420
            ],
            [
                9420,
                9608
            ],
            [
                9608,
                9647
            ],
            [
                9647,
                9842
            ],
            [
                9842,
                9946
            ],
            [
                9946,
                10135
            ],
            [
                10135,
                10307
            ],
            [
                10307,
                10397
            ],
            [
                10397,
                10517
            ],
            [
                10517,
                10626
            ],
            [
                10626,
                10705
            ],
            [
                10705,
                10926
            ],
            [
                10926,
                11046
            ],
            [
                11046,
                11778
            ],
            [
                11778,
                11824
            ],
            [
                11824,
                11956
            ],
            [
                11956,
                12195
            ],
            [
                12195,
                12286
            ],
            [
                12286,
                12329
            ],
            [
                12329,
                12351
            ],
            [
                12351,
                12380
            ],
            [
                12380,
                12417
            ],
            [
                12417,
                12447
            ],
            [
                12447,
                12495
            ],
            [
                12495,
                12531
            ],
            [
                12531,
                12729
            ],
            [
                12729,
                12857
            ],
            [
                12857,
                12902
            ],
            [
                12902,
                13069
            ],
            [
                13069,
                13128
            ],
            [
                13128,
                13177
            ],
            [
                13177,
                13239
            ],
            [
                13239,
                13303
            ],
            [
                13303,
                13611
            ],
            [
                13611,
                13759
            ],
            [
                13759,
                13939
            ],
            [
                13939,
                13977
            ],
            [
                13977,
                14114
            ],
            [
                14114,
                14166
            ],
            [
                14166,
                14219
            ],
            [
                14219,
                14278
            ],
            [
                14278,
                14326
            ],
            [
                14326,
                14819
            ],
            [
                14819,
                14872
            ],
            [
                14872,
                15121
            ],
            [
                15121,
                15221
            ],
            [
                15221,
                15436
            ],
            [
                15436,
                15815
            ],
            [
                15815,
                15906
            ],
            [
                15906,
                16077
            ]
        ]
    },
    "abridged": {
        "text": "Edmund's first object the next morning was to see his father alone, and give him a fair statement of the whole acting scheme, defending his own share in it as far only as he could feel his motives to deserve. He was anxious to say nothing unkind of the others: but there was only one whose conduct he could mention without necessity of defence.\n\"We have all been to blame,\" said he, \"excepting Fanny. Fanny has judged rightly throughout. Her feelings have been steadily against it from first to last. She never ceased to think of what was due to you. You will find Fanny everything you could wish.\"\nSir Thomas saw all the impropriety of the scheme as strongly as his son had supposed. Having shaken hands with Edmund, he meant to try to lose the disagreeable impression as soon as the house had been restored to its proper state. He did not remonstrate with his other children: he was willing to believe they felt their error.\nThere was one person, however, to whom he must speak. He hinted to Mrs. Norris that he hoped she might have advised the young people against the play. They ought to have been capable of a better decision themselves; but they were young; and, excepting Edmund, of unsteady characters. He was greatly surprised at her allowing their unsafe amusements.\nMrs. Norris was a little confounded and as close to being silenced as ever she had been in her life; for she was ashamed to confess to having never seen any of the impropriety which was so glaring to Sir Thomas. Her only resource was to get out of the subject as fast as possible. She had a great deal to say in her own praise as to her exertion and many sacrifices and economies, whereby a considerable saving had arisen.\nBut her chief strength lay in Sotherton. Her greatest glory was in having formed the connexion with the Rushworths. There she was impregnable. She took all the credit. \"If I had not been active,\" said she, \"and prevailed on my sister to pay the first visit, nothing would have come of it; for Mr. Rushworth is a modest young man who wants encouragement. But I left no stone unturned. I was ready to move heaven and earth to persuade my sister. You know the distance to Sotherton; it was in the middle of winter, and the roads almost impassable, but I did persuade her.\"\n\"I know how great your influence is with Lady Bertram and her children, and am the more concerned that it should not have been on the occasion of the play.\"\n\"My dear Sir Thomas, if you had seen the state of the roads that day! I thought we should never have got through, though we had the four horses; and poor old coachman would attend us, though he was hardly able to sit on account of the rheumatism which I had been doctoring him for ever since Michaelmas. I cured him at last; but he was very bad all the winter, and I said to him, 'Coachman, you had much better not go.' But he was bent upon going, and as I hate to be officious, I said no more; but my heart quite ached for him at every jolt, and when we got into the rough lanes about Stoke, I was quite in an agony about him. And then the poor horses too! You know how I always feel for the horses. When we got to the bottom of Sandcroft Hill, what do you think I did? You will laugh at me; but I got out and walked up. I did indeed. It might not be saving them much, but it was something, and I could not bear to sit at my ease and be dragged up at the expense of those noble animals. I caught a dreadful cold, but that I did not regard. My object was accomplished in the visit.\"\n\"I hope we shall always think the acquaintance worth any trouble that might be taken to establish it. There is nothing very striking in Mr. Rushworth's manners, but I was pleased last night with his opinion on one subject: his decided preference of a quiet family party to the bustle of acting.\"\n\"Yes, indeed. He is not a shining character, but he has a thousand good qualities; and is so disposed to look up to you, that I am quite laughed at about it, for everybody considers it as my doing. 'Upon my word, Mrs. Norris,' said Mrs. Grant the other day, 'if Mr. Rushworth were a son of your own, he could not hold Sir Thomas in greater respect.'\"\nSir Thomas gave up, foiled by her evasions and disarmed by her flattery; and was obliged to be satisfied with the conviction that her kindness sometimes overpowered her judgment.\nIt was a busy morning for him. He had to reinstate himself in all the concerns of his Mansfield life: to see his steward and his bailiff; to visit his stables, gardens and plantations; but, active and methodical, he had not only done all this before dinner, he had also set the carpenter to work in pulling down the theatre. The scene-painter was gone, having only spoilt the floor of one room, ruined all the coachman's sponges, and made five of the under-servants idle and dissatisfied; and Sir Thomas hoped that another day or two would suffice to wipe away every outward memento of what had been, even to the destruction of every copy of Lovers' Vows in the house, for he was burning all that met his eye.\nMr. Yates was beginning now to understand Sir Thomas's intentions. He and his friend had been out with their guns, and Tom had explained what was to be expected. Mr. Yates felt it acutely. To be a second time disappointed in the same way was severe ill-luck; and had it not been for delicacy towards his friend, and his friend's youngest sister, he believed he should certainly attack the baronet on the absurdity of his proceedings.\nHe believed this very stoutly all the way home; but there was a something in Sir Thomas, when they sat round the table, which made Mr. Yates think it wiser to let him pursue his own way. He had known many disagreeable fathers before, but never had he seen one so tyrannical as Sir Thomas. He might be thankful to his fair daughter Julia that Mr. Yates meant to stay a few days longer under his roof.\nThe evening passed with external smoothness, though every mind was ruffled; and the music which Sir Thomas called for from his daughters helped to conceal the want of real harmony. Maria was in a good deal of agitation. It was of the utmost consequence to her that Crawford should now lose no time in declaring himself, and she was disturbed that even a day should go by without seeming to advance that point. She had been expecting to see him the whole day, and was still expecting him. Mr. Rushworth had set off for Sotherton; and she had fondly hoped for such an immediate declaration as might save him the trouble of ever coming back again. But they had seen no one from the Parsonage, and had heard no tidings beyond a friendly note from Mrs. Grant to Lady Bertram.\nIt was a sad, anxious day; and the morrow brought more evil for Maria. A few moments of feverish enjoyment were followed by hours of acute suffering. Henry Crawford was again in the house: he walked up with Dr. Grant, and they were ushered into the breakfast-room.\nSir Thomas appeared, and Maria saw with delight and agitation the introduction of the man she loved to her father. Her sensations were indefinable, and so were they a few minutes afterwards upon hearing Henry Crawford ask Tom in an undervoice whether there were any plans for resuming the play, because, in that case, he should make a point of returning to Mansfield at any time required by the party. He was going away immediately to meet his uncle at Bath; but if there were any prospect of a renewal of Lovers' Vows, he should hold himself engaged, and break through every other claim.\n\"From Bath, Norfolk, London, wherever I may be,\" said he; \"I will attend you at an hour's notice.\"\nTom said, \"I am sorry you are going; but our play is entirely at an end. The painter was sent off yesterday, and little will remain of the theatre tomorrow. It is early for Bath. You will find nobody there.\"\n\"It is my uncle's usual time.\"\n\"When do you think of going?\"\n\"I may, perhaps, get as far as Banbury to-day.\"\n\"Whose stables do you use at Bath?\" was the next question; and while this was under discussion, Maria, who wanted neither pride nor resolution, prepared herself with tolerable calmness.\nTo her he soon turned, repeating what he had already said, with only a softened air and stronger expressions of regret. But what availed his expressions or his air? He was going, and intending to stay away; for, excepting what might be due to his uncle, his engagements were all self-imposed. He might talk of necessity, but she knew his independence. The hand which had so pressed hers to his heart! hand and heart were alike motionless and passive now! Her spirit supported her, but the agony of her mind was severe. She had not long to bury the tumult of her feelings; for the farewell visit was a very short one. He was gone-he had touched her hand for the last time. Henry Crawford was gone, gone from the house, and two hours afterwards from the parish; and so ended all the hopes his selfish vanity had raised in Maria and Julia Bertram.\nJulia could rejoice that he was gone. His presence was beginning to be odious to her. Henry Crawford gone, she could even pity her sister.\nWith a purer spirit did Fanny rejoice in the news. She heard it at dinner, and felt it a blessing. By all the others it was mentioned with regret; Mrs. Norris began to wonder that his falling in love with Julia had come to nothing.\nAnother day or two, and Mr. Yates was gone likewise. Sir Thomas had been quite indifferent to Mr. Crawford's going or staying: but his goodbyes to Mr. Yates were given with genuine satisfaction. Sir Thomas hoped, in seeing him out of the house, to be rid of the worst object connected with the theatrical scheme, and now the theatre was dismantled, the last that must be reminding him of its existence.\nMrs. Norris contrived to remove one article from his sight that might have distressed him. The curtain, over which she had presided with such talent and success, went off with her to her cottage, where she happened to be particularly in want of green baize.",
        "paragraph_chars": [
            [
                0,
                345
            ],
            [
                345,
                599
            ],
            [
                599,
                927
            ],
            [
                927,
                1277
            ],
            [
                1277,
                1700
            ],
            [
                1700,
                2270
            ],
            [
                2270,
                2427
            ],
            [
                2427,
                3510
            ],
            [
                3510,
                3806
            ],
            [
                3806,
                4157
            ],
            [
                4157,
                4336
            ],
            [
                4336,
                5046
            ],
            [
                5046,
                5480
            ],
            [
                5480,
                5880
            ],
            [
                5880,
                6651
            ],
            [
                6651,
                6916
            ],
            [
                6916,
                7505
            ],
            [
                7505,
                7604
            ],
            [
                7604,
                7812
            ],
            [
                7812,
                7843
            ],
            [
                7843,
                7873
            ],
            [
                7873,
                7921
            ],
            [
                7921,
                8107
            ],
            [
                8107,
                8952
            ],
            [
                8952,
                9091
            ],
            [
                9091,
                9323
            ],
            [
                9323,
                9726
            ],
            [
                9726,
                9983
            ]
        ],
        "segment_chars": [
            [
                0,
                209
            ],
            [
                209,
                345
            ],
            [
                345,
                401
            ],
            [
                401,
                438
            ],
            [
                438,
                501
            ],
            [
                501,
                551
            ],
            [
                551,
                599
            ],
            [
                599,
                685
            ],
            [
                685,
                830
            ],
            [
                830,
                927
            ],
            [
                927,
                981
            ],
            [
                981,
                1078
            ],
            [
                1078,
                1211
            ],
            [
                1211,
                1277
            ],
            [
                1277,
                1489
            ],
            [
                1489,
                1558
            ],
            [
                1558,
                1700
            ],
            [
                1700,
                1741
            ],
            [
                1741,
                1816
            ],
            [
                1816,
                1843
            ],
            [
                1843,
                1868
            ],
            [
                1868,
                2054
            ],
            [
                2054,
                2084
            ],
            [
                2084,
                2144
            ],
            [
                2144,
                2270
            ],
            [
                2270,
                2427
            ],
            [
                2427,
                2497
            ],
            [
                2497,
                2731
            ],
            [
                2731,
                2847
            ],
            [
                2847,
                3055
            ],
            [
                3055,
                3085
            ],
            [
                3085,
                3128
            ],
            [
                3128,
                3198
            ],
            [
                3198,
                3249
            ],
            [
                3249,
                3263
            ],
            [
                3263,
                3415
            ],
            [
                3415,
                3468
            ],
            [
                3468,
                3510
            ],
            [
                3510,
                3612
            ],
            [
                3612,
                3806
            ],
            [
                3806,
                3820
            ],
            [
                3820,
                4004
            ],
            [
                4004,
                4157
            ],
            [
                4157,
                4336
            ],
            [
                4336,
                4367
            ],
            [
                4367,
                4661
            ],
            [
                4661,
                5046
            ],
            [
                5046,
                5113
            ],
            [
                5113,
                5208
            ],
            [
                5208,
                5235
            ],
            [
                5235,
                5480
            ],
            [
                5480,
                5667
            ],
            [
                5667,
                5769
            ],
            [
                5769,
                5880
            ],
            [
                5880,
                6061
            ],
            [
                6061,
                6100
            ],
            [
                6100,
                6290
            ],
            [
                6290,
                6368
            ],
            [
                6368,
                6525
            ],
            [
                6525,
                6651
            ],
            [
                6651,
                6722
            ],
            [
                6722,
                6801
            ],
            [
                6801,
                6916
            ],
            [
                6916,
                7031
            ],
            [
                7031,
                7318
            ],
            [
                7318,
                7505
            ],
            [
                7505,
                7604
            ],
            [
                7604,
                7677
            ],
            [
                7677,
                7761
            ],
            [
                7761,
                7783
            ],
            [
                7783,
                7812
            ],
            [
                7812,
                7843
            ],
            [
                7843,
                7873
            ],
            [
                7873,
                7921
            ],
            [
                7921,
                7957
            ],
            [
                7957,
                8107
            ],
            [
                8107,
                8227
            ],
            [
                8227,
                8272
            ],
            [
                8272,
                8400
            ],
            [
                8400,
                8459
            ],
            [
                8459,
                8508
            ],
            [
                8508,
                8562
            ],
            [
                8562,
                8626
            ],
            [
                8626,
                8724
            ],
            [
                8724,
                8779
            ],
            [
                8779,
                8952
            ],
            [
                8952,
                8990
            ],
            [
                8990,
                9038
            ],
            [
                9038,
                9091
            ],
            [
                9091,
                9142
            ],
            [
                9142,
                9190
            ],
            [
                9190,
                9323
            ],
            [
                9323,
                9376
            ],
            [
                9376,
                9518
            ],
            [
                9518,
                9726
            ],
            [
                9726,
                9817
            ],
            [
                9817,
                9983
            ]
        ],
        "overlap_chars": [
            [
                0,
                179
            ],
            [
                180,
                207
            ],
            [
                207,
                209
            ],
            [
                209,
                223
            ],
            [
                224,
                283
            ],
            [
                284,
                322
            ],
            [
                323,
                343
            ],
            [
                343,
                344
            ],
            [
                345,
                362
            ],
            [
                363,
                384
            ],
            [
                384,
                401
            ],
            [
                401,
                406
            ],
            [
                407,
                436
            ],
            [
                436,
                438
            ],
            [
                438,
                441
            ],
            [
                442,
                501
            ],
            [
                501,
                551
            ],
            [
                551,
                599
            ],
            [
                599,
                636
            ],
            [
                637,
                640
            ],
            [
                641,
                647
            ],
            [
                648,
                674
            ],
            [
                675,
                683
            ],
            [
                685,
                717
            ],
            [
                718,
                720
            ],
            [
                721,
                769
            ],
            [
                770,
                780
            ],
            [
                781,
                799
            ],
            [
                800,
                830
            ],
            [
                830,
                840
            ],
            [
                841,
                846
            ],
            [
                853,
                884
            ],
            [
                885,
                925
            ],
            [
                925,
                926
            ],
            [
                927,
                957
            ],
            [
                958,
                960
            ],
            [
                961,
                968
            ],
            [
                979,
                981
            ],
            [
                981,
                983
            ],
            [
                991,
                993
            ],
            [
                994,
                1005
            ],
            [
                1006,
                1010
            ],
            [
                1014,
                1019
            ],
            [
                1024,
                1034
            ],
            [
                1076,
                1078
            ],
            [
                1078,
                1186
            ],
            [
                1187,
                1209
            ],
            [
                1209,
                1210
            ],
            [
                1211,
                1213
            ],
            [
                1239,
                1242
            ],
            [
                1252,
                1275
            ],
            [
                1277,
                1319
            ],
            [
                1329,
                1408
            ],
            [
                1412,
                1487
            ],
            [
                1487,
                1489
            ],
            [
                1489,
                1556
            ],
            [
                1556,
                1558
            ],
            [
                1558,
                1581
            ],
            [
                1586,
                1609
            ],
            [
                1610,
                1613
            ],
            [
                1614,
                1642
            ],
            [
                1643,
                1646
            ],
            [
                1656,
                1667
            ],
            [
                1668,
                1691
            ],
            [
                1692,
                1698
            ],
            [
                1698,
                1699
            ],
            [
                1700,
                1741
            ],
            [
                1741,
                1753
            ],
            [
                1754,
                1816
            ],
            [
                1816,
                1821
            ],
            [
                1822,
                1843
            ],
            [
                1843,
                1851
            ],
            [
                1852,
                1866
            ],
            [
                1866,
                1868
            ],
            [
                1868,
                1910
            ],
            [
                1911,
                1957
            ],
            [
                1958,
                2009
            ],
            [
                2010,
                2011
            ],
            [
                2012,
                2038
            ],
            [
                2039,
                2052
            ],
            [
                2052,
                2054
            ],
            [
                2054,
                2084
            ],
            [
                2084,
                2142
            ],
            [
                2142,
                2144
            ],
            [
                2144,
                2270
            ],
            [
                2270,
                2287
            ],
            [
                2288,
                2396
            ],
            [
                2427,
                2486
            ],
            [
                2487,
                2491
            ],
            [
                2492,
                2497
            ],
            [
                2497,
                2539
            ],
            [
                2539,
                2570
            ],
            [
                2570,
                2610
            ],
            [
                2611,
                2643
            ],
            [
                2644,
                2731
            ],
            [
                2731,
                2786
            ],
            [
                2786,
                2791
            ],
            [
                2792,
                2798
            ],
            [
                2799,
                2805
            ],
            [
                2805,
                2844
            ],
            [
                2844,
                2847
            ],
            [
                2847,
                2850
            ],
            [
                2851,
                2894
            ],
            [
                2895,
                3019
            ],
            [
                3020,
                3055
            ],
            [
                3055,
                3085
            ],
            [
                3085,
                3128
            ],
            [
                3128,
                3198
            ],
            [
                3198,
                3249
            ],
            [
                3249,
                3263
            ],
            [
                3263,
                3415
            ],
            [
                3415,
                3444
            ],
            [
                3445,
                3449
            ],
            [
                3450,
                3468
            ],
            [
                3468,
                3510
            ],
            [
                3510,
                3612
            ],
            [
                3612,
                3704
            ],
            [
                3705,
                3793
            ],
            [
                3794,
                3803
            ],
            [
                3806,
                3818
            ],
            [
                3818,
                3820
            ],
            [
                3820,
                4004
            ],
            [
                4004,
                4157
            ],
            [
                4157,
                4175
            ],
            [
                4175,
                4199
            ],
            [
                4204,
                4248
            ],
            [
                4252,
                4286
            ],
            [
                4287,
                4299
            ],
            [
                4300,
                4309
            ],
            [
                4322,
                4336
            ],
            [
                4336,
                4357
            ],
            [
                4362,
                4367
            ],
            [
                4367,
                4405
            ],
            [
                4406,
                4476
            ],
            [
                4483,
                4494
            ],
            [
                4494,
                4495
            ],
            [
                4496,
                4503
            ],
            [
                4504,
                4507
            ],
            [
                4508,
                4524
            ],
            [
                4524,
                4525
            ],
            [
                4526,
                4585
            ],
            [
                4586,
                4647
            ],
            [
                4648,
                4651
            ],
            [
                4659,
                4661
            ],
            [
                4661,
                4695
            ],
            [
                4696,
                4700
            ],
            [
                4701,
                4707
            ],
            [
                4708,
                4839
            ],
            [
                4846,
                4969
            ],
            [
                4970,
                5046
            ],
            [
                5046,
                5111
            ],
            [
                5111,
                5113
            ],
            [
                5113,
                5159
            ],
            [
                5159,
                5172
            ],
            [
                5183,
                5208
            ],
            [
                5208,
                5225
            ],
            [
                5226,
                5233
            ],
            [
                5233,
                5235
            ],
            [
                5235,
                5287
            ],
            [
                5288,
                5308
            ],
            [
                5309,
                5478
            ],
            [
                5478,
                5479
            ],
            [
                5480,
                5509
            ],
            [
                5510,
                5592
            ],
            [
                5593,
                5665
            ],
            [
                5665,
                5667
            ],
            [
                5667,
                5713
            ],
            [
                5714,
                5723
            ],
            [
                5724,
                5739
            ],
            [
                5740,
                5742
            ],
            [
                5743,
                5769
            ],
            [
                5769,
                5831
            ],
            [
                5838,
                5880
            ],
            [
                5880,
                5931
            ],
            [
                5932,
                6061
            ],
            [
                6061,
                6100
            ],
            [
                6100,
                6244
            ],
            [
                6248,
                6290
            ],
            [
                6290,
                6333
            ],
            [
                6337,
                6342
            ],
            [
                6343,
                6368
            ],
            [
                6368,
                6393
            ],
            [
                6394,
                6455
            ],
            [
                6468,
                6525
            ],
            [
                6525,
                6569
            ],
            [
                6570,
                6617
            ],
            [
                6618,
                6650
            ],
            [
                6651,
                6692
            ],
            [
                6706,
                6710
            ],
            [
                6720,
                6722
            ],
            [
                6722,
                6801
            ],
            [
                6801,
                6868
            ],
            [
                6869,
                6872
            ],
            [
                6873,
                6914
            ],
            [
                6914,
                6915
            ],
            [
                6916,
                6926
            ],
            [
                6927,
                7031
            ],
            [
                7031,
                7133
            ],
            [
                7134,
                7137
            ],
            [
                7138,
                7141
            ],
            [
                7142,
                7209
            ],
            [
                7209,
                7210
            ],
            [
                7211,
                7316
            ],
            [
                7316,
                7317
            ],
            [
                7318,
                7347
            ],
            [
                7348,
                7373
            ],
            [
                7373,
                7458
            ],
            [
                7459,
                7467
            ],
            [
                7468,
                7471
            ],
            [
                7472,
                7503
            ],
            [
                7505,
                7532
            ],
            [
                7532,
                7581
            ],
            [
                7582,
                7604
            ],
            [
                7604,
                7607
            ],
            [
                7612,
                7644
            ],
            [
                7645,
                7653
            ],
            [
                7654,
                7656
            ],
            [
                7666,
                7675
            ],
            [
                7675,
                7676
            ],
            [
                7677,
                7716
            ],
            [
                7717,
                7750
            ],
            [
                7759,
                7761
            ],
            [
                7761,
                7783
            ],
            [
                7783,
                7812
            ],
            [
                7812,
                7818
            ],
            [
                7819,
                7843
            ],
            [
                7843,
                7873
            ],
            [
                7873,
                7921
            ],
            [
                7921,
                7957
            ],
            [
                7957,
                7994
            ],
            [
                7995,
                8064
            ],
            [
                8082,
                8107
            ],
            [
                8107,
                8139
            ],
            [
                8140,
                8227
            ],
            [
                8227,
                8272
            ],
            [
                8272,
                8289
            ],
            [
                8290,
                8400
            ],
            [
                8400,
                8459
            ],
            [
                8459,
                8508
            ],
            [
                8508,
                8516
            ],
            [
                8517,
                8562
            ],
            [
                8562,
                8626
            ],
            [
                8626,
                8642
            ],
            [
                8643,
                8677
            ],
            [
                8677,
                8682
            ],
            [
                8683,
                8701
            ],
            [
                8702,
                8724
            ],
            [
                8724,
                8777
            ],
            [
                8777,
                8779
            ],
            [
                8779,
                8828
            ],
            [
                8829,
                8952
            ],
            [
                8952,
                8990
            ],
            [
                8990,
                9036
            ],
            [
                9036,
                9038
            ],
            [
                9038,
                9091
            ],
            [
                9091,
                9135
            ],
            [
                9140,
                9142
            ],
            [
                9142,
                9190
            ],
            [
                9190,
                9237
            ],
            [
                9238,
                9258
            ],
            [
                9259,
                9321
            ],
            [
                9321,
                9322
            ],
            [
                9323,
                9376
            ],
            [
                9376,
                9462
            ],
            [
                9467,
                9469
            ],
            [
                9470,
                9479
            ],
            [
                9480,
                9518
            ],
            [
                9522,
                9556
            ],
            [
                9557,
                9566
            ],
            [
                9566,
                9616
            ],
            [
                9617,
                9627
            ],
            [
                9628,
                9639
            ],
            [
                9644,
                9647
            ],
            [
                9670,
                9671
            ],
            [
                9672,
                9693
            ],
            [
                9694,
                9726
            ],
            [
                9726,
                9817
            ],
            [
                9817,
                9878
            ],
            [
                9879,
                9983
            ]
        ],
        "row_chars": [
            [
                0,
                209
            ],
            [
                209,
                345
            ],
            [
                345,
                401
            ],
            [
                401,
                438
            ],
            [
                438,
                501
            ],
            [
                501,
                551
            ],
            [
                551,
                599
            ],
            [
                599,
                830
            ],
            [
                830,
                927
            ],
            [
                927,
                927
            ],
            [
                927,
                981
            ],
            [
                981,
                1078
            ],
            [
                1078,
                1277
            ],
            [
                1277,
                1489
            ],
            [
                1489,
                1558
            ],
            [
                1558,
                1700
            ],
            [
                1700,
                1741
            ],
            [
                1741,
                1816
            ],
            [
                1816,
                1843
            ],
            [
                1843,
                1868
            ],
            [
                1868,
                2054
            ],
            [
                2054,
                2084
            ],
            [
                2084,
                2144
            ],
            [
                2144,
                2270
            ],
            [
                2270,
                2427
            ],
            [
                2427,
                2497
            ],
            [
                2497,
                2731
            ],
            [
                2731,
                2847
            ],
            [
                2847,
                3055
            ],
            [
                3055,
                3085
            ],
            [
                3085,
                3085
            ],
            [
                3085,
                3128
            ],
            [
                3128,
                3198
            ],
            [
                3198,
                3249
            ],
            [
                3249,
                3263
            ],
            [
                3263,
                3415
            ],
            [
                3415,
                3468
            ],
            [
                3468,
                3510
            ],
            [
                3510,
                3612
            ],
            [
                3612,
                3806
            ],
            [
                3806,
                3806
            ],
            [
                3806,
                3820
            ],
            [
                3820,
                4004
            ],
            [
                4004,
                4157
            ],
            [
                4157,
                4336
            ],
            [
                4336,
                4367
            ],
            [
                4367,
                4367
            ],
            [
                4367,
                4661
            ],
            [
                4661,
                5046
            ],
            [
                5046,
                5113
            ],
            [
                5113,
                5208
            ],
            [
                5208,
                5235
            ],
            [
                5235,
                5480
            ],
            [
                5480,
                5667
            ],
            [
                5667,
                5769
            ],
            [
                5769,
                5880
            ],
            [
                5880,
                6061
            ],
            [
                6061,
                6100
            ],
            [
                6100,
                6290
            ],
            [
                6290,
                6368
            ],
            [
                6368,
                6525
            ],
            [
                6525,
                6651
            ],
            [
                6651,
                6651
            ],
            [
                6651,
                6651
            ],
            [
                6651,
                6722
            ],
            [
                6722,
                6801
            ],
            [
                6801,
                6916
            ],
            [
                6916,
                7031
            ],
            [
                7031,
                7505
            ],
            [
                7505,
                7505
            ],
            [
                7505,
                7604
            ],
            [
                7604,
                7677
            ],
            [
                7677,
                7761
            ],
            [
                7761,
                7761
            ],
            [
                7761,
                7783
            ],
            [
                7783,
                7812
            ],
            [
                7812,
                7843
            ],
            [
                7843,
                7873
            ],
            [
                7873,
                7921
            ],
            [
                7921,
                7957
            ],
            [
                7957,
                8107
            ],
            [
                8107,
                8227
            ],
            [
                8227,
                8272
            ],
            [
                8272,
                8400
            ],
            [
                8400,
                8459
            ],
            [
                8459,
                8508
            ],
            [
                8508,
                8562
            ],
            [
                8562,
                8626
            ],
            [
                8626,
                8724
            ],
            [
                8724,
                8779
            ],
            [
                8779,
                8952
            ],
            [
                8952,
                8990
            ],
            [
                8990,
                9038
            ],
            [
                9038,
                9038
            ],
            [
                9038,
                9091
            ],
            [
                9091,
                9142
            ],
            [
                9142,
                9190
            ],
            [
                9190,
                9323
            ],
            [
                9323,
                9376
            ],
            [
                9376,
                9376
            ],
            [
                9376,
                9376
            ],
            [
                9376,
                9518
            ],
            [
                9518,
                9726
            ],
            [
                9726,
                9817
            ],
            [
                9817,
                9983
            ]
        ]
    }
}