{
    "original": {
        "text": "\"But why should Mrs. Grant ask Fanny?\" said Lady Bertram. \"How came she to think of asking Fanny? Fanny never dines there, you know, in this sort of way. I cannot spare her, and I am sure she does not want to go. Fanny, you do not want to go, do you?\"\n\"If you put such a question to her,\" cried Edmund, preventing his cousin's speaking, \"Fanny will immediately say No; but I am sure, my dear mother, she would like to go; and I can see no reason why she should not.\"\n\"I cannot imagine why Mrs. Grant should think of asking her? She never did before. She used to ask your sisters now and then, but she never asked Fanny.\"\n\"If you cannot do without me, ma'am-\" said Fanny, in a self-denying tone.\n\"But my mother will have my father with her all the evening.\"\n\"To be sure, so I shall.\"\n\"Suppose you take my father's opinion, ma'am.\"\n\"That's well thought of. So I will, Edmund. I will ask Sir Thomas, as soon as he comes in, whether I can do without her.\"\n\"As you please, ma'am, on that head; but I meant my father's opinion as to the _propriety_ of the invitation's being accepted or not; and I think he will consider it a right thing by Mrs. Grant, as well as by Fanny, that being the _first_ invitation it should be accepted.\"\n\"I do not know. We will ask him. But he will be very much surprised that Mrs. Grant should ask Fanny at all.\"\nThere was nothing more to be said, or that could be said to any purpose, till Sir Thomas were present; but the subject involving, as it did, her own evening's comfort for the morrow, was so much uppermost in Lady Bertram's mind, that half an hour afterwards, on his looking in for a minute in his way from his plantation to his dressing-room, she called him back again, when he had almost closed the door, with \"Sir Thomas, stop a moment-I have something to say to you.\"\nHer tone of calm languor, for she never took the trouble of raising her voice, was always heard and attended to; and Sir Thomas came back. Her story began; and Fanny immediately slipped out of the room; for to hear herself the subject of any discussion with her uncle was more than her nerves could bear. She was anxious, she knew-more anxious perhaps than she ought to be-for what was it after all whether she went or staid? but if her uncle were to be a great while considering and deciding, and with very grave looks, and those grave looks directed to her, and at last decide against her, she might not be able to appear properly submissive and indifferent. Her cause, meanwhile, went on well. It began, on Lady Bertram's part, with-\"I have something to tell you that will surprise you. Mrs. Grant has asked Fanny to dinner.\"\n\"Well,\" said Sir Thomas, as if waiting more to accomplish the surprise.\n\"Edmund wants her to go. But how can I spare her?\"\n\"She will be late,\" said Sir Thomas, taking out his watch; \"but what is your difficulty?\"\nEdmund found himself obliged to speak and fill up the blanks in his mother's story. He told the whole; and she had only to add, \"So strange! for Mrs. Grant never used to ask her.\"\n\"But is it not very natural,\" observed Edmund, \"that Mrs. Grant should wish to procure so agreeable a visitor for her sister?\"\n\"Nothing can be more natural,\" said Sir Thomas, after a short deliberation; \"nor, were there no sister in the case, could anything, in my opinion, be more natural. Mrs. Grant's shewing civility to Miss Price, to Lady Bertram's niece, could never want explanation. The only surprise I can feel is, that this should be the _first_ time of its being paid. Fanny was perfectly right in giving only a conditional answer. She appears to feel as she ought. But as I conclude that she must wish to go, since all young people like to be together, I can see no reason why she should be denied the indulgence.\"\n\"But can I do without her, Sir Thomas?\"\n\"Indeed I think you may.\"\n\"She always makes tea, you know, when my sister is not here.\"\n\"Your sister, perhaps, may be prevailed on to spend the day with us, and I shall certainly be at home.\"\n\"Very well, then, Fanny may go, Edmund.\"\nThe good news soon followed her. Edmund knocked at her door in his way to his own.\n\"Well, Fanny, it is all happily settled, and without the smallest hesitation on your uncle's side. He had but one opinion. You are to go.\"\n\"Thank you, I am _so_ glad,\" was Fanny's instinctive reply; though when she had turned from him and shut the door, she could not help feeling, \"And yet why should I be glad? for am I not certain of seeing or hearing something there to pain me?\"\nIn spite of this conviction, however, she was glad. Simple as such an engagement might appear in other eyes, it had novelty and importance in hers, for excepting the day at Sotherton, she had scarcely ever dined out before; and though now going only half a mile, and only to three people, still it was dining out, and all the little interests of preparation were enjoyments in themselves. She had neither sympathy nor assistance from those who ought to have entered into her feelings and directed her taste; for Lady Bertram never thought of being useful to anybody, and Mrs. Norris, when she came on the morrow, in consequence of an early call and invitation from Sir Thomas, was in a very ill humour, and seemed intent only on lessening her niece's pleasure, both present and future, as much as possible.\n\"Upon my word, Fanny, you are in high luck to meet with such attention and indulgence! You ought to be very much obliged to Mrs. Grant for thinking of you, and to your aunt for letting you go, and you ought to look upon it as something extraordinary; for I hope you are aware that there is no real occasion for your going into company in this sort of way, or ever dining out at all; and it is what you must not depend upon ever being repeated. Nor must you be fancying that the invitation is meant as any particular compliment to _you_; the compliment is intended to your uncle and aunt and me. Mrs. Grant thinks it a civility due to _us_ to take a little notice of you, or else it would never have come into her head, and you may be very certain that, if your cousin Julia had been at home, you would not have been asked at all.\"\nMrs. Norris had now so ingeniously done away all Mrs. Grant's part of the favour, that Fanny, who found herself expected to speak, could only say that she was very much obliged to her aunt Bertram for sparing her, and that she was endeavouring to put her aunt's evening work in such a state as to prevent her being missed.\n\"Oh! depend upon it, your aunt can do very well without you, or you would not be allowed to go. _I_ shall be here, so you may be quite easy about your aunt. And I hope you will have a very _agreeable_ day, and find it all mighty _delightful_. But I must observe that five is the very awkwardest of all possible numbers to sit down to table; and I cannot but be surprised that such an _elegant_ lady as Mrs. Grant should not contrive better! And round their enormous great wide table, too, which fills up the room so dreadfully! Had the doctor been contented to take my dining-table when I came away, as anybody in their senses would have done, instead of having that absurd new one of his own, which is wider, literally wider than the dinner-table here, how infinitely better it would have been! and how much more he would have been respected! for people are never respected when they step out of their proper sphere. Remember that, Fanny. Five-only five to be sitting round that table. However, you will have dinner enough on it for ten, I dare say.\"\nMrs. Norris fetched breath, and went on again.\n\"The nonsense and folly of people's stepping out of their rank and trying to appear above themselves, makes me think it right to give _you_ a hint, Fanny, now that you are going into company without any of us; and I do beseech and entreat you not to be putting yourself forward, and talking and giving your opinion as if you were one of your cousins-as if you were dear Mrs. Rushworth or Julia. _That_ will never do, believe me. Remember, wherever you are, you must be the lowest and last; and though Miss Crawford is in a manner at home at the Parsonage, you are not to be taking place of her. And as to coming away at night, you are to stay just as long as Edmund chuses. Leave him to settle _that_.\"\n\"Yes, ma'am, I should not think of anything else.\"\n\"And if it should rain, which I think exceedingly likely, for I never saw it more threatening for a wet evening in my life, you must manage as well as you can, and not be expecting the carriage to be sent for you. I certainly do not go home to-night, and, therefore, the carriage will not be out on my account; so you must make up your mind to what may happen, and take your things accordingly.\"\nHer niece thought it perfectly reasonable. She rated her own claims to comfort as low even as Mrs. Norris could; and when Sir Thomas soon afterwards, just opening the door, said, \"Fanny, at what time would you have the carriage come round?\" she felt a degree of astonishment which made it impossible for her to speak.\n\"My dear Sir Thomas!\" cried Mrs. Norris, red with anger, \"Fanny can walk.\"\n\"Walk!\" repeated Sir Thomas, in a tone of most unanswerable dignity, and coming farther into the room. \"My niece walk to a dinner engagement at this time of the year! Will twenty minutes after four suit you?\"\n\"Yes, sir,\" was Fanny's humble answer, given with the feelings almost of a criminal towards Mrs. Norris; and not bearing to remain with her in what might seem a state of triumph, she followed her uncle out of the room, having staid behind him only long enough to hear these words spoken in angry agitation-\n\"Quite unnecessary! a great deal too kind! But Edmund goes; true, it is upon Edmund's account. I observed he was hoarse on Thursday night.\"\nBut this could not impose on Fanny. She felt that the carriage was for herself, and herself alone: and her uncle's consideration of her, coming immediately after such representations from her aunt, cost her some tears of gratitude when she was alone.\nThe coachman drove round to a minute; another minute brought down the gentleman; and as the lady had, with a most scrupulous fear of being late, been many minutes seated in the drawing-room, Sir Thomas saw them off in as good time as his own correctly punctual habits required.\n\"Now I must look at you, Fanny,\" said Edmund, with the kind smile of an affectionate brother, \"and tell you how I like you; and as well as I can judge by this light, you look very nicely indeed. What have you got on?\"\n\"The new dress that my uncle was so good as to give me on my cousin's marriage. I hope it is not too fine; but I thought I ought to wear it as soon as I could, and that I might not have such another opportunity all the winter. I hope you do not think me too fine.\"\n\"A woman can never be too fine while she is all in white. No, I see no finery about you; nothing but what is perfectly proper. Your gown seems very pretty. I like these glossy spots. Has not Miss Crawford a gown something the same?\"\nIn approaching the Parsonage they passed close by the stable-yard and coach-house.\n\"Heyday!\" said Edmund, \"here's company, here's a carriage! who have they got to meet us?\" And letting down the side-glass to distinguish, \"'Tis Crawford's, Crawford's barouche, I protest! There are his own two men pushing it back into its old quarters. He is here, of course. This is quite a surprise, Fanny. I shall be very glad to see him.\"\nThere was no occasion, there was no time for Fanny to say how very differently she felt; but the idea of having such another to observe her was a great increase of the trepidation with which she performed the very awful ceremony of walking into the drawing-room.\nIn the drawing-room Mr. Crawford certainly was, having been just long enough arrived to be ready for dinner; and the smiles and pleased looks of the three others standing round him, shewed how welcome was his sudden resolution of coming to them for a few days on leaving Bath. A very cordial meeting passed between him and Edmund; and with the exception of Fanny, the pleasure was general; and even to _her_ there might be some advantage in his presence, since every addition to the party must rather forward her favourite indulgence of being suffered to sit silent and unattended to. She was soon aware of this herself; for though she must submit, as her own propriety of mind directed, in spite of her aunt Norris's opinion, to being the principal lady in company, and to all the little distinctions consequent thereon, she found, while they were at table, such a happy flow of conversation prevailing, in which she was not required to take any part-there was so much to be said between the brother and sister about Bath, so much between the two young men about hunting, so much of politics between Mr. Crawford and Dr. Grant, and of everything and all together between Mr. Crawford and Mrs. Grant, as to leave her the fairest prospect of having only to listen in quiet, and of passing a very agreeable day. She could not compliment the newly arrived gentleman, however, with any appearance of interest, in a scheme for extending his stay at Mansfield, and sending for his hunters from Norfolk, which, suggested by Dr. Grant, advised by Edmund, and warmly urged by the two sisters, was soon in possession of his mind, and which he seemed to want to be encouraged even by her to resolve on. Her opinion was sought as to the probable continuance of the open weather, but her answers were as short and indifferent as civility allowed. She could not wish him to stay, and would much rather not have him speak to her.\nHer two absent cousins, especially Maria, were much in her thoughts on seeing him; but no embarrassing remembrance affected _his_ spirits. Here he was again on the same ground where all had passed before, and apparently as willing to stay and be happy without the Miss Bertrams, as if he had never known Mansfield in any other state. She heard them spoken of by him only in a general way, till they were all re-assembled in the drawing-room, when Edmund, being engaged apart in some matter of business with Dr. Grant, which seemed entirely to engross them, and Mrs. Grant occupied at the tea-table, he began talking of them with more particularity to his other sister. With a significant smile, which made Fanny quite hate him, he said, \"So! Rushworth and his fair bride are at Brighton, I understand; happy man!\"\n\"Yes, they have been there about a fortnight, Miss Price, have they not? And Julia is with them.\"\n\"And Mr. Yates, I presume, is not far off.\"\n\"Mr. Yates! Oh! we hear nothing of Mr. Yates. I do not imagine he figures much in the letters to Mansfield Park; do you, Miss Price? I think my friend Julia knows better than to entertain her father with Mr. Yates.\"\n\"Poor Rushworth and his two-and-forty speeches!\" continued Crawford. \"Nobody can ever forget them. Poor fellow! I see him now-his toil and his despair. Well, I am much mistaken if his lovely Maria will ever want him to make two-and-forty speeches to her\"; adding, with a momentary seriousness, \"She is too good for him-much too good.\" And then changing his tone again to one of gentle gallantry, and addressing Fanny, he said, \"You were Mr. Rushworth's best friend. Your kindness and patience can never be forgotten, your indefatigable patience in trying to make it possible for him to learn his part-in trying to give him a brain which nature had denied-to mix up an understanding for him out of the superfluity of your own! _He_ might not have sense enough himself to estimate your kindness, but I may venture to say that it had honour from all the rest of the party.\"\nFanny coloured, and said nothing.\n\"It is as a dream, a pleasant dream!\" he exclaimed, breaking forth again, after a few minutes' musing. \"I shall always look back on our theatricals with exquisite pleasure. There was such an interest, such an animation, such a spirit diffused. Everybody felt it. We were all alive. There was employment, hope, solicitude, bustle, for every hour of the day. Always some little objection, some little doubt, some little anxiety to be got over. I never was happier.\"\nWith silent indignation Fanny repeated to herself, \"Never happier!-never happier than when doing what you must know was not justifiable!-never happier than when behaving so dishonourably and unfeelingly! Oh! what a corrupted mind!\"\n\"We were unlucky, Miss Price,\" he continued, in a lower tone, to avoid the possibility of being heard by Edmund, and not at all aware of her feelings, \"we certainly were very unlucky. Another week, only one other week, would have been enough for us. I think if we had had the disposal of events-if Mansfield Park had had the government of the winds just for a week or two, about the equinox, there would have been a difference. Not that we would have endangered his safety by any tremendous weather-but only by a steady contrary wind, or a calm. I think, Miss Price, we would have indulged ourselves with a week's calm in the Atlantic at that season.\"\nHe seemed determined to be answered; and Fanny, averting her face, said, with a firmer tone than usual, \"As far as _I_ am concerned, sir, I would not have delayed his return for a day. My uncle disapproved it all so entirely when he did arrive, that in my opinion everything had gone quite far enough.\"\nShe had never spoken so much at once to him in her life before, and never so angrily to any one; and when her speech was over, she trembled and blushed at her own daring. He was surprised; but after a few moments' silent consideration of her, replied in a calmer, graver tone, and as if the candid result of conviction, \"I believe you are right. It was more pleasant than prudent. We were getting too noisy.\" And then turning the conversation, he would have engaged her on some other subject, but her answers were so shy and reluctant that he could not advance in any.\nMiss Crawford, who had been repeatedly eyeing Dr. Grant and Edmund, now observed, \"Those gentlemen must have some very interesting point to discuss.\"\n\"The most interesting in the world,\" replied her brother-\"how to make money; how to turn a good income into a better. Dr. Grant is giving Bertram instructions about the living he is to step into so soon. I find he takes orders in a few weeks. They were at it in the dining-parlour. I am glad to hear Bertram will be so well off. He will have a very pretty income to make ducks and drakes with, and earned without much trouble. I apprehend he will not have less than seven hundred a year. Seven hundred a year is a fine thing for a younger brother; and as of course he will still live at home, it will be all for his _menus_ _plaisirs_; and a sermon at Christmas and Easter, I suppose, will be the sum total of sacrifice.\"\nHis sister tried to laugh off her feelings by saying, \"Nothing amuses me more than the easy manner with which everybody settles the abundance of those who have a great deal less than themselves. You would look rather blank, Henry, if your _menus_ _plaisirs_ were to be limited to seven hundred a year.\"\n\"Perhaps I might; but all _that_ you know is entirely comparative. Birthright and habit must settle the business. Bertram is certainly well off for a cadet of even a baronet's family. By the time he is four or five and twenty he will have seven hundred a year, and nothing to do for it.\"\nMiss Crawford _could_ have said that there would be a something to do and to suffer for it, which she could not think lightly of; but she checked herself and let it pass; and tried to look calm and unconcerned when the two gentlemen shortly afterwards joined them.\n\"Bertram,\" said Henry Crawford, \"I shall make a point of coming to Mansfield to hear you preach your first sermon. I shall come on purpose to encourage a young beginner. When is it to be? Miss Price, will not you join me in encouraging your cousin? Will not you engage to attend with your eyes steadily fixed on him the whole time-as I shall do-not to lose a word; or only looking off just to note down any sentence preeminently beautiful? We will provide ourselves with tablets and a pencil. When will it be? You must preach at Mansfield, you know, that Sir Thomas and Lady Bertram may hear you.\"\n\"I shall keep clear of you, Crawford, as long as I can,\" said Edmund; \"for you would be more likely to disconcert me, and I should be more sorry to see you trying at it than almost any other man.\"\n\"Will he not feel this?\" thought Fanny. \"No, he can feel nothing as he ought.\"\nThe party being now all united, and the chief talkers attracting each other, she remained in tranquillity; and as a whist-table was formed after tea-formed really for the amusement of Dr. Grant, by his attentive wife, though it was not to be supposed so-and Miss Crawford took her harp, she had nothing to do but to listen; and her tranquillity remained undisturbed the rest of the evening, except when Mr. Crawford now and then addressed to her a question or observation, which she could not avoid answering. Miss Crawford was too much vexed by what had passed to be in a humour for anything but music. With that she soothed herself and amused her friend.\nThe assurance of Edmund's being so soon to take orders, coming upon her like a blow that had been suspended, and still hoped uncertain and at a distance, was felt with resentment and mortification. She was very angry with him. She had thought her influence more. She _had_ begun to think of him; she felt that she had, with great regard, with almost decided intentions; but she would now meet him with his own cool feelings. It was plain that he could have no serious views, no true attachment, by fixing himself in a situation which he must know she would never stoop to. She would learn to match him in his indifference. She would henceforth admit his attentions without any idea beyond immediate amusement. If _he_ could so command his affections, _hers_ should do her no harm.",
        "paragraph_chars": [
            [
                0,
                252
            ],
            [
                252,
                467
            ],
            [
                467,
                621
            ],
            [
                621,
                695
            ],
            [
                695,
                757
            ],
            [
                757,
                783
            ],
            [
                783,
                830
            ],
            [
                830,
                952
            ],
            [
                952,
                1226
            ],
            [
                1226,
                1336
            ],
            [
                1336,
                1807
            ],
            [
                1807,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2759
            ],
            [
                2759,
                2849
            ],
            [
                2849,
                3029
            ],
            [
                3029,
                3156
            ],
            [
                3156,
                3756
            ],
            [
                3756,
                3796
            ],
            [
                3796,
                3822
            ],
            [
                3822,
                3884
            ],
            [
                3884,
                3988
            ],
            [
                3988,
                4029
            ],
            [
                4029,
                4112
            ],
            [
                4112,
                4251
            ],
            [
                4251,
                4496
            ],
            [
                4496,
                5303
            ],
            [
                5303,
                6134
            ],
            [
                6134,
                6457
            ],
            [
                6457,
                7509
            ],
            [
                7509,
                7556
            ],
            [
                7556,
                8259
            ],
            [
                8259,
                8310
            ],
            [
                8310,
                8706
            ],
            [
                8706,
                9024
            ],
            [
                9024,
                9099
            ],
            [
                9099,
                9308
            ],
            [
                9308,
                9615
            ],
            [
                9615,
                9755
            ],
            [
                9755,
                10006
            ],
            [
                10006,
                10284
            ],
            [
                10284,
                10502
            ],
            [
                10502,
                10767
            ],
            [
                10767,
                11000
            ],
            [
                11000,
                11083
            ],
            [
                11083,
                11426
            ],
            [
                11426,
                11689
            ],
            [
                11689,
                13604
            ],
            [
                13604,
                14418
            ],
            [
                14418,
                14516
            ],
            [
                14516,
                14560
            ],
            [
                14560,
                14776
            ],
            [
                14776,
                15647
            ],
            [
                15647,
                15681
            ],
            [
                15681,
                16145
            ],
            [
                16145,
                16377
            ],
            [
                16377,
                17029
            ],
            [
                17029,
                17332
            ],
            [
                17332,
                17901
            ],
            [
                17901,
                18051
            ],
            [
                18051,
                18773
            ],
            [
                18773,
                19076
            ],
            [
                19076,
                19364
            ],
            [
                19364,
                19629
            ],
            [
                19629,
                20227
            ],
            [
                20227,
                20424
            ],
            [
                20424,
                20503
            ],
            [
                20503,
                21160
            ],
            [
                21160,
                21940
            ]
        ],
        "segment_chars": [
            [
                0,
                39
            ],
            [
                39,
                58
            ],
            [
                58,
                98
            ],
            [
                98,
                154
            ],
            [
                154,
                213
            ],
            [
                213,
                252
            ],
            [
                252,
                467
            ],
            [
                467,
                528
            ],
            [
                528,
                550
            ],
            [
                550,
                621
            ],
            [
                621,
                695
            ],
            [
                695,
                757
            ],
            [
                757,
                783
            ],
            [
                783,
                830
            ],
            [
                830,
                855
            ],
            [
                855,
                874
            ],
            [
                874,
                952
            ],
            [
                952,
                1226
            ],
            [
                1226,
                1242
            ],
            [
                1242,
                1259
            ],
            [
                1259,
                1336
            ],
            [
                1336,
                1807
            ],
            [
                1807,
                1946
            ],
            [
                1946,
                2112
            ],
            [
                2112,
                2233
            ],
            [
                2233,
                2468
            ],
            [
                2468,
                2504
            ],
            [
                2504,
                2597
            ],
            [
                2597,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2733
            ],
            [
                2733,
                2759
            ],
            [
                2759,
                2849
            ],
            [
                2849,
                2933
            ],
            [
                2933,
                2990
            ],
            [
                2990,
                3029
            ],
            [
                3029,
                3156
            ],
            [
                3156,
                3320
            ],
            [
                3320,
                3420
            ],
            [
                3420,
                3509
            ],
            [
                3509,
                3572
            ],
            [
                3572,
                3606
            ],
            [
                3606,
                3756
            ],
            [
                3756,
                3796
            ],
            [
                3796,
                3822
            ],
            [
                3822,
                3884
            ],
            [
                3884,
                3988
            ],
            [
                3988,
                4029
            ],
            [
                4029,
                4062
            ],
            [
                4062,
                4112
            ],
            [
                4112,
                4211
            ],
            [
                4211,
                4235
            ],
            [
                4235,
                4251
            ],
            [
                4251,
                4425
            ],
            [
                4425,
                4496
            ],
            [
                4496,
                4548
            ],
            [
                4548,
                4885
            ],
            [
                4885,
                5303
            ],
            [
                5303,
                5390
            ],
            [
                5390,
                5747
            ],
            [
                5747,
                5898
            ],
            [
                5898,
                6134
            ],
            [
                6134,
                6457
            ],
            [
                6457,
                6462
            ],
            [
                6462,
                6553
            ],
            [
                6553,
                6614
            ],
            [
                6614,
                6700
            ],
            [
                6700,
                6898
            ],
            [
                6898,
                6985
            ],
            [
                6985,
                7253
            ],
            [
                7253,
                7301
            ],
            [
                7301,
                7375
            ],
            [
                7375,
                7397
            ],
            [
                7397,
                7444
            ],
            [
                7444,
                7509
            ],
            [
                7509,
                7556
            ],
            [
                7556,
                7951
            ],
            [
                7951,
                7985
            ],
            [
                7985,
                8151
            ],
            [
                8151,
                8230
            ],
            [
                8230,
                8259
            ],
            [
                8259,
                8310
            ],
            [
                8310,
                8524
            ],
            [
                8524,
                8706
            ],
            [
                8706,
                8749
            ],
            [
                8749,
                8947
            ],
            [
                8947,
                9024
            ],
            [
                9024,
                9046
            ],
            [
                9046,
                9099
            ],
            [
                9099,
                9107
            ],
            [
                9107,
                9202
            ],
            [
                9202,
                9266
            ],
            [
                9266,
                9308
            ],
            [
                9308,
                9615
            ],
            [
                9615,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9658,
                9710
            ],
            [
                9710,
                9755
            ],
            [
                9755,
                9791
            ],
            [
                9791,
                10006
            ],
            [
                10006,
                10284
            ],
            [
                10284,
                10479
            ],
            [
                10479,
                10502
            ],
            [
                10502,
                10582
            ],
            [
                10582,
                10729
            ],
            [
                10729,
                10767
            ],
            [
                10767,
                10825
            ],
            [
                10825,
                10894
            ],
            [
                10894,
                10923
            ],
            [
                10923,
                10950
            ],
            [
                10950,
                11000
            ],
            [
                11000,
                11083
            ],
            [
                11083,
                11093
            ],
            [
                11093,
                11142
            ],
            [
                11142,
                11173
            ],
            [
                11173,
                11271
            ],
            [
                11271,
                11336
            ],
            [
                11336,
                11359
            ],
            [
                11359,
                11392
            ],
            [
                11392,
                11426
            ],
            [
                11426,
                11689
            ],
            [
                11689,
                11966
            ],
            [
                11966,
                12274
            ],
            [
                12274,
                12999
            ],
            [
                12999,
                13381
            ],
            [
                13381,
                13523
            ],
            [
                13523,
                13604
            ],
            [
                13604,
                13743
            ],
            [
                13743,
                13938
            ],
            [
                13938,
                14273
            ],
            [
                14273,
                14346
            ],
            [
                14346,
                14418
            ],
            [
                14418,
                14491
            ],
            [
                14491,
                14516
            ],
            [
                14516,
                14560
            ],
            [
                14560,
                14572
            ],
            [
                14572,
                14576
            ],
            [
                14576,
                14606
            ],
            [
                14606,
                14693
            ],
            [
                14693,
                14776
            ],
            [
                14776,
                14825
            ],
            [
                14825,
                14845
            ],
            [
                14845,
                14875
            ],
            [
                14875,
                14888
            ],
            [
                14888,
                14928
            ],
            [
                14928,
                15111
            ],
            [
                15111,
                15242
            ],
            [
                15242,
                15502
            ],
            [
                15502,
                15647
            ],
            [
                15647,
                15681
            ],
            [
                15681,
                15719
            ],
            [
                15719,
                15784
            ],
            [
                15784,
                15854
            ],
            [
                15854,
                15925
            ],
            [
                15925,
                15944
            ],
            [
                15944,
                15963
            ],
            [
                15963,
                16038
            ],
            [
                16038,
                16123
            ],
            [
                16123,
                16145
            ],
            [
                16145,
                16349
            ],
            [
                16349,
                16353
            ],
            [
                16353,
                16377
            ],
            [
                16377,
                16561
            ],
            [
                16561,
                16627
            ],
            [
                16627,
                16805
            ],
            [
                16805,
                16923
            ],
            [
                16923,
                17029
            ],
            [
                17029,
                17214
            ],
            [
                17214,
                17332
            ],
            [
                17332,
                17503
            ],
            [
                17503,
                17678
            ],
            [
                17678,
                17713
            ],
            [
                17713,
                17741
            ],
            [
                17741,
                17901
            ],
            [
                17901,
                18051
            ],
            [
                18051,
                18169
            ],
            [
                18169,
                18255
            ],
            [
                18255,
                18294
            ],
            [
                18294,
                18333
            ],
            [
                18333,
                18380
            ],
            [
                18380,
                18478
            ],
            [
                18478,
                18539
            ],
            [
                18539,
                18773
            ],
            [
                18773,
                18968
            ],
            [
                18968,
                19076
            ],
            [
                19076,
                19143
            ],
            [
                19143,
                19190
            ],
            [
                19190,
                19260
            ],
            [
                19260,
                19364
            ],
            [
                19364,
                19629
            ],
            [
                19629,
                19744
            ],
            [
                19744,
                19799
            ],
            [
                19799,
                19817
            ],
            [
                19817,
                19878
            ],
            [
                19878,
                20069
            ],
            [
                20069,
                20122
            ],
            [
                20122,
                20139
            ],
            [
                20139,
                20227
            ],
            [
                20227,
                20424
            ],
            [
                20424,
                20449
            ],
            [
                20449,
                20464
            ],
            [
                20464,
                20503
            ],
            [
                20503,
                21013
            ],
            [
                21013,
                21107
            ],
            [
                21107,
                21160
            ],
            [
                21160,
                21358
            ],
            [
                21358,
                21387
            ],
            [
                21387,
                21423
            ],
            [
                21423,
                21585
            ],
            [
                21585,
                21733
            ],
            [
                21733,
                21783
            ],
            [
                21783,
                21870
            ],
            [
                21870,
                21940
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                39,
                58
            ],
            [
                98,
                121
            ],
            [
                152,
                154
            ],
            [
                154,
                213
            ],
            [
                213,
                252
            ],
            [
                252,
                259
            ],
            [
                283,
                301
            ],
            [
                335,
                420
            ],
            [
                464,
                467
            ],
            [
                467,
                468
            ],
            [
                485,
                488
            ],
            [
                500,
                506
            ],
            [
                489,
                499
            ],
            [
                507,
                528
            ],
            [
                528,
                548
            ],
            [
                621,
                695
            ],
            [
                783,
                830
            ],
            [
                855,
                874
            ],
            [
                874,
                952
            ],
            [
                952,
                973
            ],
            [
                987,
                1030
            ],
            [
                1038,
                1041
            ],
            [
                1043,
                1077
            ],
            [
                1084,
                1114
            ],
            [
                978,
                982
            ],
            [
                1202,
                1214
            ],
            [
                1223,
                1226
            ],
            [
                1226,
                1242
            ],
            [
                1259,
                1336
            ],
            [
                1570,
                1597
            ],
            [
                1414,
                1424
            ],
            [
                1492,
                1494
            ],
            [
                1602,
                1625
            ],
            [
                1369,
                1370
            ],
            [
                1544,
                1556
            ],
            [
                1683,
                1698
            ],
            [
                1747,
                1797
            ],
            [
                1804,
                1807
            ],
            [
                1807,
                1831
            ],
            [
                1886,
                1896
            ],
            [
                1907,
                1946
            ],
            [
                1946,
                2112
            ],
            [
                2112,
                2119
            ],
            [
                2138,
                2225
            ],
            [
                2231,
                2233
            ],
            [
                2233,
                2286
            ],
            [
                2305,
                2309
            ],
            [
                2315,
                2326
            ],
            [
                2365,
                2450
            ],
            [
                2466,
                2467
            ],
            [
                2468,
                2504
            ],
            [
                2522,
                2529
            ],
            [
                2507,
                2513
            ],
            [
                2544,
                2597
            ],
            [
                2597,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2733
            ],
            [
                2733,
                2759
            ],
            [
                2759,
                2760
            ],
            [
                2823,
                2849
            ],
            [
                2849,
                2886
            ],
            [
                2931,
                2933
            ],
            [
                2933,
                2959
            ],
            [
                2975,
                2990
            ],
            [
                2990,
                3029
            ],
            [
                3029,
                3156
            ],
            [
                3156,
                3202
            ],
            [
                3318,
                3320
            ],
            [
                3320,
                3332
            ],
            [
                3341,
                3349
            ],
            [
                3365,
                3388
            ],
            [
                3390,
                3420
            ],
            [
                3420,
                3437
            ],
            [
                3449,
                3476
            ],
            [
                3478,
                3483
            ],
            [
                3485,
                3509
            ],
            [
                3509,
                3544
            ],
            [
                3550,
                3572
            ],
            [
                3606,
                3738
            ],
            [
                3753,
                3756
            ],
            [
                3756,
                3793
            ],
            [
                3823,
                3884
            ],
            [
                3884,
                3929
            ],
            [
                3944,
                3964
            ],
            [
                3975,
                3988
            ],
            [
                3988,
                4018
            ],
            [
                4026,
                4029
            ],
            [
                4029,
                4062
            ],
            [
                4062,
                4088
            ],
            [
                4110,
                4112
            ],
            [
                4112,
                4151
            ],
            [
                4209,
                4211
            ],
            [
                4235,
                4251
            ],
            [
                4251,
                4267
            ],
            [
                4269,
                4271
            ],
            [
                4273,
                4330
            ],
            [
                4351,
                4395
            ],
            [
                4399,
                4425
            ],
            [
                4425,
                4448
            ],
            [
                4459,
                4496
            ],
            [
                4496,
                4512
            ],
            [
                4523,
                4548
            ],
            [
                4548,
                4557
            ],
            [
                4658,
                4661
            ],
            [
                4566,
                4647
            ],
            [
                4680,
                4730
            ],
            [
                4735,
                4828
            ],
            [
                4854,
                4885
            ],
            [
                4885,
                4892
            ],
            [
                4914,
                4953
            ],
            [
                4984,
                5108
            ],
            [
                5173,
                5198
            ],
            [
                5210,
                5255
            ],
            [
                5301,
                5303
            ],
            [
                5303,
                5345
            ],
            [
                5388,
                5390
            ],
            [
                5390,
                5494
            ],
            [
                5552,
                5557
            ],
            [
                5584,
                5595
            ],
            [
                5601,
                5645
            ],
            [
                5654,
                5684
            ],
            [
                5745,
                5747
            ],
            [
                5763,
                5768
            ],
            [
                5772,
                5807
            ],
            [
                5819,
                5832
            ],
            [
                5756,
                5759
            ],
            [
                5838,
                5898
            ],
            [
                5898,
                5936
            ],
            [
                5938,
                5940
            ],
            [
                6020,
                6134
            ],
            [
                6134,
                6226
            ],
            [
                6265,
                6346
            ],
            [
                6455,
                6457
            ],
            [
                6457,
                6462
            ],
            [
                6478,
                6553
            ],
            [
                6554,
                6555
            ],
            [
                6557,
                6596
            ],
            [
                6612,
                6614
            ],
            [
                6614,
                6633
            ],
            [
                6667,
                6685
            ],
            [
                6700,
                6803
            ],
            [
                6818,
                6827
            ],
            [
                6859,
                6869
            ],
            [
                6896,
                6898
            ],
            [
                6898,
                6985
            ],
            [
                6985,
                7012
            ],
            [
                7015,
                7055
            ],
            [
                7099,
                7150
            ],
            [
                7211,
                7253
            ],
            [
                7402,
                7444
            ],
            [
                7444,
                7509
            ],
            [
                7509,
                7556
            ],
            [
                7556,
                7557
            ],
            [
                7770,
                7771
            ],
            [
                7685,
                7689
            ],
            [
                7691,
                7694
            ],
            [
                7696,
                7746
            ],
            [
                7764,
                7765
            ],
            [
                7772,
                7774
            ],
            [
                7799,
                7802
            ],
            [
                7806,
                7846
            ],
            [
                7871,
                7951
            ],
            [
                7952,
                7956
            ],
            [
                7958,
                7971
            ],
            [
                7983,
                7985
            ],
            [
                7985,
                8044
            ],
            [
                8149,
                8151
            ],
            [
                8151,
                8154
            ],
            [
                8183,
                8221
            ],
            [
                8228,
                8230
            ],
            [
                8230,
                8249
            ],
            [
                8251,
                8255
            ],
            [
                8256,
                8259
            ],
            [
                8259,
                8270
            ],
            [
                8307,
                8310
            ],
            [
                8310,
                8366
            ],
            [
                8432,
                8522
            ],
            [
                8706,
                8749
            ],
            [
                8749,
                8791
            ],
            [
                8797,
                8838
            ],
            [
                8854,
                8947
            ],
            [
                8947,
                8955
            ],
            [
                9022,
                9024
            ],
            [
                9024,
                9046
            ],
            [
                9046,
                9099
            ],
            [
                9099,
                9107
            ],
            [
                9107,
                9166
            ],
            [
                9200,
                9202
            ],
            [
                9202,
                9266
            ],
            [
                9266,
                9308
            ],
            [
                9308,
                9370
            ],
            [
                9378,
                9416
            ],
            [
                9487,
                9526
            ],
            [
                9576,
                9615
            ],
            [
                9615,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9658,
                9674
            ],
            [
                9681,
                9708
            ],
            [
                9833,
                9834
            ],
            [
                9890,
                9891
            ],
            [
                9795,
                9833
            ],
            [
                9852,
                9883
            ],
            [
                9953,
                10006
            ],
            [
                10006,
                10030
            ],
            [
                10085,
                10090
            ],
            [
                10197,
                10211
            ],
            [
                10217,
                10223
            ],
            [
                10227,
                10236
            ],
            [
                10282,
                10284
            ],
            [
                10284,
                10352
            ],
            [
                10369,
                10479
            ],
            [
                10479,
                10502
            ],
            [
                10502,
                10530
            ],
            [
                10554,
                10582
            ],
            [
                10613,
                10641
            ],
            [
                10660,
                10661
            ],
            [
                10642,
                10644
            ],
            [
                10671,
                10687
            ],
            [
                10693,
                10716
            ],
            [
                10721,
                10729
            ],
            [
                10729,
                10767
            ],
            [
                10767,
                10825
            ],
            [
                10894,
                10923
            ],
            [
                10923,
                10950
            ],
            [
                10950,
                11000
            ],
            [
                11000,
                11065
            ],
            [
                11081,
                11083
            ],
            [
                11083,
                11093
            ],
            [
                11093,
                11113
            ],
            [
                11130,
                11142
            ],
            [
                11142,
                11170
            ],
            [
                11239,
                11258
            ],
            [
                11269,
                11271
            ],
            [
                11271,
                11284
            ],
            [
                11293,
                11296
            ],
            [
                11334,
                11336
            ],
            [
                11359,
                11392
            ],
            [
                11392,
                11426
            ],
            [
                11426,
                11447
            ],
            [
                11467,
                11487
            ],
            [
                11493,
                11565
            ],
            [
                11570,
                11634
            ],
            [
                11640,
                11689
            ],
            [
                11689,
                11735
            ],
            [
                11796,
                11812
            ],
            [
                11831,
                11870
            ],
            [
                11878,
                11966
            ],
            [
                11966,
                12077
            ],
            [
                12130,
                12142
            ],
            [
                12244,
                12274
            ],
            [
                12314,
                12336
            ],
            [
                12416,
                12454
            ],
            [
                12509,
                12547
            ],
            [
                12553,
                12581
            ],
            [
                12594,
                12640
            ],
            [
                12792,
                12793
            ],
            [
                12641,
                12669
            ],
            [
                12701,
                12712
            ],
            [
                12690,
                12693
            ],
            [
                12753,
                12761
            ],
            [
                12803,
                12806
            ],
            [
                12773,
                12781
            ],
            [
                12454,
                12459
            ],
            [
                12825,
                12835
            ],
            [
                12888,
                12998
            ],
            [
                12999,
                13012
            ],
            [
                13051,
                13061
            ],
            [
                13067,
                13070
            ],
            [
                13085,
                13093
            ],
            [
                13095,
                13097
            ],
            [
                13024,
                13027
            ],
            [
                13042,
                13051
            ],
            [
                13100,
                13192
            ],
            [
                13247,
                13255
            ],
            [
                13256,
                13259
            ],
            [
                13271,
                13276
            ],
            [
                13282,
                13312
            ],
            [
                13313,
                13336
            ],
            [
                13354,
                13358
            ],
            [
                13379,
                13381
            ],
            [
                13460,
                13471
            ],
            [
                13407,
                13409
            ],
            [
                13472,
                13523
            ],
            [
                13523,
                13526
            ],
            [
                13559,
                13604
            ],
            [
                13604,
                13671
            ],
            [
                13685,
                13727
            ],
            [
                13729,
                13732
            ],
            [
                13734,
                13743
            ],
            [
                13748,
                13754
            ],
            [
                13813,
                13938
            ],
            [
                13960,
                13962
            ],
            [
                13948,
                13952
            ],
            [
                13970,
                14050
            ],
            [
                14203,
                14227
            ],
            [
                14144,
                14146
            ],
            [
                14271,
                14273
            ],
            [
                14273,
                14346
            ],
            [
                14346,
                14418
            ],
            [
                14418,
                14444
            ],
            [
                14451,
                14462
            ],
            [
                14495,
                14516
            ],
            [
                14516,
                14560
            ],
            [
                14572,
                14576
            ],
            [
                14576,
                14606
            ],
            [
                14606,
                14693
            ],
            [
                14693,
                14700
            ],
            [
                14711,
                14776
            ],
            [
                14776,
                14825
            ],
            [
                14825,
                14845
            ],
            [
                14845,
                14875
            ],
            [
                14928,
                15111
            ],
            [
                15115,
                15128
            ],
            [
                15138,
                15146
            ],
            [
                15154,
                15242
            ],
            [
                15242,
                15268
            ],
            [
                15331,
                15333
            ],
            [
                15355,
                15358
            ],
            [
                15269,
                15291
            ],
            [
                15503,
                15505
            ],
            [
                15507,
                15545
            ],
            [
                15555,
                15573
            ],
            [
                15600,
                15647
            ],
            [
                15647,
                15681
            ],
            [
                15681,
                15719
            ],
            [
                15719,
                15731
            ],
            [
                15753,
                15784
            ],
            [
                15784,
                15854
            ],
            [
                15854,
                15899
            ],
            [
                15923,
                15925
            ],
            [
                15944,
                15963
            ],
            [
                15963,
                15989
            ],
            [
                16001,
                16038
            ],
            [
                16123,
                16145
            ],
            [
                16145,
                16197
            ],
            [
                16282,
                16349
            ],
            [
                16349,
                16353
            ],
            [
                16353,
                16377
            ],
            [
                16377,
                16438
            ],
            [
                16494,
                16526
            ],
            [
                16559,
                16561
            ],
            [
                16561,
                16573
            ],
            [
                16596,
                16627
            ],
            [
                16672,
                16749
            ],
            [
                16769,
                16805
            ],
            [
                16805,
                16879
            ],
            [
                16923,
                17011
            ],
            [
                17026,
                17029
            ],
            [
                17070,
                17134
            ],
            [
                17167,
                17212
            ],
            [
                17160,
                17165
            ],
            [
                17212,
                17214
            ],
            [
                17214,
                17332
            ],
            [
                17332,
                17375
            ],
            [
                17388,
                17432
            ],
            [
                17459,
                17471
            ],
            [
                17484,
                17503
            ],
            [
                17503,
                17608
            ],
            [
                17652,
                17678
            ],
            [
                17678,
                17713
            ],
            [
                17713,
                17741
            ],
            [
                17776,
                17901
            ],
            [
                17901,
                18051
            ],
            [
                18051,
                18126
            ],
            [
                18167,
                18169
            ],
            [
                18169,
                18245
            ],
            [
                18249,
                18255
            ],
            [
                18262,
                18294
            ],
            [
                18380,
                18413
            ],
            [
                18443,
                18444
            ],
            [
                18449,
                18476
            ],
            [
                18517,
                18539
            ],
            [
                18560,
                18662
            ],
            [
                18685,
                18773
            ],
            [
                18773,
                18968
            ],
            [
                18968,
                19011
            ],
            [
                19031,
                19076
            ],
            [
                19076,
                19084
            ],
            [
                19092,
                19097
            ],
            [
                19190,
                19234
            ],
            [
                19240,
                19260
            ],
            [
                19260,
                19277
            ],
            [
                19286,
                19364
            ],
            [
                19364,
                19377
            ],
            [
                19379,
                19384
            ],
            [
                19386,
                19433
            ],
            [
                19448,
                19501
            ],
            [
                19522,
                19552
            ],
            [
                19562,
                19596
            ],
            [
                19616,
                19629
            ],
            [
                19629,
                19744
            ],
            [
                19799,
                19817
            ],
            [
                19817,
                19849
            ],
            [
                19876,
                19878
            ],
            [
                19878,
                19890
            ],
            [
                19913,
                19931
            ],
            [
                19938,
                19974
            ],
            [
                19997,
                20009
            ],
            [
                20027,
                20031
            ],
            [
                20019,
                20026
            ],
            [
                20032,
                20048
            ],
            [
                20048,
                20069
            ],
            [
                20069,
                20122
            ],
            [
                20122,
                20137
            ],
            [
                20227,
                20311
            ],
            [
                20330,
                20424
            ],
            [
                20424,
                20449
            ],
            [
                20449,
                20464
            ],
            [
                20464,
                20503
            ],
            [
                20503,
                20522
            ],
            [
                20527,
                20651
            ],
            [
                20666,
                20697
            ],
            [
                20757,
                20825
            ],
            [
                20831,
                20959
            ],
            [
                20974,
                21012
            ],
            [
                21013,
                21045
            ],
            [
                21065,
                21107
            ],
            [
                21177,
                21214
            ],
            [
                21249,
                21252
            ],
            [
                21223,
                21243
            ],
            [
                21279,
                21284
            ],
            [
                21273,
                21278
            ],
            [
                21285,
                21294
            ],
            [
                21267,
                21272
            ],
            [
                21318,
                21322
            ],
            [
                21328,
                21358
            ],
            [
                21358,
                21387
            ],
            [
                21387,
                21423
            ],
            [
                21470,
                21477
            ],
            [
                21433,
                21454
            ],
            [
                21479,
                21585
            ],
            [
                21585,
                21616
            ],
            [
                21635,
                21733
            ],
            [
                21733,
                21781
            ],
            [
                21787,
                21848
            ],
            [
                21849,
                21869
            ]
        ],
        "row_chars": [
            [
                0,
                39
            ],
            [
                39,
                58
            ],
            [
                58,
                98
            ],
            [
                98,
                154
            ],
            [
                154,
                213
            ],
            [
                213,
                252
            ],
            [
                252,
                467
            ],
            [
                467,
                528
            ],
            [
                528,
                550
            ],
            [
                550,
                621
            ],
            [
                621,
                695
            ],
            [
                695,
                757
            ],
            [
                757,
                783
            ],
            [
                783,
                830
            ],
            [
                830,
                855
            ],
            [
                855,
                874
            ],
            [
                874,
                952
            ],
            [
                952,
                1226
            ],
            [
                1226,
                1242
            ],
            [
                1242,
                1259
            ],
            [
                1259,
                1336
            ],
            [
                1336,
                1807
            ],
            [
                1807,
                1946
            ],
            [
                1946,
                2112
            ],
            [
                2112,
                2233
            ],
            [
                2233,
                2468
            ],
            [
                2468,
                2504
            ],
            [
                2504,
                2597
            ],
            [
                2597,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2733
            ],
            [
                2733,
                2759
            ],
            [
                2759,
                2849
            ],
            [
                2849,
                2933
            ],
            [
                2933,
                2990
            ],
            [
                2990,
                3029
            ],
            [
                3029,
                3156
            ],
            [
                3156,
                3320
            ],
            [
                3320,
                3420
            ],
            [
                3420,
                3509
            ],
            [
                3509,
                3572
            ],
            [
                3572,
                3606
            ],
            [
                3606,
                3756
            ],
            [
                3756,
                3796
            ],
            [
                3796,
                3822
            ],
            [
                3822,
                3884
            ],
            [
                3884,
                3988
            ],
            [
                3988,
                4029
            ],
            [
                4029,
                4062
            ],
            [
                4062,
                4112
            ],
            [
                4112,
                4211
            ],
            [
                4211,
                4235
            ],
            [
                4235,
                4251
            ],
            [
                4251,
                4425
            ],
            [
                4425,
                4496
            ],
            [
                4496,
                4548
            ],
            [
                4548,
                4885
            ],
            [
                4885,
                5303
            ],
            [
                5303,
                5390
            ],
            [
                5390,
                5747
            ],
            [
                5747,
                5898
            ],
            [
                5898,
                6134
            ],
            [
                6134,
                6457
            ],
            [
                6457,
                6462
            ],
            [
                6462,
                6553
            ],
            [
                6553,
                6614
            ],
            [
                6614,
                6700
            ],
            [
                6700,
                6898
            ],
            [
                6898,
                6985
            ],
            [
                6985,
                7253
            ],
            [
                7253,
                7301
            ],
            [
                7301,
                7375
            ],
            [
                7375,
                7397
            ],
            [
                7397,
                7444
            ],
            [
                7444,
                7509
            ],
            [
                7509,
                7556
            ],
            [
                7556,
                7951
            ],
            [
                7951,
                7985
            ],
            [
                7985,
                8151
            ],
            [
                8151,
                8230
            ],
            [
                8230,
                8259
            ],
            [
                8259,
                8310
            ],
            [
                8310,
                8524
            ],
            [
                8524,
                8706
            ],
            [
                8706,
                8749
            ],
            [
                8749,
                8947
            ],
            [
                8947,
                9024
            ],
            [
                9024,
                9046
            ],
            [
                9046,
                9099
            ],
            [
                9099,
                9107
            ],
            [
                9107,
                9202
            ],
            [
                9202,
                9266
            ],
            [
                9266,
                9308
            ],
            [
                9308,
                9615
            ],
            [
                9615,
                9635
            ],
            [
                9635,
                9658
            ],
            [
                9658,
                9710
            ],
            [
                9710,
                9755
            ],
            [
                9755,
                9791
            ],
            [
                9791,
                10006
            ],
            [
                10006,
                10284
            ],
            [
                10284,
                10479
            ],
            [
                10479,
                10502
            ],
            [
                10502,
                10582
            ],
            [
                10582,
                10729
            ],
            [
                10729,
                10767
            ],
            [
                10767,
                10825
            ],
            [
                10825,
                10894
            ],
            [
                10894,
                10923
            ],
            [
                10923,
                10950
            ],
            [
                10950,
                11000
            ],
            [
                11000,
                11083
            ],
            [
                11083,
                11093
            ],
            [
                11093,
                11142
            ],
            [
                11142,
                11173
            ],
            [
                11173,
                11271
            ],
            [
                11271,
                11336
            ],
            [
                11336,
                11359
            ],
            [
                11359,
                11392
            ],
            [
                11392,
                11426
            ],
            [
                11426,
                11689
            ],
            [
                11689,
                11966
            ],
            [
                11966,
                12274
            ],
            [
                12274,
                12999
            ],
            [
                12999,
                13381
            ],
            [
                13381,
                13523
            ],
            [
                13523,
                13604
            ],
            [
                13604,
                13743
            ],
            [
                13743,
                13938
            ],
            [
                13938,
                14273
            ],
            [
                14273,
                14346
            ],
            [
                14346,
                14418
            ],
            [
                14418,
                14491
            ],
            [
                14491,
                14516
            ],
            [
                14516,
                14560
            ],
            [
                14560,
                14572
            ],
            [
                14572,
                14576
            ],
            [
                14576,
                14606
            ],
            [
                14606,
                14693
            ],
            [
                14693,
                14776
            ],
            [
                14776,
                14825
            ],
            [
                14825,
                14845
            ],
            [
                14845,
                14875
            ],
            [
                14875,
                14888
            ],
            [
                14888,
                14928
            ],
            [
                14928,
                15111
            ],
            [
                15111,
                15242
            ],
            [
                15242,
                15502
            ],
            [
                15502,
                15647
            ],
            [
                15647,
                15681
            ],
            [
                15681,
                15719
            ],
            [
                15719,
                15784
            ],
            [
                15784,
                15854
            ],
            [
                15854,
                15925
            ],
            [
                15925,
                15944
            ],
            [
                15944,
                15963
            ],
            [
                15963,
                16038
            ],
            [
                16038,
                16123
            ],
            [
                16123,
                16145
            ],
            [
                16145,
                16349
            ],
            [
                16349,
                16353
            ],
            [
                16353,
                16377
            ],
            [
                16377,
                16561
            ],
            [
                16561,
                16627
            ],
            [
                16627,
                16805
            ],
            [
                16805,
                17029
            ],
            [
                17029,
                17214
            ],
            [
                17214,
                17332
            ],
            [
                17332,
                17503
            ],
            [
                17503,
                17678
            ],
            [
                17678,
                17713
            ],
            [
                17713,
                17741
            ],
            [
                17741,
                17901
            ],
            [
                17901,
                18051
            ],
            [
                18051,
                18169
            ],
            [
                18169,
                18255
            ],
            [
                18255,
                18294
            ],
            [
                18294,
                18333
            ],
            [
                18333,
                18380
            ],
            [
                18380,
                18539
            ],
            [
                18539,
                18773
            ],
            [
                18773,
                18968
            ],
            [
                18968,
                19076
            ],
            [
                19076,
                19260
            ],
            [
                19260,
                19364
            ],
            [
                19364,
                19629
            ],
            [
                19629,
                19744
            ],
            [
                19744,
                19799
            ],
            [
                19799,
                19817
            ],
            [
                19817,
                19878
            ],
            [
                19878,
                20069
            ],
            [
                20069,
                20122
            ],
            [
                20122,
                20139
            ],
            [
                20139,
                20227
            ],
            [
                20227,
                20424
            ],
            [
                20424,
                20449
            ],
            [
                20449,
                20464
            ],
            [
                20464,
                20503
            ],
            [
                20503,
                21013
            ],
            [
                21013,
                21107
            ],
            [
                21107,
                21160
            ],
            [
                21160,
                21358
            ],
            [
                21358,
                21387
            ],
            [
                21387,
                21423
            ],
            [
                21423,
                21585
            ],
            [
                21585,
                21733
            ],
            [
                21733,
                21870
            ],
            [
                21870,
                21940
            ]
        ]
    },
    "abridged": {
        "text": "\"But why should Mrs. Grant ask Fanny?\" said Lady Bertram. \"Fanny never dines there. I cannot spare her, and I am sure she does not want to go. Fanny, you do not want to go, do you?\"\n\"If you ask her,\" cried Edmund, \"Fanny will immediately say No; but I am sure, my dear mother, she would like to go.\"\n\"Why should Mrs. Grant think of asking her? She never did before.\"\n\"If you cannot do without me, ma'am-\" said Fanny, in a self-denying tone.\n\"Suppose you take my father's opinion, ma'am.\"\n\"So I will, Edmund. I will ask Sir Thomas, as soon as he comes in, whether I can do without her.\"\n\"As you please, ma'am; but I meant my father's opinion as to the propriety of the invitation's being accepted; and I think he will consider that it should be.\"\n\"I do not know. But he will be very much surprised that Mrs. Grant should ask Fanny at all.\"\nHalf an hour afterwards, on Sir Thomas's looking in for a minute, Lady Bertram called him back. \"Sir Thomas, stop a moment-I have something to say.\"\nHer tone of calm languor was always attended to; and Sir Thomas came back. Her story began; and Fanny immediately slipped out of the room; for to hear herself the subject of any discussion with her uncle was more than her nerves could bear. She was more anxious perhaps than she ought to be-for what was it after all whether she went or stayed? but if her uncle were to be a great while considering with grave looks, and at last decide against her, she might not be able to appear properly submissive.\nHer cause, meanwhile, went on well. Lady Bertram began, \"I have something to tell you that will surprise you. Mrs. Grant has asked Fanny to dinner.\"\n\"Well,\" said Sir Thomas, as if waiting more to accomplish the surprise.\n\"Edmund wants her to go. But how can I spare her?\"\n\"What is your difficulty?\"\nEdmund found himself obliged to speak. He told the whole; and she added, \"So strange! for Mrs. Grant never used to ask her.\"\n\"But is it not very natural,\" observed Edmund, \"that Mrs. Grant should wish to procure so agreeable a visitor for her sister?\"\n\"Nothing can be more natural,\" said Sir Thomas. \"Mrs. Grant's showing civility to Lady Bertram's niece could never want explanation. The only surprise is, that this should be the first time of its being paid. Fanny was perfectly right in giving a conditional answer. But as I conclude that she must wish to go, since all young people like to be together, I can see no reason why she should be denied.\"\n\"But can I do without her, Sir Thomas? She always makes tea, you know, when my sister is not here.\"\n\"Your sister, perhaps, may be prevailed on to stay with us, and I shall be at home.\"\n\"Very well, then, Fanny may go.\"\nThe good news soon followed her. Edmund knocked at her door.\n\"Well, Fanny, it is all happily settled. You are to go.\"\n\"Thank you, I am so glad,\" was Fanny's instinctive reply; though when she had shut the door, she could not help feeling, \"Yet why should I be glad? for am I not certain of hearing something there to pain me?\"\nIn spite of this, however, she was glad. Simple as the engagement might appear in other eyes, it had novelty and importance in hers, for she had scarcely ever dined out before; and though going only half a mile, and only to three people, still it was dining out, and all the little preparations were enjoyments in themselves. She had no assistance from those who ought to have directed her taste; for Lady Bertram never thought of being useful to anybody, and Mrs. Norris, when she came on the morrow, was in a very ill humour, intent only on lessening her niece's pleasure.\n\"Upon my word, Fanny, you are in high luck! You ought to be very much obliged to Mrs. Grant for thinking of you, and to your aunt for letting you go; for there is no occasion for your going into company in this way, or ever dining out at all. Do not fancy that the invitation is meant as any compliment to you; the compliment is intended to your uncle and aunt and me. Mrs. Grant thinks it a civility due to us, and you may be very certain that, if your cousin Julia had been at home, you would not have been asked at all.\"\nMrs. Norris had now so ingeniously done away all Mrs. Grant's part of the favour, that Fanny could only say that she was very much obliged to her aunt Bertram for sparing her.\n\"Oh! your aunt can do very well without you, or you would not be allowed to go. I shall be here, so you may be quite easy. And I hope you will find it all mighty delightful. But I must observe that five is the very awkwardest of all possible numbers to sit down to table; and I am surprised at Mrs. Grant! And round their enormous great wide table, too, which fills up the room so dreadfully! Had the doctor been content to take my dining-table when I came away, instead of having that absurd new one of his own, how infinitely better it would have been! Only five to be sitting round that table. However, you will have dinner enough on it for ten, I dare say.\"\nMrs. Norris fetched breath, and went on again.\n\"I must give you a hint, Fanny, now that you are going into company; do not be putting yourself forward, and talking as if you were one of your cousins-as if you were dear Mrs. Rushworth or Julia. That will never do. Remember, wherever you are, you must be the lowest and last. And you are to stay just as long as Edmund chooses. Leave him to settle that.\"\n\"Yes, ma'am.\"\n\"And if it should rain, which I think exceedingly likely, you must manage as well as you can, and not be expecting the carriage to be sent for you.\"\nHer niece thought it perfectly reasonable. She rated her own claims to comfort as low as Mrs. Norris could; and when Sir Thomas, just opening the door, said, \"Fanny, at what time would you have the carriage come round?\" she felt astonished.\n\"My dear Sir Thomas!\" cried Mrs. Norris, red with anger, \"Fanny can walk.\"\n\"Walk!\" repeated Sir Thomas, in a tone of most unanswerable dignity. \"My niece walk to a dinner engagement at this time of the year! Will twenty minutes after four suit you?\"\n\"Yes, sir,\" was Fanny's humble answer, given with the feelings of a criminal towards Mrs. Norris; and as she followed her uncle out of the room, she heard these words spoken in angry agitation-\n\"Quite unnecessary! a great deal too kind! But Edmund goes; it is upon Edmund's account.\"\nFanny, however, felt that the carriage was for herself: and her uncle's consideration cost her some tears of gratitude when she was alone.\nThe coachman drove round promptly; and Sir Thomas saw Fanny and Edmund off in good time.\n\"Now I must look at you, Fanny,\" said Edmund, with the kind smile of a brother, \"and tell you how I like you; and as well as I can judge by this light, you look very nicely indeed. What have you got on?\"\n\"The new dress that my uncle kindly gave me on my cousin's marriage. I thought I ought to wear it, as I might not have another opportunity all winter. I hope you do not think me too fine.\"\n\"A woman can never be too fine while she is all in white. Your gown seems very pretty. I like these glossy spots. Has not Miss Crawford a gown something the same?\"\nIn approaching the Parsonage they passed close by the stable-yard.\n\"Heyday!\" said Edmund, \"here's a carriage! who have they got to meet us? 'Tis Crawford's barouche! There are his men. This is quite a surprise, Fanny. I shall be very glad to see him.\"\nThere was no occasion for Fanny to say how differently she felt; but the idea of having such another to observe her caused a great increase of the trepidation with which she performed the awful ceremony of walking into the drawing-room.\nIn the drawing-room Mr. Crawford certainly was; and the smiles of the three others standing round him, showed how welcome was his sudden resolution of coming to them for a few days on leaving Bath. A very cordial meeting passed between him and Edmund; and with the exception of Fanny, the pleasure was general.\nHis presence at least meant that she could sit silent and unattended to. Though she must submit to being the principal lady in company, she found, while they were at table, a happy flow of conversation in which she was not required to take any part. There was so much to be said about Bath, and hunting, and politics, and everything else, as to leave her the fairest prospect of having only to listen in quiet, and of passing a very agreeable day.\nShe could not, however, show any eager interest in the gentleman's scheme for extending his stay at Mansfield, and sending for his hunters from Norfolk, which, urged by all the others, was in possession of his mind, and in which he seemed to want encouragement even from Fanny. Her answers to him were as short and indifferent as civility allowed. She would much rather not have him speak to her.\nHer two absent cousins, especially Maria, were much in her thoughts; but no embarrassing remembrance affected his spirits. He was apparently as willing to stay and be happy without the Miss Bertrams, as if he had never known Mansfield in any other state. He spoke of them only in a general way, till they were all re-assembled in the drawing-room, when he began talking of them to Miss Crawford. With a significant smile, which made Fanny quite hate him, he said, \"So! Rushworth and his fair bride are at Brighton, I understand; happy man!\"\n\"Yes, they have been there a fortnight. Julia is with them.\"\n\"And Mr. Yates, I presume, is not far off.\"\n\"Oh! we hear nothing of Mr. Yates. I do not imagine he figures much in the letters to Mansfield Park; do you, Miss Price? I think Julia knows better than to entertain her father with Mr. Yates.\"\n\"Poor Rushworth and his two-and-forty speeches!\" continued Crawford. \"Nobody can ever forget them. Well, I am much mistaken if his lovely Maria will ever want him to make two-and-forty speeches to her\"; adding, with a momentary seriousness, \"She is too good for him-much too good.\" Then changing again to gentle gallantry, and addressing Fanny, he said, \"You were Mr. Rushworth's best friend. Your kindness and patience to him can never be forgotten. He might not have sense enough himself to value your kindness, but it had honour from all the rest of the party.\"\nFanny coloured, and said nothing.\n\"It is as a dream, a pleasant dream!\" he exclaimed, after a few minutes' musing. \"I shall always look back on our theatricals with exquisite pleasure. There was such an interest, such an animation. We were all alive. There was employment, hope, bustle, for every hour of the day. I never was happier.\"\nWith silent indignation Fanny repeated to herself, \"Never happier than when behaving so dishonourably and unfeelingly! Oh! what a corrupted mind!\"\n\"We were unlucky, Miss Price,\" he continued, in a lower tone, not at all aware of her feelings. \"Another week would have been enough for us. If Mansfield Park had had the government of the winds just for a week or two, there would have been a difference. Not that we would have endangered his safety by any tremendous weather-but I think, Miss Price, we would have indulged ourselves with a week's calm in the Atlantic.\"\nFanny, averting her face, said, with a firmer tone than usual, \"I would not have delayed his return for a day, sir. My uncle disapproved it all so entirely when he did arrive, that in my opinion everything had gone quite far enough.\"\nShe had never spoken so much at once to him before, and never so angrily to any one; and she trembled at her own daring. He was surprised; but after a few moments' silent consideration of her, replied in a calmer, graver tone, \"I believe you are right. It was more pleasant than prudent. We were getting too noisy.\" He would have engaged her on some other subject, but her answers were so shy and reluctant that he could not advance in any.\nMiss Crawford, who had been repeatedly eyeing Dr. Grant and Edmund, now observed, \"Those gentlemen must have some very interesting point to discuss.\"\n\"The most interesting in the world,\" replied her brother-\"how to make money. Dr. Grant is giving Bertram instructions about the living he is to step into soon. He takes orders in a few weeks. He will have a very pretty income, earned without much trouble: seven hundred a year. That is a fine thing for a younger brother; and as of course he will still live at home, it will be all for small luxuries; and a sermon at Christmas and Easter, I suppose, will be the sum total of sacrifice.\"\nHis sister tried to laugh off her feelings by saying, \"Nothing amuses me more than the easy manner with which everybody settles the abundance of those who have a great deal less than themselves. You would look rather blank, Henry, if your small luxuries were to be limited to seven hundred a year.\"\n\"Perhaps; but Bertram is certainly well off for a cadet of a baronet's family. By the time he is five and twenty he will have seven hundred a year, and nothing to do for it.\"\nMiss Crawford could have said that there would be a something to do for it, which she could not think lightly of; but she let it pass; and tried to look unconcerned when the two gentlemen joined them.\n\"Bertram,\" said Henry Crawford, \"I shall make a point of coming to Mansfield to hear you preach your first sermon. When is it to be? Miss Price, will not you join me? Will not you fix your eyes steadily on him the whole time-as I shall do-only looking down to note any sentence pre-eminently beautiful? We will provide ourselves with tablets and a pencil. When will it be?\"\n\"I shall keep clear of you, Crawford, as long as I can,\" said Edmund; \"for you would disconcert me, and I should be more sorry to see you trying at it than almost any other man.\"\n\"Will he not feel this?\" thought Fanny. \"No, he can feel nothing as he ought.\"\nThe party being now united, and the chief talkers attracting each other, she remained in tranquillity; and as a whist-table was formed after tea for the amusement of Dr. Grant, and Miss Crawford took her harp, she had nothing to do but to listen. Her tranquillity remained undisturbed the rest of the evening, except when Mr. Crawford now and then addressed to her a question, which she could not avoid answering.\nMiss Crawford was too much vexed to be in a humour for anything but music. Edmund's being so soon to take orders had come upon her like a blow; she had hoped it still uncertain, and felt resentment and mortification. She was very angry with him. She had thought her influence more. She had begun to think of him with great regard, with almost decided intentions; but she would now meet him with his own cool feelings. It was plain that he could have no true attachment, by fixing himself in a situation which he must know she would never stoop to. She would learn to match him in his indifference, and would henceforth admit his attentions without any idea beyond her immediate amusement.",
        "paragraph_chars": [
            [
                0,
                182
            ],
            [
                182,
                300
            ],
            [
                300,
                367
            ],
            [
                367,
                441
            ],
            [
                441,
                488
            ],
            [
                488,
                586
            ],
            [
                586,
                746
            ],
            [
                746,
                839
            ],
            [
                839,
                988
            ],
            [
                988,
                1490
            ],
            [
                1490,
                1639
            ],
            [
                1639,
                1711
            ],
            [
                1711,
                1762
            ],
            [
                1762,
                1789
            ],
            [
                1789,
                1914
            ],
            [
                1914,
                2041
            ],
            [
                2041,
                2443
            ],
            [
                2443,
                2543
            ],
            [
                2543,
                2628
            ],
            [
                2628,
                2661
            ],
            [
                2661,
                2722
            ],
            [
                2722,
                2779
            ],
            [
                2779,
                2988
            ],
            [
                2988,
                3563
            ],
            [
                3563,
                4087
            ],
            [
                4087,
                4263
            ],
            [
                4263,
                4925
            ],
            [
                4925,
                4972
            ],
            [
                4972,
                5329
            ],
            [
                5329,
                5343
            ],
            [
                5343,
                5492
            ],
            [
                5492,
                5733
            ],
            [
                5733,
                5808
            ],
            [
                5808,
                5983
            ],
            [
                5983,
                6177
            ],
            [
                6177,
                6267
            ],
            [
                6267,
                6406
            ],
            [
                6406,
                6495
            ],
            [
                6495,
                6699
            ],
            [
                6699,
                6888
            ],
            [
                6888,
                7052
            ],
            [
                7052,
                7119
            ],
            [
                7119,
                7304
            ],
            [
                7304,
                7541
            ],
            [
                7541,
                7852
            ],
            [
                7852,
                8300
            ],
            [
                8300,
                8697
            ],
            [
                8697,
                9238
            ],
            [
                9238,
                9299
            ],
            [
                9299,
                9343
            ],
            [
                9343,
                9538
            ],
            [
                9538,
                10103
            ],
            [
                10103,
                10137
            ],
            [
                10137,
                10439
            ],
            [
                10439,
                10586
            ],
            [
                10586,
                11007
            ],
            [
                11007,
                11241
            ],
            [
                11241,
                11682
            ],
            [
                11682,
                11832
            ],
            [
                11832,
                12320
            ],
            [
                12320,
                12619
            ],
            [
                12619,
                12794
            ],
            [
                12794,
                12995
            ],
            [
                12995,
                13369
            ],
            [
                13369,
                13548
            ],
            [
                13548,
                13627
            ],
            [
                13627,
                14041
            ],
            [
                14041,
                14729
            ]
        ],
        "segment_chars": [
            [
                0,
                39
            ],
            [
                39,
                58
            ],
            [
                58,
                84
            ],
            [
                84,
                143
            ],
            [
                143,
                182
            ],
            [
                182,
                300
            ],
            [
                300,
                344
            ],
            [
                344,
                367
            ],
            [
                367,
                441
            ],
            [
                441,
                488
            ],
            [
                488,
                508
            ],
            [
                508,
                586
            ],
            [
                586,
                746
            ],
            [
                746,
                762
            ],
            [
                762,
                839
            ],
            [
                839,
                935
            ],
            [
                935,
                988
            ],
            [
                988,
                1063
            ],
            [
                1063,
                1229
            ],
            [
                1229,
                1333
            ],
            [
                1333,
                1490
            ],
            [
                1490,
                1526
            ],
            [
                1526,
                1600
            ],
            [
                1600,
                1639
            ],
            [
                1639,
                1711
            ],
            [
                1711,
                1736
            ],
            [
                1736,
                1762
            ],
            [
                1762,
                1789
            ],
            [
                1789,
                1828
            ],
            [
                1828,
                1875
            ],
            [
                1875,
                1914
            ],
            [
                1914,
                2041
            ],
            [
                2041,
                2089
            ],
            [
                2089,
                2174
            ],
            [
                2174,
                2250
            ],
            [
                2250,
                2308
            ],
            [
                2308,
                2443
            ],
            [
                2443,
                2482
            ],
            [
                2482,
                2543
            ],
            [
                2543,
                2628
            ],
            [
                2628,
                2661
            ],
            [
                2661,
                2694
            ],
            [
                2694,
                2722
            ],
            [
                2722,
                2763
            ],
            [
                2763,
                2779
            ],
            [
                2779,
                2927
            ],
            [
                2927,
                2988
            ],
            [
                2988,
                3029
            ],
            [
                3029,
                3314
            ],
            [
                3314,
                3563
            ],
            [
                3563,
                3607
            ],
            [
                3607,
                3806
            ],
            [
                3806,
                3932
            ],
            [
                3932,
                4087
            ],
            [
                4087,
                4263
            ],
            [
                4263,
                4268
            ],
            [
                4268,
                4343
            ],
            [
                4343,
                4386
            ],
            [
                4386,
                4437
            ],
            [
                4437,
                4569
            ],
            [
                4569,
                4656
            ],
            [
                4656,
                4818
            ],
            [
                4818,
                4860
            ],
            [
                4860,
                4925
            ],
            [
                4925,
                4972
            ],
            [
                4972,
                5169
            ],
            [
                5169,
                5189
            ],
            [
                5189,
                5250
            ],
            [
                5250,
                5302
            ],
            [
                5302,
                5329
            ],
            [
                5329,
                5343
            ],
            [
                5343,
                5492
            ],
            [
                5492,
                5535
            ],
            [
                5535,
                5712
            ],
            [
                5712,
                5733
            ],
            [
                5733,
                5755
            ],
            [
                5755,
                5808
            ],
            [
                5808,
                5816
            ],
            [
                5816,
                5877
            ],
            [
                5877,
                5941
            ],
            [
                5941,
                5983
            ],
            [
                5983,
                6177
            ],
            [
                6177,
                6197
            ],
            [
                6197,
                6220
            ],
            [
                6220,
                6267
            ],
            [
                6267,
                6406
            ],
            [
                6406,
                6495
            ],
            [
                6495,
                6676
            ],
            [
                6676,
                6699
            ],
            [
                6699,
                6768
            ],
            [
                6768,
                6850
            ],
            [
                6850,
                6888
            ],
            [
                6888,
                6946
            ],
            [
                6946,
                6975
            ],
            [
                6975,
                7002
            ],
            [
                7002,
                7052
            ],
            [
                7052,
                7119
            ],
            [
                7119,
                7129
            ],
            [
                7129,
                7162
            ],
            [
                7162,
                7192
            ],
            [
                7192,
                7218
            ],
            [
                7218,
                7237
            ],
            [
                7237,
                7270
            ],
            [
                7270,
                7304
            ],
            [
                7304,
                7541
            ],
            [
                7541,
                7739
            ],
            [
                7739,
                7852
            ],
            [
                7852,
                7925
            ],
            [
                7925,
                8102
            ],
            [
                8102,
                8300
            ],
            [
                8300,
                8578
            ],
            [
                8578,
                8648
            ],
            [
                8648,
                8697
            ],
            [
                8697,
                8820
            ],
            [
                8820,
                8952
            ],
            [
                8952,
                9093
            ],
            [
                9093,
                9166
            ],
            [
                9166,
                9238
            ],
            [
                9238,
                9278
            ],
            [
                9278,
                9299
            ],
            [
                9299,
                9343
            ],
            [
                9343,
                9348
            ],
            [
                9348,
                9378
            ],
            [
                9378,
                9465
            ],
            [
                9465,
                9538
            ],
            [
                9538,
                9587
            ],
            [
                9587,
                9607
            ],
            [
                9607,
                9637
            ],
            [
                9637,
                9820
            ],
            [
                9820,
                9931
            ],
            [
                9931,
                9989
            ],
            [
                9989,
                10103
            ],
            [
                10103,
                10137
            ],
            [
                10137,
                10175
            ],
            [
                10175,
                10218
            ],
            [
                10218,
                10288
            ],
            [
                10288,
                10335
            ],
            [
                10335,
                10354
            ],
            [
                10354,
                10417
            ],
            [
                10417,
                10439
            ],
            [
                10439,
                10558
            ],
            [
                10558,
                10562
            ],
            [
                10562,
                10586
            ],
            [
                10586,
                10682
            ],
            [
                10682,
                10727
            ],
            [
                10727,
                10841
            ],
            [
                10841,
                11007
            ],
            [
                11007,
                11123
            ],
            [
                11123,
                11241
            ],
            [
                11241,
                11362
            ],
            [
                11362,
                11494
            ],
            [
                11494,
                11529
            ],
            [
                11529,
                11557
            ],
            [
                11557,
                11682
            ],
            [
                11682,
                11832
            ],
            [
                11832,
                11909
            ],
            [
                11909,
                11992
            ],
            [
                11992,
                12024
            ],
            [
                12024,
                12110
            ],
            [
                12110,
                12320
            ],
            [
                12320,
                12515
            ],
            [
                12515,
                12619
            ],
            [
                12619,
                12698
            ],
            [
                12698,
                12794
            ],
            [
                12794,
                12995
            ],
            [
                12995,
                13110
            ],
            [
                13110,
                13128
            ],
            [
                13128,
                13162
            ],
            [
                13162,
                13298
            ],
            [
                13298,
                13351
            ],
            [
                13351,
                13369
            ],
            [
                13369,
                13548
            ],
            [
                13548,
                13573
            ],
            [
                13573,
                13588
            ],
            [
                13588,
                13627
            ],
            [
                13627,
                13874
            ],
            [
                13874,
                14041
            ],
            [
                14041,
                14116
            ],
            [
                14116,
                14258
            ],
            [
                14258,
                14287
            ],
            [
                14287,
                14323
            ],
            [
                14323,
                14459
            ],
            [
                14459,
                14589
            ],
            [
                14589,
                14729
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                39,
                58
            ],
            [
                59,
                82
            ],
            [
                82,
                84
            ],
            [
                84,
                143
            ],
            [
                143,
                182
            ],
            [
                182,
                189
            ],
            [
                194,
                212
            ],
            [
                212,
                297
            ],
            [
                297,
                300
            ],
            [
                300,
                301
            ],
            [
                301,
                304
            ],
            [
                305,
                311
            ],
            [
                312,
                322
            ],
            [
                323,
                344
            ],
            [
                344,
                364
            ],
            [
                367,
                441
            ],
            [
                441,
                488
            ],
            [
                489,
                508
            ],
            [
                508,
                586
            ],
            [
                586,
                607
            ],
            [
                607,
                650
            ],
            [
                657,
                660
            ],
            [
                661,
                695
            ],
            [
                695,
                725
            ],
            [
                726,
                730
            ],
            [
                731,
                743
            ],
            [
                743,
                746
            ],
            [
                746,
                762
            ],
            [
                762,
                839
            ],
            [
                839,
                866
            ],
            [
                867,
                877
            ],
            [
                877,
                879
            ],
            [
                880,
                903
            ],
            [
                903,
                904
            ],
            [
                905,
                917
            ],
            [
                918,
                933
            ],
            [
                935,
                985
            ],
            [
                985,
                988
            ],
            [
                988,
                1012
            ],
            [
                1013,
                1023
            ],
            [
                1024,
                1063
            ],
            [
                1063,
                1229
            ],
            [
                1229,
                1236
            ],
            [
                1237,
                1324
            ],
            [
                1331,
                1333
            ],
            [
                1333,
                1386
            ],
            [
                1387,
                1391
            ],
            [
                1392,
                1403
            ],
            [
                1403,
                1488
            ],
            [
                1488,
                1489
            ],
            [
                1490,
                1526
            ],
            [
                1531,
                1538
            ],
            [
                1539,
                1545
            ],
            [
                1547,
                1600
            ],
            [
                1600,
                1639
            ],
            [
                1639,
                1711
            ],
            [
                1711,
                1736
            ],
            [
                1736,
                1762
            ],
            [
                1762,
                1763
            ],
            [
                1763,
                1789
            ],
            [
                1789,
                1826
            ],
            [
                1826,
                1828
            ],
            [
                1828,
                1854
            ],
            [
                1860,
                1875
            ],
            [
                1875,
                1914
            ],
            [
                1914,
                2041
            ],
            [
                2041,
                2087
            ],
            [
                2087,
                2089
            ],
            [
                2090,
                2102
            ],
            [
                2111,
                2119
            ],
            [
                2120,
                2143
            ],
            [
                2144,
                2174
            ],
            [
                2174,
                2191
            ],
            [
                2192,
                2219
            ],
            [
                2220,
                2225
            ],
            [
                2226,
                2250
            ],
            [
                2250,
                2285
            ],
            [
                2286,
                2308
            ],
            [
                2308,
                2440
            ],
            [
                2440,
                2443
            ],
            [
                2443,
                2480
            ],
            [
                2482,
                2543
            ],
            [
                2543,
                2588
            ],
            [
                2594,
                2614
            ],
            [
                2615,
                2628
            ],
            [
                2628,
                2658
            ],
            [
                2658,
                2661
            ],
            [
                2661,
                2694
            ],
            [
                2694,
                2720
            ],
            [
                2720,
                2722
            ],
            [
                2722,
                2761
            ],
            [
                2761,
                2763
            ],
            [
                2763,
                2779
            ],
            [
                2779,
                2795
            ],
            [
                2796,
                2798
            ],
            [
                2799,
                2856
            ],
            [
                2857,
                2901
            ],
            [
                2901,
                2927
            ],
            [
                2927,
                2950
            ],
            [
                2951,
                2988
            ],
            [
                2988,
                3004
            ],
            [
                3004,
                3029
            ],
            [
                3029,
                3038
            ],
            [
                3039,
                3042
            ],
            [
                3043,
                3124
            ],
            [
                3125,
                3175
            ],
            [
                3176,
                3269
            ],
            [
                3283,
                3314
            ],
            [
                3314,
                3321
            ],
            [
                3325,
                3364
            ],
            [
                3365,
                3489
            ],
            [
                3490,
                3515
            ],
            [
                3516,
                3561
            ],
            [
                3561,
                3563
            ],
            [
                3563,
                3605
            ],
            [
                3605,
                3607
            ],
            [
                3607,
                3711
            ],
            [
                3711,
                3716
            ],
            [
                3717,
                3728
            ],
            [
                3729,
                3773
            ],
            [
                3774,
                3804
            ],
            [
                3804,
                3806
            ],
            [
                3813,
                3818
            ],
            [
                3819,
                3854
            ],
            [
                3855,
                3868
            ],
            [
                3869,
                3872
            ],
            [
                3872,
                3932
            ],
            [
                3932,
                3970
            ],
            [
                3971,
                3973
            ],
            [
                3973,
                4087
            ],
            [
                4087,
                4179
            ],
            [
                4180,
                4261
            ],
            [
                4261,
                4263
            ],
            [
                4263,
                4268
            ],
            [
                4268,
                4343
            ],
            [
                4343,
                4344
            ],
            [
                4345,
                4384
            ],
            [
                4384,
                4386
            ],
            [
                4386,
                4405
            ],
            [
                4406,
                4424
            ],
            [
                4437,
                4540
            ],
            [
                4544,
                4553
            ],
            [
                4557,
                4567
            ],
            [
                4567,
                4569
            ],
            [
                4569,
                4656
            ],
            [
                4656,
                4683
            ],
            [
                4684,
                4724
            ],
            [
                4724,
                4775
            ],
            [
                4776,
                4818
            ],
            [
                4818,
                4860
            ],
            [
                4860,
                4925
            ],
            [
                4925,
                4972
            ],
            [
                4972,
                4973
            ],
            [
                4973,
                4974
            ],
            [
                4980,
                4984
            ],
            [
                4985,
                4988
            ],
            [
                4989,
                5039
            ],
            [
                5039,
                5040
            ],
            [
                5041,
                5043
            ],
            [
                5044,
                5047
            ],
            [
                5048,
                5088
            ],
            [
                5089,
                5169
            ],
            [
                5169,
                5173
            ],
            [
                5174,
                5187
            ],
            [
                5187,
                5189
            ],
            [
                5189,
                5248
            ],
            [
                5248,
                5250
            ],
            [
                5250,
                5253
            ],
            [
                5254,
                5292
            ],
            [
                5300,
                5302
            ],
            [
                5302,
                5321
            ],
            [
                5322,
                5326
            ],
            [
                5326,
                5329
            ],
            [
                5329,
                5340
            ],
            [
                5340,
                5343
            ],
            [
                5343,
                5399
            ],
            [
                5399,
                5489
            ],
            [
                5492,
                5535
            ],
            [
                5535,
                5577
            ],
            [
                5578,
                5619
            ],
            [
                5619,
                5712
            ],
            [
                5712,
                5720
            ],
            [
                5731,
                5733
            ],
            [
                5733,
                5755
            ],
            [
                5755,
                5808
            ],
            [
                5808,
                5816
            ],
            [
                5816,
                5875
            ],
            [
                5875,
                5877
            ],
            [
                5877,
                5941
            ],
            [
                5941,
                5983
            ],
            [
                5983,
                6045
            ],
            [
                6046,
                6084
            ],
            [
                6088,
                6127
            ],
            [
                6138,
                6177
            ],
            [
                6177,
                6197
            ],
            [
                6197,
                6220
            ],
            [
                6220,
                6236
            ],
            [
                6237,
                6264
            ],
            [
                6272,
                6273
            ],
            [
                6281,
                6282
            ],
            [
                6283,
                6321
            ],
            [
                6321,
                6352
            ],
            [
                6353,
                6406
            ],
            [
                6406,
                6430
            ],
            [
                6439,
                6444
            ],
            [
                6445,
                6459
            ],
            [
                6477,
                6483
            ],
            [
                6484,
                6493
            ],
            [
                6493,
                6495
            ],
            [
                6495,
                6563
            ],
            [
                6566,
                6676
            ],
            [
                6676,
                6699
            ],
            [
                6699,
                6727
            ],
            [
                6740,
                6768
            ],
            [
                6768,
                6796
            ],
            [
                6796,
                6797
            ],
            [
                6798,
                6800
            ],
            [
                6801,
                6817
            ],
            [
                6818,
                6841
            ],
            [
                6842,
                6850
            ],
            [
                6850,
                6888
            ],
            [
                6888,
                6946
            ],
            [
                6946,
                6975
            ],
            [
                6975,
                7002
            ],
            [
                7002,
                7052
            ],
            [
                7052,
                7117
            ],
            [
                7117,
                7119
            ],
            [
                7119,
                7129
            ],
            [
                7129,
                7149
            ],
            [
                7150,
                7162
            ],
            [
                7162,
                7190
            ],
            [
                7197,
                7216
            ],
            [
                7216,
                7218
            ],
            [
                7218,
                7231
            ],
            [
                7232,
                7235
            ],
            [
                7235,
                7237
            ],
            [
                7237,
                7270
            ],
            [
                7270,
                7304
            ],
            [
                7304,
                7325
            ],
            [
                7326,
                7346
            ],
            [
                7347,
                7419
            ],
            [
                7427,
                7491
            ],
            [
                7492,
                7541
            ],
            [
                7541,
                7587
            ],
            [
                7587,
                7603
            ],
            [
                7604,
                7643
            ],
            [
                7651,
                7739
            ],
            [
                7739,
                7850
            ],
            [
                7852,
                7864
            ],
            [
                7895,
                7925
            ],
            [
                7925,
                7947
            ],
            [
                7948,
                7986
            ],
            [
                7986,
                8024
            ],
            [
                8025,
                8053
            ],
            [
                8054,
                8100
            ],
            [
                8100,
                8101
            ],
            [
                8102,
                8130
            ],
            [
                8131,
                8142
            ],
            [
                8143,
                8146
            ],
            [
                8147,
                8155
            ],
            [
                8156,
                8159
            ],
            [
                8160,
                8168
            ],
            [
                8168,
                8173
            ],
            [
                8174,
                8184
            ],
            [
                8189,
                8299
            ],
            [
                8300,
                8313
            ],
            [
                8313,
                8323
            ],
            [
                8329,
                8332
            ],
            [
                8339,
                8347
            ],
            [
                8348,
                8350
            ],
            [
                8351,
                8354
            ],
            [
                8355,
                8364
            ],
            [
                8367,
                8459
            ],
            [
                8460,
                8468
            ],
            [
                8473,
                8476
            ],
            [
                8483,
                8488
            ],
            [
                8489,
                8519
            ],
            [
                8523,
                8546
            ],
            [
                8561,
                8565
            ],
            [
                8576,
                8578
            ],
            [
                8578,
                8589
            ],
            [
                8590,
                8592
            ],
            [
                8597,
                8648
            ],
            [
                8648,
                8651
            ],
            [
                8652,
                8697
            ],
            [
                8697,
                8764
            ],
            [
                8764,
                8806
            ],
            [
                8807,
                8810
            ],
            [
                8811,
                8820
            ],
            [
                8820,
                8826
            ],
            [
                8827,
                8952
            ],
            [
                8961,
                8963
            ],
            [
                8964,
                8968
            ],
            [
                8969,
                9049
            ],
            [
                9050,
                9074
            ],
            [
                9075,
                9077
            ],
            [
                9091,
                9093
            ],
            [
                9093,
                9166
            ],
            [
                9166,
                9238
            ],
            [
                9238,
                9264
            ],
            [
                9265,
                9276
            ],
            [
                9278,
                9299
            ],
            [
                9299,
                9343
            ],
            [
                9344,
                9348
            ],
            [
                9348,
                9378
            ],
            [
                9378,
                9465
            ],
            [
                9465,
                9472
            ],
            [
                9473,
                9538
            ],
            [
                9538,
                9587
            ],
            [
                9587,
                9607
            ],
            [
                9607,
                9637
            ],
            [
                9637,
                9820
            ],
            [
                9820,
                9833
            ],
            [
                9834,
                9842
            ],
            [
                9843,
                9931
            ],
            [
                9931,
                9957
            ],
            [
                9958,
                9960
            ],
            [
                9961,
                9964
            ],
            [
                9965,
                9987
            ],
            [
                9989,
                9991
            ],
            [
                9992,
                10030
            ],
            [
                10037,
                10055
            ],
            [
                10056,
                10103
            ],
            [
                10103,
                10137
            ],
            [
                10137,
                10175
            ],
            [
                10175,
                10187
            ],
            [
                10187,
                10218
            ],
            [
                10218,
                10288
            ],
            [
                10288,
                10333
            ],
            [
                10333,
                10335
            ],
            [
                10335,
                10354
            ],
            [
                10354,
                10380
            ],
            [
                10380,
                10417
            ],
            [
                10417,
                10439
            ],
            [
                10439,
                10491
            ],
            [
                10491,
                10558
            ],
            [
                10558,
                10562
            ],
            [
                10562,
                10586
            ],
            [
                10586,
                10647
            ],
            [
                10648,
                10680
            ],
            [
                10680,
                10682
            ],
            [
                10683,
                10695
            ],
            [
                10696,
                10727
            ],
            [
                10727,
                10804
            ],
            [
                10805,
                10841
            ],
            [
                10841,
                10915
            ],
            [
                10916,
                11004
            ],
            [
                11004,
                11007
            ],
            [
                11007,
                11071
            ],
            [
                11071,
                11116
            ],
            [
                11116,
                11121
            ],
            [
                11121,
                11123
            ],
            [
                11123,
                11241
            ],
            [
                11241,
                11284
            ],
            [
                11285,
                11329
            ],
            [
                11330,
                11342
            ],
            [
                11343,
                11362
            ],
            [
                11362,
                11467
            ],
            [
                11468,
                11494
            ],
            [
                11494,
                11529
            ],
            [
                11529,
                11557
            ],
            [
                11557,
                11682
            ],
            [
                11682,
                11832
            ],
            [
                11832,
                11907
            ],
            [
                11907,
                11909
            ],
            [
                11909,
                11985
            ],
            [
                11986,
                11992
            ],
            [
                11992,
                12024
            ],
            [
                12024,
                12057
            ],
            [
                12057,
                12058
            ],
            [
                12059,
                12086
            ],
            [
                12088,
                12110
            ],
            [
                12115,
                12217
            ],
            [
                12232,
                12320
            ],
            [
                12320,
                12515
            ],
            [
                12515,
                12558
            ],
            [
                12574,
                12619
            ],
            [
                12619,
                12627
            ],
            [
                12627,
                12632
            ],
            [
                12633,
                12677
            ],
            [
                12678,
                12698
            ],
            [
                12698,
                12715
            ],
            [
                12716,
                12794
            ],
            [
                12794,
                12807
            ],
            [
                12808,
                12813
            ],
            [
                12814,
                12861
            ],
            [
                12862,
                12915
            ],
            [
                12916,
                12946
            ],
            [
                12947,
                12981
            ],
            [
                12982,
                12995
            ],
            [
                12995,
                13110
            ],
            [
                13110,
                13128
            ],
            [
                13128,
                13160
            ],
            [
                13160,
                13162
            ],
            [
                13162,
                13174
            ],
            [
                13179,
                13197
            ],
            [
                13198,
                13234
            ],
            [
                13234,
                13246
            ],
            [
                13247,
                13251
            ],
            [
                13252,
                13259
            ],
            [
                13260,
                13276
            ],
            [
                13277,
                13298
            ],
            [
                13298,
                13351
            ],
            [
                13351,
                13366
            ],
            [
                13369,
                13453
            ],
            [
                13454,
                13548
            ],
            [
                13548,
                13573
            ],
            [
                13573,
                13588
            ],
            [
                13588,
                13627
            ],
            [
                13627,
                13646
            ],
            [
                13647,
                13771
            ],
            [
                13772,
                13803
            ],
            [
                13804,
                13872
            ],
            [
                13874,
                14002
            ],
            [
                14002,
                14040
            ],
            [
                14041,
                14073
            ],
            [
                14074,
                14116
            ],
            [
                14116,
                14153
            ],
            [
                14154,
                14157
            ],
            [
                14163,
                14183
            ],
            [
                14193,
                14198
            ],
            [
                14202,
                14207
            ],
            [
                14208,
                14217
            ],
            [
                14217,
                14222
            ],
            [
                14223,
                14227
            ],
            [
                14228,
                14258
            ],
            [
                14258,
                14287
            ],
            [
                14287,
                14323
            ],
            [
                14323,
                14330
            ],
            [
                14331,
                14352
            ],
            [
                14353,
                14459
            ],
            [
                14459,
                14490
            ],
            [
                14491,
                14589
            ],
            [
                14589,
                14637
            ],
            [
                14643,
                14704
            ],
            [
                14709,
                14729
            ]
        ],
        "row_chars": [
            [
                0,
                39
            ],
            [
                39,
                58
            ],
            [
                58,
                58
            ],
            [
                58,
                84
            ],
            [
                84,
                143
            ],
            [
                143,
                182
            ],
            [
                182,
                300
            ],
            [
                300,
                344
            ],
            [
                344,
                367
            ],
            [
                367,
                367
            ],
            [
                367,
                441
            ],
            [
                441,
                441
            ],
            [
                441,
                441
            ],
            [
                441,
                488
            ],
            [
                488,
                488
            ],
            [
                488,
                508
            ],
            [
                508,
                586
            ],
            [
                586,
                746
            ],
            [
                746,
                762
            ],
            [
                762,
                762
            ],
            [
                762,
                839
            ],
            [
                839,
                988
            ],
            [
                988,
                1063
            ],
            [
                1063,
                1229
            ],
            [
                1229,
                1333
            ],
            [
                1333,
                1490
            ],
            [
                1490,
                1526
            ],
            [
                1526,
                1600
            ],
            [
                1600,
                1639
            ],
            [
                1639,
                1711
            ],
            [
                1711,
                1736
            ],
            [
                1736,
                1762
            ],
            [
                1762,
                1789
            ],
            [
                1789,
                1828
            ],
            [
                1828,
                1875
            ],
            [
                1875,
                1914
            ],
            [
                1914,
                2041
            ],
            [
                2041,
                2089
            ],
            [
                2089,
                2174
            ],
            [
                2174,
                2250
            ],
            [
                2250,
                2308
            ],
            [
                2308,
                2308
            ],
            [
                2308,
                2443
            ],
            [
                2443,
                2482
            ],
            [
                2482,
                2482
            ],
            [
                2482,
                2543
            ],
            [
                2543,
                2628
            ],
            [
                2628,
                2661
            ],
            [
                2661,
                2694
            ],
            [
                2694,
                2722
            ],
            [
                2722,
                2763
            ],
            [
                2763,
                2763
            ],
            [
                2763,
                2779
            ],
            [
                2779,
                2927
            ],
            [
                2927,
                2988
            ],
            [
                2988,
                3029
            ],
            [
                3029,
                3314
            ],
            [
                3314,
                3563
            ],
            [
                3563,
                3607
            ],
            [
                3607,
                3806
            ],
            [
                3806,
                3932
            ],
            [
                3932,
                4087
            ],
            [
                4087,
                4263
            ],
            [
                4263,
                4268
            ],
            [
                4268,
                4343
            ],
            [
                4343,
                4386
            ],
            [
                4386,
                4437
            ],
            [
                4437,
                4569
            ],
            [
                4569,
                4656
            ],
            [
                4656,
                4818
            ],
            [
                4818,
                4818
            ],
            [
                4818,
                4818
            ],
            [
                4818,
                4818
            ],
            [
                4818,
                4860
            ],
            [
                4860,
                4925
            ],
            [
                4925,
                4972
            ],
            [
                4972,
                5169
            ],
            [
                5169,
                5189
            ],
            [
                5189,
                5250
            ],
            [
                5250,
                5302
            ],
            [
                5302,
                5329
            ],
            [
                5329,
                5343
            ],
            [
                5343,
                5492
            ],
            [
                5492,
                5492
            ],
            [
                5492,
                5535
            ],
            [
                5535,
                5712
            ],
            [
                5712,
                5733
            ],
            [
                5733,
                5755
            ],
            [
                5755,
                5808
            ],
            [
                5808,
                5816
            ],
            [
                5816,
                5877
            ],
            [
                5877,
                5941
            ],
            [
                5941,
                5983
            ],
            [
                5983,
                6177
            ],
            [
                6177,
                6197
            ],
            [
                6197,
                6220
            ],
            [
                6220,
                6267
            ],
            [
                6267,
                6267
            ],
            [
                6267,
                6267
            ],
            [
                6267,
                6406
            ],
            [
                6406,
                6495
            ],
            [
                6495,
                6676
            ],
            [
                6676,
                6699
            ],
            [
                6699,
                6768
            ],
            [
                6768,
                6850
            ],
            [
                6850,
                6888
            ],
            [
                6888,
                6946
            ],
            [
                6946,
                6946
            ],
            [
                6946,
                6975
            ],
            [
                6975,
                7002
            ],
            [
                7002,
                7052
            ],
            [
                7052,
                7119
            ],
            [
                7119,
                7129
            ],
            [
                7129,
                7162
            ],
            [
                7162,
                7192
            ],
            [
                7192,
                7218
            ],
            [
                7218,
                7237
            ],
            [
                7237,
                7237
            ],
            [
                7237,
                7270
            ],
            [
                7270,
                7304
            ],
            [
                7304,
                7541
            ],
            [
                7541,
                7739
            ],
            [
                7739,
                7925
            ],
            [
                7925,
                8300
            ],
            [
                8300,
                8578
            ],
            [
                8578,
                8648
            ],
            [
                8648,
                8697
            ],
            [
                8697,
                8820
            ],
            [
                8820,
                8952
            ],
            [
                8952,
                9093
            ],
            [
                9093,
                9166
            ],
            [
                9166,
                9238
            ],
            [
                9238,
                9278
            ],
            [
                9278,
                9299
            ],
            [
                9299,
                9343
            ],
            [
                9343,
                9343
            ],
            [
                9343,
                9348
            ],
            [
                9348,
                9378
            ],
            [
                9378,
                9465
            ],
            [
                9465,
                9538
            ],
            [
                9538,
                9587
            ],
            [
                9587,
                9607
            ],
            [
                9607,
                9637
            ],
            [
                9637,
                9637
            ],
            [
                9637,
                9637
            ],
            [
                9637,
                9820
            ],
            [
                9820,
                9931
            ],
            [
                9931,
                9989
            ],
            [
                9989,
                10103
            ],
            [
                10103,
                10137
            ],
            [
                10137,
                10175
            ],
            [
                10175,
                10218
            ],
            [
                10218,
                10288
            ],
            [
                10288,
                10335
            ],
            [
                10335,
                10335
            ],
            [
                10335,
                10354
            ],
            [
                10354,
                10417
            ],
            [
                10417,
                10417
            ],
            [
                10417,
                10439
            ],
            [
                10439,
                10558
            ],
            [
                10558,
                10562
            ],
            [
                10562,
                10586
            ],
            [
                10586,
                10682
            ],
            [
                10682,
                10727
            ],
            [
                10727,
                10841
            ],
            [
                10841,
                11007
            ],
            [
                11007,
                11123
            ],
            [
                11123,
                11241
            ],
            [
                11241,
                11362
            ],
            [
                11362,
                11494
            ],
            [
                11494,
                11529
            ],
            [
                11529,
                11557
            ],
            [
                11557,
                11682
            ],
            [
                11682,
                11832
            ],
            [
                11832,
                11909
            ],
            [
                11909,
                11992
            ],
            [
                11992,
                12024
            ],
            [
                12024,
                12024
            ],
            [
                12024,
                12024
            ],
            [
                12024,
                12110
            ],
            [
                12110,
                12320
            ],
            [
                12320,
                12515
            ],
            [
                12515,
                12619
            ],
            [
                12619,
                12698
            ],
            [
                12698,
                12794
            ],
            [
                12794,
                12995
            ],
            [
                12995,
                13110
            ],
            [
                13110,
                13110
            ],
            [
                13110,
                13128
            ],
            [
                13128,
                13162
            ],
            [
                13162,
                13298
            ],
            [
                13298,
                13351
            ],
            [
                13351,
                13369
            ],
            [
                13369,
                13369
            ],
            [
                13369,
                13548
            ],
            [
                13548,
                13573
            ],
            [
                13573,
                13588
            ],
            [
                13588,
                13627
            ],
            [
                13627,
                14041
            ],
            [
                14041,
                14116
            ],
            [
                14116,
                14116
            ],
            [
                14116,
                14258
            ],
            [
                14258,
                14287
            ],
            [
                14287,
                14323
            ],
            [
                14323,
                14459
            ],
            [
                14459,
                14589
            ],
            [
                14589,
                14729
            ],
            [
                14729,
                14729
            ]
        ]
    }
}