{
    "original": {
        "text": "Henry Crawford had quite made up his mind by the next morning to give another fortnight to Mansfield, and having sent for his hunters, and written a few lines of explanation to the Admiral, he looked round at his sister as he sealed and threw the letter from him, and seeing the coast clear of the rest of the family, said, with a smile, \"And how do you think I mean to amuse myself, Mary, on the days that I do not hunt? I am grown too old to go out more than three times a week; but I have a plan for the intermediate days, and what do you think it is?\"\n\"To walk and ride with me, to be sure.\"\n\"Not exactly, though I shall be happy to do both, but _that_ would be exercise only to my body, and I must take care of my mind. Besides, _that_ would be all recreation and indulgence, without the wholesome alloy of labour, and I do not like to eat the bread of idleness. No, my plan is to make Fanny Price in love with me.\"\n\"Fanny Price! Nonsense! No, no. You ought to be satisfied with her two cousins.\"\n\"But I cannot be satisfied without Fanny Price, without making a small hole in Fanny Price's heart. You do not seem properly aware of her claims to notice. When we talked of her last night, you none of you seemed sensible of the wonderful improvement that has taken place in her looks within the last six weeks. You see her every day, and therefore do not notice it; but I assure you she is quite a different creature from what she was in the autumn. She was then merely a quiet, modest, not plain-looking girl, but she is now absolutely pretty. I used to think she had neither complexion nor countenance; but in that soft skin of hers, so frequently tinged with a blush as it was yesterday, there is decided beauty; and from what I observed of her eyes and mouth, I do not despair of their being capable of expression enough when she has anything to express. And then, her air, her manner, her _tout_ _ensemble_, is so indescribably improved! She must be grown two inches, at least, since October.\"\n\"Phoo! phoo! This is only because there were no tall women to compare her with, and because she has got a new gown, and you never saw her so well dressed before. She is just what she was in October, believe me. The truth is, that she was the only girl in company for you to notice, and you must have a somebody. I have always thought her pretty-not strikingly pretty-but 'pretty enough,' as people say; a sort of beauty that grows on one. Her eyes should be darker, but she has a sweet smile; but as for this wonderful degree of improvement, I am sure it may all be resolved into a better style of dress, and your having nobody else to look at; and therefore, if you do set about a flirtation with her, you never will persuade me that it is in compliment to her beauty, or that it proceeds from anything but your own idleness and folly.\"\nHer brother gave only a smile to this accusation, and soon afterwards said, \"I do not quite know what to make of Miss Fanny. I do not understand her. I could not tell what she would be at yesterday. What is her character? Is she solemn? Is she queer? Is she prudish? Why did she draw back and look so grave at me? I could hardly get her to speak. I never was so long in company with a girl in my life, trying to entertain her, and succeed so ill! Never met with a girl who looked so grave on me! I must try to get the better of this. Her looks say, 'I will not like you, I am determined not to like you'; and I say she shall.\"\n\"Foolish fellow! And so this is her attraction after all! This it is, her not caring about you, which gives her such a soft skin, and makes her so much taller, and produces all these charms and graces! I do desire that you will not be making her really unhappy; a _little_ love, perhaps, may animate and do her good, but I will not have you plunge her deep, for she is as good a little creature as ever lived, and has a great deal of feeling.\"\n\"It can be but for a fortnight,\" said Henry; \"and if a fortnight can kill her, she must have a constitution which nothing could save. No, I will not do her any harm, dear little soul! I only want her to look kindly on me, to give me smiles as well as blushes, to keep a chair for me by herself wherever we are, and be all animation when I take it and talk to her; to think as I think, be interested in all my possessions and pleasures, try to keep me longer at Mansfield, and feel when I go away that she shall be never happy again. I want nothing more.\"\n\"Moderation itself!\" said Mary. \"I can have no scruples now. Well, you will have opportunities enough of endeavouring to recommend yourself, for we are a great deal together.\"\nAnd without attempting any farther remonstrance, she left Fanny to her fate, a fate which, had not Fanny's heart been guarded in a way unsuspected by Miss Crawford, might have been a little harder than she deserved; for although there doubtless are such unconquerable young ladies of eighteen (or one should not read about them) as are never to be persuaded into love against their judgment by all that talent, manner, attention, and flattery can do, I have no inclination to believe Fanny one of them, or to think that with so much tenderness of disposition, and so much taste as belonged to her, she could have escaped heart-whole from the courtship (though the courtship only of a fortnight) of such a man as Crawford, in spite of there being some previous ill opinion of him to be overcome, had not her affection been engaged elsewhere. With all the security which love of another and disesteem of him could give to the peace of mind he was attacking, his continued attentions-continued, but not obtrusive, and adapting themselves more and more to the gentleness and delicacy of her character-obliged her very soon to dislike him less than formerly. She had by no means forgotten the past, and she thought as ill of him as ever; but she felt his powers: he was entertaining; and his manners were so improved, so polite, so seriously and blamelessly polite, that it was impossible not to be civil to him in return.\nA very few days were enough to effect this; and at the end of those few days, circumstances arose which had a tendency rather to forward his views of pleasing her, inasmuch as they gave her a degree of happiness which must dispose her to be pleased with everybody. William, her brother, the so long absent and dearly loved brother, was in England again. She had a letter from him herself, a few hurried happy lines, written as the ship came up Channel, and sent into Portsmouth with the first boat that left the Antwerp at anchor in Spithead; and when Crawford walked up with the newspaper in his hand, which he had hoped would bring the first tidings, he found her trembling with joy over this letter, and listening with a glowing, grateful countenance to the kind invitation which her uncle was most collectedly dictating in reply.\nIt was but the day before that Crawford had made himself thoroughly master of the subject, or had in fact become at all aware of her having such a brother, or his being in such a ship, but the interest then excited had been very properly lively, determining him on his return to town to apply for information as to the probable period of the Antwerp's return from the Mediterranean, etc.; and the good luck which attended his early examination of ship news the next morning seemed the reward of his ingenuity in finding out such a method of pleasing her, as well as of his dutiful attention to the Admiral, in having for many years taken in the paper esteemed to have the earliest naval intelligence. He proved, however, to be too late. All those fine first feelings, of which he had hoped to be the exciter, were already given. But his intention, the kindness of his intention, was thankfully acknowledged: quite thankfully and warmly, for she was elevated beyond the common timidity of her mind by the flow of her love for William.\nThis dear William would soon be amongst them. There could be no doubt of his obtaining leave of absence immediately, for he was still only a midshipman; and as his parents, from living on the spot, must already have seen him, and be seeing him perhaps daily, his direct holidays might with justice be instantly given to the sister, who had been his best correspondent through a period of seven years, and the uncle who had done most for his support and advancement; and accordingly the reply to her reply, fixing a very early day for his arrival, came as soon as possible; and scarcely ten days had passed since Fanny had been in the agitation of her first dinner-visit, when she found herself in an agitation of a higher nature, watching in the hall, in the lobby, on the stairs, for the first sound of the carriage which was to bring her a brother.\nIt came happily while she was thus waiting; and there being neither ceremony nor fearfulness to delay the moment of meeting, she was with him as he entered the house, and the first minutes of exquisite feeling had no interruption and no witnesses, unless the servants chiefly intent upon opening the proper doors could be called such. This was exactly what Sir Thomas and Edmund had been separately conniving at, as each proved to the other by the sympathetic alacrity with which they both advised Mrs. Norris's continuing where she was, instead of rushing out into the hall as soon as the noises of the arrival reached them.\nWilliam and Fanny soon shewed themselves; and Sir Thomas had the pleasure of receiving, in his protg, certainly a very different person from the one he had equipped seven years ago, but a young man of an open, pleasant countenance, and frank, unstudied, but feeling and respectful manners, and such as confirmed him his friend.\nIt was long before Fanny could recover from the agitating happiness of such an hour as was formed by the last thirty minutes of expectation, and the first of fruition; it was some time even before her happiness could be said to make her happy, before the disappointment inseparable from the alteration of person had vanished, and she could see in him the same William as before, and talk to him, as her heart had been yearning to do through many a past year. That time, however, did gradually come, forwarded by an affection on his side as warm as her own, and much less encumbered by refinement or self-distrust. She was the first object of his love, but it was a love which his stronger spirits, and bolder temper, made it as natural for him to express as to feel. On the morrow they were walking about together with true enjoyment, and every succeeding morrow renewed a _tte--tte_ which Sir Thomas could not but observe with complacency, even before Edmund had pointed it out to him.\nExcepting the moments of peculiar delight, which any marked or unlooked-for instance of Edmund's consideration of her in the last few months had excited, Fanny had never known so much felicity in her life, as in this unchecked, equal, fearless intercourse with the brother and friend who was opening all his heart to her, telling her all his hopes and fears, plans, and solicitudes respecting that long thought of, dearly earned, and justly valued blessing of promotion; who could give her direct and minute information of the father and mother, brothers and sisters, of whom she very seldom heard; who was interested in all the comforts and all the little hardships of her home at Mansfield; ready to think of every member of that home as she directed, or differing only by a less scrupulous opinion, and more noisy abuse of their aunt Norris, and with whom (perhaps the dearest indulgence of the whole) all the evil and good of their earliest years could be gone over again, and every former united pain and pleasure retraced with the fondest recollection. An advantage this, a strengthener of love, in which even the conjugal tie is beneath the fraternal. Children of the same family, the same blood, with the same first associations and habits, have some means of enjoyment in their power, which no subsequent connexions can supply; and it must be by a long and unnatural estrangement, by a divorce which no subsequent connexion can justify, if such precious remains of the earliest attachments are ever entirely outlived. Too often, alas! it is so. Fraternal love, sometimes almost everything, is at others worse than nothing. But with William and Fanny Price it was still a sentiment in all its prime and freshness, wounded by no opposition of interest, cooled by no separate attachment, and feeling the influence of time and absence only in its increase.\nAn affection so amiable was advancing each in the opinion of all who had hearts to value anything good. Henry Crawford was as much struck with it as any. He honoured the warm-hearted, blunt fondness of the young sailor, which led him to say, with his hands stretched towards Fanny's head, \"Do you know, I begin to like that queer fashion already, though when I first heard of such things being done in England, I could not believe it; and when Mrs. Brown, and the other women at the Commissioner's at Gibraltar, appeared in the same trim, I thought they were mad; but Fanny can reconcile me to anything\"; and saw, with lively admiration, the glow of Fanny's cheek, the brightness of her eye, the deep interest, the absorbed attention, while her brother was describing any of the imminent hazards, or terrific scenes, which such a period at sea must supply.\nIt was a picture which Henry Crawford had moral taste enough to value. Fanny's attractions increased-increased twofold; for the sensibility which beautified her complexion and illumined her countenance was an attraction in itself. He was no longer in doubt of the capabilities of her heart. She had feeling, genuine feeling. It would be something to be loved by such a girl, to excite the first ardours of her young unsophisticated mind! She interested him more than he had foreseen. A fortnight was not enough. His stay became indefinite.\nWilliam was often called on by his uncle to be the talker. His recitals were amusing in themselves to Sir Thomas, but the chief object in seeking them was to understand the reciter, to know the young man by his histories; and he listened to his clear, simple, spirited details with full satisfaction, seeing in them the proof of good principles, professional knowledge, energy, courage, and cheerfulness, everything that could deserve or promise well. Young as he was, William had already seen a great deal. He had been in the Mediterranean; in the West Indies; in the Mediterranean again; had been often taken on shore by the favour of his captain, and in the course of seven years had known every variety of danger which sea and war together could offer. With such means in his power he had a right to be listened to; and though Mrs. Norris could fidget about the room, and disturb everybody in quest of two needlefuls of thread or a second-hand shirt button, in the midst of her nephew's account of a shipwreck or an engagement, everybody else was attentive; and even Lady Bertram could not hear of such horrors unmoved, or without sometimes lifting her eyes from her work to say, \"Dear me! how disagreeable! I wonder anybody can ever go to sea.\"\nTo Henry Crawford they gave a different feeling. He longed to have been at sea, and seen and done and suffered as much. His heart was warmed, his fancy fired, and he felt the highest respect for a lad who, before he was twenty, had gone through such bodily hardships and given such proofs of mind. The glory of heroism, of usefulness, of exertion, of endurance, made his own habits of selfish indulgence appear in shameful contrast; and he wished he had been a William Price, distinguishing himself and working his way to fortune and consequence with so much self-respect and happy ardour, instead of what he was!\nThe wish was rather eager than lasting. He was roused from the reverie of retrospection and regret produced by it, by some inquiry from Edmund as to his plans for the next day's hunting; and he found it was as well to be a man of fortune at once with horses and grooms at his command. In one respect it was better, as it gave him the means of conferring a kindness where he wished to oblige. With spirits, courage, and curiosity up to anything, William expressed an inclination to hunt; and Crawford could mount him without the slightest inconvenience to himself, and with only some scruples to obviate in Sir Thomas, who knew better than his nephew the value of such a loan, and some alarms to reason away in Fanny. She feared for William; by no means convinced by all that he could relate of his own horsemanship in various countries, of the scrambling parties in which he had been engaged, the rough horses and mules he had ridden, or his many narrow escapes from dreadful falls, that he was at all equal to the management of a high-fed hunter in an English fox-chase; nor till he returned safe and well, without accident or discredit, could she be reconciled to the risk, or feel any of that obligation to Mr. Crawford for lending the horse which he had fully intended it should produce. When it was proved, however, to have done William no harm, she could allow it to be a kindness, and even reward the owner with a smile when the animal was one minute tendered to his use again; and the next, with the greatest cordiality, and in a manner not to be resisted, made over to his use entirely so long as he remained in Northamptonshire.",
        "paragraph_chars": [
            [
                0,
                556
            ],
            [
                556,
                596
            ],
            [
                596,
                921
            ],
            [
                921,
                1002
            ],
            [
                1002,
                2002
            ],
            [
                2002,
                2840
            ],
            [
                2840,
                3467
            ],
            [
                3467,
                3911
            ],
            [
                3911,
                4466
            ],
            [
                4466,
                4642
            ],
            [
                4642,
                6060
            ],
            [
                6060,
                6894
            ],
            [
                6894,
                7928
            ],
            [
                7928,
                8779
            ],
            [
                8779,
                9405
            ],
            [
                9405,
                9733
            ],
            [
                9733,
                10720
            ],
            [
                10720,
                12582
            ],
            [
                12582,
                13439
            ],
            [
                13439,
                13979
            ],
            [
                13979,
                15229
            ],
            [
                15229,
                15843
            ],
            [
                15843,
                17481
            ]
        ],
        "segment_chars": [
            [
                0,
                422
            ],
            [
                422,
                556
            ],
            [
                556,
                596
            ],
            [
                596,
                725
            ],
            [
                725,
                868
            ],
            [
                868,
                921
            ],
            [
                921,
                935
            ],
            [
                935,
                945
            ],
            [
                945,
                953
            ],
            [
                953,
                1002
            ],
            [
                1002,
                1102
            ],
            [
                1102,
                1158
            ],
            [
                1158,
                1314
            ],
            [
                1314,
                1453
            ],
            [
                1453,
                1548
            ],
            [
                1548,
                1862
            ],
            [
                1862,
                1946
            ],
            [
                1946,
                2002
            ],
            [
                2002,
                2009
            ],
            [
                2009,
                2015
            ],
            [
                2015,
                2164
            ],
            [
                2164,
                2213
            ],
            [
                2213,
                2314
            ],
            [
                2314,
                2441
            ],
            [
                2441,
                2840
            ],
            [
                2840,
                2965
            ],
            [
                2965,
                2990
            ],
            [
                2990,
                3039
            ],
            [
                3039,
                3062
            ],
            [
                3062,
                3077
            ],
            [
                3077,
                3091
            ],
            [
                3091,
                3107
            ],
            [
                3107,
                3154
            ],
            [
                3154,
                3187
            ],
            [
                3187,
                3287
            ],
            [
                3287,
                3336
            ],
            [
                3336,
                3374
            ],
            [
                3374,
                3467
            ],
            [
                3467,
                3484
            ],
            [
                3484,
                3525
            ],
            [
                3525,
                3669
            ],
            [
                3669,
                3911
            ],
            [
                3911,
                4045
            ],
            [
                4045,
                4095
            ],
            [
                4095,
                4444
            ],
            [
                4444,
                4466
            ],
            [
                4466,
                4487
            ],
            [
                4487,
                4498
            ],
            [
                4498,
                4527
            ],
            [
                4527,
                4642
            ],
            [
                4642,
                5483
            ],
            [
                5483,
                5796
            ],
            [
                5796,
                6060
            ],
            [
                6060,
                6325
            ],
            [
                6325,
                6414
            ],
            [
                6414,
                6894
            ],
            [
                6894,
                7595
            ],
            [
                7595,
                7631
            ],
            [
                7631,
                7723
            ],
            [
                7723,
                7928
            ],
            [
                7928,
                7974
            ],
            [
                7974,
                8779
            ],
            [
                8779,
                9114
            ],
            [
                9114,
                9405
            ],
            [
                9405,
                9733
            ],
            [
                9733,
                10192
            ],
            [
                10192,
                10347
            ],
            [
                10347,
                10500
            ],
            [
                10500,
                10720
            ],
            [
                10720,
                11779
            ],
            [
                11779,
                11879
            ],
            [
                11879,
                12247
            ],
            [
                12247,
                12264
            ],
            [
                12264,
                12274
            ],
            [
                12274,
                12352
            ],
            [
                12352,
                12582
            ],
            [
                12582,
                12686
            ],
            [
                12686,
                12736
            ],
            [
                12736,
                13439
            ],
            [
                13439,
                13510
            ],
            [
                13510,
                13670
            ],
            [
                13670,
                13730
            ],
            [
                13730,
                13764
            ],
            [
                13764,
                13877
            ],
            [
                13877,
                13923
            ],
            [
                13923,
                13951
            ],
            [
                13951,
                13979
            ],
            [
                13979,
                14038
            ],
            [
                14038,
                14431
            ],
            [
                14431,
                14487
            ],
            [
                14487,
                14736
            ],
            [
                14736,
                15173
            ],
            [
                15173,
                15191
            ],
            [
                15191,
                15229
            ],
            [
                15229,
                15278
            ],
            [
                15278,
                15349
            ],
            [
                15349,
                15527
            ],
            [
                15527,
                15843
            ],
            [
                15843,
                15883
            ],
            [
                15883,
                16128
            ],
            [
                16128,
                16235
            ],
            [
                16235,
                16560
            ],
            [
                16560,
                17135
            ],
            [
                17135,
                17481
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                25,
                100
            ],
            [
                106,
                133
            ],
            [
                188,
                219
            ],
            [
                100,
                105
            ],
            [
                318,
                339
            ],
            [
                343,
                420
            ],
            [
                556,
                596
            ],
            [
                596,
                649
            ],
            [
                651,
                655
            ],
            [
                741,
                764
            ],
            [
                779,
                868
            ],
            [
                868,
                921
            ],
            [
                921,
                935
            ],
            [
                935,
                945
            ],
            [
                945,
                953
            ],
            [
                953,
                1002
            ],
            [
                1002,
                1028
            ],
            [
                1050,
                1102
            ],
            [
                1102,
                1132
            ],
            [
                1224,
                1286
            ],
            [
                1312,
                1314
            ],
            [
                1314,
                1453
            ],
            [
                1453,
                1488
            ],
            [
                1508,
                1548
            ],
            [
                1548,
                1638
            ],
            [
                1694,
                1722
            ],
            [
                1767,
                1786
            ],
            [
                1747,
                1755
            ],
            [
                1793,
                1820
            ],
            [
                1828,
                1862
            ],
            [
                1862,
                1879
            ],
            [
                1916,
                1946
            ],
            [
                1946,
                1974
            ],
            [
                1986,
                2002
            ],
            [
                2002,
                2009
            ],
            [
                2009,
                2015
            ],
            [
                2015,
                2164
            ],
            [
                2164,
                2213
            ],
            [
                2213,
                2314
            ],
            [
                2314,
                2346
            ],
            [
                2381,
                2387
            ],
            [
                2493,
                2520
            ],
            [
                2531,
                2543
            ],
            [
                2554,
                2645
            ],
            [
                2439,
                2440
            ],
            [
                2662,
                2704
            ],
            [
                2737,
                2739
            ],
            [
                2715,
                2719
            ],
            [
                2792,
                2796
            ],
            [
                2806,
                2840
            ],
            [
                2840,
                2851
            ],
            [
                2857,
                2861
            ],
            [
                2888,
                2893
            ],
            [
                2910,
                2965
            ],
            [
                3062,
                3077
            ],
            [
                3091,
                3107
            ],
            [
                3107,
                3118
            ],
            [
                3133,
                3154
            ],
            [
                3154,
                3187
            ],
            [
                3287,
                3336
            ],
            [
                3336,
                3374
            ],
            [
                3374,
                3467
            ],
            [
                3467,
                3484
            ],
            [
                3488,
                3513
            ],
            [
                3523,
                3525
            ],
            [
                3530,
                3535
            ],
            [
                3537,
                3568
            ],
            [
                3631,
                3656
            ],
            [
                3667,
                3669
            ],
            [
                3686,
                3689
            ],
            [
                3695,
                3698
            ],
            [
                3709,
                3730
            ],
            [
                3732,
                3738
            ],
            [
                3740,
                3766
            ],
            [
                3774,
                3777
            ],
            [
                3782,
                3835
            ],
            [
                3844,
                3845
            ],
            [
                3778,
                3782
            ],
            [
                3846,
                3861
            ],
            [
                3875,
                3911
            ],
            [
                3911,
                4045
            ],
            [
                4045,
                4095
            ],
            [
                4095,
                4150
            ],
            [
                4169,
                4193
            ],
            [
                4205,
                4257
            ],
            [
                4273,
                4319
            ],
            [
                4336,
                4345
            ],
            [
                4381,
                4444
            ],
            [
                4444,
                4466
            ],
            [
                4466,
                4487
            ],
            [
                4487,
                4498
            ],
            [
                4498,
                4525
            ],
            [
                4642,
                4653
            ],
            [
                4665,
                4934
            ],
            [
                4971,
                4973
            ],
            [
                5085,
                5088
            ],
            [
                4978,
                4983
            ],
            [
                4987,
                5009
            ],
            [
                5033,
                5035
            ],
            [
                5045,
                5051
            ],
            [
                5059,
                5084
            ],
            [
                5091,
                5161
            ],
            [
                5240,
                5293
            ],
            [
                5337,
                5363
            ],
            [
                5445,
                5458
            ],
            [
                5437,
                5444
            ],
            [
                5459,
                5483
            ],
            [
                5598,
                5622
            ],
            [
                5596,
                5597
            ],
            [
                5691,
                5708
            ],
            [
                5722,
                5738
            ],
            [
                5632,
                5633
            ],
            [
                5747,
                5750
            ],
            [
                5756,
                5796
            ],
            [
                5796,
                5803
            ],
            [
                5816,
                5953
            ],
            [
                6003,
                6060
            ],
            [
                6060,
                6061
            ],
            [
                6067,
                6107
            ],
            [
                6138,
                6163
            ],
            [
                6291,
                6325
            ],
            [
                6325,
                6333
            ],
            [
                6347,
                6350
            ],
            [
                6354,
                6406
            ],
            [
                6412,
                6414
            ],
            [
                6414,
                6439
            ],
            [
                6474,
                6503
            ],
            [
                6543,
                6546
            ],
            [
                6504,
                6511
            ],
            [
                6601,
                6791
            ],
            [
                6802,
                6836
            ],
            [
                6837,
                6856
            ],
            [
                6874,
                6883
            ],
            [
                6892,
                6894
            ],
            [
                6894,
                6937
            ],
            [
                7000,
                7006
            ],
            [
                7014,
                7077
            ],
            [
                7079,
                7082
            ],
            [
                6988,
                6991
            ],
            [
                7187,
                7221
            ],
            [
                6969,
                6975
            ],
            [
                7341,
                7345
            ],
            [
                7243,
                7252
            ],
            [
                7283,
                7286
            ],
            [
                7109,
                7112
            ],
            [
                7532,
                7538
            ],
            [
                7351,
                7367
            ],
            [
                7593,
                7595
            ],
            [
                7595,
                7631
            ],
            [
                7631,
                7673
            ],
            [
                7678,
                7723
            ],
            [
                7723,
                7726
            ],
            [
                7742,
                7771
            ],
            [
                7773,
                7801
            ],
            [
                7831,
                7858
            ],
            [
                7882,
                7885
            ],
            [
                7870,
                7878
            ],
            [
                7891,
                7893
            ],
            [
                7906,
                7928
            ],
            [
                7928,
                7974
            ],
            [
                8001,
                8004
            ],
            [
                8414,
                8419
            ],
            [
                8475,
                8479
            ],
            [
                8432,
                8440
            ],
            [
                8625,
                8627
            ],
            [
                8448,
                8473
            ],
            [
                8499,
                8522
            ],
            [
                8043,
                8044
            ],
            [
                8540,
                8545
            ],
            [
                8608,
                8621
            ],
            [
                8658,
                8779
            ],
            [
                8779,
                8786
            ],
            [
                8821,
                8826
            ],
            [
                8895,
                8903
            ],
            [
                8946,
                8949
            ],
            [
                8954,
                8988
            ],
            [
                8944,
                8945
            ],
            [
                8989,
                9025
            ],
            [
                9112,
                9114
            ],
            [
                9114,
                9166
            ],
            [
                9178,
                9191
            ],
            [
                9259,
                9290
            ],
            [
                9302,
                9378
            ],
            [
                9383,
                9405
            ],
            [
                9405,
                9427
            ],
            [
                9435,
                9506
            ],
            [
                9591,
                9662
            ],
            [
                9675,
                9693
            ],
            [
                9731,
                9733
            ],
            [
                9733,
                9816
            ],
            [
                9899,
                9976
            ],
            [
                10059,
                10072
            ],
            [
                10116,
                10127
            ],
            [
                10129,
                10192
            ],
            [
                10192,
                10215
            ],
            [
                10226,
                10231
            ],
            [
                10242,
                10317
            ],
            [
                10332,
                10347
            ],
            [
                10347,
                10384
            ],
            [
                10396,
                10412
            ],
            [
                10435,
                10448
            ],
            [
                10450,
                10457
            ],
            [
                10461,
                10487
            ],
            [
                10498,
                10500
            ],
            [
                10500,
                10605
            ],
            [
                10607,
                10615
            ],
            [
                10617,
                10633
            ],
            [
                10656,
                10672
            ],
            [
                10718,
                10720
            ],
            [
                10720,
                10726
            ],
            [
                10792,
                10795
            ],
            [
                10730,
                10744
            ],
            [
                10754,
                10761
            ],
            [
                10769,
                10772
            ],
            [
                10796,
                10837
            ],
            [
                10872,
                10903
            ],
            [
                10924,
                11067
            ],
            [
                10761,
                10762
            ],
            [
                11072,
                11077
            ],
            [
                11068,
                11071
            ],
            [
                11079,
                11084
            ],
            [
                11102,
                11112
            ],
            [
                11180,
                11209
            ],
            [
                11228,
                11246
            ],
            [
                11288,
                11361
            ],
            [
                11370,
                11494
            ],
            [
                11526,
                11613
            ],
            [
                11362,
                11365
            ],
            [
                11623,
                11628
            ],
            [
                11650,
                11713
            ],
            [
                11721,
                11738
            ],
            [
                11757,
                11761
            ],
            [
                11158,
                11160
            ],
            [
                11777,
                11779
            ],
            [
                12061,
                12109
            ],
            [
                12166,
                12182
            ],
            [
                12110,
                12112
            ],
            [
                11888,
                11890
            ],
            [
                12113,
                12114
            ],
            [
                11900,
                11906
            ],
            [
                12219,
                12222
            ],
            [
                12237,
                12247
            ],
            [
                12247,
                12264
            ],
            [
                12264,
                12274
            ],
            [
                12274,
                12288
            ],
            [
                12319,
                12324
            ],
            [
                12332,
                12352
            ],
            [
                12352,
                12397
            ],
            [
                12410,
                12412
            ],
            [
                12417,
                12440
            ],
            [
                12580,
                12582
            ],
            [
                12686,
                12704
            ],
            [
                12708,
                12724
            ],
            [
                12585,
                12594
            ],
            [
                12734,
                12736
            ],
            [
                12736,
                12919
            ],
            [
                12927,
                12940
            ],
            [
                13042,
                13045
            ],
            [
                13052,
                13092
            ],
            [
                13094,
                13184
            ],
            [
                13191,
                13200
            ],
            [
                13208,
                13277
            ],
            [
                13297,
                13349
            ],
            [
                13293,
                13296
            ],
            [
                13370,
                13377
            ],
            [
                12955,
                12957
            ],
            [
                13419,
                13425
            ],
            [
                13437,
                13439
            ],
            [
                13439,
                13510
            ],
            [
                13510,
                13539
            ],
            [
                13550,
                13562
            ],
            [
                13670,
                13672
            ],
            [
                13677,
                13686
            ],
            [
                13699,
                13730
            ],
            [
                13730,
                13764
            ],
            [
                13764,
                13848
            ],
            [
                13855,
                13877
            ],
            [
                13877,
                13923
            ],
            [
                13923,
                13951
            ],
            [
                13951,
                13979
            ],
            [
                13979,
                14038
            ],
            [
                14038,
                14063
            ],
            [
                14078,
                14182
            ],
            [
                14199,
                14260
            ],
            [
                14266,
                14382
            ],
            [
                14429,
                14431
            ],
            [
                14431,
                14487
            ],
            [
                14487,
                14519
            ],
            [
                14524,
                14539
            ],
            [
                14567,
                14635
            ],
            [
                14650,
                14677
            ],
            [
                14689,
                14713
            ],
            [
                14723,
                14735
            ],
            [
                14803,
                14884
            ],
            [
                14903,
                14914
            ],
            [
                14927,
                14939
            ],
            [
                14941,
                14992
            ],
            [
                15009,
                15093
            ],
            [
                15106,
                15164
            ],
            [
                15171,
                15173
            ],
            [
                15191,
                15229
            ],
            [
                15229,
                15278
            ],
            [
                15278,
                15295
            ],
            [
                15313,
                15326
            ],
            [
                15340,
                15349
            ],
            [
                15349,
                15478
            ],
            [
                15486,
                15495
            ],
            [
                15525,
                15527
            ],
            [
                15527,
                15610
            ],
            [
                15633,
                15704
            ],
            [
                15819,
                15843
            ],
            [
                15843,
                15855
            ],
            [
                15874,
                15883
            ],
            [
                15883,
                15901
            ],
            [
                15992,
                15995
            ],
            [
                15935,
                15941
            ],
            [
                15958,
                15991
            ],
            [
                16006,
                16080
            ],
            [
                16089,
                16128
            ],
            [
                16128,
                16207
            ],
            [
                16224,
                16226
            ],
            [
                16233,
                16235
            ],
            [
                16338,
                16366
            ],
            [
                16381,
                16420
            ],
            [
                16523,
                16560
            ],
            [
                16560,
                16668
            ],
            [
                16740,
                16745
            ],
            [
                16669,
                16678
            ],
            [
                16824,
                16913
            ],
            [
                17133,
                17134
            ],
            [
                16919,
                16950
            ],
            [
                16988,
                16991
            ],
            [
                16982,
                16987
            ],
            [
                17022,
                17030
            ],
            [
                17050,
                17087
            ],
            [
                17135,
                17203
            ],
            [
                17240,
                17269
            ],
            [
                17342,
                17371
            ],
            [
                17275,
                17278
            ],
            [
                17313,
                17320
            ],
            [
                17438,
                17481
            ]
        ],
        "row_chars": [
            [
                0,
                422
            ],
            [
                422,
                556
            ],
            [
                556,
                596
            ],
            [
                596,
                868
            ],
            [
                868,
                921
            ],
            [
                921,
                935
            ],
            [
                935,
                945
            ],
            [
                945,
                953
            ],
            [
                953,
                1002
            ],
            [
                1002,
                1102
            ],
            [
                1102,
                1314
            ],
            [
                1314,
                1453
            ],
            [
                1453,
                1548
            ],
            [
                1548,
                1862
            ],
            [
                1862,
                1946
            ],
            [
                1946,
                2002
            ],
            [
                2002,
                2009
            ],
            [
                2009,
                2015
            ],
            [
                2015,
                2164
            ],
            [
                2164,
                2213
            ],
            [
                2213,
                2314
            ],
            [
                2314,
                2840
            ],
            [
                2840,
                2965
            ],
            [
                2965,
                2990
            ],
            [
                2990,
                3039
            ],
            [
                3039,
                3062
            ],
            [
                3062,
                3077
            ],
            [
                3077,
                3091
            ],
            [
                3091,
                3107
            ],
            [
                3107,
                3154
            ],
            [
                3154,
                3187
            ],
            [
                3187,
                3287
            ],
            [
                3287,
                3336
            ],
            [
                3336,
                3374
            ],
            [
                3374,
                3467
            ],
            [
                3467,
                3484
            ],
            [
                3484,
                3525
            ],
            [
                3525,
                3669
            ],
            [
                3669,
                3911
            ],
            [
                3911,
                4045
            ],
            [
                4045,
                4095
            ],
            [
                4095,
                4444
            ],
            [
                4444,
                4466
            ],
            [
                4466,
                4487
            ],
            [
                4487,
                4498
            ],
            [
                4498,
                4527
            ],
            [
                4527,
                4642
            ],
            [
                4642,
                5483
            ],
            [
                5483,
                5796
            ],
            [
                5796,
                6060
            ],
            [
                6060,
                6325
            ],
            [
                6325,
                6414
            ],
            [
                6414,
                6894
            ],
            [
                6894,
                7595
            ],
            [
                7595,
                7631
            ],
            [
                7631,
                7723
            ],
            [
                7723,
                7928
            ],
            [
                7928,
                7974
            ],
            [
                7974,
                8779
            ],
            [
                8779,
                9114
            ],
            [
                9114,
                9405
            ],
            [
                9405,
                9733
            ],
            [
                9733,
                10192
            ],
            [
                10192,
                10347
            ],
            [
                10347,
                10500
            ],
            [
                10500,
                10720
            ],
            [
                10720,
                11779
            ],
            [
                11779,
                11879
            ],
            [
                11879,
                12247
            ],
            [
                12247,
                12264
            ],
            [
                12264,
                12274
            ],
            [
                12274,
                12352
            ],
            [
                12352,
                12582
            ],
            [
                12582,
                12736
            ],
            [
                12736,
                13439
            ],
            [
                13439,
                13510
            ],
            [
                13510,
                13730
            ],
            [
                13730,
                13764
            ],
            [
                13764,
                13877
            ],
            [
                13877,
                13923
            ],
            [
                13923,
                13951
            ],
            [
                13951,
                13979
            ],
            [
                13979,
                14038
            ],
            [
                14038,
                14431
            ],
            [
                14431,
                14487
            ],
            [
                14487,
                14736
            ],
            [
                14736,
                15173
            ],
            [
                15173,
                15191
            ],
            [
                15191,
                15229
            ],
            [
                15229,
                15278
            ],
            [
                15278,
                15349
            ],
            [
                15349,
                15527
            ],
            [
                15527,
                15843
            ],
            [
                15843,
                15883
            ],
            [
                15883,
                16128
            ],
            [
                16128,
                16235
            ],
            [
                16235,
                16560
            ],
            [
                16560,
                17135
            ],
            [
                17135,
                17481
            ]
        ]
    },
    "abridged": {
        "text": "Henry Crawford had made up his mind by the next morning to give another fortnight to Mansfield. Having sent for his hunters, he looked round at his sister, and said, with a smile, \"How do you think I mean to amuse myself, Mary, on the days that I do not hunt?\"\n\"To walk and ride with me, to be sure.\"\n\"Not exactly, though I shall be happy to do both, but that would be all recreation, without the wholesome alloy of labour, and I do not like to eat the bread of idleness. No, my plan is to make Fanny Price in love with me.\"\n\"Fanny Price! Nonsense! No, no. You ought to be satisfied with her two cousins.\"\n\"But I cannot be satisfied without making a small hole in Fanny Price's heart. You do not seem properly aware of the wonderful improvement that has taken place in her looks. You see her every day, and therefore do not notice it; but I assure you she is quite a different creature from what she was in the autumn. She was then merely a quiet, modest girl, but she is now absolutely pretty. I used to think she had neither complexion nor countenance; but in that soft skin of hers, there is decided beauty; and I do not despair of her eyes being capable of expression when she has anything to express. And then, her air is so indescribably improved! She must be grown two inches since October.\"\n\"Phoo! phoo! This is only because there were no tall women to compare her with, and because she has got a new gown, and you never saw her so well dressed before. She is just what she was in October, believe me. The truth is, that she was the only girl in company for you to notice, and you must have a somebody. I have always thought her pretty enough; but as for this wonderful improvement, it may all be resolved into a better style of dress, and your having nobody else to look at. If you do set about a flirtation with her, it will proceed from nothing but your own idleness and folly.\"\nHer brother only smiled, and said, \"I do not quite know what to make of Miss Fanny. Is she solemn? Is she prudish? Why did she look so grave at me? I could hardly get her to speak. I never met with a girl who looked so grave on me! I must try to get the better of this. Her looks say, 'I will not like you, I am determined not to like you'; and I say she shall.\"\n\"Foolish fellow! So this is her attraction! It is her not caring about you, which produces all these charms! You must not make her really unhappy; a little love, perhaps, may animate her, but I will not have you plunge her deep, for she is a good little creature, and has a great deal of feeling.\"\n\"It can be but for a fortnight,\" said Henry; \"and if a fortnight can kill her, she must have a constitution which nothing could save. No, I will not do her any harm, dear little soul! I only want her to look kindly on me, to give me smiles, to keep a chair for me wherever we are, and be all animation when I take it; to think as I think, be interested in all my pleasures, and feel when I go away that she shall be never happy again. I want nothing more.\"\n\"Moderation itself!\" said Mary. \"I can have no scruples now.\"\nAnd without any farther remonstrance, she left Fanny to her fate, a fate which, had not Fanny's heart been guarded in a way unsuspected by Miss Crawford, might have been a little harder than she deserved; for although there doubtless are such unconquerable young ladies of eighteen as can never be persuaded into love by talent, attention, and flattery, I have no inclination to believe Fanny one of them, or to think that she could have escaped heart-whole from the courtship of such a man as Crawford, if her affection had not been engaged elsewhere. His continued attentions, adapted to the gentleness of her character, obliged her soon to dislike him less than formerly. She had not forgotten the past, and she thought as ill of him as ever; but she felt his powers: he was entertaining; and his manners were so improved that it was impossible not to be civil to him in return.\nA few days were enough to effect this; and then happy circumstances arose which disposed her to be pleased with everybody. William, the long absent and dearly loved brother, was in England. She had a letter from him, written as the ship came up the Channel; and when Crawford walked up with the newspaper in his hand, which he had hoped would bring the first tidings, he found her trembling with joy over this letter, and listening with a glowing countenance to the kind invitation to her brother which her uncle was dictating.\nIt was but the day before that Crawford had become aware of her having such a brother, or his being in such a ship; but he had hunted for information as to the probable date of the ship's return; and had found it in the newspaper the next morning. He proved, however, to be too late. All those fine first feelings, of which he hoped to be the exciter, were already given. But the kindness of his intention was thankfully acknowledged: for she was elevated beyond her usual timidity by her love for William.\nThis dear William would soon be amongst them. His reply came, fixing an early day for his arrival; and scarcely ten days later, Fanny found herself watching in the hall, in the lobby, on the stairs, for the first sound of the carriage which was to bring her a brother.\nIt came; and their meeting, and first minutes of exquisite feeling, had no interruption and no witnesses. This was exactly what Sir Thomas and Edmund had been conniving at, and why they both advised Mrs. Norris's staying where she was, instead of rushing out into the hall as soon as the noises of arrival reached them.\nWilliam and Fanny soon showed themselves; and Sir Thomas had the pleasure of receiving, in his protg, a young man of an open, pleasant countenance, and frank, unstudied, but respectful manners.\nIt was long before Fanny could recover from the agitating happiness of such an hour; it was some time even before her happiness could be said to make her happy, and she could talk to him as her heart had been yearning to do through many a past year. That time, however, did come, aided by an affection on his side as warm as her own, and much less encumbered by self-distrust. She was the first object of his love, a love which his bolder temper made it natural for him to express. On the morrow they were walking about together with true enjoyment, and every succeeding morrow renewed a tte--tte which Sir Thomas observed with complacency.\nExcept for the moments of delight caused by any instance of Edmund's consideration of her, Fanny had never known so much joy, as in this unchecked, equal, fearless intercourse with the brother and friend who was opening all his heart to her, telling her all his hopes, fears and plans respecting his promotion; who could give her information of the family of whom she very seldom heard; who was interested in all the comforts and little hardships of her home at Mansfield; ready to think of every member of that home as she directed, or differing only by more noisy abuse of their aunt Norris, and with whom (perhaps the dearest indulgence of all) all their earliest years could be gone over again, and every former pain and pleasure fondly recollected. It must be by a long and unnatural estrangement, if such precious memories shared by members of a family are outlived. Too often, alas! it is so. Fraternal love is at times worse than nothing. But with William and Fanny Price it was still in its prime and freshness.\nHenry Crawford was much struck with their mutual affection. He honoured the warm-hearted, blunt fondness of the young sailor, which led him to say, with his hands stretched towards Fanny's head, \"Do you know, I begin to like that queer fashion, though when the women at the Commissioner's at Gibraltar appeared in the same trim, I thought they were mad; but Fanny can reconcile me to anything\". He saw, with admiration, the glow of Fanny's cheek, the brightness of her eye, the absorbed attention, while her brother was describing the hazards of his life at sea.\nIt was a picture which Henry Crawford had moral taste enough to value. Fanny's attractions increased twofold; for he no longer doubted the capabilities of her heart. She had feeling, genuine feeling. It would be something to be loved by such a girl, to excite the first ardours of her unsophisticated mind! She interested him more than he had foreseen. A fortnight was not enough. His stay became indefinite.\nWilliam was often called on by his uncle to be the talker. His recitals were amusing to Sir Thomas, but the chief object in seeking them was to understand the reciter, to know the young man; and he listened to his clear, simple, spirited details with satisfaction, seeing in them the proof of good principles, professional knowledge, energy, courage, and cheerfulness. Young as he was, William had already seen a great deal. He had been in the Mediterranean and the West Indies; had been often taken on shore by the favour of his captain, and in seven years had known every danger which sea and war could offer.\nThough Mrs. Norris could fidget about the room, and disturb everybody in quest of thread or a shirt button in the midst of her nephew's account of a shipwreck, everybody else was attentive; and even Lady Bertram could not hear of such horrors without sometimes lifting her eyes from her work to say, \"How disagreeable! I wonder anybody can ever go to sea.\"\nTo Henry Crawford they gave a different feeling. He longed to have seen and done as much. His heart was warmed, his fancy fired, and he felt the highest respect for a lad who, before he was twenty, had gone through such hardships. The glory of heroism, of usefulness, of exertion, of endurance, made his own habits appear in shameful contrast; and he wished he had been a William Price, instead of what he was!\nThe wish was not lasting. He was roused from his regret by some inquiry from Edmund as to the next day's hunting; and he found it was as well to be a man of fortune with horses and grooms at his command. In one respect it was better, as it gave him the means of conferring a kindness to William, who expressed a wish to hunt. Crawford could mount him without inconvenience to himself, and with only some alarms to reason away in Fanny. She feared for William; by no means convinced by all that he could relate of his own horsemanship in various rough countries, that he was at all equal to the management of a high-fed hunter in an English fox-chase. Till he returned safe and well, she could not feel any gratitude to Mr. Crawford for lending the horse.\nWhen it was proved, however, to have done William no harm, she could reward the owner with a smile. With the greatest cordiality, Mr Crawford gave William the horse for his use so long as he remained in Northamptonshire.",
        "paragraph_chars": [
            [
                0,
                261
            ],
            [
                261,
                301
            ],
            [
                301,
                525
            ],
            [
                525,
                606
            ],
            [
                606,
                1299
            ],
            [
                1299,
                1890
            ],
            [
                1890,
                2253
            ],
            [
                2253,
                2551
            ],
            [
                2551,
                3008
            ],
            [
                3008,
                3070
            ],
            [
                3070,
                3952
            ],
            [
                3952,
                4480
            ],
            [
                4480,
                4987
            ],
            [
                4987,
                5256
            ],
            [
                5256,
                5576
            ],
            [
                5576,
                5770
            ],
            [
                5770,
                6411
            ],
            [
                6411,
                7432
            ],
            [
                7432,
                7995
            ],
            [
                7995,
                8404
            ],
            [
                8404,
                9016
            ],
            [
                9016,
                9373
            ],
            [
                9373,
                9784
            ],
            [
                9784,
                10539
            ],
            [
                10539,
                10759
            ]
        ],
        "segment_chars": [
            [
                0,
                96
            ],
            [
                96,
                261
            ],
            [
                261,
                301
            ],
            [
                301,
                472
            ],
            [
                472,
                525
            ],
            [
                525,
                539
            ],
            [
                539,
                549
            ],
            [
                549,
                557
            ],
            [
                557,
                606
            ],
            [
                606,
                685
            ],
            [
                685,
                780
            ],
            [
                780,
                919
            ],
            [
                919,
                995
            ],
            [
                995,
                1206
            ],
            [
                1206,
                1254
            ],
            [
                1254,
                1299
            ],
            [
                1299,
                1306
            ],
            [
                1306,
                1312
            ],
            [
                1312,
                1461
            ],
            [
                1461,
                1510
            ],
            [
                1510,
                1611
            ],
            [
                1611,
                1784
            ],
            [
                1784,
                1890
            ],
            [
                1890,
                1974
            ],
            [
                1974,
                1989
            ],
            [
                1989,
                2005
            ],
            [
                2005,
                2038
            ],
            [
                2038,
                2071
            ],
            [
                2071,
                2122
            ],
            [
                2122,
                2160
            ],
            [
                2160,
                2253
            ],
            [
                2253,
                2270
            ],
            [
                2270,
                2297
            ],
            [
                2297,
                2362
            ],
            [
                2362,
                2551
            ],
            [
                2551,
                2685
            ],
            [
                2685,
                2735
            ],
            [
                2735,
                2986
            ],
            [
                2986,
                3008
            ],
            [
                3008,
                3029
            ],
            [
                3029,
                3040
            ],
            [
                3040,
                3070
            ],
            [
                3070,
                3623
            ],
            [
                3623,
                3745
            ],
            [
                3745,
                3952
            ],
            [
                3952,
                4075
            ],
            [
                4075,
                4142
            ],
            [
                4142,
                4480
            ],
            [
                4480,
                4728
            ],
            [
                4728,
                4764
            ],
            [
                4764,
                4852
            ],
            [
                4852,
                4987
            ],
            [
                4987,
                5033
            ],
            [
                5033,
                5256
            ],
            [
                5256,
                5362
            ],
            [
                5362,
                5576
            ],
            [
                5576,
                5770
            ],
            [
                5770,
                6020
            ],
            [
                6020,
                6147
            ],
            [
                6147,
                6252
            ],
            [
                6252,
                6411
            ],
            [
                6411,
                7165
            ],
            [
                7165,
                7284
            ],
            [
                7284,
                7301
            ],
            [
                7301,
                7311
            ],
            [
                7311,
                7358
            ],
            [
                7358,
                7432
            ],
            [
                7432,
                7492
            ],
            [
                7492,
                7827
            ],
            [
                7827,
                7995
            ],
            [
                7995,
                8066
            ],
            [
                8066,
                8161
            ],
            [
                8161,
                8195
            ],
            [
                8195,
                8302
            ],
            [
                8302,
                8348
            ],
            [
                8348,
                8376
            ],
            [
                8376,
                8404
            ],
            [
                8404,
                8463
            ],
            [
                8463,
                8773
            ],
            [
                8773,
                8829
            ],
            [
                8829,
                9016
            ],
            [
                9016,
                9335
            ],
            [
                9335,
                9373
            ],
            [
                9373,
                9422
            ],
            [
                9422,
                9463
            ],
            [
                9463,
                9604
            ],
            [
                9604,
                9784
            ],
            [
                9784,
                9810
            ],
            [
                9810,
                9988
            ],
            [
                9988,
                10110
            ],
            [
                10110,
                10220
            ],
            [
                10220,
                10435
            ],
            [
                10435,
                10539
            ],
            [
                10539,
                10639
            ],
            [
                10639,
                10759
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                19,
                94
            ],
            [
                96,
                123
            ],
            [
                123,
                154
            ],
            [
                154,
                159
            ],
            [
                160,
                181
            ],
            [
                181,
                258
            ],
            [
                261,
                301
            ],
            [
                301,
                354
            ],
            [
                355,
                359
            ],
            [
                360,
                383
            ],
            [
                383,
                472
            ],
            [
                472,
                525
            ],
            [
                525,
                539
            ],
            [
                539,
                549
            ],
            [
                549,
                557
            ],
            [
                557,
                606
            ],
            [
                606,
                632
            ],
            [
                633,
                685
            ],
            [
                685,
                715
            ],
            [
                716,
                778
            ],
            [
                778,
                780
            ],
            [
                780,
                919
            ],
            [
                919,
                954
            ],
            [
                955,
                995
            ],
            [
                995,
                1085
            ],
            [
                1086,
                1114
            ],
            [
                1115,
                1134
            ],
            [
                1135,
                1143
            ],
            [
                1144,
                1171
            ],
            [
                1172,
                1206
            ],
            [
                1206,
                1223
            ],
            [
                1224,
                1254
            ],
            [
                1254,
                1282
            ],
            [
                1283,
                1299
            ],
            [
                1299,
                1306
            ],
            [
                1306,
                1312
            ],
            [
                1312,
                1461
            ],
            [
                1461,
                1510
            ],
            [
                1510,
                1611
            ],
            [
                1611,
                1643
            ],
            [
                1644,
                1650
            ],
            [
                1650,
                1677
            ],
            [
                1678,
                1690
            ],
            [
                1691,
                1782
            ],
            [
                1782,
                1783
            ],
            [
                1784,
                1826
            ],
            [
                1827,
                1829
            ],
            [
                1830,
                1834
            ],
            [
                1843,
                1847
            ],
            [
                1856,
                1890
            ],
            [
                1890,
                1901
            ],
            [
                1902,
                1906
            ],
            [
                1913,
                1918
            ],
            [
                1919,
                1974
            ],
            [
                1974,
                1989
            ],
            [
                1989,
                2005
            ],
            [
                2005,
                2016
            ],
            [
                2017,
                2038
            ],
            [
                2038,
                2071
            ],
            [
                2073,
                2122
            ],
            [
                2122,
                2160
            ],
            [
                2160,
                2253
            ],
            [
                2253,
                2270
            ],
            [
                2270,
                2295
            ],
            [
                2295,
                2297
            ],
            [
                2297,
                2302
            ],
            [
                2303,
                2334
            ],
            [
                2335,
                2360
            ],
            [
                2360,
                2362
            ],
            [
                2362,
                2365
            ],
            [
                2371,
                2374
            ],
            [
                2380,
                2401
            ],
            [
                2402,
                2408
            ],
            [
                2409,
                2435
            ],
            [
                2436,
                2439
            ],
            [
                2439,
                2492
            ],
            [
                2493,
                2494
            ],
            [
                2495,
                2499
            ],
            [
                2500,
                2515
            ],
            [
                2515,
                2551
            ],
            [
                2551,
                2685
            ],
            [
                2685,
                2735
            ],
            [
                2735,
                2790
            ],
            [
                2790,
                2814
            ],
            [
                2815,
                2867
            ],
            [
                2867,
                2913
            ],
            [
                2914,
                2923
            ],
            [
                2923,
                2986
            ],
            [
                2986,
                3008
            ],
            [
                3008,
                3029
            ],
            [
                3029,
                3040
            ],
            [
                3040,
                3067
            ],
            [
                3070,
                3081
            ],
            [
                3082,
                3351
            ],
            [
                3352,
                3354
            ],
            [
                3355,
                3358
            ],
            [
                3359,
                3364
            ],
            [
                3365,
                3387
            ],
            [
                3388,
                3390
            ],
            [
                3391,
                3397
            ],
            [
                3397,
                3422
            ],
            [
                3422,
                3492
            ],
            [
                3493,
                3546
            ],
            [
                3547,
                3573
            ],
            [
                3577,
                3590
            ],
            [
                3591,
                3598
            ],
            [
                3599,
                3623
            ],
            [
                3623,
                3647
            ],
            [
                3647,
                3648
            ],
            [
                3657,
                3674
            ],
            [
                3675,
                3691
            ],
            [
                3691,
                3692
            ],
            [
                3701,
                3704
            ],
            [
                3705,
                3745
            ],
            [
                3745,
                3752
            ],
            [
                3757,
                3894
            ],
            [
                3895,
                3952
            ],
            [
                3952,
                3953
            ],
            [
                3954,
                3994
            ],
            [
                4006,
                4031
            ],
            [
                4041,
                4075
            ],
            [
                4075,
                4083
            ],
            [
                4084,
                4087
            ],
            [
                4088,
                4140
            ],
            [
                4140,
                4142
            ],
            [
                4142,
                4167
            ],
            [
                4167,
                4196
            ],
            [
                4197,
                4200
            ],
            [
                4201,
                4208
            ],
            [
                4208,
                4398
            ],
            [
                4399,
                4433
            ],
            [
                4449,
                4468
            ],
            [
                4469,
                4478
            ],
            [
                4478,
                4480
            ],
            [
                4480,
                4523
            ],
            [
                4524,
                4530
            ],
            [
                4531,
                4594
            ],
            [
                4596,
                4599
            ],
            [
                4603,
                4606
            ],
            [
                4614,
                4648
            ],
            [
                4654,
                4660
            ],
            [
                4661,
                4665
            ],
            [
                4665,
                4674
            ],
            [
                4676,
                4679
            ],
            [
                4680,
                4683
            ],
            [
                4693,
                4699
            ],
            [
                4710,
                4726
            ],
            [
                4726,
                4728
            ],
            [
                4728,
                4764
            ],
            [
                4764,
                4806
            ],
            [
                4807,
                4852
            ],
            [
                4852,
                4855
            ],
            [
                4856,
                4885
            ],
            [
                4886,
                4914
            ],
            [
                4915,
                4942
            ],
            [
                4943,
                4946
            ],
            [
                4953,
                4961
            ],
            [
                4962,
                4964
            ],
            [
                4965,
                4987
            ],
            [
                4987,
                5033
            ],
            [
                5033,
                5036
            ],
            [
                5037,
                5042
            ],
            [
                5043,
                5047
            ],
            [
                5047,
                5055
            ],
            [
                5056,
                5058
            ],
            [
                5059,
                5084
            ],
            [
                5084,
                5107
            ],
            [
                5113,
                5114
            ],
            [
                5115,
                5120
            ],
            [
                5121,
                5134
            ],
            [
                5135,
                5256
            ],
            [
                5256,
                5263
            ],
            [
                5263,
                5268
            ],
            [
                5275,
                5283
            ],
            [
                5284,
                5287
            ],
            [
                5288,
                5322
            ],
            [
                5322,
                5323
            ],
            [
                5324,
                5360
            ],
            [
                5360,
                5362
            ],
            [
                5362,
                5414
            ],
            [
                5415,
                5428
            ],
            [
                5437,
                5468
            ],
            [
                5477,
                5553
            ],
            [
                5554,
                5576
            ],
            [
                5576,
                5598
            ],
            [
                5606,
                5677
            ],
            [
                5678,
                5749
            ],
            [
                5750,
                5768
            ],
            [
                5768,
                5770
            ],
            [
                5770,
                5853
            ],
            [
                5853,
                5930
            ],
            [
                5931,
                5944
            ],
            [
                5945,
                5956
            ],
            [
                5957,
                6020
            ],
            [
                6020,
                6043
            ],
            [
                6044,
                6049
            ],
            [
                6056,
                6131
            ],
            [
                6132,
                6147
            ],
            [
                6147,
                6184
            ],
            [
                6185,
                6201
            ],
            [
                6202,
                6215
            ],
            [
                6216,
                6223
            ],
            [
                6224,
                6250
            ],
            [
                6250,
                6252
            ],
            [
                6252,
                6357
            ],
            [
                6358,
                6366
            ],
            [
                6367,
                6383
            ],
            [
                6393,
                6409
            ],
            [
                6409,
                6411
            ],
            [
                6411,
                6417
            ],
            [
                6418,
                6421
            ],
            [
                6422,
                6436
            ],
            [
                6437,
                6444
            ],
            [
                6455,
                6458
            ],
            [
                6459,
                6500
            ],
            [
                6500,
                6531
            ],
            [
                6535,
                6678
            ],
            [
                6678,
                6679
            ],
            [
                6680,
                6685
            ],
            [
                6686,
                6689
            ],
            [
                6690,
                6695
            ],
            [
                6696,
                6706
            ],
            [
                6711,
                6740
            ],
            [
                6741,
                6759
            ],
            [
                6767,
                6840
            ],
            [
                6841,
                6965
            ],
            [
                6966,
                7053
            ],
            [
                7054,
                7057
            ],
            [
                7057,
                7062
            ],
            [
                7063,
                7126
            ],
            [
                7127,
                7144
            ],
            [
                7145,
                7149
            ],
            [
                7149,
                7151
            ],
            [
                7163,
                7165
            ],
            [
                7165,
                7213
            ],
            [
                7214,
                7230
            ],
            [
                7247,
                7249
            ],
            [
                7258,
                7260
            ],
            [
                7261,
                7262
            ],
            [
                7263,
                7269
            ],
            [
                7270,
                7273
            ],
            [
                7274,
                7284
            ],
            [
                7284,
                7301
            ],
            [
                7301,
                7311
            ],
            [
                7311,
                7325
            ],
            [
                7326,
                7331
            ],
            [
                7338,
                7358
            ],
            [
                7358,
                7403
            ],
            [
                7404,
                7406
            ],
            [
                7407,
                7430
            ],
            [
                7430,
                7432
            ],
            [
                7432,
                7450
            ],
            [
                7451,
                7467
            ],
            [
                7481,
                7490
            ],
            [
                7490,
                7492
            ],
            [
                7492,
                7675
            ],
            [
                7675,
                7688
            ],
            [
                7689,
                7692
            ],
            [
                7693,
                7733
            ],
            [
                7734,
                7824
            ],
            [
                7830,
                7839
            ],
            [
                7840,
                7909
            ],
            [
                7910,
                7962
            ],
            [
                7963,
                7966
            ],
            [
                7967,
                7974
            ],
            [
                7975,
                7977
            ],
            [
                7987,
                7993
            ],
            [
                7993,
                7995
            ],
            [
                7995,
                8066
            ],
            [
                8066,
                8095
            ],
            [
                8096,
                8108
            ],
            [
                8109,
                8111
            ],
            [
                8112,
                8121
            ],
            [
                8130,
                8161
            ],
            [
                8161,
                8195
            ],
            [
                8195,
                8279
            ],
            [
                8280,
                8302
            ],
            [
                8302,
                8348
            ],
            [
                8348,
                8376
            ],
            [
                8376,
                8404
            ],
            [
                8404,
                8463
            ],
            [
                8463,
                8488
            ],
            [
                8489,
                8593
            ],
            [
                8593,
                8654
            ],
            [
                8655,
                8771
            ],
            [
                8771,
                8773
            ],
            [
                8773,
                8829
            ],
            [
                8829,
                8861
            ],
            [
                8866,
                8881
            ],
            [
                8881,
                8949
            ],
            [
                8950,
                8977
            ],
            [
                8978,
                9002
            ],
            [
                9003,
                9015
            ],
            [
                9016,
                9097
            ],
            [
                9098,
                9109
            ],
            [
                9110,
                9122
            ],
            [
                9123,
                9174
            ],
            [
                9174,
                9258
            ],
            [
                9259,
                9317
            ],
            [
                9333,
                9335
            ],
            [
                9335,
                9373
            ],
            [
                9373,
                9422
            ],
            [
                9422,
                9439
            ],
            [
                9440,
                9453
            ],
            [
                9454,
                9463
            ],
            [
                9463,
                9592
            ],
            [
                9593,
                9602
            ],
            [
                9602,
                9604
            ],
            [
                9604,
                9687
            ],
            [
                9688,
                9759
            ],
            [
                9760,
                9784
            ],
            [
                9784,
                9796
            ],
            [
                9801,
                9810
            ],
            [
                9810,
                9828
            ],
            [
                9829,
                9832
            ],
            [
                9833,
                9839
            ],
            [
                9840,
                9873
            ],
            [
                9874,
                9948
            ],
            [
                9949,
                9988
            ],
            [
                9988,
                10067
            ],
            [
                10068,
                10070
            ],
            [
                10108,
                10110
            ],
            [
                10114,
                10142
            ],
            [
                10143,
                10182
            ],
            [
                10183,
                10220
            ],
            [
                10220,
                10328
            ],
            [
                10329,
                10334
            ],
            [
                10335,
                10344
            ],
            [
                10344,
                10433
            ],
            [
                10433,
                10434
            ],
            [
                10435,
                10466
            ],
            [
                10467,
                10470
            ],
            [
                10471,
                10476
            ],
            [
                10481,
                10489
            ],
            [
                10500,
                10537
            ],
            [
                10539,
                10607
            ],
            [
                10608,
                10637
            ],
            [
                10639,
                10668
            ],
            [
                10694,
                10697
            ],
            [
                10708,
                10715
            ],
            [
                10716,
                10759
            ]
        ],
        "row_chars": [
            [
                0,
                261
            ],
            [
                261,
                261
            ],
            [
                261,
                301
            ],
            [
                301,
                472
            ],
            [
                472,
                525
            ],
            [
                525,
                539
            ],
            [
                539,
                549
            ],
            [
                549,
                557
            ],
            [
                557,
                606
            ],
            [
                606,
                685
            ],
            [
                685,
                780
            ],
            [
                780,
                919
            ],
            [
                919,
                995
            ],
            [
                995,
                1206
            ],
            [
                1206,
                1254
            ],
            [
                1254,
                1299
            ],
            [
                1299,
                1306
            ],
            [
                1306,
                1312
            ],
            [
                1312,
                1461
            ],
            [
                1461,
                1510
            ],
            [
                1510,
                1611
            ],
            [
                1611,
                1890
            ],
            [
                1890,
                1974
            ],
            [
                1974,
                1974
            ],
            [
                1974,
                1974
            ],
            [
                1974,
                1974
            ],
            [
                1974,
                1989
            ],
            [
                1989,
                1989
            ],
            [
                1989,
                2005
            ],
            [
                2005,
                2038
            ],
            [
                2038,
                2071
            ],
            [
                2071,
                2071
            ],
            [
                2071,
                2122
            ],
            [
                2122,
                2160
            ],
            [
                2160,
                2253
            ],
            [
                2253,
                2270
            ],
            [
                2270,
                2297
            ],
            [
                2297,
                2362
            ],
            [
                2362,
                2551
            ],
            [
                2551,
                2685
            ],
            [
                2685,
                2735
            ],
            [
                2735,
                2986
            ],
            [
                2986,
                3008
            ],
            [
                3008,
                3029
            ],
            [
                3029,
                3040
            ],
            [
                3040,
                3070
            ],
            [
                3070,
                3070
            ],
            [
                3070,
                3623
            ],
            [
                3623,
                3745
            ],
            [
                3745,
                3952
            ],
            [
                3952,
                4075
            ],
            [
                4075,
                4142
            ],
            [
                4142,
                4480
            ],
            [
                4480,
                4728
            ],
            [
                4728,
                4764
            ],
            [
                4764,
                4852
            ],
            [
                4852,
                4987
            ],
            [
                4987,
                5033
            ],
            [
                5033,
                5256
            ],
            [
                5256,
                5362
            ],
            [
                5362,
                5576
            ],
            [
                5576,
                5770
            ],
            [
                5770,
                6020
            ],
            [
                6020,
                6147
            ],
            [
                6147,
                6252
            ],
            [
                6252,
                6411
            ],
            [
                6411,
                7165
            ],
            [
                7165,
                7165
            ],
            [
                7165,
                7284
            ],
            [
                7284,
                7301
            ],
            [
                7301,
                7311
            ],
            [
                7311,
                7358
            ],
            [
                7358,
                7432
            ],
            [
                7432,
                7492
            ],
            [
                7492,
                7995
            ],
            [
                7995,
                8066
            ],
            [
                8066,
                8161
            ],
            [
                8161,
                8195
            ],
            [
                8195,
                8302
            ],
            [
                8302,
                8348
            ],
            [
                8348,
                8376
            ],
            [
                8376,
                8404
            ],
            [
                8404,
                8463
            ],
            [
                8463,
                8773
            ],
            [
                8773,
                8829
            ],
            [
                8829,
                9016
            ],
            [
                9016,
                9335
            ],
            [
                9335,
                9335
            ],
            [
                9335,
                9373
            ],
            [
                9373,
                9422
            ],
            [
                9422,
                9463
            ],
            [
                9463,
                9604
            ],
            [
                9604,
                9784
            ],
            [
                9784,
                9810
            ],
            [
                9810,
                9988
            ],
            [
                9988,
                10110
            ],
            [
                10110,
                10220
            ],
            [
                10220,
                10539
            ],
            [
                10539,
                10759
            ]
        ]
    }
}