{
    "original": {
        "text": "The intercourse of the two families was at this period more nearly restored to what it had been in the autumn, than any member of the old intimacy had thought ever likely to be again. The return of Henry Crawford, and the arrival of William Price, had much to do with it, but much was still owing to Sir Thomas's more than toleration of the neighbourly attempts at the Parsonage. His mind, now disengaged from the cares which had pressed on him at first, was at leisure to find the Grants and their young inmates really worth visiting; and though infinitely above scheming or contriving for any the most advantageous matrimonial establishment that could be among the apparent possibilities of any one most dear to him, and disdaining even as a littleness the being quick-sighted on such points, he could not avoid perceiving, in a grand and careless way, that Mr. Crawford was somewhat distinguishing his niece-nor perhaps refrain (though unconsciously) from giving a more willing assent to invitations on that account.\nHis readiness, however, in agreeing to dine at the Parsonage, when the general invitation was at last hazarded, after many debates and many doubts as to whether it were worth while, \"because Sir Thomas seemed so ill inclined, and Lady Bertram was so indolent!\" proceeded from good-breeding and goodwill alone, and had nothing to do with Mr. Crawford, but as being one in an agreeable group: for it was in the course of that very visit that he first began to think that any one in the habit of such idle observations _would_ _have_ _thought_ that Mr. Crawford was the admirer of Fanny Price.\nThe meeting was generally felt to be a pleasant one, being composed in a good proportion of those who would talk and those who would listen; and the dinner itself was elegant and plentiful, according to the usual style of the Grants, and too much according to the usual habits of all to raise any emotion except in Mrs. Norris, who could never behold either the wide table or the number of dishes on it with patience, and who did always contrive to experience some evil from the passing of the servants behind her chair, and to bring away some fresh conviction of its being impossible among so many dishes but that some must be cold.\nIn the evening it was found, according to the predetermination of Mrs. Grant and her sister, that after making up the whist-table there would remain sufficient for a round game, and everybody being as perfectly complying and without a choice as on such occasions they always are, speculation was decided on almost as soon as whist; and Lady Bertram soon found herself in the critical situation of being applied to for her own choice between the games, and being required either to draw a card for whist or not. She hesitated. Luckily Sir Thomas was at hand.\n\"What shall I do, Sir Thomas? Whist and speculation; which will amuse me most?\"\nSir Thomas, after a moment's thought, recommended speculation. He was a whist player himself, and perhaps might feel that it would not much amuse him to have her for a partner.\n\"Very well,\" was her ladyship's contented answer; \"then speculation, if you please, Mrs. Grant. I know nothing about it, but Fanny must teach me.\"\nHere Fanny interposed, however, with anxious protestations of her own equal ignorance; she had never played the game nor seen it played in her life; and Lady Bertram felt a moment's indecision again; but upon everybody's assuring her that nothing could be so easy, that it was the easiest game on the cards, and Henry Crawford's stepping forward with a most earnest request to be allowed to sit between her ladyship and Miss Price, and teach them both, it was so settled; and Sir Thomas, Mrs. Norris, and Dr. and Mrs. Grant being seated at the table of prime intellectual state and dignity, the remaining six, under Miss Crawford's direction, were arranged round the other. It was a fine arrangement for Henry Crawford, who was close to Fanny, and with his hands full of business, having two persons' cards to manage as well as his own; for though it was impossible for Fanny not to feel herself mistress of the rules of the game in three minutes, he had yet to inspirit her play, sharpen her avarice, and harden her heart, which, especially in any competition with William, was a work of some difficulty; and as for Lady Bertram, he must continue in charge of all her fame and fortune through the whole evening; and if quick enough to keep her from looking at her cards when the deal began, must direct her in whatever was to be done with them to the end of it.\nHe was in high spirits, doing everything with happy ease, and preeminent in all the lively turns, quick resources, and playful impudence that could do honour to the game; and the round table was altogether a very comfortable contrast to the steady sobriety and orderly silence of the other.\nTwice had Sir Thomas inquired into the enjoyment and success of his lady, but in vain; no pause was long enough for the time his measured manner needed; and very little of her state could be known till Mrs. Grant was able, at the end of the first rubber, to go to her and pay her compliments.\n\"I hope your ladyship is pleased with the game.\"\n\"Oh dear, yes! very entertaining indeed. A very odd game. I do not know what it is all about. I am never to see my cards; and Mr. Crawford does all the rest.\"\n\"Bertram,\" said Crawford, some time afterwards, taking the opportunity of a little languor in the game, \"I have never told you what happened to me yesterday in my ride home.\" They had been hunting together, and were in the midst of a good run, and at some distance from Mansfield, when his horse being found to have flung a shoe, Henry Crawford had been obliged to give up, and make the best of his way back. \"I told you I lost my way after passing that old farmhouse with the yew-trees, because I can never bear to ask; but I have not told you that, with my usual luck-for I never do wrong without gaining by it-I found myself in due time in the very place which I had a curiosity to see. I was suddenly, upon turning the corner of a steepish downy field, in the midst of a retired little village between gently rising hills; a small stream before me to be forded, a church standing on a sort of knoll to my right-which church was strikingly large and handsome for the place, and not a gentleman or half a gentleman's house to be seen excepting one-to be presumed the Parsonage-within a stone's throw of the said knoll and church. I found myself, in short, in Thornton Lacey.\"\n\"It sounds like it,\" said Edmund; \"but which way did you turn after passing Sewell's farm?\"\n\"I answer no such irrelevant and insidious questions; though were I to answer all that you could put in the course of an hour, you would never be able to prove that it was _not_ Thornton Lacey-for such it certainly was.\"\n\"You inquired, then?\"\n\"No, I never inquire. But I _told_ a man mending a hedge that it was Thornton Lacey, and he agreed to it.\"\n\"You have a good memory. I had forgotten having ever told you half so much of the place.\"\nThornton Lacey was the name of his impending living, as Miss Crawford well knew; and her interest in a negotiation for William Price's knave increased.\n\"Well,\" continued Edmund, \"and how did you like what you saw?\"\n\"Very much indeed. You are a lucky fellow. There will be work for five summers at least before the place is liveable.\"\n\"No, no, not so bad as that. The farmyard must be moved, I grant you; but I am not aware of anything else. The house is by no means bad, and when the yard is removed, there may be a very tolerable approach to it.\"\n\"The farmyard must be cleared away entirely, and planted up to shut out the blacksmith's shop. The house must be turned to front the east instead of the north-the entrance and principal rooms, I mean, must be on that side, where the view is really very pretty; I am sure it may be done. And _there_ must be your approach, through what is at present the garden. You must make a new garden at what is now the back of the house; which will be giving it the best aspect in the world, sloping to the south-east. The ground seems precisely formed for it. I rode fifty yards up the lane, between the church and the house, in order to look about me; and saw how it might all be. Nothing can be easier. The meadows beyond what _will_ _be_ the garden, as well as what now _is_, sweeping round from the lane I stood in to the north-east, that is, to the principal road through the village, must be all laid together, of course; very pretty meadows they are, finely sprinkled with timber. They belong to the living, I suppose; if not, you must purchase them. Then the stream-something must be done with the stream; but I could not quite determine what. I had two or three ideas.\"\n\"And I have two or three ideas also,\" said Edmund, \"and one of them is, that very little of your plan for Thornton Lacey will ever be put in practice. I must be satisfied with rather less ornament and beauty. I think the house and premises may be made comfortable, and given the air of a gentleman's residence, without any very heavy expense, and that must suffice me; and, I hope, may suffice all who care about me.\"\nMiss Crawford, a little suspicious and resentful of a certain tone of voice, and a certain half-look attending the last expression of his hope, made a hasty finish of her dealings with William Price; and securing his knave at an exorbitant rate, exclaimed, \"There, I will stake my last like a woman of spirit. No cold prudence for me. I am not born to sit still and do nothing. If I lose the game, it shall not be from not striving for it.\"\nThe game was hers, and only did not pay her for what she had given to secure it. Another deal proceeded, and Crawford began again about Thornton Lacey.\n\"My plan may not be the best possible: I had not many minutes to form it in; but you must do a good deal. The place deserves it, and you will find yourself not satisfied with much less than it is capable of. (Excuse me, your ladyship must not see your cards. There, let them lie just before you.) The place deserves it, Bertram. You talk of giving it the air of a gentleman's residence. _That_ will be done by the removal of the farmyard; for, independent of that terrible nuisance, I never saw a house of the kind which had in itself so much the air of a gentleman's residence, so much the look of a something above a mere parsonage-house-above the expenditure of a few hundreds a year. It is not a scrambling collection of low single rooms, with as many roofs as windows; it is not cramped into the vulgar compactness of a square farmhouse: it is a solid, roomy, mansion-like looking house, such as one might suppose a respectable old country family had lived in from generation to generation, through two centuries at least, and were now spending from two to three thousand a year in.\" Miss Crawford listened, and Edmund agreed to this. \"The air of a gentleman's residence, therefore, you cannot but give it, if you do anything. But it is capable of much more. (Let me see, Mary; Lady Bertram bids a dozen for that queen; no, no, a dozen is more than it is worth. Lady Bertram does not bid a dozen. She will have nothing to say to it. Go on, go on.) By some such improvements as I have suggested (I do not really require you to proceed upon my plan, though, by the bye, I doubt anybody's striking out a better) you may give it a higher character. You may raise it into a _place_. From being the mere gentleman's residence, it becomes, by judicious improvement, the residence of a man of education, taste, modern manners, good connexions. All this may be stamped on it; and that house receive such an air as to make its owner be set down as the great landholder of the parish by every creature travelling the road; especially as there is no real squire's house to dispute the point-a circumstance, between ourselves, to enhance the value of such a situation in point of privilege and independence beyond all calculation. _You_ think with me, I hope\" (turning with a softened voice to Fanny). \"Have you ever seen the place?\"\nFanny gave a quick negative, and tried to hide her interest in the subject by an eager attention to her brother, who was driving as hard a bargain, and imposing on her as much as he could; but Crawford pursued with \"No, no, you must not part with the queen. You have bought her too dearly, and your brother does not offer half her value. No, no, sir, hands off, hands off. Your sister does not part with the queen. She is quite determined. The game will be yours,\" turning to her again; \"it will certainly be yours.\"\n\"And Fanny had much rather it were William's,\" said Edmund, smiling at her. \"Poor Fanny! not allowed to cheat herself as she wishes!\"\n\"Mr. Bertram,\" said Miss Crawford, a few minutes afterwards, \"you know Henry to be such a capital improver, that you cannot possibly engage in anything of the sort at Thornton Lacey without accepting his help. Only think how useful he was at Sotherton! Only think what grand things were produced there by our all going with him one hot day in August to drive about the grounds, and see his genius take fire. There we went, and there we came home again; and what was done there is not to be told!\"\nFanny's eyes were turned on Crawford for a moment with an expression more than grave-even reproachful; but on catching his, were instantly withdrawn. With something of consciousness he shook his head at his sister, and laughingly replied, \"I cannot say there was much done at Sotherton; but it was a hot day, and we were all walking after each other, and bewildered.\" As soon as a general buzz gave him shelter, he added, in a low voice, directed solely at Fanny, \"I should be sorry to have my powers of _planning_ judged of by the day at Sotherton. I see things very differently now. Do not think of me as I appeared then.\"\nSotherton was a word to catch Mrs. Norris, and being just then in the happy leisure which followed securing the odd trick by Sir Thomas's capital play and her own against Dr. and Mrs. Grant's great hands, she called out, in high good-humour, \"Sotherton! Yes, that is a place, indeed, and we had a charming day there. William, you are quite out of luck; but the next time you come, I hope dear Mr. and Mrs. Rushworth will be at home, and I am sure I can answer for your being kindly received by both. Your cousins are not of a sort to forget their relations, and Mr. Rushworth is a most amiable man. They are at Brighton now, you know; in one of the best houses there, as Mr. Rushworth's fine fortune gives them a right to be. I do not exactly know the distance, but when you get back to Portsmouth, if it is not very far off, you ought to go over and pay your respects to them; and I could send a little parcel by you that I want to get conveyed to your cousins.\"\n\"I should be very happy, aunt; but Brighton is almost by Beachey Head; and if I could get so far, I could not expect to be welcome in such a smart place as that-poor scrubby midshipman as I am.\"\nMrs. Norris was beginning an eager assurance of the affability he might depend on, when she was stopped by Sir Thomas's saying with authority, \"I do not advise your going to Brighton, William, as I trust you may soon have more convenient opportunities of meeting; but my daughters would be happy to see their cousins anywhere; and you will find Mr. Rushworth most sincerely disposed to regard all the connexions of our family as his own.\"\n\"I would rather find him private secretary to the First Lord than anything else,\" was William's only answer, in an undervoice, not meant to reach far, and the subject dropped.\nAs yet Sir Thomas had seen nothing to remark in Mr. Crawford's behaviour; but when the whist-table broke up at the end of the second rubber, and leaving Dr. Grant and Mrs. Norris to dispute over their last play, he became a looker-on at the other, he found his niece the object of attentions, or rather of professions, of a somewhat pointed character.\nHenry Crawford was in the first glow of another scheme about Thornton Lacey; and not being able to catch Edmund's ear, was detailing it to his fair neighbour with a look of considerable earnestness. His scheme was to rent the house himself the following winter, that he might have a home of his own in that neighbourhood; and it was not merely for the use of it in the hunting-season (as he was then telling her), though _that_ consideration had certainly some weight, feeling as he did that, in spite of all Dr. Grant's very great kindness, it was impossible for him and his horses to be accommodated where they now were without material inconvenience; but his attachment to that neighbourhood did not depend upon one amusement or one season of the year: he had set his heart upon having a something there that he could come to at any time, a little homestall at his command, where all the holidays of his year might be spent, and he might find himself continuing, improving, and _perfecting_ that friendship and intimacy with the Mansfield Park family which was increasing in value to him every day. Sir Thomas heard and was not offended. There was no want of respect in the young man's address; and Fanny's reception of it was so proper and modest, so calm and uninviting, that he had nothing to censure in her. She said little, assented only here and there, and betrayed no inclination either of appropriating any part of the compliment to herself, or of strengthening his views in favour of Northamptonshire. Finding by whom he was observed, Henry Crawford addressed himself on the same subject to Sir Thomas, in a more everyday tone, but still with feeling.\n\"I want to be your neighbour, Sir Thomas, as you have, perhaps, heard me telling Miss Price. May I hope for your acquiescence, and for your not influencing your son against such a tenant?\"\nSir Thomas, politely bowing, replied, \"It is the only way, sir, in which I could _not_ wish you established as a permanent neighbour; but I hope, and believe, that Edmund will occupy his own house at Thornton Lacey. Edmund, am I saying too much?\"\nEdmund, on this appeal, had first to hear what was going on; but, on understanding the question, was at no loss for an answer.\n\"Certainly, sir, I have no idea but of residence. But, Crawford, though I refuse you as a tenant, come to me as a friend. Consider the house as half your own every winter, and we will add to the stables on your own improved plan, and with all the improvements of your improved plan that may occur to you this spring.\"\n\"We shall be the losers,\" continued Sir Thomas. \"His going, though only eight miles, will be an unwelcome contraction of our family circle; but I should have been deeply mortified if any son of mine could reconcile himself to doing less. It is perfectly natural that you should not have thought much on the subject, Mr. Crawford. But a parish has wants and claims which can be known only by a clergyman constantly resident, and which no proxy can be capable of satisfying to the same extent. Edmund might, in the common phrase, do the duty of Thornton, that is, he might read prayers and preach, without giving up Mansfield Park: he might ride over every Sunday, to a house nominally inhabited, and go through divine service; he might be the clergyman of Thornton Lacey every seventh day, for three or four hours, if that would content him. But it will not. He knows that human nature needs more lessons than a weekly sermon can convey; and that if he does not live among his parishioners, and prove himself, by constant attention, their well-wisher and friend, he does very little either for their good or his own.\"\nMr. Crawford bowed his acquiescence.\n\"I repeat again,\" added Sir Thomas, \"that Thornton Lacey is the only house in the neighbourhood in which I should _not_ be happy to wait on Mr. Crawford as occupier.\"\nMr. Crawford bowed his thanks.\n\"Sir Thomas,\" said Edmund, \"undoubtedly understands the duty of a parish priest. We must hope his son may prove that _he_ knows it too.\"\nWhatever effect Sir Thomas's little harangue might really produce on Mr. Crawford, it raised some awkward sensations in two of the others, two of his most attentive listeners-Miss Crawford and Fanny. One of whom, having never before understood that Thornton was so soon and so completely to be his home, was pondering with downcast eyes on what it would be _not_ to see Edmund every day; and the other, startled from the agreeable fancies she had been previously indulging on the strength of her brother's description, no longer able, in the picture she had been forming of a future Thornton, to shut out the church, sink the clergyman, and see only the respectable, elegant, modernised, and occasional residence of a man of independent fortune, was considering Sir Thomas, with decided ill-will, as the destroyer of all this, and suffering the more from that involuntary forbearance which his character and manner commanded, and from not daring to relieve herself by a single attempt at throwing ridicule on his cause.\nAll the agreeable of _her_ speculation was over for that hour. It was time to have done with cards, if sermons prevailed; and she was glad to find it necessary to come to a conclusion, and be able to refresh her spirits by a change of place and neighbour.\nThe chief of the party were now collected irregularly round the fire, and waiting the final break-up. William and Fanny were the most detached. They remained together at the otherwise deserted card-table, talking very comfortably, and not thinking of the rest, till some of the rest began to think of them. Henry Crawford's chair was the first to be given a direction towards them, and he sat silently observing them for a few minutes; himself, in the meanwhile, observed by Sir Thomas, who was standing in chat with Dr. Grant.\n\"This is the assembly night,\" said William. \"If I were at Portsmouth I should be at it, perhaps.\"\n\"But you do not wish yourself at Portsmouth, William?\"\n\"No, Fanny, that I do not. I shall have enough of Portsmouth and of dancing too, when I cannot have you. And I do not know that there would be any good in going to the assembly, for I might not get a partner. The Portsmouth girls turn up their noses at anybody who has not a commission. One might as well be nothing as a midshipman. One _is_ nothing, indeed. You remember the Gregorys; they are grown up amazing fine girls, but they will hardly speak to _me_, because Lucy is courted by a lieutenant.\"\n\"Oh! shame, shame! But never mind it, William\" (her own cheeks in a glow of indignation as she spoke). \"It is not worth minding. It is no reflection on _you_; it is no more than what the greatest admirals have all experienced, more or less, in their time. You must think of that, you must try to make up your mind to it as one of the hardships which fall to every sailor's share, like bad weather and hard living, only with this advantage, that there will be an end to it, that there will come a time when you will have nothing of that sort to endure. When you are a lieutenant! only think, William, when you are a lieutenant, how little you will care for any nonsense of this kind.\"\n\"I begin to think I shall never be a lieutenant, Fanny. Everybody gets made but me.\"\n\"Oh! my dear William, do not talk so; do not be so desponding. My uncle says nothing, but I am sure he will do everything in his power to get you made. He knows, as well as you do, of what consequence it is.\"\nShe was checked by the sight of her uncle much nearer to them than she had any suspicion of, and each found it necessary to talk of something else.\n\"Are you fond of dancing, Fanny?\"\n\"Yes, very; only I am soon tired.\"\n\"I should like to go to a ball with you and see you dance. Have you never any balls at Northampton? I should like to see you dance, and I'd dance with you if you _would_, for nobody would know who I was here, and I should like to be your partner once more. We used to jump about together many a time, did not we? when the hand-organ was in the street? I am a pretty good dancer in my way, but I dare say you are a better.\" And turning to his uncle, who was now close to them, \"Is not Fanny a very good dancer, sir?\"\nFanny, in dismay at such an unprecedented question, did not know which way to look, or how to be prepared for the answer. Some very grave reproof, or at least the coldest expression of indifference, must be coming to distress her brother, and sink her to the ground. But, on the contrary, it was no worse than, \"I am sorry to say that I am unable to answer your question. I have never seen Fanny dance since she was a little girl; but I trust we shall both think she acquits herself like a gentlewoman when we do see her, which, perhaps, we may have an opportunity of doing ere long.\"\n\"I have had the pleasure of seeing your sister dance, Mr. Price,\" said Henry Crawford, leaning forward, \"and will engage to answer every inquiry which you can make on the subject, to your entire satisfaction. But I believe\" (seeing Fanny looked distressed) \"it must be at some other time. There is _one_ person in company who does not like to have Miss Price spoken of.\"\nTrue enough, he had once seen Fanny dance; and it was equally true that he would now have answered for her gliding about with quiet, light elegance, and in admirable time; but, in fact, he could not for the life of him recall what her dancing had been, and rather took it for granted that she had been present than remembered anything about her.\nHe passed, however, for an admirer of her dancing; and Sir Thomas, by no means displeased, prolonged the conversation on dancing in general, and was so well engaged in describing the balls of Antigua, and listening to what his nephew could relate of the different modes of dancing which had fallen within his observation, that he had not heard his carriage announced, and was first called to the knowledge of it by the bustle of Mrs. Norris.\n\"Come, Fanny, Fanny, what are you about? We are going. Do not you see your aunt is going? Quick, quick! I cannot bear to keep good old Wilcox waiting. You should always remember the coachman and horses. My dear Sir Thomas, we have settled it that the carriage should come back for you, and Edmund and William.\"\nSir Thomas could not dissent, as it had been his own arrangement, previously communicated to his wife and sister; but _that_ seemed forgotten by Mrs. Norris, who must fancy that she settled it all herself.\nFanny's last feeling in the visit was disappointment: for the shawl which Edmund was quietly taking from the servant to bring and put round her shoulders was seized by Mr. Crawford's quicker hand, and she was obliged to be indebted to his more prominent attention.",
        "paragraph_chars": [
            [
                0,
                1020
            ],
            [
                1020,
                1611
            ],
            [
                1611,
                2245
            ],
            [
                2245,
                2803
            ],
            [
                2803,
                2883
            ],
            [
                2883,
                3060
            ],
            [
                3060,
                3207
            ],
            [
                3207,
                4570
            ],
            [
                4570,
                4861
            ],
            [
                4861,
                5154
            ],
            [
                5154,
                5203
            ],
            [
                5203,
                5362
            ],
            [
                5362,
                6540
            ],
            [
                6540,
                6632
            ],
            [
                6632,
                6853
            ],
            [
                6853,
                6875
            ],
            [
                6875,
                6982
            ],
            [
                6982,
                7072
            ],
            [
                7072,
                7224
            ],
            [
                7224,
                7287
            ],
            [
                7287,
                7406
            ],
            [
                7406,
                7620
            ],
            [
                7620,
                8788
            ],
            [
                8788,
                9206
            ],
            [
                9206,
                9647
            ],
            [
                9647,
                9799
            ],
            [
                9799,
                12125
            ],
            [
                12125,
                12642
            ],
            [
                12642,
                12776
            ],
            [
                12776,
                13273
            ],
            [
                13273,
                13898
            ],
            [
                13898,
                14862
            ],
            [
                14862,
                15057
            ],
            [
                15057,
                15496
            ],
            [
                15496,
                15672
            ],
            [
                15672,
                16024
            ],
            [
                16024,
                17688
            ],
            [
                17688,
                17877
            ],
            [
                17877,
                18124
            ],
            [
                18124,
                18251
            ],
            [
                18251,
                18569
            ],
            [
                18569,
                19686
            ],
            [
                19686,
                19723
            ],
            [
                19723,
                19890
            ],
            [
                19890,
                19921
            ],
            [
                19921,
                20058
            ],
            [
                20058,
                21078
            ],
            [
                21078,
                21334
            ],
            [
                21334,
                21862
            ],
            [
                21862,
                21960
            ],
            [
                21960,
                22015
            ],
            [
                22015,
                22517
            ],
            [
                22517,
                23201
            ],
            [
                23201,
                23286
            ],
            [
                23286,
                23495
            ],
            [
                23495,
                23643
            ],
            [
                23643,
                23677
            ],
            [
                23677,
                23712
            ],
            [
                23712,
                24228
            ],
            [
                24228,
                24813
            ],
            [
                24813,
                25184
            ],
            [
                25184,
                25530
            ],
            [
                25530,
                25972
            ],
            [
                25972,
                26283
            ],
            [
                26283,
                26489
            ],
            [
                26489,
                26753
            ]
        ],
        "segment_chars": [
            [
                0,
                184
            ],
            [
                184,
                380
            ],
            [
                380,
                1020
            ],
            [
                1020,
                1281
            ],
            [
                1281,
                1611
            ],
            [
                1611,
                2245
            ],
            [
                2245,
                2756
            ],
            [
                2756,
                2771
            ],
            [
                2771,
                2803
            ],
            [
                2803,
                2833
            ],
            [
                2833,
                2883
            ],
            [
                2883,
                2946
            ],
            [
                2946,
                3060
            ],
            [
                3060,
                3156
            ],
            [
                3156,
                3207
            ],
            [
                3207,
                3881
            ],
            [
                3881,
                4570
            ],
            [
                4570,
                4861
            ],
            [
                4861,
                5154
            ],
            [
                5154,
                5203
            ],
            [
                5203,
                5218
            ],
            [
                5218,
                5244
            ],
            [
                5244,
                5261
            ],
            [
                5261,
                5297
            ],
            [
                5297,
                5362
            ],
            [
                5362,
                5537
            ],
            [
                5537,
                5771
            ],
            [
                5771,
                6052
            ],
            [
                6052,
                6494
            ],
            [
                6494,
                6540
            ],
            [
                6540,
                6632
            ],
            [
                6632,
                6853
            ],
            [
                6853,
                6875
            ],
            [
                6875,
                6897
            ],
            [
                6897,
                6982
            ],
            [
                6982,
                7007
            ],
            [
                7007,
                7072
            ],
            [
                7072,
                7224
            ],
            [
                7224,
                7287
            ],
            [
                7287,
                7306
            ],
            [
                7306,
                7330
            ],
            [
                7330,
                7406
            ],
            [
                7406,
                7435
            ],
            [
                7435,
                7513
            ],
            [
                7513,
                7620
            ],
            [
                7620,
                7715
            ],
            [
                7715,
                7907
            ],
            [
                7907,
                7981
            ],
            [
                7981,
                8127
            ],
            [
                8127,
                8169
            ],
            [
                8169,
                8291
            ],
            [
                8291,
                8314
            ],
            [
                8314,
                8597
            ],
            [
                8597,
                8667
            ],
            [
                8667,
                8761
            ],
            [
                8761,
                8788
            ],
            [
                8788,
                8939
            ],
            [
                8939,
                8997
            ],
            [
                8997,
                9206
            ],
            [
                9206,
                9516
            ],
            [
                9516,
                9541
            ],
            [
                9541,
                9584
            ],
            [
                9584,
                9647
            ],
            [
                9647,
                9728
            ],
            [
                9728,
                9799
            ],
            [
                9799,
                9905
            ],
            [
                9905,
                10007
            ],
            [
                10007,
                10058
            ],
            [
                10058,
                10096
            ],
            [
                10096,
                10128
            ],
            [
                10128,
                10186
            ],
            [
                10186,
                10487
            ],
            [
                10487,
                10888
            ],
            [
                10888,
                10939
            ],
            [
                10939,
                11031
            ],
            [
                11031,
                11063
            ],
            [
                11063,
                11166
            ],
            [
                11166,
                11201
            ],
            [
                11201,
                11237
            ],
            [
                11237,
                11252
            ],
            [
                11252,
                11449
            ],
            [
                11449,
                11482
            ],
            [
                11482,
                11640
            ],
            [
                11640,
                12022
            ],
            [
                12022,
                12093
            ],
            [
                12093,
                12125
            ],
            [
                12125,
                12383
            ],
            [
                12383,
                12463
            ],
            [
                12463,
                12498
            ],
            [
                12498,
                12540
            ],
            [
                12540,
                12565
            ],
            [
                12565,
                12642
            ],
            [
                12642,
                12718
            ],
            [
                12718,
                12731
            ],
            [
                12731,
                12776
            ],
            [
                12776,
                12986
            ],
            [
                12986,
                13029
            ],
            [
                13029,
                13184
            ],
            [
                13184,
                13273
            ],
            [
                13273,
                13423
            ],
            [
                13423,
                13641
            ],
            [
                13641,
                13823
            ],
            [
                13823,
                13858
            ],
            [
                13858,
                13898
            ],
            [
                13898,
                14152
            ],
            [
                14152,
                14215
            ],
            [
                14215,
                14398
            ],
            [
                14398,
                14497
            ],
            [
                14497,
                14624
            ],
            [
                14624,
                14862
            ],
            [
                14862,
                15057
            ],
            [
                15057,
                15496
            ],
            [
                15496,
                15672
            ],
            [
                15672,
                16024
            ],
            [
                16024,
                16223
            ],
            [
                16223,
                17126
            ],
            [
                17126,
                17165
            ],
            [
                17165,
                17339
            ],
            [
                17339,
                17538
            ],
            [
                17538,
                17688
            ],
            [
                17688,
                17781
            ],
            [
                17781,
                17877
            ],
            [
                17877,
                18093
            ],
            [
                18093,
                18124
            ],
            [
                18124,
                18251
            ],
            [
                18251,
                18301
            ],
            [
                18301,
                18373
            ],
            [
                18373,
                18569
            ],
            [
                18569,
                18617
            ],
            [
                18617,
                18807
            ],
            [
                18807,
                18899
            ],
            [
                18899,
                19061
            ],
            [
                19061,
                19410
            ],
            [
                19410,
                19427
            ],
            [
                19427,
                19686
            ],
            [
                19686,
                19723
            ],
            [
                19723,
                19890
            ],
            [
                19890,
                19921
            ],
            [
                19921,
                20002
            ],
            [
                20002,
                20058
            ],
            [
                20058,
                20258
            ],
            [
                20258,
                21078
            ],
            [
                21078,
                21141
            ],
            [
                21141,
                21334
            ],
            [
                21334,
                21436
            ],
            [
                21436,
                21478
            ],
            [
                21478,
                21641
            ],
            [
                21641,
                21862
            ],
            [
                21862,
                21906
            ],
            [
                21906,
                21960
            ],
            [
                21960,
                22015
            ],
            [
                22015,
                22042
            ],
            [
                22042,
                22120
            ],
            [
                22120,
                22224
            ],
            [
                22224,
                22302
            ],
            [
                22302,
                22348
            ],
            [
                22348,
                22374
            ],
            [
                22374,
                22517
            ],
            [
                22517,
                22522
            ],
            [
                22522,
                22536
            ],
            [
                22536,
                22620
            ],
            [
                22620,
                22646
            ],
            [
                22646,
                22773
            ],
            [
                22773,
                23069
            ],
            [
                23069,
                23096
            ],
            [
                23096,
                23201
            ],
            [
                23201,
                23257
            ],
            [
                23257,
                23286
            ],
            [
                23286,
                23291
            ],
            [
                23291,
                23349
            ],
            [
                23349,
                23438
            ],
            [
                23438,
                23495
            ],
            [
                23495,
                23643
            ],
            [
                23643,
                23677
            ],
            [
                23677,
                23712
            ],
            [
                23712,
                23771
            ],
            [
                23771,
                23812
            ],
            [
                23812,
                23969
            ],
            [
                23969,
                24025
            ],
            [
                24025,
                24064
            ],
            [
                24064,
                24135
            ],
            [
                24135,
                24228
            ],
            [
                24228,
                24350
            ],
            [
                24350,
                24495
            ],
            [
                24495,
                24600
            ],
            [
                24600,
                24813
            ],
            [
                24813,
                25022
            ],
            [
                25022,
                25102
            ],
            [
                25102,
                25184
            ],
            [
                25184,
                25530
            ],
            [
                25530,
                25972
            ],
            [
                25972,
                26013
            ],
            [
                26013,
                26027
            ],
            [
                26027,
                26062
            ],
            [
                26062,
                26076
            ],
            [
                26076,
                26123
            ],
            [
                26123,
                26175
            ],
            [
                26175,
                26283
            ],
            [
                26283,
                26489
            ],
            [
                26489,
                26753
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                138,
                146
            ],
            [
                19,
                39
            ],
            [
                60,
                78
            ],
            [
                182,
                184
            ],
            [
                304,
                310
            ],
            [
                478,
                546
            ],
            [
                558,
                572
            ],
            [
                587,
                594
            ],
            [
                793,
                876
            ],
            [
                886,
                910
            ],
            [
                212,
                217
            ],
            [
                981,
                984
            ],
            [
                313,
                317
            ],
            [
                988,
                1020
            ],
            [
                1020,
                1121
            ],
            [
                1130,
                1131
            ],
            [
                1281,
                1295
            ],
            [
                1314,
                1369
            ],
            [
                1409,
                1421
            ],
            [
                1439,
                1443
            ],
            [
                1449,
                1483
            ],
            [
                1566,
                1568
            ],
            [
                1570,
                1611
            ],
            [
                1611,
                1626
            ],
            [
                1648,
                1663
            ],
            [
                1752,
                1766
            ],
            [
                1774,
                1848
            ],
            [
                1916,
                1922
            ],
            [
                1926,
                2027
            ],
            [
                2243,
                2245
            ],
            [
                2245,
                2272
            ],
            [
                2338,
                2404
            ],
            [
                2405,
                2421
            ],
            [
                2314,
                2315
            ],
            [
                2525,
                2551
            ],
            [
                2575,
                2612
            ],
            [
                2437,
                2442
            ],
            [
                2284,
                2286
            ],
            [
                2678,
                2695
            ],
            [
                2754,
                2756
            ],
            [
                2756,
                2770
            ],
            [
                2803,
                2833
            ],
            [
                2833,
                2883
            ],
            [
                2883,
                2946
            ],
            [
                2946,
                3060
            ],
            [
                3060,
                3156
            ],
            [
                3156,
                3207
            ],
            [
                3207,
                3228
            ],
            [
                3292,
                3323
            ],
            [
                3405,
                3440
            ],
            [
                3472,
                3557
            ],
            [
                3565,
                3580
            ],
            [
                3595,
                3666
            ],
            [
                3670,
                3677
            ],
            [
                3683,
                3784
            ],
            [
                3796,
                3880
            ],
            [
                3881,
                3959
            ],
            [
                3995,
                4089
            ],
            [
                4115,
                4124
            ],
            [
                4137,
                4168
            ],
            [
                4188,
                4207
            ],
            [
                4209,
                4311
            ],
            [
                4317,
                4340
            ],
            [
                4527,
                4530
            ],
            [
                4355,
                4367
            ],
            [
                4178,
                4181
            ],
            [
                4385,
                4418
            ],
            [
                4568,
                4570
            ],
            [
                4570,
                4626
            ],
            [
                4685,
                4706
            ],
            [
                4739,
                4810
            ],
            [
                4818,
                4861
            ],
            [
                4875,
                4909
            ],
            [
                4922,
                4933
            ],
            [
                5066,
                5067
            ],
            [
                5154,
                5203
            ],
            [
                5203,
                5218
            ],
            [
                5218,
                5244
            ],
            [
                5244,
                5261
            ],
            [
                5261,
                5297
            ],
            [
                5297,
                5362
            ],
            [
                5362,
                5408
            ],
            [
                5464,
                5537
            ],
            [
                5537,
                5577
            ],
            [
                5610,
                5657
            ],
            [
                5678,
                5691
            ],
            [
                5606,
                5609
            ],
            [
                5692,
                5734
            ],
            [
                5736,
                5744
            ],
            [
                5757,
                5771
            ],
            [
                5771,
                5772
            ],
            [
                5783,
                5882
            ],
            [
                5975,
                5989
            ],
            [
                6002,
                6027
            ],
            [
                6044,
                6052
            ],
            [
                6052,
                6066
            ],
            [
                6119,
                6121
            ],
            [
                6135,
                6213
            ],
            [
                6226,
                6245
            ],
            [
                6265,
                6338
            ],
            [
                6369,
                6470
            ],
            [
                6486,
                6494
            ],
            [
                6494,
                6540
            ],
            [
                6540,
                6572
            ],
            [
                6853,
                6875
            ],
            [
                6875,
                6897
            ],
            [
                6897,
                6902
            ],
            [
                6904,
                6908
            ],
            [
                6910,
                6973
            ],
            [
                6979,
                6982
            ],
            [
                6982,
                7007
            ],
            [
                7007,
                7072
            ],
            [
                7072,
                7224
            ],
            [
                7224,
                7287
            ],
            [
                7287,
                7306
            ],
            [
                7306,
                7330
            ],
            [
                7330,
                7406
            ],
            [
                7406,
                7435
            ],
            [
                7435,
                7513
            ],
            [
                7513,
                7620
            ],
            [
                7620,
                7679
            ],
            [
                7713,
                7715
            ],
            [
                7715,
                7742
            ],
            [
                7749,
                7757
            ],
            [
                7841,
                7907
            ],
            [
                7907,
                7910
            ],
            [
                7927,
                7940
            ],
            [
                7919,
                7926
            ],
            [
                7942,
                7981
            ],
            [
                7981,
                8010
            ],
            [
                8023,
                8056
            ],
            [
                8067,
                8085
            ],
            [
                8098,
                8127
            ],
            [
                8169,
                8291
            ],
            [
                8291,
                8314
            ],
            [
                8314,
                8325
            ],
            [
                8499,
                8597
            ],
            [
                8597,
                8667
            ],
            [
                8667,
                8761
            ],
            [
                8761,
                8788
            ],
            [
                8788,
                8939
            ],
            [
                8939,
                8975
            ],
            [
                8995,
                8997
            ],
            [
                8997,
                9014
            ],
            [
                9028,
                9206
            ],
            [
                9206,
                9267
            ],
            [
                9297,
                9316
            ],
            [
                9321,
                9336
            ],
            [
                9348,
                9404
            ],
            [
                9281,
                9286
            ],
            [
                9452,
                9516
            ],
            [
                9516,
                9541
            ],
            [
                9584,
                9647
            ],
            [
                9647,
                9682
            ],
            [
                9687,
                9690
            ],
            [
                9695,
                9707
            ],
            [
                9691,
                9694
            ],
            [
                9724,
                9728
            ],
            [
                9728,
                9799
            ],
            [
                9799,
                9837
            ],
            [
                9876,
                9905
            ],
            [
                9905,
                9926
            ],
            [
                10005,
                10007
            ],
            [
                10007,
                10058
            ],
            [
                10058,
                10077
            ],
            [
                10083,
                10096
            ],
            [
                10128,
                10186
            ],
            [
                10187,
                10191
            ],
            [
                10193,
                10241
            ],
            [
                10305,
                10308
            ],
            [
                10296,
                10301
            ],
            [
                10386,
                10432
            ],
            [
                10485,
                10487
            ],
            [
                10642,
                10676
            ],
            [
                10685,
                10763
            ],
            [
                10795,
                10825
            ],
            [
                10885,
                10888
            ],
            [
                10888,
                10929
            ],
            [
                10937,
                10939
            ],
            [
                10939,
                10997
            ],
            [
                11007,
                11009
            ],
            [
                11029,
                11031
            ],
            [
                11031,
                11063
            ],
            [
                11063,
                11064
            ],
            [
                11087,
                11166
            ],
            [
                11166,
                11191
            ],
            [
                11199,
                11201
            ],
            [
                11237,
                11252
            ],
            [
                11252,
                11259
            ],
            [
                11265,
                11277
            ],
            [
                11413,
                11449
            ],
            [
                11525,
                11527
            ],
            [
                11563,
                11606
            ],
            [
                11623,
                11640
            ],
            [
                11640,
                11776
            ],
            [
                11814,
                11882
            ],
            [
                12020,
                12022
            ],
            [
                12023,
                12026
            ],
            [
                12028,
                12049
            ],
            [
                12051,
                12093
            ],
            [
                12093,
                12125
            ],
            [
                12125,
                12184
            ],
            [
                12200,
                12202
            ],
            [
                12222,
                12253
            ],
            [
                12262,
                12263
            ],
            [
                12257,
                12261
            ],
            [
                12264,
                12271
            ],
            [
                12312,
                12383
            ],
            [
                12419,
                12463
            ],
            [
                12476,
                12486
            ],
            [
                12471,
                12474
            ],
            [
                12496,
                12498
            ],
            [
                12498,
                12540
            ],
            [
                12565,
                12642
            ],
            [
                12642,
                12709
            ],
            [
                12716,
                12718
            ],
            [
                12718,
                12731
            ],
            [
                12731,
                12776
            ],
            [
                12776,
                12809
            ],
            [
                12835,
                12899
            ],
            [
                12919,
                12927
            ],
            [
                12940,
                12965
            ],
            [
                12976,
                12986
            ],
            [
                12986,
                13029
            ],
            [
                13029,
                13077
            ],
            [
                13104,
                13125
            ],
            [
                13182,
                13184
            ],
            [
                13233,
                13273
            ],
            [
                13273,
                13423
            ],
            [
                13423,
                13427
            ],
            [
                13441,
                13559
            ],
            [
                13586,
                13641
            ],
            [
                13685,
                13776
            ],
            [
                13788,
                13823
            ],
            [
                13823,
                13858
            ],
            [
                13858,
                13898
            ],
            [
                13898,
                13944
            ],
            [
                14103,
                14152
            ],
            [
                14152,
                14215
            ],
            [
                14215,
                14223
            ],
            [
                14255,
                14336
            ],
            [
                14347,
                14398
            ],
            [
                14497,
                14564
            ],
            [
                14622,
                14624
            ],
            [
                14624,
                14695
            ],
            [
                14722,
                14834
            ],
            [
                14844,
                14862
            ],
            [
                14862,
                15057
            ],
            [
                15057,
                15068
            ],
            [
                15086,
                15101
            ],
            [
                15440,
                15442
            ],
            [
                15105,
                15108
            ],
            [
                15149,
                15268
            ],
            [
                15274,
                15319
            ],
            [
                15325,
                15415
            ],
            [
                15431,
                15439
            ],
            [
                15493,
                15496
            ],
            [
                15496,
                15622
            ],
            [
                15647,
                15672
            ],
            [
                15672,
                15779
            ],
            [
                15882,
                15919
            ],
            [
                15813,
                15816
            ],
            [
                15923,
                15952
            ],
            [
                16005,
                16012
            ],
            [
                15953,
                15963
            ],
            [
                16022,
                16024
            ],
            [
                16024,
                16049
            ],
            [
                16056,
                16104
            ],
            [
                16143,
                16162
            ],
            [
                16182,
                16196
            ],
            [
                16210,
                16223
            ],
            [
                16223,
                16345
            ],
            [
                16357,
                16407
            ],
            [
                16491,
                16492
            ],
            [
                16408,
                16414
            ],
            [
                16435,
                16437
            ],
            [
                16584,
                16587
            ],
            [
                16682,
                16814
            ],
            [
                16831,
                16867
            ],
            [
                16626,
                16631
            ],
            [
                16596,
                16599
            ],
            [
                16915,
                16923
            ],
            [
                16936,
                16951
            ],
            [
                16446,
                16450
            ],
            [
                16956,
                16964
            ],
            [
                17018,
                17033
            ],
            [
                17047,
                17125
            ],
            [
                17126,
                17165
            ],
            [
                17165,
                17256
            ],
            [
                17279,
                17339
            ],
            [
                17538,
                17610
            ],
            [
                17616,
                17637
            ],
            [
                17686,
                17688
            ],
            [
                17688,
                17781
            ],
            [
                17781,
                17813
            ],
            [
                17874,
                17877
            ],
            [
                17877,
                17957
            ],
            [
                17959,
                17962
            ],
            [
                17964,
                18021
            ],
            [
                18023,
                18034
            ],
            [
                18036,
                18093
            ],
            [
                18093,
                18124
            ],
            [
                18251,
                18299
            ],
            [
                18124,
                18130
            ],
            [
                18299,
                18301
            ],
            [
                18301,
                18373
            ],
            [
                18373,
                18399
            ],
            [
                18409,
                18479
            ],
            [
                18566,
                18569
            ],
            [
                18569,
                18617
            ],
            [
                18617,
                18618
            ],
            [
                18622,
                18751
            ],
            [
                18756,
                18759
            ],
            [
                18768,
                18807
            ],
            [
                18903,
                18915
            ],
            [
                18926,
                18991
            ],
            [
                19059,
                19061
            ],
            [
                19061,
                19067
            ],
            [
                19134,
                19230
            ],
            [
                19264,
                19410
            ],
            [
                19410,
                19427
            ],
            [
                19427,
                19435
            ],
            [
                19510,
                19576
            ],
            [
                19601,
                19683
            ],
            [
                19751,
                19753
            ],
            [
                19769,
                19779
            ],
            [
                19757,
                19758
            ],
            [
                19780,
                19818
            ],
            [
                19822,
                19836
            ],
            [
                19838,
                19841
            ],
            [
                19843,
                19851
            ],
            [
                19863,
                19875
            ],
            [
                19852,
                19854
            ],
            [
                19887,
                19890
            ],
            [
                19890,
                19908
            ],
            [
                19919,
                19921
            ],
            [
                20058,
                20184
            ],
            [
                20204,
                20232
            ],
            [
                20256,
                20258
            ],
            [
                20269,
                20277
            ],
            [
                20416,
                20419
            ],
            [
                20291,
                20327
            ],
            [
                20346,
                20414
            ],
            [
                20993,
                20996
            ],
            [
                20421,
                20449
            ],
            [
                20459,
                20509
            ],
            [
                20521,
                20576
            ],
            [
                20804,
                20807
            ],
            [
                20577,
                20595
            ],
            [
                20600,
                20607
            ],
            [
                20629,
                20711
            ],
            [
                20725,
                20744
            ],
            [
                20761,
                20802
            ],
            [
                20608,
                20611
            ],
            [
                20820,
                20830
            ],
            [
                20855,
                20883
            ],
            [
                21076,
                21078
            ],
            [
                21100,
                21103
            ],
            [
                21086,
                21095
            ],
            [
                21105,
                21125
            ],
            [
                21139,
                21141
            ],
            [
                21141,
                21219
            ],
            [
                21278,
                21334
            ],
            [
                21344,
                21375
            ],
            [
                21388,
                21402
            ],
            [
                21434,
                21436
            ],
            [
                21436,
                21453
            ],
            [
                21483,
                21507
            ],
            [
                21518,
                21546
            ],
            [
                21552,
                21563
            ],
            [
                21639,
                21641
            ],
            [
                21641,
                21655
            ],
            [
                21723,
                21819
            ],
            [
                21860,
                21862
            ],
            [
                21862,
                21906
            ],
            [
                21906,
                21960
            ],
            [
                21960,
                22015
            ],
            [
                22015,
                22026
            ],
            [
                22032,
                22042
            ],
            [
                22042,
                22075
            ],
            [
                22118,
                22120
            ],
            [
                22120,
                22196
            ],
            [
                22224,
                22302
            ],
            [
                22334,
                22346
            ],
            [
                22353,
                22355
            ],
            [
                22323,
                22330
            ],
            [
                22372,
                22374
            ],
            [
                22374,
                22468
            ],
            [
                22470,
                22472
            ],
            [
                22473,
                22517
            ],
            [
                22517,
                22522
            ],
            [
                22522,
                22527
            ],
            [
                22534,
                22536
            ],
            [
                22536,
                22550
            ],
            [
                22553,
                22604
            ],
            [
                22617,
                22620
            ],
            [
                22620,
                22646
            ],
            [
                22676,
                22694
            ],
            [
                22700,
                22726
            ],
            [
                22731,
                22742
            ],
            [
                22756,
                22773
            ],
            [
                22773,
                22790
            ],
            [
                22834,
                22887
            ],
            [
                22795,
                22796
            ],
            [
                22986,
                22988
            ],
            [
                22968,
                22972
            ],
            [
                22979,
                22982
            ],
            [
                23069,
                23094
            ],
            [
                23201,
                23257
            ],
            [
                23257,
                23286
            ],
            [
                23286,
                23291
            ],
            [
                23291,
                23349
            ],
            [
                23349,
                23436
            ],
            [
                23495,
                23569
            ],
            [
                23586,
                23596
            ],
            [
                23616,
                23643
            ],
            [
                23643,
                23677
            ],
            [
                23677,
                23712
            ],
            [
                23712,
                23771
            ],
            [
                23771,
                23812
            ],
            [
                23848,
                23866
            ],
            [
                23881,
                23914
            ],
            [
                23919,
                23969
            ],
            [
                23969,
                24025
            ],
            [
                24025,
                24064
            ],
            [
                24064,
                24135
            ],
            [
                24135,
                24159
            ],
            [
                24186,
                24228
            ],
            [
                24228,
                24233
            ],
            [
                24280,
                24310
            ],
            [
                24348,
                24350
            ],
            [
                24350,
                24373
            ],
            [
                24427,
                24494
            ],
            [
                24495,
                24516
            ],
            [
                24537,
                24564
            ],
            [
                24602,
                24629
            ],
            [
                24657,
                24670
            ],
            [
                24636,
                24639
            ],
            [
                24695,
                24699
            ],
            [
                24517,
                24519
            ],
            [
                24703,
                24801
            ],
            [
                24806,
                24813
            ],
            [
                24813,
                24943
            ],
            [
                24996,
                25000
            ],
            [
                24944,
                24957
            ],
            [
                24977,
                24991
            ],
            [
                25020,
                25022
            ],
            [
                25022,
                25102
            ],
            [
                25102,
                25110
            ],
            [
                25112,
                25115
            ],
            [
                25117,
                25184
            ],
            [
                25184,
                25331
            ],
            [
                25354,
                25435
            ],
            [
                25528,
                25530
            ],
            [
                25530,
                25596
            ],
            [
                25619,
                25647
            ],
            [
                25669,
                25730
            ],
            [
                25852,
                25859
            ],
            [
                25864,
                25867
            ],
            [
                25874,
                25897
            ],
            [
                25959,
                25970
            ],
            [
                25745,
                25747
            ],
            [
                25949,
                25955
            ],
            [
                25970,
                25972
            ],
            [
                25972,
                25977
            ],
            [
                25984,
                26013
            ],
            [
                26013,
                26027
            ],
            [
                26062,
                26076
            ],
            [
                26076,
                26123
            ],
            [
                26175,
                26283
            ],
            [
                26283,
                26347
            ],
            [
                26395,
                26400
            ],
            [
                26402,
                26406
            ],
            [
                26408,
                26464
            ],
            [
                26465,
                26489
            ],
            [
                26489,
                26509
            ],
            [
                26523,
                26608
            ],
            [
                26619,
                26669
            ],
            [
                26684,
                26753
            ]
        ],
        "row_chars": [
            [
                0,
                184
            ],
            [
                184,
                1020
            ],
            [
                1020,
                1611
            ],
            [
                1611,
                2245
            ],
            [
                2245,
                2756
            ],
            [
                2756,
                2771
            ],
            [
                2771,
                2803
            ],
            [
                2803,
                2833
            ],
            [
                2833,
                2883
            ],
            [
                2883,
                2946
            ],
            [
                2946,
                3060
            ],
            [
                3060,
                3156
            ],
            [
                3156,
                3207
            ],
            [
                3207,
                3881
            ],
            [
                3881,
                4570
            ],
            [
                4570,
                4861
            ],
            [
                4861,
                5154
            ],
            [
                5154,
                5203
            ],
            [
                5203,
                5218
            ],
            [
                5218,
                5244
            ],
            [
                5244,
                5261
            ],
            [
                5261,
                5297
            ],
            [
                5297,
                5362
            ],
            [
                5362,
                5537
            ],
            [
                5537,
                5771
            ],
            [
                5771,
                6052
            ],
            [
                6052,
                6494
            ],
            [
                6494,
                6540
            ],
            [
                6540,
                6632
            ],
            [
                6632,
                6853
            ],
            [
                6853,
                6875
            ],
            [
                6875,
                6897
            ],
            [
                6897,
                6982
            ],
            [
                6982,
                7007
            ],
            [
                7007,
                7072
            ],
            [
                7072,
                7224
            ],
            [
                7224,
                7287
            ],
            [
                7287,
                7306
            ],
            [
                7306,
                7330
            ],
            [
                7330,
                7406
            ],
            [
                7406,
                7435
            ],
            [
                7435,
                7513
            ],
            [
                7513,
                7620
            ],
            [
                7620,
                7715
            ],
            [
                7715,
                7907
            ],
            [
                7907,
                7981
            ],
            [
                7981,
                8127
            ],
            [
                8127,
                8169
            ],
            [
                8169,
                8291
            ],
            [
                8291,
                8314
            ],
            [
                8314,
                8597
            ],
            [
                8597,
                8667
            ],
            [
                8667,
                8761
            ],
            [
                8761,
                8788
            ],
            [
                8788,
                8939
            ],
            [
                8939,
                8997
            ],
            [
                8997,
                9206
            ],
            [
                9206,
                9516
            ],
            [
                9516,
                9541
            ],
            [
                9541,
                9584
            ],
            [
                9584,
                9647
            ],
            [
                9647,
                9728
            ],
            [
                9728,
                9799
            ],
            [
                9799,
                9905
            ],
            [
                9905,
                10007
            ],
            [
                10007,
                10058
            ],
            [
                10058,
                10096
            ],
            [
                10096,
                10128
            ],
            [
                10128,
                10186
            ],
            [
                10186,
                10487
            ],
            [
                10487,
                10888
            ],
            [
                10888,
                10939
            ],
            [
                10939,
                11031
            ],
            [
                11031,
                11063
            ],
            [
                11063,
                11166
            ],
            [
                11166,
                11201
            ],
            [
                11201,
                11237
            ],
            [
                11237,
                11252
            ],
            [
                11252,
                11449
            ],
            [
                11449,
                11482
            ],
            [
                11482,
                11640
            ],
            [
                11640,
                12022
            ],
            [
                12022,
                12093
            ],
            [
                12093,
                12125
            ],
            [
                12125,
                12383
            ],
            [
                12383,
                12463
            ],
            [
                12463,
                12498
            ],
            [
                12498,
                12540
            ],
            [
                12540,
                12565
            ],
            [
                12565,
                12642
            ],
            [
                12642,
                12718
            ],
            [
                12718,
                12731
            ],
            [
                12731,
                12776
            ],
            [
                12776,
                12986
            ],
            [
                12986,
                13029
            ],
            [
                13029,
                13184
            ],
            [
                13184,
                13273
            ],
            [
                13273,
                13423
            ],
            [
                13423,
                13641
            ],
            [
                13641,
                13823
            ],
            [
                13823,
                13858
            ],
            [
                13858,
                13898
            ],
            [
                13898,
                14152
            ],
            [
                14152,
                14215
            ],
            [
                14215,
                14398
            ],
            [
                14398,
                14497
            ],
            [
                14497,
                14624
            ],
            [
                14624,
                14862
            ],
            [
                14862,
                15057
            ],
            [
                15057,
                15496
            ],
            [
                15496,
                15672
            ],
            [
                15672,
                16024
            ],
            [
                16024,
                16223
            ],
            [
                16223,
                17126
            ],
            [
                17126,
                17165
            ],
            [
                17165,
                17339
            ],
            [
                17339,
                17538
            ],
            [
                17538,
                17688
            ],
            [
                17688,
                17781
            ],
            [
                17781,
                17877
            ],
            [
                17877,
                18093
            ],
            [
                18093,
                18124
            ],
            [
                18124,
                18301
            ],
            [
                18301,
                18373
            ],
            [
                18373,
                18569
            ],
            [
                18569,
                18617
            ],
            [
                18617,
                18807
            ],
            [
                18807,
                18899
            ],
            [
                18899,
                19061
            ],
            [
                19061,
                19410
            ],
            [
                19410,
                19427
            ],
            [
                19427,
                19686
            ],
            [
                19686,
                19723
            ],
            [
                19723,
                19890
            ],
            [
                19890,
                19921
            ],
            [
                19921,
                20002
            ],
            [
                20002,
                20058
            ],
            [
                20058,
                20258
            ],
            [
                20258,
                21078
            ],
            [
                21078,
                21141
            ],
            [
                21141,
                21334
            ],
            [
                21334,
                21436
            ],
            [
                21436,
                21641
            ],
            [
                21641,
                21862
            ],
            [
                21862,
                21906
            ],
            [
                21906,
                21960
            ],
            [
                21960,
                22015
            ],
            [
                22015,
                22042
            ],
            [
                22042,
                22120
            ],
            [
                22120,
                22302
            ],
            [
                22302,
                22374
            ],
            [
                22374,
                22517
            ],
            [
                22517,
                22522
            ],
            [
                22522,
                22536
            ],
            [
                22536,
                22620
            ],
            [
                22620,
                22646
            ],
            [
                22646,
                22773
            ],
            [
                22773,
                23096
            ],
            [
                23096,
                23201
            ],
            [
                23201,
                23257
            ],
            [
                23257,
                23286
            ],
            [
                23286,
                23291
            ],
            [
                23291,
                23349
            ],
            [
                23349,
                23438
            ],
            [
                23438,
                23495
            ],
            [
                23495,
                23643
            ],
            [
                23643,
                23677
            ],
            [
                23677,
                23712
            ],
            [
                23712,
                23771
            ],
            [
                23771,
                23812
            ],
            [
                23812,
                23969
            ],
            [
                23969,
                24025
            ],
            [
                24025,
                24064
            ],
            [
                24064,
                24135
            ],
            [
                24135,
                24228
            ],
            [
                24228,
                24350
            ],
            [
                24350,
                24495
            ],
            [
                24495,
                24813
            ],
            [
                24813,
                25022
            ],
            [
                25022,
                25102
            ],
            [
                25102,
                25184
            ],
            [
                25184,
                25530
            ],
            [
                25530,
                25972
            ],
            [
                25972,
                26013
            ],
            [
                26013,
                26027
            ],
            [
                26027,
                26062
            ],
            [
                26062,
                26076
            ],
            [
                26076,
                26123
            ],
            [
                26123,
                26175
            ],
            [
                26175,
                26283
            ],
            [
                26283,
                26489
            ],
            [
                26489,
                26753
            ]
        ]
    },
    "abridged": {
        "text": "The intimacy between the two families was now nearly restored to its former state. Sir Thomas found the Grants and their young inmates really worth visiting; and though above scheming for any marriage, he could not avoid perceiving, in a grand and careless way, that Mr. Crawford was distinguishing his niece, and he assented more willingly to invitations on that account.\nHis readiness, however, in agreeing to dine at the Parsonage, when the general invitation was at last sent out, proceeded from goodwill alone, and had nothing to do with Mr. Crawford: for it was during that visit that he first began to think Mr Crawford was the admirer of Fanny Price.\nThe meeting was a pleasant one, and the dinner was elegant and plentiful, according to the usual style of the Grants, and enjoyed by everyone except Mrs. Norris, who could never behold either the wide table or the number of dishes on it with patience.\nIn the evening it was found that after making up the whist-table there would remain sufficient people for a round game. Speculation was decided on; and Lady Bertram soon found herself being asked to choose between the games. She hesitated.\n\"What shall I do, Sir Thomas? Whist and speculation; which will amuse me most?\"\nSir Thomas, after a moment's thought, recommended speculation. He was a whist player himself, and perhaps might feel that it would not much amuse him to have her for a partner.\n\"Very well,\" was her ladyship's contented answer; \"then speculation, if you please, Mrs. Grant. I know nothing about it, but Fanny must teach me.\"\nHere Fanny interposed anxiously; she had never played the game; but upon everybody's assuring her that it was the easiest game on the cards, and Henry Crawford's stepping forward with an earnest request to sit between her ladyship and Miss Price, and teach them both, it was settled. Sir Thomas, Mrs. Norris, and Dr. and Mrs. Grant being seated at the table of prime intellectual state, the remaining six, under Miss Crawford's direction, were arranged round the other.\nIt was a fine arrangement for Henry Crawford, who was close to Fanny, and with two persons' cards to manage as well as his own; for though it was impossible for Fanny not to master the rules in three minutes, he had yet to sharpen her avarice and harden her heart, which, especially in any competition with William, was a work of some difficulty. As for Lady Bertram, he was in charge of her fortune through the whole evening.\nHe was in high spirits, doing everything with happy ease and playful impudence; and the round table was altogether a very comfortable contrast to the sobriety and orderly silence of the other.\nSir Thomas inquired into the enjoyment of his lady. \"I hope your ladyship is pleased with the game.\"\n\"Oh dear, yes! very entertaining indeed. A very odd game. I do not know what it is all about. I am never to see my cards; and Mr. Crawford does all the rest.\"\n\"Bertram,\" said Crawford, some time afterwards, \"I have never told you what happened to me yesterday in my ride home.\" They had been hunting together, and were at some distance from Mansfield, when his horse flung a shoe, and Henry Crawford had been obliged to give up and make his way back. \"I lost my way after passing that old farmhouse with the yew-trees, because I can never bear to ask; and I found myself in the very place which I was curious to see. I was suddenly in a retired little village between gently rising hills; a small stream before me, a church standing to my right-which church was strikingly large and handsome for the place, where there was no gentleman's house to be seen excepting one-to be presumed the Parsonage-within a stone's throw of the church. I found myself, in short, in Thornton Lacey.\"\n\"It sounds like it,\" said Edmund. \"You inquired, then?\"\n\"No, I never inquire. But I told a man mending a hedge that it was Thornton Lacey, and he agreed.\"\n\"You have a good memory. I had forgotten having ever told you half so much of the place.\"\nThornton Lacey was the name of his impending living, as Miss Crawford well knew; and her interest in a negotiation for William Price's knave increased.\n\"Well,\" continued Edmund, \"and how did you like what you saw?\"\n\"Very much indeed. You are a lucky fellow. There will be work for five summers at least before the place is liveable.\"\n\"No, no, not so bad as that. The farmyard must be moved, I grant you; but I am not aware of anything else. The house is by no means bad, and when the yard is removed, there may be a very tolerable approach to it.\"\n\"The farmyard must be cleared away entirely, and planted up. The house must be turned to face the east, where the view is really very pretty; I am sure it may be done. And your approach must be through what is at present the garden. You must make a new garden at the back of the house; which will give it the best aspect, sloping to the south-east. I rode fifty yards up the lane, between the church and the house, in order to look about me; and saw how it might all be. Nothing can be easier. The meadows must be all laid together, of course; very pretty meadows they are, finely sprinkled with timber. They belong to the living, I suppose; if not, you must purchase them. Then the stream-something must be done with the stream; but I could not quite determine what. I had two or three ideas.\"\n\"And I have two or three ideas also,\" said Edmund, \"and one of them is, that very little of your plan for Thornton Lacey will ever be put in practice. I must be satisfied with rather less. I think the house may be made comfortable, and given the air of a gentleman's residence, without any very heavy expense, and that must suffice me; and, I hope, may suffice all who care about me.\"\nMiss Crawford, a little suspicious and resentful of a certain half-look attending this last expression, made a hasty finish of her dealings with William Price, and exclaimed, \"There, I will stake my last like a woman of spirit. No cold prudence for me. If I lose the game, it shall not be from not striving for it.\"\nThe game was hers, and only did not repay her what she had paid for it. Another deal proceeded, and Crawford began again about Thornton Lacey.\n\"My plan may not be the best possible: but you must do a good deal. The place deserves it. (Excuse me, your ladyship must not see your cards. There, let them lie before you.) You talk of giving it the air of a gentleman's residence. That will be done by the removal of the farmyard; for the house has the look of a something above a mere parsonage. It is a solid, roomy, mansion-like house, such as one might suppose a respectable old country family had lived in through two centuries at least.\" Miss Crawford listened, and Edmund agreed. \"The air of a gentleman's residence, therefore, you cannot help giving it. But it is capable of much more. (Lady Bertram bids a dozen for that queen; no, no, a dozen is more than it is worth. Lady Bertram does not bid. Go on, go on.) By some improvements you may give it a higher character. It may become the residence of a man of education, taste, and good connexions. All this may be stamped on it; and that house receive such an air as to make its owner be set down as the great landholder of the parish; especially as there is no real squire's house to dispute the point. You think with me, I hope,\" (turning with a softened voice to Fanny). \"Have you ever seen the place?\"\nFanny gave a quick negative, and tried to hide her interest by attending to her brother, who was driving a hard bargain; but Crawford pursued with \"No, no, you must not part with the queen. Your brother does not offer half her value. Hands off, sir. Your sister does not part with the queen. The game will be yours,\" turning to her again; \"it will certainly be yours.\"\n\"And Fanny had much rather it were William's,\" said Edmund, smiling. \"Poor Fanny! not allowed to cheat herself as she wishes!\"\n\"Mr. Bertram,\" said Miss Crawford, \"you know Henry to be such a capital improver, that you cannot do anything at Thornton Lacey without his help. Only think how useful he was at Sotherton! Only think what grand things were produced there that one hot day in August. What was done there is not to be told!\"\nFanny's eyes were turned on Crawford for a moment with an expression more than grave-even reproachful; but on catching his, were instantly withdrawn. With some consciousness he shook his head at his sister, and laughingly replied, \"I cannot say there was much done at Sotherton; we were all walking after each other, and bewildered.\" He added, in a low voice, directed solely at Fanny, \"I should be sorry to have my powers of planning judged of by the day at Sotherton. I see things very differently now. Do not think of me as I appeared then.\"\nSotherton was a word to catch Mrs. Norris, and she called out, in high good-humour, \"Sotherton! Yes, that is a place, indeed, and we had a charming day there. William, the next time you come, I hope dear Mr. and Mrs. Rushworth will be at home, and I can answer for your being kindly received by both. They are at Brighton now, you know; in one of the best houses there. I do not exactly know the distance, but when you get back to Portsmouth, you ought to go over and pay your respects to them; and I could send a little parcel by you that I want to get to your cousins.\"\n\"I should be very happy, aunt; but Brighton is almost by Beachey Head; and if I could get so far, I could not expect to be welcome in such a smart place as that-poor scrubby midshipman as I am.\"\nMrs. Norris's eager assurance to the contrary was stopped by Sir Thomas's saying with authority, \"I do not advise your going to Brighton, William, as I trust you may have more convenient opportunities of meeting. My daughters would be happy to see their cousins anywhere; and you will find Mr. Rushworth well disposed towards you.\"\n\"I would rather find him private secretary to the First Lord than anything else,\" was William's only answer, in an undervoice, and the subject dropped.\nAs yet Sir Thomas had seen nothing to remark in Mr. Crawford's behaviour; but when the whist-table broke up, he became a looker-on at the other, and found his niece the object of pointed attentions.\nHenry Crawford was in the glow of another scheme about Thornton Lacey; and was detailing it to Fanny with a look of earnestness. His scheme was to rent the house himself the following winter, that he might have a home of his own in that neighbourhood; not merely for the use of it in the hunting-season, (as he said), for his attachment to that neighbourhood did not depend upon one amusement or one season of the year: he had set his heart upon having a place that he could come to at any time, a home where his holidays might be spent, so that he might continue that friendship with the Mansfield Park family which was increasing in value to him every day.\nSir Thomas heard and was not offended. There was no want of respect in the young man's address; and Fanny's reception of it was so calm and uninviting, that he had nothing to censure in her. Finding by whom he was observed, Henry Crawford addressed himself on the subject to Sir Thomas.\n\"I want to be your neighbour, Sir Thomas, as you have, perhaps, heard me telling Miss Price. May I hope for your acquiescence?\"\nSir Thomas, politely bowing, replied, \"It is the only way, sir, in which I could not wish you established as a permanent neighbour; but I hope and believe that Edmund will occupy his own house at Thornton Lacey. Edmund, am I saying too much?\"\n\"Certainly, sir, I have no idea but of residence,\" answered Edmund. \"But, Crawford, though I refuse you as a tenant, come to me as a friend. Consider the house as half yours every winter, and we will add to the stables on your own improved plan.\"\n\"We shall be the losers,\" continued Sir Thomas. \"Edmund's going, though only eight miles, will be an unwelcome contraction of our family circle; but I should have been deeply mortified if my son could reconcile himself to doing less. A parish has claims which can be known only by a clergyman constantly resident. Edmund might read prayers and preach, without giving up Mansfield Park: he might ride over every Sunday and go through divine service; he might be the clergyman of Thornton Lacey every seventh day, for three or four hours, if that would content him. But it will not. He knows that if he does not live among his parishioners, and prove himself their well-wisher and friend, he does very little either for their good or his own. Thornton Lacey, therefore, is the only house in the neighbourhood which I should not be happy for Mr. Crawford to occupy.\"\nMr. Crawford bowed.\nWhatever effect Sir Thomas's little harangue might really produce on Mr. Crawford, it raised some awkward sensations in two of his most attentive listeners. Fanny, having not understood that Thornton was so soon to be his home, was pondering with downcast eyes on what it would be not to see Edmund every day; and Miss Crawford, startled from the agreeable fancies she had been indulging on the strength of her brother's description, was no longer able, in her picture of a future Thornton, to shut out the church, sink the clergyman, and see only the elegant, modernised residence of a man of independent fortune. She considered Sir Thomas as the destroyer of all this.\nHer agreeable speculation was over. It was time to have done with cards, if sermons prevailed; and she was glad to refresh her spirits by a change of place and neighbour.\nMost of the party were now collected round the fire. William and Fanny remained together at the deserted card-table, talking comfortably. Henry Crawford sat silently observing them for a few minutes; himself, in the meanwhile, observed by Sir Thomas.\n\"This is the assembly night,\" said William. \"If I were at Portsmouth I should be at it, perhaps.\"\n\"But you do not wish yourself at Portsmouth, William?\"\n\"No, Fanny, I do not. I shall have enough of Portsmouth later. And I do not know that there would be any good in going to the assembly, for the Portsmouth girls turn up their noses at anybody who has not a commission. A midshipman is nothing. You remember the Gregorys; they are grown up amazing fine girls, but they will hardly speak to me, because Lucy is courted by a lieutenant.\"\n\"Oh! shame! But never mind, William\" (her own cheeks in a glow of indignation). \"It is not worth minding. It is no more than the greatest admirals have experienced, in their time. You must think of it as one of the hardships which fall to every sailor, but it will end when you are a lieutenant!\"\n\"I begin to think I shall never be a lieutenant, Fanny. Everybody gets made but me.\"\n\"Oh! my dear William, do not talk so; do not be so desponding. My uncle says nothing, but I am sure he will do everything in his power to get you made.\"\nShe was checked by the sight of her uncle much nearer to them than she had supposed, and each began to talk of something else.\n\"Are you fond of dancing, Fanny?\"\n\"Yes, very; only I am soon tired.\"\n\"I should like to go to a ball with you and see you dance. Have you never any balls at Northampton? I'd dance with you, for nobody would know who I was, and I should like to be your partner once more. We used to jump about together many a time, did not we? when the hand-organ was in the street? I am a pretty good dancer in my way, but I dare say you are a better.\" And turning to his uncle, \"Is not Fanny a very good dancer, sir?\"\nFanny did not know which way to look. Some very grave reproof must be coming to distress her brother, and sink her to the ground.\nBut, on the contrary, Sir Thomas answered, \"I am sorry to say that I have never seen Fanny dance; but I trust she will acquit herself like a gentlewoman when we do see her, which, perhaps, we may have an opportunity of doing before long.\"\n\"I have had the pleasure of seeing your sister dance, Mr. Price,\" said Henry Crawford, leaning forward, \"and will engage to answer your every inquiry on the subject. But I believe\" (seeing Fanny looked distressed) \"it must be at some other time. There is one person in company who does not like to have Miss Price spoken of.\"\nTrue enough, he had once seen Fanny dance; and it was equally true that he would now have answered for her gliding about with quiet, light elegance; but, in fact, he could not for the life of him recall what her dancing had been.\nHe passed, however, for an admirer of her dancing; and Sir Thomas, pleased, prolonged the conversation, and was so well engaged in describing the balls of Antigua, that he did not hear his carriage announced, until Mrs. Norris began to bustle.\n\"Come, Fanny, what are you about? We are going. Quick, quick! I cannot bear to keep good old Wilcox waiting. My dear Sir Thomas, we have settled it that the carriage should come back for you, and Edmund and William.\"\nSir Thomas could not dissent, as it had been his own arrangement; but that seemed forgotten by Mrs. Norris, who must fancy that she had settled it all herself.\nFanny's last feeling was disappointment: for the shawl which Edmund was quietly taking from the servant to put round her shoulders was seized by Mr. Crawford, and she was obliged to be indebted to his more prominent attention.",
        "paragraph_chars": [
            [
                0,
                373
            ],
            [
                373,
                659
            ],
            [
                659,
                911
            ],
            [
                911,
                1151
            ],
            [
                1151,
                1231
            ],
            [
                1231,
                1408
            ],
            [
                1408,
                1555
            ],
            [
                1555,
                2025
            ],
            [
                2025,
                2452
            ],
            [
                2452,
                2645
            ],
            [
                2645,
                2746
            ],
            [
                2746,
                2905
            ],
            [
                2905,
                3728
            ],
            [
                3728,
                3784
            ],
            [
                3784,
                3883
            ],
            [
                3883,
                3973
            ],
            [
                3973,
                4125
            ],
            [
                4125,
                4188
            ],
            [
                4188,
                4307
            ],
            [
                4307,
                4521
            ],
            [
                4521,
                5316
            ],
            [
                5316,
                5701
            ],
            [
                5701,
                6017
            ],
            [
                6017,
                6160
            ],
            [
                6160,
                7377
            ],
            [
                7377,
                7746
            ],
            [
                7746,
                7873
            ],
            [
                7873,
                8179
            ],
            [
                8179,
                8724
            ],
            [
                8724,
                9296
            ],
            [
                9296,
                9491
            ],
            [
                9491,
                9823
            ],
            [
                9823,
                9975
            ],
            [
                9975,
                10174
            ],
            [
                10174,
                10833
            ],
            [
                10833,
                11120
            ],
            [
                11120,
                11248
            ],
            [
                11248,
                11491
            ],
            [
                11491,
                11738
            ],
            [
                11738,
                12602
            ],
            [
                12602,
                12622
            ],
            [
                12622,
                13293
            ],
            [
                13293,
                13464
            ],
            [
                13464,
                13715
            ],
            [
                13715,
                13813
            ],
            [
                13813,
                13868
            ],
            [
                13868,
                14252
            ],
            [
                14252,
                14549
            ],
            [
                14549,
                14634
            ],
            [
                14634,
                14787
            ],
            [
                14787,
                14914
            ],
            [
                14914,
                14948
            ],
            [
                14948,
                14983
            ],
            [
                14983,
                15416
            ],
            [
                15416,
                15546
            ],
            [
                15546,
                15785
            ],
            [
                15785,
                16111
            ],
            [
                16111,
                16341
            ],
            [
                16341,
                16585
            ],
            [
                16585,
                16802
            ],
            [
                16802,
                16962
            ],
            [
                16962,
                17188
            ]
        ],
        "segment_chars": [
            [
                0,
                83
            ],
            [
                83,
                373
            ],
            [
                373,
                659
            ],
            [
                659,
                911
            ],
            [
                911,
                1031
            ],
            [
                1031,
                1136
            ],
            [
                1136,
                1151
            ],
            [
                1151,
                1181
            ],
            [
                1181,
                1231
            ],
            [
                1231,
                1294
            ],
            [
                1294,
                1408
            ],
            [
                1408,
                1504
            ],
            [
                1504,
                1555
            ],
            [
                1555,
                1839
            ],
            [
                1839,
                2025
            ],
            [
                2025,
                2372
            ],
            [
                2372,
                2452
            ],
            [
                2452,
                2645
            ],
            [
                2645,
                2697
            ],
            [
                2697,
                2746
            ],
            [
                2746,
                2761
            ],
            [
                2761,
                2787
            ],
            [
                2787,
                2804
            ],
            [
                2804,
                2840
            ],
            [
                2840,
                2905
            ],
            [
                2905,
                3024
            ],
            [
                3024,
                3197
            ],
            [
                3197,
                3363
            ],
            [
                3363,
                3682
            ],
            [
                3682,
                3728
            ],
            [
                3728,
                3762
            ],
            [
                3762,
                3784
            ],
            [
                3784,
                3806
            ],
            [
                3806,
                3883
            ],
            [
                3883,
                3908
            ],
            [
                3908,
                3973
            ],
            [
                3973,
                4125
            ],
            [
                4125,
                4188
            ],
            [
                4188,
                4207
            ],
            [
                4207,
                4231
            ],
            [
                4231,
                4307
            ],
            [
                4307,
                4336
            ],
            [
                4336,
                4414
            ],
            [
                4414,
                4521
            ],
            [
                4521,
                4582
            ],
            [
                4582,
                4689
            ],
            [
                4689,
                4754
            ],
            [
                4754,
                4870
            ],
            [
                4870,
                4992
            ],
            [
                4992,
                5015
            ],
            [
                5015,
                5125
            ],
            [
                5125,
                5195
            ],
            [
                5195,
                5289
            ],
            [
                5289,
                5316
            ],
            [
                5316,
                5467
            ],
            [
                5467,
                5505
            ],
            [
                5505,
                5701
            ],
            [
                5701,
                5929
            ],
            [
                5929,
                5954
            ],
            [
                5954,
                6017
            ],
            [
                6017,
                6089
            ],
            [
                6089,
                6160
            ],
            [
                6160,
                6228
            ],
            [
                6228,
                6251
            ],
            [
                6251,
                6302
            ],
            [
                6302,
                6335
            ],
            [
                6335,
                6393
            ],
            [
                6393,
                6509
            ],
            [
                6509,
                6656
            ],
            [
                6656,
                6699
            ],
            [
                6699,
                6774
            ],
            [
                6774,
                6806
            ],
            [
                6806,
                6891
            ],
            [
                6891,
                6918
            ],
            [
                6918,
                6933
            ],
            [
                6933,
                6990
            ],
            [
                6990,
                7069
            ],
            [
                7069,
                7275
            ],
            [
                7275,
                7345
            ],
            [
                7345,
                7377
            ],
            [
                7377,
                7567
            ],
            [
                7567,
                7611
            ],
            [
                7611,
                7627
            ],
            [
                7627,
                7669
            ],
            [
                7669,
                7746
            ],
            [
                7746,
                7815
            ],
            [
                7815,
                7828
            ],
            [
                7828,
                7873
            ],
            [
                7873,
                8019
            ],
            [
                8019,
                8062
            ],
            [
                8062,
                8139
            ],
            [
                8139,
                8179
            ],
            [
                8179,
                8329
            ],
            [
                8329,
                8513
            ],
            [
                8513,
                8649
            ],
            [
                8649,
                8684
            ],
            [
                8684,
                8724
            ],
            [
                8724,
                8820
            ],
            [
                8820,
                8883
            ],
            [
                8883,
                9025
            ],
            [
                9025,
                9094
            ],
            [
                9094,
                9296
            ],
            [
                9296,
                9491
            ],
            [
                9491,
                9704
            ],
            [
                9704,
                9823
            ],
            [
                9823,
                9975
            ],
            [
                9975,
                10174
            ],
            [
                10174,
                10303
            ],
            [
                10303,
                10833
            ],
            [
                10833,
                10872
            ],
            [
                10872,
                11024
            ],
            [
                11024,
                11120
            ],
            [
                11120,
                11213
            ],
            [
                11213,
                11248
            ],
            [
                11248,
                11460
            ],
            [
                11460,
                11491
            ],
            [
                11491,
                11559
            ],
            [
                11559,
                11632
            ],
            [
                11632,
                11738
            ],
            [
                11738,
                11786
            ],
            [
                11786,
                11972
            ],
            [
                11972,
                12052
            ],
            [
                12052,
                12302
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12479
            ],
            [
                12479,
                12602
            ],
            [
                12602,
                12622
            ],
            [
                12622,
                12779
            ],
            [
                12779,
                13237
            ],
            [
                13237,
                13293
            ],
            [
                13293,
                13329
            ],
            [
                13329,
                13464
            ],
            [
                13464,
                13517
            ],
            [
                13517,
                13602
            ],
            [
                13602,
                13715
            ],
            [
                13715,
                13759
            ],
            [
                13759,
                13813
            ],
            [
                13813,
                13868
            ],
            [
                13868,
                13890
            ],
            [
                13890,
                13931
            ],
            [
                13931,
                14086
            ],
            [
                14086,
                14111
            ],
            [
                14111,
                14252
            ],
            [
                14252,
                14257
            ],
            [
                14257,
                14264
            ],
            [
                14264,
                14332
            ],
            [
                14332,
                14358
            ],
            [
                14358,
                14432
            ],
            [
                14432,
                14549
            ],
            [
                14549,
                14605
            ],
            [
                14605,
                14634
            ],
            [
                14634,
                14639
            ],
            [
                14639,
                14697
            ],
            [
                14697,
                14787
            ],
            [
                14787,
                14914
            ],
            [
                14914,
                14948
            ],
            [
                14948,
                14983
            ],
            [
                14983,
                15042
            ],
            [
                15042,
                15083
            ],
            [
                15083,
                15184
            ],
            [
                15184,
                15240
            ],
            [
                15240,
                15279
            ],
            [
                15279,
                15350
            ],
            [
                15350,
                15416
            ],
            [
                15416,
                15454
            ],
            [
                15454,
                15546
            ],
            [
                15546,
                15785
            ],
            [
                15785,
                15951
            ],
            [
                15951,
                16031
            ],
            [
                16031,
                16111
            ],
            [
                16111,
                16341
            ],
            [
                16341,
                16585
            ],
            [
                16585,
                16619
            ],
            [
                16619,
                16633
            ],
            [
                16633,
                16647
            ],
            [
                16647,
                16694
            ],
            [
                16694,
                16802
            ],
            [
                16802,
                16962
            ],
            [
                16962,
                17188
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                4,
                12
            ],
            [
                21,
                41
            ],
            [
                46,
                64
            ],
            [
                81,
                83
            ],
            [
                87,
                93
            ],
            [
                100,
                168
            ],
            [
                169,
                183
            ],
            [
                184,
                191
            ],
            [
                200,
                283
            ],
            [
                284,
                308
            ],
            [
                308,
                313
            ],
            [
                317,
                320
            ],
            [
                326,
                330
            ],
            [
                341,
                373
            ],
            [
                373,
                474
            ],
            [
                483,
                484
            ],
            [
                485,
                499
            ],
            [
                500,
                555
            ],
            [
                555,
                567
            ],
            [
                575,
                579
            ],
            [
                580,
                614
            ],
            [
                615,
                617
            ],
            [
                618,
                659
            ],
            [
                659,
                674
            ],
            [
                675,
                690
            ],
            [
                691,
                705
            ],
            [
                706,
                780
            ],
            [
                801,
                807
            ],
            [
                808,
                909
            ],
            [
                909,
                911
            ],
            [
                911,
                938
            ],
            [
                939,
                1005
            ],
            [
                1013,
                1029
            ],
            [
                1029,
                1030
            ],
            [
                1031,
                1057
            ],
            [
                1057,
                1094
            ],
            [
                1095,
                1100
            ],
            [
                1107,
                1109
            ],
            [
                1117,
                1134
            ],
            [
                1134,
                1136
            ],
            [
                1136,
                1150
            ],
            [
                1151,
                1181
            ],
            [
                1181,
                1231
            ],
            [
                1231,
                1294
            ],
            [
                1294,
                1408
            ],
            [
                1408,
                1504
            ],
            [
                1504,
                1555
            ],
            [
                1555,
                1576
            ],
            [
                1586,
                1617
            ],
            [
                1617,
                1652
            ],
            [
                1653,
                1738
            ],
            [
                1742,
                1757
            ],
            [
                1758,
                1829
            ],
            [
                1830,
                1837
            ],
            [
                1839,
                1940
            ],
            [
                1940,
                2024
            ],
            [
                2025,
                2103
            ],
            [
                2104,
                2198
            ],
            [
                2206,
                2215
            ],
            [
                2216,
                2247
            ],
            [
                2248,
                2267
            ],
            [
                2268,
                2370
            ],
            [
                2372,
                2395
            ],
            [
                2396,
                2399
            ],
            [
                2400,
                2412
            ],
            [
                2413,
                2416
            ],
            [
                2417,
                2450
            ],
            [
                2450,
                2452
            ],
            [
                2452,
                2508
            ],
            [
                2509,
                2530
            ],
            [
                2530,
                2601
            ],
            [
                2602,
                2645
            ],
            [
                2649,
                2683
            ],
            [
                2684,
                2695
            ],
            [
                2695,
                2696
            ],
            [
                2697,
                2746
            ],
            [
                2746,
                2761
            ],
            [
                2761,
                2787
            ],
            [
                2787,
                2804
            ],
            [
                2804,
                2840
            ],
            [
                2840,
                2905
            ],
            [
                2905,
                2951
            ],
            [
                2951,
                3024
            ],
            [
                3024,
                3064
            ],
            [
                3065,
                3112
            ],
            [
                3113,
                3126
            ],
            [
                3127,
                3130
            ],
            [
                3131,
                3173
            ],
            [
                3174,
                3182
            ],
            [
                3183,
                3197
            ],
            [
                3197,
                3198
            ],
            [
                3198,
                3297
            ],
            [
                3302,
                3316
            ],
            [
                3317,
                3342
            ],
            [
                3355,
                3363
            ],
            [
                3363,
                3377
            ],
            [
                3378,
                3380
            ],
            [
                3381,
                3459
            ],
            [
                3459,
                3478
            ],
            [
                3479,
                3552
            ],
            [
                3572,
                3673
            ],
            [
                3674,
                3682
            ],
            [
                3682,
                3728
            ],
            [
                3728,
                3760
            ],
            [
                3762,
                3784
            ],
            [
                3784,
                3806
            ],
            [
                3806,
                3811
            ],
            [
                3812,
                3816
            ],
            [
                3817,
                3880
            ],
            [
                3880,
                3883
            ],
            [
                3883,
                3908
            ],
            [
                3908,
                3973
            ],
            [
                3973,
                4125
            ],
            [
                4125,
                4188
            ],
            [
                4188,
                4207
            ],
            [
                4207,
                4231
            ],
            [
                4231,
                4307
            ],
            [
                4307,
                4336
            ],
            [
                4336,
                4414
            ],
            [
                4414,
                4521
            ],
            [
                4521,
                4580
            ],
            [
                4580,
                4582
            ],
            [
                4582,
                4609
            ],
            [
                4615,
                4623
            ],
            [
                4623,
                4689
            ],
            [
                4689,
                4692
            ],
            [
                4693,
                4706
            ],
            [
                4707,
                4714
            ],
            [
                4715,
                4754
            ],
            [
                4754,
                4783
            ],
            [
                4784,
                4817
            ],
            [
                4823,
                4841
            ],
            [
                4841,
                4870
            ],
            [
                4870,
                4992
            ],
            [
                4992,
                5015
            ],
            [
                5015,
                5026
            ],
            [
                5027,
                5125
            ],
            [
                5125,
                5195
            ],
            [
                5195,
                5289
            ],
            [
                5289,
                5316
            ],
            [
                5316,
                5467
            ],
            [
                5467,
                5503
            ],
            [
                5503,
                5505
            ],
            [
                5505,
                5522
            ],
            [
                5523,
                5701
            ],
            [
                5701,
                5762
            ],
            [
                5763,
                5782
            ],
            [
                5788,
                5803
            ],
            [
                5803,
                5859
            ],
            [
                5859,
                5864
            ],
            [
                5865,
                5929
            ],
            [
                5929,
                5954
            ],
            [
                5954,
                6017
            ],
            [
                6017,
                6052
            ],
            [
                6059,
                6062
            ],
            [
                6063,
                6075
            ],
            [
                6081,
                6084
            ],
            [
                6085,
                6089
            ],
            [
                6089,
                6160
            ],
            [
                6160,
                6198
            ],
            [
                6199,
                6228
            ],
            [
                6228,
                6249
            ],
            [
                6249,
                6251
            ],
            [
                6251,
                6302
            ],
            [
                6302,
                6321
            ],
            [
                6322,
                6335
            ],
            [
                6335,
                6393
            ],
            [
                6393,
                6397
            ],
            [
                6398,
                6446
            ],
            [
                6447,
                6450
            ],
            [
                6451,
                6456
            ],
            [
                6461,
                6507
            ],
            [
                6507,
                6509
            ],
            [
                6509,
                6543
            ],
            [
                6544,
                6622
            ],
            [
                6623,
                6653
            ],
            [
                6653,
                6656
            ],
            [
                6656,
                6697
            ],
            [
                6697,
                6699
            ],
            [
                6699,
                6757
            ],
            [
                6770,
                6772
            ],
            [
                6772,
                6774
            ],
            [
                6774,
                6806
            ],
            [
                6806,
                6807
            ],
            [
                6812,
                6891
            ],
            [
                6891,
                6916
            ],
            [
                6916,
                6918
            ],
            [
                6918,
                6933
            ],
            [
                6933,
                6940
            ],
            [
                6941,
                6953
            ],
            [
                6954,
                6990
            ],
            [
                6990,
                6992
            ],
            [
                7004,
                7047
            ],
            [
                7052,
                7069
            ],
            [
                7069,
                7205
            ],
            [
                7205,
                7273
            ],
            [
                7273,
                7275
            ],
            [
                7275,
                7278
            ],
            [
                7279,
                7300
            ],
            [
                7303,
                7345
            ],
            [
                7345,
                7377
            ],
            [
                7377,
                7436
            ],
            [
                7437,
                7439
            ],
            [
                7450,
                7481
            ],
            [
                7482,
                7483
            ],
            [
                7484,
                7488
            ],
            [
                7489,
                7496
            ],
            [
                7496,
                7567
            ],
            [
                7567,
                7611
            ],
            [
                7611,
                7621
            ],
            [
                7622,
                7625
            ],
            [
                7625,
                7627
            ],
            [
                7627,
                7669
            ],
            [
                7669,
                7746
            ],
            [
                7746,
                7813
            ],
            [
                7813,
                7815
            ],
            [
                7815,
                7828
            ],
            [
                7828,
                7873
            ],
            [
                7873,
                7906
            ],
            [
                7906,
                7970
            ],
            [
                7974,
                7982
            ],
            [
                7983,
                8008
            ],
            [
                8009,
                8019
            ],
            [
                8019,
                8062
            ],
            [
                8062,
                8110
            ],
            [
                8116,
                8137
            ],
            [
                8137,
                8139
            ],
            [
                8139,
                8179
            ],
            [
                8179,
                8329
            ],
            [
                8329,
                8333
            ],
            [
                8339,
                8457
            ],
            [
                8458,
                8513
            ],
            [
                8513,
                8604
            ],
            [
                8614,
                8649
            ],
            [
                8649,
                8684
            ],
            [
                8684,
                8724
            ],
            [
                8724,
                8770
            ],
            [
                8771,
                8820
            ],
            [
                8820,
                8883
            ],
            [
                8883,
                8891
            ],
            [
                8892,
                8973
            ],
            [
                8974,
                9025
            ],
            [
                9025,
                9092
            ],
            [
                9092,
                9094
            ],
            [
                9094,
                9165
            ],
            [
                9165,
                9277
            ],
            [
                9278,
                9296
            ],
            [
                9296,
                9491
            ],
            [
                9491,
                9502
            ],
            [
                9505,
                9520
            ],
            [
                9521,
                9523
            ],
            [
                9524,
                9527
            ],
            [
                9537,
                9656
            ],
            [
                9657,
                9702
            ],
            [
                9704,
                9794
            ],
            [
                9800,
                9808
            ],
            [
                9820,
                9823
            ],
            [
                9823,
                9949
            ],
            [
                9950,
                9975
            ],
            [
                9975,
                10082
            ],
            [
                10082,
                10119
            ],
            [
                10120,
                10123
            ],
            [
                10124,
                10153
            ],
            [
                10154,
                10161
            ],
            [
                10162,
                10172
            ],
            [
                10172,
                10174
            ],
            [
                10174,
                10199
            ],
            [
                10200,
                10248
            ],
            [
                10249,
                10268
            ],
            [
                10275,
                10289
            ],
            [
                10290,
                10303
            ],
            [
                10303,
                10425
            ],
            [
                10426,
                10476
            ],
            [
                10476,
                10477
            ],
            [
                10478,
                10484
            ],
            [
                10489,
                10491
            ],
            [
                10492,
                10495
            ],
            [
                10496,
                10628
            ],
            [
                10635,
                10671
            ],
            [
                10677,
                10682
            ],
            [
                10683,
                10686
            ],
            [
                10687,
                10695
            ],
            [
                10696,
                10711
            ],
            [
                10715,
                10719
            ],
            [
                10720,
                10728
            ],
            [
                10738,
                10753
            ],
            [
                10754,
                10832
            ],
            [
                10833,
                10872
            ],
            [
                10872,
                10963
            ],
            [
                10964,
                11024
            ],
            [
                11024,
                11096
            ],
            [
                11097,
                11118
            ],
            [
                11118,
                11120
            ],
            [
                11120,
                11213
            ],
            [
                11213,
                11245
            ],
            [
                11245,
                11248
            ],
            [
                11248,
                11328
            ],
            [
                11329,
                11332
            ],
            [
                11333,
                11390
            ],
            [
                11391,
                11402
            ],
            [
                11403,
                11460
            ],
            [
                11460,
                11491
            ],
            [
                11491,
                11539
            ],
            [
                11551,
                11557
            ],
            [
                11557,
                11559
            ],
            [
                11560,
                11632
            ],
            [
                11632,
                11658
            ],
            [
                11665,
                11735
            ],
            [
                11735,
                11738
            ],
            [
                11738,
                11786
            ],
            [
                11786,
                11787
            ],
            [
                11796,
                11925
            ],
            [
                11929,
                11932
            ],
            [
                11933,
                11972
            ],
            [
                11972,
                11984
            ],
            [
                11985,
                12050
            ],
            [
                12050,
                12052
            ],
            [
                12052,
                12058
            ],
            [
                12059,
                12155
            ],
            [
                12156,
                12302
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12327
            ],
            [
                12328,
                12394
            ],
            [
                12395,
                12477
            ],
            [
                12479,
                12481
            ],
            [
                12483,
                12493
            ],
            [
                12493,
                12494
            ],
            [
                12506,
                12544
            ],
            [
                12545,
                12559
            ],
            [
                12560,
                12563
            ],
            [
                12564,
                12572
            ],
            [
                12577,
                12589
            ],
            [
                12590,
                12592
            ],
            [
                12599,
                12602
            ],
            [
                12602,
                12620
            ],
            [
                12620,
                12622
            ],
            [
                12622,
                12748
            ],
            [
                12749,
                12777
            ],
            [
                12777,
                12779
            ],
            [
                12784,
                12792
            ],
            [
                12793,
                12796
            ],
            [
                12797,
                12833
            ],
            [
                12834,
                12902
            ],
            [
                12903,
                12906
            ],
            [
                12907,
                12935
            ],
            [
                12949,
                12999
            ],
            [
                13000,
                13055
            ],
            [
                13056,
                13059
            ],
            [
                13060,
                13078
            ],
            [
                13083,
                13090
            ],
            [
                13091,
                13173
            ],
            [
                13174,
                13193
            ],
            [
                13194,
                13235
            ],
            [
                13237,
                13240
            ],
            [
                13252,
                13262
            ],
            [
                13263,
                13291
            ],
            [
                13291,
                13293
            ],
            [
                13293,
                13296
            ],
            [
                13297,
                13306
            ],
            [
                13307,
                13327
            ],
            [
                13327,
                13329
            ],
            [
                13329,
                13407
            ],
            [
                13408,
                13464
            ],
            [
                13469,
                13500
            ],
            [
                13501,
                13515
            ],
            [
                13515,
                13517
            ],
            [
                13517,
                13534
            ],
            [
                13535,
                13559
            ],
            [
                13560,
                13588
            ],
            [
                13589,
                13600
            ],
            [
                13600,
                13602
            ],
            [
                13602,
                13616
            ],
            [
                13617,
                13713
            ],
            [
                13713,
                13715
            ],
            [
                13715,
                13759
            ],
            [
                13759,
                13813
            ],
            [
                13813,
                13868
            ],
            [
                13868,
                13879
            ],
            [
                13880,
                13890
            ],
            [
                13890,
                13923
            ],
            [
                13929,
                13931
            ],
            [
                13931,
                14007
            ],
            [
                14008,
                14086
            ],
            [
                14086,
                14098
            ],
            [
                14099,
                14101
            ],
            [
                14102,
                14109
            ],
            [
                14109,
                14111
            ],
            [
                14111,
                14205
            ],
            [
                14206,
                14208
            ],
            [
                14208,
                14252
            ],
            [
                14252,
                14257
            ],
            [
                14257,
                14262
            ],
            [
                14262,
                14264
            ],
            [
                14264,
                14278
            ],
            [
                14278,
                14329
            ],
            [
                14329,
                14332
            ],
            [
                14332,
                14358
            ],
            [
                14358,
                14376
            ],
            [
                14377,
                14403
            ],
            [
                14404,
                14415
            ],
            [
                14415,
                14432
            ],
            [
                14432,
                14449
            ],
            [
                14450,
                14503
            ],
            [
                14503,
                14504
            ],
            [
                14509,
                14511
            ],
            [
                14512,
                14516
            ],
            [
                14517,
                14520
            ],
            [
                14521,
                14546
            ],
            [
                14549,
                14605
            ],
            [
                14605,
                14634
            ],
            [
                14634,
                14639
            ],
            [
                14639,
                14697
            ],
            [
                14697,
                14784
            ],
            [
                14787,
                14861
            ],
            [
                14870,
                14880
            ],
            [
                14887,
                14914
            ],
            [
                14914,
                14948
            ],
            [
                14948,
                14983
            ],
            [
                14983,
                15042
            ],
            [
                15042,
                15083
            ],
            [
                15083,
                15101
            ],
            [
                15101,
                15134
            ],
            [
                15134,
                15184
            ],
            [
                15184,
                15240
            ],
            [
                15240,
                15279
            ],
            [
                15279,
                15350
            ],
            [
                15350,
                15374
            ],
            [
                15374,
                15416
            ],
            [
                15416,
                15421
            ],
            [
                15422,
                15452
            ],
            [
                15452,
                15454
            ],
            [
                15454,
                15477
            ],
            [
                15478,
                15545
            ],
            [
                15546,
                15567
            ],
            [
                15587,
                15614
            ],
            [
                15615,
                15642
            ],
            [
                15642,
                15655
            ],
            [
                15656,
                15659
            ],
            [
                15665,
                15669
            ],
            [
                15669,
                15671
            ],
            [
                15672,
                15770
            ],
            [
                15778,
                15785
            ],
            [
                15785,
                15915
            ],
            [
                15916,
                15920
            ],
            [
                15921,
                15934
            ],
            [
                15935,
                15949
            ],
            [
                15949,
                15951
            ],
            [
                15951,
                16031
            ],
            [
                16031,
                16039
            ],
            [
                16040,
                16043
            ],
            [
                16044,
                16111
            ],
            [
                16111,
                16258
            ],
            [
                16258,
                16339
            ],
            [
                16339,
                16341
            ],
            [
                16341,
                16407
            ],
            [
                16415,
                16443
            ],
            [
                16443,
                16504
            ],
            [
                16505,
                16512
            ],
            [
                16517,
                16520
            ],
            [
                16526,
                16549
            ],
            [
                16556,
                16567
            ],
            [
                16574,
                16576
            ],
            [
                16577,
                16583
            ],
            [
                16583,
                16585
            ],
            [
                16585,
                16590
            ],
            [
                16590,
                16619
            ],
            [
                16619,
                16633
            ],
            [
                16633,
                16647
            ],
            [
                16647,
                16694
            ],
            [
                16694,
                16802
            ],
            [
                16802,
                16866
            ],
            [
                16866,
                16871
            ],
            [
                16872,
                16876
            ],
            [
                16877,
                16933
            ],
            [
                16938,
                16962
            ],
            [
                16962,
                16982
            ],
            [
                16983,
                17068
            ],
            [
                17069,
                17119
            ],
            [
                17119,
                17188
            ]
        ],
        "row_chars": [
            [
                0,
                83
            ],
            [
                83,
                373
            ],
            [
                373,
                659
            ],
            [
                659,
                911
            ],
            [
                911,
                1136
            ],
            [
                1136,
                1151
            ],
            [
                1151,
                1151
            ],
            [
                1151,
                1181
            ],
            [
                1181,
                1231
            ],
            [
                1231,
                1294
            ],
            [
                1294,
                1408
            ],
            [
                1408,
                1504
            ],
            [
                1504,
                1555
            ],
            [
                1555,
                2025
            ],
            [
                2025,
                2452
            ],
            [
                2452,
                2645
            ],
            [
                2645,
                2697
            ],
            [
                2697,
                2746
            ],
            [
                2746,
                2761
            ],
            [
                2761,
                2787
            ],
            [
                2787,
                2804
            ],
            [
                2804,
                2840
            ],
            [
                2840,
                2905
            ],
            [
                2905,
                3024
            ],
            [
                3024,
                3197
            ],
            [
                3197,
                3363
            ],
            [
                3363,
                3682
            ],
            [
                3682,
                3728
            ],
            [
                3728,
                3762
            ],
            [
                3762,
                3762
            ],
            [
                3762,
                3784
            ],
            [
                3784,
                3806
            ],
            [
                3806,
                3883
            ],
            [
                3883,
                3908
            ],
            [
                3908,
                3973
            ],
            [
                3973,
                4125
            ],
            [
                4125,
                4188
            ],
            [
                4188,
                4207
            ],
            [
                4207,
                4231
            ],
            [
                4231,
                4307
            ],
            [
                4307,
                4336
            ],
            [
                4336,
                4414
            ],
            [
                4414,
                4521
            ],
            [
                4521,
                4582
            ],
            [
                4582,
                4689
            ],
            [
                4689,
                4754
            ],
            [
                4754,
                4870
            ],
            [
                4870,
                4870
            ],
            [
                4870,
                4992
            ],
            [
                4992,
                5015
            ],
            [
                5015,
                5125
            ],
            [
                5125,
                5195
            ],
            [
                5195,
                5289
            ],
            [
                5289,
                5316
            ],
            [
                5316,
                5467
            ],
            [
                5467,
                5505
            ],
            [
                5505,
                5701
            ],
            [
                5701,
                5929
            ],
            [
                5929,
                5954
            ],
            [
                5954,
                5954
            ],
            [
                5954,
                6017
            ],
            [
                6017,
                6089
            ],
            [
                6089,
                6160
            ],
            [
                6160,
                6228
            ],
            [
                6228,
                6251
            ],
            [
                6251,
                6302
            ],
            [
                6302,
                6335
            ],
            [
                6335,
                6335
            ],
            [
                6335,
                6393
            ],
            [
                6393,
                6509
            ],
            [
                6509,
                6656
            ],
            [
                6656,
                6699
            ],
            [
                6699,
                6774
            ],
            [
                6774,
                6806
            ],
            [
                6806,
                6891
            ],
            [
                6891,
                6918
            ],
            [
                6918,
                6918
            ],
            [
                6918,
                6933
            ],
            [
                6933,
                6990
            ],
            [
                6990,
                6990
            ],
            [
                6990,
                7069
            ],
            [
                7069,
                7275
            ],
            [
                7275,
                7345
            ],
            [
                7345,
                7377
            ],
            [
                7377,
                7567
            ],
            [
                7567,
                7611
            ],
            [
                7611,
                7627
            ],
            [
                7627,
                7669
            ],
            [
                7669,
                7669
            ],
            [
                7669,
                7746
            ],
            [
                7746,
                7815
            ],
            [
                7815,
                7828
            ],
            [
                7828,
                7873
            ],
            [
                7873,
                8019
            ],
            [
                8019,
                8062
            ],
            [
                8062,
                8139
            ],
            [
                8139,
                8179
            ],
            [
                8179,
                8329
            ],
            [
                8329,
                8513
            ],
            [
                8513,
                8649
            ],
            [
                8649,
                8684
            ],
            [
                8684,
                8724
            ],
            [
                8724,
                8820
            ],
            [
                8820,
                8883
            ],
            [
                8883,
                9025
            ],
            [
                9025,
                9025
            ],
            [
                9025,
                9094
            ],
            [
                9094,
                9296
            ],
            [
                9296,
                9491
            ],
            [
                9491,
                9823
            ],
            [
                9823,
                9975
            ],
            [
                9975,
                10174
            ],
            [
                10174,
                10303
            ],
            [
                10303,
                10833
            ],
            [
                10833,
                10872
            ],
            [
                10872,
                11024
            ],
            [
                11024,
                11024
            ],
            [
                11024,
                11120
            ],
            [
                11120,
                11213
            ],
            [
                11213,
                11248
            ],
            [
                11248,
                11460
            ],
            [
                11460,
                11491
            ],
            [
                11491,
                11559
            ],
            [
                11559,
                11632
            ],
            [
                11632,
                11738
            ],
            [
                11738,
                11786
            ],
            [
                11786,
                11972
            ],
            [
                11972,
                11972
            ],
            [
                11972,
                12052
            ],
            [
                12052,
                12302
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12479
            ],
            [
                12479,
                12479
            ],
            [
                12479,
                12602
            ],
            [
                12602,
                12622
            ],
            [
                12622,
                12622
            ],
            [
                12622,
                12622
            ],
            [
                12622,
                12779
            ],
            [
                12779,
                13293
            ],
            [
                13293,
                13329
            ],
            [
                13329,
                13464
            ],
            [
                13464,
                13517
            ],
            [
                13517,
                13602
            ],
            [
                13602,
                13715
            ],
            [
                13715,
                13759
            ],
            [
                13759,
                13813
            ],
            [
                13813,
                13868
            ],
            [
                13868,
                13890
            ],
            [
                13890,
                13931
            ],
            [
                13931,
                14086
            ],
            [
                14086,
                14111
            ],
            [
                14111,
                14252
            ],
            [
                14252,
                14257
            ],
            [
                14257,
                14264
            ],
            [
                14264,
                14332
            ],
            [
                14332,
                14358
            ],
            [
                14358,
                14432
            ],
            [
                14432,
                14549
            ],
            [
                14549,
                14549
            ],
            [
                14549,
                14605
            ],
            [
                14605,
                14634
            ],
            [
                14634,
                14639
            ],
            [
                14639,
                14697
            ],
            [
                14697,
                14787
            ],
            [
                14787,
                14787
            ],
            [
                14787,
                14914
            ],
            [
                14914,
                14948
            ],
            [
                14948,
                14983
            ],
            [
                14983,
                15042
            ],
            [
                15042,
                15083
            ],
            [
                15083,
                15184
            ],
            [
                15184,
                15240
            ],
            [
                15240,
                15279
            ],
            [
                15279,
                15350
            ],
            [
                15350,
                15416
            ],
            [
                15416,
                15454
            ],
            [
                15454,
                15546
            ],
            [
                15546,
                15785
            ],
            [
                15785,
                15951
            ],
            [
                15951,
                16031
            ],
            [
                16031,
                16111
            ],
            [
                16111,
                16341
            ],
            [
                16341,
                16585
            ],
            [
                16585,
                16619
            ],
            [
                16619,
                16633
            ],
            [
                16633,
                16633
            ],
            [
                16633,
                16647
            ],
            [
                16647,
                16694
            ],
            [
                16694,
                16694
            ],
            [
                16694,
                16802
            ],
            [
                16802,
                16962
            ],
            [
                16962,
                17188
            ]
        ]
    }
}