{
    "original": {
        "text": "On reaching home Fanny went immediately upstairs to deposit this unexpected acquisition, this doubtful good of a necklace, in some favourite box in the East room, which held all her smaller treasures; but on opening the door, what was her surprise to find her cousin Edmund there writing at the table! Such a sight having never occurred before, was almost as wonderful as it was welcome.\n\"Fanny,\" said he directly, leaving his seat and his pen, and meeting her with something in his hand, \"I beg your pardon for being here. I came to look for you, and after waiting a little while in hope of your coming in, was making use of your inkstand to explain my errand. You will find the beginning of a note to yourself; but I can now speak my business, which is merely to beg your acceptance of this little trifle-a chain for William's cross. You ought to have had it a week ago, but there has been a delay from my brother's not being in town by several days so soon as I expected; and I have only just now received it at Northampton. I hope you will like the chain itself, Fanny. I endeavoured to consult the simplicity of your taste; but, at any rate, I know you will be kind to my intentions, and consider it, as it really is, a token of the love of one of your oldest friends.\"\nAnd so saying, he was hurrying away, before Fanny, overpowered by a thousand feelings of pain and pleasure, could attempt to speak; but quickened by one sovereign wish, she then called out, \"Oh! cousin, stop a moment, pray stop!\"\nHe turned back.\n\"I cannot attempt to thank you,\" she continued, in a very agitated manner; \"thanks are out of the question. I feel much more than I can possibly express. Your goodness in thinking of me in such a way is beyond-\"\n\"If that is all you have to say, Fanny\" smiling and turning away again.\n\"No, no, it is not. I want to consult you.\"\nAlmost unconsciously she had now undone the parcel he had just put into her hand, and seeing before her, in all the niceness of jewellers' packing, a plain gold chain, perfectly simple and neat, she could not help bursting forth again, \"Oh, this is beautiful indeed! This is the very thing, precisely what I wished for! This is the only ornament I have ever had a desire to possess. It will exactly suit my cross. They must and shall be worn together. It comes, too, in such an acceptable moment. Oh, cousin, you do not know how acceptable it is.\"\n\"My dear Fanny, you feel these things a great deal too much. I am most happy that you like the chain, and that it should be here in time for to-morrow; but your thanks are far beyond the occasion. Believe me, I have no pleasure in the world superior to that of contributing to yours. No, I can safely say, I have no pleasure so complete, so unalloyed. It is without a drawback.\"\nUpon such expressions of affection Fanny could have lived an hour without saying another word; but Edmund, after waiting a moment, obliged her to bring down her mind from its heavenly flight by saying, \"But what is it that you want to consult me about?\"\nIt was about the necklace, which she was now most earnestly longing to return, and hoped to obtain his approbation of her doing. She gave the history of her recent visit, and now her raptures might well be over; for Edmund was so struck with the circumstance, so delighted with what Miss Crawford had done, so gratified by such a coincidence of conduct between them, that Fanny could not but admit the superior power of one pleasure over his own mind, though it might have its drawback. It was some time before she could get his attention to her plan, or any answer to her demand of his opinion: he was in a reverie of fond reflection, uttering only now and then a few half-sentences of praise; but when he did awake and understand, he was very decided in opposing what she wished.\n\"Return the necklace! No, my dear Fanny, upon no account. It would be mortifying her severely. There can hardly be a more unpleasant sensation than the having anything returned on our hands which we have given with a reasonable hope of its contributing to the comfort of a friend. Why should she lose a pleasure which she has shewn herself so deserving of?\"\n\"If it had been given to me in the first instance,\" said Fanny, \"I should not have thought of returning it; but being her brother's present, is not it fair to suppose that she would rather not part with it, when it is not wanted?\"\n\"She must not suppose it not wanted, not acceptable, at least: and its having been originally her brother's gift makes no difference; for as she was not prevented from offering, nor you from taking it on that account, it ought not to prevent you from keeping it. No doubt it is handsomer than mine, and fitter for a ballroom.\"\n\"No, it is not handsomer, not at all handsomer in its way, and, for my purpose, not half so fit. The chain will agree with William's cross beyond all comparison better than the necklace.\"\n\"For one night, Fanny, for only one night, if it _be_ a sacrifice; I am sure you will, upon consideration, make that sacrifice rather than give pain to one who has been so studious of your comfort. Miss Crawford's attentions to you have been-not more than you were justly entitled to-I am the last person to think that _could_ _be_, but they have been invariable; and to be returning them with what must have something the _air_ of ingratitude, though I know it could never have the _meaning_, is not in your nature, I am sure. Wear the necklace, as you are engaged to do, to-morrow evening, and let the chain, which was not ordered with any reference to the ball, be kept for commoner occasions. This is my advice. I would not have the shadow of a coolness between the two whose intimacy I have been observing with the greatest pleasure, and in whose characters there is so much general resemblance in true generosity and natural delicacy as to make the few slight differences, resulting principally from situation, no reasonable hindrance to a perfect friendship. I would not have the shadow of a coolness arise,\" he repeated, his voice sinking a little, \"between the two dearest objects I have on earth.\"\nHe was gone as he spoke; and Fanny remained to tranquillise herself as she could. She was one of his two dearest-that must support her. But the other: the first! She had never heard him speak so openly before, and though it told her no more than what she had long perceived, it was a stab, for it told of his own convictions and views. They were decided. He would marry Miss Crawford. It was a stab, in spite of every long-standing expectation; and she was obliged to repeat again and again, that she was one of his two dearest, before the words gave her any sensation. Could she believe Miss Crawford to deserve him, it would be-oh, how different would it be-how far more tolerable! But he was deceived in her: he gave her merits which she had not; her faults were what they had ever been, but he saw them no longer. Till she had shed many tears over this deception, Fanny could not subdue her agitation; and the dejection which followed could only be relieved by the influence of fervent prayers for his happiness.\nIt was her intention, as she felt it to be her duty, to try to overcome all that was excessive, all that bordered on selfishness, in her affection for Edmund. To call or to fancy it a loss, a disappointment, would be a presumption for which she had not words strong enough to satisfy her own humility. To think of him as Miss Crawford might be justified in thinking, would in her be insanity. To her he could be nothing under any circumstances; nothing dearer than a friend. Why did such an idea occur to her even enough to be reprobated and forbidden? It ought not to have touched on the confines of her imagination. She would endeavour to be rational, and to deserve the right of judging of Miss Crawford's character, and the privilege of true solicitude for him by a sound intellect and an honest heart.\nShe had all the heroism of principle, and was determined to do her duty; but having also many of the feelings of youth and nature, let her not be much wondered at, if, after making all these good resolutions on the side of self-government, she seized the scrap of paper on which Edmund had begun writing to her, as a treasure beyond all her hopes, and reading with the tenderest emotion these words, \"My very dear Fanny, you must do me the favour to accept\" locked it up with the chain, as the dearest part of the gift. It was the only thing approaching to a letter which she had ever received from him; she might never receive another; it was impossible that she ever should receive another so perfectly gratifying in the occasion and the style. Two lines more prized had never fallen from the pen of the most distinguished author-never more completely blessed the researches of the fondest biographer. The enthusiasm of a woman's love is even beyond the biographer's. To her, the handwriting itself, independent of anything it may convey, is a blessedness. Never were such characters cut by any other human being as Edmund's commonest handwriting gave! This specimen, written in haste as it was, had not a fault; and there was a felicity in the flow of the first four words, in the arrangement of \"My very dear Fanny,\" which she could have looked at for ever.\nHaving regulated her thoughts and comforted her feelings by this happy mixture of reason and weakness, she was able in due time to go down and resume her usual employments near her aunt Bertram, and pay her the usual observances without any apparent want of spirits.\nThursday, predestined to hope and enjoyment, came; and opened with more kindness to Fanny than such self-willed, unmanageable days often volunteer, for soon after breakfast a very friendly note was brought from Mr. Crawford to William, stating that as he found himself obliged to go to London on the morrow for a few days, he could not help trying to procure a companion; and therefore hoped that if William could make up his mind to leave Mansfield half a day earlier than had been proposed, he would accept a place in his carriage. Mr. Crawford meant to be in town by his uncle's accustomary late dinner-hour, and William was invited to dine with him at the Admiral's. The proposal was a very pleasant one to William himself, who enjoyed the idea of travelling post with four horses, and such a good-humoured, agreeable friend; and, in likening it to going up with despatches, was saying at once everything in favour of its happiness and dignity which his imagination could suggest; and Fanny, from a different motive, was exceedingly pleased; for the original plan was that William should go up by the mail from Northampton the following night, which would not have allowed him an hour's rest before he must have got into a Portsmouth coach; and though this offer of Mr. Crawford's would rob her of many hours of his company, she was too happy in having William spared from the fatigue of such a journey, to think of anything else. Sir Thomas approved of it for another reason. His nephew's introduction to Admiral Crawford might be of service. The Admiral, he believed, had interest. Upon the whole, it was a very joyous note. Fanny's spirits lived on it half the morning, deriving some accession of pleasure from its writer being himself to go away.\nAs for the ball, so near at hand, she had too many agitations and fears to have half the enjoyment in anticipation which she ought to have had, or must have been supposed to have by the many young ladies looking forward to the same event in situations more at ease, but under circumstances of less novelty, less interest, less peculiar gratification, than would be attributed to her. Miss Price, known only by name to half the people invited, was now to make her first appearance, and must be regarded as the queen of the evening. Who could be happier than Miss Price? But Miss Price had not been brought up to the trade of _coming_ _out_; and had she known in what light this ball was, in general, considered respecting her, it would very much have lessened her comfort by increasing the fears she already had of doing wrong and being looked at. To dance without much observation or any extraordinary fatigue, to have strength and partners for about half the evening, to dance a little with Edmund, and not a great deal with Mr. Crawford, to see William enjoy himself, and be able to keep away from her aunt Norris, was the height of her ambition, and seemed to comprehend her greatest possibility of happiness. As these were the best of her hopes, they could not always prevail; and in the course of a long morning, spent principally with her two aunts, she was often under the influence of much less sanguine views. William, determined to make this last day a day of thorough enjoyment, was out snipe-shooting; Edmund, she had too much reason to suppose, was at the Parsonage; and left alone to bear the worrying of Mrs. Norris, who was cross because the housekeeper would have her own way with the supper, and whom _she_ could not avoid though the housekeeper might, Fanny was worn down at last to think everything an evil belonging to the ball, and when sent off with a parting worry to dress, moved as languidly towards her own room, and felt as incapable of happiness as if she had been allowed no share in it.\nAs she walked slowly upstairs she thought of yesterday; it had been about the same hour that she had returned from the Parsonage, and found Edmund in the East room. \"Suppose I were to find him there again to-day!\" said she to herself, in a fond indulgence of fancy.\n\"Fanny,\" said a voice at that moment near her. Starting and looking up, she saw, across the lobby she had just reached, Edmund himself, standing at the head of a different staircase. He came towards her. \"You look tired and fagged, Fanny. You have been walking too far.\"\n\"No, I have not been out at all.\"\n\"Then you have had fatigues within doors, which are worse. You had better have gone out.\"\nFanny, not liking to complain, found it easiest to make no answer; and though he looked at her with his usual kindness, she believed he had soon ceased to think of her countenance. He did not appear in spirits: something unconnected with her was probably amiss. They proceeded upstairs together, their rooms being on the same floor above.\n\"I come from Dr. Grant's,\" said Edmund presently. \"You may guess my errand there, Fanny.\" And he looked so conscious, that Fanny could think but of one errand, which turned her too sick for speech. \"I wished to engage Miss Crawford for the two first dances,\" was the explanation that followed, and brought Fanny to life again, enabling her, as she found she was expected to speak, to utter something like an inquiry as to the result.\n\"Yes,\" he answered, \"she is engaged to me; but\" (with a smile that did not sit easy) \"she says it is to be the last time that she ever will dance with me. She is not serious. I think, I hope, I am sure she is not serious; but I would rather not hear it. She never has danced with a clergyman, she says, and she never _will_. For my own sake, I could wish there had been no ball just at-I mean not this very week, this very day; to-morrow I leave home.\"\nFanny struggled for speech, and said, \"I am very sorry that anything has occurred to distress you. This ought to be a day of pleasure. My uncle meant it so.\"\n\"Oh yes, yes! and it will be a day of pleasure. It will all end right. I am only vexed for a moment. In fact, it is not that I consider the ball as ill-timed; what does it signify? But, Fanny,\" stopping her, by taking her hand, and speaking low and seriously, \"you know what all this means. You see how it is; and could tell me, perhaps better than I could tell you, how and why I am vexed. Let me talk to you a little. You are a kind, kind listener. I have been pained by her manner this morning, and cannot get the better of it. I know her disposition to be as sweet and faultless as your own, but the influence of her former companions makes her seem-gives to her conversation, to her professed opinions, sometimes a tinge of wrong. She does not _think_ evil, but she speaks it, speaks it in playfulness; and though I know it to be playfulness, it grieves me to the soul.\"\n\"The effect of education,\" said Fanny gently.\nEdmund could not but agree to it. \"Yes, that uncle and aunt! They have injured the finest mind; for sometimes, Fanny, I own to you, it does appear more than manner: it appears as if the mind itself was tainted.\"\nFanny imagined this to be an appeal to her judgment, and therefore, after a moment's consideration, said, \"If you only want me as a listener, cousin, I will be as useful as I can; but I am not qualified for an adviser. Do not ask advice of _me_. I am not competent.\"\n\"You are right, Fanny, to protest against such an office, but you need not be afraid. It is a subject on which I should never ask advice; it is the sort of subject on which it had better never be asked; and few, I imagine, do ask it, but when they want to be influenced against their conscience. I only want to talk to you.\"\n\"One thing more. Excuse the liberty; but take care _how_ you talk to me. Do not tell me anything now, which hereafter you may be sorry for. The time may come-\"\nThe colour rushed into her cheeks as she spoke.\n\"Dearest Fanny!\" cried Edmund, pressing her hand to his lips with almost as much warmth as if it had been Miss Crawford's, \"you are all considerate thought! But it is unnecessary here. The time will never come. No such time as you allude to will ever come. I begin to think it most improbable: the chances grow less and less; and even if it should, there will be nothing to be remembered by either you or me that we need be afraid of, for I can never be ashamed of my own scruples; and if they are removed, it must be by changes that will only raise her character the more by the recollection of the faults she once had. You are the only being upon earth to whom I should say what I have said; but you have always known my opinion of her; you can bear me witness, Fanny, that I have never been blinded. How many a time have we talked over her little errors! You need not fear me; I have almost given up every serious idea of her; but I must be a blockhead indeed, if, whatever befell me, I could think of your kindness and sympathy without the sincerest gratitude.\"\nHe had said enough to shake the experience of eighteen. He had said enough to give Fanny some happier feelings than she had lately known, and with a brighter look, she answered, \"Yes, cousin, I am convinced that _you_ would be incapable of anything else, though perhaps some might not. I cannot be afraid of hearing anything you wish to say. Do not check yourself. Tell me whatever you like.\"\nThey were now on the second floor, and the appearance of a housemaid prevented any farther conversation. For Fanny's present comfort it was concluded, perhaps, at the happiest moment: had he been able to talk another five minutes, there is no saying that he might not have talked away all Miss Crawford's faults and his own despondence. But as it was, they parted with looks on his side of grateful affection, and with some very precious sensations on hers. She had felt nothing like it for hours. Since the first joy from Mr. Crawford's note to William had worn away, she had been in a state absolutely the reverse; there had been no comfort around, no hope within her. Now everything was smiling. William's good fortune returned again upon her mind, and seemed of greater value than at first. The ball, too-such an evening of pleasure before her! It was now a real animation; and she began to dress for it with much of the happy flutter which belongs to a ball. All went well: she did not dislike her own looks; and when she came to the necklaces again, her good fortune seemed complete, for upon trial the one given her by Miss Crawford would by no means go through the ring of the cross. She had, to oblige Edmund, resolved to wear it; but it was too large for the purpose. His, therefore, must be worn; and having, with delightful feelings, joined the chain and the cross-those memorials of the two most beloved of her heart, those dearest tokens so formed for each other by everything real and imaginary-and put them round her neck, and seen and felt how full of William and Edmund they were, she was able, without an effort, to resolve on wearing Miss Crawford's necklace too. She acknowledged it to be right. Miss Crawford had a claim; and when it was no longer to encroach on, to interfere with the stronger claims, the truer kindness of another, she could do her justice even with pleasure to herself. The necklace really looked very well; and Fanny left her room at last, comfortably satisfied with herself and all about her.\nHer aunt Bertram had recollected her on this occasion with an unusual degree of wakefulness. It had really occurred to her, unprompted, that Fanny, preparing for a ball, might be glad of better help than the upper housemaid's, and when dressed herself, she actually sent her own maid to assist her; too late, of course, to be of any use. Mrs. Chapman had just reached the attic floor, when Miss Price came out of her room completely dressed, and only civilities were necessary; but Fanny felt her aunt's attention almost as much as Lady Bertram or Mrs. Chapman could do themselves.",
        "paragraph_chars": [
            [
                0,
                388
            ],
            [
                388,
                1275
            ],
            [
                1275,
                1505
            ],
            [
                1505,
                1521
            ],
            [
                1521,
                1733
            ],
            [
                1733,
                1805
            ],
            [
                1805,
                1849
            ],
            [
                1849,
                2397
            ],
            [
                2397,
                2776
            ],
            [
                2776,
                3030
            ],
            [
                3030,
                3812
            ],
            [
                3812,
                4170
            ],
            [
                4170,
                4401
            ],
            [
                4401,
                4728
            ],
            [
                4728,
                4916
            ],
            [
                4916,
                6124
            ],
            [
                6124,
                7141
            ],
            [
                7141,
                7948
            ],
            [
                7948,
                9310
            ],
            [
                9310,
                9577
            ],
            [
                9577,
                11332
            ],
            [
                11332,
                13350
            ],
            [
                13350,
                13616
            ],
            [
                13616,
                13887
            ],
            [
                13887,
                13921
            ],
            [
                13921,
                14011
            ],
            [
                14011,
                14350
            ],
            [
                14350,
                14784
            ],
            [
                14784,
                15237
            ],
            [
                15237,
                15395
            ],
            [
                15395,
                16271
            ],
            [
                16271,
                16317
            ],
            [
                16317,
                16529
            ],
            [
                16529,
                16796
            ],
            [
                16796,
                17121
            ],
            [
                17121,
                17281
            ],
            [
                17281,
                17329
            ],
            [
                17329,
                18395
            ],
            [
                18395,
                18788
            ],
            [
                18788,
                20825
            ],
            [
                20825,
                21406
            ]
        ],
        "segment_chars": [
            [
                0,
                302
            ],
            [
                302,
                388
            ],
            [
                388,
                524
            ],
            [
                524,
                662
            ],
            [
                662,
                836
            ],
            [
                836,
                1028
            ],
            [
                1028,
                1074
            ],
            [
                1074,
                1275
            ],
            [
                1275,
                1470
            ],
            [
                1470,
                1505
            ],
            [
                1505,
                1521
            ],
            [
                1521,
                1629
            ],
            [
                1629,
                1675
            ],
            [
                1675,
                1733
            ],
            [
                1733,
                1805
            ],
            [
                1805,
                1825
            ],
            [
                1825,
                1849
            ],
            [
                1849,
                2116
            ],
            [
                2116,
                2169
            ],
            [
                2169,
                2232
            ],
            [
                2232,
                2263
            ],
            [
                2263,
                2301
            ],
            [
                2301,
                2346
            ],
            [
                2346,
                2397
            ],
            [
                2397,
                2458
            ],
            [
                2458,
                2594
            ],
            [
                2594,
                2681
            ],
            [
                2681,
                2749
            ],
            [
                2749,
                2776
            ],
            [
                2776,
                3030
            ],
            [
                3030,
                3159
            ],
            [
                3159,
                3517
            ],
            [
                3517,
                3812
            ],
            [
                3812,
                3834
            ],
            [
                3834,
                3870
            ],
            [
                3870,
                3907
            ],
            [
                3907,
                4093
            ],
            [
                4093,
                4170
            ],
            [
                4170,
                4401
            ],
            [
                4401,
                4664
            ],
            [
                4664,
                4728
            ],
            [
                4728,
                4825
            ],
            [
                4825,
                4916
            ],
            [
                4916,
                5114
            ],
            [
                5114,
                5444
            ],
            [
                5444,
                5613
            ],
            [
                5613,
                5632
            ],
            [
                5632,
                5982
            ],
            [
                5982,
                6124
            ],
            [
                6124,
                6206
            ],
            [
                6206,
                6260
            ],
            [
                6260,
                6286
            ],
            [
                6286,
                6460
            ],
            [
                6460,
                6479
            ],
            [
                6479,
                6509
            ],
            [
                6509,
                6694
            ],
            [
                6694,
                6808
            ],
            [
                6808,
                6942
            ],
            [
                6942,
                7141
            ],
            [
                7141,
                7300
            ],
            [
                7300,
                7443
            ],
            [
                7443,
                7534
            ],
            [
                7534,
                7616
            ],
            [
                7616,
                7694
            ],
            [
                7694,
                7759
            ],
            [
                7759,
                7948
            ],
            [
                7948,
                8468
            ],
            [
                8468,
                8695
            ],
            [
                8695,
                8852
            ],
            [
                8852,
                8918
            ],
            [
                8918,
                9007
            ],
            [
                9007,
                9103
            ],
            [
                9103,
                9310
            ],
            [
                9310,
                9577
            ],
            [
                9577,
                10111
            ],
            [
                10111,
                10248
            ],
            [
                10248,
                11012
            ],
            [
                11012,
                11058
            ],
            [
                11058,
                11125
            ],
            [
                11125,
                11165
            ],
            [
                11165,
                11208
            ],
            [
                11208,
                11332
            ],
            [
                11332,
                11716
            ],
            [
                11716,
                11863
            ],
            [
                11863,
                11901
            ],
            [
                11901,
                12179
            ],
            [
                12179,
                12545
            ],
            [
                12545,
                12751
            ],
            [
                12751,
                13350
            ],
            [
                13350,
                13515
            ],
            [
                13515,
                13564
            ],
            [
                13564,
                13616
            ],
            [
                13616,
                13663
            ],
            [
                13663,
                13799
            ],
            [
                13799,
                13820
            ],
            [
                13820,
                13855
            ],
            [
                13855,
                13887
            ],
            [
                13887,
                13921
            ],
            [
                13921,
                13980
            ],
            [
                13980,
                14011
            ],
            [
                14011,
                14192
            ],
            [
                14192,
                14273
            ],
            [
                14273,
                14350
            ],
            [
                14350,
                14400
            ],
            [
                14400,
                14440
            ],
            [
                14440,
                14548
            ],
            [
                14548,
                14784
            ],
            [
                14784,
                14939
            ],
            [
                14939,
                14959
            ],
            [
                14959,
                15038
            ],
            [
                15038,
                15109
            ],
            [
                15109,
                15237
            ],
            [
                15237,
                15336
            ],
            [
                15336,
                15372
            ],
            [
                15372,
                15395
            ],
            [
                15395,
                15409
            ],
            [
                15409,
                15443
            ],
            [
                15443,
                15466
            ],
            [
                15466,
                15496
            ],
            [
                15496,
                15576
            ],
            [
                15576,
                15686
            ],
            [
                15686,
                15786
            ],
            [
                15786,
                15815
            ],
            [
                15815,
                15846
            ],
            [
                15846,
                15926
            ],
            [
                15926,
                16131
            ],
            [
                16131,
                16271
            ],
            [
                16271,
                16317
            ],
            [
                16317,
                16351
            ],
            [
                16351,
                16378
            ],
            [
                16378,
                16529
            ],
            [
                16529,
                16748
            ],
            [
                16748,
                16775
            ],
            [
                16775,
                16796
            ],
            [
                16796,
                16882
            ],
            [
                16882,
                17092
            ],
            [
                17092,
                17121
            ],
            [
                17121,
                17138
            ],
            [
                17138,
                17194
            ],
            [
                17194,
                17261
            ],
            [
                17261,
                17281
            ],
            [
                17281,
                17329
            ],
            [
                17329,
                17346
            ],
            [
                17346,
                17486
            ],
            [
                17486,
                17514
            ],
            [
                17514,
                17540
            ],
            [
                17540,
                17586
            ],
            [
                17586,
                17950
            ],
            [
                17950,
                18132
            ],
            [
                18132,
                18187
            ],
            [
                18187,
                18395
            ],
            [
                18395,
                18451
            ],
            [
                18451,
                18681
            ],
            [
                18681,
                18737
            ],
            [
                18737,
                18760
            ],
            [
                18760,
                18788
            ],
            [
                18788,
                18893
            ],
            [
                18893,
                19125
            ],
            [
                19125,
                19246
            ],
            [
                19246,
                19286
            ],
            [
                19286,
                19459
            ],
            [
                19459,
                19487
            ],
            [
                19487,
                19583
            ],
            [
                19583,
                19637
            ],
            [
                19637,
                19752
            ],
            [
                19752,
                19980
            ],
            [
                19980,
                20066
            ],
            [
                20066,
                20472
            ],
            [
                20472,
                20505
            ],
            [
                20505,
                20700
            ],
            [
                20700,
                20825
            ],
            [
                20825,
                20918
            ],
            [
                20918,
                21163
            ],
            [
                21163,
                21406
            ]
        ],
        "overlap_chars": [
            [
                0,
                27
            ],
            [
                40,
                59
            ],
            [
                89,
                121
            ],
            [
                123,
                125
            ],
            [
                141,
                204
            ],
            [
                226,
                279
            ],
            [
                87,
                88
            ],
            [
                280,
                302
            ],
            [
                302,
                314
            ],
            [
                345,
                358
            ],
            [
                369,
                388
            ],
            [
                388,
                404
            ],
            [
                413,
                431
            ],
            [
                443,
                507
            ],
            [
                522,
                524
            ],
            [
                524,
                551
            ],
            [
                608,
                611
            ],
            [
                640,
                662
            ],
            [
                662,
                792
            ],
            [
                800,
                836
            ],
            [
                1028,
                1048
            ],
            [
                1065,
                1074
            ],
            [
                1074,
                1075
            ],
            [
                1088,
                1132
            ],
            [
                1147,
                1170
            ],
            [
                1187,
                1275
            ],
            [
                1275,
                1388
            ],
            [
                1400,
                1410
            ],
            [
                1442,
                1470
            ],
            [
                1470,
                1505
            ],
            [
                1505,
                1521
            ],
            [
                1521,
                1568
            ],
            [
                1574,
                1587
            ],
            [
                1594,
                1597
            ],
            [
                1629,
                1675
            ],
            [
                1675,
                1706
            ],
            [
                1730,
                1733
            ],
            [
                1733,
                1771
            ],
            [
                1773,
                1805
            ],
            [
                1805,
                1812
            ],
            [
                1823,
                1825
            ],
            [
                1825,
                1849
            ],
            [
                1870,
                1906
            ],
            [
                1921,
                1924
            ],
            [
                1929,
                1941
            ],
            [
                1997,
                2047
            ],
            [
                2072,
                2077
            ],
            [
                2083,
                2116
            ],
            [
                2116,
                2123
            ],
            [
                2140,
                2169
            ],
            [
                2232,
                2263
            ],
            [
                2301,
                2315
            ],
            [
                2319,
                2346
            ],
            [
                2346,
                2397
            ],
            [
                2397,
                2458
            ],
            [
                2458,
                2497
            ],
            [
                2547,
                2594
            ],
            [
                2594,
                2637
            ],
            [
                2650,
                2681
            ],
            [
                2685,
                2749
            ],
            [
                2749,
                2776
            ],
            [
                2776,
                2881
            ],
            [
                2907,
                3030
            ],
            [
                3030,
                3074
            ],
            [
                3090,
                3107
            ],
            [
                3157,
                3159
            ],
            [
                3159,
                3259
            ],
            [
                3293,
                3336
            ],
            [
                3397,
                3401
            ],
            [
                3517,
                3540
            ],
            [
                3402,
                3413
            ],
            [
                3551,
                3554
            ],
            [
                3596,
                3598
            ],
            [
                3569,
                3580
            ],
            [
                3624,
                3665
            ],
            [
                3725,
                3740
            ],
            [
                3751,
                3812
            ],
            [
                3812,
                3834
            ],
            [
                3834,
                3870
            ],
            [
                3870,
                3878
            ],
            [
                3882,
                3886
            ],
            [
                3893,
                3896
            ],
            [
                4170,
                4171
            ],
            [
                4278,
                4375
            ],
            [
                4398,
                4401
            ],
            [
                4401,
                4402
            ],
            [
                4423,
                4425
            ],
            [
                4514,
                4577
            ],
            [
                4599,
                4664
            ],
            [
                4664,
                4693
            ],
            [
                4698,
                4728
            ],
            [
                4728,
                4752
            ],
            [
                4758,
                4764
            ],
            [
                4785,
                4790
            ],
            [
                4808,
                4825
            ],
            [
                4825,
                4916
            ],
            [
                4916,
                4930
            ],
            [
                4943,
                4947
            ],
            [
                4930,
                4938
            ],
            [
                4983,
                5001
            ],
            [
                5023,
                5027
            ],
            [
                5033,
                5084
            ],
            [
                5112,
                5114
            ],
            [
                5444,
                5461
            ],
            [
                5489,
                5525
            ],
            [
                5581,
                5613
            ],
            [
                5613,
                5632
            ],
            [
                5632,
                5795
            ],
            [
                5804,
                5855
            ],
            [
                5980,
                5982
            ],
            [
                5982,
                6124
            ],
            [
                6124,
                6158
            ],
            [
                6184,
                6191
            ],
            [
                6192,
                6206
            ],
            [
                6206,
                6260
            ],
            [
                6260,
                6263
            ],
            [
                6275,
                6286
            ],
            [
                6286,
                6436
            ],
            [
                6453,
                6460
            ],
            [
                6460,
                6478
            ],
            [
                6479,
                6509
            ],
            [
                6694,
                6740
            ],
            [
                6756,
                6808
            ],
            [
                6808,
                6903
            ],
            [
                6909,
                6942
            ],
            [
                6992,
                6997
            ],
            [
                7038,
                7047
            ],
            [
                7063,
                7088
            ],
            [
                7106,
                7141
            ],
            [
                7141,
                7151
            ],
            [
                7188,
                7192
            ],
            [
                7161,
                7162
            ],
            [
                7184,
                7187
            ],
            [
                7152,
                7161
            ],
            [
                7192,
                7235
            ],
            [
                7271,
                7300
            ],
            [
                7311,
                7348
            ],
            [
                7358,
                7413
            ],
            [
                7441,
                7443
            ],
            [
                7443,
                7534
            ],
            [
                7534,
                7552
            ],
            [
                7586,
                7616
            ],
            [
                7616,
                7636
            ],
            [
                7650,
                7654
            ],
            [
                7637,
                7649
            ],
            [
                7692,
                7694
            ],
            [
                7694,
                7702
            ],
            [
                7707,
                7714
            ],
            [
                7742,
                7759
            ],
            [
                7759,
                7793
            ],
            [
                7946,
                7948
            ],
            [
                7948,
                7951
            ],
            [
                7990,
                8036
            ],
            [
                8045,
                8093
            ],
            [
                8099,
                8155
            ],
            [
                8186,
                8251
            ],
            [
                8258,
                8273
            ],
            [
                8300,
                8404
            ],
            [
                8406,
                8468
            ],
            [
                8468,
                8583
            ],
            [
                8693,
                8695
            ],
            [
                8695,
                8779
            ],
            [
                8850,
                8852
            ],
            [
                9167,
                9310
            ],
            [
                9310,
                9425
            ],
            [
                9438,
                9448
            ],
            [
                9487,
                9503
            ],
            [
                9539,
                9577
            ],
            [
                9577,
                9586
            ],
            [
                9873,
                9876
            ],
            [
                10034,
                10037
            ],
            [
                9611,
                9728
            ],
            [
                9734,
                9869
            ],
            [
                9884,
                9902
            ],
            [
                9963,
                9973
            ],
            [
                9977,
                9984
            ],
            [
                10073,
                10109
            ],
            [
                10187,
                10192
            ],
            [
                10216,
                10248
            ],
            [
                10248,
                10295
            ],
            [
                10303,
                10366
            ],
            [
                10439,
                10443
            ],
            [
                10367,
                10371
            ],
            [
                10389,
                10405
            ],
            [
                11010,
                11011
            ],
            [
                10566,
                10601
            ],
            [
                10614,
                10686
            ],
            [
                10723,
                10772
            ],
            [
                10820,
                10832
            ],
            [
                10847,
                10861
            ],
            [
                10838,
                10843
            ],
            [
                10862,
                10878
            ],
            [
                10884,
                10913
            ],
            [
                10918,
                10923
            ],
            [
                10427,
                10429
            ],
            [
                10788,
                10792
            ],
            [
                10934,
                10948
            ],
            [
                10954,
                10983
            ],
            [
                11012,
                11031
            ],
            [
                11038,
                11058
            ],
            [
                11058,
                11125
            ],
            [
                11165,
                11207
            ],
            [
                11332,
                11348
            ],
            [
                11370,
                11382
            ],
            [
                11398,
                11569
            ],
            [
                11714,
                11716
            ],
            [
                11716,
                11726
            ],
            [
                11775,
                11863
            ],
            [
                11863,
                11900
            ],
            [
                11901,
                11955
            ],
            [
                11957,
                11963
            ],
            [
                11966,
                11969
            ],
            [
                11970,
                12017
            ],
            [
                12031,
                12116
            ],
            [
                12121,
                12126
            ],
            [
                12143,
                12179
            ],
            [
                12179,
                12195
            ],
            [
                12241,
                12405
            ],
            [
                12417,
                12479
            ],
            [
                12543,
                12544
            ],
            [
                12751,
                12783
            ],
            [
                12793,
                12821
            ],
            [
                12826,
                12852
            ],
            [
                12890,
                12915
            ],
            [
                13103,
                13108
            ],
            [
                12852,
                12853
            ],
            [
                12916,
                12963
            ],
            [
                13109,
                13180
            ],
            [
                13186,
                13199
            ],
            [
                13221,
                13230
            ],
            [
                12854,
                12857
            ],
            [
                13231,
                13236
            ],
            [
                13240,
                13249
            ],
            [
                13272,
                13280
            ],
            [
                13284,
                13306
            ],
            [
                13348,
                13350
            ],
            [
                13350,
                13405
            ],
            [
                13418,
                13437
            ],
            [
                13443,
                13515
            ],
            [
                13515,
                13564
            ],
            [
                13564,
                13616
            ],
            [
                13616,
                13652
            ],
            [
                13661,
                13663
            ],
            [
                13663,
                13713
            ],
            [
                13734,
                13750
            ],
            [
                13797,
                13799
            ],
            [
                13799,
                13820
            ],
            [
                13820,
                13855
            ],
            [
                13855,
                13887
            ],
            [
                13887,
                13911
            ],
            [
                13918,
                13921
            ],
            [
                13921,
                13978
            ],
            [
                14011,
                14041
            ],
            [
                14067,
                14178
            ],
            [
                14190,
                14192
            ],
            [
                14192,
                14220
            ],
            [
                14271,
                14273
            ],
            [
                14273,
                14305
            ],
            [
                14348,
                14350
            ],
            [
                14350,
                14400
            ],
            [
                14400,
                14440
            ],
            [
                14440,
                14548
            ],
            [
                14548,
                14689
            ],
            [
                14731,
                14784
            ],
            [
                14784,
                14822
            ],
            [
                14924,
                14934
            ],
            [
                14823,
                14884
            ],
            [
                14891,
                14923
            ],
            [
                14937,
                14939
            ],
            [
                14959,
                14975
            ],
            [
                14986,
                15004
            ],
            [
                15036,
                15038
            ],
            [
                15038,
                15100
            ],
            [
                15102,
                15106
            ],
            [
                15109,
                15190
            ],
            [
                15207,
                15237
            ],
            [
                15237,
                15336
            ],
            [
                15336,
                15372
            ],
            [
                15372,
                15395
            ],
            [
                15395,
                15409
            ],
            [
                15409,
                15443
            ],
            [
                15466,
                15496
            ],
            [
                15576,
                15602
            ],
            [
                15606,
                15686
            ],
            [
                15686,
                15689
            ],
            [
                15709,
                15786
            ],
            [
                15786,
                15815
            ],
            [
                15815,
                15846
            ],
            [
                15846,
                15891
            ],
            [
                15924,
                15926
            ],
            [
                15926,
                16074
            ],
            [
                16103,
                16131
            ],
            [
                16131,
                16143
            ],
            [
                16145,
                16150
            ],
            [
                16152,
                16165
            ],
            [
                16177,
                16271
            ],
            [
                16271,
                16317
            ],
            [
                16351,
                16378
            ],
            [
                16378,
                16451
            ],
            [
                16485,
                16529
            ],
            [
                16529,
                16534
            ],
            [
                16595,
                16611
            ],
            [
                16627,
                16746
            ],
            [
                16796,
                16797
            ],
            [
                16858,
                16881
            ],
            [
                16812,
                16817
            ],
            [
                16882,
                16932
            ],
            [
                17090,
                17092
            ],
            [
                17092,
                17121
            ],
            [
                17121,
                17138
            ],
            [
                17138,
                17171
            ],
            [
                17173,
                17176
            ],
            [
                17178,
                17194
            ],
            [
                17194,
                17228
            ],
            [
                17239,
                17261
            ],
            [
                17261,
                17281
            ],
            [
                17281,
                17329
            ],
            [
                17329,
                17346
            ],
            [
                17346,
                17486
            ],
            [
                17486,
                17507
            ],
            [
                17512,
                17514
            ],
            [
                17514,
                17540
            ],
            [
                17586,
                17716
            ],
            [
                17737,
                17809
            ],
            [
                17948,
                17950
            ],
            [
                17950,
                18132
            ],
            [
                18132,
                18187
            ],
            [
                18187,
                18295
            ],
            [
                18317,
                18395
            ],
            [
                18395,
                18451
            ],
            [
                18451,
                18574
            ],
            [
                18681,
                18737
            ],
            [
                18760,
                18788
            ],
            [
                18827,
                18893
            ],
            [
                18893,
                18904
            ],
            [
                18913,
                19018
            ],
            [
                19043,
                19051
            ],
            [
                19056,
                19099
            ],
            [
                19123,
                19124
            ],
            [
                19125,
                19151
            ],
            [
                19163,
                19174
            ],
            [
                19152,
                19156
            ],
            [
                19178,
                19246
            ],
            [
                19459,
                19487
            ],
            [
                19487,
                19524
            ],
            [
                19530,
                19538
            ],
            [
                19581,
                19583
            ],
            [
                19583,
                19637
            ],
            [
                19637,
                19700
            ],
            [
                19709,
                19751
            ],
            [
                19752,
                19881
            ],
            [
                19893,
                19933
            ],
            [
                19946,
                19980
            ],
            [
                20369,
                20375
            ],
            [
                20071,
                20217
            ],
            [
                20297,
                20326
            ],
            [
                20387,
                20399
            ],
            [
                20420,
                20472
            ],
            [
                20472,
                20505
            ],
            [
                20700,
                20792
            ],
            [
                20823,
                20825
            ],
            [
                20825,
                20918
            ],
            [
                20918,
                20924
            ],
            [
                20932,
                20971
            ],
            [
                20995,
                21055
            ],
            [
                21078,
                21163
            ],
            [
                21163,
                21265
            ],
            [
                21301,
                21406
            ]
        ],
        "row_chars": [
            [
                0,
                302
            ],
            [
                302,
                388
            ],
            [
                388,
                524
            ],
            [
                524,
                662
            ],
            [
                662,
                836
            ],
            [
                836,
                1028
            ],
            [
                1028,
                1074
            ],
            [
                1074,
                1275
            ],
            [
                1275,
                1470
            ],
            [
                1470,
                1505
            ],
            [
                1505,
                1521
            ],
            [
                1521,
                1675
            ],
            [
                1675,
                1733
            ],
            [
                1733,
                1805
            ],
            [
                1805,
                1825
            ],
            [
                1825,
                1849
            ],
            [
                1849,
                2116
            ],
            [
                2116,
                2169
            ],
            [
                2169,
                2232
            ],
            [
                2232,
                2263
            ],
            [
                2263,
                2301
            ],
            [
                2301,
                2346
            ],
            [
                2346,
                2397
            ],
            [
                2397,
                2458
            ],
            [
                2458,
                2594
            ],
            [
                2594,
                2681
            ],
            [
                2681,
                2749
            ],
            [
                2749,
                2776
            ],
            [
                2776,
                3030
            ],
            [
                3030,
                3159
            ],
            [
                3159,
                3812
            ],
            [
                3812,
                3834
            ],
            [
                3834,
                3870
            ],
            [
                3870,
                3907
            ],
            [
                3907,
                4093
            ],
            [
                4093,
                4170
            ],
            [
                4170,
                4401
            ],
            [
                4401,
                4664
            ],
            [
                4664,
                4728
            ],
            [
                4728,
                4825
            ],
            [
                4825,
                4916
            ],
            [
                4916,
                5114
            ],
            [
                5114,
                5444
            ],
            [
                5444,
                5613
            ],
            [
                5613,
                5632
            ],
            [
                5632,
                5982
            ],
            [
                5982,
                6124
            ],
            [
                6124,
                6206
            ],
            [
                6206,
                6260
            ],
            [
                6260,
                6286
            ],
            [
                6286,
                6460
            ],
            [
                6460,
                6479
            ],
            [
                6479,
                6509
            ],
            [
                6509,
                6694
            ],
            [
                6694,
                6808
            ],
            [
                6808,
                6942
            ],
            [
                6942,
                7141
            ],
            [
                7141,
                7300
            ],
            [
                7300,
                7443
            ],
            [
                7443,
                7534
            ],
            [
                7534,
                7616
            ],
            [
                7616,
                7694
            ],
            [
                7694,
                7759
            ],
            [
                7759,
                7948
            ],
            [
                7948,
                8468
            ],
            [
                8468,
                8695
            ],
            [
                8695,
                8852
            ],
            [
                8852,
                8918
            ],
            [
                8918,
                9007
            ],
            [
                9007,
                9103
            ],
            [
                9103,
                9310
            ],
            [
                9310,
                9577
            ],
            [
                9577,
                10248
            ],
            [
                10248,
                11012
            ],
            [
                11012,
                11058
            ],
            [
                11058,
                11125
            ],
            [
                11125,
                11165
            ],
            [
                11165,
                11208
            ],
            [
                11208,
                11332
            ],
            [
                11332,
                11716
            ],
            [
                11716,
                11863
            ],
            [
                11863,
                11901
            ],
            [
                11901,
                12179
            ],
            [
                12179,
                12545
            ],
            [
                12545,
                12751
            ],
            [
                12751,
                13350
            ],
            [
                13350,
                13515
            ],
            [
                13515,
                13564
            ],
            [
                13564,
                13616
            ],
            [
                13616,
                13663
            ],
            [
                13663,
                13799
            ],
            [
                13799,
                13820
            ],
            [
                13820,
                13855
            ],
            [
                13855,
                13887
            ],
            [
                13887,
                13921
            ],
            [
                13921,
                13980
            ],
            [
                13980,
                14011
            ],
            [
                14011,
                14192
            ],
            [
                14192,
                14273
            ],
            [
                14273,
                14350
            ],
            [
                14350,
                14400
            ],
            [
                14400,
                14440
            ],
            [
                14440,
                14548
            ],
            [
                14548,
                14784
            ],
            [
                14784,
                14939
            ],
            [
                14939,
                14959
            ],
            [
                14959,
                15038
            ],
            [
                15038,
                15109
            ],
            [
                15109,
                15237
            ],
            [
                15237,
                15336
            ],
            [
                15336,
                15372
            ],
            [
                15372,
                15395
            ],
            [
                15395,
                15409
            ],
            [
                15409,
                15443
            ],
            [
                15443,
                15466
            ],
            [
                15466,
                15496
            ],
            [
                15496,
                15576
            ],
            [
                15576,
                15686
            ],
            [
                15686,
                15786
            ],
            [
                15786,
                15815
            ],
            [
                15815,
                15846
            ],
            [
                15846,
                15926
            ],
            [
                15926,
                16131
            ],
            [
                16131,
                16271
            ],
            [
                16271,
                16317
            ],
            [
                16317,
                16351
            ],
            [
                16351,
                16378
            ],
            [
                16378,
                16529
            ],
            [
                16529,
                16748
            ],
            [
                16748,
                16775
            ],
            [
                16775,
                16796
            ],
            [
                16796,
                16882
            ],
            [
                16882,
                17092
            ],
            [
                17092,
                17121
            ],
            [
                17121,
                17138
            ],
            [
                17138,
                17194
            ],
            [
                17194,
                17261
            ],
            [
                17261,
                17281
            ],
            [
                17281,
                17329
            ],
            [
                17329,
                17346
            ],
            [
                17346,
                17486
            ],
            [
                17486,
                17514
            ],
            [
                17514,
                17540
            ],
            [
                17540,
                17586
            ],
            [
                17586,
                17950
            ],
            [
                17950,
                18132
            ],
            [
                18132,
                18187
            ],
            [
                18187,
                18395
            ],
            [
                18395,
                18451
            ],
            [
                18451,
                18737
            ],
            [
                18737,
                18760
            ],
            [
                18760,
                18788
            ],
            [
                18788,
                18893
            ],
            [
                18893,
                19125
            ],
            [
                19125,
                19246
            ],
            [
                19246,
                19286
            ],
            [
                19286,
                19459
            ],
            [
                19459,
                19487
            ],
            [
                19487,
                19583
            ],
            [
                19583,
                19637
            ],
            [
                19637,
                19752
            ],
            [
                19752,
                19980
            ],
            [
                19980,
                20066
            ],
            [
                20066,
                20472
            ],
            [
                20472,
                20505
            ],
            [
                20505,
                20700
            ],
            [
                20700,
                20825
            ],
            [
                20825,
                20918
            ],
            [
                20918,
                21163
            ],
            [
                21163,
                21406
            ]
        ]
    },
    "abridged": {
        "text": "On reaching home Fanny went upstairs to deposit this doubtful good of a necklace in a box in the East room, which held all her smaller treasures; but what was her surprise to find her cousin Edmund there, writing at the table! Such a sight was almost as astonishing as it was welcome.\n\"Fanny,\" said he, leaving his seat, and meeting her with something in his hand, \"I beg your pardon. I came to look for you, and was writing to explain my errand. You will find the beginning of a note to yourself; but I can now speak my business, which is merely to beg your acceptance of this trifle-a chain for William's cross. I hope you will like it, Fanny. I tried to consult the simplicity of your taste; but I know you will be kind, and consider it, as it really is, a token of the love of one of your oldest friends.\"\nAnd so saying, he was hurrying away, before Fanny, overpowered by a thousand feelings of pain and pleasure, could speak; but, she then called out, \"Oh! cousin, stop a moment, pray stop!\"\nHe turned back.\n\"I cannot attempt to thank you,\" she continued, very agitated; \"I feel much more than I can possibly express. Your goodness in thinking of me-\"\n\"If that is all you have to say, Fanny,\" smiling and turning away again.\n\"No, no. I want to consult you.\"\nShe had now undone the parcel he had given her, and seeing a plain gold chain, perfectly simple and neat, she burst forth, \"Oh, this is beautiful indeed! This is precisely what I wished for! It will exactly suit my cross. It comes, too, at such an acceptable moment. Oh, cousin, you do not know how acceptable it is.\"\n\"My dear Fanny, you feel these things a great deal too much. I am most happy that you like the chain; but your thanks are far beyond the occasion. Believe me, I have no pleasure in the world greater than that of contributing to yours. I can safely say, I have no pleasure so complete, so unalloyed. It is without a drawback.\"\nUpon such expressions of affection Fanny could have lived an hour without saying another word; but Edmund obliged her to bring down her mind from its heavenly flight by saying, \"But what is it that you want to consult me about?\"\nIt was about the necklace, which she was now longing to return. She gave the history of her recent visit, and now her raptures might well be over; for Edmund was so delighted with what Miss Crawford had done, that it was some time before Fanny could get him to attend to her plan: he was in a reverie of fond reflection, but when he did understand, he was very decided in opposing what she wished.\n\"Return the necklace! No, my dear Fanny, upon no account. It would mortify her.\"\n\"But being her brother's present, is not it fair to suppose that she would rather not part with it?\"\n\"It makes no difference; for as she was not prevented from offering it on that account, it ought not to prevent you from keeping it. No doubt it is handsomer than my chain, and fitter for a ballroom.\"\n\"No, it is not handsomer at all, and not half so fit. The chain will agree with William's cross beyond all comparison better than the necklace.\"\n\"For one night only, Fanny, I am sure you will make the sacrifice rather than give pain to one who has been kind. Wear the necklace to-morrow evening, and let the chain be kept for commoner occasions. This is my advice. I would not have the shadow of a coolness between the two whose intimacy I have been observing with the greatest pleasure, and in whose characters there is so much resemblance in true generosity and natural delicacy. I would not have the shadow of a coolness arise,\" he repeated, his voice sinking a little, \"between the two dearest objects I have on earth.\"\nHe was gone as he spoke; and Fanny calmed herself as well as she could. She was one of his two dearest-that must support her. But the first! She had never heard him speak so openly before, and though it told her no more than what she had long perceived, it was a stab, for it told of his own views. They were decided.\nHe would marry Miss Crawford. Could she believe Miss Crawford to deserve him, how different would it be-how far more tolerable! But he was deceived in her: he gave her merits which she had not; her faults were what they had always been, but he saw them no longer. Fanny's dejection could only be relieved by fervent prayers for his happiness.\nIt was her duty, and her intention, to try to overcome all that was excessive in her affection for Edmund. To fancy it a loss, a disappointment, was a presumption for which she had not words strong enough. To think of him as Miss Crawford might be justified in thinking, would in her be insanity. To her he could be nothing dearer than a friend. Why did such an idea even occur to her? It ought never to have entered her imagination. She would endeavour to be rational.\nShe was determined to do her duty; but having also the feelings of youth and nature, let her not be wondered at, if, after making all these good resolutions, she seized the scrap of paper on which Edmund had begun writing, as a treasure. Reading with the tenderest emotion these words, \"My very dear Fanny, you must do me the favour to accept\", she locked it up with the chain, as the dearest part of the gift. It was the only thing approaching to a letter which she had ever received from him; she might never receive another. Two lines more prized had never fallen from the pen of the most distinguished author. There was a felicity in the flow of the first four words, in the arrangement of \"My very dear Fanny,\" which she could have looked at for ever.\nHaving regulated her thoughts and comforted her feelings by this happy mixture of reason and weakness, she was able to go down to her aunt Bertram without any apparent want of spirits.\nThursday, the day of enjoyment, came; and opened with more kindness to Fanny than such self-willed, unmanageable days often volunteer, for after breakfast a very friendly note was brought from Mr. Crawford to William, stating that as he found himself obliged to go to London for a few days, he hoped that William would accept a place in his carriage, and dine with him at the Admiral's. The proposal was a very pleasant one to William, who enjoyed the idea of travelling post with four horses, and with such an agreeable friend.\nFanny, from a different motive, was pleased; for the original plan was that William should go up by the mail, which would not have allowed him an hour's rest; and though Mr. Crawford's offer would rob her of hours of his company, she was happy to have William spared the fatigue of such a journey.\nSir Thomas approved for another reason. His nephew's introduction to Admiral Crawford might be of service. Upon the whole, it was a very joyous note.\nAs for the ball, Fanny had too many fears to have half the enjoyment in anticipation which she ought to have had, or must have been supposed to have by the many young ladies looking forward to the same event. Miss Price was now to make her first appearance, and must be regarded as the queen of the evening. Who could be happier than Miss Price?\nBut Miss Price had not been brought up to the trade of coming out into society; and had she known in what light this ball was considered respecting her, it would very much have lessened her comfort by increasing her fears of doing wrong and being looked at. To dance without being observed, to have strength and partners for about half the evening, to dance a little with Edmund, and not a great deal with Mr. Crawford, to see William enjoy himself, and keep away from her aunt Norris, was the height of her ambition.\nWilliam, determined to make this a day of thorough enjoyment, went out snipe-shooting; Edmund was at the Parsonage; and Fanny, left alone to bear the worrying of Mrs. Norris, was worn down at last to think everything an evil belonging to the ball. When sent off to dress, she moved languidly and felt incapable of happiness.\nAs she walked slowly upstairs she thought of yesterday; at about the same hour she had returned from the Parsonage, and found Edmund in the East room. \"Suppose I were to find him there again to-day!\" said she to herself, in a fond indulgence of fancy.\n\"Fanny,\" said a voice at that moment. Starting and looking up, she saw, across the lobby, Edmund himself. He came towards her. \"You look tired and fagged, Fanny. You have been walking too far.\"\n\"No, I have not been out.\"\n\"Then you have had fatigues within doors, which are worse.\"\nFanny, not liking to complain, made no answer; and though he looked at her with his usual kindness, she believed he had soon ceased to think of her. He did not appear in spirits. They proceeded upstairs together.\n\"I come from Dr. Grant's,\" said Edmund presently. \"You may guess my errand there, Fanny.\" And he looked so conscious, that Fanny could think but of one errand, which turned her too sick for speech. \"I wished to engage Miss Crawford for the two first dances,\" was the explanation that followed, and brought Fanny to life again, enabling her to utter something like an inquiry as to the result.\n\"Yes,\" he answered, \"she is engaged to dance with me; but\" (with a smile that did not sit easy) \"she says it is the last time that she ever will. I think, I hope, she is not serious. She never has danced with a clergyman, she says, and she never will. For my own sake, I could wish there had been no ball just at-I mean not this very day; to-morrow I leave home.\"\nFanny struggled for speech, and said, \"I am very sorry that anything has occurred to distress you. This ought to be a day of pleasure. My uncle meant it so.\"\n\"Oh yes, yes! and it will be a day of pleasure. I am only vexed for a moment. But, Fanny,\" stopping her, taking her hand, and speaking low and seriously, \"you know what all this means. You could tell me, perhaps better than I could tell you, how and why I am vexed. Let me talk to you a little. You are a kind, kind listener. I have been pained by her manner this morning. I know her disposition to be as sweet and faultless as your own, but the influence of her former companions makes her seem-gives to her conversation sometimes a tinge of wrong. She does not think evil, but she speaks it in playfulness; and though I know it to be playfulness, it grieves me to the soul.\"\n\"The effect of education,\" said Fanny gently.\n\"Yes, that uncle and aunt! They have injured the finest mind; for sometimes, Fanny, I own to you, it appears as if the mind itself was tainted.\"\nFanny, after a moment, said, \"If you only want me as a listener, cousin, I will be as useful as I can; but I am not qualified for an adviser.\"\n\"You need not be afraid. Fanny. It is a subject on which I should never ask advice. I only want to talk to you.\"\n\"One thing more. Excuse the liberty; but take care how you talk to me. Do not tell me anything now, which afterwards you may be sorry for. The time may come-\"\nThe colour rushed into her cheeks as she spoke.\n\"Dearest Fanny!\" cried Edmund, pressing her hand to his lips with almost as much warmth as if it had been Miss Crawford's, \"you are all considerate thought! But it is unnecessary. The time will never come. I begin to think it most improbable: the chances grow less and less; and even if it should, there will be nothing to be remembered that we need be afraid of, for I can never be ashamed of my own scruples. You are the only being upon earth to whom I should say what I have said; but you have always known my opinion of her; you can bear me witness, Fanny, that I have never been blinded. How many a time have we talked over her little errors! You need not fear me; I have almost given up every serious idea of her; but I must be a blockhead indeed, if I could think of your kindness and sympathy without the sincerest gratitude.\"\nHe had said enough to shake the experience of eighteen. He had said enough to give Fanny some happier feelings than she had lately known, and with a brighter look, she answered, \"I cannot be afraid of hearing anything you wish to say. Tell me whatever you like.\"\nThe appearance of a housemaid prevented any farther conversation. For Fanny's comfort it was concluded, perhaps, at the happiest moment: had he been able to talk another five minutes, he might have talked away all Miss Crawford's faults.\nBut as it was, they parted on his side with grateful affection, and with some very precious sensations on hers. Now everything was smiling. William's good fortune returned again to her mind. The ball, too-such an evening of pleasure before her! It was now a real animation; and she began to dress for it with the happy flutter which belongs to a ball.\nAll went well: she did not dislike her own looks; and when she came to the necklaces again, her good fortune seemed complete, for the one given her by Miss Crawford would not go through the ring of the cross. Edmund's therefore, must be worn; and having, with delightful feelings, joined the chain and the cross-those memorials of the two most beloved of her heart-and put them round her neck, she was able to resolve on wearing Miss Crawford's necklace too. She acknowledged it to be right. The necklace really looked very well; and Fanny left her room at last, comfortably satisfied.\nHer aunt Bertram had recollected her on this occasion with an unusual degree of wakefulness. It had occurred to her, unprompted, that Fanny might be glad of better help than the upper housemaid's, and she actually sent her own maid to assist her; too late, of course, to be of any use. Mrs. Chapman had just reached the attic floor, when Miss Price came out of her room completely dressed; but Fanny felt her aunt's attention almost as much as Lady Bertram or Mrs. Chapman could do themselves.",
        "paragraph_chars": [
            [
                0,
                285
            ],
            [
                285,
                810
            ],
            [
                810,
                997
            ],
            [
                997,
                1013
            ],
            [
                1013,
                1157
            ],
            [
                1157,
                1230
            ],
            [
                1230,
                1263
            ],
            [
                1263,
                1581
            ],
            [
                1581,
                1907
            ],
            [
                1907,
                2136
            ],
            [
                2136,
                2534
            ],
            [
                2534,
                2615
            ],
            [
                2615,
                2716
            ],
            [
                2716,
                2917
            ],
            [
                2917,
                3062
            ],
            [
                3062,
                3641
            ],
            [
                3641,
                3959
            ],
            [
                3959,
                4302
            ],
            [
                4302,
                4772
            ],
            [
                4772,
                5529
            ],
            [
                5529,
                5714
            ],
            [
                5714,
                6243
            ],
            [
                6243,
                6541
            ],
            [
                6541,
                6691
            ],
            [
                6691,
                7037
            ],
            [
                7037,
                7555
            ],
            [
                7555,
                7880
            ],
            [
                7880,
                8132
            ],
            [
                8132,
                8326
            ],
            [
                8326,
                8353
            ],
            [
                8353,
                8413
            ],
            [
                8413,
                8626
            ],
            [
                8626,
                9019
            ],
            [
                9019,
                9383
            ],
            [
                9383,
                9541
            ],
            [
                9541,
                10218
            ],
            [
                10218,
                10264
            ],
            [
                10264,
                10409
            ],
            [
                10409,
                10552
            ],
            [
                10552,
                10665
            ],
            [
                10665,
                10824
            ],
            [
                10824,
                10872
            ],
            [
                10872,
                11707
            ],
            [
                11707,
                11970
            ],
            [
                11970,
                12208
            ],
            [
                12208,
                12560
            ],
            [
                12560,
                13146
            ],
            [
                13146,
                13639
            ]
        ],
        "segment_chars": [
            [
                0,
                227
            ],
            [
                227,
                285
            ],
            [
                285,
                385
            ],
            [
                385,
                447
            ],
            [
                447,
                614
            ],
            [
                614,
                646
            ],
            [
                646,
                810
            ],
            [
                810,
                962
            ],
            [
                962,
                997
            ],
            [
                997,
                1013
            ],
            [
                1013,
                1123
            ],
            [
                1123,
                1157
            ],
            [
                1157,
                1230
            ],
            [
                1230,
                1239
            ],
            [
                1239,
                1263
            ],
            [
                1263,
                1417
            ],
            [
                1417,
                1454
            ],
            [
                1454,
                1485
            ],
            [
                1485,
                1530
            ],
            [
                1530,
                1581
            ],
            [
                1581,
                1642
            ],
            [
                1642,
                1728
            ],
            [
                1728,
                1816
            ],
            [
                1816,
                1880
            ],
            [
                1880,
                1907
            ],
            [
                1907,
                2136
            ],
            [
                2136,
                2200
            ],
            [
                2200,
                2534
            ],
            [
                2534,
                2556
            ],
            [
                2556,
                2592
            ],
            [
                2592,
                2615
            ],
            [
                2615,
                2716
            ],
            [
                2716,
                2849
            ],
            [
                2849,
                2917
            ],
            [
                2917,
                2971
            ],
            [
                2971,
                3062
            ],
            [
                3062,
                3176
            ],
            [
                3176,
                3263
            ],
            [
                3263,
                3282
            ],
            [
                3282,
                3499
            ],
            [
                3499,
                3641
            ],
            [
                3641,
                3713
            ],
            [
                3713,
                3767
            ],
            [
                3767,
                3782
            ],
            [
                3782,
                3940
            ],
            [
                3940,
                3959
            ],
            [
                3959,
                3989
            ],
            [
                3989,
                4087
            ],
            [
                4087,
                4223
            ],
            [
                4223,
                4302
            ],
            [
                4302,
                4409
            ],
            [
                4409,
                4508
            ],
            [
                4508,
                4599
            ],
            [
                4599,
                4648
            ],
            [
                4648,
                4688
            ],
            [
                4688,
                4736
            ],
            [
                4736,
                4772
            ],
            [
                4772,
                5010
            ],
            [
                5010,
                5183
            ],
            [
                5183,
                5300
            ],
            [
                5300,
                5386
            ],
            [
                5386,
                5529
            ],
            [
                5529,
                5714
            ],
            [
                5714,
                6101
            ],
            [
                6101,
                6243
            ],
            [
                6243,
                6541
            ],
            [
                6541,
                6581
            ],
            [
                6581,
                6648
            ],
            [
                6648,
                6691
            ],
            [
                6691,
                6900
            ],
            [
                6900,
                6999
            ],
            [
                6999,
                7037
            ],
            [
                7037,
                7295
            ],
            [
                7295,
                7555
            ],
            [
                7555,
                7803
            ],
            [
                7803,
                7880
            ],
            [
                7880,
                8031
            ],
            [
                8031,
                8080
            ],
            [
                8080,
                8132
            ],
            [
                8132,
                8170
            ],
            [
                8170,
                8238
            ],
            [
                8238,
                8259
            ],
            [
                8259,
                8294
            ],
            [
                8294,
                8326
            ],
            [
                8326,
                8353
            ],
            [
                8353,
                8413
            ],
            [
                8413,
                8562
            ],
            [
                8562,
                8592
            ],
            [
                8592,
                8626
            ],
            [
                8626,
                8676
            ],
            [
                8676,
                8716
            ],
            [
                8716,
                8824
            ],
            [
                8824,
                9019
            ],
            [
                9019,
                9165
            ],
            [
                9165,
                9202
            ],
            [
                9202,
                9271
            ],
            [
                9271,
                9383
            ],
            [
                9383,
                9482
            ],
            [
                9482,
                9518
            ],
            [
                9518,
                9541
            ],
            [
                9541,
                9555
            ],
            [
                9555,
                9589
            ],
            [
                9589,
                9619
            ],
            [
                9619,
                9726
            ],
            [
                9726,
                9807
            ],
            [
                9807,
                9836
            ],
            [
                9836,
                9867
            ],
            [
                9867,
                9914
            ],
            [
                9914,
                10091
            ],
            [
                10091,
                10218
            ],
            [
                10218,
                10264
            ],
            [
                10264,
                10291
            ],
            [
                10291,
                10409
            ],
            [
                10409,
                10552
            ],
            [
                10552,
                10577
            ],
            [
                10577,
                10584
            ],
            [
                10584,
                10636
            ],
            [
                10636,
                10665
            ],
            [
                10665,
                10682
            ],
            [
                10682,
                10736
            ],
            [
                10736,
                10804
            ],
            [
                10804,
                10824
            ],
            [
                10824,
                10872
            ],
            [
                10872,
                10889
            ],
            [
                10889,
                11029
            ],
            [
                11029,
                11052
            ],
            [
                11052,
                11078
            ],
            [
                11078,
                11283
            ],
            [
                11283,
                11465
            ],
            [
                11465,
                11520
            ],
            [
                11520,
                11707
            ],
            [
                11707,
                11763
            ],
            [
                11763,
                11942
            ],
            [
                11942,
                11970
            ],
            [
                11970,
                12036
            ],
            [
                12036,
                12208
            ],
            [
                12208,
                12320
            ],
            [
                12320,
                12348
            ],
            [
                12348,
                12399
            ],
            [
                12399,
                12453
            ],
            [
                12453,
                12560
            ],
            [
                12560,
                12769
            ],
            [
                12769,
                13019
            ],
            [
                13019,
                13052
            ],
            [
                13052,
                13146
            ],
            [
                13146,
                13239
            ],
            [
                13239,
                13432
            ],
            [
                13432,
                13639
            ]
        ],
        "overlap_chars": [
            [
                0,
                27
            ],
            [
                28,
                47
            ],
            [
                48,
                80
            ],
            [
                81,
                83
            ],
            [
                86,
                149
            ],
            [
                150,
                203
            ],
            [
                203,
                204
            ],
            [
                205,
                227
            ],
            [
                227,
                239
            ],
            [
                240,
                253
            ],
            [
                266,
                285
            ],
            [
                285,
                301
            ],
            [
                301,
                319
            ],
            [
                319,
                383
            ],
            [
                383,
                385
            ],
            [
                385,
                412
            ],
            [
                413,
                416
            ],
            [
                425,
                447
            ],
            [
                447,
                577
            ],
            [
                578,
                614
            ],
            [
                614,
                634
            ],
            [
                637,
                646
            ],
            [
                646,
                647
            ],
            [
                654,
                698
            ],
            [
                699,
                722
            ],
            [
                722,
                810
            ],
            [
                810,
                923
            ],
            [
                924,
                934
            ],
            [
                934,
                962
            ],
            [
                962,
                997
            ],
            [
                997,
                1013
            ],
            [
                1013,
                1060
            ],
            [
                1061,
                1074
            ],
            [
                1074,
                1077
            ],
            [
                1077,
                1123
            ],
            [
                1123,
                1154
            ],
            [
                1154,
                1157
            ],
            [
                1157,
                1195
            ],
            [
                1198,
                1230
            ],
            [
                1230,
                1237
            ],
            [
                1237,
                1239
            ],
            [
                1239,
                1263
            ],
            [
                1263,
                1299
            ],
            [
                1306,
                1309
            ],
            [
                1309,
                1321
            ],
            [
                1322,
                1372
            ],
            [
                1379,
                1384
            ],
            [
                1384,
                1417
            ],
            [
                1417,
                1424
            ],
            [
                1425,
                1454
            ],
            [
                1454,
                1485
            ],
            [
                1485,
                1499
            ],
            [
                1503,
                1530
            ],
            [
                1530,
                1581
            ],
            [
                1581,
                1642
            ],
            [
                1642,
                1681
            ],
            [
                1681,
                1728
            ],
            [
                1728,
                1771
            ],
            [
                1785,
                1816
            ],
            [
                1816,
                1880
            ],
            [
                1880,
                1907
            ],
            [
                1907,
                2012
            ],
            [
                2013,
                2136
            ],
            [
                2136,
                2180
            ],
            [
                2181,
                2198
            ],
            [
                2198,
                2200
            ],
            [
                2200,
                2300
            ],
            [
                2301,
                2344
            ],
            [
                2345,
                2349
            ],
            [
                2350,
                2373
            ],
            [
                2374,
                2385
            ],
            [
                2386,
                2389
            ],
            [
                2394,
                2396
            ],
            [
                2404,
                2415
            ],
            [
                2415,
                2456
            ],
            [
                2457,
                2472
            ],
            [
                2473,
                2534
            ],
            [
                2534,
                2556
            ],
            [
                2556,
                2592
            ],
            [
                2592,
                2600
            ],
            [
                2601,
                2605
            ],
            [
                2609,
                2612
            ],
            [
                2615,
                2616
            ],
            [
                2616,
                2713
            ],
            [
                2713,
                2716
            ],
            [
                2716,
                2717
            ],
            [
                2717,
                2719
            ],
            [
                2720,
                2783
            ],
            [
                2784,
                2849
            ],
            [
                2849,
                2878
            ],
            [
                2887,
                2917
            ],
            [
                2917,
                2941
            ],
            [
                2942,
                2948
            ],
            [
                2948,
                2953
            ],
            [
                2954,
                2971
            ],
            [
                2971,
                3062
            ],
            [
                3062,
                3076
            ],
            [
                3077,
                3081
            ],
            [
                3081,
                3089
            ],
            [
                3090,
                3108
            ],
            [
                3109,
                3113
            ],
            [
                3118,
                3169
            ],
            [
                3174,
                3176
            ],
            [
                3176,
                3193
            ],
            [
                3194,
                3230
            ],
            [
                3231,
                3263
            ],
            [
                3263,
                3282
            ],
            [
                3282,
                3445
            ],
            [
                3446,
                3497
            ],
            [
                3497,
                3499
            ],
            [
                3499,
                3641
            ],
            [
                3641,
                3675
            ],
            [
                3683,
                3690
            ],
            [
                3699,
                3713
            ],
            [
                3713,
                3767
            ],
            [
                3767,
                3770
            ],
            [
                3771,
                3782
            ],
            [
                3782,
                3932
            ],
            [
                3933,
                3940
            ],
            [
                3940,
                3958
            ],
            [
                3959,
                3989
            ],
            [
                3989,
                4035
            ],
            [
                4035,
                4087
            ],
            [
                4087,
                4182
            ],
            [
                4190,
                4223
            ],
            [
                4223,
                4228
            ],
            [
                4231,
                4240
            ],
            [
                4241,
                4266
            ],
            [
                4267,
                4302
            ],
            [
                4302,
                4312
            ],
            [
                4313,
                4317
            ],
            [
                4317,
                4318
            ],
            [
                4323,
                4326
            ],
            [
                4327,
                4336
            ],
            [
                4336,
                4379
            ],
            [
                4380,
                4409
            ],
            [
                4409,
                4446
            ],
            [
                4451,
                4506
            ],
            [
                4506,
                4508
            ],
            [
                4508,
                4599
            ],
            [
                4599,
                4617
            ],
            [
                4618,
                4648
            ],
            [
                4648,
                4668
            ],
            [
                4669,
                4673
            ],
            [
                4674,
                4686
            ],
            [
                4686,
                4688
            ],
            [
                4688,
                4696
            ],
            [
                4703,
                4710
            ],
            [
                4719,
                4736
            ],
            [
                4736,
                4770
            ],
            [
                4770,
                4772
            ],
            [
                4772,
                4775
            ],
            [
                4776,
                4822
            ],
            [
                4823,
                4871
            ],
            [
                4872,
                4928
            ],
            [
                4928,
                4993
            ],
            [
                4993,
                5008
            ],
            [
                5010,
                5114
            ],
            [
                5121,
                5183
            ],
            [
                5183,
                5298
            ],
            [
                5298,
                5300
            ],
            [
                5300,
                5384
            ],
            [
                5384,
                5386
            ],
            [
                5386,
                5529
            ],
            [
                5529,
                5644
            ],
            [
                5645,
                5655
            ],
            [
                5659,
                5675
            ],
            [
                5676,
                5714
            ],
            [
                5714,
                5723
            ],
            [
                5724,
                5727
            ],
            [
                5728,
                5731
            ],
            [
                5735,
                5852
            ],
            [
                5853,
                5988
            ],
            [
                5989,
                6007
            ],
            [
                6008,
                6018
            ],
            [
                6019,
                6026
            ],
            [
                6027,
                6063
            ],
            [
                6063,
                6068
            ],
            [
                6069,
                6101
            ],
            [
                6101,
                6148
            ],
            [
                6148,
                6211
            ],
            [
                6212,
                6216
            ],
            [
                6217,
                6221
            ],
            [
                6225,
                6241
            ],
            [
                6241,
                6242
            ],
            [
                6243,
                6278
            ],
            [
                6279,
                6351
            ],
            [
                6351,
                6400
            ],
            [
                6400,
                6412
            ],
            [
                6413,
                6427
            ],
            [
                6428,
                6433
            ],
            [
                6434,
                6450
            ],
            [
                6451,
                6480
            ],
            [
                6481,
                6486
            ],
            [
                6487,
                6489
            ],
            [
                6490,
                6494
            ],
            [
                6495,
                6509
            ],
            [
                6510,
                6539
            ],
            [
                6541,
                6560
            ],
            [
                6561,
                6581
            ],
            [
                6581,
                6648
            ],
            [
                6648,
                6690
            ],
            [
                6691,
                6707
            ],
            [
                6714,
                6726
            ],
            [
                6727,
                6898
            ],
            [
                6898,
                6900
            ],
            [
                6900,
                6910
            ],
            [
                6911,
                6999
            ],
            [
                6999,
                7036
            ],
            [
                7037,
                7091
            ],
            [
                7092,
                7098
            ],
            [
                7099,
                7102
            ],
            [
                7115,
                7162
            ],
            [
                7163,
                7248
            ],
            [
                7253,
                7258
            ],
            [
                7259,
                7295
            ],
            [
                7295,
                7311
            ],
            [
                7326,
                7490
            ],
            [
                7491,
                7553
            ],
            [
                7553,
                7554
            ],
            [
                7555,
                7587
            ],
            [
                7588,
                7616
            ],
            [
                7622,
                7648
            ],
            [
                7649,
                7674
            ],
            [
                7675,
                7680
            ],
            [
                7680,
                7681
            ],
            [
                7682,
                7729
            ],
            [
                7730,
                7801
            ],
            [
                7803,
                7816
            ],
            [
                7817,
                7826
            ],
            [
                7827,
                7830
            ],
            [
                7831,
                7836
            ],
            [
                7837,
                7846
            ],
            [
                7847,
                7855
            ],
            [
                7856,
                7878
            ],
            [
                7878,
                7880
            ],
            [
                7880,
                7935
            ],
            [
                7939,
                7958
            ],
            [
                7959,
                8031
            ],
            [
                8031,
                8080
            ],
            [
                8080,
                8132
            ],
            [
                8132,
                8168
            ],
            [
                8168,
                8170
            ],
            [
                8170,
                8220
            ],
            [
                8220,
                8236
            ],
            [
                8236,
                8238
            ],
            [
                8238,
                8259
            ],
            [
                8259,
                8294
            ],
            [
                8294,
                8326
            ],
            [
                8326,
                8350
            ],
            [
                8350,
                8353
            ],
            [
                8353,
                8410
            ],
            [
                8413,
                8443
            ],
            [
                8449,
                8560
            ],
            [
                8560,
                8562
            ],
            [
                8562,
                8590
            ],
            [
                8590,
                8592
            ],
            [
                8592,
                8624
            ],
            [
                8624,
                8626
            ],
            [
                8626,
                8676
            ],
            [
                8676,
                8716
            ],
            [
                8716,
                8824
            ],
            [
                8824,
                8965
            ],
            [
                8966,
                9019
            ],
            [
                9019,
                9057
            ],
            [
                9058,
                9068
            ],
            [
                9069,
                9130
            ],
            [
                9131,
                9163
            ],
            [
                9163,
                9165
            ],
            [
                9165,
                9181
            ],
            [
                9182,
                9200
            ],
            [
                9200,
                9202
            ],
            [
                9202,
                9264
            ],
            [
                9265,
                9269
            ],
            [
                9271,
                9352
            ],
            [
                9353,
                9383
            ],
            [
                9383,
                9482
            ],
            [
                9482,
                9518
            ],
            [
                9518,
                9541
            ],
            [
                9541,
                9555
            ],
            [
                9555,
                9589
            ],
            [
                9589,
                9619
            ],
            [
                9619,
                9645
            ],
            [
                9646,
                9726
            ],
            [
                9726,
                9729
            ],
            [
                9730,
                9807
            ],
            [
                9807,
                9836
            ],
            [
                9836,
                9867
            ],
            [
                9867,
                9912
            ],
            [
                9912,
                9914
            ],
            [
                9914,
                10062
            ],
            [
                10063,
                10091
            ],
            [
                10091,
                10103
            ],
            [
                10104,
                10109
            ],
            [
                10110,
                10123
            ],
            [
                10124,
                10218
            ],
            [
                10218,
                10264
            ],
            [
                10264,
                10291
            ],
            [
                10291,
                10364
            ],
            [
                10365,
                10409
            ],
            [
                10409,
                10414
            ],
            [
                10414,
                10430
            ],
            [
                10430,
                10549
            ],
            [
                10552,
                10553
            ],
            [
                10553,
                10576
            ],
            [
                10577,
                10582
            ],
            [
                10584,
                10634
            ],
            [
                10634,
                10636
            ],
            [
                10636,
                10665
            ],
            [
                10665,
                10682
            ],
            [
                10682,
                10715
            ],
            [
                10716,
                10719
            ],
            [
                10720,
                10736
            ],
            [
                10736,
                10770
            ],
            [
                10782,
                10804
            ],
            [
                10804,
                10824
            ],
            [
                10824,
                10872
            ],
            [
                10872,
                10889
            ],
            [
                10889,
                11029
            ],
            [
                11029,
                11050
            ],
            [
                11050,
                11052
            ],
            [
                11052,
                11078
            ],
            [
                11078,
                11208
            ],
            [
                11209,
                11281
            ],
            [
                11281,
                11283
            ],
            [
                11283,
                11465
            ],
            [
                11465,
                11520
            ],
            [
                11520,
                11628
            ],
            [
                11629,
                11707
            ],
            [
                11707,
                11763
            ],
            [
                11763,
                11886
            ],
            [
                11886,
                11942
            ],
            [
                11942,
                11970
            ],
            [
                11970,
                12036
            ],
            [
                12036,
                12047
            ],
            [
                12048,
                12153
            ],
            [
                12154,
                12162
            ],
            [
                12163,
                12206
            ],
            [
                12206,
                12207
            ],
            [
                12208,
                12234
            ],
            [
                12235,
                12246
            ],
            [
                12247,
                12251
            ],
            [
                12252,
                12320
            ],
            [
                12320,
                12348
            ],
            [
                12348,
                12385
            ],
            [
                12389,
                12397
            ],
            [
                12397,
                12399
            ],
            [
                12399,
                12453
            ],
            [
                12453,
                12516
            ],
            [
                12517,
                12559
            ],
            [
                12560,
                12689
            ],
            [
                12690,
                12730
            ],
            [
                12735,
                12769
            ],
            [
                12769,
                12775
            ],
            [
                12778,
                12924
            ],
            [
                12924,
                12953
            ],
            [
                12954,
                12966
            ],
            [
                12967,
                13019
            ],
            [
                13019,
                13052
            ],
            [
                13052,
                13144
            ],
            [
                13144,
                13146
            ],
            [
                13146,
                13239
            ],
            [
                13239,
                13245
            ],
            [
                13246,
                13285
            ],
            [
                13286,
                13346
            ],
            [
                13347,
                13432
            ],
            [
                13432,
                13534
            ],
            [
                13534,
                13639
            ]
        ],
        "row_chars": [
            [
                0,
                227
            ],
            [
                227,
                285
            ],
            [
                285,
                385
            ],
            [
                385,
                447
            ],
            [
                447,
                614
            ],
            [
                614,
                614
            ],
            [
                614,
                646
            ],
            [
                646,
                810
            ],
            [
                810,
                962
            ],
            [
                962,
                997
            ],
            [
                997,
                1013
            ],
            [
                1013,
                1123
            ],
            [
                1123,
                1157
            ],
            [
                1157,
                1230
            ],
            [
                1230,
                1239
            ],
            [
                1239,
                1263
            ],
            [
                1263,
                1417
            ],
            [
                1417,
                1454
            ],
            [
                1454,
                1454
            ],
            [
                1454,
                1485
            ],
            [
                1485,
                1485
            ],
            [
                1485,
                1530
            ],
            [
                1530,
                1581
            ],
            [
                1581,
                1642
            ],
            [
                1642,
                1728
            ],
            [
                1728,
                1816
            ],
            [
                1816,
                1880
            ],
            [
                1880,
                1907
            ],
            [
                1907,
                2136
            ],
            [
                2136,
                2200
            ],
            [
                2200,
                2534
            ],
            [
                2534,
                2556
            ],
            [
                2556,
                2592
            ],
            [
                2592,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2716
            ],
            [
                2716,
                2849
            ],
            [
                2849,
                2917
            ],
            [
                2917,
                2971
            ],
            [
                2971,
                3062
            ],
            [
                3062,
                3176
            ],
            [
                3176,
                3176
            ],
            [
                3176,
                3263
            ],
            [
                3263,
                3282
            ],
            [
                3282,
                3499
            ],
            [
                3499,
                3641
            ],
            [
                3641,
                3713
            ],
            [
                3713,
                3767
            ],
            [
                3767,
                3782
            ],
            [
                3782,
                3940
            ],
            [
                3940,
                3959
            ],
            [
                3959,
                3989
            ],
            [
                3989,
                3989
            ],
            [
                3989,
                4087
            ],
            [
                4087,
                4223
            ],
            [
                4223,
                4302
            ],
            [
                4302,
                4409
            ],
            [
                4409,
                4508
            ],
            [
                4508,
                4599
            ],
            [
                4599,
                4648
            ],
            [
                4648,
                4688
            ],
            [
                4688,
                4736
            ],
            [
                4736,
                4772
            ],
            [
                4772,
                5183
            ],
            [
                5183,
                5300
            ],
            [
                5300,
                5386
            ],
            [
                5386,
                5386
            ],
            [
                5386,
                5386
            ],
            [
                5386,
                5386
            ],
            [
                5386,
                5529
            ],
            [
                5529,
                5714
            ],
            [
                5714,
                6101
            ],
            [
                6101,
                6541
            ],
            [
                6541,
                6581
            ],
            [
                6581,
                6648
            ],
            [
                6648,
                6648
            ],
            [
                6648,
                6691
            ],
            [
                6691,
                6691
            ],
            [
                6691,
                6900
            ],
            [
                6900,
                6999
            ],
            [
                6999,
                7037
            ],
            [
                7037,
                7295
            ],
            [
                7295,
                7555
            ],
            [
                7555,
                7555
            ],
            [
                7555,
                7880
            ],
            [
                7880,
                8031
            ],
            [
                8031,
                8080
            ],
            [
                8080,
                8132
            ],
            [
                8132,
                8170
            ],
            [
                8170,
                8238
            ],
            [
                8238,
                8259
            ],
            [
                8259,
                8294
            ],
            [
                8294,
                8326
            ],
            [
                8326,
                8353
            ],
            [
                8353,
                8413
            ],
            [
                8413,
                8413
            ],
            [
                8413,
                8562
            ],
            [
                8562,
                8592
            ],
            [
                8592,
                8626
            ],
            [
                8626,
                8676
            ],
            [
                8676,
                8716
            ],
            [
                8716,
                8824
            ],
            [
                8824,
                9019
            ],
            [
                9019,
                9165
            ],
            [
                9165,
                9165
            ],
            [
                9165,
                9202
            ],
            [
                9202,
                9271
            ],
            [
                9271,
                9383
            ],
            [
                9383,
                9482
            ],
            [
                9482,
                9518
            ],
            [
                9518,
                9541
            ],
            [
                9541,
                9555
            ],
            [
                9555,
                9589
            ],
            [
                9589,
                9589
            ],
            [
                9589,
                9619
            ],
            [
                9619,
                9619
            ],
            [
                9619,
                9726
            ],
            [
                9726,
                9807
            ],
            [
                9807,
                9836
            ],
            [
                9836,
                9867
            ],
            [
                9867,
                9914
            ],
            [
                9914,
                10091
            ],
            [
                10091,
                10218
            ],
            [
                10218,
                10264
            ],
            [
                10264,
                10264
            ],
            [
                10264,
                10291
            ],
            [
                10291,
                10409
            ],
            [
                10409,
                10552
            ],
            [
                10552,
                10552
            ],
            [
                10552,
                10552
            ],
            [
                10552,
                10584
            ],
            [
                10584,
                10636
            ],
            [
                10636,
                10665
            ],
            [
                10665,
                10682
            ],
            [
                10682,
                10736
            ],
            [
                10736,
                10804
            ],
            [
                10804,
                10824
            ],
            [
                10824,
                10872
            ],
            [
                10872,
                10889
            ],
            [
                10889,
                11029
            ],
            [
                11029,
                11052
            ],
            [
                11052,
                11078
            ],
            [
                11078,
                11078
            ],
            [
                11078,
                11283
            ],
            [
                11283,
                11465
            ],
            [
                11465,
                11520
            ],
            [
                11520,
                11707
            ],
            [
                11707,
                11763
            ],
            [
                11763,
                11942
            ],
            [
                11942,
                11942
            ],
            [
                11942,
                11970
            ],
            [
                11970,
                12036
            ],
            [
                12036,
                12208
            ],
            [
                12208,
                12320
            ],
            [
                12320,
                12320
            ],
            [
                12320,
                12320
            ],
            [
                12320,
                12348
            ],
            [
                12348,
                12399
            ],
            [
                12399,
                12453
            ],
            [
                12453,
                12560
            ],
            [
                12560,
                12769
            ],
            [
                12769,
                12769
            ],
            [
                12769,
                13019
            ],
            [
                13019,
                13052
            ],
            [
                13052,
                13052
            ],
            [
                13052,
                13146
            ],
            [
                13146,
                13239
            ],
            [
                13239,
                13432
            ],
            [
                13432,
                13639
            ]
        ]
    }
}