{
    "original": {
        "text": "Her uncle and both her aunts were in the drawing-room when Fanny went down. To the former she was an interesting object, and he saw with pleasure the general elegance of her appearance, and her being in remarkably good looks. The neatness and propriety of her dress was all that he would allow himself to commend in her presence, but upon her leaving the room again soon afterwards, he spoke of her beauty with very decided praise.\n\"Yes,\" said Lady Bertram, \"she looks very well. I sent Chapman to her.\"\n\"Look well! Oh, yes!\" cried Mrs. Norris, \"she has good reason to look well with all her advantages: brought up in this family as she has been, with all the benefit of her cousins' manners before her. Only think, my dear Sir Thomas, what extraordinary advantages you and I have been the means of giving her. The very gown you have been taking notice of is your own generous present to her when dear Mrs. Rushworth married. What would she have been if we had not taken her by the hand?\"\nSir Thomas said no more; but when they sat down to table the eyes of the two young men assured him that the subject might be gently touched again, when the ladies withdrew, with more success. Fanny saw that she was approved; and the consciousness of looking well made her look still better. From a variety of causes she was happy, and she was soon made still happier; for in following her aunts out of the room, Edmund, who was holding open the door, said, as she passed him, \"You must dance with me, Fanny; you must keep two dances for me; any two that you like, except the first.\" She had nothing more to wish for. She had hardly ever been in a state so nearly approaching high spirits in her life. Her cousins' former gaiety on the day of a ball was no longer surprising to her; she felt it to be indeed very charming, and was actually practising her steps about the drawing-room as long as she could be safe from the notice of her aunt Norris, who was entirely taken up at first in fresh arranging and injuring the noble fire which the butler had prepared.\nHalf an hour followed that would have been at least languid under any other circumstances, but Fanny's happiness still prevailed. It was but to think of her conversation with Edmund, and what was the restlessness of Mrs. Norris? What were the yawns of Lady Bertram?\nThe gentlemen joined them; and soon after began the sweet expectation of a carriage, when a general spirit of ease and enjoyment seemed diffused, and they all stood about and talked and laughed, and every moment had its pleasure and its hope. Fanny felt that there must be a struggle in Edmund's cheerfulness, but it was delightful to see the effort so successfully made.\nWhen the carriages were really heard, when the guests began really to assemble, her own gaiety of heart was much subdued: the sight of so many strangers threw her back into herself; and besides the gravity and formality of the first great circle, which the manners of neither Sir Thomas nor Lady Bertram were of a kind to do away, she found herself occasionally called on to endure something worse. She was introduced here and there by her uncle, and forced to be spoken to, and to curtsey, and speak again. This was a hard duty, and she was never summoned to it without looking at William, as he walked about at his ease in the background of the scene, and longing to be with him.\nThe entrance of the Grants and Crawfords was a favourable epoch. The stiffness of the meeting soon gave way before their popular manners and more diffused intimacies: little groups were formed, and everybody grew comfortable. Fanny felt the advantage; and, drawing back from the toils of civility, would have been again most happy, could she have kept her eyes from wandering between Edmund and Mary Crawford. _She_ looked all loveliness-and what might not be the end of it? Her own musings were brought to an end on perceiving Mr. Crawford before her, and her thoughts were put into another channel by his engaging her almost instantly for the first two dances. Her happiness on this occasion was very much _ la mortal_, finely chequered. To be secure of a partner at first was a most essential good-for the moment of beginning was now growing seriously near; and she so little understood her own claims as to think that if Mr. Crawford had not asked her, she must have been the last to be sought after, and should have received a partner only through a series of inquiry, and bustle, and interference, which would have been terrible; but at the same time there was a pointedness in his manner of asking her which she did not like, and she saw his eye glancing for a moment at her necklace, with a smile-she thought there was a smile-which made her blush and feel wretched. And though there was no second glance to disturb her, though his object seemed then to be only quietly agreeable, she could not get the better of her embarrassment, heightened as it was by the idea of his perceiving it, and had no composure till he turned away to some one else. Then she could gradually rise up to the genuine satisfaction of having a partner, a voluntary partner, secured against the dancing began.\nWhen the company were moving into the ballroom, she found herself for the first time near Miss Crawford, whose eyes and smiles were immediately and more unequivocally directed as her brother's had been, and who was beginning to speak on the subject, when Fanny, anxious to get the story over, hastened to give the explanation of the second necklace: the real chain. Miss Crawford listened; and all her intended compliments and insinuations to Fanny were forgotten: she felt only one thing; and her eyes, bright as they had been before, shewing they could yet be brighter, she exclaimed with eager pleasure, \"Did he? Did Edmund? That was like himself. No other man would have thought of it. I honour him beyond expression.\" And she looked around as if longing to tell him so. He was not near, he was attending a party of ladies out of the room; and Mrs. Grant coming up to the two girls, and taking an arm of each, they followed with the rest.\nFanny's heart sunk, but there was no leisure for thinking long even of Miss Crawford's feelings. They were in the ballroom, the violins were playing, and her mind was in a flutter that forbade its fixing on anything serious. She must watch the general arrangements, and see how everything was done.\nIn a few minutes Sir Thomas came to her, and asked if she were engaged; and the \"Yes, sir; to Mr. Crawford,\" was exactly what he had intended to hear. Mr. Crawford was not far off; Sir Thomas brought him to her, saying something which discovered to Fanny, that _she_ was to lead the way and open the ball; an idea that had never occurred to her before. Whenever she had thought of the minutiae of the evening, it had been as a matter of course that Edmund would begin with Miss Crawford; and the impression was so strong, that though _her_ _uncle_ spoke the contrary, she could not help an exclamation of surprise, a hint of her unfitness, an entreaty even to be excused. To be urging her opinion against Sir Thomas's was a proof of the extremity of the case; but such was her horror at the first suggestion, that she could actually look him in the face and say that she hoped it might be settled otherwise; in vain, however: Sir Thomas smiled, tried to encourage her, and then looked too serious, and said too decidedly, \"It must be so, my dear,\" for her to hazard another word; and she found herself the next moment conducted by Mr. Crawford to the top of the room, and standing there to be joined by the rest of the dancers, couple after couple, as they were formed.\nShe could hardly believe it. To be placed above so many elegant young women! The distinction was too great. It was treating her like her cousins! And her thoughts flew to those absent cousins with most unfeigned and truly tender regret, that they were not at home to take their own place in the room, and have their share of a pleasure which would have been so very delightful to them. So often as she had heard them wish for a ball at home as the greatest of all felicities! And to have them away when it was given-and for _her_ to be opening the ball-and with Mr. Crawford too! She hoped they would not envy her that distinction _now_; but when she looked back to the state of things in the autumn, to what they had all been to each other when once dancing in that house before, the present arrangement was almost more than she could understand herself.\nThe ball began. It was rather honour than happiness to Fanny, for the first dance at least: her partner was in excellent spirits, and tried to impart them to her; but she was a great deal too much frightened to have any enjoyment till she could suppose herself no longer looked at. Young, pretty, and gentle, however, she had no awkwardnesses that were not as good as graces, and there were few persons present that were not disposed to praise her. She was attractive, she was modest, she was Sir Thomas's niece, and she was soon said to be admired by Mr. Crawford. It was enough to give her general favour. Sir Thomas himself was watching her progress down the dance with much complacency; he was proud of his niece; and without attributing all her personal beauty, as Mrs. Norris seemed to do, to her transplantation to Mansfield, he was pleased with himself for having supplied everything else: education and manners she owed to him.\nMiss Crawford saw much of Sir Thomas's thoughts as he stood, and having, in spite of all his wrongs towards her, a general prevailing desire of recommending herself to him, took an opportunity of stepping aside to say something agreeable of Fanny. Her praise was warm, and he received it as she could wish, joining in it as far as discretion, and politeness, and slowness of speech would allow, and certainly appearing to greater advantage on the subject than his lady did soon afterwards, when Mary, perceiving her on a sofa very near, turned round before she began to dance, to compliment her on Miss Price's looks.\n\"Yes, she does look very well,\" was Lady Bertram's placid reply. \"Chapman helped her to dress. I sent Chapman to her.\" Not but that she was really pleased to have Fanny admired; but she was so much more struck with her own kindness in sending Chapman to her, that she could not get it out of her head.\nMiss Crawford knew Mrs. Norris too well to think of gratifying _her_ by commendation of Fanny; to her, it was as the occasion offered-\"Ah! ma'am, how much we want dear Mrs. Rushworth and Julia to-night!\" and Mrs. Norris paid her with as many smiles and courteous words as she had time for, amid so much occupation as she found for herself in making up card-tables, giving hints to Sir Thomas, and trying to move all the chaperons to a better part of the room.\nMiss Crawford blundered most towards Fanny herself in her intentions to please. She meant to be giving her little heart a happy flutter, and filling her with sensations of delightful self-consequence; and, misinterpreting Fanny's blushes, still thought she must be doing so when she went to her after the two first dances, and said, with a significant look, \"Perhaps _you_ can tell me why my brother goes to town to-morrow? He says he has business there, but will not tell me what. The first time he ever denied me his confidence! But this is what we all come to. All are supplanted sooner or later. Now, I must apply to you for information. Pray, what is Henry going for?\"\nFanny protested her ignorance as steadily as her embarrassment allowed.\n\"Well, then,\" replied Miss Crawford, laughing, \"I must suppose it to be purely for the pleasure of conveying your brother, and of talking of you by the way.\"\nFanny was confused, but it was the confusion of discontent; while Miss Crawford wondered she did not smile, and thought her over-anxious, or thought her odd, or thought her anything rather than insensible of pleasure in Henry's attentions. Fanny had a good deal of enjoyment in the course of the evening; but Henry's attentions had very little to do with it. She would much rather _not_ have been asked by him again so very soon, and she wished she had not been obliged to suspect that his previous inquiries of Mrs. Norris, about the supper hour, were all for the sake of securing her at that part of the evening. But it was not to be avoided: he made her feel that she was the object of all; though she could not say that it was unpleasantly done, that there was indelicacy or ostentation in his manner; and sometimes, when he talked of William, he was really not unagreeable, and shewed even a warmth of heart which did him credit. But still his attentions made no part of her satisfaction. She was happy whenever she looked at William, and saw how perfectly he was enjoying himself, in every five minutes that she could walk about with him and hear his account of his partners; she was happy in knowing herself admired; and she was happy in having the two dances with Edmund still to look forward to, during the greatest part of the evening, her hand being so eagerly sought after that her indefinite engagement with _him_ was in continual perspective. She was happy even when they did take place; but not from any flow of spirits on his side, or any such expressions of tender gallantry as had blessed the morning. His mind was fagged, and her happiness sprung from being the friend with whom it could find repose. \"I am worn out with civility,\" said he. \"I have been talking incessantly all night, and with nothing to say. But with _you_, Fanny, there may be peace. You will not want to be talked to. Let us have the luxury of silence.\" Fanny would hardly even speak her agreement. A weariness, arising probably, in great measure, from the same feelings which he had acknowledged in the morning, was peculiarly to be respected, and they went down their two dances together with such sober tranquillity as might satisfy any looker-on that Sir Thomas had been bringing up no wife for his younger son.\nThe evening had afforded Edmund little pleasure. Miss Crawford had been in gay spirits when they first danced together, but it was not her gaiety that could do him good: it rather sank than raised his comfort; and afterwards, for he found himself still impelled to seek her again, she had absolutely pained him by her manner of speaking of the profession to which he was now on the point of belonging. They had talked, and they had been silent; he had reasoned, she had ridiculed; and they had parted at last with mutual vexation. Fanny, not able to refrain entirely from observing them, had seen enough to be tolerably satisfied. It was barbarous to be happy when Edmund was suffering. Yet some happiness must and would arise from the very conviction that he did suffer.\nWhen her two dances with him were over, her inclination and strength for more were pretty well at an end; and Sir Thomas, having seen her walk rather than dance down the shortening set, breathless, and with her hand at her side, gave his orders for her sitting down entirely. From that time Mr. Crawford sat down likewise.\n\"Poor Fanny!\" cried William, coming for a moment to visit her, and working away his partner's fan as if for life, \"how soon she is knocked up! Why, the sport is but just begun. I hope we shall keep it up these two hours. How can you be tired so soon?\"\n\"So soon! my good friend,\" said Sir Thomas, producing his watch with all necessary caution; \"it is three o'clock, and your sister is not used to these sort of hours.\"\n\"Well, then, Fanny, you shall not get up to-morrow before I go. Sleep as long as you can, and never mind me.\"\n\"Oh! William.\"\n\"What! Did she think of being up before you set off?\"\n\"Oh! yes, sir,\" cried Fanny, rising eagerly from her seat to be nearer her uncle; \"I must get up and breakfast with him. It will be the last time, you know; the last morning.\"\n\"You had better not. He is to have breakfasted and be gone by half-past nine. Mr. Crawford, I think you call for him at half-past nine?\"\nFanny was too urgent, however, and had too many tears in her eyes for denial; and it ended in a gracious \"Well, well!\" which was permission.\n\"Yes, half-past nine,\" said Crawford to William as the latter was leaving them, \"and I shall be punctual, for there will be no kind sister to get up for _me_.\" And in a lower tone to Fanny, \"I shall have only a desolate house to hurry from. Your brother will find my ideas of time and his own very different to-morrow.\"\nAfter a short consideration, Sir Thomas asked Crawford to join the early breakfast party in that house instead of eating alone: he should himself be of it; and the readiness with which his invitation was accepted convinced him that the suspicions whence, he must confess to himself, this very ball had in great measure sprung, were well founded. Mr. Crawford was in love with Fanny. He had a pleasing anticipation of what would be. His niece, meanwhile, did not thank him for what he had just done. She had hoped to have William all to herself the last morning. It would have been an unspeakable indulgence. But though her wishes were overthrown, there was no spirit of murmuring within her. On the contrary, she was so totally unused to have her pleasure consulted, or to have anything take place at all in the way she could desire, that she was more disposed to wonder and rejoice in having carried her point so far, than to repine at the counteraction which followed.\nShortly afterward, Sir Thomas was again interfering a little with her inclination, by advising her to go immediately to bed. \"Advise\" was his word, but it was the advice of absolute power, and she had only to rise, and, with Mr. Crawford's very cordial adieus, pass quietly away; stopping at the entrance-door, like the Lady of Branxholm Hall, \"one moment and no more,\" to view the happy scene, and take a last look at the five or six determined couple who were still hard at work; and then, creeping slowly up the principal staircase, pursued by the ceaseless country-dance, feverish with hopes and fears, soup and negus, sore-footed and fatigued, restless and agitated, yet feeling, in spite of everything, that a ball was indeed delightful.\nIn thus sending her away, Sir Thomas perhaps might not be thinking merely of her health. It might occur to him that Mr. Crawford had been sitting by her long enough, or he might mean to recommend her as a wife by shewing her persuadableness.",
        "paragraph_chars": [
            [
                0,
                432
            ],
            [
                432,
                504
            ],
            [
                504,
                989
            ],
            [
                989,
                2050
            ],
            [
                2050,
                2316
            ],
            [
                2316,
                2688
            ],
            [
                2688,
                3370
            ],
            [
                3370,
                5162
            ],
            [
                5162,
                6105
            ],
            [
                6105,
                6404
            ],
            [
                6404,
                7674
            ],
            [
                7674,
                8530
            ],
            [
                8530,
                9467
            ],
            [
                9467,
                10085
            ],
            [
                10085,
                10387
            ],
            [
                10387,
                10847
            ],
            [
                10847,
                11521
            ],
            [
                11521,
                11593
            ],
            [
                11593,
                11751
            ],
            [
                11751,
                14056
            ],
            [
                14056,
                14828
            ],
            [
                14828,
                15151
            ],
            [
                15151,
                15403
            ],
            [
                15403,
                15570
            ],
            [
                15570,
                15680
            ],
            [
                15680,
                15695
            ],
            [
                15695,
                15749
            ],
            [
                15749,
                15925
            ],
            [
                15925,
                16062
            ],
            [
                16062,
                16203
            ],
            [
                16203,
                16523
            ],
            [
                16523,
                17494
            ],
            [
                17494,
                18238
            ],
            [
                18238,
                18479
            ]
        ],
        "segment_chars": [
            [
                0,
                76
            ],
            [
                76,
                226
            ],
            [
                226,
                432
            ],
            [
                432,
                480
            ],
            [
                480,
                504
            ],
            [
                504,
                516
            ],
            [
                516,
                526
            ],
            [
                526,
                704
            ],
            [
                704,
                811
            ],
            [
                811,
                926
            ],
            [
                926,
                989
            ],
            [
                989,
                1181
            ],
            [
                1181,
                1280
            ],
            [
                1280,
                1572
            ],
            [
                1572,
                1606
            ],
            [
                1606,
                1690
            ],
            [
                1690,
                2050
            ],
            [
                2050,
                2180
            ],
            [
                2180,
                2279
            ],
            [
                2279,
                2316
            ],
            [
                2316,
                2559
            ],
            [
                2559,
                2688
            ],
            [
                2688,
                3087
            ],
            [
                3087,
                3196
            ],
            [
                3196,
                3370
            ],
            [
                3370,
                3435
            ],
            [
                3435,
                3596
            ],
            [
                3596,
                3780
            ],
            [
                3780,
                3845
            ],
            [
                3845,
                4033
            ],
            [
                4033,
                4110
            ],
            [
                4110,
                4745
            ],
            [
                4745,
                5024
            ],
            [
                5024,
                5162
            ],
            [
                5162,
                5528
            ],
            [
                5528,
                5778
            ],
            [
                5778,
                5790
            ],
            [
                5790,
                5813
            ],
            [
                5813,
                5852
            ],
            [
                5852,
                5885
            ],
            [
                5885,
                5937
            ],
            [
                5937,
                6105
            ],
            [
                6105,
                6202
            ],
            [
                6202,
                6330
            ],
            [
                6330,
                6404
            ],
            [
                6404,
                6555
            ],
            [
                6555,
                6757
            ],
            [
                6757,
                7076
            ],
            [
                7076,
                7674
            ],
            [
                7674,
                7703
            ],
            [
                7703,
                7751
            ],
            [
                7751,
                7782
            ],
            [
                7782,
                7820
            ],
            [
                7820,
                8060
            ],
            [
                8060,
                8150
            ],
            [
                8150,
                8254
            ],
            [
                8254,
                8530
            ],
            [
                8530,
                8546
            ],
            [
                8546,
                8812
            ],
            [
                8812,
                8979
            ],
            [
                8979,
                9096
            ],
            [
                9096,
                9138
            ],
            [
                9138,
                9467
            ],
            [
                9467,
                9715
            ],
            [
                9715,
                10085
            ],
            [
                10085,
                10150
            ],
            [
                10150,
                10180
            ],
            [
                10180,
                10204
            ],
            [
                10204,
                10387
            ],
            [
                10387,
                10526
            ],
            [
                10526,
                10591
            ],
            [
                10591,
                10847
            ],
            [
                10847,
                10927
            ],
            [
                10927,
                11271
            ],
            [
                11271,
                11329
            ],
            [
                11329,
                11378
            ],
            [
                11378,
                11411
            ],
            [
                11411,
                11447
            ],
            [
                11447,
                11489
            ],
            [
                11489,
                11521
            ],
            [
                11521,
                11593
            ],
            [
                11593,
                11751
            ],
            [
                11751,
                11991
            ],
            [
                11991,
                12110
            ],
            [
                12110,
                12366
            ],
            [
                12366,
                12686
            ],
            [
                12686,
                12745
            ],
            [
                12745,
                13208
            ],
            [
                13208,
                13371
            ],
            [
                13371,
                13471
            ],
            [
                13471,
                13511
            ],
            [
                13511,
                13580
            ],
            [
                13580,
                13623
            ],
            [
                13623,
                13658
            ],
            [
                13658,
                13694
            ],
            [
                13694,
                13739
            ],
            [
                13739,
                14056
            ],
            [
                14056,
                14105
            ],
            [
                14105,
                14458
            ],
            [
                14458,
                14587
            ],
            [
                14587,
                14687
            ],
            [
                14687,
                14743
            ],
            [
                14743,
                14828
            ],
            [
                14828,
                15104
            ],
            [
                15104,
                15151
            ],
            [
                15151,
                15165
            ],
            [
                15165,
                15294
            ],
            [
                15294,
                15328
            ],
            [
                15328,
                15372
            ],
            [
                15372,
                15403
            ],
            [
                15403,
                15413
            ],
            [
                15413,
                15570
            ],
            [
                15570,
                15634
            ],
            [
                15634,
                15680
            ],
            [
                15680,
                15685
            ],
            [
                15685,
                15695
            ],
            [
                15695,
                15702
            ],
            [
                15702,
                15749
            ],
            [
                15749,
                15754
            ],
            [
                15754,
                15870
            ],
            [
                15870,
                15925
            ],
            [
                15925,
                15946
            ],
            [
                15946,
                16003
            ],
            [
                16003,
                16062
            ],
            [
                16062,
                16181
            ],
            [
                16181,
                16203
            ],
            [
                16203,
                16363
            ],
            [
                16363,
                16444
            ],
            [
                16444,
                16523
            ],
            [
                16523,
                16869
            ],
            [
                16869,
                16906
            ],
            [
                16906,
                16955
            ],
            [
                16955,
                17022
            ],
            [
                17022,
                17085
            ],
            [
                17085,
                17131
            ],
            [
                17131,
                17215
            ],
            [
                17215,
                17494
            ],
            [
                17494,
                17619
            ],
            [
                17619,
                18238
            ],
            [
                18238,
                18327
            ],
            [
                18327,
                18479
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                19,
                76
            ],
            [
                79,
                89
            ],
            [
                128,
                149
            ],
            [
                158,
                184
            ],
            [
                224,
                226
            ],
            [
                226,
                287
            ],
            [
                305,
                359
            ],
            [
                381,
                410
            ],
            [
                416,
                432
            ],
            [
                432,
                480
            ],
            [
                480,
                504
            ],
            [
                504,
                516
            ],
            [
                516,
                526
            ],
            [
                526,
                704
            ],
            [
                926,
                974
            ],
            [
                982,
                989
            ],
            [
                1018,
                1075
            ],
            [
                1181,
                1186
            ],
            [
                1191,
                1280
            ],
            [
                1401,
                1407
            ],
            [
                1440,
                1444
            ],
            [
                1463,
                1496
            ],
            [
                1506,
                1572
            ],
            [
                1572,
                1606
            ],
            [
                1606,
                1644
            ],
            [
                1664,
                1690
            ],
            [
                1771,
                1779
            ],
            [
                1731,
                1741
            ],
            [
                1789,
                1871
            ],
            [
                2048,
                2050
            ],
            [
                2347,
                2351
            ],
            [
                2358,
                2400
            ],
            [
                2466,
                2559
            ],
            [
                2559,
                2688
            ],
            [
                2726,
                2747
            ],
            [
                2755,
                2782
            ],
            [
                2792,
                2873
            ],
            [
                3087,
                3134
            ],
            [
                3019,
                3036
            ],
            [
                3139,
                3196
            ],
            [
                3196,
                3266
            ],
            [
                3267,
                3278
            ],
            [
                3285,
                3309
            ],
            [
                3368,
                3370
            ],
            [
                3370,
                3410
            ],
            [
                3562,
                3563
            ],
            [
                3439,
                3448
            ],
            [
                3469,
                3506
            ],
            [
                3535,
                3536
            ],
            [
                3568,
                3596
            ],
            [
                3596,
                3601
            ],
            [
                3668,
                3780
            ],
            [
                3781,
                3784
            ],
            [
                3786,
                3844
            ],
            [
                3845,
                3848
            ],
            [
                3853,
                3865
            ],
            [
                3884,
                3886
            ],
            [
                3898,
                3921
            ],
            [
                3927,
                3930
            ],
            [
                4007,
                4033
            ],
            [
                4033,
                4067
            ],
            [
                4092,
                4110
            ],
            [
                4110,
                4174
            ],
            [
                4235,
                4373
            ],
            [
                4504,
                4674
            ],
            [
                4705,
                4745
            ],
            [
                4857,
                4862
            ],
            [
                4969,
                5024
            ],
            [
                5024,
                5104
            ],
            [
                5127,
                5134
            ],
            [
                5143,
                5162
            ],
            [
                5162,
                5227
            ],
            [
                5247,
                5266
            ],
            [
                5278,
                5281
            ],
            [
                5455,
                5466
            ],
            [
                5491,
                5510
            ],
            [
                5526,
                5528
            ],
            [
                5528,
                5572
            ],
            [
                5589,
                5655
            ],
            [
                5734,
                5773
            ],
            [
                5776,
                5778
            ],
            [
                5790,
                5813
            ],
            [
                5813,
                5852
            ],
            [
                5852,
                5885
            ],
            [
                5885,
                5936
            ],
            [
                6105,
                6167
            ],
            [
                6200,
                6202
            ],
            [
                6202,
                6284
            ],
            [
                6328,
                6329
            ],
            [
                6425,
                6474
            ],
            [
                6474,
                6555
            ],
            [
                6653,
                6658
            ],
            [
                6660,
                6664
            ],
            [
                6666,
                6669
            ],
            [
                6671,
                6757
            ],
            [
                6766,
                6773
            ],
            [
                6848,
                6895
            ],
            [
                6972,
                7017
            ],
            [
                7042,
                7076
            ],
            [
                7168,
                7187
            ],
            [
                7211,
                7241
            ],
            [
                7109,
                7119
            ],
            [
                7246,
                7310
            ],
            [
                7312,
                7348
            ],
            [
                7402,
                7410
            ],
            [
                7415,
                7449
            ],
            [
                7484,
                7674
            ],
            [
                7674,
                7703
            ],
            [
                7703,
                7751
            ],
            [
                7782,
                7820
            ],
            [
                7820,
                7870
            ],
            [
                7890,
                7940
            ],
            [
                7990,
                7995
            ],
            [
                7962,
                7964
            ],
            [
                7999,
                8034
            ],
            [
                8040,
                8060
            ],
            [
                8060,
                8068
            ],
            [
                8072,
                8114
            ],
            [
                8148,
                8150
            ],
            [
                8190,
                8197
            ],
            [
                8199,
                8202
            ],
            [
                8204,
                8254
            ],
            [
                8254,
                8304
            ],
            [
                8306,
                8309
            ],
            [
                8310,
                8343
            ],
            [
                8367,
                8373
            ],
            [
                8453,
                8520
            ],
            [
                8528,
                8530
            ],
            [
                8530,
                8546
            ],
            [
                8546,
                8659
            ],
            [
                8693,
                8704
            ],
            [
                8718,
                8721
            ],
            [
                8727,
                8812
            ],
            [
                8812,
                8847
            ],
            [
                8910,
                8945
            ],
            [
                8883,
                8886
            ],
            [
                8967,
                8979
            ],
            [
                8979,
                9096
            ],
            [
                9096,
                9137
            ],
            [
                9138,
                9160
            ],
            [
                9228,
                9236
            ],
            [
                9170,
                9173
            ],
            [
                9246,
                9271
            ],
            [
                9276,
                9279
            ],
            [
                9289,
                9311
            ],
            [
                9324,
                9467
            ],
            [
                9467,
                9514
            ],
            [
                9526,
                9531
            ],
            [
                9624,
                9639
            ],
            [
                9672,
                9715
            ],
            [
                9715,
                9742
            ],
            [
                9866,
                9875
            ],
            [
                9743,
                9754
            ],
            [
                9922,
                9939
            ],
            [
                9955,
                9966
            ],
            [
                10004,
                10010
            ],
            [
                10044,
                10085
            ],
            [
                10085,
                10094
            ],
            [
                10105,
                10150
            ],
            [
                10150,
                10180
            ],
            [
                10180,
                10204
            ],
            [
                10217,
                10277
            ],
            [
                10288,
                10387
            ],
            [
                10387,
                10449
            ],
            [
                10451,
                10454
            ],
            [
                10456,
                10481
            ],
            [
                10520,
                10526
            ],
            [
                10526,
                10591
            ],
            [
                10595,
                10628
            ],
            [
                10640,
                10675
            ],
            [
                10677,
                10681
            ],
            [
                10690,
                10700
            ],
            [
                10726,
                10816
            ],
            [
                10837,
                10847
            ],
            [
                10847,
                10927
            ],
            [
                10927,
                10982
            ],
            [
                11046,
                11085
            ],
            [
                11092,
                11129
            ],
            [
                11174,
                11213
            ],
            [
                11215,
                11218
            ],
            [
                11220,
                11271
            ],
            [
                11271,
                11329
            ],
            [
                11447,
                11458
            ],
            [
                11468,
                11471
            ],
            [
                11487,
                11489
            ],
            [
                11489,
                11521
            ],
            [
                11521,
                11550
            ],
            [
                11591,
                11593
            ],
            [
                11593,
                11691
            ],
            [
                11702,
                11719
            ],
            [
                11723,
                11730
            ],
            [
                11734,
                11737
            ],
            [
                11741,
                11751
            ],
            [
                11751,
                11769
            ],
            [
                11809,
                11839
            ],
            [
                11840,
                11991
            ],
            [
                11991,
                12110
            ],
            [
                12110,
                12119
            ],
            [
                12125,
                12131
            ],
            [
                12133,
                12136
            ],
            [
                12138,
                12153
            ],
            [
                12221,
                12223
            ],
            [
                12154,
                12169
            ],
            [
                12175,
                12179
            ],
            [
                12364,
                12366
            ],
            [
                12452,
                12500
            ],
            [
                12557,
                12605
            ],
            [
                12613,
                12633
            ],
            [
                12646,
                12686
            ],
            [
                12686,
                12745
            ],
            [
                12745,
                12802
            ],
            [
                12813,
                12836
            ],
            [
                12931,
                13029
            ],
            [
                13036,
                13054
            ],
            [
                13206,
                13207
            ],
            [
                13208,
                13269
            ],
            [
                13311,
                13342
            ],
            [
                13286,
                13297
            ],
            [
                13369,
                13371
            ],
            [
                13375,
                13383
            ],
            [
                13390,
                13470
            ],
            [
                13471,
                13511
            ],
            [
                13511,
                13580
            ],
            [
                13580,
                13588
            ],
            [
                13590,
                13593
            ],
            [
                13594,
                13623
            ],
            [
                13623,
                13658
            ],
            [
                13658,
                13693
            ],
            [
                13694,
                13739
            ],
            [
                13741,
                13750
            ],
            [
                13853,
                13856
            ],
            [
                13868,
                14056
            ],
            [
                14056,
                14105
            ],
            [
                14105,
                14179
            ],
            [
                14191,
                14201
            ],
            [
                14229,
                14280
            ],
            [
                14335,
                14458
            ],
            [
                14501,
                14587
            ],
            [
                14587,
                14592
            ],
            [
                14644,
                14687
            ],
            [
                14687,
                14743
            ],
            [
                14743,
                14766
            ],
            [
                14777,
                14828
            ],
            [
                14828,
                14871
            ],
            [
                14888,
                14905
            ],
            [
                14911,
                14949
            ],
            [
                14962,
                14965
            ],
            [
                15014,
                15093
            ],
            [
                15102,
                15104
            ],
            [
                15121,
                15151
            ],
            [
                15151,
                15165
            ],
            [
                15165,
                15186
            ],
            [
                15200,
                15212
            ],
            [
                15263,
                15294
            ],
            [
                15294,
                15328
            ],
            [
                15372,
                15403
            ],
            [
                15403,
                15413
            ],
            [
                15413,
                15446
            ],
            [
                15495,
                15570
            ],
            [
                15570,
                15634
            ],
            [
                15634,
                15680
            ],
            [
                15695,
                15702
            ],
            [
                15702,
                15749
            ],
            [
                15749,
                15754
            ],
            [
                15754,
                15776
            ],
            [
                15785,
                15792
            ],
            [
                15829,
                15870
            ],
            [
                15870,
                15904
            ],
            [
                15922,
                15925
            ],
            [
                15925,
                15946
            ],
            [
                15946,
                15959
            ],
            [
                15979,
                16003
            ],
            [
                16003,
                16062
            ],
            [
                16062,
                16067
            ],
            [
                16082,
                16092
            ],
            [
                16097,
                16181
            ],
            [
                16181,
                16202
            ],
            [
                16556,
                16562
            ],
            [
                16563,
                16611
            ],
            [
                16649,
                16650
            ],
            [
                16679,
                16754
            ],
            [
                16651,
                16653
            ],
            [
                16869,
                16905
            ],
            [
                16955,
                17022
            ],
            [
                17022,
                17085
            ],
            [
                17232,
                17289
            ],
            [
                17357,
                17386
            ],
            [
                17398,
                17456
            ],
            [
                17492,
                17494
            ],
            [
                17494,
                17523
            ],
            [
                17589,
                17598
            ],
            [
                17611,
                17619
            ],
            [
                17646,
                17712
            ],
            [
                17755,
                17803
            ],
            [
                17864,
                17866
            ],
            [
                17893,
                17939
            ],
            [
                17947,
                18008
            ],
            [
                18019,
                18028
            ],
            [
                18068,
                18099
            ],
            [
                18115,
                18238
            ],
            [
                18238,
                18327
            ],
            [
                18327,
                18450
            ],
            [
                18459,
                18479
            ]
        ],
        "row_chars": [
            [
                0,
                76
            ],
            [
                76,
                226
            ],
            [
                226,
                432
            ],
            [
                432,
                480
            ],
            [
                480,
                504
            ],
            [
                504,
                516
            ],
            [
                516,
                526
            ],
            [
                526,
                704
            ],
            [
                704,
                811
            ],
            [
                811,
                926
            ],
            [
                926,
                989
            ],
            [
                989,
                1280
            ],
            [
                1280,
                1572
            ],
            [
                1572,
                1606
            ],
            [
                1606,
                1690
            ],
            [
                1690,
                2050
            ],
            [
                2050,
                2180
            ],
            [
                2180,
                2279
            ],
            [
                2279,
                2316
            ],
            [
                2316,
                2559
            ],
            [
                2559,
                2688
            ],
            [
                2688,
                3196
            ],
            [
                3196,
                3370
            ],
            [
                3370,
                3596
            ],
            [
                3596,
                3780
            ],
            [
                3780,
                3845
            ],
            [
                3845,
                4033
            ],
            [
                4033,
                4110
            ],
            [
                4110,
                4745
            ],
            [
                4745,
                5024
            ],
            [
                5024,
                5162
            ],
            [
                5162,
                5528
            ],
            [
                5528,
                5778
            ],
            [
                5778,
                5790
            ],
            [
                5790,
                5813
            ],
            [
                5813,
                5852
            ],
            [
                5852,
                5885
            ],
            [
                5885,
                5937
            ],
            [
                5937,
                6105
            ],
            [
                6105,
                6202
            ],
            [
                6202,
                6330
            ],
            [
                6330,
                6404
            ],
            [
                6404,
                6555
            ],
            [
                6555,
                6757
            ],
            [
                6757,
                7076
            ],
            [
                7076,
                7674
            ],
            [
                7674,
                7703
            ],
            [
                7703,
                7751
            ],
            [
                7751,
                7782
            ],
            [
                7782,
                7820
            ],
            [
                7820,
                8060
            ],
            [
                8060,
                8150
            ],
            [
                8150,
                8254
            ],
            [
                8254,
                8530
            ],
            [
                8530,
                8546
            ],
            [
                8546,
                8812
            ],
            [
                8812,
                8979
            ],
            [
                8979,
                9096
            ],
            [
                9096,
                9138
            ],
            [
                9138,
                9467
            ],
            [
                9467,
                9715
            ],
            [
                9715,
                10085
            ],
            [
                10085,
                10150
            ],
            [
                10150,
                10180
            ],
            [
                10180,
                10204
            ],
            [
                10204,
                10387
            ],
            [
                10387,
                10526
            ],
            [
                10526,
                10591
            ],
            [
                10591,
                10847
            ],
            [
                10847,
                10927
            ],
            [
                10927,
                11271
            ],
            [
                11271,
                11329
            ],
            [
                11329,
                11378
            ],
            [
                11378,
                11411
            ],
            [
                11411,
                11447
            ],
            [
                11447,
                11489
            ],
            [
                11489,
                11521
            ],
            [
                11521,
                11593
            ],
            [
                11593,
                11751
            ],
            [
                11751,
                11991
            ],
            [
                11991,
                12110
            ],
            [
                12110,
                12366
            ],
            [
                12366,
                12686
            ],
            [
                12686,
                12745
            ],
            [
                12745,
                13208
            ],
            [
                13208,
                13371
            ],
            [
                13371,
                13471
            ],
            [
                13471,
                13511
            ],
            [
                13511,
                13580
            ],
            [
                13580,
                13623
            ],
            [
                13623,
                13658
            ],
            [
                13658,
                13694
            ],
            [
                13694,
                13739
            ],
            [
                13739,
                14056
            ],
            [
                14056,
                14105
            ],
            [
                14105,
                14458
            ],
            [
                14458,
                14587
            ],
            [
                14587,
                14687
            ],
            [
                14687,
                14743
            ],
            [
                14743,
                14828
            ],
            [
                14828,
                15104
            ],
            [
                15104,
                15151
            ],
            [
                15151,
                15165
            ],
            [
                15165,
                15294
            ],
            [
                15294,
                15328
            ],
            [
                15328,
                15372
            ],
            [
                15372,
                15403
            ],
            [
                15403,
                15413
            ],
            [
                15413,
                15570
            ],
            [
                15570,
                15634
            ],
            [
                15634,
                15680
            ],
            [
                15680,
                15685
            ],
            [
                15685,
                15695
            ],
            [
                15695,
                15702
            ],
            [
                15702,
                15749
            ],
            [
                15749,
                15754
            ],
            [
                15754,
                15870
            ],
            [
                15870,
                15925
            ],
            [
                15925,
                15946
            ],
            [
                15946,
                16003
            ],
            [
                16003,
                16062
            ],
            [
                16062,
                16181
            ],
            [
                16181,
                16203
            ],
            [
                16203,
                16363
            ],
            [
                16363,
                16444
            ],
            [
                16444,
                16523
            ],
            [
                16523,
                16906
            ],
            [
                16906,
                16955
            ],
            [
                16955,
                17022
            ],
            [
                17022,
                17085
            ],
            [
                17085,
                17131
            ],
            [
                17131,
                17215
            ],
            [
                17215,
                17494
            ],
            [
                17494,
                17619
            ],
            [
                17619,
                18238
            ],
            [
                18238,
                18327
            ],
            [
                18327,
                18479
            ]
        ]
    },
    "abridged": {
        "text": "Her uncle and her aunts were in the drawing-room when Fanny went down. The former saw with pleasure the elegance of her appearance. The neatness and propriety of her dress was all that he would commend in her presence, but upon her leaving the room, he spoke of her beauty with decided praise.\n\"Yes,\" said Lady Bertram, \"she looks very well. I sent Chapman to her.\"\n\"Look well! Oh, yes!\" cried Mrs. Norris, \"she has good reason to look well with all her advantages: brought up in this family as she has been, with all the benefit of her cousins' manners before her. What would she have been if we had not taken her in hand?\"\nWhen they sat down to table the eyes of the two young men told Fanny that she was approved; and the consciousness of looking well made her look still better. Edmund said, \"You must dance with me, Fanny; keep two dances for me; any two that you like, except the first.\" She had nothing more to wish for. She had hardly ever been in a state so close to high spirits in her life. She felt that a ball was indeed very charming, and was actually practising her steps about the drawing-room.\nSoon afterwards began the sweet expectation of a carriage, while they all stood about and talked and laughed, and every moment had its pleasure and its hope. Fanny felt that there must be a struggle in Edmund's cheerfulness, but it was delightful to see the effort so successfully made.\nWhen the guests began to assemble, her own gaiety was much subdued: the sight of so many strangers threw her back into herself; and as she was introduced here and there by her uncle, she found herself forced to be spoken to, and to curtsey, and speak again. This was a hard duty, and she was never summoned to it without looking longingly at William, who walked about at his ease.\nWith the entrance of the Grants and Crawfords, stiffness gave way before their popular manners: everybody grew comfortable. Fanny would have been again most happy, could she have kept her eyes from wandering between Edmund and Mary Crawford. She looked all loveliness-and what might not be the end of it?\nHer musings were ended on seeing Mr. Crawford before her; he engaged her for the first two dances. Her happiness on this occasion was finely chequered. To be secure of a partner at first was a most essential good-for she so little understood her own claims as to think that if Mr. Crawford had not asked her, she must have been the last to be sought after; but at the same time there was a pointedness in his manner of asking her which she did not like, and she saw his eye glancing for a moment at her necklace, with a smile which made her blush and feel wretched. Embarrassed, she had no composure till he turned away to some one else. Then she could gradually rise up to the genuine satisfaction of having a partner secured before the dancing began.\nWhen the company were moving into the ballroom, she found herself near Miss Crawford, and hastened to explain the second necklace. Miss Crawford listened; and all her intended insinuations to Fanny were forgotten: she felt only one thing; and she exclaimed with eager pleasure, \"Did Edmund? That was like himself. No other man would have thought of it. I honour him beyond expression.\" And she looked around as if longing to tell him so.\nFanny's heart sunk, but there was no leisure for thinking long. They were in the ballroom, the violins were playing, and her mind was in a flutter.\nSir Thomas came to her, and asked if she were engaged to dance; and the \"Yes, sir; to Mr. Crawford,\" was exactly what he had intended to hear. He then told Fanny that she was to lead the way and open the ball; an idea that had never occurred to her before. She had assumed that Edmund would begin with Miss Crawford; and she could not help an exclamation of surprise, an entreaty even to be excused. Such was her horror, that she could actually look Sir Thomas in the face and say that she hoped it might be settled otherwise.\nIn vain, however: Sir Thomas smiled, and said decidedly, \"It must be so, my dear\"; and she found herself the next moment conducted by Mr. Crawford to the top of the room, and standing there to be joined by the rest of the dancers, couple after couple, as they were formed.\nShe could hardly believe it. To be placed above so many elegant young women! It was treating her like her cousins! And her thoughts flew to those absent cousins with truly tender regret, that they were not at home to share in a pleasure which would have been so delightful to them. So often she had heard them wish for a ball at home! And for her to be opening the ball-and with Mr. Crawford too! She hoped they would not envy her that distinction now; but when she looked back to the autumn, the present arrangement was almost more than she could understand.\nThe ball began. It was rather honour than happiness to Fanny, for the first dance at least: her partner was in excellent spirits, but she was too frightened to have any enjoyment till she could suppose herself no longer looked at. Young, pretty, and gentle, however, there were few persons present that did not praise her. She was attractive, she was modest, she was Sir Thomas's niece, and she was soon said to be admired by Mr. Crawford. It was enough to give her general favour.\nSir Thomas himself was proud of her; and without attributing her beauty, as Mrs. Norris did, to her transplantation to Mansfield, he was pleased with himself for having supplied everything else: education and manners she owed to him.\nMiss Crawford saw much of Sir Thomas's thoughts, and wishing to recommend herself to him, stepped aside to say something agreeable of Fanny. Her praise was warm, and he certainly received it better than his lady did, when Mary turned to compliment her on Miss Price's looks.\n\"Yes, she looks very well,\" was Lady Bertram's placid reply. \"Chapman helped her to dress. I sent Chapman to her.\" She was really pleased to have Fanny admired; but she was so struck with her own kindness in sending Chapman to her, that she could not get it out of her head.\nMiss Crawford knew Mrs. Norris too well to think of gratifying her by commendation of Fanny; instead-\"Ah! ma'am, how much we want dear Mrs. Rushworth and Julia to-night!\" Mrs. Norris paid her with as many courteous words as she had time for amid her occupation in making up card-tables, giving hints to Sir Thomas, and trying to move all the chaperons across the room.\nMiss Crawford blundered most towards Fanny herself in her intentions to please. She meant to be giving her little heart a happy flutter; and, misinterpreting Fanny's blushes, thought she must be doing so when she said, with a significant look, \"Perhaps you can tell me why my brother goes to town to-morrow? He says he has business there, but will not tell me what. Now, I must ask you. Pray, what is Henry going for?\"\nFanny protested her ignorance.\n\"Well, then,\" replied Miss Crawford, laughing, \"I must suppose it to be purely for the pleasure of taking your brother, and talking about you on the way.\"\nFanny was confused; while Miss Crawford wondered that she did not smile, and thought her over-anxious, or thought her odd, or thought her anything rather than insensible of pleasure in Henry's attentions. Fanny had a good deal of enjoyment in the course of the evening; but Henry's attentions had very little to do with it. She would rather not have been asked to dance by him again so soon. She could not say that it was unpleasantly done, and sometimes, when he talked of William, he was not unagreeable, and showed a warmth of heart which did him credit. But still his attentions made no part of her satisfaction. She was happy whenever she looked at William, and saw how he was enjoying himself; she was happy in knowing herself admired; and she was happy in having the two dances with Edmund to look forward to.\nShe was happy even when they did take place; but not from any expressions of tender gallantry on his side. Edmund's mind was weary, and her happiness sprung from being the friend with whom it could find repose.\n\"I am worn out with civility,\" said he. \"I have been talking incessantly all night, and with nothing to say. But with you, Fanny, there may be peace. You will not want to be talked to. Let us have the luxury of silence.\"\nFanny would hardly even speak her agreement. His weariness was to be respected, and they went down their two dances together with such sober tranquillity as might satisfy any looker-on that Sir Thomas had been bringing up no wife for his younger son.\nThe evening had afforded Edmund little pleasure. Miss Crawford had been in gay spirits when they first danced together, but her gaiety rather sank than raised his comfort; and afterwards, she had absolutely pained him by her manner of speaking of the profession to which he was now on the point of belonging. He had reasoned, she had ridiculed; and they had parted at last with mutual vexation. Fanny had seen enough to be tolerably satisfied. It was barbarous to be happy when Edmund was suffering. Yet some happiness must arise from the very conviction that he did suffer.\nWhen her two dances with him were over, her strength for more was pretty well at an end; and Sir Thomas, seeing her breathless, and with her hand at her side, gave his orders for her sitting down. Mr. Crawford sat down likewise.\n\"Poor Fanny!\" cried William, coming to visit her, \"how soon she is knocked up! Why, the sport is but just begun. How can you be tired so soon?\"\n\"So soon! my good friend,\" said Sir Thomas, \"it is three o'clock, and your sister is not used to these sort of hours.\"\n\"Well, then, Fanny, you shall not get up to-morrow before I go. Sleep as long as you can, and never mind me.\"\n\"What! Did she think of being up before you set off?\"\n\"Oh! yes, sir,\" cried Fanny eagerly; \"I must get up and breakfast with him. It will be the last time, you know.\"\n\"You had better not. He is to have gone by half-past nine. Mr. Crawford, I think you call for him at half-past nine?\"\nFanny, however, had too many tears in her eyes for denial; and it ended in a gracious \"Well, well!\" which was permission. Sir Thomas then asked Crawford to join the early breakfast party: and the readiness with which his invitation was accepted convinced him that he was right: Mr. Crawford was in love with Fanny.\nHis niece, meanwhile, did not thank him for what he had just done. She had hoped to have William all to herself the last morning. But she was so totally unused to have her pleasure consulted, that she was more disposed to rejoice in having carried her point so far, than to repine.\nShortly afterward, Sir Thomas advised her to go to bed. It was the advice of absolute power, and she had only to rise, and pass quietly away; stopping at the entrance-door to take a last look at the five or six determined couples who were still hard at work; and then, creeping slowly up the staircase, feverish with hopes and fears, sore-footed and fatigued, restless and agitated, yet feeling, in spite of everything, that a ball was indeed delightful.\nIn thus sending her away, Sir Thomas perhaps might not be thinking merely of her health. It might occur to him that Mr. Crawford had been sitting by her long enough, or he might mean to recommend her as a wife by showing her persuadableness.",
        "paragraph_chars": [
            [
                0,
                294
            ],
            [
                294,
                366
            ],
            [
                366,
                625
            ],
            [
                625,
                1111
            ],
            [
                1111,
                1398
            ],
            [
                1398,
                1779
            ],
            [
                1779,
                2084
            ],
            [
                2084,
                2837
            ],
            [
                2837,
                3275
            ],
            [
                3275,
                3423
            ],
            [
                3423,
                3950
            ],
            [
                3950,
                4223
            ],
            [
                4223,
                4783
            ],
            [
                4783,
                5265
            ],
            [
                5265,
                5499
            ],
            [
                5499,
                5774
            ],
            [
                5774,
                6049
            ],
            [
                6049,
                6418
            ],
            [
                6418,
                6837
            ],
            [
                6837,
                6868
            ],
            [
                6868,
                7023
            ],
            [
                7023,
                7840
            ],
            [
                7840,
                8051
            ],
            [
                8051,
                8272
            ],
            [
                8272,
                8523
            ],
            [
                8523,
                9098
            ],
            [
                9098,
                9327
            ],
            [
                9327,
                9471
            ],
            [
                9471,
                9590
            ],
            [
                9590,
                9700
            ],
            [
                9700,
                9754
            ],
            [
                9754,
                9867
            ],
            [
                9867,
                9985
            ],
            [
                9985,
                10300
            ],
            [
                10300,
                10582
            ],
            [
                10582,
                11037
            ],
            [
                11037,
                11278
            ]
        ],
        "segment_chars": [
            [
                0,
                71
            ],
            [
                71,
                132
            ],
            [
                132,
                294
            ],
            [
                294,
                342
            ],
            [
                342,
                366
            ],
            [
                366,
                378
            ],
            [
                378,
                388
            ],
            [
                388,
                566
            ],
            [
                566,
                625
            ],
            [
                625,
                783
            ],
            [
                783,
                894
            ],
            [
                894,
                928
            ],
            [
                928,
                1002
            ],
            [
                1002,
                1111
            ],
            [
                1111,
                1269
            ],
            [
                1269,
                1398
            ],
            [
                1398,
                1656
            ],
            [
                1656,
                1779
            ],
            [
                1779,
                1903
            ],
            [
                1903,
                2021
            ],
            [
                2021,
                2084
            ],
            [
                2084,
                2183
            ],
            [
                2183,
                2236
            ],
            [
                2236,
                2650
            ],
            [
                2650,
                2722
            ],
            [
                2722,
                2837
            ],
            [
                2837,
                2968
            ],
            [
                2968,
                3128
            ],
            [
                3128,
                3151
            ],
            [
                3151,
                3190
            ],
            [
                3190,
                3223
            ],
            [
                3223,
                3275
            ],
            [
                3275,
                3339
            ],
            [
                3339,
                3423
            ],
            [
                3423,
                3566
            ],
            [
                3566,
                3680
            ],
            [
                3680,
                3823
            ],
            [
                3823,
                3950
            ],
            [
                3950,
                4223
            ],
            [
                4223,
                4252
            ],
            [
                4252,
                4300
            ],
            [
                4300,
                4338
            ],
            [
                4338,
                4505
            ],
            [
                4505,
                4558
            ],
            [
                4558,
                4620
            ],
            [
                4620,
                4783
            ],
            [
                4783,
                4799
            ],
            [
                4799,
                5014
            ],
            [
                5014,
                5106
            ],
            [
                5106,
                5223
            ],
            [
                5223,
                5265
            ],
            [
                5265,
                5499
            ],
            [
                5499,
                5640
            ],
            [
                5640,
                5774
            ],
            [
                5774,
                5835
            ],
            [
                5835,
                5865
            ],
            [
                5865,
                5889
            ],
            [
                5889,
                6049
            ],
            [
                6049,
                6155
            ],
            [
                6155,
                6220
            ],
            [
                6220,
                6418
            ],
            [
                6418,
                6498
            ],
            [
                6498,
                6726
            ],
            [
                6726,
                6784
            ],
            [
                6784,
                6805
            ],
            [
                6805,
                6837
            ],
            [
                6837,
                6868
            ],
            [
                6868,
                7023
            ],
            [
                7023,
                7228
            ],
            [
                7228,
                7347
            ],
            [
                7347,
                7415
            ],
            [
                7415,
                7581
            ],
            [
                7581,
                7640
            ],
            [
                7640,
                7840
            ],
            [
                7840,
                7947
            ],
            [
                7947,
                8051
            ],
            [
                8051,
                8091
            ],
            [
                8091,
                8160
            ],
            [
                8160,
                8201
            ],
            [
                8201,
                8236
            ],
            [
                8236,
                8272
            ],
            [
                8272,
                8317
            ],
            [
                8317,
                8523
            ],
            [
                8523,
                8572
            ],
            [
                8572,
                8832
            ],
            [
                8832,
                8918
            ],
            [
                8918,
                8967
            ],
            [
                8967,
                9023
            ],
            [
                9023,
                9098
            ],
            [
                9098,
                9295
            ],
            [
                9295,
                9327
            ],
            [
                9327,
                9341
            ],
            [
                9341,
                9406
            ],
            [
                9406,
                9440
            ],
            [
                9440,
                9471
            ],
            [
                9471,
                9481
            ],
            [
                9481,
                9590
            ],
            [
                9590,
                9654
            ],
            [
                9654,
                9700
            ],
            [
                9700,
                9707
            ],
            [
                9707,
                9754
            ],
            [
                9754,
                9759
            ],
            [
                9759,
                9830
            ],
            [
                9830,
                9867
            ],
            [
                9867,
                9888
            ],
            [
                9888,
                9926
            ],
            [
                9926,
                9985
            ],
            [
                9985,
                10085
            ],
            [
                10085,
                10107
            ],
            [
                10107,
                10300
            ],
            [
                10300,
                10367
            ],
            [
                10367,
                10430
            ],
            [
                10430,
                10582
            ],
            [
                10582,
                10638
            ],
            [
                10638,
                11037
            ],
            [
                11037,
                11126
            ],
            [
                11126,
                11278
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                14,
                71
            ],
            [
                71,
                81
            ],
            [
                82,
                103
            ],
            [
                104,
                130
            ],
            [
                130,
                132
            ],
            [
                132,
                193
            ],
            [
                194,
                248
            ],
            [
                248,
                277
            ],
            [
                278,
                294
            ],
            [
                294,
                342
            ],
            [
                342,
                366
            ],
            [
                366,
                378
            ],
            [
                378,
                388
            ],
            [
                388,
                566
            ],
            [
                566,
                614
            ],
            [
                618,
                625
            ],
            [
                625,
                682
            ],
            [
                688,
                693
            ],
            [
                694,
                783
            ],
            [
                783,
                789
            ],
            [
                790,
                794
            ],
            [
                794,
                827
            ],
            [
                828,
                894
            ],
            [
                894,
                928
            ],
            [
                928,
                966
            ],
            [
                976,
                1002
            ],
            [
                1002,
                1010
            ],
            [
                1016,
                1026
            ],
            [
                1027,
                1109
            ],
            [
                1109,
                1111
            ],
            [
                1111,
                1115
            ],
            [
                1127,
                1169
            ],
            [
                1176,
                1269
            ],
            [
                1269,
                1398
            ],
            [
                1398,
                1419
            ],
            [
                1420,
                1447
            ],
            [
                1448,
                1529
            ],
            [
                1533,
                1580
            ],
            [
                1581,
                1598
            ],
            [
                1599,
                1656
            ],
            [
                1656,
                1726
            ],
            [
                1737,
                1748
            ],
            [
                1753,
                1777
            ],
            [
                1777,
                1779
            ],
            [
                1784,
                1824
            ],
            [
                1824,
                1825
            ],
            [
                1826,
                1835
            ],
            [
                1836,
                1873
            ],
            [
                1873,
                1874
            ],
            [
                1875,
                1903
            ],
            [
                1903,
                1908
            ],
            [
                1909,
                2021
            ],
            [
                2021,
                2024
            ],
            [
                2025,
                2083
            ],
            [
                2084,
                2087
            ],
            [
                2088,
                2100
            ],
            [
                2107,
                2109
            ],
            [
                2117,
                2140
            ],
            [
                2153,
                2156
            ],
            [
                2157,
                2183
            ],
            [
                2183,
                2217
            ],
            [
                2218,
                2236
            ],
            [
                2236,
                2300
            ],
            [
                2301,
                2439
            ],
            [
                2439,
                2609
            ],
            [
                2610,
                2650
            ],
            [
                2661,
                2666
            ],
            [
                2667,
                2722
            ],
            [
                2722,
                2802
            ],
            [
                2803,
                2810
            ],
            [
                2818,
                2837
            ],
            [
                2837,
                2902
            ],
            [
                2903,
                2922
            ],
            [
                2923,
                2926
            ],
            [
                2927,
                2938
            ],
            [
                2947,
                2966
            ],
            [
                2966,
                2968
            ],
            [
                2968,
                3012
            ],
            [
                3013,
                3079
            ],
            [
                3080,
                3119
            ],
            [
                3126,
                3128
            ],
            [
                3128,
                3151
            ],
            [
                3151,
                3190
            ],
            [
                3190,
                3223
            ],
            [
                3223,
                3274
            ],
            [
                3275,
                3337
            ],
            [
                3337,
                3339
            ],
            [
                3339,
                3421
            ],
            [
                3421,
                3422
            ],
            [
                3427,
                3476
            ],
            [
                3485,
                3566
            ],
            [
                3579,
                3584
            ],
            [
                3585,
                3589
            ],
            [
                3590,
                3593
            ],
            [
                3594,
                3680
            ],
            [
                3680,
                3687
            ],
            [
                3696,
                3743
            ],
            [
                3744,
                3789
            ],
            [
                3789,
                3823
            ],
            [
                3823,
                3842
            ],
            [
                3842,
                3872
            ],
            [
                3873,
                3883
            ],
            [
                3884,
                3948
            ],
            [
                3950,
                3986
            ],
            [
                3987,
                3995
            ],
            [
                3996,
                4030
            ],
            [
                4033,
                4223
            ],
            [
                4223,
                4252
            ],
            [
                4252,
                4300
            ],
            [
                4300,
                4338
            ],
            [
                4338,
                4388
            ],
            [
                4389,
                4439
            ],
            [
                4440,
                4445
            ],
            [
                4446,
                4448
            ],
            [
                4449,
                4484
            ],
            [
                4485,
                4505
            ],
            [
                4505,
                4513
            ],
            [
                4514,
                4556
            ],
            [
                4556,
                4558
            ],
            [
                4558,
                4565
            ],
            [
                4566,
                4569
            ],
            [
                4570,
                4620
            ],
            [
                4620,
                4670
            ],
            [
                4671,
                4674
            ],
            [
                4674,
                4707
            ],
            [
                4708,
                4714
            ],
            [
                4714,
                4781
            ],
            [
                4781,
                4783
            ],
            [
                4783,
                4799
            ],
            [
                4799,
                4912
            ],
            [
                4913,
                4924
            ],
            [
                4925,
                4928
            ],
            [
                4929,
                5014
            ],
            [
                5014,
                5049
            ],
            [
                5050,
                5085
            ],
            [
                5090,
                5093
            ],
            [
                5094,
                5106
            ],
            [
                5106,
                5223
            ],
            [
                5223,
                5264
            ],
            [
                5265,
                5287
            ],
            [
                5288,
                5296
            ],
            [
                5297,
                5300
            ],
            [
                5300,
                5325
            ],
            [
                5326,
                5329
            ],
            [
                5330,
                5352
            ],
            [
                5356,
                5499
            ],
            [
                5499,
                5546
            ],
            [
                5546,
                5551
            ],
            [
                5573,
                5588
            ],
            [
                5597,
                5640
            ],
            [
                5640,
                5667
            ],
            [
                5668,
                5677
            ],
            [
                5678,
                5689
            ],
            [
                5697,
                5714
            ],
            [
                5714,
                5725
            ],
            [
                5726,
                5732
            ],
            [
                5733,
                5774
            ],
            [
                5774,
                5783
            ],
            [
                5790,
                5835
            ],
            [
                5835,
                5865
            ],
            [
                5865,
                5889
            ],
            [
                5889,
                5949
            ],
            [
                5950,
                6049
            ],
            [
                6049,
                6111
            ],
            [
                6112,
                6115
            ],
            [
                6116,
                6141
            ],
            [
                6149,
                6155
            ],
            [
                6155,
                6220
            ],
            [
                6220,
                6253
            ],
            [
                6254,
                6289
            ],
            [
                6290,
                6294
            ],
            [
                6299,
                6309
            ],
            [
                6310,
                6400
            ],
            [
                6408,
                6418
            ],
            [
                6418,
                6498
            ],
            [
                6498,
                6553
            ],
            [
                6553,
                6592
            ],
            [
                6593,
                6630
            ],
            [
                6631,
                6670
            ],
            [
                6671,
                6674
            ],
            [
                6675,
                6726
            ],
            [
                6726,
                6784
            ],
            [
                6784,
                6795
            ],
            [
                6800,
                6803
            ],
            [
                6803,
                6805
            ],
            [
                6805,
                6837
            ],
            [
                6837,
                6866
            ],
            [
                6866,
                6868
            ],
            [
                6868,
                6966
            ],
            [
                6974,
                6991
            ],
            [
                6992,
                6999
            ],
            [
                7006,
                7009
            ],
            [
                7013,
                7023
            ],
            [
                7023,
                7041
            ],
            [
                7041,
                7071
            ],
            [
                7077,
                7228
            ],
            [
                7228,
                7347
            ],
            [
                7347,
                7356
            ],
            [
                7357,
                7363
            ],
            [
                7364,
                7367
            ],
            [
                7368,
                7383
            ],
            [
                7384,
                7386
            ],
            [
                7393,
                7408
            ],
            [
                7409,
                7413
            ],
            [
                7413,
                7415
            ],
            [
                7415,
                7463
            ],
            [
                7464,
                7512
            ],
            [
                7513,
                7533
            ],
            [
                7541,
                7581
            ],
            [
                7581,
                7640
            ],
            [
                7640,
                7697
            ],
            [
                7698,
                7721
            ],
            [
                7721,
                7819
            ],
            [
                7820,
                7838
            ],
            [
                7838,
                7839
            ],
            [
                7840,
                7901
            ],
            [
                7902,
                7933
            ],
            [
                7934,
                7945
            ],
            [
                7945,
                7947
            ],
            [
                7956,
                7964
            ],
            [
                7970,
                8050
            ],
            [
                8051,
                8091
            ],
            [
                8091,
                8160
            ],
            [
                8160,
                8168
            ],
            [
                8169,
                8172
            ],
            [
                8172,
                8201
            ],
            [
                8201,
                8236
            ],
            [
                8236,
                8271
            ],
            [
                8272,
                8317
            ],
            [
                8321,
                8330
            ],
            [
                8331,
                8334
            ],
            [
                8335,
                8523
            ],
            [
                8523,
                8572
            ],
            [
                8572,
                8646
            ],
            [
                8647,
                8657
            ],
            [
                8658,
                8709
            ],
            [
                8709,
                8832
            ],
            [
                8832,
                8918
            ],
            [
                8918,
                8923
            ],
            [
                8924,
                8967
            ],
            [
                8967,
                9023
            ],
            [
                9023,
                9046
            ],
            [
                9047,
                9098
            ],
            [
                9098,
                9141
            ],
            [
                9142,
                9159
            ],
            [
                9164,
                9202
            ],
            [
                9210,
                9213
            ],
            [
                9214,
                9293
            ],
            [
                9293,
                9295
            ],
            [
                9297,
                9327
            ],
            [
                9327,
                9341
            ],
            [
                9341,
                9362
            ],
            [
                9363,
                9375
            ],
            [
                9375,
                9406
            ],
            [
                9406,
                9440
            ],
            [
                9440,
                9471
            ],
            [
                9471,
                9481
            ],
            [
                9481,
                9514
            ],
            [
                9515,
                9590
            ],
            [
                9590,
                9654
            ],
            [
                9654,
                9700
            ],
            [
                9700,
                9707
            ],
            [
                9707,
                9754
            ],
            [
                9754,
                9759
            ],
            [
                9759,
                9781
            ],
            [
                9782,
                9789
            ],
            [
                9789,
                9830
            ],
            [
                9830,
                9864
            ],
            [
                9864,
                9867
            ],
            [
                9867,
                9888
            ],
            [
                9888,
                9901
            ],
            [
                9902,
                9926
            ],
            [
                9926,
                9985
            ],
            [
                9985,
                9990
            ],
            [
                9990,
                10000
            ],
            [
                10001,
                10085
            ],
            [
                10085,
                10106
            ],
            [
                10111,
                10117
            ],
            [
                10123,
                10171
            ],
            [
                10171,
                10172
            ],
            [
                10173,
                10248
            ],
            [
                10249,
                10251
            ],
            [
                10263,
                10299
            ],
            [
                10300,
                10367
            ],
            [
                10367,
                10430
            ],
            [
                10434,
                10491
            ],
            [
                10492,
                10521
            ],
            [
                10522,
                10580
            ],
            [
                10580,
                10582
            ],
            [
                10582,
                10611
            ],
            [
                10620,
                10629
            ],
            [
                10630,
                10638
            ],
            [
                10638,
                10704
            ],
            [
                10705,
                10753
            ],
            [
                10754,
                10756
            ],
            [
                10757,
                10803
            ],
            [
                10812,
                10873
            ],
            [
                10874,
                10883
            ],
            [
                10883,
                10914
            ],
            [
                10914,
                11037
            ],
            [
                11037,
                11126
            ],
            [
                11126,
                11249
            ],
            [
                11258,
                11278
            ]
        ],
        "row_chars": [
            [
                0,
                71
            ],
            [
                71,
                132
            ],
            [
                132,
                294
            ],
            [
                294,
                342
            ],
            [
                342,
                366
            ],
            [
                366,
                378
            ],
            [
                378,
                388
            ],
            [
                388,
                566
            ],
            [
                566,
                566
            ],
            [
                566,
                566
            ],
            [
                566,
                625
            ],
            [
                625,
                783
            ],
            [
                783,
                894
            ],
            [
                894,
                928
            ],
            [
                928,
                1002
            ],
            [
                1002,
                1111
            ],
            [
                1111,
                1111
            ],
            [
                1111,
                1111
            ],
            [
                1111,
                1111
            ],
            [
                1111,
                1269
            ],
            [
                1269,
                1398
            ],
            [
                1398,
                1656
            ],
            [
                1656,
                1779
            ],
            [
                1779,
                1903
            ],
            [
                1903,
                2021
            ],
            [
                2021,
                2084
            ],
            [
                2084,
                2183
            ],
            [
                2183,
                2236
            ],
            [
                2236,
                2650
            ],
            [
                2650,
                2722
            ],
            [
                2722,
                2837
            ],
            [
                2837,
                2968
            ],
            [
                2968,
                3128
            ],
            [
                3128,
                3128
            ],
            [
                3128,
                3151
            ],
            [
                3151,
                3190
            ],
            [
                3190,
                3223
            ],
            [
                3223,
                3275
            ],
            [
                3275,
                3275
            ],
            [
                3275,
                3339
            ],
            [
                3339,
                3423
            ],
            [
                3423,
                3423
            ],
            [
                3423,
                3566
            ],
            [
                3566,
                3680
            ],
            [
                3680,
                3823
            ],
            [
                3823,
                4223
            ],
            [
                4223,
                4252
            ],
            [
                4252,
                4300
            ],
            [
                4300,
                4300
            ],
            [
                4300,
                4338
            ],
            [
                4338,
                4505
            ],
            [
                4505,
                4558
            ],
            [
                4558,
                4620
            ],
            [
                4620,
                4783
            ],
            [
                4783,
                4799
            ],
            [
                4799,
                5014
            ],
            [
                5014,
                5106
            ],
            [
                5106,
                5223
            ],
            [
                5223,
                5265
            ],
            [
                5265,
                5499
            ],
            [
                5499,
                5640
            ],
            [
                5640,
                5774
            ],
            [
                5774,
                5835
            ],
            [
                5835,
                5865
            ],
            [
                5865,
                5889
            ],
            [
                5889,
                6049
            ],
            [
                6049,
                6155
            ],
            [
                6155,
                6220
            ],
            [
                6220,
                6418
            ],
            [
                6418,
                6498
            ],
            [
                6498,
                6726
            ],
            [
                6726,
                6784
            ],
            [
                6784,
                6784
            ],
            [
                6784,
                6784
            ],
            [
                6784,
                6784
            ],
            [
                6784,
                6805
            ],
            [
                6805,
                6837
            ],
            [
                6837,
                6868
            ],
            [
                6868,
                7023
            ],
            [
                7023,
                7228
            ],
            [
                7228,
                7347
            ],
            [
                7347,
                7415
            ],
            [
                7415,
                7581
            ],
            [
                7581,
                7640
            ],
            [
                7640,
                7840
            ],
            [
                7840,
                7947
            ],
            [
                7947,
                8051
            ],
            [
                8051,
                8091
            ],
            [
                8091,
                8160
            ],
            [
                8160,
                8201
            ],
            [
                8201,
                8236
            ],
            [
                8236,
                8272
            ],
            [
                8272,
                8317
            ],
            [
                8317,
                8523
            ],
            [
                8523,
                8572
            ],
            [
                8572,
                8832
            ],
            [
                8832,
                8918
            ],
            [
                8918,
                8967
            ],
            [
                8967,
                9023
            ],
            [
                9023,
                9098
            ],
            [
                9098,
                9295
            ],
            [
                9295,
                9327
            ],
            [
                9327,
                9341
            ],
            [
                9341,
                9406
            ],
            [
                9406,
                9440
            ],
            [
                9440,
                9440
            ],
            [
                9440,
                9471
            ],
            [
                9471,
                9481
            ],
            [
                9481,
                9590
            ],
            [
                9590,
                9654
            ],
            [
                9654,
                9700
            ],
            [
                9700,
                9700
            ],
            [
                9700,
                9700
            ],
            [
                9700,
                9707
            ],
            [
                9707,
                9754
            ],
            [
                9754,
                9759
            ],
            [
                9759,
                9830
            ],
            [
                9830,
                9867
            ],
            [
                9867,
                9888
            ],
            [
                9888,
                9926
            ],
            [
                9926,
                9985
            ],
            [
                9985,
                10085
            ],
            [
                10085,
                10107
            ],
            [
                10107,
                10107
            ],
            [
                10107,
                10107
            ],
            [
                10107,
                10107
            ],
            [
                10107,
                10300
            ],
            [
                10300,
                10300
            ],
            [
                10300,
                10367
            ],
            [
                10367,
                10430
            ],
            [
                10430,
                10430
            ],
            [
                10430,
                10430
            ],
            [
                10430,
                10582
            ],
            [
                10582,
                10638
            ],
            [
                10638,
                11037
            ],
            [
                11037,
                11126
            ],
            [
                11126,
                11278
            ]
        ]
    }
}