{
    "original": {
        "text": "The ball was over, and the breakfast was soon over too; the last kiss was given, and William was gone. Mr. Crawford had, as he foretold, been very punctual, and short and pleasant had been the meal.\nAfter seeing William to the last moment, Fanny walked back to the breakfast-room with a very saddened heart to grieve over the melancholy change; and there her uncle kindly left her to cry in peace, conceiving, perhaps, that the deserted chair of each young man might exercise her tender enthusiasm, and that the remaining cold pork bones and mustard in William's plate might but divide her feelings with the broken egg-shells in Mr. Crawford's. She sat and cried _con_ _amore_ as her uncle intended, but it was _con_ _amore_ fraternal and no other. William was gone, and she now felt as if she had wasted half his visit in idle cares and selfish solicitudes unconnected with him.\nFanny's disposition was such that she could never even think of her aunt Norris in the meagreness and cheerlessness of her own small house, without reproaching herself for some little want of attention to her when they had been last together; much less could her feelings acquit her of having done and said and thought everything by William that was due to him for a whole fortnight.\nIt was a heavy, melancholy day. Soon after the second breakfast, Edmund bade them good-bye for a week, and mounted his horse for Peterborough, and then all were gone. Nothing remained of last night but remembrances, which she had nobody to share in. She talked to her aunt Bertram-she must talk to somebody of the ball; but her aunt had seen so little of what had passed, and had so little curiosity, that it was heavy work. Lady Bertram was not certain of anybody's dress or anybody's place at supper but her own. \"She could not recollect what it was that she had heard about one of the Miss Maddoxes, or what it was that Lady Prescott had noticed in Fanny: she was not sure whether Colonel Harrison had been talking of Mr. Crawford or of William when he said he was the finest young man in the room-somebody had whispered something to her; she had forgot to ask Sir Thomas what it could be.\" And these were her longest speeches and clearest communications: the rest was only a languid \"Yes, yes; very well; did you? did he? I did not see _that_; I should not know one from the other.\" This was very bad. It was only better than Mrs. Norris's sharp answers would have been; but she being gone home with all the supernumerary jellies to nurse a sick maid, there was peace and good-humour in their little party, though it could not boast much beside.\nThe evening was heavy like the day. \"I cannot think what is the matter with me,\" said Lady Bertram, when the tea-things were removed. \"I feel quite stupid. It must be sitting up so late last night. Fanny, you must do something to keep me awake. I cannot work. Fetch the cards; I feel so very stupid.\"\nThe cards were brought, and Fanny played at cribbage with her aunt till bedtime; and as Sir Thomas was reading to himself, no sounds were heard in the room for the next two hours beyond the reckonings of the game-\"And _that_ makes thirty-one; four in hand and eight in crib. You are to deal, ma'am; shall I deal for you?\" Fanny thought and thought again of the difference which twenty-four hours had made in that room, and all that part of the house. Last night it had been hope and smiles, bustle and motion, noise and brilliancy, in the drawing-room, and out of the drawing-room, and everywhere. Now it was languor, and all but solitude.\nA good night's rest improved her spirits. She could think of William the next day more cheerfully; and as the morning afforded her an opportunity of talking over Thursday night with Mrs. Grant and Miss Crawford, in a very handsome style, with all the heightenings of imagination, and all the laughs of playfulness which are so essential to the shade of a departed ball, she could afterwards bring her mind without much effort into its everyday state, and easily conform to the tranquillity of the present quiet week.\nThey were indeed a smaller party than she had ever known there for a whole day together, and _he_ was gone on whom the comfort and cheerfulness of every family meeting and every meal chiefly depended. But this must be learned to be endured. He would soon be always gone; and she was thankful that she could now sit in the same room with her uncle, hear his voice, receive his questions, and even answer them, without such wretched feelings as she had formerly known.\n\"We miss our two young men,\" was Sir Thomas's observation on both the first and second day, as they formed their very reduced circle after dinner; and in consideration of Fanny's swimming eyes, nothing more was said on the first day than to drink their good health; but on the second it led to something farther. William was kindly commended and his promotion hoped for. \"And there is no reason to suppose,\" added Sir Thomas, \"but that his visits to us may now be tolerably frequent. As to Edmund, we must learn to do without him. This will be the last winter of his belonging to us, as he has done.\"\n\"Yes,\" said Lady Bertram, \"but I wish he was not going away. They are all going away, I think. I wish they would stay at home.\"\nThis wish was levelled principally at Julia, who had just applied for permission to go to town with Maria; and as Sir Thomas thought it best for each daughter that the permission should be granted, Lady Bertram, though in her own good-nature she would not have prevented it, was lamenting the change it made in the prospect of Julia's return, which would otherwise have taken place about this time. A great deal of good sense followed on Sir Thomas's side, tending to reconcile his wife to the arrangement. Everything that a considerate parent _ought_ to feel was advanced for her use; and everything that an affectionate mother _must_ feel in promoting her children's enjoyment was attributed to her nature. Lady Bertram agreed to it all with a calm \"Yes\"; and at the end of a quarter of an hour's silent consideration spontaneously observed, \"Sir Thomas, I have been thinking-and I am very glad we took Fanny as we did, for now the others are away we feel the good of it.\"\nSir Thomas immediately improved this compliment by adding, \"Very true. We shew Fanny what a good girl we think her by praising her to her face, she is now a very valuable companion. If we have been kind to _her_, she is now quite as necessary to _us_.\"\n\"Yes,\" said Lady Bertram presently; \"and it is a comfort to think that we shall always have _her_.\"\nSir Thomas paused, half smiled, glanced at his niece, and then gravely replied, \"She will never leave us, I hope, till invited to some other home that may reasonably promise her greater happiness than she knows here.\"\n\"And _that_ is not very likely to be, Sir Thomas. Who should invite her? Maria might be very glad to see her at Sotherton now and then, but she would not think of asking her to live there; and I am sure she is better off here; and besides, I cannot do without her.\"\nThe week which passed so quietly and peaceably at the great house in Mansfield had a very different character at the Parsonage. To the young lady, at least, in each family, it brought very different feelings. What was tranquillity and comfort to Fanny was tediousness and vexation to Mary. Something arose from difference of disposition and habit: one so easily satisfied, the other so unused to endure; but still more might be imputed to difference of circumstances. In some points of interest they were exactly opposed to each other. To Fanny's mind, Edmund's absence was really, in its cause and its tendency, a relief. To Mary it was every way painful. She felt the want of his society every day, almost every hour, and was too much in want of it to derive anything but irritation from considering the object for which he went. He could not have devised anything more likely to raise his consequence than this week's absence, occurring as it did at the very time of her brother's going away, of William Price's going too, and completing the sort of general break-up of a party which had been so animated. She felt it keenly. They were now a miserable trio, confined within doors by a series of rain and snow, with nothing to do and no variety to hope for. Angry as she was with Edmund for adhering to his own notions, and acting on them in defiance of her (and she had been so angry that they had hardly parted friends at the ball), she could not help thinking of him continually when absent, dwelling on his merit and affection, and longing again for the almost daily meetings they lately had. His absence was unnecessarily long. He should not have planned such an absence-he should not have left home for a week, when her own departure from Mansfield was so near. Then she began to blame herself. She wished she had not spoken so warmly in their last conversation. She was afraid she had used some strong, some contemptuous expressions in speaking of the clergy, and that should not have been. It was ill-bred; it was wrong. She wished such words unsaid with all her heart.\nHer vexation did not end with the week. All this was bad, but she had still more to feel when Friday came round again and brought no Edmund; when Saturday came and still no Edmund; and when, through the slight communication with the other family which Sunday produced, she learned that he had actually written home to defer his return, having promised to remain some days longer with his friend.\nIf she had felt impatience and regret before-if she had been sorry for what she said, and feared its too strong effect on him-she now felt and feared it all tenfold more. She had, moreover, to contend with one disagreeable emotion entirely new to her-jealousy. His friend Mr. Owen had sisters; he might find them attractive. But, at any rate, his staying away at a time when, according to all preceding plans, she was to remove to London, meant something that she could not bear. Had Henry returned, as he talked of doing, at the end of three or four days, she should now have been leaving Mansfield. It became absolutely necessary for her to get to Fanny and try to learn something more. She could not live any longer in such solitary wretchedness; and she made her way to the Park, through difficulties of walking which she had deemed unconquerable a week before, for the chance of hearing a little in addition, for the sake of at least hearing his name.\nThe first half-hour was lost, for Fanny and Lady Bertram were together, and unless she had Fanny to herself she could hope for nothing. But at last Lady Bertram left the room, and then almost immediately Miss Crawford thus began, with a voice as well regulated as she could-\"And how do _you_ like your cousin Edmund's staying away so long? Being the only young person at home, I consider _you_ as the greatest sufferer. You must miss him. Does his staying longer surprise you?\"\n\"I do not know,\" said Fanny hesitatingly. \"Yes; I had not particularly expected it.\"\n\"Perhaps he will always stay longer than he talks of. It is the general way all young men do.\"\n\"He did not, the only time he went to see Mr. Owen before.\"\n\"He finds the house more agreeable _now_. He is a very-a very pleasing young man himself, and I cannot help being rather concerned at not seeing him again before I go to London, as will now undoubtedly be the case. I am looking for Henry every day, and as soon as he comes there will be nothing to detain me at Mansfield. I should like to have seen him once more, I confess. But you must give my compliments to him. Yes; I think it must be compliments. Is not there a something wanted, Miss Price, in our language-a something between compliments and-and love-to suit the sort of friendly acquaintance we have had together? So many months' acquaintance! But compliments may be sufficient here. Was his letter a long one? Does he give you much account of what he is doing? Is it Christmas gaieties that he is staying for?\"\n\"I only heard a part of the letter; it was to my uncle; but I believe it was very short; indeed I am sure it was but a few lines. All that I heard was that his friend had pressed him to stay longer, and that he had agreed to do so. A _few_ days longer, or _some_ days longer; I am not quite sure which.\"\n\"Oh! if he wrote to his father; but I thought it might have been to Lady Bertram or you. But if he wrote to his father, no wonder he was concise. Who could write chat to Sir Thomas? If he had written to you, there would have been more particulars. You would have heard of balls and parties. He would have sent you a description of everything and everybody. How many Miss Owens are there?\"\n\"Three grown up.\"\n\"Are they musical?\"\n\"I do not at all know. I never heard.\"\n\"That is the first question, you know,\" said Miss Crawford, trying to appear gay and unconcerned, \"which every woman who plays herself is sure to ask about another. But it is very foolish to ask questions about any young ladies-about any three sisters just grown up; for one knows, without being told, exactly what they are: all very accomplished and pleasing, and one very pretty. There is a beauty in every family; it is a regular thing. Two play on the pianoforte, and one on the harp; and all sing, or would sing if they were taught, or sing all the better for not being taught; or something like it.\"\n\"I know nothing of the Miss Owens,\" said Fanny calmly.\n\"You know nothing and you care less, as people say. Never did tone express indifference plainer. Indeed, how can one care for those one has never seen? Well, when your cousin comes back, he will find Mansfield very quiet; all the noisy ones gone, your brother and mine and myself. I do not like the idea of leaving Mrs. Grant now the time draws near. She does not like my going.\"\nFanny felt obliged to speak. \"You cannot doubt your being missed by many,\" said she. \"You will be very much missed.\"\nMiss Crawford turned her eye on her, as if wanting to hear or see more, and then laughingly said, \"Oh yes! missed as every noisy evil is missed when it is taken away; that is, there is a great difference felt. But I am not fishing; don't compliment me. If I _am_ missed, it will appear. I may be discovered by those who want to see me. I shall not be in any doubtful, or distant, or unapproachable region.\"\nNow Fanny could not bring herself to speak, and Miss Crawford was disappointed; for she had hoped to hear some pleasant assurance of her power from one who she thought must know, and her spirits were clouded again.\n\"The Miss Owens,\" said she, soon afterwards; \"suppose you were to have one of the Miss Owens settled at Thornton Lacey; how should you like it? Stranger things have happened. I dare say they are trying for it. And they are quite in the right, for it would be a very pretty establishment for them. I do not at all wonder or blame them. It is everybody's duty to do as well for themselves as they can. Sir Thomas Bertram's son is somebody; and now he is in their own line. Their father is a clergyman, and their brother is a clergyman, and they are all clergymen together. He is their lawful property; he fairly belongs to them. You don't speak, Fanny; Miss Price, you don't speak. But honestly now, do not you rather expect it than otherwise?\"\n\"No,\" said Fanny stoutly, \"I do not expect it at all.\"\n\"Not at all!\" cried Miss Crawford with alacrity. \"I wonder at that. But I dare say you know exactly-I always imagine you are-perhaps you do not think him likely to marry at all-or not at present.\"\n\"No, I do not,\" said Fanny softly, hoping she did not err either in the belief or the acknowledgment of it.\nHer companion looked at her keenly; and gathering greater spirit from the blush soon produced from such a look, only said, \"He is best off as he is,\" and turned the subject.",
        "paragraph_chars": [
            [
                0,
                199
            ],
            [
                199,
                880
            ],
            [
                880,
                1264
            ],
            [
                1264,
                2614
            ],
            [
                2614,
                2915
            ],
            [
                2915,
                3555
            ],
            [
                3555,
                4072
            ],
            [
                4072,
                4539
            ],
            [
                4539,
                5140
            ],
            [
                5140,
                5268
            ],
            [
                5268,
                6243
            ],
            [
                6243,
                6496
            ],
            [
                6496,
                6596
            ],
            [
                6596,
                6814
            ],
            [
                6814,
                7080
            ],
            [
                7080,
                9160
            ],
            [
                9160,
                9556
            ],
            [
                9556,
                10513
            ],
            [
                10513,
                10991
            ],
            [
                10991,
                11076
            ],
            [
                11076,
                11171
            ],
            [
                11171,
                11231
            ],
            [
                11231,
                12052
            ],
            [
                12052,
                12356
            ],
            [
                12356,
                12745
            ],
            [
                12745,
                12763
            ],
            [
                12763,
                12783
            ],
            [
                12783,
                12822
            ],
            [
                12822,
                13428
            ],
            [
                13428,
                13483
            ],
            [
                13483,
                13863
            ],
            [
                13863,
                13980
            ],
            [
                13980,
                14387
            ],
            [
                14387,
                14602
            ],
            [
                14602,
                15345
            ],
            [
                15345,
                15400
            ],
            [
                15400,
                15597
            ],
            [
                15597,
                15705
            ],
            [
                15705,
                15878
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                199
            ],
            [
                199,
                645
            ],
            [
                645,
                749
            ],
            [
                749,
                880
            ],
            [
                880,
                1264
            ],
            [
                1264,
                1296
            ],
            [
                1296,
                1431
            ],
            [
                1431,
                1514
            ],
            [
                1514,
                1689
            ],
            [
                1689,
                1779
            ],
            [
                1779,
                2158
            ],
            [
                2158,
                2282
            ],
            [
                2282,
                2290
            ],
            [
                2290,
                2351
            ],
            [
                2351,
                2370
            ],
            [
                2370,
                2614
            ],
            [
                2614,
                2650
            ],
            [
                2650,
                2748
            ],
            [
                2748,
                2770
            ],
            [
                2770,
                2812
            ],
            [
                2812,
                2859
            ],
            [
                2859,
                2874
            ],
            [
                2874,
                2915
            ],
            [
                2915,
                3190
            ],
            [
                3190,
                3237
            ],
            [
                3237,
                3366
            ],
            [
                3366,
                3513
            ],
            [
                3513,
                3555
            ],
            [
                3555,
                3597
            ],
            [
                3597,
                4072
            ],
            [
                4072,
                4273
            ],
            [
                4273,
                4313
            ],
            [
                4313,
                4539
            ],
            [
                4539,
                4852
            ],
            [
                4852,
                4910
            ],
            [
                4910,
                5023
            ],
            [
                5023,
                5070
            ],
            [
                5070,
                5140
            ],
            [
                5140,
                5201
            ],
            [
                5201,
                5235
            ],
            [
                5235,
                5268
            ],
            [
                5268,
                5667
            ],
            [
                5667,
                5775
            ],
            [
                5775,
                5977
            ],
            [
                5977,
                6243
            ],
            [
                6243,
                6314
            ],
            [
                6314,
                6425
            ],
            [
                6425,
                6496
            ],
            [
                6496,
                6596
            ],
            [
                6596,
                6814
            ],
            [
                6814,
                6864
            ],
            [
                6864,
                6887
            ],
            [
                6887,
                7080
            ],
            [
                7080,
                7208
            ],
            [
                7208,
                7289
            ],
            [
                7289,
                7370
            ],
            [
                7370,
                7548
            ],
            [
                7548,
                7616
            ],
            [
                7616,
                7703
            ],
            [
                7703,
                7737
            ],
            [
                7737,
                7912
            ],
            [
                7912,
                8189
            ],
            [
                8189,
                8209
            ],
            [
                8209,
                8340
            ],
            [
                8340,
                8679
            ],
            [
                8679,
                8715
            ],
            [
                8715,
                8850
            ],
            [
                8850,
                8883
            ],
            [
                8883,
                8951
            ],
            [
                8951,
                9080
            ],
            [
                9080,
                9111
            ],
            [
                9111,
                9160
            ],
            [
                9160,
                9200
            ],
            [
                9200,
                9556
            ],
            [
                9556,
                9727
            ],
            [
                9727,
                9817
            ],
            [
                9817,
                9881
            ],
            [
                9881,
                10036
            ],
            [
                10036,
                10157
            ],
            [
                10157,
                10245
            ],
            [
                10245,
                10513
            ],
            [
                10513,
                10649
            ],
            [
                10649,
                10853
            ],
            [
                10853,
                10933
            ],
            [
                10933,
                10952
            ],
            [
                10952,
                10991
            ],
            [
                10991,
                11033
            ],
            [
                11033,
                11076
            ],
            [
                11076,
                11130
            ],
            [
                11130,
                11171
            ],
            [
                11171,
                11231
            ],
            [
                11231,
                11273
            ],
            [
                11273,
                11446
            ],
            [
                11446,
                11553
            ],
            [
                11553,
                11606
            ],
            [
                11606,
                11647
            ],
            [
                11647,
                11684
            ],
            [
                11684,
                11854
            ],
            [
                11854,
                11884
            ],
            [
                11884,
                11924
            ],
            [
                11924,
                11951
            ],
            [
                11951,
                12002
            ],
            [
                12002,
                12052
            ],
            [
                12052,
                12182
            ],
            [
                12182,
                12284
            ],
            [
                12284,
                12356
            ],
            [
                12356,
                12361
            ],
            [
                12361,
                12445
            ],
            [
                12445,
                12502
            ],
            [
                12502,
                12538
            ],
            [
                12538,
                12604
            ],
            [
                12604,
                12647
            ],
            [
                12647,
                12713
            ],
            [
                12713,
                12745
            ],
            [
                12745,
                12763
            ],
            [
                12763,
                12783
            ],
            [
                12783,
                12806
            ],
            [
                12806,
                12822
            ],
            [
                12822,
                12987
            ],
            [
                12987,
                13204
            ],
            [
                13204,
                13262
            ],
            [
                13262,
                13428
            ],
            [
                13428,
                13483
            ],
            [
                13483,
                13535
            ],
            [
                13535,
                13580
            ],
            [
                13580,
                13635
            ],
            [
                13635,
                13764
            ],
            [
                13764,
                13834
            ],
            [
                13834,
                13863
            ],
            [
                13863,
                13892
            ],
            [
                13892,
                13948
            ],
            [
                13948,
                13980
            ],
            [
                13980,
                14087
            ],
            [
                14087,
                14190
            ],
            [
                14190,
                14233
            ],
            [
                14233,
                14267
            ],
            [
                14267,
                14316
            ],
            [
                14316,
                14387
            ],
            [
                14387,
                14602
            ],
            [
                14602,
                14746
            ],
            [
                14746,
                14777
            ],
            [
                14777,
                14812
            ],
            [
                14812,
                14899
            ],
            [
                14899,
                14937
            ],
            [
                14937,
                15002
            ],
            [
                15002,
                15073
            ],
            [
                15073,
                15173
            ],
            [
                15173,
                15229
            ],
            [
                15229,
                15282
            ],
            [
                15282,
                15345
            ],
            [
                15345,
                15400
            ],
            [
                15400,
                15414
            ],
            [
                15414,
                15449
            ],
            [
                15449,
                15468
            ],
            [
                15468,
                15597
            ],
            [
                15597,
                15705
            ],
            [
                15705,
                15878
            ]
        ],
        "overlap_chars": [
            [
                23,
                50
            ],
            [
                54,
                103
            ],
            [
                103,
                119
            ],
            [
                137,
                199
            ],
            [
                240,
                306
            ],
            [
                343,
                427
            ],
            [
                522,
                537
            ],
            [
                550,
                645
            ],
            [
                645,
                662
            ],
            [
                677,
                703
            ],
            [
                747,
                749
            ],
            [
                749,
                774
            ],
            [
                779,
                833
            ],
            [
                878,
                880
            ],
            [
                1264,
                1296
            ],
            [
                1329,
                1431
            ],
            [
                1431,
                1514
            ],
            [
                1514,
                1544
            ],
            [
                1634,
                1635
            ],
            [
                1584,
                1587
            ],
            [
                1670,
                1689
            ],
            [
                1689,
                1779
            ],
            [
                2173,
                2176
            ],
            [
                2232,
                2235
            ],
            [
                2241,
                2250
            ],
            [
                2251,
                2256
            ],
            [
                2262,
                2282
            ],
            [
                2282,
                2290
            ],
            [
                2290,
                2303
            ],
            [
                2305,
                2309
            ],
            [
                2310,
                2351
            ],
            [
                2351,
                2370
            ],
            [
                2370,
                2446
            ],
            [
                2526,
                2529
            ],
            [
                2453,
                2467
            ],
            [
                2472,
                2475
            ],
            [
                2490,
                2518
            ],
            [
                2612,
                2614
            ],
            [
                2614,
                2650
            ],
            [
                2650,
                2712
            ],
            [
                2746,
                2748
            ],
            [
                2748,
                2770
            ],
            [
                2770,
                2812
            ],
            [
                2812,
                2859
            ],
            [
                2874,
                2915
            ],
            [
                2915,
                3132
            ],
            [
                3134,
                3138
            ],
            [
                3140,
                3190
            ],
            [
                3190,
                3237
            ],
            [
                3237,
                3250
            ],
            [
                3269,
                3319
            ],
            [
                3364,
                3366
            ],
            [
                3366,
                3388
            ],
            [
                3406,
                3446
            ],
            [
                3501,
                3513
            ],
            [
                3513,
                3555
            ],
            [
                3555,
                3597
            ],
            [
                3597,
                3623
            ],
            [
                3637,
                3660
            ],
            [
                4025,
                4027
            ],
            [
                3712,
                3766
            ],
            [
                3793,
                3805
            ],
            [
                3857,
                3868
            ],
            [
                3879,
                3960
            ],
            [
                3986,
                3998
            ],
            [
                4032,
                4044
            ],
            [
                4070,
                4072
            ],
            [
                4072,
                4081
            ],
            [
                4089,
                4090
            ],
            [
                4099,
                4104
            ],
            [
                4159,
                4160
            ],
            [
                4174,
                4178
            ],
            [
                4271,
                4273
            ],
            [
                4273,
                4276
            ],
            [
                4282,
                4286
            ],
            [
                4298,
                4300
            ],
            [
                4277,
                4281
            ],
            [
                4311,
                4313
            ],
            [
                4313,
                4418
            ],
            [
                4459,
                4462
            ],
            [
                4468,
                4474
            ],
            [
                4444,
                4457
            ],
            [
                4481,
                4514
            ],
            [
                4523,
                4531
            ],
            [
                4537,
                4539
            ],
            [
                4539,
                4567
            ],
            [
                4572,
                4582
            ],
            [
                4755,
                4771
            ],
            [
                4684,
                4689
            ],
            [
                4710,
                4732
            ],
            [
                4750,
                4754
            ],
            [
                4733,
                4745
            ],
            [
                4772,
                4822
            ],
            [
                4626,
                4630
            ],
            [
                4852,
                4909
            ],
            [
                4910,
                4911
            ],
            [
                4975,
                5002
            ],
            [
                5013,
                5021
            ],
            [
                4944,
                4946
            ],
            [
                4953,
                4963
            ],
            [
                5021,
                5023
            ],
            [
                5023,
                5070
            ],
            [
                5070,
                5121
            ],
            [
                5137,
                5140
            ],
            [
                5140,
                5201
            ],
            [
                5201,
                5235
            ],
            [
                5235,
                5268
            ],
            [
                5268,
                5325
            ],
            [
                5349,
                5392
            ],
            [
                5457,
                5464
            ],
            [
                5338,
                5348
            ],
            [
                5464,
                5478
            ],
            [
                5543,
                5609
            ],
            [
                5665,
                5667
            ],
            [
                5710,
                5716
            ],
            [
                5683,
                5693
            ],
            [
                5733,
                5775
            ],
            [
                5858,
                5896
            ],
            [
                5898,
                5902
            ],
            [
                5904,
                5977
            ],
            [
                5977,
                6006
            ],
            [
                6026,
                6029
            ],
            [
                6102,
                6124
            ],
            [
                6150,
                6243
            ],
            [
                6243,
                6265
            ],
            [
                6300,
                6314
            ],
            [
                6314,
                6316
            ],
            [
                6322,
                6385
            ],
            [
                6387,
                6423
            ],
            [
                6496,
                6520
            ],
            [
                6530,
                6587
            ],
            [
                6589,
                6592
            ],
            [
                6593,
                6596
            ],
            [
                6596,
                6606
            ],
            [
                6615,
                6653
            ],
            [
                6659,
                6750
            ],
            [
                6762,
                6791
            ],
            [
                6811,
                6814
            ],
            [
                6814,
                6815
            ],
            [
                6820,
                6824
            ],
            [
                6826,
                6844
            ],
            [
                6850,
                6864
            ],
            [
                6864,
                6887
            ],
            [
                6887,
                6892
            ],
            [
                6958,
                6995
            ],
            [
                6923,
                6935
            ],
            [
                7039,
                7080
            ],
            [
                7080,
                7112
            ],
            [
                7127,
                7208
            ],
            [
                7289,
                7370
            ],
            [
                7616,
                7703
            ],
            [
                7703,
                7737
            ],
            [
                7737,
                7769
            ],
            [
                7781,
                7807
            ],
            [
                7903,
                7912
            ],
            [
                8209,
                8239
            ],
            [
                8239,
                8265
            ],
            [
                8278,
                8311
            ],
            [
                8338,
                8340
            ],
            [
                8340,
                8635
            ],
            [
                8640,
                8661
            ],
            [
                8677,
                8679
            ],
            [
                8715,
                8757
            ],
            [
                8797,
                8849
            ],
            [
                8850,
                8883
            ],
            [
                8883,
                8951
            ],
            [
                8951,
                8991
            ],
            [
                8997,
                9057
            ],
            [
                9083,
                9111
            ],
            [
                9111,
                9160
            ],
            [
                9200,
                9300
            ],
            [
                9306,
                9314
            ],
            [
                9349,
                9350
            ],
            [
                9320,
                9349
            ],
            [
                9429,
                9452
            ],
            [
                9462,
                9556
            ],
            [
                9556,
                9600
            ],
            [
                9640,
                9641
            ],
            [
                9682,
                9694
            ],
            [
                9706,
                9708
            ],
            [
                9713,
                9727
            ],
            [
                9727,
                9761
            ],
            [
                9787,
                9799
            ],
            [
                9779,
                9786
            ],
            [
                9806,
                9817
            ],
            [
                9817,
                9881
            ],
            [
                10157,
                10198
            ],
            [
                10216,
                10243
            ],
            [
                10304,
                10338
            ],
            [
                10212,
                10215
            ],
            [
                10206,
                10211
            ],
            [
                10420,
                10456
            ],
            [
                10338,
                10339
            ],
            [
                10486,
                10513
            ],
            [
                10717,
                10798
            ],
            [
                10800,
                10803
            ],
            [
                10805,
                10853
            ],
            [
                10933,
                10952
            ],
            [
                10952,
                10991
            ],
            [
                10991,
                11033
            ],
            [
                11033,
                11076
            ],
            [
                11076,
                11092
            ],
            [
                11100,
                11128
            ],
            [
                11156,
                11171
            ],
            [
                11171,
                11231
            ],
            [
                11231,
                11265
            ],
            [
                11267,
                11270
            ],
            [
                11273,
                11407
            ],
            [
                11444,
                11446
            ],
            [
                11484,
                11494
            ],
            [
                11463,
                11468
            ],
            [
                11498,
                11553
            ],
            [
                11553,
                11606
            ],
            [
                11606,
                11647
            ],
            [
                11647,
                11684
            ],
            [
                11684,
                11708
            ],
            [
                11715,
                11854
            ],
            [
                11884,
                11924
            ],
            [
                11924,
                11951
            ],
            [
                12002,
                12052
            ],
            [
                12052,
                12139
            ],
            [
                12180,
                12182
            ],
            [
                12182,
                12242
            ],
            [
                12284,
                12285
            ],
            [
                12287,
                12290
            ],
            [
                12292,
                12296
            ],
            [
                12243,
                12282
            ],
            [
                12353,
                12356
            ],
            [
                12356,
                12361
            ],
            [
                12449,
                12502
            ],
            [
                12502,
                12538
            ],
            [
                12538,
                12585
            ],
            [
                12591,
                12602
            ],
            [
                12625,
                12647
            ],
            [
                12647,
                12686
            ],
            [
                12702,
                12713
            ],
            [
                12713,
                12745
            ],
            [
                12745,
                12763
            ],
            [
                12763,
                12783
            ],
            [
                12783,
                12804
            ],
            [
                12822,
                12987
            ],
            [
                12987,
                12990
            ],
            [
                13093,
                13136
            ],
            [
                13056,
                13073
            ],
            [
                13145,
                13204
            ],
            [
                13262,
                13428
            ],
            [
                13428,
                13483
            ],
            [
                13483,
                13535
            ],
            [
                13580,
                13635
            ],
            [
                13635,
                13729
            ],
            [
                13756,
                13762
            ],
            [
                13762,
                13764
            ],
            [
                13798,
                13808
            ],
            [
                13838,
                13863
            ],
            [
                13863,
                13892
            ],
            [
                13892,
                13948
            ],
            [
                13948,
                13980
            ],
            [
                13980,
                14087
            ],
            [
                14087,
                14145
            ],
            [
                14188,
                14190
            ],
            [
                14190,
                14193
            ],
            [
                14267,
                14275
            ],
            [
                14287,
                14316
            ],
            [
                14316,
                14337
            ],
            [
                14351,
                14387
            ],
            [
                14387,
                14564
            ],
            [
                14600,
                14602
            ],
            [
                14602,
                14629
            ],
            [
                14647,
                14746
            ],
            [
                14777,
                14812
            ],
            [
                14849,
                14899
            ],
            [
                15073,
                15173
            ],
            [
                15229,
                15252
            ],
            [
                15282,
                15327
            ],
            [
                15342,
                15345
            ],
            [
                15345,
                15400
            ],
            [
                15400,
                15414
            ],
            [
                15414,
                15449
            ],
            [
                15468,
                15491
            ],
            [
                15524,
                15597
            ],
            [
                15597,
                15654
            ],
            [
                15703,
                15705
            ],
            [
                15705,
                15774
            ],
            [
                15779,
                15784
            ],
            [
                15815,
                15878
            ]
        ],
        "row_chars": [
            [
                0,
                103
            ],
            [
                103,
                199
            ],
            [
                199,
                645
            ],
            [
                645,
                749
            ],
            [
                749,
                880
            ],
            [
                880,
                1264
            ],
            [
                1264,
                1296
            ],
            [
                1296,
                1431
            ],
            [
                1431,
                1514
            ],
            [
                1514,
                1689
            ],
            [
                1689,
                1779
            ],
            [
                1779,
                2158
            ],
            [
                2158,
                2282
            ],
            [
                2282,
                2290
            ],
            [
                2290,
                2351
            ],
            [
                2351,
                2370
            ],
            [
                2370,
                2614
            ],
            [
                2614,
                2650
            ],
            [
                2650,
                2748
            ],
            [
                2748,
                2770
            ],
            [
                2770,
                2812
            ],
            [
                2812,
                2859
            ],
            [
                2859,
                2874
            ],
            [
                2874,
                2915
            ],
            [
                2915,
                3190
            ],
            [
                3190,
                3237
            ],
            [
                3237,
                3366
            ],
            [
                3366,
                3513
            ],
            [
                3513,
                3555
            ],
            [
                3555,
                3597
            ],
            [
                3597,
                4072
            ],
            [
                4072,
                4273
            ],
            [
                4273,
                4313
            ],
            [
                4313,
                4539
            ],
            [
                4539,
                4910
            ],
            [
                4910,
                5023
            ],
            [
                5023,
                5070
            ],
            [
                5070,
                5140
            ],
            [
                5140,
                5201
            ],
            [
                5201,
                5235
            ],
            [
                5235,
                5268
            ],
            [
                5268,
                5667
            ],
            [
                5667,
                5775
            ],
            [
                5775,
                5977
            ],
            [
                5977,
                6243
            ],
            [
                6243,
                6314
            ],
            [
                6314,
                6425
            ],
            [
                6425,
                6496
            ],
            [
                6496,
                6596
            ],
            [
                6596,
                6814
            ],
            [
                6814,
                6864
            ],
            [
                6864,
                6887
            ],
            [
                6887,
                7080
            ],
            [
                7080,
                7208
            ],
            [
                7208,
                7289
            ],
            [
                7289,
                7370
            ],
            [
                7370,
                7548
            ],
            [
                7548,
                7616
            ],
            [
                7616,
                7703
            ],
            [
                7703,
                7737
            ],
            [
                7737,
                7912
            ],
            [
                7912,
                8189
            ],
            [
                8189,
                8209
            ],
            [
                8209,
                8340
            ],
            [
                8340,
                8679
            ],
            [
                8679,
                8715
            ],
            [
                8715,
                8850
            ],
            [
                8850,
                8883
            ],
            [
                8883,
                8951
            ],
            [
                8951,
                9111
            ],
            [
                9111,
                9160
            ],
            [
                9160,
                9200
            ],
            [
                9200,
                9556
            ],
            [
                9556,
                9727
            ],
            [
                9727,
                9817
            ],
            [
                9817,
                9881
            ],
            [
                9881,
                10036
            ],
            [
                10036,
                10157
            ],
            [
                10157,
                10513
            ],
            [
                10513,
                10649
            ],
            [
                10649,
                10853
            ],
            [
                10853,
                10933
            ],
            [
                10933,
                10952
            ],
            [
                10952,
                10991
            ],
            [
                10991,
                11033
            ],
            [
                11033,
                11076
            ],
            [
                11076,
                11171
            ],
            [
                11171,
                11231
            ],
            [
                11231,
                11273
            ],
            [
                11273,
                11446
            ],
            [
                11446,
                11553
            ],
            [
                11553,
                11606
            ],
            [
                11606,
                11647
            ],
            [
                11647,
                11684
            ],
            [
                11684,
                11854
            ],
            [
                11854,
                11884
            ],
            [
                11884,
                11924
            ],
            [
                11924,
                11951
            ],
            [
                11951,
                12002
            ],
            [
                12002,
                12052
            ],
            [
                12052,
                12182
            ],
            [
                12182,
                12356
            ],
            [
                12356,
                12361
            ],
            [
                12361,
                12445
            ],
            [
                12445,
                12502
            ],
            [
                12502,
                12538
            ],
            [
                12538,
                12647
            ],
            [
                12647,
                12713
            ],
            [
                12713,
                12745
            ],
            [
                12745,
                12763
            ],
            [
                12763,
                12783
            ],
            [
                12783,
                12806
            ],
            [
                12806,
                12822
            ],
            [
                12822,
                12987
            ],
            [
                12987,
                13204
            ],
            [
                13204,
                13262
            ],
            [
                13262,
                13428
            ],
            [
                13428,
                13483
            ],
            [
                13483,
                13535
            ],
            [
                13535,
                13580
            ],
            [
                13580,
                13635
            ],
            [
                13635,
                13764
            ],
            [
                13764,
                13863
            ],
            [
                13863,
                13892
            ],
            [
                13892,
                13948
            ],
            [
                13948,
                13980
            ],
            [
                13980,
                14087
            ],
            [
                14087,
                14190
            ],
            [
                14190,
                14316
            ],
            [
                14316,
                14387
            ],
            [
                14387,
                14602
            ],
            [
                14602,
                14746
            ],
            [
                14746,
                14777
            ],
            [
                14777,
                14812
            ],
            [
                14812,
                14899
            ],
            [
                14899,
                14937
            ],
            [
                14937,
                15002
            ],
            [
                15002,
                15073
            ],
            [
                15073,
                15173
            ],
            [
                15173,
                15229
            ],
            [
                15229,
                15345
            ],
            [
                15345,
                15400
            ],
            [
                15400,
                15414
            ],
            [
                15414,
                15449
            ],
            [
                15449,
                15468
            ],
            [
                15468,
                15597
            ],
            [
                15597,
                15705
            ],
            [
                15705,
                15878
            ]
        ]
    },
    "abridged": {
        "text": "The breakfast was soon over; the last kiss was given, and William was gone. Mr. Crawford had been very punctual, and short and pleasant had been the meal.\nFanny walked back to the breakfast-room with a very saddened heart; and there her uncle kindly left her to cry in peace, conceiving, perhaps, that the cold pork bones in William's plate might but divide her feelings with the broken egg-shells in Mr. Crawford's. She sat and cried as her uncle intended, but for her brother only. William was gone, and she felt as if she had wasted half his visit in idle cares.\nIt was a heavy, melancholy day. Edmund bade them good-bye for a week, and mounted his horse for Peterborough, and then all were gone. Nothing remained of last night but remembrances, which she had nobody to share in. She talked to her aunt Bertram, but it was heavy work. Lady Bertram was not certain of anybody's dress or anybody's place at supper but her own. Much of her conversation was a languid, \"Yes, very well; did you? did he? I did not see that; I should not know one from the other.\" This was very bad. It was only better than Mrs. Norris's sharp answers would have been; but she was gone home with the leftover jellies to nurse a sick maid.\nThe evening was heavy like the day. \"I cannot think what is the matter with me,\" said Lady Bertram. \"I feel quite stupid. It must be sitting up so late last night. Fanny, you must do something to keep me awake. Fetch the cards; I feel so very stupid.\"\nThe cards were brought, and Fanny played at cribbage with her aunt till bedtime; and as Sir Thomas was reading to himself, no sounds were heard in the room for the next two hours beyond the reckonings of the game-\"And that makes thirty-one; four in hand and eight in crib. You are to deal, ma'am; shall I deal for you?\" Fanny thought of the difference which twenty-four hours had made. Last night it had been bustle and motion, noise and brilliancy, everywhere. Now it was languor, and all but solitude.\nA good night's rest improved her spirits. She could think of William more cheerfully; and as she was able to talk over Thursday night with Mrs. Grant and Miss Crawford, with all the playfulness so essential to the shade of a departed ball, she could afterwards bring her mind back to its everyday tranquillity.\nThey were a small party now, with Edmund gone. But she must learn to endure this. He would soon be always gone; and she was thankful that she could now sit in the same room with her uncle and answer his questions without such wretched feelings as formerly.\n\"We miss our two young men,\" observed Sir Thomas on the first day; and seeing Fanny's swimming eyes, said nothing more than to drink their good health; but on the second day, William was kindly commended and his promotion hoped for.\n\"His visits to us may now be more frequent,\" said Sir Thomas. \"As to Edmund, we must learn to do without him. This will be the last winter of his belonging to us.\"\n\"Yes,\" said Lady Bertram, \"but I wish he was not going away. They are all going away, I think. I wish they would stay at home.\"\nThis wish was levelled principally at Julia, who had just asked to go to town with Maria; and as Sir Thomas had granted permission, Lady Bertram was lamenting the change it made in the prospect of Julia's return. Sir Thomas used much good sense to reconcile his wife to the arrangement. Everything that an affectionate mother must feel in promoting her children's enjoyment was attributed to her nature. Lady Bertram agreed to it all, and then observed, \"Sir Thomas, I am very glad we took Fanny as we did, for now the others are away we feel the good of it.\"\nSir Thomas immediately added, \"Very true. We show Fanny what a good girl we think her by praising her to her face; she is now a very valuable companion.\"\n\"Yes,\" said Lady Bertram; \"and it is a comfort to think that we shall always have her.\"\nSir Thomas half smiled, glanced at his niece, and gravely replied, \"She will never leave us, I hope, till invited to some other home that may promise her greater happiness.\"\n\"That is not very likely, Sir Thomas. Who should invite her? Maria would not think of asking her to live at Sotherton; and besides, I cannot do without her.\"\nThe week which passed so quietly at the great house in Mansfield had a very different character at the Parsonage. What was tranquillity and comfort to Fanny was tediousness and vexation to Mary. To Fanny's mind, Edmund's absence was really, in its cause and its tendency, a relief. To Mary it was every way painful. She felt the want of his society almost every hour, and was irritated when she considered why he went. They were now a miserable trio at the Parsonage, confined within doors by rain and snow, with nothing to do. Angry as she was with Edmund for adhering to his own notions, and acting on them in defiance of her (and she had been so angry that they had hardly parted friends at the ball), she could not help thinking of him continually when absent, dwelling on his merit and affection, and longing again for their almost daily meetings. He should not have planned such an absence, when her own departure from Mansfield was so near.\nThen she began to blame herself. She wished she had not spoken so warmly in their last conversation. She was afraid she had used some strong, contemptuous expressions in speaking of the clergy, and that was ill-bred; it was wrong. She wished such words unsaid with all her heart.\nAll this was bad, but she had still more to feel when Friday came round again and brought no Edmund; Saturday, and still no Edmund; and when she learned that he had written home to defer his return, having promised to remain some days longer with his friend.\nIf she had felt impatience and regret before, she now felt it tenfold more. She had, moreover, to contend with an entirely new emotion-jealousy. His friend Mr. Owen had sisters; he might find them attractive. It became absolutely necessary for her to try to learn something more; and she made her way to the Park and Fanny, for the chance of hearing a little news, or at least hearing his name.\nMiss Crawford thus began, with a voice as well regulated as she could-\"And how do you like your cousin Edmund's staying away so long? You must miss him. Does his staying longer surprise you?\"\n\"I do not know,\" said Fanny hesitatingly. \"Yes; I had not particularly expected it.\"\n\"Perhaps he will stay longer than he talks of, as young men do.\"\n\"He did not, the only time he went to see Mr. Owen before.\"\n\"He finds the house more agreeable now. He is a very-a very pleasing young man himself, and I cannot help being rather concerned at not seeing him again before I go to London. As soon as Henry comes there will be nothing to detain me at Mansfield. I should like to have seen him once more, I confess. But you must give my compliments to him. Yes; I think it must be compliments. Is not there a something needed, Miss Price, in our language-a something between compliments and-and love-to suit the sort of friendly acquaintance we have had together? But compliments may be sufficient here. Was his letter a long one? Is it Christmas gaieties that he is staying for?\"\n\"I only heard a part of the letter; it was to my uncle; but I believe it was very short. All that I heard was that his friend had pressed him to stay a few days longer, and that he had agreed to do so.\"\n\"Oh! if he wrote to his father, no wonder he was concise. Who could write chat to Sir Thomas? If he had written to you, there would have been particulars of balls and parties. He would have sent you a description of everybody. How many Miss Owens are there?\"\n\"Three grown up.\"\n\"Are they musical?\"\n\"I do not at all know.\"\n\"That is the first question, you know,\" said Miss Crawford, trying to appear gay and unconcerned, \"which every woman who plays herself is sure to ask about another. But one knows, without being told, exactly what any three sisters must be: all very accomplished and pleasing, and one very pretty. Two play on the pianoforte, and one on the harp; and all sing, or would sing if they were taught, or sing all the better for not being taught; or something like it.\"\n\"I know nothing of the Miss Owens,\" said Fanny calmly.\n\"You know nothing and you care less, as people say. Indeed, how can one care for those one has never seen? Well, when your cousin comes back, he will find Mansfield very quiet; all the noisy ones gone, myself included. Mrs. Grant does not like my going.\"\nFanny felt obliged to speak. \"You cannot doubt your being missed by many,\" said she. \"You will be very much missed.\"\nMiss Crawford turned her eye on her, as if wanting to hear or see more, and then laughingly said, \"Oh yes! missed as every noisy evil is missed when it is taken away. But I may be found by those who want to see me. I shall not be in any distant, or unapproachable region.\"\nNow Fanny could not bring herself to speak, and Miss Crawford was disappointed; for she had hoped to hear some pleasant assurance of her power from one who she thought must know.\n\"The Miss Owens,\" said she, \"suppose you were to have one of the Miss Owens settled at Thornton Lacey; how should you like it? I dare say they are trying for it. It would be a very pretty establishment for them. Their father is a clergyman, and their brother is a clergyman, and they are all clergymen together. You don't speak, Fanny; but honestly now, do not you rather expect it?\"\n\"No,\" said Fanny stoutly, \"I do not expect it at all.\"\n\"Not at all!\" cried Miss Crawford with alacrity. \"But I dare say you know-perhaps you do not think him likely to marry at all-or not at present.\"\n\"No, I do not,\" said Fanny softly, hoping she did not err.\nHer companion looked at her keenly; and gathering greater spirit from Fanny's blush, only said, \"He is best off as he is,\" and turned the subject.",
        "paragraph_chars": [
            [
                0,
                155
            ],
            [
                155,
                566
            ],
            [
                566,
                1219
            ],
            [
                1219,
                1471
            ],
            [
                1471,
                1975
            ],
            [
                1975,
                2286
            ],
            [
                2286,
                2543
            ],
            [
                2543,
                2776
            ],
            [
                2776,
                2940
            ],
            [
                2940,
                3068
            ],
            [
                3068,
                3628
            ],
            [
                3628,
                3782
            ],
            [
                3782,
                3870
            ],
            [
                3870,
                4044
            ],
            [
                4044,
                4202
            ],
            [
                4202,
                5150
            ],
            [
                5150,
                5430
            ],
            [
                5430,
                5689
            ],
            [
                5689,
                6084
            ],
            [
                6084,
                6276
            ],
            [
                6276,
                6361
            ],
            [
                6361,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                7152
            ],
            [
                7152,
                7355
            ],
            [
                7355,
                7614
            ],
            [
                7614,
                7632
            ],
            [
                7632,
                7652
            ],
            [
                7652,
                7676
            ],
            [
                7676,
                8139
            ],
            [
                8139,
                8194
            ],
            [
                8194,
                8449
            ],
            [
                8449,
                8566
            ],
            [
                8566,
                8839
            ],
            [
                8839,
                9018
            ],
            [
                9018,
                9402
            ],
            [
                9402,
                9457
            ],
            [
                9457,
                9603
            ],
            [
                9603,
                9662
            ],
            [
                9662,
                9808
            ]
        ],
        "segment_chars": [
            [
                0,
                76
            ],
            [
                76,
                155
            ],
            [
                155,
                417
            ],
            [
                417,
                484
            ],
            [
                484,
                566
            ],
            [
                566,
                598
            ],
            [
                598,
                700
            ],
            [
                700,
                783
            ],
            [
                783,
                838
            ],
            [
                838,
                928
            ],
            [
                928,
                994
            ],
            [
                994,
                1002
            ],
            [
                1002,
                1061
            ],
            [
                1061,
                1080
            ],
            [
                1080,
                1219
            ],
            [
                1219,
                1255
            ],
            [
                1255,
                1319
            ],
            [
                1319,
                1341
            ],
            [
                1341,
                1383
            ],
            [
                1383,
                1430
            ],
            [
                1430,
                1471
            ],
            [
                1471,
                1744
            ],
            [
                1744,
                1791
            ],
            [
                1791,
                1857
            ],
            [
                1857,
                1933
            ],
            [
                1933,
                1975
            ],
            [
                1975,
                2017
            ],
            [
                2017,
                2286
            ],
            [
                2286,
                2333
            ],
            [
                2333,
                2368
            ],
            [
                2368,
                2543
            ],
            [
                2543,
                2776
            ],
            [
                2776,
                2838
            ],
            [
                2838,
                2886
            ],
            [
                2886,
                2940
            ],
            [
                2940,
                3001
            ],
            [
                3001,
                3035
            ],
            [
                3035,
                3068
            ],
            [
                3068,
                3281
            ],
            [
                3281,
                3355
            ],
            [
                3355,
                3472
            ],
            [
                3472,
                3628
            ],
            [
                3628,
                3670
            ],
            [
                3670,
                3782
            ],
            [
                3782,
                3870
            ],
            [
                3870,
                4044
            ],
            [
                4044,
                4082
            ],
            [
                4082,
                4105
            ],
            [
                4105,
                4202
            ],
            [
                4202,
                4316
            ],
            [
                4316,
                4397
            ],
            [
                4397,
                4484
            ],
            [
                4484,
                4518
            ],
            [
                4518,
                4621
            ],
            [
                4621,
                4730
            ],
            [
                4730,
                5055
            ],
            [
                5055,
                5150
            ],
            [
                5150,
                5183
            ],
            [
                5183,
                5251
            ],
            [
                5251,
                5381
            ],
            [
                5381,
                5430
            ],
            [
                5430,
                5689
            ],
            [
                5689,
                5765
            ],
            [
                5765,
                5834
            ],
            [
                5834,
                5898
            ],
            [
                5898,
                6084
            ],
            [
                6084,
                6218
            ],
            [
                6218,
                6237
            ],
            [
                6237,
                6276
            ],
            [
                6276,
                6318
            ],
            [
                6318,
                6361
            ],
            [
                6361,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                6526
            ],
            [
                6526,
                6662
            ],
            [
                6662,
                6734
            ],
            [
                6734,
                6787
            ],
            [
                6787,
                6828
            ],
            [
                6828,
                6865
            ],
            [
                6865,
                7035
            ],
            [
                7035,
                7075
            ],
            [
                7075,
                7102
            ],
            [
                7102,
                7152
            ],
            [
                7152,
                7241
            ],
            [
                7241,
                7355
            ],
            [
                7355,
                7360
            ],
            [
                7360,
                7413
            ],
            [
                7413,
                7449
            ],
            [
                7449,
                7531
            ],
            [
                7531,
                7582
            ],
            [
                7582,
                7614
            ],
            [
                7614,
                7632
            ],
            [
                7632,
                7652
            ],
            [
                7652,
                7676
            ],
            [
                7676,
                7841
            ],
            [
                7841,
                7973
            ],
            [
                7973,
                8139
            ],
            [
                8139,
                8194
            ],
            [
                8194,
                8246
            ],
            [
                8246,
                8301
            ],
            [
                8301,
                8413
            ],
            [
                8413,
                8449
            ],
            [
                8449,
                8478
            ],
            [
                8478,
                8534
            ],
            [
                8534,
                8566
            ],
            [
                8566,
                8673
            ],
            [
                8673,
                8733
            ],
            [
                8733,
                8781
            ],
            [
                8781,
                8839
            ],
            [
                8839,
                9018
            ],
            [
                9018,
                9145
            ],
            [
                9145,
                9180
            ],
            [
                9180,
                9230
            ],
            [
                9230,
                9330
            ],
            [
                9330,
                9402
            ],
            [
                9402,
                9457
            ],
            [
                9457,
                9471
            ],
            [
                9471,
                9506
            ],
            [
                9506,
                9603
            ],
            [
                9603,
                9662
            ],
            [
                9662,
                9808
            ]
        ],
        "overlap_chars": [
            [
                0,
                27
            ],
            [
                27,
                76
            ],
            [
                76,
                92
            ],
            [
                93,
                155
            ],
            [
                155,
                221
            ],
            [
                221,
                305
            ],
            [
                306,
                321
            ],
            [
                322,
                417
            ],
            [
                417,
                434
            ],
            [
                435,
                461
            ],
            [
                482,
                484
            ],
            [
                484,
                509
            ],
            [
                510,
                564
            ],
            [
                564,
                566
            ],
            [
                566,
                598
            ],
            [
                598,
                700
            ],
            [
                700,
                783
            ],
            [
                783,
                813
            ],
            [
                813,
                814
            ],
            [
                815,
                818
            ],
            [
                819,
                838
            ],
            [
                838,
                928
            ],
            [
                936,
                939
            ],
            [
                953,
                956
            ],
            [
                957,
                966
            ],
            [
                968,
                973
            ],
            [
                974,
                994
            ],
            [
                994,
                1002
            ],
            [
                1002,
                1015
            ],
            [
                1016,
                1020
            ],
            [
                1020,
                1061
            ],
            [
                1061,
                1080
            ],
            [
                1080,
                1156
            ],
            [
                1157,
                1160
            ],
            [
                1161,
                1175
            ],
            [
                1176,
                1179
            ],
            [
                1189,
                1217
            ],
            [
                1217,
                1219
            ],
            [
                1219,
                1255
            ],
            [
                1255,
                1317
            ],
            [
                1317,
                1319
            ],
            [
                1319,
                1341
            ],
            [
                1341,
                1383
            ],
            [
                1383,
                1430
            ],
            [
                1430,
                1471
            ],
            [
                1471,
                1688
            ],
            [
                1689,
                1693
            ],
            [
                1694,
                1744
            ],
            [
                1744,
                1791
            ],
            [
                1791,
                1804
            ],
            [
                1805,
                1855
            ],
            [
                1855,
                1857
            ],
            [
                1857,
                1879
            ],
            [
                1880,
                1920
            ],
            [
                1921,
                1933
            ],
            [
                1933,
                1975
            ],
            [
                1975,
                2017
            ],
            [
                2017,
                2043
            ],
            [
                2044,
                2067
            ],
            [
                2081,
                2083
            ],
            [
                2089,
                2143
            ],
            [
                2144,
                2156
            ],
            [
                2157,
                2168
            ],
            [
                2169,
                2250
            ],
            [
                2259,
                2271
            ],
            [
                2272,
                2284
            ],
            [
                2284,
                2286
            ],
            [
                2286,
                2295
            ],
            [
                2296,
                2297
            ],
            [
                2304,
                2309
            ],
            [
                2313,
                2314
            ],
            [
                2327,
                2331
            ],
            [
                2331,
                2333
            ],
            [
                2333,
                2336
            ],
            [
                2341,
                2345
            ],
            [
                2352,
                2354
            ],
            [
                2362,
                2366
            ],
            [
                2366,
                2368
            ],
            [
                2368,
                2473
            ],
            [
                2474,
                2477
            ],
            [
                2478,
                2484
            ],
            [
                2485,
                2498
            ],
            [
                2499,
                2532
            ],
            [
                2533,
                2541
            ],
            [
                2541,
                2543
            ],
            [
                2543,
                2571
            ],
            [
                2581,
                2591
            ],
            [
                2592,
                2608
            ],
            [
                2608,
                2613
            ],
            [
                2621,
                2643
            ],
            [
                2644,
                2648
            ],
            [
                2649,
                2661
            ],
            [
                2662,
                2712
            ],
            [
                2713,
                2717
            ],
            [
                2718,
                2775
            ],
            [
                2776,
                2777
            ],
            [
                2777,
                2804
            ],
            [
                2810,
                2818
            ],
            [
                2818,
                2820
            ],
            [
                2826,
                2836
            ],
            [
                2836,
                2838
            ],
            [
                2839,
                2886
            ],
            [
                2886,
                2937
            ],
            [
                2937,
                2940
            ],
            [
                2940,
                3001
            ],
            [
                3001,
                3035
            ],
            [
                3035,
                3068
            ],
            [
                3068,
                3125
            ],
            [
                3132,
                3175
            ],
            [
                3180,
                3187
            ],
            [
                3188,
                3198
            ],
            [
                3198,
                3212
            ],
            [
                3213,
                3279
            ],
            [
                3279,
                3281
            ],
            [
                3285,
                3291
            ],
            [
                3302,
                3312
            ],
            [
                3313,
                3355
            ],
            [
                3355,
                3393
            ],
            [
                3394,
                3398
            ],
            [
                3399,
                3472
            ],
            [
                3472,
                3501
            ],
            [
                3503,
                3506
            ],
            [
                3512,
                3534
            ],
            [
                3535,
                3628
            ],
            [
                3628,
                3650
            ],
            [
                3656,
                3670
            ],
            [
                3670,
                3672
            ],
            [
                3678,
                3741
            ],
            [
                3743,
                3779
            ],
            [
                3782,
                3806
            ],
            [
                3806,
                3863
            ],
            [
                3864,
                3867
            ],
            [
                3867,
                3870
            ],
            [
                3870,
                3880
            ],
            [
                3881,
                3919
            ],
            [
                3920,
                4011
            ],
            [
                4012,
                4041
            ],
            [
                4041,
                4044
            ],
            [
                4044,
                4045
            ],
            [
                4045,
                4049
            ],
            [
                4050,
                4068
            ],
            [
                4068,
                4082
            ],
            [
                4082,
                4105
            ],
            [
                4105,
                4110
            ],
            [
                4111,
                4148
            ],
            [
                4149,
                4161
            ],
            [
                4161,
                4202
            ],
            [
                4202,
                4234
            ],
            [
                4235,
                4316
            ],
            [
                4316,
                4397
            ],
            [
                4397,
                4484
            ],
            [
                4484,
                4518
            ],
            [
                4518,
                4550
            ],
            [
                4551,
                4577
            ],
            [
                4612,
                4621
            ],
            [
                4621,
                4651
            ],
            [
                4668,
                4694
            ],
            [
                4695,
                4728
            ],
            [
                4728,
                4730
            ],
            [
                4730,
                5025
            ],
            [
                5032,
                5053
            ],
            [
                5053,
                5055
            ],
            [
                5055,
                5097
            ],
            [
                5097,
                5149
            ],
            [
                5150,
                5183
            ],
            [
                5183,
                5251
            ],
            [
                5251,
                5291
            ],
            [
                5292,
                5352
            ],
            [
                5353,
                5381
            ],
            [
                5381,
                5430
            ],
            [
                5430,
                5530
            ],
            [
                5531,
                5539
            ],
            [
                5539,
                5540
            ],
            [
                5541,
                5570
            ],
            [
                5571,
                5594
            ],
            [
                5595,
                5689
            ],
            [
                5689,
                5733
            ],
            [
                5733,
                5734
            ],
            [
                5735,
                5747
            ],
            [
                5748,
                5750
            ],
            [
                5751,
                5765
            ],
            [
                5765,
                5799
            ],
            [
                5803,
                5815
            ],
            [
                5816,
                5823
            ],
            [
                5823,
                5834
            ],
            [
                5834,
                5898
            ],
            [
                5898,
                5939
            ],
            [
                5940,
                5967
            ],
            [
                5967,
                6001
            ],
            [
                6002,
                6005
            ],
            [
                6006,
                6011
            ],
            [
                6011,
                6047
            ],
            [
                6052,
                6053
            ],
            [
                6057,
                6084
            ],
            [
                6084,
                6165
            ],
            [
                6166,
                6169
            ],
            [
                6170,
                6218
            ],
            [
                6218,
                6237
            ],
            [
                6237,
                6276
            ],
            [
                6276,
                6318
            ],
            [
                6318,
                6361
            ],
            [
                6361,
                6377
            ],
            [
                6378,
                6406
            ],
            [
                6411,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                6520
            ],
            [
                6521,
                6524
            ],
            [
                6526,
                6660
            ],
            [
                6660,
                6662
            ],
            [
                6662,
                6672
            ],
            [
                6673,
                6678
            ],
            [
                6679,
                6734
            ],
            [
                6734,
                6787
            ],
            [
                6787,
                6828
            ],
            [
                6828,
                6865
            ],
            [
                6865,
                6889
            ],
            [
                6896,
                7035
            ],
            [
                7035,
                7075
            ],
            [
                7075,
                7102
            ],
            [
                7102,
                7152
            ],
            [
                7152,
                7239
            ],
            [
                7239,
                7241
            ],
            [
                7241,
                7301
            ],
            [
                7302,
                7303
            ],
            [
                7304,
                7307
            ],
            [
                7308,
                7312
            ],
            [
                7313,
                7352
            ],
            [
                7352,
                7355
            ],
            [
                7355,
                7360
            ],
            [
                7360,
                7413
            ],
            [
                7413,
                7449
            ],
            [
                7449,
                7496
            ],
            [
                7497,
                7508
            ],
            [
                7509,
                7531
            ],
            [
                7531,
                7570
            ],
            [
                7571,
                7582
            ],
            [
                7582,
                7614
            ],
            [
                7614,
                7632
            ],
            [
                7632,
                7652
            ],
            [
                7652,
                7673
            ],
            [
                7676,
                7841
            ],
            [
                7841,
                7844
            ],
            [
                7845,
                7888
            ],
            [
                7889,
                7906
            ],
            [
                7914,
                7973
            ],
            [
                7973,
                8139
            ],
            [
                8139,
                8194
            ],
            [
                8194,
                8246
            ],
            [
                8246,
                8301
            ],
            [
                8301,
                8395
            ],
            [
                8396,
                8402
            ],
            [
                8411,
                8413
            ],
            [
                8413,
                8423
            ],
            [
                8424,
                8449
            ],
            [
                8449,
                8478
            ],
            [
                8478,
                8534
            ],
            [
                8534,
                8566
            ],
            [
                8566,
                8673
            ],
            [
                8673,
                8731
            ],
            [
                8731,
                8733
            ],
            [
                8733,
                8736
            ],
            [
                8737,
                8745
            ],
            [
                8752,
                8781
            ],
            [
                8781,
                8802
            ],
            [
                8803,
                8839
            ],
            [
                8839,
                9016
            ],
            [
                9016,
                9018
            ],
            [
                9018,
                9045
            ],
            [
                9046,
                9145
            ],
            [
                9145,
                9180
            ],
            [
                9180,
                9230
            ],
            [
                9230,
                9330
            ],
            [
                9330,
                9353
            ],
            [
                9354,
                9399
            ],
            [
                9399,
                9402
            ],
            [
                9402,
                9457
            ],
            [
                9457,
                9471
            ],
            [
                9471,
                9506
            ],
            [
                9507,
                9530
            ],
            [
                9530,
                9603
            ],
            [
                9603,
                9660
            ],
            [
                9660,
                9662
            ],
            [
                9662,
                9731
            ],
            [
                9740,
                9745
            ],
            [
                9745,
                9808
            ]
        ],
        "row_chars": [
            [
                0,
                76
            ],
            [
                76,
                155
            ],
            [
                155,
                417
            ],
            [
                417,
                484
            ],
            [
                484,
                566
            ],
            [
                566,
                566
            ],
            [
                566,
                598
            ],
            [
                598,
                700
            ],
            [
                700,
                783
            ],
            [
                783,
                838
            ],
            [
                838,
                928
            ],
            [
                928,
                928
            ],
            [
                928,
                994
            ],
            [
                994,
                1002
            ],
            [
                1002,
                1061
            ],
            [
                1061,
                1080
            ],
            [
                1080,
                1219
            ],
            [
                1219,
                1255
            ],
            [
                1255,
                1319
            ],
            [
                1319,
                1341
            ],
            [
                1341,
                1383
            ],
            [
                1383,
                1430
            ],
            [
                1430,
                1430
            ],
            [
                1430,
                1471
            ],
            [
                1471,
                1744
            ],
            [
                1744,
                1791
            ],
            [
                1791,
                1857
            ],
            [
                1857,
                1933
            ],
            [
                1933,
                1975
            ],
            [
                1975,
                2017
            ],
            [
                2017,
                2286
            ],
            [
                2286,
                2333
            ],
            [
                2333,
                2368
            ],
            [
                2368,
                2543
            ],
            [
                2543,
                2776
            ],
            [
                2776,
                2838
            ],
            [
                2838,
                2886
            ],
            [
                2886,
                2940
            ],
            [
                2940,
                3001
            ],
            [
                3001,
                3035
            ],
            [
                3035,
                3068
            ],
            [
                3068,
                3281
            ],
            [
                3281,
                3355
            ],
            [
                3355,
                3472
            ],
            [
                3472,
                3628
            ],
            [
                3628,
                3670
            ],
            [
                3670,
                3782
            ],
            [
                3782,
                3782
            ],
            [
                3782,
                3870
            ],
            [
                3870,
                4044
            ],
            [
                4044,
                4082
            ],
            [
                4082,
                4105
            ],
            [
                4105,
                4202
            ],
            [
                4202,
                4316
            ],
            [
                4316,
                4316
            ],
            [
                4316,
                4397
            ],
            [
                4397,
                4397
            ],
            [
                4397,
                4397
            ],
            [
                4397,
                4484
            ],
            [
                4484,
                4518
            ],
            [
                4518,
                4621
            ],
            [
                4621,
                4621
            ],
            [
                4621,
                4621
            ],
            [
                4621,
                4730
            ],
            [
                4730,
                5055
            ],
            [
                5055,
                5055
            ],
            [
                5055,
                5150
            ],
            [
                5150,
                5183
            ],
            [
                5183,
                5251
            ],
            [
                5251,
                5381
            ],
            [
                5381,
                5430
            ],
            [
                5430,
                5430
            ],
            [
                5430,
                5689
            ],
            [
                5689,
                5765
            ],
            [
                5765,
                5834
            ],
            [
                5834,
                5898
            ],
            [
                5898,
                5898
            ],
            [
                5898,
                5898
            ],
            [
                5898,
                6084
            ],
            [
                6084,
                6084
            ],
            [
                6084,
                6218
            ],
            [
                6218,
                6218
            ],
            [
                6218,
                6237
            ],
            [
                6237,
                6276
            ],
            [
                6276,
                6318
            ],
            [
                6318,
                6361
            ],
            [
                6361,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                6526
            ],
            [
                6526,
                6662
            ],
            [
                6662,
                6734
            ],
            [
                6734,
                6787
            ],
            [
                6787,
                6828
            ],
            [
                6828,
                6865
            ],
            [
                6865,
                7035
            ],
            [
                7035,
                7035
            ],
            [
                7035,
                7075
            ],
            [
                7075,
                7102
            ],
            [
                7102,
                7102
            ],
            [
                7102,
                7152
            ],
            [
                7152,
                7241
            ],
            [
                7241,
                7355
            ],
            [
                7355,
                7360
            ],
            [
                7360,
                7360
            ],
            [
                7360,
                7413
            ],
            [
                7413,
                7449
            ],
            [
                7449,
                7531
            ],
            [
                7531,
                7582
            ],
            [
                7582,
                7614
            ],
            [
                7614,
                7632
            ],
            [
                7632,
                7652
            ],
            [
                7652,
                7676
            ],
            [
                7676,
                7676
            ],
            [
                7676,
                7841
            ],
            [
                7841,
                7973
            ],
            [
                7973,
                7973
            ],
            [
                7973,
                8139
            ],
            [
                8139,
                8194
            ],
            [
                8194,
                8246
            ],
            [
                8246,
                8246
            ],
            [
                8246,
                8301
            ],
            [
                8301,
                8413
            ],
            [
                8413,
                8449
            ],
            [
                8449,
                8478
            ],
            [
                8478,
                8534
            ],
            [
                8534,
                8566
            ],
            [
                8566,
                8673
            ],
            [
                8673,
                8733
            ],
            [
                8733,
                8781
            ],
            [
                8781,
                8839
            ],
            [
                8839,
                9018
            ],
            [
                9018,
                9145
            ],
            [
                9145,
                9145
            ],
            [
                9145,
                9180
            ],
            [
                9180,
                9230
            ],
            [
                9230,
                9230
            ],
            [
                9230,
                9230
            ],
            [
                9230,
                9230
            ],
            [
                9230,
                9330
            ],
            [
                9330,
                9330
            ],
            [
                9330,
                9402
            ],
            [
                9402,
                9457
            ],
            [
                9457,
                9471
            ],
            [
                9471,
                9506
            ],
            [
                9506,
                9506
            ],
            [
                9506,
                9603
            ],
            [
                9603,
                9662
            ],
            [
                9662,
                9808
            ]
        ]
    }
}