{
    "original": {
        "text": "Tom Bertram had of late spent so little of his time at home that he could be only nominally missed; and Lady Bertram was soon astonished to find how very well they did even without his father, how well Edmund could supply his place in carving, talking to the steward, writing to the attorney, settling with the servants, and equally saving her from all possible fatigue or exertion in every particular but that of directing her letters.\nThe earliest intelligence of the travellers' safe arrival at Antigua, after a favourable voyage, was received; though not before Mrs. Norris had been indulging in very dreadful fears, and trying to make Edmund participate them whenever she could get him alone; and as she depended on being the first person made acquainted with any fatal catastrophe, she had already arranged the manner of breaking it to all the others, when Sir Thomas's assurances of their both being alive and well made it necessary to lay by her agitation and affectionate preparatory speeches for a while.\nThe winter came and passed without their being called for; the accounts continued perfectly good; and Mrs. Norris, in promoting gaieties for her nieces, assisting their toilets, displaying their accomplishments, and looking about for their future husbands, had so much to do as, in addition to all her own household cares, some interference in those of her sister, and Mrs. Grant's wasteful doings to overlook, left her very little occasion to be occupied in fears for the absent.\nThe Miss Bertrams were now fully established among the belles of the neighbourhood; and as they joined to beauty and brilliant acquirements a manner naturally easy, and carefully formed to general civility and obligingness, they possessed its favour as well as its admiration. Their vanity was in such good order that they seemed to be quite free from it, and gave themselves no airs; while the praises attending such behaviour, secured and brought round by their aunt, served to strengthen them in believing they had no faults.\nLady Bertram did not go into public with her daughters. She was too indolent even to accept a mother's gratification in witnessing their success and enjoyment at the expense of any personal trouble, and the charge was made over to her sister, who desired nothing better than a post of such honourable representation, and very thoroughly relished the means it afforded her of mixing in society without having horses to hire.\nFanny had no share in the festivities of the season; but she enjoyed being avowedly useful as her aunt's companion when they called away the rest of the family; and, as Miss Lee had left Mansfield, she naturally became everything to Lady Bertram during the night of a ball or a party. She talked to her, listened to her, read to her; and the tranquillity of such evenings, her perfect security in such a _tte--tte_ from any sound of unkindness, was unspeakably welcome to a mind which had seldom known a pause in its alarms or embarrassments. As to her cousins' gaieties, she loved to hear an account of them, especially of the balls, and whom Edmund had danced with; but thought too lowly of her own situation to imagine she should ever be admitted to the same, and listened, therefore, without an idea of any nearer concern in them. Upon the whole, it was a comfortable winter to her; for though it brought no William to England, the never-failing hope of his arrival was worth much.\nThe ensuing spring deprived her of her valued friend, the old grey pony; and for some time she was in danger of feeling the loss in her health as well as in her affections; for in spite of the acknowledged importance of her riding on horse-back, no measures were taken for mounting her again, \"because,\" as it was observed by her aunts, \"she might ride one of her cousin's horses at any time when they did not want them,\" and as the Miss Bertrams regularly wanted their horses every fine day, and had no idea of carrying their obliging manners to the sacrifice of any real pleasure, that time, of course, never came. They took their cheerful rides in the fine mornings of April and May; and Fanny either sat at home the whole day with one aunt, or walked beyond her strength at the instigation of the other: Lady Bertram holding exercise to be as unnecessary for everybody as it was unpleasant to herself; and Mrs. Norris, who was walking all day, thinking everybody ought to walk as much. Edmund was absent at this time, or the evil would have been earlier remedied. When he returned, to understand how Fanny was situated, and perceived its ill effects, there seemed with him but one thing to be done; and that \"Fanny must have a horse\" was the resolute declaration with which he opposed whatever could be urged by the supineness of his mother, or the economy of his aunt, to make it appear unimportant. Mrs. Norris could not help thinking that some steady old thing might be found among the numbers belonging to the Park that would do vastly well; or that one might be borrowed of the steward; or that perhaps Dr. Grant might now and then lend them the pony he sent to the post. She could not but consider it as absolutely unnecessary, and even improper, that Fanny should have a regular lady's horse of her own, in the style of her cousins. She was sure Sir Thomas had never intended it: and she must say that, to be making such a purchase in his absence, and adding to the great expenses of his stable, at a time when a large part of his income was unsettled, seemed to her very unjustifiable. \"Fanny must have a horse,\" was Edmund's only reply. Mrs. Norris could not see it in the same light. Lady Bertram did: she entirely agreed with her son as to the necessity of it, and as to its being considered necessary by his father; she only pleaded against there being any hurry; she only wanted him to wait till Sir Thomas's return, and then Sir Thomas might settle it all himself. He would be at home in September, and where would be the harm of only waiting till September?\nThough Edmund was much more displeased with his aunt than with his mother, as evincing least regard for her niece, he could not help paying more attention to what she said; and at length determined on a method of proceeding which would obviate the risk of his father's thinking he had done too much, and at the same time procure for Fanny the immediate means of exercise, which he could not bear she should be without. He had three horses of his own, but not one that would carry a woman. Two of them were hunters; the third, a useful road-horse: this third he resolved to exchange for one that his cousin might ride; he knew where such a one was to be met with; and having once made up his mind, the whole business was soon completed. The new mare proved a treasure; with a very little trouble she became exactly calculated for the purpose, and Fanny was then put in almost full possession of her. She had not supposed before that anything could ever suit her like the old grey pony; but her delight in Edmund's mare was far beyond any former pleasure of the sort; and the addition it was ever receiving in the consideration of that kindness from which her pleasure sprung, was beyond all her words to express. She regarded her cousin as an example of everything good and great, as possessing worth which no one but herself could ever appreciate, and as entitled to such gratitude from her as no feelings could be strong enough to pay. Her sentiments towards him were compounded of all that was respectful, grateful, confiding, and tender.\nAs the horse continued in name, as well as fact, the property of Edmund, Mrs. Norris could tolerate its being for Fanny's use; and had Lady Bertram ever thought about her own objection again, he might have been excused in her eyes for not waiting till Sir Thomas's return in September, for when September came Sir Thomas was still abroad, and without any near prospect of finishing his business. Unfavourable circumstances had suddenly arisen at a moment when he was beginning to turn all his thoughts towards England; and the very great uncertainty in which everything was then involved determined him on sending home his son, and waiting the final arrangement by himself. Tom arrived safely, bringing an excellent account of his father's health; but to very little purpose, as far as Mrs. Norris was concerned. Sir Thomas's sending away his son seemed to her so like a parent's care, under the influence of a foreboding of evil to himself, that she could not help feeling dreadful presentiments; and as the long evenings of autumn came on, was so terribly haunted by these ideas, in the sad solitariness of her cottage, as to be obliged to take daily refuge in the dining-room of the Park. The return of winter engagements, however, was not without its effect; and in the course of their progress, her mind became so pleasantly occupied in superintending the fortunes of her eldest niece, as tolerably to quiet her nerves. \"If poor Sir Thomas were fated never to return, it would be peculiarly consoling to see their dear Maria well married,\" she very often thought; always when they were in the company of men of fortune, and particularly on the introduction of a young man who had recently succeeded to one of the largest estates and finest places in the country.\nMr. Rushworth was from the first struck with the beauty of Miss Bertram, and, being inclined to marry, soon fancied himself in love. He was a heavy young man, with not more than common sense; but as there was nothing disagreeable in his figure or address, the young lady was well pleased with her conquest. Being now in her twenty-first year, Maria Bertram was beginning to think matrimony a duty; and as a marriage with Mr. Rushworth would give her the enjoyment of a larger income than her father's, as well as ensure her the house in town, which was now a prime object, it became, by the same rule of moral obligation, her evident duty to marry Mr. Rushworth if she could. Mrs. Norris was most zealous in promoting the match, by every suggestion and contrivance likely to enhance its desirableness to either party; and, among other means, by seeking an intimacy with the gentleman's mother, who at present lived with him, and to whom she even forced Lady Bertram to go through ten miles of indifferent road to pay a morning visit. It was not long before a good understanding took place between this lady and herself. Mrs. Rushworth acknowledged herself very desirous that her son should marry, and declared that of all the young ladies she had ever seen, Miss Bertram seemed, by her amiable qualities and accomplishments, the best adapted to make him happy. Mrs. Norris accepted the compliment, and admired the nice discernment of character which could so well distinguish merit. Maria was indeed the pride and delight of them all-perfectly faultless-an angel; and, of course, so surrounded by admirers, must be difficult in her choice: but yet, as far as Mrs. Norris could allow herself to decide on so short an acquaintance, Mr. Rushworth appeared precisely the young man to deserve and attach her.\nAfter dancing with each other at a proper number of balls, the young people justified these opinions, and an engagement, with a due reference to the absent Sir Thomas, was entered into, much to the satisfaction of their respective families, and of the general lookers-on of the neighbourhood, who had, for many weeks past, felt the expediency of Mr. Rushworth's marrying Miss Bertram.\nIt was some months before Sir Thomas's consent could be received; but, in the meanwhile, as no one felt a doubt of his most cordial pleasure in the connexion, the intercourse of the two families was carried on without restraint, and no other attempt made at secrecy than Mrs. Norris's talking of it everywhere as a matter not to be talked of at present.\nEdmund was the only one of the family who could see a fault in the business; but no representation of his aunt's could induce him to find Mr. Rushworth a desirable companion. He could allow his sister to be the best judge of her own happiness, but he was not pleased that her happiness should centre in a large income; nor could he refrain from often saying to himself, in Mr. Rushworth's company-\"If this man had not twelve thousand a year, he would be a very stupid fellow.\"\nSir Thomas, however, was truly happy in the prospect of an alliance so unquestionably advantageous, and of which he heard nothing but the perfectly good and agreeable. It was a connexion exactly of the right sort-in the same county, and the same interest-and his most hearty concurrence was conveyed as soon as possible. He only conditioned that the marriage should not take place before his return, which he was again looking eagerly forward to. He wrote in April, and had strong hopes of settling everything to his entire satisfaction, and leaving Antigua before the end of the summer.\nSuch was the state of affairs in the month of July; and Fanny had just reached her eighteenth year, when the society of the village received an addition in the brother and sister of Mrs. Grant, a Mr. and Miss Crawford, the children of her mother by a second marriage. They were young people of fortune. The son had a good estate in Norfolk, the daughter twenty thousand pounds. As children, their sister had been always very fond of them; but, as her own marriage had been soon followed by the death of their common parent, which left them to the care of a brother of their father, of whom Mrs. Grant knew nothing, she had scarcely seen them since. In their uncle's house they had found a kind home. Admiral and Mrs. Crawford, though agreeing in nothing else, were united in affection for these children, or, at least, were no farther adverse in their feelings than that each had their favourite, to whom they showed the greatest fondness of the two. The Admiral delighted in the boy, Mrs. Crawford doted on the girl; and it was the lady's death which now obliged her _protegee_, after some months' further trial at her uncle's house, to find another home. Admiral Crawford was a man of vicious conduct, who chose, instead of retaining his niece, to bring his mistress under his own roof; and to this Mrs. Grant was indebted for her sister's proposal of coming to her, a measure quite as welcome on one side as it could be expedient on the other; for Mrs. Grant, having by this time run through the usual resources of ladies residing in the country without a family of children-having more than filled her favourite sitting-room with pretty furniture, and made a choice collection of plants and poultry-was very much in want of some variety at home. The arrival, therefore, of a sister whom she had always loved, and now hoped to retain with her as long as she remained single, was highly agreeable; and her chief anxiety was lest Mansfield should not satisfy the habits of a young woman who had been mostly used to London.\nMiss Crawford was not entirely free from similar apprehensions, though they arose principally from doubts of her sister's style of living and tone of society; and it was not till after she had tried in vain to persuade her brother to settle with her at his own country house, that she could resolve to hazard herself among her other relations. To anything like a permanence of abode, or limitation of society, Henry Crawford had, unluckily, a great dislike: he could not accommodate his sister in an article of such importance; but he escorted her, with the utmost kindness, into Northamptonshire, and as readily engaged to fetch her away again, at half an hour's notice, whenever she were weary of the place.\nThe meeting was very satisfactory on each side. Miss Crawford found a sister without preciseness or rusticity, a sister's husband who looked the gentleman, and a house commodious and well fitted up; and Mrs. Grant received in those whom she hoped to love better than ever a young man and woman of very prepossessing appearance. Mary Crawford was remarkably pretty; Henry, though not handsome, had air and countenance; the manners of both were lively and pleasant, and Mrs. Grant immediately gave them credit for everything else. She was delighted with each, but Mary was her dearest object; and having never been able to glory in beauty of her own, she thoroughly enjoyed the power of being proud of her sister's. She had not waited her arrival to look out for a suitable match for her: she had fixed on Tom Bertram; the eldest son of a baronet was not too good for a girl of twenty thousand pounds, with all the elegance and accomplishments which Mrs. Grant foresaw in her; and being a warm-hearted, unreserved woman, Mary had not been three hours in the house before she told her what she had planned.\nMiss Crawford was glad to find a family of such consequence so very near them, and not at all displeased either at her sister's early care, or the choice it had fallen on. Matrimony was her object, provided she could marry well: and having seen Mr. Bertram in town, she knew that objection could no more be made to his person than to his situation in life. While she treated it as a joke, therefore, she did not forget to think of it seriously. The scheme was soon repeated to Henry.\n\"And now,\" added Mrs. Grant, \"I have thought of something to make it complete. I should dearly love to settle you both in this country; and therefore, Henry, you shall marry the youngest Miss Bertram, a nice, handsome, good-humoured, accomplished girl, who will make you very happy.\"\nHenry bowed and thanked her.\n\"My dear sister,\" said Mary, \"if you can persuade him into anything of the sort, it will be a fresh matter of delight to me to find myself allied to anybody so clever, and I shall only regret that you have not half a dozen daughters to dispose of. If you can persuade Henry to marry, you must have the address of a Frenchwoman. All that English abilities can do has been tried already. I have three very particular friends who have been all dying for him in their turn; and the pains which they, their mothers (very clever women), as well as my dear aunt and myself, have taken to reason, coax, or trick him into marrying, is inconceivable! He is the most horrible flirt that can be imagined. If your Miss Bertrams do not like to have their hearts broke, let them avoid Henry.\"\n\"My dear brother, I will not believe this of you.\"\n\"No, I am sure you are too good. You will be kinder than Mary. You will allow for the doubts of youth and inexperience. I am of a cautious temper, and unwilling to risk my happiness in a hurry. Nobody can think more highly of the matrimonial state than myself. I consider the blessing of a wife as most justly described in those discreet lines of the poet-'Heaven's _last_ best gift.'\"\n\"There, Mrs. Grant, you see how he dwells on one word, and only look at his smile. I assure you he is very detestable; the Admiral's lessons have quite spoiled him.\"\n\"I pay very little regard,\" said Mrs. Grant, \"to what any young person says on the subject of marriage. If they profess a disinclination for it, I only set it down that they have not yet seen the right person.\"\nDr. Grant laughingly congratulated Miss Crawford on feeling no disinclination to the state herself.\n\"Oh yes! I am not at all ashamed of it. I would have everybody marry if they can do it properly: I do not like to have people throw themselves away; but everybody should marry as soon as they can do it to advantage.\"",
        "paragraph_chars": [
            [
                0,
                437
            ],
            [
                437,
                1015
            ],
            [
                1015,
                1496
            ],
            [
                1496,
                2025
            ],
            [
                2025,
                2449
            ],
            [
                2449,
                3435
            ],
            [
                3435,
                6012
            ],
            [
                6012,
                7553
            ],
            [
                7553,
                9321
            ],
            [
                9321,
                11125
            ],
            [
                11125,
                11510
            ],
            [
                11510,
                11864
            ],
            [
                11864,
                12341
            ],
            [
                12341,
                12929
            ],
            [
                12929,
                14953
            ],
            [
                14953,
                15663
            ],
            [
                15663,
                16767
            ],
            [
                16767,
                17251
            ],
            [
                17251,
                17535
            ],
            [
                17535,
                17564
            ],
            [
                17564,
                18342
            ],
            [
                18342,
                18393
            ],
            [
                18393,
                18779
            ],
            [
                18779,
                18945
            ],
            [
                18945,
                19156
            ],
            [
                19156,
                19256
            ],
            [
                19256,
                19472
            ]
        ],
        "segment_chars": [
            [
                0,
                437
            ],
            [
                437,
                1015
            ],
            [
                1015,
                1496
            ],
            [
                1496,
                1773
            ],
            [
                1773,
                2025
            ],
            [
                2025,
                2081
            ],
            [
                2081,
                2449
            ],
            [
                2449,
                2734
            ],
            [
                2734,
                2992
            ],
            [
                2992,
                3284
            ],
            [
                3284,
                3435
            ],
            [
                3435,
                4052
            ],
            [
                4052,
                4425
            ],
            [
                4425,
                4503
            ],
            [
                4503,
                4840
            ],
            [
                4840,
                5116
            ],
            [
                5116,
                5279
            ],
            [
                5279,
                5533
            ],
            [
                5533,
                5585
            ],
            [
                5585,
                5633
            ],
            [
                5633,
                5918
            ],
            [
                5918,
                6012
            ],
            [
                6012,
                6431
            ],
            [
                6431,
                6501
            ],
            [
                6501,
                6748
            ],
            [
                6748,
                6911
            ],
            [
                6911,
                7224
            ],
            [
                7224,
                7449
            ],
            [
                7449,
                7553
            ],
            [
                7553,
                7949
            ],
            [
                7949,
                8227
            ],
            [
                8227,
                8366
            ],
            [
                8366,
                8745
            ],
            [
                8745,
                8978
            ],
            [
                8978,
                9321
            ],
            [
                9321,
                9454
            ],
            [
                9454,
                9628
            ],
            [
                9628,
                9997
            ],
            [
                9997,
                10355
            ],
            [
                10355,
                10441
            ],
            [
                10441,
                10682
            ],
            [
                10682,
                10804
            ],
            [
                10804,
                11125
            ],
            [
                11125,
                11510
            ],
            [
                11510,
                11864
            ],
            [
                11864,
                12039
            ],
            [
                12039,
                12341
            ],
            [
                12341,
                12509
            ],
            [
                12509,
                12662
            ],
            [
                12662,
                12788
            ],
            [
                12788,
                12929
            ],
            [
                12929,
                13197
            ],
            [
                13197,
                13232
            ],
            [
                13232,
                13307
            ],
            [
                13307,
                13578
            ],
            [
                13578,
                13629
            ],
            [
                13629,
                13880
            ],
            [
                13880,
                14086
            ],
            [
                14086,
                14679
            ],
            [
                14679,
                14953
            ],
            [
                14953,
                15297
            ],
            [
                15297,
                15663
            ],
            [
                15663,
                15711
            ],
            [
                15711,
                15991
            ],
            [
                15991,
                16192
            ],
            [
                16192,
                16377
            ],
            [
                16377,
                16767
            ],
            [
                16767,
                16939
            ],
            [
                16939,
                17124
            ],
            [
                17124,
                17212
            ],
            [
                17212,
                17251
            ],
            [
                17251,
                17330
            ],
            [
                17330,
                17535
            ],
            [
                17535,
                17564
            ],
            [
                17564,
                17812
            ],
            [
                17812,
                17892
            ],
            [
                17892,
                17950
            ],
            [
                17950,
                18205
            ],
            [
                18205,
                18257
            ],
            [
                18257,
                18342
            ],
            [
                18342,
                18393
            ],
            [
                18393,
                18426
            ],
            [
                18426,
                18456
            ],
            [
                18456,
                18513
            ],
            [
                18513,
                18587
            ],
            [
                18587,
                18654
            ],
            [
                18654,
                18779
            ],
            [
                18779,
                18862
            ],
            [
                18862,
                18945
            ],
            [
                18945,
                19049
            ],
            [
                19049,
                19156
            ],
            [
                19156,
                19256
            ],
            [
                19256,
                19265
            ],
            [
                19265,
                19296
            ],
            [
                19296,
                19472
            ]
        ],
        "overlap_chars": [
            [
                109,
                148
            ],
            [
                154,
                167
            ],
            [
                173,
                180
            ],
            [
                191,
                243
            ],
            [
                293,
                324
            ],
            [
                333,
                361
            ],
            [
                373,
                381
            ],
            [
                435,
                437
            ],
            [
                463,
                505
            ],
            [
                534,
                619
            ],
            [
                696,
                743
            ],
            [
                632,
                634
            ],
            [
                765,
                768
            ],
            [
                775,
                895
            ],
            [
                901,
                949
            ],
            [
                981,
                1015
            ],
            [
                1015,
                1025
            ],
            [
                1035,
                1167
            ],
            [
                1193,
                1275
            ],
            [
                1435,
                1446
            ],
            [
                1284,
                1286
            ],
            [
                1480,
                1496
            ],
            [
                1496,
                1550
            ],
            [
                1565,
                1578
            ],
            [
                1551,
                1557
            ],
            [
                1578,
                1659
            ],
            [
                1661,
                1664
            ],
            [
                1718,
                1724
            ],
            [
                1739,
                1756
            ],
            [
                1761,
                1773
            ],
            [
                1773,
                1898
            ],
            [
                1925,
                1964
            ],
            [
                1987,
                2025
            ],
            [
                2025,
                2037
            ],
            [
                2085,
                2101
            ],
            [
                2107,
                2109
            ],
            [
                2046,
                2080
            ],
            [
                2228,
                2271
            ],
            [
                2351,
                2449
            ],
            [
                2449,
                2474
            ],
            [
                2494,
                2500
            ],
            [
                2475,
                2486
            ],
            [
                2500,
                2523
            ],
            [
                2533,
                2563
            ],
            [
                2608,
                2716
            ],
            [
                2727,
                2734
            ],
            [
                2734,
                2820
            ],
            [
                2894,
                2920
            ],
            [
                2822,
                2825
            ],
            [
                2923,
                2927
            ],
            [
                2990,
                2992
            ],
            [
                2992,
                3120
            ],
            [
                3171,
                3210
            ],
            [
                3282,
                3284
            ],
            [
                3300,
                3435
            ],
            [
                3435,
                3438
            ],
            [
                3447,
                3473
            ],
            [
                3481,
                3511
            ],
            [
                3526,
                3611
            ],
            [
                3624,
                3665
            ],
            [
                3679,
                3741
            ],
            [
                3761,
                3770
            ],
            [
                3749,
                3757
            ],
            [
                3770,
                3787
            ],
            [
                3795,
                3798
            ],
            [
                3808,
                3854
            ],
            [
                3861,
                3881
            ],
            [
                3892,
                3946
            ],
            [
                3999,
                4027
            ],
            [
                4040,
                4052
            ],
            [
                4052,
                4150
            ],
            [
                4161,
                4278
            ],
            [
                4282,
                4293
            ],
            [
                4339,
                4356
            ],
            [
                4383,
                4415
            ],
            [
                4374,
                4382
            ],
            [
                4279,
                4281
            ],
            [
                4423,
                4424
            ],
            [
                4425,
                4442
            ],
            [
                4636,
                4637
            ],
            [
                4612,
                4615
            ],
            [
                4503,
                4519
            ],
            [
                4559,
                4562
            ],
            [
                4535,
                4548
            ],
            [
                4455,
                4456
            ],
            [
                4647,
                4676
            ],
            [
                4769,
                4772
            ],
            [
                4681,
                4701
            ],
            [
                4838,
                4840
            ],
            [
                4840,
                4851
            ],
            [
                4881,
                4917
            ],
            [
                4949,
                4971
            ],
            [
                5114,
                5116
            ],
            [
                5116,
                5119
            ],
            [
                5143,
                5148
            ],
            [
                5160,
                5216
            ],
            [
                5225,
                5279
            ],
            [
                5279,
                5329
            ],
            [
                5349,
                5354
            ],
            [
                5398,
                5456
            ],
            [
                5473,
                5512
            ],
            [
                5518,
                5532
            ],
            [
                5533,
                5585
            ],
            [
                5585,
                5633
            ],
            [
                5633,
                5645
            ],
            [
                5664,
                5683
            ],
            [
                5813,
                5904
            ],
            [
                5909,
                5918
            ],
            [
                5918,
                5982
            ],
            [
                5988,
                6000
            ],
            [
                6010,
                6012
            ],
            [
                6019,
                6025
            ],
            [
                6199,
                6247
            ],
            [
                6136,
                6139
            ],
            [
                6302,
                6310
            ],
            [
                6429,
                6431
            ],
            [
                6431,
                6501
            ],
            [
                6501,
                6572
            ],
            [
                6594,
                6628
            ],
            [
                6709,
                6748
            ],
            [
                6748,
                6779
            ],
            [
                6854,
                6867
            ],
            [
                6873,
                6879
            ],
            [
                6892,
                6911
            ],
            [
                6911,
                6931
            ],
            [
                6939,
                6958
            ],
            [
                6964,
                7044
            ],
            [
                7166,
                7169
            ],
            [
                7049,
                7064
            ],
            [
                7076,
                7081
            ],
            [
                7202,
                7205
            ],
            [
                7065,
                7067
            ],
            [
                7146,
                7154
            ],
            [
                7187,
                7197
            ],
            [
                7206,
                7211
            ],
            [
                7222,
                7224
            ],
            [
                7224,
                7291
            ],
            [
                7367,
                7378
            ],
            [
                7384,
                7393
            ],
            [
                7337,
                7347
            ],
            [
                7444,
                7447
            ],
            [
                7447,
                7449
            ],
            [
                7449,
                7452
            ],
            [
                7464,
                7480
            ],
            [
                7495,
                7553
            ],
            [
                7553,
                7575
            ],
            [
                7618,
                7624
            ],
            [
                7606,
                7614
            ],
            [
                7624,
                7719
            ],
            [
                7602,
                7605
            ],
            [
                7583,
                7584
            ],
            [
                7748,
                7758
            ],
            [
                7764,
                7771
            ],
            [
                7784,
                7824
            ],
            [
                7837,
                7890
            ],
            [
                7947,
                7948
            ],
            [
                7949,
                7995
            ],
            [
                8070,
                8079
            ],
            [
                8085,
                8102
            ],
            [
                8042,
                8045
            ],
            [
                8141,
                8184
            ],
            [
                8215,
                8227
            ],
            [
                8227,
                8304
            ],
            [
                8339,
                8350
            ],
            [
                8504,
                8566
            ],
            [
                8579,
                8585
            ],
            [
                8567,
                8575
            ],
            [
                8586,
                8744
            ],
            [
                8745,
                8803
            ],
            [
                8808,
                8815
            ],
            [
                8853,
                8868
            ],
            [
                8872,
                8942
            ],
            [
                8976,
                8978
            ],
            [
                8978,
                9002
            ],
            [
                9009,
                9037
            ],
            [
                9049,
                9065
            ],
            [
                9072,
                9101
            ],
            [
                9107,
                9177
            ],
            [
                9182,
                9194
            ],
            [
                9220,
                9286
            ],
            [
                9305,
                9321
            ],
            [
                9321,
                9338
            ],
            [
                9354,
                9454
            ],
            [
                9454,
                9557
            ],
            [
                9568,
                9628
            ],
            [
                9628,
                9700
            ],
            [
                9717,
                9725
            ],
            [
                9728,
                9833
            ],
            [
                9711,
                9712
            ],
            [
                9849,
                9863
            ],
            [
                9894,
                9903
            ],
            [
                9943,
                9996
            ],
            [
                9997,
                10012
            ],
            [
                10018,
                10048
            ],
            [
                10050,
                10058
            ],
            [
                10074,
                10085
            ],
            [
                10244,
                10249
            ],
            [
                10163,
                10213
            ],
            [
                10353,
                10355
            ],
            [
                10355,
                10441
            ],
            [
                10441,
                10455
            ],
            [
                10491,
                10567
            ],
            [
                10573,
                10598
            ],
            [
                10646,
                10682
            ],
            [
                10682,
                10717
            ],
            [
                10802,
                10804
            ],
            [
                10804,
                10900
            ],
            [
                10904,
                10926
            ],
            [
                10959,
                10960
            ],
            [
                10965,
                10968
            ],
            [
                11051,
                11100
            ],
            [
                11113,
                11125
            ],
            [
                11125,
                11200
            ],
            [
                11297,
                11309
            ],
            [
                11231,
                11244
            ],
            [
                11309,
                11344
            ],
            [
                11356,
                11416
            ],
            [
                11508,
                11510
            ],
            [
                11510,
                11579
            ],
            [
                11599,
                11608
            ],
            [
                11625,
                11628
            ],
            [
                11642,
                11650
            ],
            [
                11579,
                11580
            ],
            [
                11688,
                11704
            ],
            [
                11720,
                11742
            ],
            [
                11743,
                11864
            ],
            [
                11864,
                11887
            ],
            [
                11902,
                11940
            ],
            [
                11977,
                11982
            ],
            [
                11997,
                12039
            ],
            [
                12039,
                12041
            ],
            [
                12054,
                12233
            ],
            [
                12234,
                12341
            ],
            [
                12341,
                12411
            ],
            [
                12427,
                12439
            ],
            [
                12507,
                12509
            ],
            [
                12600,
                12603
            ],
            [
                12609,
                12662
            ],
            [
                12662,
                12669
            ],
            [
                12682,
                12739
            ],
            [
                12786,
                12788
            ],
            [
                12788,
                12857
            ],
            [
                12865,
                12929
            ],
            [
                12929,
                12961
            ],
            [
                12975,
                13033
            ],
            [
                13049,
                13196
            ],
            [
                13197,
                13232
            ],
            [
                13232,
                13307
            ],
            [
                13307,
                13309
            ],
            [
                13519,
                13522
            ],
            [
                13524,
                13529
            ],
            [
                13380,
                13452
            ],
            [
                13544,
                13578
            ],
            [
                13578,
                13629
            ],
            [
                13629,
                13732
            ],
            [
                13878,
                13880
            ],
            [
                13880,
                13996
            ],
            [
                14064,
                14086
            ],
            [
                14086,
                14142
            ],
            [
                14176,
                14221
            ],
            [
                14230,
                14240
            ],
            [
                14268,
                14270
            ],
            [
                14262,
                14268
            ],
            [
                14222,
                14224
            ],
            [
                14290,
                14307
            ],
            [
                14317,
                14327
            ],
            [
                14374,
                14390
            ],
            [
                14241,
                14244
            ],
            [
                14646,
                14679
            ],
            [
                14679,
                14707
            ],
            [
                14708,
                14714
            ],
            [
                14807,
                14888
            ],
            [
                14903,
                14920
            ],
            [
                14937,
                14953
            ],
            [
                14953,
                15015
            ],
            [
                15110,
                15237
            ],
            [
                15252,
                15254
            ],
            [
                15276,
                15297
            ],
            [
                15363,
                15381
            ],
            [
                15394,
                15409
            ],
            [
                15327,
                15329
            ],
            [
                15447,
                15449
            ],
            [
                15656,
                15661
            ],
            [
                15479,
                15487
            ],
            [
                15488,
                15496
            ],
            [
                15436,
                15446
            ],
            [
                15528,
                15637
            ],
            [
                15643,
                15651
            ],
            [
                15661,
                15663
            ],
            [
                15663,
                15696
            ],
            [
                15709,
                15711
            ],
            [
                15711,
                15739
            ],
            [
                15772,
                15885
            ],
            [
                15935,
                15991
            ],
            [
                15991,
                16192
            ],
            [
                16192,
                16334
            ],
            [
                16348,
                16377
            ],
            [
                16377,
                16384
            ],
            [
                16416,
                16561
            ],
            [
                16563,
                16567
            ],
            [
                16576,
                16604
            ],
            [
                16636,
                16641
            ],
            [
                16648,
                16767
            ],
            [
                16767,
                16809
            ],
            [
                16815,
                16829
            ],
            [
                16835,
                16871
            ],
            [
                16879,
                16894
            ],
            [
                16914,
                16920
            ],
            [
                16937,
                16939
            ],
            [
                16939,
                17046
            ],
            [
                17063,
                17065
            ],
            [
                17047,
                17062
            ],
            [
                17071,
                17092
            ],
            [
                17122,
                17124
            ],
            [
                17124,
                17154
            ],
            [
                17165,
                17212
            ],
            [
                17212,
                17226
            ],
            [
                17232,
                17251
            ],
            [
                17251,
                17330
            ],
            [
                17330,
                17369
            ],
            [
                17385,
                17483
            ],
            [
                17498,
                17535
            ],
            [
                17535,
                17564
            ],
            [
                17564,
                17644
            ],
            [
                17736,
                17743
            ],
            [
                17653,
                17655
            ],
            [
                17810,
                17812
            ],
            [
                17950,
                17962
            ],
            [
                17979,
                18073
            ],
            [
                18106,
                18205
            ],
            [
                18205,
                18257
            ],
            [
                18257,
                18342
            ],
            [
                18342,
                18383
            ],
            [
                18390,
                18393
            ],
            [
                18393,
                18407
            ],
            [
                18426,
                18456
            ],
            [
                18456,
                18494
            ],
            [
                18511,
                18513
            ],
            [
                18513,
                18517
            ],
            [
                18523,
                18531
            ],
            [
                18538,
                18587
            ],
            [
                18587,
                18618
            ],
            [
                18623,
                18629
            ],
            [
                18641,
                18654
            ],
            [
                18654,
                18712
            ],
            [
                18740,
                18758
            ],
            [
                18760,
                18764
            ],
            [
                18766,
                18779
            ],
            [
                18779,
                18862
            ],
            [
                18862,
                18880
            ],
            [
                18886,
                18945
            ],
            [
                18945,
                19020
            ],
            [
                19039,
                19049
            ],
            [
                19049,
                19091
            ],
            [
                19109,
                19156
            ],
            [
                19156,
                19256
            ],
            [
                19256,
                19265
            ],
            [
                19265,
                19273
            ],
            [
                19281,
                19296
            ],
            [
                19296,
                19342
            ],
            [
                19458,
                19472
            ]
        ],
        "row_chars": [
            [
                0,
                437
            ],
            [
                437,
                1015
            ],
            [
                1015,
                1496
            ],
            [
                1496,
                1773
            ],
            [
                1773,
                2025
            ],
            [
                2025,
                2449
            ],
            [
                2449,
                2734
            ],
            [
                2734,
                2992
            ],
            [
                2992,
                3284
            ],
            [
                3284,
                3435
            ],
            [
                3435,
                4052
            ],
            [
                4052,
                4425
            ],
            [
                4425,
                4840
            ],
            [
                4840,
                5116
            ],
            [
                5116,
                5279
            ],
            [
                5279,
                5533
            ],
            [
                5533,
                5585
            ],
            [
                5585,
                5633
            ],
            [
                5633,
                5918
            ],
            [
                5918,
                6012
            ],
            [
                6012,
                6431
            ],
            [
                6431,
                6501
            ],
            [
                6501,
                6748
            ],
            [
                6748,
                6911
            ],
            [
                6911,
                7224
            ],
            [
                7224,
                7449
            ],
            [
                7449,
                7553
            ],
            [
                7553,
                7949
            ],
            [
                7949,
                8227
            ],
            [
                8227,
                8745
            ],
            [
                8745,
                8978
            ],
            [
                8978,
                9321
            ],
            [
                9321,
                9454
            ],
            [
                9454,
                9628
            ],
            [
                9628,
                9997
            ],
            [
                9997,
                10355
            ],
            [
                10355,
                10441
            ],
            [
                10441,
                10682
            ],
            [
                10682,
                10804
            ],
            [
                10804,
                11125
            ],
            [
                11125,
                11510
            ],
            [
                11510,
                11864
            ],
            [
                11864,
                12039
            ],
            [
                12039,
                12341
            ],
            [
                12341,
                12509
            ],
            [
                12509,
                12662
            ],
            [
                12662,
                12788
            ],
            [
                12788,
                12929
            ],
            [
                12929,
                13197
            ],
            [
                13197,
                13232
            ],
            [
                13232,
                13307
            ],
            [
                13307,
                13578
            ],
            [
                13578,
                13629
            ],
            [
                13629,
                13880
            ],
            [
                13880,
                14086
            ],
            [
                14086,
                14679
            ],
            [
                14679,
                14953
            ],
            [
                14953,
                15297
            ],
            [
                15297,
                15663
            ],
            [
                15663,
                15711
            ],
            [
                15711,
                15991
            ],
            [
                15991,
                16192
            ],
            [
                16192,
                16377
            ],
            [
                16377,
                16767
            ],
            [
                16767,
                16939
            ],
            [
                16939,
                17124
            ],
            [
                17124,
                17212
            ],
            [
                17212,
                17251
            ],
            [
                17251,
                17330
            ],
            [
                17330,
                17535
            ],
            [
                17535,
                17564
            ],
            [
                17564,
                17812
            ],
            [
                17812,
                17892
            ],
            [
                17892,
                17950
            ],
            [
                17950,
                18205
            ],
            [
                18205,
                18257
            ],
            [
                18257,
                18342
            ],
            [
                18342,
                18393
            ],
            [
                18393,
                18456
            ],
            [
                18456,
                18513
            ],
            [
                18513,
                18587
            ],
            [
                18587,
                18654
            ],
            [
                18654,
                18779
            ],
            [
                18779,
                18862
            ],
            [
                18862,
                18945
            ],
            [
                18945,
                19049
            ],
            [
                19049,
                19156
            ],
            [
                19156,
                19256
            ],
            [
                19256,
                19265
            ],
            [
                19265,
                19296
            ],
            [
                19296,
                19472
            ]
        ]
    },
    "abridged": {
        "text": "Lady Bertram was soon astonished to find how well they did without Sir Thomas, how well Edmund could supply his place in carving, settling with the servants, and saving her from all possible exertion.\nNews of the travellers' safe arrival at Antigua was received; though not before Mrs. Norris had been indulging in very dreadful fears; and as she depended on being the first person to learn of any catastrophe, she had already arranged the manner of breaking it to all the others, when Sir Thomas's assurances of their being alive and well made it necessary to lay by preparatory speeches for a while.\nThe winter passed without their being called for; the accounts continued perfectly good; and Mrs. Norris, in promoting gaieties for her nieces, displaying their accomplishments, and looking about for their future husbands, had very little time to fear for the absent.\nThe Miss Bertrams were now fully established among the neighbourhood's belles; and as they joined to beauty and brilliant acquirements a manner naturally easy and civil, they gained favour as well as admiration. Their vanity was in such good order that they seemed to be quite free from it, and gave themselves no airs; while the praises secured and brought round by their aunt strengthened them in believing they had no faults.\nLady Bertram was too indolent to go into public with her daughters. The charge was made over to her sister, who thoroughly relished the means it afforded her of mixing in society without having horses to hire.\nFanny had no share in the season's festivities; but she enjoyed being useful as her aunt's companion; and, as Miss Lee had left Mansfield, she naturally became everything to Lady Bertram during the night of a party. She talked to her, listened to her, read to her; and the tranquillity of such evenings was unspeakably welcome to her mind. As to her cousins' gaieties, she loved to hear an account of them, especially of the balls, and whom Edmund had danced with; but never imagined she should ever be admitted to the same. It was a comfortable winter to her; for though it brought no William to England, the never-failing hope of his arrival was worth much.\nThe spring deprived her of her friend, the old grey pony; and she was in danger of feeling the loss in her health as well as in her affections; for despite the acknowledged importance of her riding, no measures were taken for mounting her again, \"because,\" as her aunts observed, \"she might ride her cousins' horses at any time when they did not want them.\" As the Miss Bertrams wanted their horses every fine day, and had no idea of sacrificing any real pleasure, that time never came. They took their cheerful rides in the fine mornings of April and May; and Fanny either sat at home all day with one aunt, or walked beyond her strength at the instigation of the other: Lady Bertram holding exercise to be unnecessary; and Mrs. Norris thinking everybody ought to walk all day, as she did.\nEdmund was absent; but when he returned and saw how Fanny was affected, \"Fanny must have a horse\" was his resolute declaration. Mrs. Norris thought some steady old thing might be found at the Park that would do. She considered it as unnecessary, and even improper, that Fanny should have a lady's horse of her own, in the style of her cousins. She was sure Sir Thomas had never intended it: and to be adding to the great expenses of his stable, at a time when his income was unsettled, seemed to her unjustifiable.\n\"Fanny must have a horse,\" was Edmund's only reply. Mrs. Norris could not see it in the same light. Lady Bertram agreed with her son; she only wanted him to wait till Sir Thomas's return, and then Sir Thomas might settle it himself. He would be at home in September, and where would be the harm of waiting till then?\nEdmund determined on a method of proceeding which would not cost too much. He had three horses of his own, but not one that would carry a woman. Two of them were hunters; the third, a useful road-horse: this third he exchanged for one that his cousin might ride. The whole business was soon completed. The new mare proved a treasure; and Fanny was put in possession of her. She had not supposed that anything could suit her like the old grey pony; but her delight in Edmund's mare was far beyond her former pleasure; and her appreciation of his kindness was beyond words. She regarded her cousin as an example of everything good and great, entitled to more gratitude than she could ever pay him. Her feelings towards him were all that was respectful, grateful, confiding, and tender.\nAs the horse continued to be Edmund's property, Mrs. Norris could tolerate its being for Fanny's use; and had Lady Bertram ever thought about the matter, she might have excused Edmund for not waiting till Sir Thomas's return, for when September came Sir Thomas was still abroad.\nUnfavourable circumstances had suddenly arisen; and the great uncertainty of his affairs determined him on sending home his son, and staying on by himself. Tom arrived safely, bringing an excellent account of his father's health; but Mrs. Norris could not help feeling dreadful presentiments; and as the long autumn evenings came on, was so terribly haunted by these ideas, in the sad solitariness of her cottage, as to be obliged to take daily refuge in the dining-room of the Park.\nThe return of winter engagements, however, was not without effect; her mind became pleasantly occupied in superintending the fortunes of her eldest niece. \"If poor Sir Thomas were never to return, it would be consoling to see dear Maria well married,\" she often thought; always when they were in the company of men of fortune, particularly one young man who had recently succeeded to one of the largest estates in the country.\nMr. Rushworth was struck with the beauty of Miss Bertram, and, being inclined to marry, soon fancied himself in love. He was a heavy young man, with not more than common sense; but as there was nothing disagreeable in his address, the young lady was well pleased with her conquest. Being now in her twenty-first year, Maria Bertram was beginning to think that she ought to marry; and as marriage with Mr. Rushworth would give her the enjoyment of a larger income than her father's, as well as a house in town, it became her evident duty to marry Mr. Rushworth if she could.\nMrs. Norris was zealous in promoting the match by every contrivance, and by seeking an intimacy with the gentleman's mother. It was not long before a good understanding took place between this lady and herself. Mrs. Rushworth desired that her son should marry, and declared that of all the young ladies she had seen, Miss Bertram seemed the best adapted to make him happy. Mrs. Norris accepted the compliment. Maria was indeed the pride and delight of them all-perfectly faultless-an angel; and, of course, surrounded by admirers: yet Mr. Rushworth appeared precisely the young man to attach her.\nAfter dancing with each other at a proper number of balls, the young people entered into an engagement, much to the satisfaction of their families, and of the general lookers-on of the neighbourhood.\nIt was some months before Sir Thomas's consent could be received; but as no one doubted his pleasure, the two families met without restraint, and with no other attempt made at secrecy than Mrs. Norris's talking of it everywhere as a matter not to be talked of at present.\nEdmund was the only one who could see a fault in the business; he could not find Mr. Rushworth a desirable companion. He allowed his sister to be the best judge of her own happiness, but he was not pleased that her happiness should centre in a large income; nor could he refrain from often saying to himself, when he was in Mr. Rushworth's company-\"If this man had not twelve thousand a year, he would be a very stupid fellow.\"\nSir Thomas, however, was truly happy in the prospect of an alliance so advantageous. His hearty concurrence was conveyed as soon as possible. He only asked that the marriage should not take place before his return. He wrote in April, and had strong hopes of settling everything to his satisfaction, and leaving Antigua before the end of the summer.\nSuch was the state of affairs in July; and Fanny had just reached her eighteenth year, when the village received an addition in the brother and sister of Mrs. Grant, a Mr. and Miss Crawford, the children of her mother by a second marriage.\nThey were young people of fortune. The son had a good estate in Norfolk, the daughter twenty thousand pounds. As Mrs Grant's own marriage had been soon followed by the death of their common parent, she had scarcely seen them since. In their uncle's house they had found a kind home. Admiral and Mrs. Crawford, though agreeing in nothing else, were united in affection for these children. The Admiral delighted in the boy, Mrs. Crawford doted on the girl; and it was the lady's death which now obliged her protge to find another home. Admiral Crawford was a man of vicious conduct, who chose to bring his mistress under his own roof; and Mrs. Grant's sister proposed to come to her, a measure welcome on both sides; for Mrs. Grant was in want of some variety at home. The arrival, therefore, of a beloved sister was highly agreeable; and her chief anxiety was lest Mansfield should not satisfy a young woman who was used to London.\nMiss Crawford was not entirely free from similar apprehensions; and it was not till after she had tried in vain to persuade her brother to settle with her at his own country house, that she resolved to try her other relations. Henry Crawford had a great dislike of settling in one place; but he kindly escorted his sister into Northamptonshire, and as readily engaged to fetch her away again, at half an hour's notice, whenever she might be weary of it.\nThe meeting was very satisfactory. Miss Crawford found a sister with refinement, a sister's husband who looked the gentleman, and a house commodious and well fitted up; and Mrs. Grant received a young man and woman of very prepossessing appearance. Mary Crawford was remarkably pretty; Henry, though not handsome, had air and countenance; the manners of both were lively and pleasant, and Mrs. Grant immediately gave them credit for everything else. She was delighted with each, but Mary was her dearest object; and having never been able to glory in beauty of her own, she thoroughly enjoyed being proud of her sister's. She had already looked out for a suitable match for her: she had fixed on Tom Bertram; the eldest son of a baronet was not too good for a girl of twenty thousand pounds with elegance and accomplishments; and since she was a warm-hearted, unreserved woman, Mary had not been three hours in the house before she told her what she had planned.\nMiss Crawford was glad to find a family of consequence so near them, and not at all displeased at her sister's choice. Matrimony was her object, provided she could marry well: and having seen Mr. Bertram in town, she knew that no objection could be made to his person. While she treated it as a joke, she did not forget to think of it seriously. The scheme was repeated to Henry.\n\"And now,\" added Mrs. Grant, \"I have thought of something to make it complete. I should dearly love to settle you both here; and therefore, Henry, you shall marry the youngest Miss Bertram, a nice, handsome, good-humoured girl, who will make you very happy.\"\nHenry bowed and thanked her.\n\"My dear sister,\" said Mary, \"if you can persuade him into anything of the sort, I shall be delighted. I have three friends who have been all dying for him in their turn; and the pains which they, their mothers, my dear aunt and myself, have taken to reason, coax, or trick him into marrying, is inconceivable! He is the most horrible flirt that can be imagined. If your Miss Bertrams do not like to have their hearts broke, let them avoid Henry.\"\n\"My dear brother, I will not believe this.\"\n\"No, I am sure you will be kinder than Mary. You will allow for the doubts of youth. I am cautious, and unwilling to risk my happiness in a hurry. Nobody can think more highly of matrimony than myself. I consider the blessing of a wife as most justly described by the poet-'Heaven's last best gift.'\"\n\"There, Mrs. Grant, you see how he dwells on one word, and only look at his smile. I assure you he is detestable; the Admiral's lessons have quite spoiled him.\"\n\"I pay very little regard,\" said Mrs. Grant, \"to what any young person says about marriage. If they profess a disinclination for it, I know that they have not yet seen the right person.\"\nDr. Grant laughingly congratulated Miss Crawford on feeling no disinclination to the state herself.\n\"Oh yes! I am not ashamed of it. I would have everybody marry if they can do it to advantage.\"",
        "paragraph_chars": [
            [
                0,
                201
            ],
            [
                201,
                602
            ],
            [
                602,
                870
            ],
            [
                870,
                1299
            ],
            [
                1299,
                1509
            ],
            [
                1509,
                2169
            ],
            [
                2169,
                2960
            ],
            [
                2960,
                3475
            ],
            [
                3475,
                3792
            ],
            [
                3792,
                4576
            ],
            [
                4576,
                4855
            ],
            [
                4855,
                5339
            ],
            [
                5339,
                5766
            ],
            [
                5766,
                6340
            ],
            [
                6340,
                6937
            ],
            [
                6937,
                7137
            ],
            [
                7137,
                7409
            ],
            [
                7409,
                7837
            ],
            [
                7837,
                8186
            ],
            [
                8186,
                8426
            ],
            [
                8426,
                9357
            ],
            [
                9357,
                9811
            ],
            [
                9811,
                10774
            ],
            [
                10774,
                11154
            ],
            [
                11154,
                11413
            ],
            [
                11413,
                11442
            ],
            [
                11442,
                11890
            ],
            [
                11890,
                11934
            ],
            [
                11934,
                12235
            ],
            [
                12235,
                12396
            ],
            [
                12396,
                12583
            ],
            [
                12583,
                12683
            ],
            [
                12683,
                12777
            ]
        ],
        "segment_chars": [
            [
                0,
                201
            ],
            [
                201,
                602
            ],
            [
                602,
                870
            ],
            [
                870,
                1082
            ],
            [
                1082,
                1299
            ],
            [
                1299,
                1367
            ],
            [
                1367,
                1509
            ],
            [
                1509,
                1725
            ],
            [
                1725,
                1849
            ],
            [
                1849,
                2034
            ],
            [
                2034,
                2169
            ],
            [
                2169,
                2527
            ],
            [
                2527,
                2656
            ],
            [
                2656,
                2960
            ],
            [
                2960,
                3088
            ],
            [
                3088,
                3172
            ],
            [
                3172,
                3304
            ],
            [
                3304,
                3475
            ],
            [
                3475,
                3527
            ],
            [
                3527,
                3575
            ],
            [
                3575,
                3708
            ],
            [
                3708,
                3792
            ],
            [
                3792,
                3867
            ],
            [
                3867,
                3937
            ],
            [
                3937,
                4055
            ],
            [
                4055,
                4094
            ],
            [
                4094,
                4166
            ],
            [
                4166,
                4364
            ],
            [
                4364,
                4488
            ],
            [
                4488,
                4576
            ],
            [
                4576,
                4855
            ],
            [
                4855,
                5011
            ],
            [
                5011,
                5339
            ],
            [
                5339,
                5494
            ],
            [
                5494,
                5766
            ],
            [
                5766,
                5884
            ],
            [
                5884,
                6048
            ],
            [
                6048,
                6340
            ],
            [
                6340,
                6465
            ],
            [
                6465,
                6551
            ],
            [
                6551,
                6713
            ],
            [
                6713,
                6750
            ],
            [
                6750,
                6937
            ],
            [
                6937,
                7137
            ],
            [
                7137,
                7409
            ],
            [
                7409,
                7527
            ],
            [
                7527,
                7837
            ],
            [
                7837,
                7922
            ],
            [
                7922,
                7979
            ],
            [
                7979,
                8052
            ],
            [
                8052,
                8186
            ],
            [
                8186,
                8426
            ],
            [
                8426,
                8461
            ],
            [
                8461,
                8536
            ],
            [
                8536,
                8658
            ],
            [
                8658,
                8709
            ],
            [
                8709,
                8814
            ],
            [
                8814,
                8960
            ],
            [
                8960,
                9193
            ],
            [
                9193,
                9357
            ],
            [
                9357,
                9584
            ],
            [
                9584,
                9811
            ],
            [
                9811,
                9846
            ],
            [
                9846,
                10060
            ],
            [
                10060,
                10261
            ],
            [
                10261,
                10433
            ],
            [
                10433,
                10774
            ],
            [
                10774,
                10893
            ],
            [
                10893,
                11043
            ],
            [
                11043,
                11120
            ],
            [
                11120,
                11154
            ],
            [
                11154,
                11233
            ],
            [
                11233,
                11413
            ],
            [
                11413,
                11442
            ],
            [
                11442,
                11545
            ],
            [
                11545,
                11753
            ],
            [
                11753,
                11805
            ],
            [
                11805,
                11890
            ],
            [
                11890,
                11934
            ],
            [
                11934,
                11979
            ],
            [
                11979,
                12019
            ],
            [
                12019,
                12081
            ],
            [
                12081,
                12136
            ],
            [
                12136,
                12235
            ],
            [
                12235,
                12318
            ],
            [
                12318,
                12396
            ],
            [
                12396,
                12488
            ],
            [
                12488,
                12583
            ],
            [
                12583,
                12683
            ],
            [
                12683,
                12692
            ],
            [
                12692,
                12716
            ],
            [
                12716,
                12777
            ]
        ],
        "overlap_chars": [
            [
                5,
                44
            ],
            [
                45,
                58
            ],
            [
                59,
                66
            ],
            [
                77,
                129
            ],
            [
                130,
                161
            ],
            [
                162,
                190
            ],
            [
                191,
                199
            ],
            [
                199,
                201
            ],
            [
                206,
                248
            ],
            [
                249,
                334
            ],
            [
                334,
                381
            ],
            [
                382,
                384
            ],
            [
                394,
                397
            ],
            [
                398,
                518
            ],
            [
                519,
                567
            ],
            [
                568,
                602
            ],
            [
                602,
                612
            ],
            [
                613,
                745
            ],
            [
                746,
                828
            ],
            [
                829,
                840
            ],
            [
                846,
                848
            ],
            [
                854,
                870
            ],
            [
                870,
                924
            ],
            [
                925,
                938
            ],
            [
                941,
                947
            ],
            [
                947,
                1028
            ],
            [
                1029,
                1032
            ],
            [
                1038,
                1044
            ],
            [
                1052,
                1069
            ],
            [
                1070,
                1082
            ],
            [
                1082,
                1207
            ],
            [
                1208,
                1247
            ],
            [
                1261,
                1299
            ],
            [
                1299,
                1311
            ],
            [
                1312,
                1328
            ],
            [
                1329,
                1331
            ],
            [
                1332,
                1366
            ],
            [
                1367,
                1410
            ],
            [
                1411,
                1509
            ],
            [
                1509,
                1534
            ],
            [
                1535,
                1541
            ],
            [
                1544,
                1555
            ],
            [
                1555,
                1578
            ],
            [
                1579,
                1609
            ],
            [
                1609,
                1717
            ],
            [
                1718,
                1725
            ],
            [
                1725,
                1811
            ],
            [
                1812,
                1838
            ],
            [
                1839,
                1842
            ],
            [
                1843,
                1847
            ],
            [
                1847,
                1849
            ],
            [
                1849,
                1977
            ],
            [
                1993,
                2032
            ],
            [
                2032,
                2034
            ],
            [
                2034,
                2169
            ],
            [
                2169,
                2172
            ],
            [
                2173,
                2199
            ],
            [
                2200,
                2230
            ],
            [
                2231,
                2316
            ],
            [
                2325,
                2366
            ],
            [
                2366,
                2428
            ],
            [
                2429,
                2438
            ],
            [
                2439,
                2447
            ],
            [
                2447,
                2464
            ],
            [
                2465,
                2468
            ],
            [
                2478,
                2524
            ],
            [
                2527,
                2547
            ],
            [
                2548,
                2602
            ],
            [
                2615,
                2643
            ],
            [
                2644,
                2656
            ],
            [
                2656,
                2754
            ],
            [
                2759,
                2876
            ],
            [
                2877,
                2888
            ],
            [
                2888,
                2905
            ],
            [
                2906,
                2938
            ],
            [
                2939,
                2947
            ],
            [
                2948,
                2950
            ],
            [
                2958,
                2959
            ],
            [
                2960,
                2977
            ],
            [
                2977,
                2978
            ],
            [
                2979,
                2982
            ],
            [
                2983,
                2999
            ],
            [
                3000,
                3003
            ],
            [
                3008,
                3021
            ],
            [
                3030,
                3031
            ],
            [
                3032,
                3061
            ],
            [
                3062,
                3065
            ],
            [
                3066,
                3086
            ],
            [
                3086,
                3088
            ],
            [
                3088,
                3099
            ],
            [
                3108,
                3144
            ],
            [
                3148,
                3170
            ],
            [
                3170,
                3172
            ],
            [
                3172,
                3175
            ],
            [
                3187,
                3192
            ],
            [
                3193,
                3249
            ],
            [
                3250,
                3304
            ],
            [
                3304,
                3354
            ],
            [
                3355,
                3360
            ],
            [
                3361,
                3419
            ],
            [
                3420,
                3459
            ],
            [
                3460,
                3474
            ],
            [
                3475,
                3527
            ],
            [
                3527,
                3575
            ],
            [
                3575,
                3587
            ],
            [
                3588,
                3607
            ],
            [
                3607,
                3698
            ],
            [
                3699,
                3708
            ],
            [
                3708,
                3772
            ],
            [
                3773,
                3785
            ],
            [
                3790,
                3792
            ],
            [
                3792,
                3798
            ],
            [
                3799,
                3847
            ],
            [
                3848,
                3851
            ],
            [
                3857,
                3865
            ],
            [
                3865,
                3867
            ],
            [
                3867,
                3937
            ],
            [
                3937,
                4008
            ],
            [
                4019,
                4053
            ],
            [
                4055,
                4094
            ],
            [
                4094,
                4125
            ],
            [
                4126,
                4139
            ],
            [
                4140,
                4146
            ],
            [
                4147,
                4166
            ],
            [
                4166,
                4186
            ],
            [
                4187,
                4206
            ],
            [
                4207,
                4287
            ],
            [
                4288,
                4291
            ],
            [
                4292,
                4307
            ],
            [
                4307,
                4312
            ],
            [
                4313,
                4316
            ],
            [
                4330,
                4332
            ],
            [
                4337,
                4345
            ],
            [
                4346,
                4356
            ],
            [
                4357,
                4362
            ],
            [
                4362,
                4364
            ],
            [
                4364,
                4431
            ],
            [
                4432,
                4443
            ],
            [
                4449,
                4458
            ],
            [
                4468,
                4478
            ],
            [
                4479,
                4482
            ],
            [
                4486,
                4488
            ],
            [
                4488,
                4491
            ],
            [
                4501,
                4517
            ],
            [
                4518,
                4576
            ],
            [
                4576,
                4598
            ],
            [
                4605,
                4611
            ],
            [
                4614,
                4622
            ],
            [
                4622,
                4717
            ],
            [
                4718,
                4721
            ],
            [
                4728,
                4729
            ],
            [
                4734,
                4744
            ],
            [
                4745,
                4752
            ],
            [
                4760,
                4800
            ],
            [
                4800,
                4853
            ],
            [
                4853,
                4854
            ],
            [
                4855,
                4901
            ],
            [
                4901,
                4910
            ],
            [
                4911,
                4928
            ],
            [
                4932,
                4935
            ],
            [
                4944,
                4987
            ],
            [
                4999,
                5011
            ],
            [
                5011,
                5088
            ],
            [
                5089,
                5100
            ],
            [
                5101,
                5163
            ],
            [
                5164,
                5170
            ],
            [
                5171,
                5179
            ],
            [
                5180,
                5338
            ],
            [
                5339,
                5397
            ],
            [
                5398,
                5405
            ],
            [
                5406,
                5421
            ],
            [
                5422,
                5492
            ],
            [
                5492,
                5494
            ],
            [
                5494,
                5518
            ],
            [
                5519,
                5547
            ],
            [
                5548,
                5564
            ],
            [
                5565,
                5594
            ],
            [
                5595,
                5665
            ],
            [
                5666,
                5678
            ],
            [
                5683,
                5749
            ],
            [
                5750,
                5766
            ],
            [
                5766,
                5783
            ],
            [
                5784,
                5884
            ],
            [
                5884,
                5987
            ],
            [
                5988,
                6048
            ],
            [
                6048,
                6120
            ],
            [
                6144,
                6152
            ],
            [
                6153,
                6258
            ],
            [
                6259,
                6260
            ],
            [
                6261,
                6275
            ],
            [
                6276,
                6285
            ],
            [
                6286,
                6339
            ],
            [
                6340,
                6355
            ],
            [
                6356,
                6386
            ],
            [
                6387,
                6395
            ],
            [
                6396,
                6407
            ],
            [
                6407,
                6412
            ],
            [
                6413,
                6463
            ],
            [
                6463,
                6465
            ],
            [
                6465,
                6551
            ],
            [
                6551,
                6565
            ],
            [
                6574,
                6650
            ],
            [
                6651,
                6676
            ],
            [
                6677,
                6713
            ],
            [
                6713,
                6748
            ],
            [
                6748,
                6750
            ],
            [
                6750,
                6846
            ],
            [
                6847,
                6869
            ],
            [
                6869,
                6870
            ],
            [
                6871,
                6874
            ],
            [
                6875,
                6924
            ],
            [
                6925,
                6937
            ],
            [
                6937,
                7012
            ],
            [
                7013,
                7025
            ],
            [
                7026,
                7039
            ],
            [
                7039,
                7074
            ],
            [
                7075,
                7135
            ],
            [
                7135,
                7137
            ],
            [
                7137,
                7206
            ],
            [
                7207,
                7216
            ],
            [
                7225,
                7228
            ],
            [
                7229,
                7237
            ],
            [
                7237,
                7238
            ],
            [
                7239,
                7255
            ],
            [
                7260,
                7282
            ],
            [
                7288,
                7409
            ],
            [
                7409,
                7432
            ],
            [
                7433,
                7471
            ],
            [
                7475,
                7480
            ],
            [
                7485,
                7527
            ],
            [
                7527,
                7529
            ],
            [
                7538,
                7717
            ],
            [
                7730,
                7837
            ],
            [
                7837,
                7907
            ],
            [
                7908,
                7920
            ],
            [
                7920,
                7922
            ],
            [
                7922,
                7925
            ],
            [
                7926,
                7979
            ],
            [
                7979,
                7986
            ],
            [
                7993,
                8050
            ],
            [
                8050,
                8052
            ],
            [
                8052,
                8121
            ],
            [
                8122,
                8186
            ],
            [
                8186,
                8218
            ],
            [
                8219,
                8277
            ],
            [
                8278,
                8425
            ],
            [
                8426,
                8461
            ],
            [
                8461,
                8536
            ],
            [
                8536,
                8538
            ],
            [
                8539,
                8542
            ],
            [
                8543,
                8548
            ],
            [
                8551,
                8623
            ],
            [
                8624,
                8658
            ],
            [
                8658,
                8709
            ],
            [
                8709,
                8812
            ],
            [
                8812,
                8814
            ],
            [
                8814,
                8930
            ],
            [
                8938,
                8960
            ],
            [
                8960,
                9016
            ],
            [
                9017,
                9062
            ],
            [
                9063,
                9073
            ],
            [
                9073,
                9075
            ],
            [
                9076,
                9082
            ],
            [
                9092,
                9094
            ],
            [
                9100,
                9117
            ],
            [
                9118,
                9128
            ],
            [
                9139,
                9155
            ],
            [
                9156,
                9159
            ],
            [
                9160,
                9193
            ],
            [
                9193,
                9221
            ],
            [
                9230,
                9236
            ],
            [
                9237,
                9318
            ],
            [
                9319,
                9336
            ],
            [
                9341,
                9357
            ],
            [
                9357,
                9419
            ],
            [
                9419,
                9546
            ],
            [
                9556,
                9558
            ],
            [
                9563,
                9584
            ],
            [
                9584,
                9602
            ],
            [
                9603,
                9618
            ],
            [
                9619,
                9621
            ],
            [
                9631,
                9633
            ],
            [
                9638,
                9643
            ],
            [
                9643,
                9651
            ],
            [
                9659,
                9667
            ],
            [
                9668,
                9678
            ],
            [
                9679,
                9788
            ],
            [
                9798,
                9806
            ],
            [
                9809,
                9811
            ],
            [
                9811,
                9844
            ],
            [
                9844,
                9846
            ],
            [
                9846,
                9874
            ],
            [
                9890,
                10003
            ],
            [
                10004,
                10060
            ],
            [
                10060,
                10261
            ],
            [
                10261,
                10403
            ],
            [
                10404,
                10433
            ],
            [
                10433,
                10440
            ],
            [
                10456,
                10601
            ],
            [
                10602,
                10606
            ],
            [
                10607,
                10635
            ],
            [
                10635,
                10640
            ],
            [
                10655,
                10774
            ],
            [
                10774,
                10816
            ],
            [
                10817,
                10831
            ],
            [
                10832,
                10868
            ],
            [
                10869,
                10884
            ],
            [
                10885,
                10891
            ],
            [
                10891,
                10893
            ],
            [
                10893,
                11000
            ],
            [
                11001,
                11003
            ],
            [
                11004,
                11019
            ],
            [
                11020,
                11041
            ],
            [
                11041,
                11043
            ],
            [
                11043,
                11073
            ],
            [
                11073,
                11120
            ],
            [
                11120,
                11134
            ],
            [
                11135,
                11154
            ],
            [
                11154,
                11233
            ],
            [
                11233,
                11272
            ],
            [
                11277,
                11375
            ],
            [
                11376,
                11413
            ],
            [
                11413,
                11442
            ],
            [
                11442,
                11522
            ],
            [
                11523,
                11530
            ],
            [
                11531,
                11533
            ],
            [
                11543,
                11545
            ],
            [
                11545,
                11557
            ],
            [
                11558,
                11652
            ],
            [
                11654,
                11753
            ],
            [
                11753,
                11805
            ],
            [
                11805,
                11890
            ],
            [
                11890,
                11931
            ],
            [
                11931,
                11934
            ],
            [
                11934,
                11948
            ],
            [
                11949,
                11979
            ],
            [
                11979,
                12017
            ],
            [
                12017,
                12019
            ],
            [
                12019,
                12023
            ],
            [
                12024,
                12032
            ],
            [
                12032,
                12081
            ],
            [
                12081,
                12112
            ],
            [
                12113,
                12119
            ],
            [
                12123,
                12136
            ],
            [
                12136,
                12194
            ],
            [
                12198,
                12216
            ],
            [
                12217,
                12221
            ],
            [
                12222,
                12235
            ],
            [
                12235,
                12318
            ],
            [
                12318,
                12336
            ],
            [
                12337,
                12396
            ],
            [
                12396,
                12471
            ],
            [
                12478,
                12488
            ],
            [
                12488,
                12530
            ],
            [
                12536,
                12583
            ],
            [
                12583,
                12683
            ],
            [
                12683,
                12692
            ],
            [
                12692,
                12700
            ],
            [
                12701,
                12716
            ],
            [
                12716,
                12762
            ],
            [
                12763,
                12777
            ]
        ],
        "row_chars": [
            [
                0,
                201
            ],
            [
                201,
                602
            ],
            [
                602,
                870
            ],
            [
                870,
                1082
            ],
            [
                1082,
                1299
            ],
            [
                1299,
                1509
            ],
            [
                1509,
                1725
            ],
            [
                1725,
                1849
            ],
            [
                1849,
                2034
            ],
            [
                2034,
                2169
            ],
            [
                2169,
                2656
            ],
            [
                2656,
                2960
            ],
            [
                2960,
                3088
            ],
            [
                3088,
                3172
            ],
            [
                3172,
                3304
            ],
            [
                3304,
                3475
            ],
            [
                3475,
                3527
            ],
            [
                3527,
                3575
            ],
            [
                3575,
                3708
            ],
            [
                3708,
                3792
            ],
            [
                3792,
                3867
            ],
            [
                3867,
                3937
            ],
            [
                3937,
                4094
            ],
            [
                4094,
                4166
            ],
            [
                4166,
                4364
            ],
            [
                4364,
                4488
            ],
            [
                4488,
                4576
            ],
            [
                4576,
                4855
            ],
            [
                4855,
                5011
            ],
            [
                5011,
                5339
            ],
            [
                5339,
                5494
            ],
            [
                5494,
                5766
            ],
            [
                5766,
                5884
            ],
            [
                5884,
                6048
            ],
            [
                6048,
                6340
            ],
            [
                6340,
                6465
            ],
            [
                6465,
                6551
            ],
            [
                6551,
                6713
            ],
            [
                6713,
                6750
            ],
            [
                6750,
                6937
            ],
            [
                6937,
                7137
            ],
            [
                7137,
                7409
            ],
            [
                7409,
                7527
            ],
            [
                7527,
                7837
            ],
            [
                7837,
                7922
            ],
            [
                7922,
                7979
            ],
            [
                7979,
                8052
            ],
            [
                8052,
                8186
            ],
            [
                8186,
                8426
            ],
            [
                8426,
                8461
            ],
            [
                8461,
                8536
            ],
            [
                8536,
                8658
            ],
            [
                8658,
                8709
            ],
            [
                8709,
                8814
            ],
            [
                8814,
                8960
            ],
            [
                8960,
                9193
            ],
            [
                9193,
                9357
            ],
            [
                9357,
                9584
            ],
            [
                9584,
                9811
            ],
            [
                9811,
                9846
            ],
            [
                9846,
                10060
            ],
            [
                10060,
                10261
            ],
            [
                10261,
                10433
            ],
            [
                10433,
                10774
            ],
            [
                10774,
                10893
            ],
            [
                10893,
                11043
            ],
            [
                11043,
                11120
            ],
            [
                11120,
                11154
            ],
            [
                11154,
                11233
            ],
            [
                11233,
                11413
            ],
            [
                11413,
                11442
            ],
            [
                11442,
                11545
            ],
            [
                11545,
                11545
            ],
            [
                11545,
                11545
            ],
            [
                11545,
                11753
            ],
            [
                11753,
                11805
            ],
            [
                11805,
                11890
            ],
            [
                11890,
                11934
            ],
            [
                11934,
                11979
            ],
            [
                11979,
                12019
            ],
            [
                12019,
                12081
            ],
            [
                12081,
                12136
            ],
            [
                12136,
                12235
            ],
            [
                12235,
                12318
            ],
            [
                12318,
                12396
            ],
            [
                12396,
                12488
            ],
            [
                12488,
                12583
            ],
            [
                12583,
                12683
            ],
            [
                12683,
                12692
            ],
            [
                12692,
                12716
            ],
            [
                12716,
                12777
            ]
        ]
    }
}