{
    "original": {
        "text": "Henry Crawford was at Mansfield Park again the next morning, and at an earlier hour than common visiting warrants. The two ladies were together in the breakfast-room, and, fortunately for him, Lady Bertram was on the very point of quitting it as he entered. She was almost at the door, and not chusing by any means to take so much trouble in vain, she still went on, after a civil reception, a short sentence about being waited for, and a \"Let Sir Thomas know\" to the servant.\nHenry, overjoyed to have her go, bowed and watched her off, and without losing another moment, turned instantly to Fanny, and, taking out some letters, said, with a most animated look, \"I must acknowledge myself infinitely obliged to any creature who gives me such an opportunity of seeing you alone: I have been wishing it more than you can have any idea. Knowing as I do what your feelings as a sister are, I could hardly have borne that any one in the house should share with you in the first knowledge of the news I now bring. He is made. Your brother is a lieutenant. I have the infinite satisfaction of congratulating you on your brother's promotion. Here are the letters which announce it, this moment come to hand. You will, perhaps, like to see them.\"\nFanny could not speak, but he did not want her to speak. To see the expression of her eyes, the change of her complexion, the progress of her feelings, their doubt, confusion, and felicity, was enough. She took the letters as he gave them. The first was from the Admiral to inform his nephew, in a few words, of his having succeeded in the object he had undertaken, the promotion of young Price, and enclosing two more, one from the Secretary of the First Lord to a friend, whom the Admiral had set to work in the business, the other from that friend to himself, by which it appeared that his lordship had the very great happiness of attending to the recommendation of Sir Charles; that Sir Charles was much delighted in having such an opportunity of proving his regard for Admiral Crawford, and that the circumstance of Mr. William Price's commission as Second Lieutenant of H.M. Sloop Thrush being made out was spreading general joy through a wide circle of great people.\nWhile her hand was trembling under these letters, her eye running from one to the other, and her heart swelling with emotion, Crawford thus continued, with unfeigned eagerness, to express his interest in the event-\n\"I will not talk of my own happiness,\" said he, \"great as it is, for I think only of yours. Compared with you, who has a right to be happy? I have almost grudged myself my own prior knowledge of what you ought to have known before all the world. I have not lost a moment, however. The post was late this morning, but there has not been since a moment's delay. How impatient, how anxious, how wild I have been on the subject, I will not attempt to describe; how severely mortified, how cruelly disappointed, in not having it finished while I was in London! I was kept there from day to day in the hope of it, for nothing less dear to me than such an object would have detained me half the time from Mansfield. But though my uncle entered into my wishes with all the warmth I could desire, and exerted himself immediately, there were difficulties from the absence of one friend, and the engagements of another, which at last I could no longer bear to stay the end of, and knowing in what good hands I left the cause, I came away on Monday, trusting that many posts would not pass before I should be followed by such very letters as these. My uncle, who is the very best man in the world, has exerted himself, as I knew he would, after seeing your brother. He was delighted with him. I would not allow myself yesterday to say how delighted, or to repeat half that the Admiral said in his praise. I deferred it all till his praise should be proved the praise of a friend, as this day _does_ prove it. _Now_ I may say that even I could not require William Price to excite a greater interest, or be followed by warmer wishes and higher commendation, than were most voluntarily bestowed by my uncle after the evening they had passed together.\"\n\"Has this been all _your_ doing, then?\" cried Fanny. \"Good heaven! how very, very kind! Have you really-was it by _your_ desire? I beg your pardon, but I am bewildered. Did Admiral Crawford apply? How was it? I am stupefied.\"\nHenry was most happy to make it more intelligible, by beginning at an earlier stage, and explaining very particularly what he had done. His last journey to London had been undertaken with no other view than that of introducing her brother in Hill Street, and prevailing on the Admiral to exert whatever interest he might have for getting him on. This had been his business. He had communicated it to no creature: he had not breathed a syllable of it even to Mary; while uncertain of the issue, he could not have borne any participation of his feelings, but this had been his business; and he spoke with such a glow of what his solicitude had been, and used such strong expressions, was so abounding in the _deepest_ _interest_, in _twofold_ _motives_, in _views_ _and_ _wishes_ _more_ _than_ _could_ _be_ _told_, that Fanny could not have remained insensible of his drift, had she been able to attend; but her heart was so full and her senses still so astonished, that she could listen but imperfectly even to what he told her of William, and saying only when he paused, \"How kind! how very kind! Oh, Mr. Crawford, we are infinitely obliged to you! Dearest, dearest William!\" She jumped up and moved in haste towards the door, crying out, \"I will go to my uncle. My uncle ought to know it as soon as possible.\" But this could not be suffered. The opportunity was too fair, and his feelings too impatient. He was after her immediately. \"She must not go, she must allow him five minutes longer,\" and he took her hand and led her back to her seat, and was in the middle of his farther explanation, before she had suspected for what she was detained. When she did understand it, however, and found herself expected to believe that she had created sensations which his heart had never known before, and that everything he had done for William was to be placed to the account of his excessive and unequalled attachment to her, she was exceedingly distressed, and for some moments unable to speak. She considered it all as nonsense, as mere trifling and gallantry, which meant only to deceive for the hour; she could not but feel that it was treating her improperly and unworthily, and in such a way as she had not deserved; but it was like himself, and entirely of a piece with what she had seen before; and she would not allow herself to shew half the displeasure she felt, because he had been conferring an obligation, which no want of delicacy on his part could make a trifle to her. While her heart was still bounding with joy and gratitude on William's behalf, she could not be severely resentful of anything that injured only herself; and after having twice drawn back her hand, and twice attempted in vain to turn away from him, she got up, and said only, with much agitation, \"Don't, Mr. Crawford, pray don't! I beg you would not. This is a sort of talking which is very unpleasant to me. I must go away. I cannot bear it.\" But he was still talking on, describing his affection, soliciting a return, and, finally, in words so plain as to bear but one meaning even to her, offering himself, hand, fortune, everything, to her acceptance. It was so; he had said it. Her astonishment and confusion increased; and though still not knowing how to suppose him serious, she could hardly stand. He pressed for an answer.\n\"No, no, no!\" she cried, hiding her face. \"This is all nonsense. Do not distress me. I can hear no more of this. Your kindness to William makes me more obliged to you than words can express; but I do not want, I cannot bear, I must not listen to such-No, no, don't think of me. But you are _not_ thinking of me. I know it is all nothing.\"\nShe had burst away from him, and at that moment Sir Thomas was heard speaking to a servant in his way towards the room they were in. It was no time for farther assurances or entreaty, though to part with her at a moment when her modesty alone seemed, to his sanguine and preassured mind, to stand in the way of the happiness he sought, was a cruel necessity. She rushed out at an opposite door from the one her uncle was approaching, and was walking up and down the East room in the utmost confusion of contrary feeling, before Sir Thomas's politeness or apologies were over, or he had reached the beginning of the joyful intelligence which his visitor came to communicate.\nShe was feeling, thinking, trembling about everything; agitated, happy, miserable, infinitely obliged, absolutely angry. It was all beyond belief! He was inexcusable, incomprehensible! But such were his habits that he could do nothing without a mixture of evil. He had previously made her the happiest of human beings, and now he had insulted-she knew not what to say, how to class, or how to regard it. She would not have him be serious, and yet what could excuse the use of such words and offers, if they meant but to trifle?\nBut William was a lieutenant. _That_ was a fact beyond a doubt, and without an alloy. She would think of it for ever and forget all the rest. Mr. Crawford would certainly never address her so again: he must have seen how unwelcome it was to her; and in that case, how gratefully she could esteem him for his friendship to William!\nShe would not stir farther from the East room than the head of the great staircase, till she had satisfied herself of Mr. Crawford's having left the house; but when convinced of his being gone, she was eager to go down and be with her uncle, and have all the happiness of his joy as well as her own, and all the benefit of his information or his conjectures as to what would now be William's destination. Sir Thomas was as joyful as she could desire, and very kind and communicative; and she had so comfortable a talk with him about William as to make her feel as if nothing had occurred to vex her, till she found, towards the close, that Mr. Crawford was engaged to return and dine there that very day. This was a most unwelcome hearing, for though he might think nothing of what had passed, it would be quite distressing to her to see him again so soon.\nShe tried to get the better of it; tried very hard, as the dinner hour approached, to feel and appear as usual; but it was quite impossible for her not to look most shy and uncomfortable when their visitor entered the room. She could not have supposed it in the power of any concurrence of circumstances to give her so many painful sensations on the first day of hearing of William's promotion.\nMr. Crawford was not only in the room-he was soon close to her. He had a note to deliver from his sister. Fanny could not look at him, but there was no consciousness of past folly in his voice. She opened her note immediately, glad to have anything to do, and happy, as she read it, to feel that the fidgetings of her aunt Norris, who was also to dine there, screened her a little from view.\n\"MY DEAR FANNY,-for so I may now always call you, to the infinite relief of a tongue that has been stumbling at _Miss_ _Price_ for at least the last six weeks-I cannot let my brother go without sending you a few lines of general congratulation, and giving my most joyful consent and approval. Go on, my dear Fanny, and without fear; there can be no difficulties worth naming. I chuse to suppose that the assurance of my consent will be something; so you may smile upon him with your sweetest smiles this afternoon, and send him back to me even happier than he goes.\nYours affectionately, M. C.\"\nThese were not expressions to do Fanny any good; for though she read in too much haste and confusion to form the clearest judgment of Miss Crawford's meaning, it was evident that she meant to compliment her on her brother's attachment, and even to _appear_ to believe it serious. She did not know what to do, or what to think. There was wretchedness in the idea of its being serious; there was perplexity and agitation every way. She was distressed whenever Mr. Crawford spoke to her, and he spoke to her much too often; and she was afraid there was a something in his voice and manner in addressing her very different from what they were when he talked to the others. Her comfort in that day's dinner was quite destroyed: she could hardly eat anything; and when Sir Thomas good-humouredly observed that joy had taken away her appetite, she was ready to sink with shame, from the dread of Mr. Crawford's interpretation; for though nothing could have tempted her to turn her eyes to the right hand, where he sat, she felt that _his_ were immediately directed towards her.\nShe was more silent than ever. She would hardly join even when William was the subject, for his commission came all from the right hand too, and there was pain in the connexion.\nShe thought Lady Bertram sat longer than ever, and began to be in despair of ever getting away; but at last they were in the drawing-room, and she was able to think as she would, while her aunts finished the subject of William's appointment in their own style.\nMrs. Norris seemed as much delighted with the saving it would be to Sir Thomas as with any part of it. \"_Now_ William would be able to keep himself, which would make a vast difference to his uncle, for it was unknown how much he had cost his uncle; and, indeed, it would make some difference in _her_ presents too. She was very glad that she had given William what she did at parting, very glad, indeed, that it had been in her power, without material inconvenience, just at that time to give him something rather considerable; that is, for _her_, with _her_ limited means, for now it would all be useful in helping to fit up his cabin. She knew he must be at some expense, that he would have many things to buy, though to be sure his father and mother would be able to put him in the way of getting everything very cheap; but she was very glad she had contributed her mite towards it.\"\n\"I am glad you gave him something considerable,\" said Lady Bertram, with most unsuspicious calmness, \"for _I_ gave him only 10.\"\n\"Indeed!\" cried Mrs. Norris, reddening. \"Upon my word, he must have gone off with his pockets well lined, and at no expense for his journey to London either!\"\n\"Sir Thomas told me 10 would be enough.\"\nMrs. Norris, being not at all inclined to question its sufficiency, began to take the matter in another point.\n\"It is amazing,\" said she, \"how much young people cost their friends, what with bringing them up and putting them out in the world! They little think how much it comes to, or what their parents, or their uncles and aunts, pay for them in the course of the year. Now, here are my sister Price's children; take them all together, I dare say nobody would believe what a sum they cost Sir Thomas every year, to say nothing of what _I_ do for them.\"\n\"Very true, sister, as you say. But, poor things! they cannot help it; and you know it makes very little difference to Sir Thomas. Fanny, William must not forget my shawl if he goes to the East Indies; and I shall give him a commission for anything else that is worth having. I wish he may go to the East Indies, that I may have my shawl. I think I will have two shawls, Fanny.\"\nFanny, meanwhile, speaking only when she could not help it, was very earnestly trying to understand what Mr. and Miss Crawford were at. There was everything in the world _against_ their being serious but his words and manner. Everything natural, probable, reasonable, was against it; all their habits and ways of thinking, and all her own demerits. How could _she_ have excited serious attachment in a man who had seen so many, and been admired by so many, and flirted with so many, infinitely her superiors; who seemed so little open to serious impressions, even where pains had been taken to please him; who thought so slightly, so carelessly, so unfeelingly on all such points; who was everything to everybody, and seemed to find no one essential to him? And farther, how could it be supposed that his sister, with all her high and worldly notions of matrimony, would be forwarding anything of a serious nature in such a quarter? Nothing could be more unnatural in either. Fanny was ashamed of her own doubts. Everything might be possible rather than serious attachment, or serious approbation of it toward her. She had quite convinced herself of this before Sir Thomas and Mr. Crawford joined them. The difficulty was in maintaining the conviction quite so absolutely after Mr. Crawford was in the room; for once or twice a look seemed forced on her which she did not know how to class among the common meaning; in any other man, at least, she would have said that it meant something very earnest, very pointed. But she still tried to believe it no more than what he might often have expressed towards her cousins and fifty other women.\nShe thought he was wishing to speak to her unheard by the rest. She fancied he was trying for it the whole evening at intervals, whenever Sir Thomas was out of the room, or at all engaged with Mrs. Norris, and she carefully refused him every opportunity.\nAt last-it seemed an at last to Fanny's nervousness, though not remarkably late-he began to talk of going away; but the comfort of the sound was impaired by his turning to her the next moment, and saying, \"Have you nothing to send to Mary? No answer to her note? She will be disappointed if she receives nothing from you. Pray write to her, if it be only a line.\"\n\"Oh yes! certainly,\" cried Fanny, rising in haste, the haste of embarrassment and of wanting to get away-\"I will write directly.\"\nShe went accordingly to the table, where she was in the habit of writing for her aunt, and prepared her materials without knowing what in the world to say. She had read Miss Crawford's note only once, and how to reply to anything so imperfectly understood was most distressing. Quite unpractised in such sort of note-writing, had there been time for scruples and fears as to style she would have felt them in abundance: but something must be instantly written; and with only one decided feeling, that of wishing not to appear to think anything really intended, she wrote thus, in great trembling both of spirits and hand-\n\"I am very much obliged to you, my dear Miss Crawford, for your kind congratulations, as far as they relate to my dearest William. The rest of your note I know means nothing; but I am so unequal to anything of the sort, that I hope you will excuse my begging you to take no farther notice. I have seen too much of Mr. Crawford not to understand his manners; if he understood me as well, he would, I dare say, behave differently. I do not know what I write, but it would be a great favour of you never to mention the subject again. With thanks for the honour of your note,\nI remain, dear Miss Crawford, &c., &c.\"\nThe conclusion was scarcely intelligible from increasing fright, for she found that Mr. Crawford, under pretence of receiving the note, was coming towards her.\n\"You cannot think I mean to hurry you,\" said he, in an undervoice, perceiving the amazing trepidation with which she made up the note, \"you cannot think I have any such object. Do not hurry yourself, I entreat.\"\n\"Oh! I thank you; I have quite done, just done; it will be ready in a moment; I am very much obliged to you; if you will be so good as to give _that_ to Miss Crawford.\"\nThe note was held out, and must be taken; and as she instantly and with averted eyes walked towards the fireplace, where sat the others, he had nothing to do but to go in good earnest.\nFanny thought she had never known a day of greater agitation, both of pain and pleasure; but happily the pleasure was not of a sort to die with the day; for every day would restore the knowledge of William's advancement, whereas the pain, she hoped, would return no more. She had no doubt that her note must appear excessively ill-written, that the language would disgrace a child, for her distress had allowed no arrangement; but at least it would assure them both of her being neither imposed on nor gratified by Mr. Crawford's attentions.",
        "paragraph_chars": [
            [
                0,
                477
            ],
            [
                477,
                1238
            ],
            [
                1238,
                2212
            ],
            [
                2212,
                2427
            ],
            [
                2427,
                4164
            ],
            [
                4164,
                4390
            ],
            [
                4390,
                7704
            ],
            [
                7704,
                8043
            ],
            [
                8043,
                8717
            ],
            [
                8717,
                9245
            ],
            [
                9245,
                9576
            ],
            [
                9576,
                10433
            ],
            [
                10433,
                10828
            ],
            [
                10828,
                11220
            ],
            [
                11220,
                11786
            ],
            [
                11786,
                11815
            ],
            [
                11815,
                12886
            ],
            [
                12886,
                13064
            ],
            [
                13064,
                13325
            ],
            [
                13325,
                14212
            ],
            [
                14212,
                14341
            ],
            [
                14341,
                14500
            ],
            [
                14500,
                14541
            ],
            [
                14541,
                14652
            ],
            [
                14652,
                15097
            ],
            [
                15097,
                15476
            ],
            [
                15476,
                17117
            ],
            [
                17117,
                17372
            ],
            [
                17372,
                17736
            ],
            [
                17736,
                17866
            ],
            [
                17866,
                18488
            ],
            [
                18488,
                19060
            ],
            [
                19060,
                19100
            ],
            [
                19100,
                19260
            ],
            [
                19260,
                19472
            ],
            [
                19472,
                19641
            ],
            [
                19641,
                19826
            ],
            [
                19826,
                20367
            ]
        ],
        "segment_chars": [
            [
                0,
                115
            ],
            [
                115,
                258
            ],
            [
                258,
                477
            ],
            [
                477,
                834
            ],
            [
                834,
                1008
            ],
            [
                1008,
                1020
            ],
            [
                1020,
                1050
            ],
            [
                1050,
                1134
            ],
            [
                1134,
                1200
            ],
            [
                1200,
                1238
            ],
            [
                1238,
                1295
            ],
            [
                1295,
                1440
            ],
            [
                1440,
                1478
            ],
            [
                1478,
                2212
            ],
            [
                2212,
                2427
            ],
            [
                2427,
                2519
            ],
            [
                2519,
                2567
            ],
            [
                2567,
                2673
            ],
            [
                2673,
                2708
            ],
            [
                2708,
                2787
            ],
            [
                2787,
                2983
            ],
            [
                2983,
                3136
            ],
            [
                3136,
                3564
            ],
            [
                3564,
                3681
            ],
            [
                3681,
                3708
            ],
            [
                3708,
                3820
            ],
            [
                3820,
                3924
            ],
            [
                3924,
                4164
            ],
            [
                4164,
                4204
            ],
            [
                4204,
                4217
            ],
            [
                4217,
                4231
            ],
            [
                4231,
                4252
            ],
            [
                4252,
                4293
            ],
            [
                4293,
                4333
            ],
            [
                4333,
                4361
            ],
            [
                4361,
                4373
            ],
            [
                4373,
                4390
            ],
            [
                4390,
                4526
            ],
            [
                4526,
                4736
            ],
            [
                4736,
                4764
            ],
            [
                4764,
                5472
            ],
            [
                5472,
                5487
            ],
            [
                5487,
                5539
            ],
            [
                5539,
                5566
            ],
            [
                5566,
                5653
            ],
            [
                5653,
                5701
            ],
            [
                5701,
                5733
            ],
            [
                5733,
                5795
            ],
            [
                5795,
                5825
            ],
            [
                5825,
                6037
            ],
            [
                6037,
                6381
            ],
            [
                6381,
                6871
            ],
            [
                6871,
                7202
            ],
            [
                7202,
                7223
            ],
            [
                7223,
                7281
            ],
            [
                7281,
                7297
            ],
            [
                7297,
                7316
            ],
            [
                7316,
                7528
            ],
            [
                7528,
                7555
            ],
            [
                7555,
                7678
            ],
            [
                7678,
                7704
            ],
            [
                7704,
                7718
            ],
            [
                7718,
                7746
            ],
            [
                7746,
                7769
            ],
            [
                7769,
                7789
            ],
            [
                7789,
                7817
            ],
            [
                7817,
                7982
            ],
            [
                7982,
                8016
            ],
            [
                8016,
                8043
            ],
            [
                8043,
                8176
            ],
            [
                8176,
                8402
            ],
            [
                8402,
                8717
            ],
            [
                8717,
                8838
            ],
            [
                8838,
                8864
            ],
            [
                8864,
                8902
            ],
            [
                8902,
                8979
            ],
            [
                8979,
                9121
            ],
            [
                9121,
                9245
            ],
            [
                9245,
                9275
            ],
            [
                9275,
                9331
            ],
            [
                9331,
                9387
            ],
            [
                9387,
                9576
            ],
            [
                9576,
                9981
            ],
            [
                9981,
                10281
            ],
            [
                10281,
                10433
            ],
            [
                10433,
                10657
            ],
            [
                10657,
                10828
            ],
            [
                10828,
                10892
            ],
            [
                10892,
                10934
            ],
            [
                10934,
                11022
            ],
            [
                11022,
                11220
            ],
            [
                11220,
                11513
            ],
            [
                11513,
                11596
            ],
            [
                11596,
                11786
            ],
            [
                11786,
                11815
            ],
            [
                11815,
                12095
            ],
            [
                12095,
                12142
            ],
            [
                12142,
                12245
            ],
            [
                12245,
                12484
            ],
            [
                12484,
                12886
            ],
            [
                12886,
                12917
            ],
            [
                12917,
                13064
            ],
            [
                13064,
                13325
            ],
            [
                13325,
                13428
            ],
            [
                13428,
                13640
            ],
            [
                13640,
                13962
            ],
            [
                13962,
                14212
            ],
            [
                14212,
                14341
            ],
            [
                14341,
                14351
            ],
            [
                14351,
                14381
            ],
            [
                14381,
                14500
            ],
            [
                14500,
                14541
            ],
            [
                14541,
                14652
            ],
            [
                14652,
                14784
            ],
            [
                14784,
                14914
            ],
            [
                14914,
                15097
            ],
            [
                15097,
                15129
            ],
            [
                15129,
                15147
            ],
            [
                15147,
                15228
            ],
            [
                15228,
                15373
            ],
            [
                15373,
                15436
            ],
            [
                15436,
                15476
            ],
            [
                15476,
                15612
            ],
            [
                15612,
                15702
            ],
            [
                15702,
                15825
            ],
            [
                15825,
                16234
            ],
            [
                16234,
                16409
            ],
            [
                16409,
                16452
            ],
            [
                16452,
                16489
            ],
            [
                16489,
                16591
            ],
            [
                16591,
                16679
            ],
            [
                16679,
                16992
            ],
            [
                16992,
                17117
            ],
            [
                17117,
                17181
            ],
            [
                17181,
                17372
            ],
            [
                17372,
                17612
            ],
            [
                17612,
                17635
            ],
            [
                17635,
                17694
            ],
            [
                17694,
                17736
            ],
            [
                17736,
                17745
            ],
            [
                17745,
                17866
            ],
            [
                17866,
                18022
            ],
            [
                18022,
                18144
            ],
            [
                18144,
                18488
            ],
            [
                18488,
                18619
            ],
            [
                18619,
                18778
            ],
            [
                18778,
                18917
            ],
            [
                18917,
                19019
            ],
            [
                19019,
                19060
            ],
            [
                19060,
                19100
            ],
            [
                19100,
                19260
            ],
            [
                19260,
                19437
            ],
            [
                19437,
                19472
            ],
            [
                19472,
                19477
            ],
            [
                19477,
                19641
            ],
            [
                19641,
                19826
            ],
            [
                19826,
                20098
            ],
            [
                20098,
                20367
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                43,
                59
            ],
            [
                113,
                115
            ],
            [
                198,
                209
            ],
            [
                231,
                239
            ],
            [
                147,
                165
            ],
            [
                243,
                257
            ],
            [
                477,
                540
            ],
            [
                572,
                634
            ],
            [
                662,
                663
            ],
            [
                778,
                797
            ],
            [
                708,
                710
            ],
            [
                767,
                776
            ],
            [
                832,
                834
            ],
            [
                834,
                841
            ],
            [
                850,
                924
            ],
            [
                938,
                996
            ],
            [
                1001,
                1008
            ],
            [
                1020,
                1050
            ],
            [
                1050,
                1134
            ],
            [
                1134,
                1172
            ],
            [
                1198,
                1200
            ],
            [
                1200,
                1238
            ],
            [
                1238,
                1259
            ],
            [
                1261,
                1264
            ],
            [
                1295,
                1359
            ],
            [
                1428,
                1440
            ],
            [
                1440,
                1460
            ],
            [
                1476,
                1478
            ],
            [
                1478,
                1529
            ],
            [
                1547,
                1573
            ],
            [
                1604,
                1799
            ],
            [
                1918,
                1919
            ],
            [
                1531,
                1533
            ],
            [
                1804,
                1821
            ],
            [
                1920,
                1940
            ],
            [
                1946,
                1955
            ],
            [
                1882,
                1884
            ],
            [
                1997,
                2029
            ],
            [
                1801,
                1803
            ],
            [
                1574,
                1577
            ],
            [
                2079,
                2089
            ],
            [
                2056,
                2076
            ],
            [
                2090,
                2110
            ],
            [
                2210,
                2212
            ],
            [
                2212,
                2265
            ],
            [
                2309,
                2361
            ],
            [
                2425,
                2427
            ],
            [
                2427,
                2476
            ],
            [
                2492,
                2519
            ],
            [
                2673,
                2697
            ],
            [
                2662,
                2665
            ],
            [
                2706,
                2708
            ],
            [
                2787,
                2835
            ],
            [
                2882,
                2883
            ],
            [
                2908,
                2947
            ],
            [
                2839,
                2842
            ],
            [
                2951,
                2983
            ],
            [
                2983,
                2984
            ],
            [
                2994,
                3051
            ],
            [
                3083,
                3093
            ],
            [
                2989,
                2993
            ],
            [
                3060,
                3062
            ],
            [
                3120,
                3136
            ],
            [
                3136,
                3139
            ],
            [
                3248,
                3271
            ],
            [
                3304,
                3307
            ],
            [
                3213,
                3218
            ],
            [
                3442,
                3478
            ],
            [
                3512,
                3520
            ],
            [
                3541,
                3545
            ],
            [
                3521,
                3540
            ],
            [
                3546,
                3564
            ],
            [
                3564,
                3681
            ],
            [
                3681,
                3708
            ],
            [
                3970,
                3977
            ],
            [
                4057,
                4069
            ],
            [
                4119,
                4141
            ],
            [
                4146,
                4164
            ],
            [
                4164,
                4182
            ],
            [
                4184,
                4188
            ],
            [
                4190,
                4204
            ],
            [
                4204,
                4217
            ],
            [
                4231,
                4252
            ],
            [
                4293,
                4333
            ],
            [
                4333,
                4361
            ],
            [
                4361,
                4373
            ],
            [
                4373,
                4390
            ],
            [
                4390,
                4399
            ],
            [
                4405,
                4413
            ],
            [
                4508,
                4526
            ],
            [
                4526,
                4529
            ],
            [
                4535,
                4628
            ],
            [
                4663,
                4674
            ],
            [
                4645,
                4662
            ],
            [
                4728,
                4731
            ],
            [
                4675,
                4683
            ],
            [
                4693,
                4701
            ],
            [
                4734,
                4736
            ],
            [
                4736,
                4763
            ],
            [
                4979,
                5004
            ],
            [
                4882,
                4883
            ],
            [
                5042,
                5071
            ],
            [
                4975,
                4978
            ],
            [
                5072,
                5091
            ],
            [
                5201,
                5237
            ],
            [
                5249,
                5317
            ],
            [
                5354,
                5368
            ],
            [
                5440,
                5444
            ],
            [
                5369,
                5375
            ],
            [
                5380,
                5391
            ],
            [
                4941,
                4942
            ],
            [
                5433,
                5439
            ],
            [
                5445,
                5465
            ],
            [
                5476,
                5487
            ],
            [
                5487,
                5539
            ],
            [
                5548,
                5566
            ],
            [
                5566,
                5579
            ],
            [
                5615,
                5630
            ],
            [
                5653,
                5700
            ],
            [
                5701,
                5722
            ],
            [
                5731,
                5733
            ],
            [
                5733,
                5795
            ],
            [
                5795,
                5825
            ],
            [
                5825,
                5881
            ],
            [
                5888,
                5890
            ],
            [
                5909,
                6036
            ],
            [
                6037,
                6231
            ],
            [
                6260,
                6266
            ],
            [
                6292,
                6381
            ],
            [
                6381,
                6446
            ],
            [
                6488,
                6489
            ],
            [
                6521,
                6548
            ],
            [
                6563,
                6571
            ],
            [
                6577,
                6582
            ],
            [
                6513,
                6517
            ],
            [
                6586,
                6722
            ],
            [
                6737,
                6748
            ],
            [
                6446,
                6447
            ],
            [
                6767,
                6773
            ],
            [
                6572,
                6576
            ],
            [
                6790,
                6803
            ],
            [
                6869,
                6871
            ],
            [
                6871,
                6966
            ],
            [
                7023,
                7072
            ],
            [
                7079,
                7109
            ],
            [
                7118,
                7202
            ],
            [
                7202,
                7223
            ],
            [
                7223,
                7227
            ],
            [
                7233,
                7248
            ],
            [
                7255,
                7281
            ],
            [
                7281,
                7297
            ],
            [
                7297,
                7315
            ],
            [
                7316,
                7370
            ],
            [
                7392,
                7395
            ],
            [
                7397,
                7404
            ],
            [
                7464,
                7528
            ],
            [
                7528,
                7555
            ],
            [
                7555,
                7617
            ],
            [
                7641,
                7678
            ],
            [
                7678,
                7704
            ],
            [
                7704,
                7718
            ],
            [
                7718,
                7746
            ],
            [
                7746,
                7769
            ],
            [
                7789,
                7817
            ],
            [
                7817,
                7982
            ],
            [
                7982,
                7993
            ],
            [
                7995,
                7998
            ],
            [
                8000,
                8016
            ],
            [
                8016,
                8043
            ],
            [
                8043,
                8046
            ],
            [
                8051,
                8133
            ],
            [
                8153,
                8161
            ],
            [
                8174,
                8176
            ],
            [
                8402,
                8545
            ],
            [
                8555,
                8581
            ],
            [
                8625,
                8664
            ],
            [
                8678,
                8717
            ],
            [
                8717,
                8838
            ],
            [
                8838,
                8864
            ],
            [
                8864,
                8902
            ],
            [
                8902,
                8979
            ],
            [
                8979,
                9072
            ],
            [
                9103,
                9121
            ],
            [
                9121,
                9124
            ],
            [
                9131,
                9134
            ],
            [
                9140,
                9143
            ],
            [
                9144,
                9181
            ],
            [
                9198,
                9203
            ],
            [
                9214,
                9245
            ],
            [
                9245,
                9275
            ],
            [
                9276,
                9280
            ],
            [
                9282,
                9307
            ],
            [
                9329,
                9331
            ],
            [
                9331,
                9352
            ],
            [
                9362,
                9387
            ],
            [
                9387,
                9576
            ],
            [
                9576,
                9594
            ],
            [
                9603,
                9621
            ],
            [
                9660,
                9798
            ],
            [
                9867,
                9870
            ],
            [
                9852,
                9855
            ],
            [
                9802,
                9816
            ],
            [
                9979,
                9981
            ],
            [
                9981,
                10026
            ],
            [
                10060,
                10190
            ],
            [
                10211,
                10281
            ],
            [
                10281,
                10289
            ],
            [
                10292,
                10306
            ],
            [
                10431,
                10433
            ],
            [
                10433,
                10656
            ],
            [
                10828,
                10844
            ],
            [
                10873,
                10890
            ],
            [
                10892,
                10934
            ],
            [
                10934,
                10961
            ],
            [
                11020,
                11022
            ],
            [
                11022,
                11157
            ],
            [
                11187,
                11199
            ],
            [
                11209,
                11220
            ],
            [
                11220,
                11268
            ],
            [
                11378,
                11440
            ],
            [
                11449,
                11513
            ],
            [
                11513,
                11596
            ],
            [
                11596,
                11597
            ],
            [
                11604,
                11619
            ],
            [
                11637,
                11784
            ],
            [
                11786,
                11815
            ],
            [
                11815,
                12054
            ],
            [
                12083,
                12095
            ],
            [
                12099,
                12122
            ],
            [
                12140,
                12142
            ],
            [
                12142,
                12219
            ],
            [
                12234,
                12245
            ],
            [
                12245,
                12334
            ],
            [
                12482,
                12484
            ],
            [
                12538,
                12558
            ],
            [
                12567,
                12684
            ],
            [
                12733,
                12796
            ],
            [
                12704,
                12716
            ],
            [
                12825,
                12840
            ],
            [
                12842,
                12845
            ],
            [
                12847,
                12886
            ],
            [
                12886,
                12915
            ],
            [
                12972,
                12973
            ],
            [
                12927,
                12933
            ],
            [
                12939,
                12972
            ],
            [
                12915,
                12916
            ],
            [
                13064,
                13067
            ],
            [
                13115,
                13123
            ],
            [
                13130,
                13202
            ],
            [
                13249,
                13325
            ],
            [
                13325,
                13343
            ],
            [
                13352,
                13403
            ],
            [
                13426,
                13428
            ],
            [
                13428,
                13429
            ],
            [
                13430,
                13433
            ],
            [
                13435,
                13521
            ],
            [
                13572,
                13619
            ],
            [
                13621,
                13624
            ],
            [
                13626,
                13640
            ],
            [
                13640,
                13684
            ],
            [
                13822,
                13831
            ],
            [
                13839,
                13851
            ],
            [
                13698,
                13708
            ],
            [
                13897,
                13915
            ],
            [
                13920,
                13960
            ],
            [
                14212,
                14317
            ],
            [
                14319,
                14320
            ],
            [
                14322,
                14341
            ],
            [
                14341,
                14351
            ],
            [
                14351,
                14381
            ],
            [
                14381,
                14445
            ],
            [
                14497,
                14500
            ],
            [
                14500,
                14541
            ],
            [
                14541,
                14614
            ],
            [
                14637,
                14652
            ],
            [
                14652,
                14784
            ],
            [
                14914,
                14918
            ],
            [
                14956,
                14960
            ],
            [
                14928,
                14955
            ],
            [
                14991,
                15016
            ],
            [
                15023,
                15078
            ],
            [
                14980,
                14981
            ],
            [
                15083,
                15097
            ],
            [
                15097,
                15129
            ],
            [
                15129,
                15147
            ],
            [
                15147,
                15228
            ],
            [
                15228,
                15297
            ],
            [
                15371,
                15373
            ],
            [
                15373,
                15389
            ],
            [
                15408,
                15409
            ],
            [
                15410,
                15436
            ],
            [
                15436,
                15476
            ],
            [
                15476,
                15492
            ],
            [
                15534,
                15612
            ],
            [
                15622,
                15632
            ],
            [
                15618,
                15621
            ],
            [
                15647,
                15654
            ],
            [
                15656,
                15675
            ],
            [
                15700,
                15702
            ],
            [
                15825,
                15834
            ],
            [
                15836,
                15839
            ],
            [
                15841,
                15845
            ],
            [
                15876,
                15889
            ],
            [
                15908,
                16033
            ],
            [
                16080,
                16093
            ],
            [
                16107,
                16155
            ],
            [
                15902,
                15903
            ],
            [
                16157,
                16234
            ],
            [
                16234,
                16237
            ],
            [
                16251,
                16256
            ],
            [
                16277,
                16301
            ],
            [
                16311,
                16340
            ],
            [
                16347,
                16369
            ],
            [
                16375,
                16382
            ],
            [
                16390,
                16409
            ],
            [
                16576,
                16578
            ],
            [
                16509,
                16517
            ],
            [
                16589,
                16591
            ],
            [
                16591,
                16679
            ],
            [
                16679,
                16727
            ],
            [
                16748,
                16782
            ],
            [
                16990,
                16991
            ],
            [
                17117,
                17181
            ],
            [
                17181,
                17231
            ],
            [
                17244,
                17269
            ],
            [
                17297,
                17372
            ],
            [
                17372,
                17379
            ],
            [
                17452,
                17487
            ],
            [
                17533,
                17564
            ],
            [
                17575,
                17612
            ],
            [
                17612,
                17635
            ],
            [
                17635,
                17694
            ],
            [
                17694,
                17736
            ],
            [
                17736,
                17745
            ],
            [
                17745,
                17779
            ],
            [
                17780,
                17785
            ],
            [
                17814,
                17817
            ],
            [
                17821,
                17866
            ],
            [
                17866,
                17874
            ],
            [
                17887,
                17900
            ],
            [
                17953,
                17969
            ],
            [
                17931,
                17938
            ],
            [
                17970,
                18022
            ],
            [
                18022,
                18144
            ],
            [
                18290,
                18307
            ],
            [
                18318,
                18330
            ],
            [
                18370,
                18488
            ],
            [
                18488,
                18619
            ],
            [
                18619,
                18778
            ],
            [
                18778,
                18917
            ],
            [
                18917,
                19019
            ],
            [
                19019,
                19059
            ],
            [
                19060,
                19089
            ],
            [
                19092,
                19094
            ],
            [
                19097,
                19100
            ],
            [
                19100,
                19196
            ],
            [
                19236,
                19260
            ],
            [
                19260,
                19261
            ],
            [
                19278,
                19279
            ],
            [
                19280,
                19325
            ],
            [
                19435,
                19436
            ],
            [
                19472,
                19477
            ],
            [
                19477,
                19488
            ],
            [
                19518,
                19572
            ],
            [
                19579,
                19614
            ],
            [
                19616,
                19620
            ],
            [
                19622,
                19641
            ],
            [
                19641,
                19755
            ],
            [
                19778,
                19808
            ],
            [
                19824,
                19826
            ],
            [
                19826,
                19978
            ],
            [
                20047,
                20098
            ],
            [
                20098,
                20206
            ],
            [
                20251,
                20367
            ]
        ],
        "row_chars": [
            [
                0,
                115
            ],
            [
                115,
                258
            ],
            [
                258,
                477
            ],
            [
                477,
                834
            ],
            [
                834,
                1008
            ],
            [
                1008,
                1020
            ],
            [
                1020,
                1050
            ],
            [
                1050,
                1134
            ],
            [
                1134,
                1200
            ],
            [
                1200,
                1238
            ],
            [
                1238,
                1440
            ],
            [
                1440,
                1478
            ],
            [
                1478,
                2212
            ],
            [
                2212,
                2427
            ],
            [
                2427,
                2519
            ],
            [
                2519,
                2567
            ],
            [
                2567,
                2708
            ],
            [
                2708,
                2787
            ],
            [
                2787,
                2983
            ],
            [
                2983,
                3136
            ],
            [
                3136,
                3564
            ],
            [
                3564,
                3681
            ],
            [
                3681,
                3708
            ],
            [
                3708,
                3820
            ],
            [
                3820,
                3924
            ],
            [
                3924,
                4164
            ],
            [
                4164,
                4204
            ],
            [
                4204,
                4217
            ],
            [
                4217,
                4231
            ],
            [
                4231,
                4252
            ],
            [
                4252,
                4293
            ],
            [
                4293,
                4333
            ],
            [
                4333,
                4361
            ],
            [
                4361,
                4373
            ],
            [
                4373,
                4390
            ],
            [
                4390,
                4526
            ],
            [
                4526,
                4736
            ],
            [
                4736,
                4764
            ],
            [
                4764,
                5487
            ],
            [
                5487,
                5539
            ],
            [
                5539,
                5566
            ],
            [
                5566,
                5701
            ],
            [
                5701,
                5733
            ],
            [
                5733,
                5795
            ],
            [
                5795,
                5825
            ],
            [
                5825,
                6037
            ],
            [
                6037,
                6381
            ],
            [
                6381,
                6871
            ],
            [
                6871,
                7202
            ],
            [
                7202,
                7223
            ],
            [
                7223,
                7281
            ],
            [
                7281,
                7297
            ],
            [
                7297,
                7316
            ],
            [
                7316,
                7528
            ],
            [
                7528,
                7555
            ],
            [
                7555,
                7678
            ],
            [
                7678,
                7704
            ],
            [
                7704,
                7718
            ],
            [
                7718,
                7746
            ],
            [
                7746,
                7769
            ],
            [
                7769,
                7789
            ],
            [
                7789,
                7817
            ],
            [
                7817,
                7982
            ],
            [
                7982,
                8016
            ],
            [
                8016,
                8043
            ],
            [
                8043,
                8176
            ],
            [
                8176,
                8402
            ],
            [
                8402,
                8717
            ],
            [
                8717,
                8838
            ],
            [
                8838,
                8864
            ],
            [
                8864,
                8902
            ],
            [
                8902,
                8979
            ],
            [
                8979,
                9121
            ],
            [
                9121,
                9245
            ],
            [
                9245,
                9275
            ],
            [
                9275,
                9331
            ],
            [
                9331,
                9387
            ],
            [
                9387,
                9576
            ],
            [
                9576,
                9981
            ],
            [
                9981,
                10281
            ],
            [
                10281,
                10433
            ],
            [
                10433,
                10657
            ],
            [
                10657,
                10828
            ],
            [
                10828,
                10934
            ],
            [
                10934,
                11022
            ],
            [
                11022,
                11220
            ],
            [
                11220,
                11513
            ],
            [
                11513,
                11596
            ],
            [
                11596,
                11815
            ],
            [
                11815,
                12095
            ],
            [
                12095,
                12142
            ],
            [
                12142,
                12245
            ],
            [
                12245,
                12484
            ],
            [
                12484,
                12886
            ],
            [
                12886,
                13064
            ],
            [
                13064,
                13325
            ],
            [
                13325,
                13428
            ],
            [
                13428,
                13640
            ],
            [
                13640,
                13962
            ],
            [
                13962,
                14212
            ],
            [
                14212,
                14341
            ],
            [
                14341,
                14351
            ],
            [
                14351,
                14381
            ],
            [
                14381,
                14500
            ],
            [
                14500,
                14541
            ],
            [
                14541,
                14652
            ],
            [
                14652,
                14784
            ],
            [
                14784,
                14914
            ],
            [
                14914,
                15097
            ],
            [
                15097,
                15129
            ],
            [
                15129,
                15147
            ],
            [
                15147,
                15228
            ],
            [
                15228,
                15373
            ],
            [
                15373,
                15436
            ],
            [
                15436,
                15476
            ],
            [
                15476,
                15612
            ],
            [
                15612,
                15702
            ],
            [
                15702,
                15825
            ],
            [
                15825,
                16234
            ],
            [
                16234,
                16409
            ],
            [
                16409,
                16452
            ],
            [
                16452,
                16489
            ],
            [
                16489,
                16591
            ],
            [
                16591,
                16679
            ],
            [
                16679,
                16992
            ],
            [
                16992,
                17117
            ],
            [
                17117,
                17181
            ],
            [
                17181,
                17372
            ],
            [
                17372,
                17612
            ],
            [
                17612,
                17635
            ],
            [
                17635,
                17694
            ],
            [
                17694,
                17736
            ],
            [
                17736,
                17745
            ],
            [
                17745,
                17866
            ],
            [
                17866,
                18022
            ],
            [
                18022,
                18144
            ],
            [
                18144,
                18488
            ],
            [
                18488,
                18619
            ],
            [
                18619,
                18778
            ],
            [
                18778,
                18917
            ],
            [
                18917,
                19019
            ],
            [
                19019,
                19100
            ],
            [
                19100,
                19260
            ],
            [
                19260,
                19437
            ],
            [
                19437,
                19472
            ],
            [
                19472,
                19477
            ],
            [
                19477,
                19641
            ],
            [
                19641,
                19826
            ],
            [
                19826,
                20098
            ],
            [
                20098,
                20367
            ]
        ]
    },
    "abridged": {
        "text": "Henry Crawford was at Mansfield Park again early the next morning. Lady Bertram was quitting the breakfast-room as he entered.\nHenry, overjoyed to have her go, bowed and watched her off, and then turned instantly to Fanny, and, taking out some letters, said, \"I have been wishing to see you alone. Knowing what your feelings as a sister are, I could hardly have borne that any one should share with you in the first knowledge of the news I bring. Your brother is a lieutenant. I have the infinite satisfaction of congratulating you on your brother's promotion. Here are the letters which announce it. You will, perhaps, like to see them.\"\nFanny could not speak; but for him to see the expression of her eyes, the change of her complexion, was enough. She took the letters. The first was from the Admiral to inform his nephew of his having succeeded in the promotion of young Price, and enclosing two more, one from the Secretary of the First Lord to a friend, whom the Admiral had set to work in the business, the other from that friend to himself; in which it appeared that Sir Charles was delighted to prove his regard for Admiral Crawford, by the commission of Mr. William Price as Second Lieutenant.\nWhile her hand was trembling under these letters, her heart swelling with emotion, Crawford thus continued eagerly-\n\"I will not talk of my own happiness,\" said he, \"for I think only of yours. I have not lost a moment in bringing the news. How impatient, how anxious, how wild I have been; how cruelly disappointed, in not having the business finished while I was in London! I stayed there from day to day in the hope of it, for nothing less would have kept me from Mansfield. But there were difficulties and delays, and I came away on Monday, trusting that I should very soon be followed by such letters as these. My uncle, who is the very best man in the world, has exerted himself, as I knew he would, after seeing your brother. He was delighted with him. He gave William the highest commendation after the evening they passed together.\"\n\"Has this been all your doing, then?\" cried Fanny. \"How very, very kind! I beg your pardon, but I am bewildered. Did Admiral Crawford apply? How was it? I am stupefied.\"\nHenry was happy to explain what he had done. His journey to London had been undertaken with no other view than that of introducing her brother to the Admiral and prevailing on him to exert his interest. This had been his business.\nHe spoke with such a glow, used such strong expressions, and was so abounding in twofold motives, that Fanny could not have remained unaware of his drift, had she been able to attend; but her heart was so full that she could only listen imperfectly, saying when he paused, \"How very kind! Oh, Mr. Crawford, we are infinitely obliged to you! Dearest William!\" She jumped up, crying out, \"My uncle ought to know it as soon as possible.\"\nBut this could not be allowed. The opportunity was too fair, and his feelings too impatient. He was after her immediately. \"She must not go, she must allow him five minutes longer.\" He led her back to her seat, and was in the middle of his farther explanation, before she had suspected for what she was detained.\nWhen she did understand it, however, and found herself expected to believe that she had created sensations which his heart had never known before, and that everything he had done for William was because of his attachment to her, she was exceedingly distressed, and for some moments unable to speak. She considered it all as nonsense, as mere trifling and gallantry; he was treating her improperly, and in a way that she had not deserved; but it was like himself, and entirely of a piece with what she had seen before; and she would not allow herself to show displeasure, after he had conferred such an obligation. While her heart was still bounding with joy and gratitude on William's behalf, she could not be severe; and after having twice drawn back her hand, and attempted in vain to turn away, she got up, and said only, with much agitation, \"Don't, Mr. Crawford, pray don't! I beg you would not. This sort of talking is very unpleasant to me. I must go away. I cannot bear it.\"\nBut he was still talking on, describing his affection, and finally offering himself, hand, fortune, everything, to her acceptance. It was so; he had said it. Her astonishment and confusion increased; and though still not supposing him serious, she could hardly stand. He pressed for an answer.\n\"No, no, no!\" she cried, hiding her face. \"This is all nonsense. I can hear no more of this. Your kindness to William makes me more obliged to you than words can express; but I do not want, I cannot bear, I must not listen to such-No, no, don't think of me. But you are not thinking of me. I know it is all nothing.\"\nShe burst away from him, and at that moment Sir Thomas was heard speaking to a servant just outside the room. She rushed out at an opposite door from the one her uncle was approaching, and was walking up and down the East room in the utmost confusion of feeling, before Sir Thomas had reached the beginning of the joyful news which his visitor came to communicate.\nShe was feeling, thinking, trembling about everything; agitated, happy, miserable, infinitely obliged, absolutely angry. It was all beyond belief! He was inexcusable, incomprehensible! But such were his habits that he could do nothing without a mixture of evil. He had previously made her the happiest of human beings, and now he had insulted-she knew not how to regard it. She did not want him to be serious, and yet what could excuse his words, if they meant but to trifle?\nBut William was a lieutenant. That was a fact beyond a doubt. She would think of it and forget all the rest. Mr. Crawford would certainly never address her so again: he must have seen how unwelcome it was to her; and in that case, how gratefully she could esteem him for his friendship to William!\nShe would not stir from the East room till she had satisfied herself of Mr. Crawford's having left the house; but when convinced of his being gone, she was eager to go down and share her joy with her uncle. Sir Thomas was as joyful as she could desire, and she had so comfortable a talk with him about William as to make her feel as if nothing had occurred to vex her, till she found that Mr. Crawford was engaged to return and dine there that very day. This was most unwelcome.\nShe tried to get the better of it; tried very hard, as the dinner hour approached, to feel and appear as usual; but it was quite impossible for her not to look most shy and uncomfortable when their visitor entered the room.\nMr. Crawford was soon close to her; he had a note to deliver from his sister. Fanny could not look at him. She opened her note immediately, glad to have anything to do, and happy, as she read it, to feel that the fidgetings of her aunt Norris screened her from view.\n\"My dear Fanny,-for so I may now always call you-I cannot let my brother go without sending you a few lines of congratulation, and giving my most joyful consent and approval. Go on, my dear Fanny, and without fear; there can be no difficulties worth naming. I choose to suppose that my consent will be something; so you may smile upon him with your sweetest smiles this afternoon, and send him back to me even happier than he goes.-Yours affectionately, M. C.\"\nThese were not expressions to do Fanny any good; for though she read in too much haste and confusion to form the clearest judgment of Miss Crawford's meaning, it was evident that she meant to compliment her on her brother's attachment, and believed it serious. Fanny did not know what to do. There was wretchedness in the idea of its being serious; there was perplexity every way. She was distressed whenever Mr. Crawford spoke to her, and he spoke to her much too often. She could hardly eat; and when Sir Thomas good-humouredly observed that joy had taken away her appetite, she was ready to sink with shame; for though nothing could have tempted her to turn her eyes to Mr. Crawford, she felt that his were immediately directed towards her.\nShe was more silent than ever, hardly joining even when William was the subject. She began to despair of ever getting away; but at last they were in the drawing-room, where her aunts finished the subject of William's appointment in their own style.\nMrs. Norris seemed delighted with the saving it would be to Sir Thomas. \"Now William would be able to keep himself, which would make a vast difference to his uncle; and, indeed, it would make some difference in her presents too. She was very glad that she had given William something considerable at parting, for now it would be useful in helping to fit up his cabin.\"\n\"I am glad you gave him something considerable,\" said Lady Bertram, with most unsuspicious calmness, \"for I gave him only 10.\"\n\"Indeed!\" cried Mrs. Norris, reddening. \"Upon my word, he must have gone off with his pockets well lined!\"\n\"Sir Thomas told me 10 would be enough.\"\nMrs. Norris, being not at all inclined to question its sufficiency, began on another point.\n\"It is amazing,\" said she, \"how much young people cost their friends, what with bringing them up and putting them out in the world! Now, take my sister Price's children; nobody would believe what they cost Sir Thomas every year, to say nothing of what I do for them.\"\n\"Very true, sister, as you say. But, poor things! they cannot help it; and you know it makes very little difference to Sir Thomas. Fanny, William must not forget my shawl if he goes to the East Indies. I wish he may go there, so that I may have my shawl. I think I will have two shawls, Fanny.\"\nFanny, meanwhile, was very earnestly trying to understand what Mr. and Miss Crawford were at. Everything reasonable was against their being serious. How could she have attached a man who had been admired by so many, and flirted with so many, infinitely her superiors; who seemed so little open to serious impressions; who thought so carelessly, so unfeelingly on all such points, who was everything to everybody, and seemed to find no one essential to him? And could his sister, with all her worldly notions of matrimony, be forwarding anything serious in such a quarter? It was not possible. She had quite convinced herself of this before Sir Thomas and Mr. Crawford joined them. The difficulty was in maintaining the conviction after Mr. Crawford was in the room.\nShe thought he was wishing to speak to her unheard by the rest. She fancied he was trying for it the whole evening, whenever Sir Thomas was engaged with Mrs. Norris, and she carefully refused him every opportunity.\nAt last he began to talk of going away; but turning to her the next moment, he said, \"Have you nothing to send to Mary? No answer to her note? She will be disappointed if she receives nothing from you. Pray write to her, if it be only a line.\"\n\"Oh yes! certainly,\" cried Fanny, rising in embarrassed haste and wanting to get away-\"I will write directly.\"\nShe went to the table, and prepared her writing materials without knowing what in the world to say. She had read Miss Crawford's note only once, and how to reply to anything so imperfectly understood was most distressing. Yet something must be written; and wishing not to appear to think anything really intended, she wrote thus, in great trembling both of spirits and hand-\n\"I am very much obliged to you, my dear Miss Crawford, for your kind congratulations, as far as they relate to my dearest William. The rest of your note I know means nothing; but I am so unequal to anything of the sort, that I hope you will excuse my begging you to take no farther notice. I have seen too much of Mr. Crawford not to understand his manners; if he understood me as well, he would, I dare say, behave differently. I do not know what I write, but it would be a great favour of you never to mention the subject again. With thanks for the honour of your note, I remain, dear Miss Crawford, etc., etc.\"\nThe conclusion was scarcely intelligible from increasing fright, for she found that Mr. Crawford was coming towards her.\n\"I do not mean to hurry you,\" said he, in an undervoice.\n\"Oh! I thank you; it will be ready in a moment; I am very much obliged; if you will be so good as to give that to Miss Crawford.\"\nThe note was held out, and must be taken; and as she instantly and with averted eyes walked towards the fireplace, he had nothing to do but to go.\nFanny thought she had never known a day of greater agitation, both of pain and pleasure; but happily the pleasure was not of a sort to die with the day; whereas the pain, she hoped, would return no more. She had no doubt that her note must appear excessively ill-written, that the language would disgrace a child; but at least it would assure them both of her being neither imposed on nor gratified by Mr. Crawford's attentions.",
        "paragraph_chars": [
            [
                0,
                127
            ],
            [
                127,
                639
            ],
            [
                639,
                1204
            ],
            [
                1204,
                1320
            ],
            [
                1320,
                2044
            ],
            [
                2044,
                2214
            ],
            [
                2214,
                2445
            ],
            [
                2445,
                2880
            ],
            [
                2880,
                3193
            ],
            [
                3193,
                4176
            ],
            [
                4176,
                4470
            ],
            [
                4470,
                4787
            ],
            [
                4787,
                5152
            ],
            [
                5152,
                5628
            ],
            [
                5628,
                5926
            ],
            [
                5926,
                6405
            ],
            [
                6405,
                6629
            ],
            [
                6629,
                6896
            ],
            [
                6896,
                7357
            ],
            [
                7357,
                8101
            ],
            [
                8101,
                8350
            ],
            [
                8350,
                8719
            ],
            [
                8719,
                8846
            ],
            [
                8846,
                8953
            ],
            [
                8953,
                8994
            ],
            [
                8994,
                9086
            ],
            [
                9086,
                9354
            ],
            [
                9354,
                9649
            ],
            [
                9649,
                10415
            ],
            [
                10415,
                10630
            ],
            [
                10630,
                10874
            ],
            [
                10874,
                10985
            ],
            [
                10985,
                11360
            ],
            [
                11360,
                11974
            ],
            [
                11974,
                12095
            ],
            [
                12095,
                12152
            ],
            [
                12152,
                12282
            ],
            [
                12282,
                12429
            ],
            [
                12429,
                12857
            ]
        ],
        "segment_chars": [
            [
                0,
                67
            ],
            [
                67,
                127
            ],
            [
                127,
                298
            ],
            [
                298,
                447
            ],
            [
                447,
                477
            ],
            [
                477,
                561
            ],
            [
                561,
                601
            ],
            [
                601,
                639
            ],
            [
                639,
                751
            ],
            [
                751,
                773
            ],
            [
                773,
                1204
            ],
            [
                1204,
                1320
            ],
            [
                1320,
                1396
            ],
            [
                1396,
                1443
            ],
            [
                1443,
                1578
            ],
            [
                1578,
                1680
            ],
            [
                1680,
                1818
            ],
            [
                1818,
                1935
            ],
            [
                1935,
                1962
            ],
            [
                1962,
                2044
            ],
            [
                2044,
                2082
            ],
            [
                2082,
                2095
            ],
            [
                2095,
                2117
            ],
            [
                2117,
                2157
            ],
            [
                2157,
                2185
            ],
            [
                2185,
                2197
            ],
            [
                2197,
                2214
            ],
            [
                2214,
                2259
            ],
            [
                2259,
                2417
            ],
            [
                2417,
                2445
            ],
            [
                2445,
                2734
            ],
            [
                2734,
                2786
            ],
            [
                2786,
                2804
            ],
            [
                2804,
                2880
            ],
            [
                2880,
                2911
            ],
            [
                2911,
                2973
            ],
            [
                2973,
                3003
            ],
            [
                3003,
                3062
            ],
            [
                3062,
                3193
            ],
            [
                3193,
                3492
            ],
            [
                3492,
                3807
            ],
            [
                3807,
                4073
            ],
            [
                4073,
                4094
            ],
            [
                4094,
                4141
            ],
            [
                4141,
                4157
            ],
            [
                4157,
                4176
            ],
            [
                4176,
                4307
            ],
            [
                4307,
                4334
            ],
            [
                4334,
                4444
            ],
            [
                4444,
                4470
            ],
            [
                4470,
                4484
            ],
            [
                4484,
                4512
            ],
            [
                4512,
                4535
            ],
            [
                4535,
                4563
            ],
            [
                4563,
                4728
            ],
            [
                4728,
                4760
            ],
            [
                4760,
                4787
            ],
            [
                4787,
                4897
            ],
            [
                4897,
                5152
            ],
            [
                5152,
                5273
            ],
            [
                5273,
                5299
            ],
            [
                5299,
                5337
            ],
            [
                5337,
                5414
            ],
            [
                5414,
                5526
            ],
            [
                5526,
                5628
            ],
            [
                5628,
                5658
            ],
            [
                5658,
                5690
            ],
            [
                5690,
                5737
            ],
            [
                5737,
                5926
            ],
            [
                5926,
                6133
            ],
            [
                6133,
                6380
            ],
            [
                6380,
                6405
            ],
            [
                6405,
                6629
            ],
            [
                6629,
                6707
            ],
            [
                6707,
                6736
            ],
            [
                6736,
                6896
            ],
            [
                6896,
                7071
            ],
            [
                7071,
                7154
            ],
            [
                7154,
                7357
            ],
            [
                7357,
                7618
            ],
            [
                7618,
                7649
            ],
            [
                7649,
                7738
            ],
            [
                7738,
                7829
            ],
            [
                7829,
                8101
            ],
            [
                8101,
                8182
            ],
            [
                8182,
                8350
            ],
            [
                8350,
                8422
            ],
            [
                8422,
                8579
            ],
            [
                8579,
                8719
            ],
            [
                8719,
                8846
            ],
            [
                8846,
                8856
            ],
            [
                8856,
                8886
            ],
            [
                8886,
                8953
            ],
            [
                8953,
                8994
            ],
            [
                8994,
                9086
            ],
            [
                9086,
                9218
            ],
            [
                9218,
                9354
            ],
            [
                9354,
                9386
            ],
            [
                9386,
                9404
            ],
            [
                9404,
                9485
            ],
            [
                9485,
                9556
            ],
            [
                9556,
                9609
            ],
            [
                9609,
                9649
            ],
            [
                9649,
                9743
            ],
            [
                9743,
                9798
            ],
            [
                9798,
                10106
            ],
            [
                10106,
                10221
            ],
            [
                10221,
                10242
            ],
            [
                10242,
                10330
            ],
            [
                10330,
                10415
            ],
            [
                10415,
                10479
            ],
            [
                10479,
                10630
            ],
            [
                10630,
                10750
            ],
            [
                10750,
                10773
            ],
            [
                10773,
                10832
            ],
            [
                10832,
                10874
            ],
            [
                10874,
                10883
            ],
            [
                10883,
                10985
            ],
            [
                10985,
                11085
            ],
            [
                11085,
                11207
            ],
            [
                11207,
                11360
            ],
            [
                11360,
                11491
            ],
            [
                11491,
                11650
            ],
            [
                11650,
                11789
            ],
            [
                11789,
                11891
            ],
            [
                11891,
                11974
            ],
            [
                11974,
                12095
            ],
            [
                12095,
                12152
            ],
            [
                12152,
                12157
            ],
            [
                12157,
                12282
            ],
            [
                12282,
                12429
            ],
            [
                12429,
                12633
            ],
            [
                12633,
                12857
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                49,
                65
            ],
            [
                65,
                67
            ],
            [
                72,
                83
            ],
            [
                84,
                92
            ],
            [
                93,
                111
            ],
            [
                112,
                126
            ],
            [
                127,
                190
            ],
            [
                196,
                258
            ],
            [
                259,
                260
            ],
            [
                260,
                279
            ],
            [
                280,
                282
            ],
            [
                287,
                296
            ],
            [
                296,
                298
            ],
            [
                298,
                305
            ],
            [
                306,
                380
            ],
            [
                381,
                439
            ],
            [
                440,
                447
            ],
            [
                447,
                477
            ],
            [
                477,
                561
            ],
            [
                561,
                599
            ],
            [
                599,
                601
            ],
            [
                601,
                639
            ],
            [
                639,
                660
            ],
            [
                662,
                665
            ],
            [
                674,
                738
            ],
            [
                739,
                751
            ],
            [
                751,
                771
            ],
            [
                771,
                773
            ],
            [
                773,
                824
            ],
            [
                825,
                851
            ],
            [
                852,
                1047
            ],
            [
                1047,
                1048
            ],
            [
                1049,
                1051
            ],
            [
                1052,
                1069
            ],
            [
                1070,
                1090
            ],
            [
                1091,
                1100
            ],
            [
                1101,
                1103
            ],
            [
                1110,
                1142
            ],
            [
                1143,
                1145
            ],
            [
                1146,
                1149
            ],
            [
                1150,
                1160
            ],
            [
                1161,
                1181
            ],
            [
                1182,
                1202
            ],
            [
                1202,
                1204
            ],
            [
                1204,
                1257
            ],
            [
                1258,
                1310
            ],
            [
                1318,
                1320
            ],
            [
                1320,
                1369
            ],
            [
                1369,
                1396
            ],
            [
                1396,
                1420
            ],
            [
                1433,
                1436
            ],
            [
                1441,
                1443
            ],
            [
                1443,
                1491
            ],
            [
                1491,
                1492
            ],
            [
                1493,
                1532
            ],
            [
                1533,
                1536
            ],
            [
                1546,
                1578
            ],
            [
                1578,
                1579
            ],
            [
                1587,
                1644
            ],
            [
                1645,
                1655
            ],
            [
                1656,
                1660
            ],
            [
                1661,
                1663
            ],
            [
                1664,
                1680
            ],
            [
                1680,
                1683
            ],
            [
                1684,
                1707
            ],
            [
                1708,
                1711
            ],
            [
                1718,
                1723
            ],
            [
                1724,
                1760
            ],
            [
                1761,
                1769
            ],
            [
                1770,
                1774
            ],
            [
                1780,
                1799
            ],
            [
                1800,
                1818
            ],
            [
                1818,
                1935
            ],
            [
                1935,
                1962
            ],
            [
                1970,
                1977
            ],
            [
                1990,
                2002
            ],
            [
                2003,
                2025
            ],
            [
                2026,
                2044
            ],
            [
                2044,
                2062
            ],
            [
                2063,
                2067
            ],
            [
                2068,
                2082
            ],
            [
                2082,
                2095
            ],
            [
                2096,
                2117
            ],
            [
                2117,
                2157
            ],
            [
                2157,
                2185
            ],
            [
                2185,
                2197
            ],
            [
                2197,
                2214
            ],
            [
                2214,
                2223
            ],
            [
                2224,
                2232
            ],
            [
                2241,
                2259
            ],
            [
                2259,
                2262
            ],
            [
                2263,
                2356
            ],
            [
                2360,
                2371
            ],
            [
                2372,
                2389
            ],
            [
                2390,
                2393
            ],
            [
                2394,
                2402
            ],
            [
                2407,
                2415
            ],
            [
                2415,
                2417
            ],
            [
                2417,
                2444
            ],
            [
                2445,
                2470
            ],
            [
                2470,
                2471
            ],
            [
                2472,
                2501
            ],
            [
                2502,
                2505
            ],
            [
                2506,
                2525
            ],
            [
                2541,
                2577
            ],
            [
                2586,
                2654
            ],
            [
                2655,
                2669
            ],
            [
                2670,
                2674
            ],
            [
                2675,
                2681
            ],
            [
                2682,
                2693
            ],
            [
                2693,
                2694
            ],
            [
                2695,
                2701
            ],
            [
                2702,
                2722
            ],
            [
                2723,
                2734
            ],
            [
                2734,
                2786
            ],
            [
                2786,
                2804
            ],
            [
                2804,
                2817
            ],
            [
                2817,
                2832
            ],
            [
                2832,
                2879
            ],
            [
                2880,
                2901
            ],
            [
                2909,
                2911
            ],
            [
                2911,
                2973
            ],
            [
                2973,
                3003
            ],
            [
                3003,
                3059
            ],
            [
                3062,
                3064
            ],
            [
                3065,
                3192
            ],
            [
                3193,
                3387
            ],
            [
                3396,
                3402
            ],
            [
                3403,
                3492
            ],
            [
                3492,
                3557
            ],
            [
                3557,
                3558
            ],
            [
                3562,
                3589
            ],
            [
                3589,
                3597
            ],
            [
                3598,
                3603
            ],
            [
                3604,
                3608
            ],
            [
                3609,
                3745
            ],
            [
                3751,
                3762
            ],
            [
                3762,
                3763
            ],
            [
                3770,
                3776
            ],
            [
                3787,
                3791
            ],
            [
                3792,
                3805
            ],
            [
                3805,
                3807
            ],
            [
                3807,
                3902
            ],
            [
                3909,
                3958
            ],
            [
                3959,
                3989
            ],
            [
                3989,
                4073
            ],
            [
                4073,
                4094
            ],
            [
                4094,
                4098
            ],
            [
                4099,
                4114
            ],
            [
                4115,
                4141
            ],
            [
                4141,
                4157
            ],
            [
                4157,
                4175
            ],
            [
                4176,
                4230
            ],
            [
                4231,
                4234
            ],
            [
                4235,
                4242
            ],
            [
                4243,
                4307
            ],
            [
                4307,
                4334
            ],
            [
                4334,
                4396
            ],
            [
                4407,
                4444
            ],
            [
                4444,
                4470
            ],
            [
                4470,
                4484
            ],
            [
                4484,
                4512
            ],
            [
                4512,
                4535
            ],
            [
                4535,
                4563
            ],
            [
                4563,
                4728
            ],
            [
                4728,
                4739
            ],
            [
                4740,
                4743
            ],
            [
                4744,
                4760
            ],
            [
                4760,
                4787
            ],
            [
                4787,
                4790
            ],
            [
                4791,
                4873
            ],
            [
                4887,
                4895
            ],
            [
                4895,
                4897
            ],
            [
                4897,
                5040
            ],
            [
                5041,
                5067
            ],
            [
                5068,
                5107
            ],
            [
                5113,
                5152
            ],
            [
                5152,
                5273
            ],
            [
                5273,
                5299
            ],
            [
                5299,
                5337
            ],
            [
                5337,
                5414
            ],
            [
                5414,
                5507
            ],
            [
                5508,
                5526
            ],
            [
                5526,
                5529
            ],
            [
                5534,
                5537
            ],
            [
                5543,
                5546
            ],
            [
                5550,
                5587
            ],
            [
                5592,
                5597
            ],
            [
                5597,
                5628
            ],
            [
                5628,
                5658
            ],
            [
                5658,
                5662
            ],
            [
                5663,
                5688
            ],
            [
                5688,
                5690
            ],
            [
                5690,
                5711
            ],
            [
                5712,
                5737
            ],
            [
                5737,
                5926
            ],
            [
                5926,
                5944
            ],
            [
                5945,
                5963
            ],
            [
                5964,
                6102
            ],
            [
                6109,
                6112
            ],
            [
                6113,
                6116
            ],
            [
                6117,
                6131
            ],
            [
                6131,
                6133
            ],
            [
                6133,
                6178
            ],
            [
                6179,
                6309
            ],
            [
                6310,
                6380
            ],
            [
                6380,
                6388
            ],
            [
                6389,
                6403
            ],
            [
                6403,
                6405
            ],
            [
                6405,
                6628
            ],
            [
                6629,
                6645
            ],
            [
                6646,
                6663
            ],
            [
                6665,
                6707
            ],
            [
                6707,
                6734
            ],
            [
                6734,
                6736
            ],
            [
                6736,
                6871
            ],
            [
                6872,
                6884
            ],
            [
                6885,
                6896
            ],
            [
                6896,
                6944
            ],
            [
                6944,
                7006
            ],
            [
                7007,
                7071
            ],
            [
                7071,
                7154
            ],
            [
                7154,
                7155
            ],
            [
                7163,
                7178
            ],
            [
                7179,
                7326
            ],
            [
                7328,
                7357
            ],
            [
                7357,
                7596
            ],
            [
                7606,
                7618
            ],
            [
                7624,
                7647
            ],
            [
                7647,
                7649
            ],
            [
                7649,
                7726
            ],
            [
                7727,
                7738
            ],
            [
                7738,
                7827
            ],
            [
                7827,
                7829
            ],
            [
                7829,
                7849
            ],
            [
                7849,
                7966
            ],
            [
                7966,
                8029
            ],
            [
                8030,
                8042
            ],
            [
                8042,
                8057
            ],
            [
                8058,
                8061
            ],
            [
                8062,
                8101
            ],
            [
                8101,
                8130
            ],
            [
                8130,
                8131
            ],
            [
                8132,
                8138
            ],
            [
                8147,
                8180
            ],
            [
                8180,
                8181
            ],
            [
                8182,
                8185
            ],
            [
                8186,
                8194
            ],
            [
                8195,
                8267
            ],
            [
                8274,
                8350
            ],
            [
                8350,
                8368
            ],
            [
                8369,
                8420
            ],
            [
                8420,
                8422
            ],
            [
                8422,
                8423
            ],
            [
                8423,
                8426
            ],
            [
                8427,
                8513
            ],
            [
                8513,
                8560
            ],
            [
                8561,
                8564
            ],
            [
                8565,
                8579
            ],
            [
                8579,
                8623
            ],
            [
                8624,
                8633
            ],
            [
                8634,
                8646
            ],
            [
                8647,
                8657
            ],
            [
                8657,
                8675
            ],
            [
                8676,
                8716
            ],
            [
                8719,
                8824
            ],
            [
                8825,
                8826
            ],
            [
                8827,
                8846
            ],
            [
                8846,
                8856
            ],
            [
                8856,
                8886
            ],
            [
                8886,
                8950
            ],
            [
                8950,
                8953
            ],
            [
                8953,
                8994
            ],
            [
                8994,
                9067
            ],
            [
                9071,
                9086
            ],
            [
                9086,
                9218
            ],
            [
                9218,
                9222
            ],
            [
                9223,
                9227
            ],
            [
                9228,
                9255
            ],
            [
                9256,
                9281
            ],
            [
                9282,
                9337
            ],
            [
                9338,
                9339
            ],
            [
                9340,
                9354
            ],
            [
                9354,
                9386
            ],
            [
                9386,
                9404
            ],
            [
                9404,
                9485
            ],
            [
                9485,
                9554
            ],
            [
                9554,
                9556
            ],
            [
                9556,
                9572
            ],
            [
                9578,
                9579
            ],
            [
                9583,
                9609
            ],
            [
                9609,
                9649
            ],
            [
                9649,
                9665
            ],
            [
                9665,
                9743
            ],
            [
                9743,
                9753
            ],
            [
                9765,
                9768
            ],
            [
                9769,
                9776
            ],
            [
                9777,
                9796
            ],
            [
                9796,
                9798
            ],
            [
                9798,
                9807
            ],
            [
                9808,
                9811
            ],
            [
                9812,
                9816
            ],
            [
                9826,
                9839
            ],
            [
                9840,
                9965
            ],
            [
                9965,
                9978
            ],
            [
                9979,
                10027
            ],
            [
                10027,
                10028
            ],
            [
                10029,
                10106
            ],
            [
                10106,
                10109
            ],
            [
                10110,
                10115
            ],
            [
                10116,
                10140
            ],
            [
                10141,
                10170
            ],
            [
                10171,
                10193
            ],
            [
                10194,
                10201
            ],
            [
                10202,
                10221
            ],
            [
                10221,
                10223
            ],
            [
                10232,
                10240
            ],
            [
                10240,
                10242
            ],
            [
                10242,
                10330
            ],
            [
                10330,
                10378
            ],
            [
                10379,
                10413
            ],
            [
                10413,
                10414
            ],
            [
                10415,
                10479
            ],
            [
                10479,
                10529
            ],
            [
                10529,
                10554
            ],
            [
                10555,
                10630
            ],
            [
                10630,
                10637
            ],
            [
                10638,
                10673
            ],
            [
                10674,
                10705
            ],
            [
                10713,
                10750
            ],
            [
                10750,
                10773
            ],
            [
                10773,
                10832
            ],
            [
                10832,
                10874
            ],
            [
                10874,
                10883
            ],
            [
                10883,
                10917
            ],
            [
                10930,
                10935
            ],
            [
                10936,
                10939
            ],
            [
                10940,
                10985
            ],
            [
                10985,
                10993
            ],
            [
                10994,
                11007
            ],
            [
                11008,
                11024
            ],
            [
                11025,
                11032
            ],
            [
                11033,
                11085
            ],
            [
                11085,
                11207
            ],
            [
                11211,
                11228
            ],
            [
                11229,
                11241
            ],
            [
                11242,
                11360
            ],
            [
                11360,
                11491
            ],
            [
                11491,
                11650
            ],
            [
                11650,
                11789
            ],
            [
                11789,
                11891
            ],
            [
                11891,
                11931
            ],
            [
                11932,
                11961
            ],
            [
                11965,
                11967
            ],
            [
                11971,
                11974
            ],
            [
                11974,
                12070
            ],
            [
                12071,
                12095
            ],
            [
                12095,
                12096
            ],
            [
                12096,
                12097
            ],
            [
                12105,
                12150
            ],
            [
                12150,
                12151
            ],
            [
                12152,
                12157
            ],
            [
                12157,
                12168
            ],
            [
                12168,
                12222
            ],
            [
                12222,
                12257
            ],
            [
                12258,
                12262
            ],
            [
                12263,
                12282
            ],
            [
                12282,
                12396
            ],
            [
                12397,
                12427
            ],
            [
                12427,
                12429
            ],
            [
                12429,
                12581
            ],
            [
                12582,
                12633
            ],
            [
                12633,
                12741
            ],
            [
                12741,
                12857
            ]
        ],
        "row_chars": [
            [
                0,
                67
            ],
            [
                67,
                127
            ],
            [
                127,
                127
            ],
            [
                127,
                298
            ],
            [
                298,
                447
            ],
            [
                447,
                447
            ],
            [
                447,
                477
            ],
            [
                477,
                561
            ],
            [
                561,
                601
            ],
            [
                601,
                639
            ],
            [
                639,
                751
            ],
            [
                751,
                773
            ],
            [
                773,
                1204
            ],
            [
                1204,
                1320
            ],
            [
                1320,
                1396
            ],
            [
                1396,
                1396
            ],
            [
                1396,
                1443
            ],
            [
                1443,
                1443
            ],
            [
                1443,
                1578
            ],
            [
                1578,
                1680
            ],
            [
                1680,
                1818
            ],
            [
                1818,
                1935
            ],
            [
                1935,
                1962
            ],
            [
                1962,
                1962
            ],
            [
                1962,
                1962
            ],
            [
                1962,
                2044
            ],
            [
                2044,
                2082
            ],
            [
                2082,
                2095
            ],
            [
                2095,
                2095
            ],
            [
                2095,
                2117
            ],
            [
                2117,
                2117
            ],
            [
                2117,
                2157
            ],
            [
                2157,
                2185
            ],
            [
                2185,
                2197
            ],
            [
                2197,
                2214
            ],
            [
                2214,
                2259
            ],
            [
                2259,
                2417
            ],
            [
                2417,
                2445
            ],
            [
                2445,
                2734
            ],
            [
                2734,
                2786
            ],
            [
                2786,
                2804
            ],
            [
                2804,
                2880
            ],
            [
                2880,
                2911
            ],
            [
                2911,
                2973
            ],
            [
                2973,
                3003
            ],
            [
                3003,
                3193
            ],
            [
                3193,
                3492
            ],
            [
                3492,
                3807
            ],
            [
                3807,
                4073
            ],
            [
                4073,
                4094
            ],
            [
                4094,
                4141
            ],
            [
                4141,
                4157
            ],
            [
                4157,
                4176
            ],
            [
                4176,
                4307
            ],
            [
                4307,
                4334
            ],
            [
                4334,
                4444
            ],
            [
                4444,
                4470
            ],
            [
                4470,
                4484
            ],
            [
                4484,
                4512
            ],
            [
                4512,
                4535
            ],
            [
                4535,
                4535
            ],
            [
                4535,
                4563
            ],
            [
                4563,
                4728
            ],
            [
                4728,
                4760
            ],
            [
                4760,
                4787
            ],
            [
                4787,
                4897
            ],
            [
                4897,
                4897
            ],
            [
                4897,
                5152
            ],
            [
                5152,
                5273
            ],
            [
                5273,
                5299
            ],
            [
                5299,
                5337
            ],
            [
                5337,
                5414
            ],
            [
                5414,
                5526
            ],
            [
                5526,
                5628
            ],
            [
                5628,
                5658
            ],
            [
                5658,
                5690
            ],
            [
                5690,
                5737
            ],
            [
                5737,
                5926
            ],
            [
                5926,
                6133
            ],
            [
                6133,
                6380
            ],
            [
                6380,
                6405
            ],
            [
                6405,
                6629
            ],
            [
                6629,
                6629
            ],
            [
                6629,
                6707
            ],
            [
                6707,
                6736
            ],
            [
                6736,
                6896
            ],
            [
                6896,
                7071
            ],
            [
                7071,
                7154
            ],
            [
                7154,
                7357
            ],
            [
                7357,
                7618
            ],
            [
                7618,
                7649
            ],
            [
                7649,
                7738
            ],
            [
                7738,
                7829
            ],
            [
                7829,
                8101
            ],
            [
                8101,
                8182
            ],
            [
                8182,
                8350
            ],
            [
                8350,
                8422
            ],
            [
                8422,
                8579
            ],
            [
                8579,
                8719
            ],
            [
                8719,
                8719
            ],
            [
                8719,
                8846
            ],
            [
                8846,
                8856
            ],
            [
                8856,
                8886
            ],
            [
                8886,
                8953
            ],
            [
                8953,
                8994
            ],
            [
                8994,
                9086
            ],
            [
                9086,
                9218
            ],
            [
                9218,
                9218
            ],
            [
                9218,
                9354
            ],
            [
                9354,
                9386
            ],
            [
                9386,
                9404
            ],
            [
                9404,
                9485
            ],
            [
                9485,
                9556
            ],
            [
                9556,
                9609
            ],
            [
                9609,
                9649
            ],
            [
                9649,
                9743
            ],
            [
                9743,
                9798
            ],
            [
                9798,
                9798
            ],
            [
                9798,
                10106
            ],
            [
                10106,
                10221
            ],
            [
                10221,
                10221
            ],
            [
                10221,
                10221
            ],
            [
                10221,
                10242
            ],
            [
                10242,
                10330
            ],
            [
                10330,
                10415
            ],
            [
                10415,
                10415
            ],
            [
                10415,
                10479
            ],
            [
                10479,
                10630
            ],
            [
                10630,
                10750
            ],
            [
                10750,
                10773
            ],
            [
                10773,
                10832
            ],
            [
                10832,
                10874
            ],
            [
                10874,
                10883
            ],
            [
                10883,
                10985
            ],
            [
                10985,
                11085
            ],
            [
                11085,
                11207
            ],
            [
                11207,
                11360
            ],
            [
                11360,
                11491
            ],
            [
                11491,
                11650
            ],
            [
                11650,
                11789
            ],
            [
                11789,
                11891
            ],
            [
                11891,
                11974
            ],
            [
                11974,
                12095
            ],
            [
                12095,
                12152
            ],
            [
                12152,
                12152
            ],
            [
                12152,
                12157
            ],
            [
                12157,
                12282
            ],
            [
                12282,
                12429
            ],
            [
                12429,
                12633
            ],
            [
                12633,
                12857
            ]
        ]
    }
}