{
    "original": {
        "text": "The conference was neither so short nor so conclusive as the lady had designed. The gentleman was not so easily satisfied. He had all the disposition to persevere that Sir Thomas could wish him. He had vanity, which strongly inclined him in the first place to think she did love him, though she might not know it herself; and which, secondly, when constrained at last to admit that she did know her own present feelings, convinced him that he should be able in time to make those feelings what he wished.\nHe was in love, very much in love; and it was a love which, operating on an active, sanguine spirit, of more warmth than delicacy, made her affection appear of greater consequence because it was withheld, and determined him to have the glory, as well as the felicity, of forcing her to love him.\nHe would not despair: he would not desist. He had every well-grounded reason for solid attachment; he knew her to have all the worth that could justify the warmest hopes of lasting happiness with her; her conduct at this very time, by speaking the disinterestedness and delicacy of her character (qualities which he believed most rare indeed), was of a sort to heighten all his wishes, and confirm all his resolutions. He knew not that he had a pre-engaged heart to attack. Of _that_ he had no suspicion. He considered her rather as one who had never thought on the subject enough to be in danger; who had been guarded by youth, a youth of mind as lovely as of person; whose modesty had prevented her from understanding his attentions, and who was still overpowered by the suddenness of addresses so wholly unexpected, and the novelty of a situation which her fancy had never taken into account.\nMust it not follow of course, that, when he was understood, he should succeed? He believed it fully. Love such as his, in a man like himself, must with perseverance secure a return, and at no great distance; and he had so much delight in the idea of obliging her to love him in a very short time, that her not loving him now was scarcely regretted. A little difficulty to be overcome was no evil to Henry Crawford. He rather derived spirits from it. He had been apt to gain hearts too easily. His situation was new and animating.\nTo Fanny, however, who had known too much opposition all her life to find any charm in it, all this was unintelligible. She found that he did mean to persevere; but how he could, after such language from her as she felt herself obliged to use, was not to be understood. She told him that she did not love him, could not love him, was sure she never should love him; that such a change was quite impossible; that the subject was most painful to her; that she must entreat him never to mention it again, to allow her to leave him at once, and let it be considered as concluded for ever. And when farther pressed, had added, that in her opinion their dispositions were so totally dissimilar as to make mutual affection incompatible; and that they were unfitted for each other by nature, education, and habit. All this she had said, and with the earnestness of sincerity; yet this was not enough, for he immediately denied there being anything uncongenial in their characters, or anything unfriendly in their situations; and positively declared, that he would still love, and still hope!\nFanny knew her own meaning, but was no judge of her own manner. Her manner was incurably gentle; and she was not aware how much it concealed the sternness of her purpose. Her diffidence, gratitude, and softness made every expression of indifference seem almost an effort of self-denial; seem, at least, to be giving nearly as much pain to herself as to him. Mr. Crawford was no longer the Mr. Crawford who, as the clandestine, insidious, treacherous admirer of Maria Bertram, had been her abhorrence, whom she had hated to see or to speak to, in whom she could believe no good quality to exist, and whose power, even of being agreeable, she had barely acknowledged. He was now the Mr. Crawford who was addressing herself with ardent, disinterested love; whose feelings were apparently become all that was honourable and upright, whose views of happiness were all fixed on a marriage of attachment; who was pouring out his sense of her merits, describing and describing again his affection, proving as far as words could prove it, and in the language, tone, and spirit of a man of talent too, that he sought her for her gentleness and her goodness; and to complete the whole, he was now the Mr. Crawford who had procured William's promotion!\nHere was a change, and here were claims which could not but operate! She might have disdained him in all the dignity of angry virtue, in the grounds of Sotherton, or the theatre at Mansfield Park; but he approached her now with rights that demanded different treatment. She must be courteous, and she must be compassionate. She must have a sensation of being honoured, and whether thinking of herself or her brother, she must have a strong feeling of gratitude. The effect of the whole was a manner so pitying and agitated, and words intermingled with her refusal so expressive of obligation and concern, that to a temper of vanity and hope like Crawford's, the truth, or at least the strength of her indifference, might well be questionable; and he was not so irrational as Fanny considered him, in the professions of persevering, assiduous, and not desponding attachment which closed the interview.\nIt was with reluctance that he suffered her to go; but there was no look of despair in parting to belie his words, or give her hopes of his being less unreasonable than he professed himself.\nNow she was angry. Some resentment did arise at a perseverance so selfish and ungenerous. Here was again a want of delicacy and regard for others which had formerly so struck and disgusted her. Here was again a something of the same Mr. Crawford whom she had so reprobated before. How evidently was there a gross want of feeling and humanity where his own pleasure was concerned-And, alas! how always known no principle to supply as a duty what the heart was deficient in. Had her own affections been as free-as perhaps they ought to have been-he never could have engaged them.\nSo thought Fanny, in good truth and sober sadness, as she sat musing over that too great indulgence and luxury of a fire upstairs: wondering at the past and present; wondering at what was yet to come, and in a nervous agitation which made nothing clear to her but the persuasion of her being never under any circumstances able to love Mr. Crawford, and the felicity of having a fire to sit over and think of it.\nSir Thomas was obliged, or obliged himself, to wait till the morrow for a knowledge of what had passed between the young people. He then saw Mr. Crawford, and received his account. The first feeling was disappointment: he had hoped better things; he had thought that an hour's entreaty from a young man like Crawford could not have worked so little change on a gentle-tempered girl like Fanny; but there was speedy comfort in the determined views and sanguine perseverance of the lover; and when seeing such confidence of success in the principal, Sir Thomas was soon able to depend on it himself.\nNothing was omitted, on his side, of civility, compliment, or kindness, that might assist the plan. Mr. Crawford's steadiness was honoured, and Fanny was praised, and the connexion was still the most desirable in the world. At Mansfield Park Mr. Crawford would always be welcome; he had only to consult his own judgment and feelings as to the frequency of his visits, at present or in future. In all his niece's family and friends, there could be but one opinion, one wish on the subject; the influence of all who loved her must incline one way.\nEverything was said that could encourage, every encouragement received with grateful joy, and the gentlemen parted the best of friends.\nSatisfied that the cause was now on a footing the most proper and hopeful, Sir Thomas resolved to abstain from all farther importunity with his niece, and to shew no open interference. Upon her disposition he believed kindness might be the best way of working. Entreaty should be from one quarter only. The forbearance of her family on a point, respecting which she could be in no doubt of their wishes, might be their surest means of forwarding it. Accordingly, on this principle, Sir Thomas took the first opportunity of saying to her, with a mild gravity, intended to be overcoming, \"Well, Fanny, I have seen Mr. Crawford again, and learn from him exactly how matters stand between you. He is a most extraordinary young man, and whatever be the event, you must feel that you have created an attachment of no common character; though, young as you are, and little acquainted with the transient, varying, unsteady nature of love, as it generally exists, you cannot be struck as I am with all that is wonderful in a perseverance of this sort against discouragement. With him it is entirely a matter of feeling: he claims no merit in it; perhaps is entitled to none. Yet, having chosen so well, his constancy has a respectable stamp. Had his choice been less unexceptionable, I should have condemned his persevering.\"\n\"Indeed, sir,\" said Fanny, \"I am very sorry that Mr. Crawford should continue to-I know that it is paying me a very great compliment, and I feel most undeservedly honoured; but I am so perfectly convinced, and I have told him so, that it never will be in my power-\"\n\"My dear,\" interrupted Sir Thomas, \"there is no occasion for this. Your feelings are as well known to me as my wishes and regrets must be to you. There is nothing more to be said or done. From this hour the subject is never to be revived between us. You will have nothing to fear, or to be agitated about. You cannot suppose me capable of trying to persuade you to marry against your inclinations. Your happiness and advantage are all that I have in view, and nothing is required of you but to bear with Mr. Crawford's endeavours to convince you that they may not be incompatible with his. He proceeds at his own risk. You are on safe ground. I have engaged for your seeing him whenever he calls, as you might have done had nothing of this sort occurred. You will see him with the rest of us, in the same manner, and, as much as you can, dismissing the recollection of everything unpleasant. He leaves Northamptonshire so soon, that even this slight sacrifice cannot be often demanded. The future must be very uncertain. And now, my dear Fanny, this subject is closed between us.\"\nThe promised departure was all that Fanny could think of with much satisfaction. Her uncle's kind expressions, however, and forbearing manner, were sensibly felt; and when she considered how much of the truth was unknown to him, she believed she had no right to wonder at the line of conduct he pursued. He, who had married a daughter to Mr. Rushworth: romantic delicacy was certainly not to be expected from him. She must do her duty, and trust that time might make her duty easier than it now was.\nShe could not, though only eighteen, suppose Mr. Crawford's attachment would hold out for ever; she could not but imagine that steady, unceasing discouragement from herself would put an end to it in time. How much time she might, in her own fancy, allot for its dominion, is another concern. It would not be fair to inquire into a young lady's exact estimate of her own perfections.\nIn spite of his intended silence, Sir Thomas found himself once more obliged to mention the subject to his niece, to prepare her briefly for its being imparted to her aunts; a measure which he would still have avoided, if possible, but which became necessary from the totally opposite feelings of Mr. Crawford as to any secrecy of proceeding. He had no idea of concealment. It was all known at the Parsonage, where he loved to talk over the future with both his sisters, and it would be rather gratifying to him to have enlightened witnesses of the progress of his success. When Sir Thomas understood this, he felt the necessity of making his own wife and sister-in-law acquainted with the business without delay; though, on Fanny's account, he almost dreaded the effect of the communication to Mrs. Norris as much as Fanny herself. He deprecated her mistaken but well-meaning zeal. Sir Thomas, indeed, was, by this time, not very far from classing Mrs. Norris as one of those well-meaning people who are always doing mistaken and very disagreeable things.\nMrs. Norris, however, relieved him. He pressed for the strictest forbearance and silence towards their niece; she not only promised, but did observe it. She only looked her increased ill-will. Angry she was: bitterly angry; but she was more angry with Fanny for having received such an offer than for refusing it. It was an injury and affront to Julia, who ought to have been Mr. Crawford's choice; and, independently of that, she disliked Fanny, because she had neglected her; and she would have grudged such an elevation to one whom she had been always trying to depress.\nSir Thomas gave her more credit for discretion on the occasion than she deserved; and Fanny could have blessed her for allowing her only to see her displeasure, and not to hear it.\nLady Bertram took it differently. She had been a beauty, and a prosperous beauty, all her life; and beauty and wealth were all that excited her respect. To know Fanny to be sought in marriage by a man of fortune, raised her, therefore, very much in her opinion. By convincing her that Fanny _was_ very pretty, which she had been doubting about before, and that she would be advantageously married, it made her feel a sort of credit in calling her niece.\n\"Well, Fanny,\" said she, as soon as they were alone together afterwards, and she really had known something like impatience to be alone with her, and her countenance, as she spoke, had extraordinary animation; \"Well, Fanny, I have had a very agreeable surprise this morning. I must just speak of it _once_, I told Sir Thomas I must _once_, and then I shall have done. I give you joy, my dear niece.\" And looking at her complacently, she added, \"Humph, we certainly are a handsome family!\"\nFanny coloured, and doubted at first what to say; when, hoping to assail her on her vulnerable side, she presently answered-\n\"My dear aunt, _you_ cannot wish me to do differently from what I have done, I am sure. _You_ cannot wish me to marry; for you would miss me, should not you? Yes, I am sure you would miss me too much for that.\"\n\"No, my dear, I should not think of missing you, when such an offer as this comes in your way. I could do very well without you, if you were married to a man of such good estate as Mr. Crawford. And you must be aware, Fanny, that it is every young woman's duty to accept such a very unexceptionable offer as this.\"\nThis was almost the only rule of conduct, the only piece of advice, which Fanny had ever received from her aunt in the course of eight years and a half. It silenced her. She felt how unprofitable contention would be. If her aunt's feelings were against her, nothing could be hoped from attacking her understanding. Lady Bertram was quite talkative.\n\"I will tell you what, Fanny,\" said she, \"I am sure he fell in love with you at the ball; I am sure the mischief was done that evening. You did look remarkably well. Everybody said so. Sir Thomas said so. And you know you had Chapman to help you to dress. I am very glad I sent Chapman to you. I shall tell Sir Thomas that I am sure it was done that evening.\" And still pursuing the same cheerful thoughts, she soon afterwards added, \"And I will tell you what, Fanny, which is more than I did for Maria: the next time Pug has a litter you shall have a puppy.\"",
        "paragraph_chars": [
            [
                0,
                505
            ],
            [
                505,
                801
            ],
            [
                801,
                1697
            ],
            [
                1697,
                2227
            ],
            [
                2227,
                3311
            ],
            [
                3311,
                4552
            ],
            [
                4552,
                5453
            ],
            [
                5453,
                5644
            ],
            [
                5644,
                6222
            ],
            [
                6222,
                6634
            ],
            [
                6634,
                7232
            ],
            [
                7232,
                7778
            ],
            [
                7778,
                7914
            ],
            [
                7914,
                9231
            ],
            [
                9231,
                9497
            ],
            [
                9497,
                10578
            ],
            [
                10578,
                11078
            ],
            [
                11078,
                11461
            ],
            [
                11461,
                12518
            ],
            [
                12518,
                13092
            ],
            [
                13092,
                13273
            ],
            [
                13273,
                13727
            ],
            [
                13727,
                14216
            ],
            [
                14216,
                14341
            ],
            [
                14341,
                14552
            ],
            [
                14552,
                14867
            ],
            [
                14867,
                15216
            ],
            [
                15216,
                15775
            ]
        ],
        "segment_chars": [
            [
                0,
                80
            ],
            [
                80,
                123
            ],
            [
                123,
                195
            ],
            [
                195,
                505
            ],
            [
                505,
                801
            ],
            [
                801,
                844
            ],
            [
                844,
                1220
            ],
            [
                1220,
                1275
            ],
            [
                1275,
                1306
            ],
            [
                1306,
                1697
            ],
            [
                1697,
                1776
            ],
            [
                1776,
                1798
            ],
            [
                1798,
                2046
            ],
            [
                2046,
                2112
            ],
            [
                2112,
                2147
            ],
            [
                2147,
                2190
            ],
            [
                2190,
                2227
            ],
            [
                2227,
                2347
            ],
            [
                2347,
                2497
            ],
            [
                2497,
                2812
            ],
            [
                2812,
                3033
            ],
            [
                3033,
                3311
            ],
            [
                3311,
                3375
            ],
            [
                3375,
                3482
            ],
            [
                3482,
                3669
            ],
            [
                3669,
                3977
            ],
            [
                3977,
                4552
            ],
            [
                4552,
                4621
            ],
            [
                4621,
                4822
            ],
            [
                4822,
                4876
            ],
            [
                4876,
                5014
            ],
            [
                5014,
                5453
            ],
            [
                5453,
                5644
            ],
            [
                5644,
                5663
            ],
            [
                5663,
                5734
            ],
            [
                5734,
                5838
            ],
            [
                5838,
                5925
            ],
            [
                5925,
                6034
            ],
            [
                6034,
                6117
            ],
            [
                6117,
                6222
            ],
            [
                6222,
                6634
            ],
            [
                6634,
                6763
            ],
            [
                6763,
                6815
            ],
            [
                6815,
                7232
            ],
            [
                7232,
                7332
            ],
            [
                7332,
                7456
            ],
            [
                7456,
                7625
            ],
            [
                7625,
                7778
            ],
            [
                7778,
                7914
            ],
            [
                7914,
                8099
            ],
            [
                8099,
                8175
            ],
            [
                8175,
                8217
            ],
            [
                8217,
                8364
            ],
            [
                8364,
                8604
            ],
            [
                8604,
                8980
            ],
            [
                8980,
                9080
            ],
            [
                9080,
                9147
            ],
            [
                9147,
                9231
            ],
            [
                9231,
                9497
            ],
            [
                9497,
                9564
            ],
            [
                9564,
                9643
            ],
            [
                9643,
                9685
            ],
            [
                9685,
                9747
            ],
            [
                9747,
                9803
            ],
            [
                9803,
                9895
            ],
            [
                9895,
                10087
            ],
            [
                10087,
                10116
            ],
            [
                10116,
                10140
            ],
            [
                10140,
                10252
            ],
            [
                10252,
                10389
            ],
            [
                10389,
                10483
            ],
            [
                10483,
                10518
            ],
            [
                10518,
                10578
            ],
            [
                10578,
                10659
            ],
            [
                10659,
                10882
            ],
            [
                10882,
                10992
            ],
            [
                10992,
                11078
            ],
            [
                11078,
                11283
            ],
            [
                11283,
                11370
            ],
            [
                11370,
                11461
            ],
            [
                11461,
                11804
            ],
            [
                11804,
                11835
            ],
            [
                11835,
                12035
            ],
            [
                12035,
                12294
            ],
            [
                12294,
                12344
            ],
            [
                12344,
                12518
            ],
            [
                12518,
                12554
            ],
            [
                12554,
                12671
            ],
            [
                12671,
                12711
            ],
            [
                12711,
                12832
            ],
            [
                12832,
                13092
            ],
            [
                13092,
                13273
            ],
            [
                13273,
                13307
            ],
            [
                13307,
                13426
            ],
            [
                13426,
                13535
            ],
            [
                13535,
                13727
            ],
            [
                13727,
                14002
            ],
            [
                14002,
                14095
            ],
            [
                14095,
                14127
            ],
            [
                14127,
                14216
            ],
            [
                14216,
                14341
            ],
            [
                14341,
                14429
            ],
            [
                14429,
                14499
            ],
            [
                14499,
                14552
            ],
            [
                14552,
                14647
            ],
            [
                14647,
                14747
            ],
            [
                14747,
                14867
            ],
            [
                14867,
                15020
            ],
            [
                15020,
                15037
            ],
            [
                15037,
                15084
            ],
            [
                15084,
                15182
            ],
            [
                15182,
                15216
            ],
            [
                15216,
                15352
            ],
            [
                15352,
                15382
            ],
            [
                15382,
                15401
            ],
            [
                15401,
                15421
            ],
            [
                15421,
                15472
            ],
            [
                15472,
                15510
            ],
            [
                15510,
                15576
            ],
            [
                15576,
                15775
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                80,
                123
            ],
            [
                195,
                237
            ],
            [
                257,
                347
            ],
            [
                360,
                505
            ],
            [
                505,
                511
            ],
            [
                521,
                563
            ],
            [
                636,
                801
            ],
            [
                801,
                844
            ],
            [
                900,
                991
            ],
            [
                1000,
                1021
            ],
            [
                1027,
                1035
            ],
            [
                1045,
                1048
            ],
            [
                1071,
                1096
            ],
            [
                1171,
                1190
            ],
            [
                1203,
                1220
            ],
            [
                1220,
                1275
            ],
            [
                1275,
                1277
            ],
            [
                1279,
                1283
            ],
            [
                1285,
                1306
            ],
            [
                1306,
                1374
            ],
            [
                1397,
                1428
            ],
            [
                1468,
                1548
            ],
            [
                1555,
                1587
            ],
            [
                1639,
                1656
            ],
            [
                1667,
                1676
            ],
            [
                1695,
                1697
            ],
            [
                1697,
                1715
            ],
            [
                1727,
                1732
            ],
            [
                1716,
                1725
            ],
            [
                1755,
                1776
            ],
            [
                1776,
                1798
            ],
            [
                1798,
                1843
            ],
            [
                1903,
                2046
            ],
            [
                2046,
                2112
            ],
            [
                2147,
                2190
            ],
            [
                2190,
                2227
            ],
            [
                2227,
                2347
            ],
            [
                2347,
                2404
            ],
            [
                2471,
                2474
            ],
            [
                2431,
                2434
            ],
            [
                2495,
                2497
            ],
            [
                2497,
                2597
            ],
            [
                2603,
                2727
            ],
            [
                2810,
                2812
            ],
            [
                2842,
                2847
            ],
            [
                2849,
                2868
            ],
            [
                2966,
                2975
            ],
            [
                2896,
                2903
            ],
            [
                2976,
                3033
            ],
            [
                3033,
                3054
            ],
            [
                3093,
                3199
            ],
            [
                3244,
                3298
            ],
            [
                3305,
                3311
            ],
            [
                3311,
                3375
            ],
            [
                3375,
                3482
            ],
            [
                3482,
                3496
            ],
            [
                3509,
                3564
            ],
            [
                3614,
                3669
            ],
            [
                3669,
                3810
            ],
            [
                3975,
                3977
            ],
            [
                3977,
                4095
            ],
            [
                4116,
                4138
            ],
            [
                4207,
                4216
            ],
            [
                4254,
                4308
            ],
            [
                4403,
                4552
            ],
            [
                4575,
                4597
            ],
            [
                4619,
                4621
            ],
            [
                4621,
                4649
            ],
            [
                4686,
                4752
            ],
            [
                4771,
                4774
            ],
            [
                4822,
                4843
            ],
            [
                4845,
                4848
            ],
            [
                4861,
                4876
            ],
            [
                4876,
                4884
            ],
            [
                5003,
                5014
            ],
            [
                5104,
                5115
            ],
            [
                5038,
                5041
            ],
            [
                5116,
                5161
            ],
            [
                5198,
                5206
            ],
            [
                5267,
                5277
            ],
            [
                5214,
                5219
            ],
            [
                5293,
                5351
            ],
            [
                5356,
                5382
            ],
            [
                5414,
                5453
            ],
            [
                5644,
                5663
            ],
            [
                5663,
                5734
            ],
            [
                5734,
                5748
            ],
            [
                5868,
                5871
            ],
            [
                5751,
                5818
            ],
            [
                5833,
                5836
            ],
            [
                5949,
                6022
            ],
            [
                5836,
                5837
            ],
            [
                6117,
                6144
            ],
            [
                6148,
                6152
            ],
            [
                6188,
                6222
            ],
            [
                6222,
                6242
            ],
            [
                6258,
                6295
            ],
            [
                6478,
                6481
            ],
            [
                6326,
                6352
            ],
            [
                6388,
                6426
            ],
            [
                6461,
                6474
            ],
            [
                6482,
                6489
            ],
            [
                6501,
                6519
            ],
            [
                6544,
                6569
            ],
            [
                6632,
                6634
            ],
            [
                6691,
                6701
            ],
            [
                6656,
                6657
            ],
            [
                6638,
                6644
            ],
            [
                6793,
                6801
            ],
            [
                6775,
                6787
            ],
            [
                6806,
                6813
            ],
            [
                6718,
                6736
            ],
            [
                6813,
                6815
            ],
            [
                6819,
                6852
            ],
            [
                6881,
                6924
            ],
            [
                6942,
                7001
            ],
            [
                7011,
                7041
            ],
            [
                7049,
                7063
            ],
            [
                7085,
                7119
            ],
            [
                7230,
                7232
            ],
            [
                7244,
                7251
            ],
            [
                7269,
                7277
            ],
            [
                7291,
                7302
            ],
            [
                7304,
                7332
            ],
            [
                7332,
                7456
            ],
            [
                7456,
                7510
            ],
            [
                7623,
                7625
            ],
            [
                7778,
                7818
            ],
            [
                7866,
                7914
            ],
            [
                7914,
                7951
            ],
            [
                7980,
                7987
            ],
            [
                7952,
                7959
            ],
            [
                7987,
                8008
            ],
            [
                8009,
                8011
            ],
            [
                8054,
                8063
            ],
            [
                8029,
                8036
            ],
            [
                8097,
                8099
            ],
            [
                8120,
                8175
            ],
            [
                8217,
                8249
            ],
            [
                8252,
                8257
            ],
            [
                8318,
                8363
            ],
            [
                8364,
                8376
            ],
            [
                8407,
                8456
            ],
            [
                8464,
                8471
            ],
            [
                8498,
                8549
            ],
            [
                8556,
                8590
            ],
            [
                8602,
                8604
            ],
            [
                8604,
                8654
            ],
            [
                8667,
                8799
            ],
            [
                8820,
                8897
            ],
            [
                8928,
                8955
            ],
            [
                9231,
                9259
            ],
            [
                9369,
                9497
            ],
            [
                9497,
                9544
            ],
            [
                9554,
                9564
            ],
            [
                9564,
                9614
            ],
            [
                9627,
                9643
            ],
            [
                9643,
                9675
            ],
            [
                9683,
                9685
            ],
            [
                9685,
                9747
            ],
            [
                9747,
                9776
            ],
            [
                9803,
                9880
            ],
            [
                9893,
                9895
            ],
            [
                9895,
                10042
            ],
            [
                10085,
                10087
            ],
            [
                10087,
                10116
            ],
            [
                10116,
                10140
            ],
            [
                10140,
                10228
            ],
            [
                10242,
                10252
            ],
            [
                10252,
                10308
            ],
            [
                10387,
                10389
            ],
            [
                10389,
                10483
            ],
            [
                10518,
                10578
            ],
            [
                10578,
                10659
            ],
            [
                10659,
                10668
            ],
            [
                10687,
                10688
            ],
            [
                10671,
                10675
            ],
            [
                10696,
                10697
            ],
            [
                10890,
                10992
            ],
            [
                10992,
                11060
            ],
            [
                11076,
                11078
            ],
            [
                11078,
                11172
            ],
            [
                11281,
                11283
            ],
            [
                11283,
                11370
            ],
            [
                11370,
                11461
            ],
            [
                11461,
                11589
            ],
            [
                11598,
                11659
            ],
            [
                11666,
                11724
            ],
            [
                11758,
                11770
            ],
            [
                11774,
                11788
            ],
            [
                11802,
                11804
            ],
            [
                11804,
                11835
            ],
            [
                11835,
                11913
            ],
            [
                11919,
                11930
            ],
            [
                11936,
                11944
            ],
            [
                11955,
                11959
            ],
            [
                11969,
                12035
            ],
            [
                12035,
                12075
            ],
            [
                12100,
                12130
            ],
            [
                12147,
                12205
            ],
            [
                12213,
                12267
            ],
            [
                12206,
                12212
            ],
            [
                12268,
                12293
            ],
            [
                12518,
                12554
            ],
            [
                12554,
                12631
            ],
            [
                12655,
                12671
            ],
            [
                12671,
                12711
            ],
            [
                12711,
                12832
            ],
            [
                12832,
                12841
            ],
            [
                12853,
                13092
            ],
            [
                13273,
                13307
            ],
            [
                13307,
                13321
            ],
            [
                13336,
                13353
            ],
            [
                13355,
                13426
            ],
            [
                13426,
                13439
            ],
            [
                13446,
                13535
            ],
            [
                13535,
                13563
            ],
            [
                13565,
                13568
            ],
            [
                13570,
                13596
            ],
            [
                13617,
                13707
            ],
            [
                13716,
                13719
            ],
            [
                13720,
                13727
            ],
            [
                13727,
                13751
            ],
            [
                13863,
                13867
            ],
            [
                13912,
                13935
            ],
            [
                13798,
                13799
            ],
            [
                13763,
                13787
            ],
            [
                13935,
                14002
            ],
            [
                14002,
                14025
            ],
            [
                14027,
                14031
            ],
            [
                14065,
                14095
            ],
            [
                14095,
                14124
            ],
            [
                14172,
                14216
            ],
            [
                14216,
                14230
            ],
            [
                14341,
                14355
            ],
            [
                14357,
                14360
            ],
            [
                14435,
                14458
            ],
            [
                14416,
                14427
            ],
            [
                14458,
                14497
            ],
            [
                14552,
                14647
            ],
            [
                14751,
                14867
            ],
            [
                14867,
                14891
            ],
            [
                14918,
                14933
            ],
            [
                14935,
                14978
            ],
            [
                15018,
                15020
            ],
            [
                15020,
                15037
            ],
            [
                15187,
                15216
            ],
            [
                15216,
                15304
            ],
            [
                15350,
                15352
            ],
            [
                15352,
                15382
            ],
            [
                15382,
                15401
            ],
            [
                15421,
                15472
            ],
            [
                15472,
                15510
            ],
            [
                15510,
                15576
            ],
            [
                15576,
                15594
            ],
            [
                15604,
                15626
            ],
            [
                15643,
                15682
            ],
            [
                15718,
                15750
            ],
            [
                15682,
                15683
            ],
            [
                15751,
                15775
            ]
        ],
        "row_chars": [
            [
                0,
                80
            ],
            [
                80,
                123
            ],
            [
                123,
                195
            ],
            [
                195,
                505
            ],
            [
                505,
                801
            ],
            [
                801,
                844
            ],
            [
                844,
                1220
            ],
            [
                1220,
                1275
            ],
            [
                1275,
                1306
            ],
            [
                1306,
                1697
            ],
            [
                1697,
                1776
            ],
            [
                1776,
                1798
            ],
            [
                1798,
                2046
            ],
            [
                2046,
                2112
            ],
            [
                2112,
                2147
            ],
            [
                2147,
                2190
            ],
            [
                2190,
                2227
            ],
            [
                2227,
                2347
            ],
            [
                2347,
                2497
            ],
            [
                2497,
                2812
            ],
            [
                2812,
                3033
            ],
            [
                3033,
                3311
            ],
            [
                3311,
                3375
            ],
            [
                3375,
                3482
            ],
            [
                3482,
                3669
            ],
            [
                3669,
                3977
            ],
            [
                3977,
                4552
            ],
            [
                4552,
                4621
            ],
            [
                4621,
                4876
            ],
            [
                4876,
                5014
            ],
            [
                5014,
                5453
            ],
            [
                5453,
                5644
            ],
            [
                5644,
                5663
            ],
            [
                5663,
                5734
            ],
            [
                5734,
                6034
            ],
            [
                6034,
                6117
            ],
            [
                6117,
                6222
            ],
            [
                6222,
                6634
            ],
            [
                6634,
                6815
            ],
            [
                6815,
                7232
            ],
            [
                7232,
                7332
            ],
            [
                7332,
                7456
            ],
            [
                7456,
                7625
            ],
            [
                7625,
                7778
            ],
            [
                7778,
                7914
            ],
            [
                7914,
                8099
            ],
            [
                8099,
                8175
            ],
            [
                8175,
                8217
            ],
            [
                8217,
                8364
            ],
            [
                8364,
                8604
            ],
            [
                8604,
                8980
            ],
            [
                8980,
                9080
            ],
            [
                9080,
                9147
            ],
            [
                9147,
                9231
            ],
            [
                9231,
                9497
            ],
            [
                9497,
                9564
            ],
            [
                9564,
                9643
            ],
            [
                9643,
                9685
            ],
            [
                9685,
                9747
            ],
            [
                9747,
                9895
            ],
            [
                9895,
                10087
            ],
            [
                10087,
                10116
            ],
            [
                10116,
                10140
            ],
            [
                10140,
                10252
            ],
            [
                10252,
                10389
            ],
            [
                10389,
                10483
            ],
            [
                10483,
                10518
            ],
            [
                10518,
                10578
            ],
            [
                10578,
                10659
            ],
            [
                10659,
                10992
            ],
            [
                10992,
                11078
            ],
            [
                11078,
                11283
            ],
            [
                11283,
                11370
            ],
            [
                11370,
                11461
            ],
            [
                11461,
                11804
            ],
            [
                11804,
                11835
            ],
            [
                11835,
                12035
            ],
            [
                12035,
                12294
            ],
            [
                12294,
                12344
            ],
            [
                12344,
                12518
            ],
            [
                12518,
                12554
            ],
            [
                12554,
                12671
            ],
            [
                12671,
                12711
            ],
            [
                12711,
                12832
            ],
            [
                12832,
                13092
            ],
            [
                13092,
                13273
            ],
            [
                13273,
                13307
            ],
            [
                13307,
                13426
            ],
            [
                13426,
                13535
            ],
            [
                13535,
                13727
            ],
            [
                13727,
                14002
            ],
            [
                14002,
                14095
            ],
            [
                14095,
                14127
            ],
            [
                14127,
                14216
            ],
            [
                14216,
                14341
            ],
            [
                14341,
                14499
            ],
            [
                14499,
                14552
            ],
            [
                14552,
                14647
            ],
            [
                14647,
                14747
            ],
            [
                14747,
                14867
            ],
            [
                14867,
                15020
            ],
            [
                15020,
                15037
            ],
            [
                15037,
                15084
            ],
            [
                15084,
                15182
            ],
            [
                15182,
                15216
            ],
            [
                15216,
                15352
            ],
            [
                15352,
                15382
            ],
            [
                15382,
                15401
            ],
            [
                15401,
                15421
            ],
            [
                15421,
                15472
            ],
            [
                15472,
                15510
            ],
            [
                15510,
                15576
            ],
            [
                15576,
                15775
            ]
        ]
    },
    "abridged": {
        "text": "The conference was neither so short nor so conclusive as the lady had designed. The gentleman was not so easily satisfied. He had vanity, which strongly inclined him to think she did love him, though she might not know it herself; and which, secondly, when forced at last to admit that she did know her own present feelings, convinced him that he should be able in time to make those feelings what he wished.\nHe was very much in love; and it was a love which made her affection appear of greater consequence because it was withheld, and determined him to have the glory, as well as the felicity, of forcing her to love him.\nHe would not despair: he would not desist. He knew her to have all the worth that could justify the warmest hopes of lasting happiness; her conduct at this time, by showing the delicacy of her character, heightened all his wishes, and confirmed his resolutions. He knew not that he had a pre-engaged heart to attack. Of that he had no suspicion. He considered her rather as one who had never thought on the subject; who had been guarded by youth; whose modesty had prevented her from understanding his attentions, and who was overpowered by the suddenness of a situation which she had never imagined.\nMust it not follow that, of course, he should succeed? He believed it fully. Love such as his, in a man like himself, must be returned; and he had so much delight in the idea of obliging her to love him in a very short time, that her not loving him now was scarcely regretted. A little difficulty to be overcome was no evil to Henry Crawford. He had been apt to gain hearts too easily. His situation was new and animating.\nTo Fanny, however, who had known too much opposition all her life to find any charm in it, all this was unintelligible. She found that he did mean to persevere; but how he could was beyond her understanding. She told him that she did not love him, could not love him, was sure she never should love him; that a change was quite impossible; that the subject was most painful to her; that she must entreat him never to mention it again. She added that in her opinion they were totally unfitted for each other by nature, education, and habit. All this she had said; yet this was not enough, for he immediately denied there being anything uncongenial in their characters, and positively declared, that he would still love, and hope!\nFanny knew her own meaning, but was no judge of her own manner. Her manner was incurably gentle; and she was not aware how much it concealed the sternness of her purpose. Her diffidence and softness made every expression of indifference seem to be giving nearly as much pain to herself as to him. Mr. Crawford was no longer the Mr. Crawford who, as the clandestine, insidious, treacherous admirer of Maria Bertram, had been her abhorrence. He was now the Mr. Crawford who was addressing herself with ardent, disinterested love; whose feelings were apparently honourable and upright; who was describing and describing again his affection, proving that he sought her for her gentleness and her goodness; and to complete the whole, he was now the Mr. Crawford who had procured William's promotion!\nHere were claims which must affect her! She might have disdained him in the grounds of Sotherton, or the theatre at Mansfield Park; but now she must be courteous and compassionate. She must feel gratitude. Her refusal was so expressive of obligation and concern, that Crawford might well question its truth; and he was not so irrational as Fanny considered him, in his professions of persevering attachment which closed the interview.\nNow she was angry. Some resentment did arise at a perseverance so selfish and ungenerous. Here was again the want of delicacy and regard for others which had formerly so struck her; a gross want of feeling and humanity where his own pleasure was concerned. Had her own affections been free, he never could have engaged them.\nSo thought Fanny, in sober sadness, as she sat musing over her luxury of a fire upstairs: wondering at what was yet to come, and with nothing clear but the certainty of her being never able to love Mr. Crawford.\nOn the morrow, Sir Thomas received Mr. Crawford's account of what had passed. His first feeling was disappointment: he had thought that an hour's entreaty from Crawford could not have worked so little change on a gentle girl like Fanny; but there was comfort in the sanguine perseverance of the lover.\nSir Thomas omitted no civility or kindness that might assist the plan. Mr. Crawford's steadiness was honoured, and Fanny was praised, and the connexion was still the most desirable in the world. At Mansfield Park Mr. Crawford would always be welcome. Everything was said that could encourage, and the gentlemen parted the best of friends.\nSatisfied that the cause was now on a hopeful footing, Sir Thomas resolved not to press his niece farther. He believed kindness might be the best way of working. The forbearance of her family on the point might be their surest means of forwarding it.\nAccordingly, he took the first opportunity of saying to her, with gravity, \"Well, Fanny, I have seen Mr. Crawford again, and learnt from him exactly how matters stand. He is a most extraordinary young man, and whatever happens, you must feel that you have created an attachment of no common character; though, young as you are, and little acquainted with the unsteady nature of love, as it generally exists, you cannot be struck as I am by a perseverance of this sort.\"\n\"Indeed, sir,\" said Fanny, \"I feel most undeservedly honoured; but I am so perfectly convinced, and I have told him so, that it never will be in my power-\"\n\"My dear,\" interrupted Sir Thomas, \"there is no need for this. Your feelings are as well known to me as my wishes must be to you. There is nothing more to be said. From this hour the subject is never to be revived between us. You will have nothing to fear: you cannot suppose me capable of trying to persuade you to marry against your will. Your happiness and advantage are all that I have in view, and nothing is required of you but to bear with Mr. Crawford's endeavours to convince you. He proceeds at his own risk. You are on safe ground. I have engaged for your seeing him whenever he calls, as you might have done had nothing occurred. You will see him with the rest of us, in the same manner. He leaves Northamptonshire so soon, that even this slight sacrifice cannot be often demanded. And now, my dear Fanny, this subject is closed between us.\"\nThe promised departure was all that Fanny could think of with much satisfaction. Her uncle, though kind, had married a daughter to Mr. Rushworth: romantic delicacy was certainly not to be expected from him. She must do her duty, and trust that time might make her duty easier.\nShe could not, though only eighteen, suppose Mr. Crawford's attachment would hold out for ever. How much time she might, in her own fancy, allot for its dominion, is another concern. It would not be fair to inquire into a young lady's exact estimate of her own perfections.\nIn spite of his intended silence, Sir Thomas found himself once more obliged to mention the subject to his niece, to prepare her for its being imparted to her aunts; a measure which he would have avoided, if possible, but which became necessary from Mr. Crawford's opposition to any secrecy. He had no idea of concealment. It was all known at the Parsonage, where he loved to talk over the future with his sisters: it would gratify him to have enlightened witnesses of the progress of his success. When Sir Thomas understood this, he felt he must tell his own wife and sister-in-law about the business without delay; though, on Fanny's account, he dreaded the effect of the communication to Mrs. Norris almost as much as Fanny herself.\nMrs. Norris, however, relieved him. He pressed for the strictest forbearance and silence towards their niece; she did observe it. She only looked her increased ill-will. Angry she was: bitterly angry; but she was more angry with Fanny for having received such an offer than for refusing it. It was an affront to Julia, who ought to have been Mr. Crawford's choice; and, independently of that, she disliked Fanny, because she had neglected her; and she would have grudged such an elevation to one whom she had been always trying to depress.\nLady Bertram took it differently. She had been a prosperous beauty all her life; and beauty and wealth were all that excited her respect. To know Fanny was sought in marriage by a man of fortune, raised her, therefore, very much in her opinion. By convincing her that Fanny was very pretty, which she had doubted before, and that she would be advantageously married, it made her feel a sort of credit in having her for a niece.\n\"Well, Fanny,\" said she, with extraordinary animation, when they were alone together; \"Well, Fanny, I have had a very agreeable surprise this morning. I must just speak of it once, and then I shall have done. I give you joy, my dear niece. Humph, we certainly are a handsome family!\"\nFanny coloured. \"My dear aunt, you cannot wish me to marry, I am sure; for you would miss me, should not you?\"\n\"No, my dear, I should not think of missing you, when such an offer as this comes in your way. You must be aware, Fanny, that it is every young woman's duty to accept such a very unexceptionable offer as this.\"\nThis was almost the only piece of advice which Fanny had ever received from her aunt. It silenced her. However, Lady Bertram was quite talkative.\n\"I will tell you what, Fanny,\" said she, \"I am sure he fell in love with you at the ball. You did look remarkably well. Everybody said so. And you know you had Chapman to help you to dress. I am very glad I sent Chapman to you. I shall tell Sir Thomas that I am sure it was done that evening.\" And still pursuing her cheerful thoughts, she added, \"And I will tell you what, Fanny: the next time Pug has a litter, you shall have a puppy.\"",
        "paragraph_chars": [
            [
                0,
                409
            ],
            [
                409,
                624
            ],
            [
                624,
                1225
            ],
            [
                1225,
                1648
            ],
            [
                1648,
                2377
            ],
            [
                2377,
                3172
            ],
            [
                3172,
                3607
            ],
            [
                3607,
                3932
            ],
            [
                3932,
                4144
            ],
            [
                4144,
                4446
            ],
            [
                4446,
                4785
            ],
            [
                4785,
                5036
            ],
            [
                5036,
                5506
            ],
            [
                5506,
                5662
            ],
            [
                5662,
                6516
            ],
            [
                6516,
                6793
            ],
            [
                6793,
                7067
            ],
            [
                7067,
                7803
            ],
            [
                7803,
                8343
            ],
            [
                8343,
                8771
            ],
            [
                8771,
                9055
            ],
            [
                9055,
                9166
            ],
            [
                9166,
                9377
            ],
            [
                9377,
                9523
            ],
            [
                9523,
                9960
            ]
        ],
        "segment_chars": [
            [
                0,
                80
            ],
            [
                80,
                123
            ],
            [
                123,
                409
            ],
            [
                409,
                624
            ],
            [
                624,
                667
            ],
            [
                667,
                886
            ],
            [
                886,
                941
            ],
            [
                941,
                970
            ],
            [
                970,
                1225
            ],
            [
                1225,
                1280
            ],
            [
                1280,
                1302
            ],
            [
                1302,
                1502
            ],
            [
                1502,
                1568
            ],
            [
                1568,
                1611
            ],
            [
                1611,
                1648
            ],
            [
                1648,
                1768
            ],
            [
                1768,
                1856
            ],
            [
                1856,
                2083
            ],
            [
                2083,
                2188
            ],
            [
                2188,
                2377
            ],
            [
                2377,
                2441
            ],
            [
                2441,
                2548
            ],
            [
                2548,
                2674
            ],
            [
                2674,
                2817
            ],
            [
                2817,
                3172
            ],
            [
                3172,
                3212
            ],
            [
                3212,
                3353
            ],
            [
                3353,
                3378
            ],
            [
                3378,
                3607
            ],
            [
                3607,
                3626
            ],
            [
                3626,
                3697
            ],
            [
                3697,
                3864
            ],
            [
                3864,
                3932
            ],
            [
                3932,
                4144
            ],
            [
                4144,
                4222
            ],
            [
                4222,
                4446
            ],
            [
                4446,
                4517
            ],
            [
                4517,
                4641
            ],
            [
                4641,
                4697
            ],
            [
                4697,
                4785
            ],
            [
                4785,
                4892
            ],
            [
                4892,
                4947
            ],
            [
                4947,
                5036
            ],
            [
                5036,
                5204
            ],
            [
                5204,
                5506
            ],
            [
                5506,
                5662
            ],
            [
                5662,
                5725
            ],
            [
                5725,
                5792
            ],
            [
                5792,
                5826
            ],
            [
                5826,
                5888
            ],
            [
                5888,
                6003
            ],
            [
                6003,
                6152
            ],
            [
                6152,
                6181
            ],
            [
                6181,
                6205
            ],
            [
                6205,
                6304
            ],
            [
                6304,
                6362
            ],
            [
                6362,
                6456
            ],
            [
                6456,
                6516
            ],
            [
                6516,
                6597
            ],
            [
                6597,
                6723
            ],
            [
                6723,
                6793
            ],
            [
                6793,
                6889
            ],
            [
                6889,
                6976
            ],
            [
                6976,
                7067
            ],
            [
                7067,
                7359
            ],
            [
                7359,
                7390
            ],
            [
                7390,
                7565
            ],
            [
                7565,
                7803
            ],
            [
                7803,
                7839
            ],
            [
                7839,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8094
            ],
            [
                8094,
                8343
            ],
            [
                8343,
                8377
            ],
            [
                8377,
                8481
            ],
            [
                8481,
                8588
            ],
            [
                8588,
                8771
            ],
            [
                8771,
                8922
            ],
            [
                8922,
                8980
            ],
            [
                8980,
                9011
            ],
            [
                9011,
                9055
            ],
            [
                9055,
                9071
            ],
            [
                9071,
                9166
            ],
            [
                9166,
                9261
            ],
            [
                9261,
                9377
            ],
            [
                9377,
                9463
            ],
            [
                9463,
                9480
            ],
            [
                9480,
                9523
            ],
            [
                9523,
                9613
            ],
            [
                9613,
                9643
            ],
            [
                9643,
                9662
            ],
            [
                9662,
                9713
            ],
            [
                9713,
                9751
            ],
            [
                9751,
                9817
            ],
            [
                9817,
                9960
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                80,
                123
            ],
            [
                123,
                165
            ],
            [
                166,
                256
            ],
            [
                264,
                409
            ],
            [
                409,
                415
            ],
            [
                416,
                458
            ],
            [
                459,
                624
            ],
            [
                624,
                667
            ],
            [
                667,
                758
            ],
            [
                758,
                779
            ],
            [
                780,
                788
            ],
            [
                797,
                800
            ],
            [
                801,
                826
            ],
            [
                839,
                858
            ],
            [
                869,
                886
            ],
            [
                886,
                941
            ],
            [
                941,
                943
            ],
            [
                944,
                948
            ],
            [
                949,
                970
            ],
            [
                970,
                1038
            ],
            [
                1038,
                1069
            ],
            [
                1069,
                1149
            ],
            [
                1150,
                1182
            ],
            [
                1183,
                1200
            ],
            [
                1205,
                1214
            ],
            [
                1223,
                1225
            ],
            [
                1225,
                1243
            ],
            [
                1244,
                1249
            ],
            [
                1250,
                1259
            ],
            [
                1259,
                1280
            ],
            [
                1280,
                1302
            ],
            [
                1302,
                1347
            ],
            [
                1359,
                1502
            ],
            [
                1502,
                1568
            ],
            [
                1568,
                1611
            ],
            [
                1611,
                1648
            ],
            [
                1648,
                1768
            ],
            [
                1768,
                1825
            ],
            [
                1826,
                1829
            ],
            [
                1837,
                1840
            ],
            [
                1854,
                1856
            ],
            [
                1856,
                1956
            ],
            [
                1957,
                2081
            ],
            [
                2081,
                2083
            ],
            [
                2087,
                2092
            ],
            [
                2093,
                2112
            ],
            [
                2113,
                2122
            ],
            [
                2123,
                2130
            ],
            [
                2131,
                2188
            ],
            [
                2188,
                2209
            ],
            [
                2209,
                2315
            ],
            [
                2316,
                2370
            ],
            [
                2371,
                2377
            ],
            [
                2377,
                2441
            ],
            [
                2441,
                2548
            ],
            [
                2548,
                2562
            ],
            [
                2563,
                2618
            ],
            [
                2619,
                2674
            ],
            [
                2674,
                2815
            ],
            [
                2815,
                2817
            ],
            [
                2817,
                2935
            ],
            [
                2936,
                2958
            ],
            [
                2958,
                2967
            ],
            [
                2968,
                3022
            ],
            [
                3023,
                3172
            ],
            [
                3172,
                3194
            ],
            [
                3210,
                3212
            ],
            [
                3212,
                3240
            ],
            [
                3241,
                3307
            ],
            [
                3308,
                3311
            ],
            [
                3312,
                3333
            ],
            [
                3334,
                3337
            ],
            [
                3338,
                3353
            ],
            [
                3353,
                3361
            ],
            [
                3367,
                3378
            ],
            [
                3378,
                3389
            ],
            [
                3390,
                3393
            ],
            [
                3394,
                3439
            ],
            [
                3440,
                3448
            ],
            [
                3449,
                3459
            ],
            [
                3473,
                3478
            ],
            [
                3478,
                3536
            ],
            [
                3541,
                3567
            ],
            [
                3568,
                3607
            ],
            [
                3607,
                3626
            ],
            [
                3626,
                3697
            ],
            [
                3697,
                3711
            ],
            [
                3712,
                3715
            ],
            [
                3716,
                3783
            ],
            [
                3784,
                3787
            ],
            [
                3789,
                3862
            ],
            [
                3862,
                3863
            ],
            [
                3864,
                3891
            ],
            [
                3892,
                3896
            ],
            [
                3898,
                3932
            ],
            [
                3932,
                3952
            ],
            [
                3953,
                3990
            ],
            [
                3991,
                3994
            ],
            [
                3995,
                4021
            ],
            [
                4022,
                4060
            ],
            [
                4066,
                4079
            ],
            [
                4080,
                4087
            ],
            [
                4098,
                4116
            ],
            [
                4117,
                4142
            ],
            [
                4142,
                4144
            ],
            [
                4147,
                4157
            ],
            [
                4157,
                4158
            ],
            [
                4163,
                4169
            ],
            [
                4170,
                4178
            ],
            [
                4179,
                4191
            ],
            [
                4194,
                4201
            ],
            [
                4202,
                4220
            ],
            [
                4220,
                4222
            ],
            [
                4226,
                4259
            ],
            [
                4260,
                4303
            ],
            [
                4304,
                4363
            ],
            [
                4364,
                4394
            ],
            [
                4395,
                4409
            ],
            [
                4410,
                4444
            ],
            [
                4444,
                4446
            ],
            [
                4457,
                4464
            ],
            [
                4468,
                4476
            ],
            [
                4477,
                4488
            ],
            [
                4489,
                4517
            ],
            [
                4517,
                4641
            ],
            [
                4641,
                4695
            ],
            [
                4695,
                4697
            ],
            [
                4697,
                4737
            ],
            [
                4737,
                4785
            ],
            [
                4785,
                4822
            ],
            [
                4823,
                4830
            ],
            [
                4831,
                4838
            ],
            [
                4838,
                4859
            ],
            [
                4864,
                4866
            ],
            [
                4873,
                4882
            ],
            [
                4883,
                4890
            ],
            [
                4890,
                4892
            ],
            [
                4892,
                4947
            ],
            [
                4947,
                4979
            ],
            [
                4984,
                4989
            ],
            [
                4990,
                5035
            ],
            [
                5036,
                5048
            ],
            [
                5052,
                5101
            ],
            [
                5102,
                5109
            ],
            [
                5109,
                5160
            ],
            [
                5168,
                5202
            ],
            [
                5202,
                5204
            ],
            [
                5204,
                5254
            ],
            [
                5262,
                5394
            ],
            [
                5395,
                5472
            ],
            [
                5476,
                5503
            ],
            [
                5506,
                5534
            ],
            [
                5534,
                5662
            ],
            [
                5662,
                5709
            ],
            [
                5715,
                5725
            ],
            [
                5725,
                5775
            ],
            [
                5776,
                5792
            ],
            [
                5792,
                5824
            ],
            [
                5824,
                5826
            ],
            [
                5826,
                5888
            ],
            [
                5888,
                5917
            ],
            [
                5919,
                5996
            ],
            [
                6001,
                6003
            ],
            [
                6003,
                6150
            ],
            [
                6150,
                6152
            ],
            [
                6152,
                6181
            ],
            [
                6181,
                6205
            ],
            [
                6205,
                6293
            ],
            [
                6294,
                6304
            ],
            [
                6304,
                6360
            ],
            [
                6360,
                6362
            ],
            [
                6362,
                6456
            ],
            [
                6456,
                6516
            ],
            [
                6516,
                6597
            ],
            [
                6597,
                6606
            ],
            [
                6606,
                6607
            ],
            [
                6615,
                6619
            ],
            [
                6619,
                6620
            ],
            [
                6621,
                6723
            ],
            [
                6723,
                6791
            ],
            [
                6791,
                6793
            ],
            [
                6793,
                6887
            ],
            [
                6887,
                6889
            ],
            [
                6889,
                6976
            ],
            [
                6976,
                7067
            ],
            [
                7067,
                7195
            ],
            [
                7196,
                7257
            ],
            [
                7258,
                7316
            ],
            [
                7317,
                7329
            ],
            [
                7343,
                7357
            ],
            [
                7357,
                7359
            ],
            [
                7359,
                7390
            ],
            [
                7390,
                7468
            ],
            [
                7469,
                7480
            ],
            [
                7482,
                7490
            ],
            [
                7491,
                7495
            ],
            [
                7499,
                7565
            ],
            [
                7565,
                7605
            ],
            [
                7619,
                7649
            ],
            [
                7656,
                7714
            ],
            [
                7715,
                7769
            ],
            [
                7770,
                7776
            ],
            [
                7777,
                7802
            ],
            [
                7803,
                7839
            ],
            [
                7839,
                7916
            ],
            [
                7917,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8094
            ],
            [
                8094,
                8103
            ],
            [
                8104,
                8343
            ],
            [
                8343,
                8377
            ],
            [
                8377,
                8391
            ],
            [
                8392,
                8409
            ],
            [
                8410,
                8481
            ],
            [
                8481,
                8494
            ],
            [
                8499,
                8588
            ],
            [
                8588,
                8616
            ],
            [
                8617,
                8620
            ],
            [
                8621,
                8647
            ],
            [
                8656,
                8746
            ],
            [
                8754,
                8757
            ],
            [
                8764,
                8771
            ],
            [
                8771,
                8795
            ],
            [
                8796,
                8800
            ],
            [
                8801,
                8824
            ],
            [
                8824,
                8825
            ],
            [
                8831,
                8855
            ],
            [
                8855,
                8922
            ],
            [
                8922,
                8945
            ],
            [
                8946,
                8950
            ],
            [
                8950,
                8980
            ],
            [
                8980,
                9009
            ],
            [
                9011,
                9055
            ],
            [
                9055,
                9069
            ],
            [
                9071,
                9085
            ],
            [
                9086,
                9089
            ],
            [
                9090,
                9113
            ],
            [
                9113,
                9124
            ],
            [
                9124,
                9163
            ],
            [
                9166,
                9261
            ],
            [
                9261,
                9377
            ],
            [
                9377,
                9401
            ],
            [
                9402,
                9417
            ],
            [
                9418,
                9461
            ],
            [
                9461,
                9463
            ],
            [
                9463,
                9480
            ],
            [
                9494,
                9523
            ],
            [
                9523,
                9611
            ],
            [
                9611,
                9613
            ],
            [
                9613,
                9643
            ],
            [
                9643,
                9662
            ],
            [
                9662,
                9713
            ],
            [
                9713,
                9751
            ],
            [
                9751,
                9817
            ],
            [
                9817,
                9835
            ],
            [
                9840,
                9862
            ],
            [
                9863,
                9902
            ],
            [
                9902,
                9934
            ],
            [
                9934,
                9935
            ],
            [
                9936,
                9960
            ]
        ],
        "row_chars": [
            [
                0,
                80
            ],
            [
                80,
                123
            ],
            [
                123,
                123
            ],
            [
                123,
                409
            ],
            [
                409,
                624
            ],
            [
                624,
                667
            ],
            [
                667,
                886
            ],
            [
                886,
                941
            ],
            [
                941,
                970
            ],
            [
                970,
                1225
            ],
            [
                1225,
                1280
            ],
            [
                1280,
                1302
            ],
            [
                1302,
                1502
            ],
            [
                1502,
                1568
            ],
            [
                1568,
                1568
            ],
            [
                1568,
                1611
            ],
            [
                1611,
                1648
            ],
            [
                1648,
                1768
            ],
            [
                1768,
                1856
            ],
            [
                1856,
                2083
            ],
            [
                2083,
                2188
            ],
            [
                2188,
                2377
            ],
            [
                2377,
                2441
            ],
            [
                2441,
                2548
            ],
            [
                2548,
                2674
            ],
            [
                2674,
                2817
            ],
            [
                2817,
                3172
            ],
            [
                3172,
                3212
            ],
            [
                3212,
                3353
            ],
            [
                3353,
                3378
            ],
            [
                3378,
                3607
            ],
            [
                3607,
                3607
            ],
            [
                3607,
                3626
            ],
            [
                3626,
                3697
            ],
            [
                3697,
                3864
            ],
            [
                3864,
                3864
            ],
            [
                3864,
                3932
            ],
            [
                3932,
                4144
            ],
            [
                4144,
                4222
            ],
            [
                4222,
                4446
            ],
            [
                4446,
                4517
            ],
            [
                4517,
                4641
            ],
            [
                4641,
                4697
            ],
            [
                4697,
                4697
            ],
            [
                4697,
                4785
            ],
            [
                4785,
                4892
            ],
            [
                4892,
                4947
            ],
            [
                4947,
                4947
            ],
            [
                4947,
                5036
            ],
            [
                5036,
                5204
            ],
            [
                5204,
                5506
            ],
            [
                5506,
                5506
            ],
            [
                5506,
                5506
            ],
            [
                5506,
                5506
            ],
            [
                5506,
                5662
            ],
            [
                5662,
                5725
            ],
            [
                5725,
                5792
            ],
            [
                5792,
                5826
            ],
            [
                5826,
                5888
            ],
            [
                5888,
                6003
            ],
            [
                6003,
                6152
            ],
            [
                6152,
                6181
            ],
            [
                6181,
                6205
            ],
            [
                6205,
                6304
            ],
            [
                6304,
                6362
            ],
            [
                6362,
                6456
            ],
            [
                6456,
                6456
            ],
            [
                6456,
                6516
            ],
            [
                6516,
                6597
            ],
            [
                6597,
                6723
            ],
            [
                6723,
                6793
            ],
            [
                6793,
                6889
            ],
            [
                6889,
                6976
            ],
            [
                6976,
                7067
            ],
            [
                7067,
                7359
            ],
            [
                7359,
                7390
            ],
            [
                7390,
                7565
            ],
            [
                7565,
                7803
            ],
            [
                7803,
                7803
            ],
            [
                7803,
                7803
            ],
            [
                7803,
                7839
            ],
            [
                7839,
                7933
            ],
            [
                7933,
                7973
            ],
            [
                7973,
                8094
            ],
            [
                8094,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8377
            ],
            [
                8377,
                8481
            ],
            [
                8481,
                8588
            ],
            [
                8588,
                8771
            ],
            [
                8771,
                8922
            ],
            [
                8922,
                8980
            ],
            [
                8980,
                9011
            ],
            [
                9011,
                9055
            ],
            [
                9055,
                9071
            ],
            [
                9071,
                9166
            ],
            [
                9166,
                9166
            ],
            [
                9166,
                9261
            ],
            [
                9261,
                9261
            ],
            [
                9261,
                9377
            ],
            [
                9377,
                9463
            ],
            [
                9463,
                9480
            ],
            [
                9480,
                9480
            ],
            [
                9480,
                9480
            ],
            [
                9480,
                9523
            ],
            [
                9523,
                9613
            ],
            [
                9613,
                9643
            ],
            [
                9643,
                9662
            ],
            [
                9662,
                9662
            ],
            [
                9662,
                9713
            ],
            [
                9713,
                9751
            ],
            [
                9751,
                9817
            ],
            [
                9817,
                9960
            ]
        ]
    }
}