{
    "original": {
        "text": "Edmund had determined that it belonged entirely to Fanny to chuse whether her situation with regard to Crawford should be mentioned between them or not; and that if she did not lead the way, it should never be touched on by him; but after a day or two of mutual reserve, he was induced by his father to change his mind, and try what his influence might do for his friend.\nA day, and a very early day, was actually fixed for the Crawfords' departure; and Sir Thomas thought it might be as well to make one more effort for the young man before he left Mansfield, that all his professions and vows of unshaken attachment might have as much hope to sustain them as possible.\nSir Thomas was most cordially anxious for the perfection of Mr. Crawford's character in that point. He wished him to be a model of constancy; and fancied the best means of effecting it would be by not trying him too long.\nEdmund was not unwilling to be persuaded to engage in the business; he wanted to know Fanny's feelings. She had been used to consult him in every difficulty, and he loved her too well to bear to be denied her confidence now; he hoped to be of service to her, he thought he must be of service to her; whom else had she to open her heart to? If she did not need counsel, she must need the comfort of communication. Fanny estranged from him, silent and reserved, was an unnatural state of things; a state which he must break through, and which he could easily learn to think she was wanting him to break through.\n\"I will speak to her, sir: I will take the first opportunity of speaking to her alone,\" was the result of such thoughts as these; and upon Sir Thomas's information of her being at that very time walking alone in the shrubbery, he instantly joined her.\n\"I am come to walk with you, Fanny,\" said he. \"Shall I?\" Drawing her arm within his. \"It is a long while since we have had a comfortable walk together.\"\nShe assented to it all rather by look than word. Her spirits were low.\n\"But, Fanny,\" he presently added, \"in order to have a comfortable walk, something more is necessary than merely pacing this gravel together. You must talk to me. I know you have something on your mind. I know what you are thinking of. You cannot suppose me uninformed. Am I to hear of it from everybody but Fanny herself?\"\nFanny, at once agitated and dejected, replied, \"If you hear of it from everybody, cousin, there can be nothing for me to tell.\"\n\"Not of facts, perhaps; but of feelings, Fanny. No one but you can tell me them. I do not mean to press you, however. If it is not what you wish yourself, I have done. I had thought it might be a relief.\"\n\"I am afraid we think too differently for me to find any relief in talking of what I feel.\"\n\"Do you suppose that we think differently? I have no idea of it. I dare say that, on a comparison of our opinions, they would be found as much alike as they have been used to be: to the point-I consider Crawford's proposals as most advantageous and desirable, if you could return his affection. I consider it as most natural that all your family should wish you could return it; but that, as you cannot, you have done exactly as you ought in refusing him. Can there be any disagreement between us here?\"\n\"Oh no! But I thought you blamed me. I thought you were against me. This is such a comfort!\"\n\"This comfort you might have had sooner, Fanny, had you sought it. But how could you possibly suppose me against you? How could you imagine me an advocate for marriage without love? Were I even careless in general on such matters, how could you imagine me so where your happiness was at stake?\"\n\"My uncle thought me wrong, and I knew he had been talking to you.\"\n\"As far as you have gone, Fanny, I think you perfectly right. I may be sorry, I may be surprised-though hardly _that_, for you had not had time to attach yourself-but I think you perfectly right. Can it admit of a question? It is disgraceful to us if it does. You did not love him; nothing could have justified your accepting him.\"\nFanny had not felt so comfortable for days and days.\n\"So far your conduct has been faultless, and they were quite mistaken who wished you to do otherwise. But the matter does not end here. Crawford's is no common attachment; he perseveres, with the hope of creating that regard which had not been created before. This, we know, must be a work of time. But\" (with an affectionate smile) \"let him succeed at last, Fanny, let him succeed at last. You have proved yourself upright and disinterested, prove yourself grateful and tender-hearted; and then you will be the perfect model of a woman which I have always believed you born for.\"\n\"Oh! never, never, never! he never will succeed with me.\" And she spoke with a warmth which quite astonished Edmund, and which she blushed at the recollection of herself, when she saw his look, and heard him reply, \"Never! Fanny!-so very determined and positive! This is not like yourself, your rational self.\"\n\"I mean,\" she cried, sorrowfully correcting herself, \"that I _think_ I never shall, as far as the future can be answered for; I think I never shall return his regard.\"\n\"I must hope better things. I am aware, more aware than Crawford can be, that the man who means to make you love him (you having due notice of his intentions) must have very uphill work, for there are all your early attachments and habits in battle array; and before he can get your heart for his own use he has to unfasten it from all the holds upon things animate and inanimate, which so many years' growth have confirmed, and which are considerably tightened for the moment by the very idea of separation. I know that the apprehension of being forced to quit Mansfield will for a time be arming you against him. I wish he had not been obliged to tell you what he was trying for. I wish he had known you as well as I do, Fanny. Between us, I think we should have won you. My theoretical and his practical knowledge together could not have failed. He should have worked upon my plans. I must hope, however, that time, proving him (as I firmly believe it will) to deserve you by his steady affection, will give him his reward. I cannot suppose that you have not the _wish_ to love him-the natural wish of gratitude. You must have some feeling of that sort. You must be sorry for your own indifference.\"\n\"We are so totally unlike,\" said Fanny, avoiding a direct answer, \"we are so very, very different in all our inclinations and ways, that I consider it as quite impossible we should ever be tolerably happy together, even if I _could_ like him. There never were two people more dissimilar. We have not one taste in common. We should be miserable.\"\n\"You are mistaken, Fanny. The dissimilarity is not so strong. You are quite enough alike. You _have_ tastes in common. You have moral and literary tastes in common. You have both warm hearts and benevolent feelings; and, Fanny, who that heard him read, and saw you listen to Shakespeare the other night, will think you unfitted as companions? You forget yourself: there is a decided difference in your tempers, I allow. He is lively, you are serious; but so much the better: his spirits will support yours. It is your disposition to be easily dejected and to fancy difficulties greater than they are. His cheerfulness will counteract this. He sees difficulties nowhere: and his pleasantness and gaiety will be a constant support to you. Your being so far unlike, Fanny, does not in the smallest degree make against the probability of your happiness together: do not imagine it. I am myself convinced that it is rather a favourable circumstance. I am perfectly persuaded that the tempers had better be unlike: I mean unlike in the flow of the spirits, in the manners, in the inclination for much or little company, in the propensity to talk or to be silent, to be grave or to be gay. Some opposition here is, I am thoroughly convinced, friendly to matrimonial happiness. I exclude extremes, of course; and a very close resemblance in all those points would be the likeliest way to produce an extreme. A counteraction, gentle and continual, is the best safeguard of manners and conduct.\"\nFull well could Fanny guess where his thoughts were now: Miss Crawford's power was all returning. He had been speaking of her cheerfully from the hour of his coming home. His avoiding her was quite at an end. He had dined at the Parsonage only the preceding day.\nAfter leaving him to his happier thoughts for some minutes, Fanny, feeling it due to herself, returned to Mr. Crawford, and said, \"It is not merely in _temper_ that I consider him as totally unsuited to myself; though, in _that_ respect, I think the difference between us too great, infinitely too great: his spirits often oppress me; but there is something in him which I object to still more. I must say, cousin, that I cannot approve his character. I have not thought well of him from the time of the play. I then saw him behaving, as it appeared to me, so very improperly and unfeelingly-I may speak of it now because it is all over-so improperly by poor Mr. Rushworth, not seeming to care how he exposed or hurt him, and paying attentions to my cousin Maria, which-in short, at the time of the play, I received an impression which will never be got over.\"\n\"My dear Fanny,\" replied Edmund, scarcely hearing her to the end, \"let us not, any of us, be judged by what we appeared at that period of general folly. The time of the play is a time which I hate to recollect. Maria was wrong, Crawford was wrong, we were all wrong together; but none so wrong as myself. Compared with me, all the rest were blameless. I was playing the fool with my eyes open.\"\n\"As a bystander,\" said Fanny, \"perhaps I saw more than you did; and I do think that Mr. Rushworth was sometimes very jealous.\"\n\"Very possibly. No wonder. Nothing could be more improper than the whole business. I am shocked whenever I think that Maria could be capable of it; but, if she could undertake the part, we must not be surprised at the rest.\"\n\"Before the play, I am much mistaken if _Julia_ did not think he was paying her attentions.\"\n\"Julia! I have heard before from some one of his being in love with Julia; but I could never see anything of it. And, Fanny, though I hope I do justice to my sisters' good qualities, I think it very possible that they might, one or both, be more desirous of being admired by Crawford, and might shew that desire rather more unguardedly than was perfectly prudent. I can remember that they were evidently fond of his society; and with such encouragement, a man like Crawford, lively, and it may be, a little unthinking, might be led on to-there could be nothing very striking, because it is clear that he had no pretensions: his heart was reserved for you. And I must say, that its being for you has raised him inconceivably in my opinion. It does him the highest honour; it shews his proper estimation of the blessing of domestic happiness and pure attachment. It proves him unspoilt by his uncle. It proves him, in short, everything that I had been used to wish to believe him, and feared he was not.\"\n\"I am persuaded that he does not think, as he ought, on serious subjects.\"\n\"Say, rather, that he has not thought at all upon serious subjects, which I believe to be a good deal the case. How could it be otherwise, with such an education and adviser? Under the disadvantages, indeed, which both have had, is it not wonderful that they should be what they are? Crawford's _feelings_, I am ready to acknowledge, have hitherto been too much his guides. Happily, those feelings have generally been good. You will supply the rest; and a most fortunate man he is to attach himself to such a creature-to a woman who, firm as a rock in her own principles, has a gentleness of character so well adapted to recommend them. He has chosen his partner, indeed, with rare felicity. He will make you happy, Fanny; I know he will make you happy; but you will make him everything.\"\n\"I would not engage in such a charge,\" cried Fanny, in a shrinking accent; \"in such an office of high responsibility!\"\n\"As usual, believing yourself unequal to anything! fancying everything too much for you! Well, though I may not be able to persuade you into different feelings, you will be persuaded into them, I trust. I confess myself sincerely anxious that you may. I have no common interest in Crawford's well-doing. Next to your happiness, Fanny, his has the first claim on me. You are aware of my having no common interest in Crawford.\"\nFanny was too well aware of it to have anything to say; and they walked on together some fifty yards in mutual silence and abstraction. Edmund first began again-\n\"I was very much pleased by her manner of speaking of it yesterday, particularly pleased, because I had not depended upon her seeing everything in so just a light. I knew she was very fond of you; but yet I was afraid of her not estimating your worth to her brother quite as it deserved, and of her regretting that he had not rather fixed on some woman of distinction or fortune. I was afraid of the bias of those worldly maxims, which she has been too much used to hear. But it was very different. She spoke of you, Fanny, just as she ought. She desires the connexion as warmly as your uncle or myself. We had a long talk about it. I should not have mentioned the subject, though very anxious to know her sentiments; but I had not been in the room five minutes before she began introducing it with all that openness of heart, and sweet peculiarity of manner, that spirit and ingenuousness which are so much a part of herself. Mrs. Grant laughed at her for her rapidity.\"\n\"Was Mrs. Grant in the room, then?\"\n\"Yes, when I reached the house I found the two sisters together by themselves; and when once we had begun, we had not done with you, Fanny, till Crawford and Dr. Grant came in.\"\n\"It is above a week since I saw Miss Crawford.\"\n\"Yes, she laments it; yet owns it may have been best. You will see her, however, before she goes. She is very angry with you, Fanny; you must be prepared for that. She calls herself very angry, but you can imagine her anger. It is the regret and disappointment of a sister, who thinks her brother has a right to everything he may wish for, at the first moment. She is hurt, as you would be for William; but she loves and esteems you with all her heart.\"\n\"I knew she would be very angry with me.\"\n\"My dearest Fanny,\" cried Edmund, pressing her arm closer to him, \"do not let the idea of her anger distress you. It is anger to be talked of rather than felt. Her heart is made for love and kindness, not for resentment. I wish you could have overheard her tribute of praise; I wish you could have seen her countenance, when she said that you _should_ be Henry's wife. And I observed that she always spoke of you as 'Fanny,' which she was never used to do; and it had a sound of most sisterly cordiality.\"\n\"And Mrs. Grant, did she say-did she speak; was she there all the time?\"\n\"Yes, she was agreeing exactly with her sister. The surprise of your refusal, Fanny, seems to have been unbounded. That you could refuse such a man as Henry Crawford seems more than they can understand. I said what I could for you; but in good truth, as they stated the case-you must prove yourself to be in your senses as soon as you can by a different conduct; nothing else will satisfy them. But this is teasing you. I have done. Do not turn away from me.\"\n\"I _should_ have thought,\" said Fanny, after a pause of recollection and exertion, \"that every woman must have felt the possibility of a man's not being approved, not being loved by some one of her sex at least, let him be ever so generally agreeable. Let him have all the perfections in the world, I think it ought not to be set down as certain that a man must be acceptable to every woman he may happen to like himself. But, even supposing it is so, allowing Mr. Crawford to have all the claims which his sisters think he has, how was I to be prepared to meet him with any feeling answerable to his own? He took me wholly by surprise. I had not an idea that his behaviour to me before had any meaning; and surely I was not to be teaching myself to like him only because he was taking what seemed very idle notice of me. In my situation, it would have been the extreme of vanity to be forming expectations on Mr. Crawford. I am sure his sisters, rating him as they do, must have thought it so, supposing he had meant nothing. How, then, was I to be-to be in love with him the moment he said he was with me? How was I to have an attachment at his service, as soon as it was asked for? His sisters should consider me as well as him. The higher his deserts, the more improper for me ever to have thought of him. And, and-we think very differently of the nature of women, if they can imagine a woman so very soon capable of returning an affection as this seems to imply.\"\n\"My dear, dear Fanny, now I have the truth. I know this to be the truth; and most worthy of you are such feelings. I had attributed them to you before. I thought I could understand you. You have now given exactly the explanation which I ventured to make for you to your friend and Mrs. Grant, and they were both better satisfied, though your warm-hearted friend was still run away with a little by the enthusiasm of her fondness for Henry. I told them that you were of all human creatures the one over whom habit had most power and novelty least; and that the very circumstance of the novelty of Crawford's addresses was against him. Their being so new and so recent was all in their disfavour; that you could tolerate nothing that you were not used to; and a great deal more to the same purpose, to give them a knowledge of your character. Miss Crawford made us laugh by her plans of encouragement for her brother. She meant to urge him to persevere in the hope of being loved in time, and of having his addresses most kindly received at the end of about ten years' happy marriage.\"\nFanny could with difficulty give the smile that was here asked for. Her feelings were all in revolt. She feared she had been doing wrong: saying too much, overacting the caution which she had been fancying necessary; in guarding against one evil, laying herself open to another; and to have Miss Crawford's liveliness repeated to her at such a moment, and on such a subject, was a bitter aggravation.\nEdmund saw weariness and distress in her face, and immediately resolved to forbear all farther discussion; and not even to mention the name of Crawford again, except as it might be connected with what _must_ be agreeable to her. On this principle, he soon afterwards observed-\"They go on Monday. You are sure, therefore, of seeing your friend either to-morrow or Sunday. They really go on Monday; and I was within a trifle of being persuaded to stay at Lessingby till that very day! I had almost promised it. What a difference it might have made! Those five or six days more at Lessingby might have been felt all my life.\"\n\"You were near staying there?\"\n\"Very. I was most kindly pressed, and had nearly consented. Had I received any letter from Mansfield, to tell me how you were all going on, I believe I should certainly have staid; but I knew nothing that had happened here for a fortnight, and felt that I had been away long enough.\"\n\"You spent your time pleasantly there?\"\n\"Yes; that is, it was the fault of my own mind if I did not. They were all very pleasant. I doubt their finding me so. I took uneasiness with me, and there was no getting rid of it till I was in Mansfield again.\"\n\"The Miss Owens-you liked them, did not you?\"\n\"Yes, very well. Pleasant, good-humoured, unaffected girls. But I am spoilt, Fanny, for common female society. Good-humoured, unaffected girls will not do for a man who has been used to sensible women. They are two distinct orders of being. You and Miss Crawford have made me too nice.\"\nStill, however, Fanny was oppressed and wearied; he saw it in her looks, it could not be talked away; and attempting it no more, he led her directly, with the kind authority of a privileged guardian, into the house.",
        "paragraph_chars": [
            [
                0,
                372
            ],
            [
                372,
                671
            ],
            [
                671,
                893
            ],
            [
                893,
                1503
            ],
            [
                1503,
                1755
            ],
            [
                1755,
                1908
            ],
            [
                1908,
                1979
            ],
            [
                1979,
                2302
            ],
            [
                2302,
                2430
            ],
            [
                2430,
                2635
            ],
            [
                2635,
                2727
            ],
            [
                2727,
                3231
            ],
            [
                3231,
                3324
            ],
            [
                3324,
                3619
            ],
            [
                3619,
                3687
            ],
            [
                3687,
                4019
            ],
            [
                4019,
                4072
            ],
            [
                4072,
                4653
            ],
            [
                4653,
                4964
            ],
            [
                4964,
                5132
            ],
            [
                5132,
                6335
            ],
            [
                6335,
                6681
            ],
            [
                6681,
                8167
            ],
            [
                8167,
                8430
            ],
            [
                8430,
                9291
            ],
            [
                9291,
                9686
            ],
            [
                9686,
                9813
            ],
            [
                9813,
                10038
            ],
            [
                10038,
                10131
            ],
            [
                10131,
                11134
            ],
            [
                11134,
                11209
            ],
            [
                11209,
                11998
            ],
            [
                11998,
                12117
            ],
            [
                12117,
                12543
            ],
            [
                12543,
                12705
            ],
            [
                12705,
                13677
            ],
            [
                13677,
                13713
            ],
            [
                13713,
                13891
            ],
            [
                13891,
                13939
            ],
            [
                13939,
                14393
            ],
            [
                14393,
                14435
            ],
            [
                14435,
                14941
            ],
            [
                14941,
                15014
            ],
            [
                15014,
                15474
            ],
            [
                15474,
                16943
            ],
            [
                16943,
                18027
            ],
            [
                18027,
                18428
            ],
            [
                18428,
                19051
            ],
            [
                19051,
                19082
            ],
            [
                19082,
                19366
            ],
            [
                19366,
                19406
            ],
            [
                19406,
                19619
            ],
            [
                19619,
                19665
            ],
            [
                19665,
                19952
            ],
            [
                19952,
                20167
            ]
        ],
        "segment_chars": [
            [
                0,
                372
            ],
            [
                372,
                671
            ],
            [
                671,
                771
            ],
            [
                771,
                893
            ],
            [
                893,
                997
            ],
            [
                997,
                1233
            ],
            [
                1233,
                1306
            ],
            [
                1306,
                1503
            ],
            [
                1503,
                1755
            ],
            [
                1755,
                1801
            ],
            [
                1801,
                1812
            ],
            [
                1812,
                1840
            ],
            [
                1840,
                1908
            ],
            [
                1908,
                1957
            ],
            [
                1957,
                1979
            ],
            [
                1979,
                2120
            ],
            [
                2120,
                2141
            ],
            [
                2141,
                2181
            ],
            [
                2181,
                2214
            ],
            [
                2214,
                2248
            ],
            [
                2248,
                2302
            ],
            [
                2302,
                2430
            ],
            [
                2430,
                2478
            ],
            [
                2478,
                2511
            ],
            [
                2511,
                2548
            ],
            [
                2548,
                2598
            ],
            [
                2598,
                2635
            ],
            [
                2635,
                2727
            ],
            [
                2727,
                2770
            ],
            [
                2770,
                2792
            ],
            [
                2792,
                3022
            ],
            [
                3022,
                3183
            ],
            [
                3183,
                3231
            ],
            [
                3231,
                3239
            ],
            [
                3239,
                3268
            ],
            [
                3268,
                3299
            ],
            [
                3299,
                3324
            ],
            [
                3324,
                3391
            ],
            [
                3391,
                3442
            ],
            [
                3442,
                3506
            ],
            [
                3506,
                3619
            ],
            [
                3619,
                3687
            ],
            [
                3687,
                3749
            ],
            [
                3749,
                3883
            ],
            [
                3883,
                3911
            ],
            [
                3911,
                3947
            ],
            [
                3947,
                4019
            ],
            [
                4019,
                4072
            ],
            [
                4072,
                4174
            ],
            [
                4174,
                4208
            ],
            [
                4208,
                4332
            ],
            [
                4332,
                4371
            ],
            [
                4371,
                4463
            ],
            [
                4463,
                4653
            ],
            [
                4653,
                4658
            ],
            [
                4658,
                4679
            ],
            [
                4679,
                4711
            ],
            [
                4711,
                4876
            ],
            [
                4876,
                4916
            ],
            [
                4916,
                4964
            ],
            [
                4964,
                5132
            ],
            [
                5132,
                5160
            ],
            [
                5160,
                5641
            ],
            [
                5641,
                5747
            ],
            [
                5747,
                5814
            ],
            [
                5814,
                5862
            ],
            [
                5862,
                5906
            ],
            [
                5906,
                5981
            ],
            [
                5981,
                6018
            ],
            [
                6018,
                6159
            ],
            [
                6159,
                6248
            ],
            [
                6248,
                6289
            ],
            [
                6289,
                6335
            ],
            [
                6335,
                6578
            ],
            [
                6578,
                6623
            ],
            [
                6623,
                6656
            ],
            [
                6656,
                6681
            ],
            [
                6681,
                6707
            ],
            [
                6707,
                6743
            ],
            [
                6743,
                6771
            ],
            [
                6771,
                6800
            ],
            [
                6800,
                6846
            ],
            [
                6846,
                7024
            ],
            [
                7024,
                7101
            ],
            [
                7101,
                7188
            ],
            [
                7188,
                7282
            ],
            [
                7282,
                7321
            ],
            [
                7321,
                7418
            ],
            [
                7418,
                7559
            ],
            [
                7559,
                7626
            ],
            [
                7626,
                7864
            ],
            [
                7864,
                7951
            ],
            [
                7951,
                8081
            ],
            [
                8081,
                8167
            ],
            [
                8167,
                8265
            ],
            [
                8265,
                8338
            ],
            [
                8338,
                8376
            ],
            [
                8376,
                8430
            ],
            [
                8430,
                8825
            ],
            [
                8825,
                8882
            ],
            [
                8882,
                8940
            ],
            [
                8940,
                9291
            ],
            [
                9291,
                9444
            ],
            [
                9444,
                9502
            ],
            [
                9502,
                9596
            ],
            [
                9596,
                9643
            ],
            [
                9643,
                9686
            ],
            [
                9686,
                9813
            ],
            [
                9813,
                9829
            ],
            [
                9829,
                9840
            ],
            [
                9840,
                9896
            ],
            [
                9896,
                10038
            ],
            [
                10038,
                10131
            ],
            [
                10131,
                10139
            ],
            [
                10139,
                10244
            ],
            [
                10244,
                10495
            ],
            [
                10495,
                10787
            ],
            [
                10787,
                10870
            ],
            [
                10870,
                10992
            ],
            [
                10992,
                11029
            ],
            [
                11029,
                11134
            ],
            [
                11134,
                11209
            ],
            [
                11209,
                11321
            ],
            [
                11321,
                11384
            ],
            [
                11384,
                11493
            ],
            [
                11493,
                11583
            ],
            [
                11583,
                11633
            ],
            [
                11633,
                11846
            ],
            [
                11846,
                11901
            ],
            [
                11901,
                11998
            ],
            [
                11998,
                12117
            ],
            [
                12117,
                12168
            ],
            [
                12168,
                12206
            ],
            [
                12206,
                12320
            ],
            [
                12320,
                12369
            ],
            [
                12369,
                12421
            ],
            [
                12421,
                12483
            ],
            [
                12483,
                12543
            ],
            [
                12543,
                12679
            ],
            [
                12679,
                12705
            ],
            [
                12705,
                12869
            ],
            [
                12869,
                13085
            ],
            [
                13085,
                13177
            ],
            [
                13177,
                13204
            ],
            [
                13204,
                13248
            ],
            [
                13248,
                13309
            ],
            [
                13309,
                13338
            ],
            [
                13338,
                13632
            ],
            [
                13632,
                13677
            ],
            [
                13677,
                13713
            ],
            [
                13713,
                13891
            ],
            [
                13891,
                13939
            ],
            [
                13939,
                13993
            ],
            [
                13993,
                14037
            ],
            [
                14037,
                14103
            ],
            [
                14103,
                14164
            ],
            [
                14164,
                14300
            ],
            [
                14300,
                14393
            ],
            [
                14393,
                14435
            ],
            [
                14435,
                14549
            ],
            [
                14549,
                14595
            ],
            [
                14595,
                14656
            ],
            [
                14656,
                14804
            ],
            [
                14804,
                14941
            ],
            [
                14941,
                15014
            ],
            [
                15014,
                15062
            ],
            [
                15062,
                15129
            ],
            [
                15129,
                15217
            ],
            [
                15217,
                15409
            ],
            [
                15409,
                15434
            ],
            [
                15434,
                15447
            ],
            [
                15447,
                15474
            ],
            [
                15474,
                15726
            ],
            [
                15726,
                15896
            ],
            [
                15896,
                16080
            ],
            [
                16080,
                16111
            ],
            [
                16111,
                16296
            ],
            [
                16296,
                16398
            ],
            [
                16398,
                16501
            ],
            [
                16501,
                16582
            ],
            [
                16582,
                16659
            ],
            [
                16659,
                16706
            ],
            [
                16706,
                16784
            ],
            [
                16784,
                16943
            ],
            [
                16943,
                16987
            ],
            [
                16987,
                17058
            ],
            [
                17058,
                17095
            ],
            [
                17095,
                17129
            ],
            [
                17129,
                17383
            ],
            [
                17383,
                17577
            ],
            [
                17577,
                17784
            ],
            [
                17784,
                17859
            ],
            [
                17859,
                18027
            ],
            [
                18027,
                18095
            ],
            [
                18095,
                18128
            ],
            [
                18128,
                18428
            ],
            [
                18428,
                18657
            ],
            [
                18657,
                18724
            ],
            [
                18724,
                18799
            ],
            [
                18799,
                18911
            ],
            [
                18911,
                18937
            ],
            [
                18937,
                18975
            ],
            [
                18975,
                19051
            ],
            [
                19051,
                19082
            ],
            [
                19082,
                19089
            ],
            [
                19089,
                19142
            ],
            [
                19142,
                19366
            ],
            [
                19366,
                19406
            ],
            [
                19406,
                19467
            ],
            [
                19467,
                19496
            ],
            [
                19496,
                19525
            ],
            [
                19525,
                19619
            ],
            [
                19619,
                19665
            ],
            [
                19665,
                19682
            ],
            [
                19682,
                19725
            ],
            [
                19725,
                19776
            ],
            [
                19776,
                19867
            ],
            [
                19867,
                19906
            ],
            [
                19906,
                19952
            ],
            [
                19952,
                20167
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                162,
                164
            ],
            [
                51,
                56
            ],
            [
                169,
                176
            ],
            [
                48,
                50
            ],
            [
                252,
                254
            ],
            [
                27,
                29
            ],
            [
                189,
                190
            ],
            [
                74,
                87
            ],
            [
                194,
                251
            ],
            [
                289,
                299
            ],
            [
                278,
                285
            ],
            [
                300,
                372
            ],
            [
                390,
                399
            ],
            [
                401,
                404
            ],
            [
                414,
                560
            ],
            [
                561,
                565
            ],
            [
                570,
                573
            ],
            [
                590,
                671
            ],
            [
                671,
                690
            ],
            [
                701,
                771
            ],
            [
                771,
                842
            ],
            [
                853,
                871
            ],
            [
                879,
                893
            ],
            [
                893,
                903
            ],
            [
                924,
                936
            ],
            [
                918,
                920
            ],
            [
                979,
                984
            ],
            [
                959,
                978
            ],
            [
                987,
                997
            ],
            [
                997,
                1000
            ],
            [
                1010,
                1116
            ],
            [
                1193,
                1233
            ],
            [
                1306,
                1422
            ],
            [
                1501,
                1502
            ],
            [
                1591,
                1594
            ],
            [
                1698,
                1729
            ],
            [
                1523,
                1524
            ],
            [
                1730,
                1732
            ],
            [
                1743,
                1755
            ],
            [
                1755,
                1799
            ],
            [
                1812,
                1840
            ],
            [
                1840,
                1908
            ],
            [
                1908,
                1920
            ],
            [
                1931,
                1957
            ],
            [
                1957,
                1979
            ],
            [
                1979,
                1995
            ],
            [
                2006,
                2050
            ],
            [
                2120,
                2141
            ],
            [
                2141,
                2181
            ],
            [
                2248,
                2302
            ],
            [
                2302,
                2430
            ],
            [
                2430,
                2478
            ],
            [
                2478,
                2511
            ],
            [
                2511,
                2537
            ],
            [
                2546,
                2548
            ],
            [
                2598,
                2635
            ],
            [
                2635,
                2727
            ],
            [
                2727,
                2770
            ],
            [
                2770,
                2792
            ],
            [
                2792,
                2807
            ],
            [
                2828,
                2840
            ],
            [
                2862,
                2878
            ],
            [
                2904,
                2958
            ],
            [
                2976,
                3022
            ],
            [
                3033,
                3035
            ],
            [
                3044,
                3109
            ],
            [
                3116,
                3183
            ],
            [
                3183,
                3231
            ],
            [
                3231,
                3239
            ],
            [
                3239,
                3268
            ],
            [
                3268,
                3299
            ],
            [
                3299,
                3324
            ],
            [
                3395,
                3442
            ],
            [
                3442,
                3506
            ],
            [
                3506,
                3512
            ],
            [
                3518,
                3619
            ],
            [
                3619,
                3687
            ],
            [
                3687,
                3749
            ],
            [
                3749,
                3784
            ],
            [
                3850,
                3883
            ],
            [
                3947,
                4019
            ],
            [
                4019,
                4072
            ],
            [
                4072,
                4111
            ],
            [
                4172,
                4174
            ],
            [
                4174,
                4208
            ],
            [
                4208,
                4275
            ],
            [
                4290,
                4296
            ],
            [
                4330,
                4332
            ],
            [
                4332,
                4371
            ],
            [
                4371,
                4436
            ],
            [
                4461,
                4463
            ],
            [
                4463,
                4495
            ],
            [
                4513,
                4608
            ],
            [
                4650,
                4653
            ],
            [
                4653,
                4658
            ],
            [
                4658,
                4679
            ],
            [
                4679,
                4711
            ],
            [
                4715,
                4773
            ],
            [
                4780,
                4791
            ],
            [
                4824,
                4876
            ],
            [
                4876,
                4901
            ],
            [
                4914,
                4916
            ],
            [
                4916,
                4932
            ],
            [
                4943,
                4964
            ],
            [
                4964,
                5024
            ],
            [
                5026,
                5031
            ],
            [
                5033,
                5132
            ],
            [
                5132,
                5160
            ],
            [
                5160,
                5170
            ],
            [
                5205,
                5248
            ],
            [
                5291,
                5359
            ],
            [
                5371,
                5420
            ],
            [
                5437,
                5477
            ],
            [
                5561,
                5570
            ],
            [
                5584,
                5593
            ],
            [
                5609,
                5641
            ],
            [
                5641,
                5708
            ],
            [
                5720,
                5747
            ],
            [
                5814,
                5820
            ],
            [
                5824,
                5862
            ],
            [
                5862,
                5906
            ],
            [
                5906,
                5981
            ],
            [
                6018,
                6049
            ],
            [
                6133,
                6159
            ],
            [
                6159,
                6189
            ],
            [
                6205,
                6248
            ],
            [
                6248,
                6289
            ],
            [
                6289,
                6335
            ],
            [
                6335,
                6456
            ],
            [
                6465,
                6523
            ],
            [
                6534,
                6559
            ],
            [
                6561,
                6566
            ],
            [
                6568,
                6578
            ],
            [
                6578,
                6623
            ],
            [
                6623,
                6656
            ],
            [
                6656,
                6681
            ],
            [
                6681,
                6707
            ],
            [
                6707,
                6743
            ],
            [
                6800,
                6846
            ],
            [
                6846,
                7024
            ],
            [
                7045,
                7055
            ],
            [
                7064,
                7082
            ],
            [
                7090,
                7101
            ],
            [
                7101,
                7188
            ],
            [
                7188,
                7198
            ],
            [
                7211,
                7232
            ],
            [
                7280,
                7282
            ],
            [
                7282,
                7319
            ],
            [
                7351,
                7418
            ],
            [
                7418,
                7450
            ],
            [
                7589,
                7626
            ],
            [
                7626,
                7630
            ],
            [
                7905,
                7914
            ],
            [
                7651,
                7655
            ],
            [
                7704,
                7706
            ],
            [
                7730,
                7731
            ],
            [
                7656,
                7659
            ],
            [
                7668,
                7688
            ],
            [
                7746,
                7747
            ],
            [
                7767,
                7770
            ],
            [
                7940,
                7951
            ],
            [
                7951,
                7981
            ],
            [
                7986,
                8017
            ],
            [
                8024,
                8030
            ],
            [
                8040,
                8081
            ],
            [
                8081,
                8082
            ],
            [
                8098,
                8104
            ],
            [
                8083,
                8096
            ],
            [
                8120,
                8167
            ],
            [
                8167,
                8265
            ],
            [
                8265,
                8303
            ],
            [
                8325,
                8338
            ],
            [
                8338,
                8376
            ],
            [
                8376,
                8430
            ],
            [
                8430,
                8489
            ],
            [
                8554,
                8580
            ],
            [
                8590,
                8640
            ],
            [
                8765,
                8787
            ],
            [
                8795,
                8825
            ],
            [
                8850,
                8882
            ],
            [
                8882,
                8940
            ],
            [
                8940,
                8963
            ],
            [
                8987,
                9021
            ],
            [
                9081,
                9130
            ],
            [
                9142,
                9209
            ],
            [
                9235,
                9291
            ],
            [
                9291,
                9393
            ],
            [
                9414,
                9444
            ],
            [
                9465,
                9502
            ],
            [
                9502,
                9596
            ],
            [
                9596,
                9643
            ],
            [
                9643,
                9686
            ],
            [
                9686,
                9687
            ],
            [
                9754,
                9813
            ],
            [
                9813,
                9829
            ],
            [
                9829,
                9840
            ],
            [
                9840,
                9896
            ],
            [
                9896,
                9959
            ],
            [
                10035,
                10038
            ],
            [
                10038,
                10077
            ],
            [
                10079,
                10084
            ],
            [
                10086,
                10131
            ],
            [
                10131,
                10139
            ],
            [
                10139,
                10244
            ],
            [
                10244,
                10354
            ],
            [
                10369,
                10371
            ],
            [
                10395,
                10425
            ],
            [
                10431,
                10442
            ],
            [
                10450,
                10495
            ],
            [
                10515,
                10524
            ],
            [
                10535,
                10731
            ],
            [
                10755,
                10787
            ],
            [
                10787,
                10840
            ],
            [
                10855,
                10870
            ],
            [
                10870,
                10872
            ],
            [
                10936,
                10970
            ],
            [
                10990,
                10992
            ],
            [
                10992,
                11029
            ],
            [
                11029,
                11042
            ],
            [
                11054,
                11071
            ],
            [
                11081,
                11134
            ],
            [
                11134,
                11172
            ],
            [
                11174,
                11209
            ],
            [
                11209,
                11275
            ],
            [
                11319,
                11321
            ],
            [
                11321,
                11360
            ],
            [
                11375,
                11384
            ],
            [
                11493,
                11503
            ],
            [
                11514,
                11517
            ],
            [
                11530,
                11547
            ],
            [
                11557,
                11583
            ],
            [
                11583,
                11633
            ],
            [
                11633,
                11717
            ],
            [
                11732,
                11737
            ],
            [
                11741,
                11747
            ],
            [
                11758,
                11764
            ],
            [
                11769,
                11779
            ],
            [
                11787,
                11810
            ],
            [
                11844,
                11846
            ],
            [
                11901,
                11931
            ],
            [
                11963,
                11998
            ],
            [
                11998,
                12049
            ],
            [
                12055,
                12064
            ],
            [
                12071,
                12081
            ],
            [
                12095,
                12117
            ],
            [
                12117,
                12168
            ],
            [
                12206,
                12252
            ],
            [
                12276,
                12277
            ],
            [
                12320,
                12367
            ],
            [
                12287,
                12299
            ],
            [
                12367,
                12369
            ],
            [
                12421,
                12483
            ],
            [
                12483,
                12543
            ],
            [
                12543,
                12576
            ],
            [
                12594,
                12597
            ],
            [
                12582,
                12590
            ],
            [
                12597,
                12626
            ],
            [
                12644,
                12646
            ],
            [
                12654,
                12661
            ],
            [
                12677,
                12679
            ],
            [
                12679,
                12705
            ],
            [
                12705,
                12772
            ],
            [
                12795,
                12812
            ],
            [
                12827,
                12869
            ],
            [
                12869,
                12905
            ],
            [
                12910,
                12933
            ],
            [
                12945,
                12970
            ],
            [
                12991,
                13030
            ],
            [
                13038,
                13060
            ],
            [
                13076,
                13085
            ],
            [
                13204,
                13248
            ],
            [
                13248,
                13309
            ],
            [
                13309,
                13338
            ],
            [
                13427,
                13477
            ],
            [
                13366,
                13377
            ],
            [
                13499,
                13530
            ],
            [
                13532,
                13535
            ],
            [
                13570,
                13576
            ],
            [
                13595,
                13632
            ],
            [
                13632,
                13677
            ],
            [
                13677,
                13713
            ],
            [
                13713,
                13718
            ],
            [
                13744,
                13776
            ],
            [
                13888,
                13891
            ],
            [
                13891,
                13939
            ],
            [
                13939,
                13993
            ],
            [
                13993,
                14037
            ],
            [
                14037,
                14103
            ],
            [
                14103,
                14164
            ],
            [
                14164,
                14173
            ],
            [
                14185,
                14277
            ],
            [
                14298,
                14300
            ],
            [
                14300,
                14393
            ],
            [
                14393,
                14435
            ],
            [
                14435,
                14492
            ],
            [
                14499,
                14549
            ],
            [
                14549,
                14595
            ],
            [
                14595,
                14656
            ],
            [
                14656,
                14677
            ],
            [
                14688,
                14691
            ],
            [
                14703,
                14709
            ],
            [
                14709,
                14741
            ],
            [
                14753,
                14777
            ],
            [
                14779,
                14785
            ],
            [
                14787,
                14802
            ],
            [
                14941,
                14957
            ],
            [
                14970,
                15014
            ],
            [
                15014,
                15023
            ],
            [
                15045,
                15062
            ],
            [
                15129,
                15217
            ],
            [
                15217,
                15264
            ],
            [
                15289,
                15409
            ],
            [
                15409,
                15434
            ],
            [
                15434,
                15447
            ],
            [
                15447,
                15463
            ],
            [
                15471,
                15474
            ],
            [
                15474,
                15476
            ],
            [
                15478,
                15484
            ],
            [
                15486,
                15626
            ],
            [
                15647,
                15726
            ],
            [
                15726,
                15896
            ],
            [
                15896,
                15925
            ],
            [
                16003,
                16035
            ],
            [
                15935,
                15937
            ],
            [
                15939,
                15947
            ],
            [
                16040,
                16056
            ],
            [
                16071,
                16080
            ],
            [
                16080,
                16111
            ],
            [
                16111,
                16116
            ],
            [
                16124,
                16176
            ],
            [
                16294,
                16296
            ],
            [
                16296,
                16331
            ],
            [
                16347,
                16380
            ],
            [
                16344,
                16346
            ],
            [
                16384,
                16398
            ],
            [
                16501,
                16546
            ],
            [
                16547,
                16582
            ],
            [
                16582,
                16657
            ],
            [
                16943,
                16946
            ],
            [
                16953,
                16975
            ],
            [
                17005,
                17058
            ],
            [
                17129,
                17137
            ],
            [
                17142,
                17234
            ],
            [
                17381,
                17383
            ],
            [
                17383,
                17408
            ],
            [
                17738,
                17739
            ],
            [
                17409,
                17415
            ],
            [
                17432,
                17507
            ],
            [
                17528,
                17575
            ],
            [
                17638,
                17695
            ],
            [
                17782,
                17784
            ],
            [
                17784,
                17859
            ],
            [
                17859,
                18027
            ],
            [
                18027,
                18095
            ],
            [
                18095,
                18128
            ],
            [
                18128,
                18151
            ],
            [
                18165,
                18181
            ],
            [
                18306,
                18309
            ],
            [
                18182,
                18243
            ],
            [
                18244,
                18273
            ],
            [
                18274,
                18304
            ],
            [
                18310,
                18428
            ],
            [
                18428,
                18502
            ],
            [
                18539,
                18542
            ],
            [
                18551,
                18586
            ],
            [
                18619,
                18628
            ],
            [
                18630,
                18634
            ],
            [
                18636,
                18657
            ],
            [
                18676,
                18678
            ],
            [
                18695,
                18724
            ],
            [
                18724,
                18799
            ],
            [
                18799,
                18834
            ],
            [
                18860,
                18911
            ],
            [
                18937,
                18975
            ],
            [
                18975,
                19051
            ],
            [
                19366,
                19406
            ],
            [
                19406,
                19411
            ],
            [
                19467,
                19496
            ],
            [
                19496,
                19525
            ],
            [
                19525,
                19619
            ],
            [
                19619,
                19665
            ],
            [
                19665,
                19682
            ],
            [
                19682,
                19725
            ],
            [
                19725,
                19776
            ],
            [
                19776,
                19850
            ],
            [
                19860,
                19867
            ],
            [
                19867,
                19906
            ],
            [
                19906,
                19944
            ],
            [
                19949,
                19952
            ],
            [
                19952,
                20091
            ],
            [
                20100,
                20130
            ],
            [
                20142,
                20167
            ]
        ],
        "row_chars": [
            [
                0,
                372
            ],
            [
                372,
                671
            ],
            [
                671,
                771
            ],
            [
                771,
                893
            ],
            [
                893,
                997
            ],
            [
                997,
                1233
            ],
            [
                1233,
                1306
            ],
            [
                1306,
                1503
            ],
            [
                1503,
                1755
            ],
            [
                1755,
                1840
            ],
            [
                1840,
                1908
            ],
            [
                1908,
                1957
            ],
            [
                1957,
                1979
            ],
            [
                1979,
                2141
            ],
            [
                2141,
                2181
            ],
            [
                2181,
                2214
            ],
            [
                2214,
                2248
            ],
            [
                2248,
                2302
            ],
            [
                2302,
                2430
            ],
            [
                2430,
                2478
            ],
            [
                2478,
                2511
            ],
            [
                2511,
                2548
            ],
            [
                2548,
                2598
            ],
            [
                2598,
                2635
            ],
            [
                2635,
                2727
            ],
            [
                2727,
                2770
            ],
            [
                2770,
                2792
            ],
            [
                2792,
                3022
            ],
            [
                3022,
                3183
            ],
            [
                3183,
                3231
            ],
            [
                3231,
                3239
            ],
            [
                3239,
                3268
            ],
            [
                3268,
                3299
            ],
            [
                3299,
                3324
            ],
            [
                3324,
                3391
            ],
            [
                3391,
                3442
            ],
            [
                3442,
                3506
            ],
            [
                3506,
                3619
            ],
            [
                3619,
                3687
            ],
            [
                3687,
                3749
            ],
            [
                3749,
                3883
            ],
            [
                3883,
                3911
            ],
            [
                3911,
                3947
            ],
            [
                3947,
                4019
            ],
            [
                4019,
                4072
            ],
            [
                4072,
                4174
            ],
            [
                4174,
                4208
            ],
            [
                4208,
                4332
            ],
            [
                4332,
                4371
            ],
            [
                4371,
                4463
            ],
            [
                4463,
                4653
            ],
            [
                4653,
                4658
            ],
            [
                4658,
                4679
            ],
            [
                4679,
                4711
            ],
            [
                4711,
                4876
            ],
            [
                4876,
                4916
            ],
            [
                4916,
                4964
            ],
            [
                4964,
                5132
            ],
            [
                5132,
                5160
            ],
            [
                5160,
                5641
            ],
            [
                5641,
                5747
            ],
            [
                5747,
                5814
            ],
            [
                5814,
                5862
            ],
            [
                5862,
                5906
            ],
            [
                5906,
                5981
            ],
            [
                5981,
                6018
            ],
            [
                6018,
                6159
            ],
            [
                6159,
                6248
            ],
            [
                6248,
                6289
            ],
            [
                6289,
                6335
            ],
            [
                6335,
                6578
            ],
            [
                6578,
                6623
            ],
            [
                6623,
                6656
            ],
            [
                6656,
                6681
            ],
            [
                6681,
                6707
            ],
            [
                6707,
                6743
            ],
            [
                6743,
                6771
            ],
            [
                6771,
                6800
            ],
            [
                6800,
                6846
            ],
            [
                6846,
                7024
            ],
            [
                7024,
                7101
            ],
            [
                7101,
                7188
            ],
            [
                7188,
                7282
            ],
            [
                7282,
                7418
            ],
            [
                7418,
                7626
            ],
            [
                7626,
                7951
            ],
            [
                7951,
                8081
            ],
            [
                8081,
                8167
            ],
            [
                8167,
                8265
            ],
            [
                8265,
                8338
            ],
            [
                8338,
                8376
            ],
            [
                8376,
                8430
            ],
            [
                8430,
                8825
            ],
            [
                8825,
                8882
            ],
            [
                8882,
                8940
            ],
            [
                8940,
                9291
            ],
            [
                9291,
                9444
            ],
            [
                9444,
                9502
            ],
            [
                9502,
                9596
            ],
            [
                9596,
                9643
            ],
            [
                9643,
                9686
            ],
            [
                9686,
                9813
            ],
            [
                9813,
                9829
            ],
            [
                9829,
                9840
            ],
            [
                9840,
                9896
            ],
            [
                9896,
                10038
            ],
            [
                10038,
                10131
            ],
            [
                10131,
                10139
            ],
            [
                10139,
                10244
            ],
            [
                10244,
                10495
            ],
            [
                10495,
                10787
            ],
            [
                10787,
                10870
            ],
            [
                10870,
                10992
            ],
            [
                10992,
                11029
            ],
            [
                11029,
                11134
            ],
            [
                11134,
                11209
            ],
            [
                11209,
                11321
            ],
            [
                11321,
                11384
            ],
            [
                11384,
                11493
            ],
            [
                11493,
                11583
            ],
            [
                11583,
                11633
            ],
            [
                11633,
                11846
            ],
            [
                11846,
                11901
            ],
            [
                11901,
                11998
            ],
            [
                11998,
                12117
            ],
            [
                12117,
                12168
            ],
            [
                12168,
                12206
            ],
            [
                12206,
                12369
            ],
            [
                12369,
                12421
            ],
            [
                12421,
                12483
            ],
            [
                12483,
                12543
            ],
            [
                12543,
                12679
            ],
            [
                12679,
                12705
            ],
            [
                12705,
                12869
            ],
            [
                12869,
                13085
            ],
            [
                13085,
                13177
            ],
            [
                13177,
                13204
            ],
            [
                13204,
                13248
            ],
            [
                13248,
                13309
            ],
            [
                13309,
                13338
            ],
            [
                13338,
                13632
            ],
            [
                13632,
                13677
            ],
            [
                13677,
                13713
            ],
            [
                13713,
                13891
            ],
            [
                13891,
                13939
            ],
            [
                13939,
                13993
            ],
            [
                13993,
                14037
            ],
            [
                14037,
                14103
            ],
            [
                14103,
                14164
            ],
            [
                14164,
                14300
            ],
            [
                14300,
                14393
            ],
            [
                14393,
                14435
            ],
            [
                14435,
                14549
            ],
            [
                14549,
                14595
            ],
            [
                14595,
                14656
            ],
            [
                14656,
                14804
            ],
            [
                14804,
                14941
            ],
            [
                14941,
                15014
            ],
            [
                15014,
                15062
            ],
            [
                15062,
                15129
            ],
            [
                15129,
                15217
            ],
            [
                15217,
                15409
            ],
            [
                15409,
                15434
            ],
            [
                15434,
                15447
            ],
            [
                15447,
                15474
            ],
            [
                15474,
                15726
            ],
            [
                15726,
                15896
            ],
            [
                15896,
                16080
            ],
            [
                16080,
                16111
            ],
            [
                16111,
                16296
            ],
            [
                16296,
                16398
            ],
            [
                16398,
                16501
            ],
            [
                16501,
                16582
            ],
            [
                16582,
                16659
            ],
            [
                16659,
                16706
            ],
            [
                16706,
                16784
            ],
            [
                16784,
                16943
            ],
            [
                16943,
                17058
            ],
            [
                17058,
                17095
            ],
            [
                17095,
                17129
            ],
            [
                17129,
                17383
            ],
            [
                17383,
                17784
            ],
            [
                17784,
                17859
            ],
            [
                17859,
                18027
            ],
            [
                18027,
                18095
            ],
            [
                18095,
                18128
            ],
            [
                18128,
                18428
            ],
            [
                18428,
                18657
            ],
            [
                18657,
                18724
            ],
            [
                18724,
                18799
            ],
            [
                18799,
                18911
            ],
            [
                18911,
                18937
            ],
            [
                18937,
                18975
            ],
            [
                18975,
                19051
            ],
            [
                19051,
                19082
            ],
            [
                19082,
                19089
            ],
            [
                19089,
                19142
            ],
            [
                19142,
                19366
            ],
            [
                19366,
                19406
            ],
            [
                19406,
                19496
            ],
            [
                19496,
                19525
            ],
            [
                19525,
                19619
            ],
            [
                19619,
                19665
            ],
            [
                19665,
                19682
            ],
            [
                19682,
                19725
            ],
            [
                19725,
                19776
            ],
            [
                19776,
                19867
            ],
            [
                19867,
                19906
            ],
            [
                19906,
                19952
            ],
            [
                19952,
                20167
            ]
        ]
    },
    "abridged": {
        "text": "Edmund had determined that if Fanny did not choose to speak of it, her situation should never be touched on by him; but after a day or two his father induced him to change his mind, and try what his influence might do for his friend.\nAn early day was fixed for the Crawfords' departure; and Sir Thomas thought it might be as well to make one more effort for the young man before he left Mansfield, so that his vows of unshaken attachment might have as much hope to sustain them as possible.\nSir Thomas was most anxious for the perfection of Mr. Crawford's character in that point. He wished him to be a model of constancy; and fancied the best means of ensuring it would be by not testing him too long.\nEdmund was willingly persuaded to talk to Fanny; he wanted to know her feelings. She used to consult him in every difficulty, and he loved her too well to bear to be denied her confidence now. Whom else had she to open her heart to? Fanny estranged from him, silent and reserved, was an unnatural state of things; a state which he must break through. When she was walking alone in the shrubbery, therefore, he joined her.\n\"I am come to walk with you, Fanny,\" said he, drawing her arm within his. \"It is a long while since we have had a comfortable walk together.\"\nShe assented rather by look than word. Her spirits were low.\n\"But, Fanny,\" he added, \"in order to have a comfortable walk, you must talk to me. I know you have something on your mind. Am I to hear of it from everybody but Fanny herself?\"\nFanny, at once agitated and dejected, replied, \"If you hear of it from everybody, cousin, there can be nothing for me to tell.\"\n\"Not of facts, perhaps; but of feelings, Fanny. No one but you can tell me them. I do not mean to press you. I had thought it might be a relief.\"\n\"I am afraid we think too differently for me to find any relief in talking of what I feel.\"\n\"Do you suppose that we think differently? I have no idea of it. I dare say that our opinions are as much alike as ever: to the point-I consider Crawford's proposals as most desirable, if you could return his affection. It is natural that all your family should wish you could return it; but as you cannot, you have done exactly as you ought in refusing him. Can there be any disagreement between us here?\"\n\"Oh no! But I thought you blamed me. I thought you were against me. This is such a comfort!\"\n\"How could you possibly suppose me against you? How could you imagine me an advocate for marriage without love? Were I careless in general on such matters, how could you imagine me so where your happiness was at stake?\"\n\"My uncle thought me wrong, and I knew he had been talking to you.\"\n\"As far as you have gone, Fanny, I think you perfectly right. I may be sorry, I may be surprised-but I think you perfectly right. You did not love him; nothing could have justified your accepting him.\"\nFanny had not felt so comfortable for days and days.\n\"So far your conduct has been faultless. But the matter does not end here. Crawford's is no common attachment; he perseveres, with the hope of winning your regard. This, we know, must be a work of time. But\" (with an affectionate smile) \"let him succeed at last, Fanny. You have proved yourself upright, prove yourself grateful and tender-hearted; and then you will be the perfect model of a woman.\"\n\"Oh! never, never, never! he never will succeed with me.\" She spoke with a warmth which quite astonished Edmund, and she blushed when she saw his look, and heard him reply, \"Never! Fanny!-so very determined! This is not like your rational self.\"\n\"I mean,\" she cried, sorrowfully correcting herself, \"that I think I never shall, as far as the future can be answered for; I think I never shall return his regard.\"\n\"I must hope better things. I am aware that the man who means to make you love him must have very uphill work, for there are all your early attachments in battle array; and before he can get your heart he has to unfasten it from all the holds which are tightened by the very idea of separation. I know that the apprehension of being forced to quit Mansfield will be arming you against him. I wish Crawford had known you as well as I do, Fanny. Between us, I think we should have won you. My theoretical and his practical knowledge together could not have failed. I must hope, however, that time will give him his reward. I cannot suppose that you have no wish to love him-the natural wish of gratitude. You must have some feeling of that sort. You must be sorry for your own indifference.\"\n\"We are so totally unlike,\" said Fanny, avoiding a direct answer, \"we are so very, very different in all our inclinations, that I consider it as quite impossible we should ever be happy together, even if I could like him. There never were two people more dissimilar. We have not one taste in common. We should be miserable.\"\n\"You are mistaken, Fanny. The dissimilarity is not so strong. You have moral and literary tastes in common. You have both warm hearts and benevolent feelings; and, Fanny, who that heard him read, and saw you listen to Shakespeare the other night, will think you unfitted as companions? There is a difference in your temperaments, I allow. He is lively, you are serious; but so much the better: his spirits will support yours. It is your nature to be easily dejected. His cheerfulness will counteract this; and his pleasantness and gaiety will be a constant support to you. Your being so far unlike, Fanny, is rather a favourable circumstance. I am convinced that in marriage, the temperaments had better be unlike, for opposites bring happiness. I exclude extremes, of course; but a very close resemblance in all points is the likeliest way to produce an extreme. A gentle counteraction is the best safeguard of manners and conduct.\"\nFull well could Fanny guess where his thoughts were now: Miss Crawford's power was all returning. He had been speaking of her cheerfully ever since coming home. His avoiding her was quite at an end. He had dined at the Parsonage only the preceding day.\nAfter leaving him to his happier thoughts for some minutes, she said, \"It is not merely in temperament that I consider him as totally unsuited to myself; but there is something which I object to still more. I cannot approve his character. I have not thought well of him from the time of the play. I then saw him behaving so very improperly and unfeelingly by poor Mr. Rushworth, not seeming to care how he hurt him, and paying attentions to my cousin Maria, which-in short, I received an impression which will never be got over.\"\n\"My dear Fanny,\" replied Edmund, scarcely hearing her to the end, \"let us not, any of us, be judged by that period of general folly. That is a time which I hate to recollect. Maria was wrong, Crawford was wrong, we were all wrong together; but none so wrong as myself. Compared with me, all the rest were blameless. I was playing the fool with my eyes open.\"\n\"I do think that Mr. Rushworth was sometimes very jealous.\"\n\"Very possibly. No wonder. Nothing could be more improper than the whole business. I am shocked whenever I think that Maria could be capable of it.\"\n\"Before the play, I am much mistaken if Julia did not think he was paying her attentions.\"\n\"Julia! I have heard before from some one of his being in love with Julia; but I could never see anything of it. And, Fanny, though I hope I do justice to my sisters' good qualities, I think it very possible that they might desire to be admired by Crawford, and might show that desire more unguardedly than was perfectly prudent. They were fond of his society; and with such encouragement, a man like Crawford, lively, and it may be, a little unthinking, might be led on to-there could be nothing very striking, because it is clear that his heart was reserved for you. And I must say, that its being for you has raised him in my opinion. It shows he understands the blessing of domestic happiness. It proves him unspoilt by his uncle. It proves him everything that I used to wish to believe him, and feared he was not.\"\n\"I am persuaded that he does not think as he ought, on serious subjects.\"\n\"Say, rather, that he has not thought at all upon serious subjects. How could it be otherwise, with such an adviser? Crawford's feelings, I acknowledge, have been too much his guides. Happily, those feelings have generally been good. You will supply the rest; and a most fortunate man he is to attach himself to such a woman, firm in her principles yet with gentleness of character. He will make you happy, Fanny; but you will make him everything.\"\n\"I would not engage in such a charge,\" cried Fanny, shrinking; \"in such high responsibility!\"\n\"As usual, believing yourself unequal to anything! Well, though I may not be able to persuade you to feel differently, I confess myself sincerely anxious that you may be persuaded. Next to your happiness, Fanny, his has the first claim on me. You are aware of my having no common interest in Crawford.\"\nFanny was too well aware of it to say anything; and they walked on together in silence. Edmund first began again-\n\"I was very much pleased by her manner of speaking of it yesterday, because I had not been certain of her seeing everything in so just a light. I knew she was very fond of you; but I was afraid of her not seeing your worth to her brother, and of her regretting that he had not fixed on some woman of fortune. But she spoke of you, Fanny, just as she ought. She desires the connexion as warmly as your uncle or myself. We had a long talk about it. I had not been in the room five minutes before she introduced the subject with all that openness of heart and spirit which are so much a part of herself. Mrs. Grant laughed at her for her rapidity.\"\n\"Was Mrs. Grant in the room, then?\"\n\"Yes, I found the two sisters together.\"\n\"It is above a week since I saw Miss Crawford.\"\n\"Yes, she laments it; yet owns it may have been best. You will see her, however, before she goes. She is very angry with you, Fanny; you must be prepared for that. She calls herself very angry, but you can imagine her anger. It is the disappointment of a sister, who thinks her brother has a right to everything he may wish for. She is hurt, as you would be for William; but she loves and esteems you with all her heart.\"\n\"I knew she would be very angry with me.\"\n\"My dearest Fanny,\" cried Edmund, pressing her arm closer, \"do not let the idea of her anger distress you. It is anger to be talked of rather than felt. Her heart is made for love and kindness, not for resentment. I wish you could have heard her praise you; I wish you could have seen her face, when she said that you should be Henry's wife.\"\n\"And Mrs. Grant, did she speak; was she there all the time?\"\n\"Yes, she agreed with her sister. That you could refuse such a man as Henry Crawford seems more than they can understand. I said what I could for you; but in good truth, you must prove yourself to be in your senses as soon as you can by a different conduct; nothing else will satisfy them. But this is teasing you. I have done. Do not turn away.\"\n\"I should have thought,\" said Fanny, after a pause of recollection and exertion, \"that every woman must have felt the possibility of a man's not being loved by some one of her sex at least, let him be ever so generally agreeable. Let him have all the perfections in the world, I think it ought not to be set down as certain that a man must be acceptable to every woman he may happen to like himself. But, even supposing it is so, how was I to be prepared to meet Mr Crawford with any feeling like his own? He took me wholly by surprise. I had no idea that his behaviour to me before had any meaning. In my situation, it would have been vanity to be forming expectations of Mr. Crawford. How, then, was I to be-to be in love with him, the moment he said he was with me? How was I to have an attachment at his service, as soon as it was asked for?\"\n\"My dear Fanny, now I have the truth; and most worthy of you are such feelings. You have given exactly the explanation which I ventured to make for you to your friend and Mrs. Grant. I told them that you were, of all people, the one over whom habit had most power and novelty least; and that the very novelty of Crawford's addresses was against him: that you could tolerate nothing that you were not used to. Miss Crawford made us laugh by her plans of encouragement for her brother. She meant to urge him to persevere in the hope of being loved in time, and of having his addresses most kindly received at the end of about ten years' happy marriage.\"\nFanny could with difficulty give the smile that was here asked for. Her feelings were all in revolt. She feared she had been saying too much, and overacting the caution which she had been fancying necessary; and in guarding against one evil, was laying herself open to another. To have Miss Crawford's liveliness repeated to her at such a moment, and on such a subject, was a bitter aggravation.\nEdmund saw weariness and distress in her face, and immediately resolved to not mention the name of Crawford again, unless in connexion with what must be agreeable to her. So he observed-\"They go on Monday. You are sure, therefore, of seeing your friend either to-morrow or Sunday. They really go on Monday; and I was almost persuaded to stay at Lessingby till that very day! What a difference it might have made! Those five or six days more at Lessingby might have been felt all my life.\"\n\"You spent your time pleasantly there?\"\n\"Yes; they were all very pleasant. I doubt their finding me so. I took uneasiness with me, and there was no getting rid of it till I was in Mansfield again.\"\n\"The Miss Owens-you liked them, did not you?\"\n\"Yes, very well. Pleasant, good-humoured, unaffected girls. But I am spoilt, Fanny, for common female society. Good-humoured, unaffected girls will not do for a man who has been used to intelligent women. They are two distinct orders of being. You and Miss Crawford have made me too exacting.\"\nStill, however, Fanny was oppressed and wearied; he saw it in her looks, it could not be talked away; and attempting it no more, he led her, with the kind authority of a guardian, into the house.",
        "paragraph_chars": [
            [
                0,
                234
            ],
            [
                234,
                491
            ],
            [
                491,
                703
            ],
            [
                703,
                1125
            ],
            [
                1125,
                1267
            ],
            [
                1267,
                1328
            ],
            [
                1328,
                1505
            ],
            [
                1505,
                1633
            ],
            [
                1633,
                1779
            ],
            [
                1779,
                1871
            ],
            [
                1871,
                2278
            ],
            [
                2278,
                2371
            ],
            [
                2371,
                2591
            ],
            [
                2591,
                2659
            ],
            [
                2659,
                2861
            ],
            [
                2861,
                2914
            ],
            [
                2914,
                3314
            ],
            [
                3314,
                3560
            ],
            [
                3560,
                3726
            ],
            [
                3726,
                4516
            ],
            [
                4516,
                4841
            ],
            [
                4841,
                5775
            ],
            [
                5775,
                6028
            ],
            [
                6028,
                6558
            ],
            [
                6558,
                6917
            ],
            [
                6917,
                6977
            ],
            [
                6977,
                7126
            ],
            [
                7126,
                7217
            ],
            [
                7217,
                8037
            ],
            [
                8037,
                8111
            ],
            [
                8111,
                8560
            ],
            [
                8560,
                8654
            ],
            [
                8654,
                8957
            ],
            [
                8957,
                9071
            ],
            [
                9071,
                9717
            ],
            [
                9717,
                9753
            ],
            [
                9753,
                9794
            ],
            [
                9794,
                9842
            ],
            [
                9842,
                10264
            ],
            [
                10264,
                10306
            ],
            [
                10306,
                10649
            ],
            [
                10649,
                10710
            ],
            [
                10710,
                11057
            ],
            [
                11057,
                11904
            ],
            [
                11904,
                12556
            ],
            [
                12556,
                12952
            ],
            [
                12952,
                13441
            ],
            [
                13441,
                13481
            ],
            [
                13481,
                13639
            ],
            [
                13639,
                13685
            ],
            [
                13685,
                13979
            ],
            [
                13979,
                14174
            ]
        ],
        "segment_chars": [
            [
                0,
                234
            ],
            [
                234,
                491
            ],
            [
                491,
                581
            ],
            [
                581,
                703
            ],
            [
                703,
                784
            ],
            [
                784,
                896
            ],
            [
                896,
                936
            ],
            [
                936,
                1054
            ],
            [
                1054,
                1125
            ],
            [
                1125,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                1306
            ],
            [
                1306,
                1328
            ],
            [
                1328,
                1411
            ],
            [
                1411,
                1451
            ],
            [
                1451,
                1505
            ],
            [
                1505,
                1633
            ],
            [
                1633,
                1681
            ],
            [
                1681,
                1714
            ],
            [
                1714,
                1742
            ],
            [
                1742,
                1779
            ],
            [
                1779,
                1871
            ],
            [
                1871,
                1914
            ],
            [
                1914,
                1936
            ],
            [
                1936,
                2091
            ],
            [
                2091,
                2230
            ],
            [
                2230,
                2278
            ],
            [
                2278,
                2286
            ],
            [
                2286,
                2315
            ],
            [
                2315,
                2346
            ],
            [
                2346,
                2371
            ],
            [
                2371,
                2419
            ],
            [
                2419,
                2483
            ],
            [
                2483,
                2591
            ],
            [
                2591,
                2659
            ],
            [
                2659,
                2721
            ],
            [
                2721,
                2789
            ],
            [
                2789,
                2861
            ],
            [
                2861,
                2914
            ],
            [
                2914,
                2955
            ],
            [
                2955,
                2989
            ],
            [
                2989,
                3078
            ],
            [
                3078,
                3117
            ],
            [
                3117,
                3184
            ],
            [
                3184,
                3314
            ],
            [
                3314,
                3319
            ],
            [
                3319,
                3340
            ],
            [
                3340,
                3372
            ],
            [
                3372,
                3495
            ],
            [
                3495,
                3522
            ],
            [
                3522,
                3560
            ],
            [
                3560,
                3726
            ],
            [
                3726,
                3754
            ],
            [
                3754,
                4021
            ],
            [
                4021,
                4116
            ],
            [
                4116,
                4170
            ],
            [
                4170,
                4214
            ],
            [
                4214,
                4289
            ],
            [
                4289,
                4347
            ],
            [
                4347,
                4429
            ],
            [
                4429,
                4470
            ],
            [
                4470,
                4516
            ],
            [
                4516,
                4738
            ],
            [
                4738,
                4783
            ],
            [
                4783,
                4816
            ],
            [
                4816,
                4841
            ],
            [
                4841,
                4867
            ],
            [
                4867,
                4903
            ],
            [
                4903,
                4949
            ],
            [
                4949,
                5127
            ],
            [
                5127,
                5180
            ],
            [
                5180,
                5267
            ],
            [
                5267,
                5308
            ],
            [
                5308,
                5414
            ],
            [
                5414,
                5484
            ],
            [
                5484,
                5587
            ],
            [
                5587,
                5705
            ],
            [
                5705,
                5775
            ],
            [
                5775,
                5873
            ],
            [
                5873,
                5936
            ],
            [
                5936,
                5974
            ],
            [
                5974,
                6028
            ],
            [
                6028,
                6235
            ],
            [
                6235,
                6267
            ],
            [
                6267,
                6325
            ],
            [
                6325,
                6558
            ],
            [
                6558,
                6691
            ],
            [
                6691,
                6733
            ],
            [
                6733,
                6827
            ],
            [
                6827,
                6874
            ],
            [
                6874,
                6917
            ],
            [
                6917,
                6977
            ],
            [
                6977,
                6993
            ],
            [
                6993,
                7004
            ],
            [
                7004,
                7060
            ],
            [
                7060,
                7126
            ],
            [
                7126,
                7217
            ],
            [
                7217,
                7225
            ],
            [
                7225,
                7330
            ],
            [
                7330,
                7547
            ],
            [
                7547,
                7786
            ],
            [
                7786,
                7855
            ],
            [
                7855,
                7915
            ],
            [
                7915,
                7952
            ],
            [
                7952,
                8037
            ],
            [
                8037,
                8111
            ],
            [
                8111,
                8179
            ],
            [
                8179,
                8228
            ],
            [
                8228,
                8295
            ],
            [
                8295,
                8345
            ],
            [
                8345,
                8494
            ],
            [
                8494,
                8560
            ],
            [
                8560,
                8654
            ],
            [
                8654,
                8705
            ],
            [
                8705,
                8835
            ],
            [
                8835,
                8897
            ],
            [
                8897,
                8957
            ],
            [
                8957,
                9045
            ],
            [
                9045,
                9071
            ],
            [
                9071,
                9215
            ],
            [
                9215,
                9380
            ],
            [
                9380,
                9428
            ],
            [
                9428,
                9489
            ],
            [
                9489,
                9518
            ],
            [
                9518,
                9672
            ],
            [
                9672,
                9717
            ],
            [
                9717,
                9753
            ],
            [
                9753,
                9794
            ],
            [
                9794,
                9842
            ],
            [
                9842,
                9896
            ],
            [
                9896,
                9940
            ],
            [
                9940,
                10006
            ],
            [
                10006,
                10067
            ],
            [
                10067,
                10171
            ],
            [
                10171,
                10264
            ],
            [
                10264,
                10306
            ],
            [
                10306,
                10413
            ],
            [
                10413,
                10459
            ],
            [
                10459,
                10520
            ],
            [
                10520,
                10649
            ],
            [
                10649,
                10710
            ],
            [
                10710,
                10744
            ],
            [
                10744,
                10832
            ],
            [
                10832,
                11000
            ],
            [
                11000,
                11025
            ],
            [
                11025,
                11038
            ],
            [
                11038,
                11057
            ],
            [
                11057,
                11287
            ],
            [
                11287,
                11457
            ],
            [
                11457,
                11563
            ],
            [
                11563,
                11594
            ],
            [
                11594,
                11657
            ],
            [
                11657,
                11744
            ],
            [
                11744,
                11826
            ],
            [
                11826,
                11904
            ],
            [
                11904,
                11984
            ],
            [
                11984,
                12087
            ],
            [
                12087,
                12313
            ],
            [
                12313,
                12388
            ],
            [
                12388,
                12556
            ],
            [
                12556,
                12624
            ],
            [
                12624,
                12657
            ],
            [
                12657,
                12834
            ],
            [
                12834,
                12952
            ],
            [
                12952,
                13123
            ],
            [
                13123,
                13158
            ],
            [
                13158,
                13233
            ],
            [
                13233,
                13327
            ],
            [
                13327,
                13365
            ],
            [
                13365,
                13441
            ],
            [
                13441,
                13481
            ],
            [
                13481,
                13516
            ],
            [
                13516,
                13545
            ],
            [
                13545,
                13639
            ],
            [
                13639,
                13685
            ],
            [
                13685,
                13702
            ],
            [
                13702,
                13745
            ],
            [
                13745,
                13796
            ],
            [
                13796,
                13890
            ],
            [
                13890,
                13929
            ],
            [
                13929,
                13979
            ],
            [
                13979,
                14174
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                27,
                29
            ],
            [
                30,
                35
            ],
            [
                36,
                43
            ],
            [
                51,
                53
            ],
            [
                60,
                62
            ],
            [
                63,
                65
            ],
            [
                65,
                66
            ],
            [
                67,
                80
            ],
            [
                81,
                138
            ],
            [
                139,
                149
            ],
            [
                150,
                157
            ],
            [
                162,
                234
            ],
            [
                237,
                246
            ],
            [
                247,
                250
            ],
            [
                251,
                397
            ],
            [
                401,
                405
            ],
            [
                406,
                409
            ],
            [
                410,
                491
            ],
            [
                491,
                510
            ],
            [
                511,
                581
            ],
            [
                581,
                652
            ],
            [
                662,
                680
            ],
            [
                689,
                703
            ],
            [
                703,
                713
            ],
            [
                724,
                736
            ],
            [
                742,
                744
            ],
            [
                745,
                750
            ],
            [
                750,
                769
            ],
            [
                774,
                784
            ],
            [
                784,
                787
            ],
            [
                788,
                894
            ],
            [
                896,
                936
            ],
            [
                936,
                1052
            ],
            [
                1052,
                1053
            ],
            [
                1063,
                1066
            ],
            [
                1067,
                1098
            ],
            [
                1108,
                1109
            ],
            [
                1110,
                1112
            ],
            [
                1113,
                1125
            ],
            [
                1125,
                1169
            ],
            [
                1171,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                1279
            ],
            [
                1280,
                1306
            ],
            [
                1306,
                1328
            ],
            [
                1328,
                1344
            ],
            [
                1345,
                1389
            ],
            [
                1390,
                1411
            ],
            [
                1411,
                1451
            ],
            [
                1451,
                1505
            ],
            [
                1505,
                1633
            ],
            [
                1633,
                1681
            ],
            [
                1681,
                1714
            ],
            [
                1714,
                1740
            ],
            [
                1740,
                1742
            ],
            [
                1742,
                1779
            ],
            [
                1779,
                1871
            ],
            [
                1871,
                1914
            ],
            [
                1914,
                1936
            ],
            [
                1936,
                1951
            ],
            [
                1952,
                1964
            ],
            [
                1969,
                1985
            ],
            [
                1990,
                2044
            ],
            [
                2045,
                2091
            ],
            [
                2091,
                2093
            ],
            [
                2097,
                2162
            ],
            [
                2163,
                2230
            ],
            [
                2230,
                2278
            ],
            [
                2278,
                2286
            ],
            [
                2286,
                2315
            ],
            [
                2315,
                2346
            ],
            [
                2346,
                2371
            ],
            [
                2372,
                2419
            ],
            [
                2419,
                2483
            ],
            [
                2483,
                2489
            ],
            [
                2490,
                2591
            ],
            [
                2591,
                2659
            ],
            [
                2659,
                2721
            ],
            [
                2721,
                2756
            ],
            [
                2756,
                2789
            ],
            [
                2789,
                2861
            ],
            [
                2861,
                2914
            ],
            [
                2914,
                2953
            ],
            [
                2953,
                2955
            ],
            [
                2955,
                2989
            ],
            [
                2989,
                3056
            ],
            [
                3070,
                3076
            ],
            [
                3076,
                3078
            ],
            [
                3078,
                3117
            ],
            [
                3117,
                3182
            ],
            [
                3182,
                3184
            ],
            [
                3184,
                3216
            ],
            [
                3216,
                3311
            ],
            [
                3311,
                3314
            ],
            [
                3314,
                3319
            ],
            [
                3319,
                3340
            ],
            [
                3340,
                3372
            ],
            [
                3372,
                3430
            ],
            [
                3431,
                3442
            ],
            [
                3443,
                3495
            ],
            [
                3495,
                3520
            ],
            [
                3520,
                3522
            ],
            [
                3522,
                3538
            ],
            [
                3539,
                3560
            ],
            [
                3560,
                3620
            ],
            [
                3621,
                3626
            ],
            [
                3627,
                3726
            ],
            [
                3726,
                3754
            ],
            [
                3754,
                3764
            ],
            [
                3765,
                3808
            ],
            [
                3809,
                3877
            ],
            [
                3878,
                3927
            ],
            [
                3928,
                3968
            ],
            [
                3969,
                3978
            ],
            [
                3979,
                3988
            ],
            [
                3989,
                4021
            ],
            [
                4021,
                4088
            ],
            [
                4089,
                4116
            ],
            [
                4116,
                4122
            ],
            [
                4132,
                4170
            ],
            [
                4170,
                4214
            ],
            [
                4214,
                4289
            ],
            [
                4289,
                4320
            ],
            [
                4321,
                4347
            ],
            [
                4347,
                4377
            ],
            [
                4386,
                4429
            ],
            [
                4429,
                4470
            ],
            [
                4470,
                4516
            ],
            [
                4516,
                4637
            ],
            [
                4637,
                4695
            ],
            [
                4696,
                4721
            ],
            [
                4722,
                4727
            ],
            [
                4728,
                4738
            ],
            [
                4738,
                4783
            ],
            [
                4783,
                4816
            ],
            [
                4816,
                4841
            ],
            [
                4841,
                4867
            ],
            [
                4867,
                4903
            ],
            [
                4903,
                4949
            ],
            [
                4949,
                5127
            ],
            [
                5127,
                5137
            ],
            [
                5138,
                5156
            ],
            [
                5169,
                5180
            ],
            [
                5180,
                5267
            ],
            [
                5267,
                5277
            ],
            [
                5285,
                5306
            ],
            [
                5306,
                5308
            ],
            [
                5308,
                5345
            ],
            [
                5347,
                5414
            ],
            [
                5414,
                5446
            ],
            [
                5447,
                5484
            ],
            [
                5484,
                5488
            ],
            [
                5489,
                5498
            ],
            [
                5499,
                5503
            ],
            [
                5504,
                5506
            ],
            [
                5515,
                5516
            ],
            [
                5517,
                5520
            ],
            [
                5534,
                5554
            ],
            [
                5554,
                5555
            ],
            [
                5556,
                5559
            ],
            [
                5576,
                5587
            ],
            [
                5587,
                5617
            ],
            [
                5622,
                5653
            ],
            [
                5654,
                5660
            ],
            [
                5664,
                5705
            ],
            [
                5705,
                5706
            ],
            [
                5707,
                5713
            ],
            [
                5714,
                5727
            ],
            [
                5728,
                5775
            ],
            [
                5775,
                5873
            ],
            [
                5873,
                5911
            ],
            [
                5923,
                5936
            ],
            [
                5936,
                5974
            ],
            [
                5974,
                6028
            ],
            [
                6028,
                6087
            ],
            [
                6092,
                6118
            ],
            [
                6131,
                6181
            ],
            [
                6182,
                6204
            ],
            [
                6205,
                6235
            ],
            [
                6235,
                6267
            ],
            [
                6267,
                6325
            ],
            [
                6325,
                6348
            ],
            [
                6349,
                6383
            ],
            [
                6384,
                6433
            ],
            [
                6434,
                6501
            ],
            [
                6502,
                6558
            ],
            [
                6558,
                6660
            ],
            [
                6661,
                6691
            ],
            [
                6696,
                6733
            ],
            [
                6733,
                6827
            ],
            [
                6827,
                6874
            ],
            [
                6874,
                6917
            ],
            [
                6917,
                6918
            ],
            [
                6918,
                6977
            ],
            [
                6977,
                6993
            ],
            [
                6993,
                7004
            ],
            [
                7004,
                7060
            ],
            [
                7060,
                7123
            ],
            [
                7123,
                7126
            ],
            [
                7126,
                7165
            ],
            [
                7166,
                7171
            ],
            [
                7172,
                7217
            ],
            [
                7217,
                7225
            ],
            [
                7225,
                7330
            ],
            [
                7330,
                7440
            ],
            [
                7451,
                7453
            ],
            [
                7454,
                7484
            ],
            [
                7490,
                7501
            ],
            [
                7502,
                7547
            ],
            [
                7547,
                7556
            ],
            [
                7557,
                7753
            ],
            [
                7754,
                7786
            ],
            [
                7786,
                7839
            ],
            [
                7840,
                7855
            ],
            [
                7855,
                7857
            ],
            [
                7879,
                7913
            ],
            [
                7913,
                7915
            ],
            [
                7915,
                7952
            ],
            [
                7952,
                7965
            ],
            [
                7966,
                7983
            ],
            [
                7984,
                8037
            ],
            [
                8037,
                8075
            ],
            [
                8076,
                8111
            ],
            [
                8111,
                8177
            ],
            [
                8177,
                8179
            ],
            [
                8179,
                8218
            ],
            [
                8219,
                8228
            ],
            [
                8228,
                8238
            ],
            [
                8247,
                8250
            ],
            [
                8251,
                8268
            ],
            [
                8269,
                8295
            ],
            [
                8295,
                8345
            ],
            [
                8345,
                8429
            ],
            [
                8430,
                8435
            ],
            [
                8435,
                8441
            ],
            [
                8442,
                8448
            ],
            [
                8449,
                8459
            ],
            [
                8469,
                8492
            ],
            [
                8492,
                8494
            ],
            [
                8494,
                8524
            ],
            [
                8525,
                8560
            ],
            [
                8560,
                8611
            ],
            [
                8612,
                8621
            ],
            [
                8621,
                8631
            ],
            [
                8632,
                8654
            ],
            [
                8654,
                8705
            ],
            [
                8705,
                8751
            ],
            [
                8771,
                8772
            ],
            [
                8773,
                8820
            ],
            [
                8821,
                8833
            ],
            [
                8833,
                8835
            ],
            [
                8835,
                8897
            ],
            [
                8897,
                8957
            ],
            [
                8957,
                8990
            ],
            [
                8991,
                8994
            ],
            [
                8995,
                9003
            ],
            [
                9003,
                9032
            ],
            [
                9033,
                9035
            ],
            [
                9036,
                9043
            ],
            [
                9043,
                9045
            ],
            [
                9045,
                9071
            ],
            [
                9071,
                9138
            ],
            [
                9139,
                9156
            ],
            [
                9173,
                9215
            ],
            [
                9215,
                9251
            ],
            [
                9252,
                9275
            ],
            [
                9283,
                9308
            ],
            [
                9308,
                9347
            ],
            [
                9348,
                9370
            ],
            [
                9371,
                9380
            ],
            [
                9384,
                9428
            ],
            [
                9428,
                9489
            ],
            [
                9489,
                9518
            ],
            [
                9518,
                9568
            ],
            [
                9580,
                9591
            ],
            [
                9592,
                9623
            ],
            [
                9624,
                9627
            ],
            [
                9628,
                9634
            ],
            [
                9635,
                9672
            ],
            [
                9672,
                9717
            ],
            [
                9717,
                9753
            ],
            [
                9753,
                9758
            ],
            [
                9759,
                9791
            ],
            [
                9791,
                9794
            ],
            [
                9794,
                9842
            ],
            [
                9842,
                9896
            ],
            [
                9896,
                9940
            ],
            [
                9940,
                10006
            ],
            [
                10006,
                10067
            ],
            [
                10067,
                10076
            ],
            [
                10077,
                10169
            ],
            [
                10169,
                10171
            ],
            [
                10171,
                10264
            ],
            [
                10264,
                10306
            ],
            [
                10306,
                10363
            ],
            [
                10363,
                10413
            ],
            [
                10413,
                10459
            ],
            [
                10459,
                10520
            ],
            [
                10520,
                10541
            ],
            [
                10548,
                10551
            ],
            [
                10552,
                10558
            ],
            [
                10562,
                10594
            ],
            [
                10599,
                10623
            ],
            [
                10624,
                10630
            ],
            [
                10631,
                10646
            ],
            [
                10649,
                10665
            ],
            [
                10666,
                10710
            ],
            [
                10710,
                10719
            ],
            [
                10727,
                10744
            ],
            [
                10744,
                10832
            ],
            [
                10832,
                10879
            ],
            [
                10880,
                11000
            ],
            [
                11000,
                11025
            ],
            [
                11025,
                11038
            ],
            [
                11038,
                11054
            ],
            [
                11054,
                11057
            ],
            [
                11057,
                11059
            ],
            [
                11060,
                11066
            ],
            [
                11067,
                11207
            ],
            [
                11208,
                11287
            ],
            [
                11287,
                11457
            ],
            [
                11457,
                11486
            ],
            [
                11487,
                11519
            ],
            [
                11520,
                11522
            ],
            [
                11523,
                11531
            ],
            [
                11532,
                11548
            ],
            [
                11554,
                11563
            ],
            [
                11563,
                11594
            ],
            [
                11594,
                11599
            ],
            [
                11603,
                11655
            ],
            [
                11655,
                11657
            ],
            [
                11657,
                11692
            ],
            [
                11693,
                11726
            ],
            [
                11727,
                11729
            ],
            [
                11730,
                11744
            ],
            [
                11744,
                11789
            ],
            [
                11791,
                11826
            ],
            [
                11826,
                11901
            ],
            [
                11904,
                11907
            ],
            [
                11908,
                11930
            ],
            [
                11931,
                11984
            ],
            [
                11984,
                11992
            ],
            [
                11993,
                12085
            ],
            [
                12085,
                12087
            ],
            [
                12087,
                12112
            ],
            [
                12112,
                12113
            ],
            [
                12114,
                12120
            ],
            [
                12129,
                12204
            ],
            [
                12205,
                12252
            ],
            [
                12254,
                12311
            ],
            [
                12311,
                12313
            ],
            [
                12313,
                12388
            ],
            [
                12388,
                12556
            ],
            [
                12556,
                12624
            ],
            [
                12624,
                12657
            ],
            [
                12657,
                12680
            ],
            [
                12681,
                12697
            ],
            [
                12698,
                12701
            ],
            [
                12702,
                12763
            ],
            [
                12768,
                12797
            ],
            [
                12802,
                12832
            ],
            [
                12834,
                12952
            ],
            [
                12952,
                13026
            ],
            [
                13027,
                13030
            ],
            [
                13031,
                13066
            ],
            [
                13087,
                13096
            ],
            [
                13097,
                13101
            ],
            [
                13102,
                13123
            ],
            [
                13126,
                13128
            ],
            [
                13129,
                13158
            ],
            [
                13158,
                13233
            ],
            [
                13233,
                13268
            ],
            [
                13276,
                13327
            ],
            [
                13327,
                13365
            ],
            [
                13365,
                13441
            ],
            [
                13441,
                13481
            ],
            [
                13481,
                13486
            ],
            [
                13487,
                13516
            ],
            [
                13516,
                13545
            ],
            [
                13545,
                13639
            ],
            [
                13639,
                13685
            ],
            [
                13685,
                13702
            ],
            [
                13702,
                13745
            ],
            [
                13745,
                13796
            ],
            [
                13796,
                13870
            ],
            [
                13883,
                13890
            ],
            [
                13890,
                13929
            ],
            [
                13929,
                13967
            ],
            [
                13976,
                13979
            ],
            [
                13979,
                14118
            ],
            [
                14118,
                14148
            ],
            [
                14149,
                14174
            ]
        ],
        "row_chars": [
            [
                0,
                234
            ],
            [
                234,
                491
            ],
            [
                491,
                581
            ],
            [
                581,
                703
            ],
            [
                703,
                784
            ],
            [
                784,
                936
            ],
            [
                936,
                936
            ],
            [
                936,
                1054
            ],
            [
                1054,
                1125
            ],
            [
                1125,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                1306
            ],
            [
                1306,
                1328
            ],
            [
                1328,
                1411
            ],
            [
                1411,
                1451
            ],
            [
                1451,
                1451
            ],
            [
                1451,
                1451
            ],
            [
                1451,
                1505
            ],
            [
                1505,
                1633
            ],
            [
                1633,
                1681
            ],
            [
                1681,
                1714
            ],
            [
                1714,
                1742
            ],
            [
                1742,
                1742
            ],
            [
                1742,
                1779
            ],
            [
                1779,
                1871
            ],
            [
                1871,
                1914
            ],
            [
                1914,
                1936
            ],
            [
                1936,
                2091
            ],
            [
                2091,
                2230
            ],
            [
                2230,
                2278
            ],
            [
                2278,
                2286
            ],
            [
                2286,
                2315
            ],
            [
                2315,
                2346
            ],
            [
                2346,
                2371
            ],
            [
                2371,
                2371
            ],
            [
                2371,
                2419
            ],
            [
                2419,
                2483
            ],
            [
                2483,
                2591
            ],
            [
                2591,
                2659
            ],
            [
                2659,
                2721
            ],
            [
                2721,
                2789
            ],
            [
                2789,
                2789
            ],
            [
                2789,
                2789
            ],
            [
                2789,
                2861
            ],
            [
                2861,
                2914
            ],
            [
                2914,
                2955
            ],
            [
                2955,
                2989
            ],
            [
                2989,
                3078
            ],
            [
                3078,
                3117
            ],
            [
                3117,
                3184
            ],
            [
                3184,
                3314
            ],
            [
                3314,
                3319
            ],
            [
                3319,
                3340
            ],
            [
                3340,
                3372
            ],
            [
                3372,
                3495
            ],
            [
                3495,
                3522
            ],
            [
                3522,
                3560
            ],
            [
                3560,
                3726
            ],
            [
                3726,
                3754
            ],
            [
                3754,
                4021
            ],
            [
                4021,
                4116
            ],
            [
                4116,
                4116
            ],
            [
                4116,
                4170
            ],
            [
                4170,
                4214
            ],
            [
                4214,
                4289
            ],
            [
                4289,
                4289
            ],
            [
                4289,
                4347
            ],
            [
                4347,
                4429
            ],
            [
                4429,
                4470
            ],
            [
                4470,
                4516
            ],
            [
                4516,
                4738
            ],
            [
                4738,
                4783
            ],
            [
                4783,
                4816
            ],
            [
                4816,
                4841
            ],
            [
                4841,
                4867
            ],
            [
                4867,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                4949
            ],
            [
                4949,
                5127
            ],
            [
                5127,
                5180
            ],
            [
                5180,
                5267
            ],
            [
                5267,
                5308
            ],
            [
                5308,
                5414
            ],
            [
                5414,
                5484
            ],
            [
                5484,
                5587
            ],
            [
                5587,
                5705
            ],
            [
                5705,
                5775
            ],
            [
                5775,
                5873
            ],
            [
                5873,
                5936
            ],
            [
                5936,
                5974
            ],
            [
                5974,
                6028
            ],
            [
                6028,
                6235
            ],
            [
                6235,
                6267
            ],
            [
                6267,
                6325
            ],
            [
                6325,
                6558
            ],
            [
                6558,
                6691
            ],
            [
                6691,
                6733
            ],
            [
                6733,
                6827
            ],
            [
                6827,
                6874
            ],
            [
                6874,
                6917
            ],
            [
                6917,
                6977
            ],
            [
                6977,
                6993
            ],
            [
                6993,
                7004
            ],
            [
                7004,
                7060
            ],
            [
                7060,
                7126
            ],
            [
                7126,
                7217
            ],
            [
                7217,
                7225
            ],
            [
                7225,
                7330
            ],
            [
                7330,
                7547
            ],
            [
                7547,
                7786
            ],
            [
                7786,
                7855
            ],
            [
                7855,
                7915
            ],
            [
                7915,
                7952
            ],
            [
                7952,
                8037
            ],
            [
                8037,
                8111
            ],
            [
                8111,
                8179
            ],
            [
                8179,
                8228
            ],
            [
                8228,
                8228
            ],
            [
                8228,
                8295
            ],
            [
                8295,
                8345
            ],
            [
                8345,
                8494
            ],
            [
                8494,
                8494
            ],
            [
                8494,
                8560
            ],
            [
                8560,
                8654
            ],
            [
                8654,
                8705
            ],
            [
                8705,
                8705
            ],
            [
                8705,
                8835
            ],
            [
                8835,
                8835
            ],
            [
                8835,
                8897
            ],
            [
                8897,
                8957
            ],
            [
                8957,
                9045
            ],
            [
                9045,
                9071
            ],
            [
                9071,
                9215
            ],
            [
                9215,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9380
            ],
            [
                9380,
                9428
            ],
            [
                9428,
                9489
            ],
            [
                9489,
                9518
            ],
            [
                9518,
                9672
            ],
            [
                9672,
                9717
            ],
            [
                9717,
                9753
            ],
            [
                9753,
                9794
            ],
            [
                9794,
                9842
            ],
            [
                9842,
                9896
            ],
            [
                9896,
                9940
            ],
            [
                9940,
                10006
            ],
            [
                10006,
                10067
            ],
            [
                10067,
                10171
            ],
            [
                10171,
                10264
            ],
            [
                10264,
                10306
            ],
            [
                10306,
                10413
            ],
            [
                10413,
                10459
            ],
            [
                10459,
                10520
            ],
            [
                10520,
                10649
            ],
            [
                10649,
                10649
            ],
            [
                10649,
                10710
            ],
            [
                10710,
                10744
            ],
            [
                10744,
                10744
            ],
            [
                10744,
                10832
            ],
            [
                10832,
                11000
            ],
            [
                11000,
                11025
            ],
            [
                11025,
                11038
            ],
            [
                11038,
                11057
            ],
            [
                11057,
                11287
            ],
            [
                11287,
                11457
            ],
            [
                11457,
                11563
            ],
            [
                11563,
                11594
            ],
            [
                11594,
                11657
            ],
            [
                11657,
                11744
            ],
            [
                11744,
                11744
            ],
            [
                11744,
                11826
            ],
            [
                11826,
                11904
            ],
            [
                11904,
                11904
            ],
            [
                11904,
                11904
            ],
            [
                11904,
                11904
            ],
            [
                11904,
                11984
            ],
            [
                11984,
                11984
            ],
            [
                11984,
                11984
            ],
            [
                11984,
                12087
            ],
            [
                12087,
                12313
            ],
            [
                12313,
                12388
            ],
            [
                12388,
                12556
            ],
            [
                12556,
                12624
            ],
            [
                12624,
                12657
            ],
            [
                12657,
                12952
            ],
            [
                12952,
                13123
            ],
            [
                13123,
                13158
            ],
            [
                13158,
                13233
            ],
            [
                13233,
                13327
            ],
            [
                13327,
                13327
            ],
            [
                13327,
                13365
            ],
            [
                13365,
                13441
            ],
            [
                13441,
                13441
            ],
            [
                13441,
                13441
            ],
            [
                13441,
                13441
            ],
            [
                13441,
                13441
            ],
            [
                13441,
                13481
            ],
            [
                13481,
                13516
            ],
            [
                13516,
                13545
            ],
            [
                13545,
                13639
            ],
            [
                13639,
                13685
            ],
            [
                13685,
                13702
            ],
            [
                13702,
                13745
            ],
            [
                13745,
                13796
            ],
            [
                13796,
                13890
            ],
            [
                13890,
                13929
            ],
            [
                13929,
                13979
            ],
            [
                13979,
                14174
            ]
        ]
    }
}