{
    "original": {
        "text": "Edmund now believed himself perfectly acquainted with all that Fanny could tell, or could leave to be conjectured of her sentiments, and he was satisfied. It had been, as he before presumed, too hasty a measure on Crawford's side, and time must be given to make the idea first familiar, and then agreeable to her. She must be used to the consideration of his being in love with her, and then a return of affection might not be very distant.\nHe gave this opinion as the result of the conversation to his father; and recommended there being nothing more said to her: no farther attempts to influence or persuade; but that everything should be left to Crawford's assiduities, and the natural workings of her own mind.\nSir Thomas promised that it should be so. Edmund's account of Fanny's disposition he could believe to be just; he supposed she had all those feelings, but he must consider it as very unfortunate that she _had_; for, less willing than his son to trust to the future, he could not help fearing that if such very long allowances of time and habit were necessary for her, she might not have persuaded herself into receiving his addresses properly before the young man's inclination for paying them were over. There was nothing to be done, however, but to submit quietly and hope the best.\nThe promised visit from \"her friend,\" as Edmund called Miss Crawford, was a formidable threat to Fanny, and she lived in continual terror of it. As a sister, so partial and so angry, and so little scrupulous of what she said, and in another light so triumphant and secure, she was in every way an object of painful alarm. Her displeasure, her penetration, and her happiness were all fearful to encounter; and the dependence of having others present when they met was Fanny's only support in looking forward to it. She absented herself as little as possible from Lady Bertram, kept away from the East room, and took no solitary walk in the shrubbery, in her caution to avoid any sudden attack.\nShe succeeded. She was safe in the breakfast-room, with her aunt, when Miss Crawford did come; and the first misery over, and Miss Crawford looking and speaking with much less particularity of expression than she had anticipated, Fanny began to hope there would be nothing worse to be endured than a half-hour of moderate agitation. But here she hoped too much; Miss Crawford was not the slave of opportunity. She was determined to see Fanny alone, and therefore said to her tolerably soon, in a low voice, \"I must speak to you for a few minutes somewhere\"; words that Fanny felt all over her, in all her pulses and all her nerves. Denial was impossible. Her habits of ready submission, on the contrary, made her almost instantly rise and lead the way out of the room. She did it with wretched feelings, but it was inevitable.\nThey were no sooner in the hall than all restraint of countenance was over on Miss Crawford's side. She immediately shook her head at Fanny with arch, yet affectionate reproach, and taking her hand, seemed hardly able to help beginning directly. She said nothing, however, but, \"Sad, sad girl! I do not know when I shall have done scolding you,\" and had discretion enough to reserve the rest till they might be secure of having four walls to themselves. Fanny naturally turned upstairs, and took her guest to the apartment which was now always fit for comfortable use; opening the door, however, with a most aching heart, and feeling that she had a more distressing scene before her than ever that spot had yet witnessed. But the evil ready to burst on her was at least delayed by the sudden change in Miss Crawford's ideas; by the strong effect on her mind which the finding herself in the East room again produced.\n\"Ha!\" she cried, with instant animation, \"am I here again? The East room! Once only was I in this room before\"; and after stopping to look about her, and seemingly to retrace all that had then passed, she added, \"Once only before. Do you remember it? I came to rehearse. Your cousin came too; and we had a rehearsal. You were our audience and prompter. A delightful rehearsal. I shall never forget it. Here we were, just in this part of the room: here was your cousin, here was I, here were the chairs. Oh! why will such things ever pass away?\"\nHappily for her companion, she wanted no answer. Her mind was entirely self-engrossed. She was in a reverie of sweet remembrances.\n\"The scene we were rehearsing was so very remarkable! The subject of it so very-very-what shall I say? He was to be describing and recommending matrimony to me. I think I see him now, trying to be as demure and composed as Anhalt ought, through the two long speeches. 'When two sympathetic hearts meet in the marriage state, matrimony may be called a happy life.' I suppose no time can ever wear out the impression I have of his looks and voice as he said those words. It was curious, very curious, that we should have such a scene to play! If I had the power of recalling any one week of my existence, it should be that week-that acting week. Say what you would, Fanny, it should be _that_; for I never knew such exquisite happiness in any other. His sturdy spirit to bend as it did! Oh! it was sweet beyond expression. But alas, that very evening destroyed it all. That very evening brought your most unwelcome uncle. Poor Sir Thomas, who was glad to see you? Yet, Fanny, do not imagine I would now speak disrespectfully of Sir Thomas, though I certainly did hate him for many a week. No, I do him justice now. He is just what the head of such a family should be. Nay, in sober sadness, I believe I now love you all.\" And having said so, with a degree of tenderness and consciousness which Fanny had never seen in her before, and now thought only too becoming, she turned away for a moment to recover herself. \"I have had a little fit since I came into this room, as you may perceive,\" said she presently, with a playful smile, \"but it is over now; so let us sit down and be comfortable; for as to scolding you, Fanny, which I came fully intending to do, I have not the heart for it when it comes to the point.\" And embracing her very affectionately, \"Good, gentle Fanny! when I think of this being the last time of seeing you for I do not know how long, I feel it quite impossible to do anything but love you.\"\nFanny was affected. She had not foreseen anything of this, and her feelings could seldom withstand the melancholy influence of the word \"last.\" She cried as if she had loved Miss Crawford more than she possibly could; and Miss Crawford, yet farther softened by the sight of such emotion, hung about her with fondness, and said, \"I hate to leave you. I shall see no one half so amiable where I am going. Who says we shall not be sisters? I know we shall. I feel that we are born to be connected; and those tears convince me that you feel it too, dear Fanny.\"\nFanny roused herself, and replying only in part, said, \"But you are only going from one set of friends to another. You are going to a very particular friend.\"\n\"Yes, very true. Mrs. Fraser has been my intimate friend for years. But I have not the least inclination to go near her. I can think only of the friends I am leaving: my excellent sister, yourself, and the Bertrams in general. You have all so much more _heart_ among you than one finds in the world at large. You all give me a feeling of being able to trust and confide in you, which in common intercourse one knows nothing of. I wish I had settled with Mrs. Fraser not to go to her till after Easter, a much better time for the visit, but now I cannot put her off. And when I have done with her I must go to her sister, Lady Stornaway, because _she_ was rather my most particular friend of the two, but I have not cared much for _her_ these three years.\"\nAfter this speech the two girls sat many minutes silent, each thoughtful: Fanny meditating on the different sorts of friendship in the world, Mary on something of less philosophic tendency. _She_ first spoke again.\n\"How perfectly I remember my resolving to look for you upstairs, and setting off to find my way to the East room, without having an idea whereabouts it was! How well I remember what I was thinking of as I came along, and my looking in and seeing you here sitting at this table at work; and then your cousin's astonishment, when he opened the door, at seeing me here! To be sure, your uncle's returning that very evening! There never was anything quite like it.\"\nAnother short fit of abstraction followed, when, shaking it off, she thus attacked her companion.\n\"Why, Fanny, you are absolutely in a reverie. Thinking, I hope, of one who is always thinking of you. Oh! that I could transport you for a short time into our circle in town, that you might understand how your power over Henry is thought of there! Oh! the envyings and heartburnings of dozens and dozens; the wonder, the incredulity that will be felt at hearing what you have done! For as to secrecy, Henry is quite the hero of an old romance, and glories in his chains. You should come to London to know how to estimate your conquest. If you were to see how he is courted, and how I am courted for his sake! Now, I am well aware that I shall not be half so welcome to Mrs. Fraser in consequence of his situation with you. When she comes to know the truth she will, very likely, wish me in Northamptonshire again; for there is a daughter of Mr. Fraser, by a first wife, whom she is wild to get married, and wants Henry to take. Oh! she has been trying for him to such a degree. Innocent and quiet as you sit here, you cannot have an idea of the _sensation_ that you will be occasioning, of the curiosity there will be to see you, of the endless questions I shall have to answer! Poor Margaret Fraser will be at me for ever about your eyes and your teeth, and how you do your hair, and who makes your shoes. I wish Margaret were married, for my poor friend's sake, for I look upon the Frasers to be about as unhappy as most other married people. And yet it was a most desirable match for Janet at the time. We were all delighted. She could not do otherwise than accept him, for he was rich, and she had nothing; but he turns out ill-tempered and _exigeant_, and wants a young woman, a beautiful young woman of five-and-twenty, to be as steady as himself. And my friend does not manage him well; she does not seem to know how to make the best of it. There is a spirit of irritation which, to say nothing worse, is certainly very ill-bred. In their house I shall call to mind the conjugal manners of Mansfield Parsonage with respect. Even Dr. Grant does shew a thorough confidence in my sister, and a certain consideration for her judgment, which makes one feel there _is_ attachment; but of that I shall see nothing with the Frasers. I shall be at Mansfield for ever, Fanny. My own sister as a wife, Sir Thomas Bertram as a husband, are my standards of perfection. Poor Janet has been sadly taken in, and yet there was nothing improper on her side: she did not run into the match inconsiderately; there was no want of foresight. She took three days to consider of his proposals, and during those three days asked the advice of everybody connected with her whose opinion was worth having, and especially applied to my late dear aunt, whose knowledge of the world made her judgment very generally and deservedly looked up to by all the young people of her acquaintance, and she was decidedly in favour of Mr. Fraser. This seems as if nothing were a security for matrimonial comfort. I have not so much to say for my friend Flora, who jilted a very nice young man in the Blues for the sake of that horrid Lord Stornaway, who has about as much sense, Fanny, as Mr. Rushworth, but much worse-looking, and with a blackguard character. I _had_ my doubts at the time about her being right, for he has not even the air of a gentleman, and now I am sure she was wrong. By the bye, Flora Ross was dying for Henry the first winter she came out. But were I to attempt to tell you of all the women whom I have known to be in love with him, I should never have done. It is you, only you, insensible Fanny, who can think of him with anything like indifference. But are you so insensible as you profess yourself? No, no, I see you are not.\"\nThere was, indeed, so deep a blush over Fanny's face at that moment as might warrant strong suspicion in a predisposed mind.\n\"Excellent creature! I will not tease you. Everything shall take its course. But, dear Fanny, you must allow that you were not so absolutely unprepared to have the question asked as your cousin fancies. It is not possible but that you must have had some thoughts on the subject, some surmises as to what might be. You must have seen that he was trying to please you by every attention in his power. Was not he devoted to you at the ball? And then before the ball, the necklace! Oh! you received it just as it was meant. You were as conscious as heart could desire. I remember it perfectly.\"\n\"Do you mean, then, that your brother knew of the necklace beforehand? Oh! Miss Crawford, _that_ was not fair.\"\n\"Knew of it! It was his own doing entirely, his own thought. I am ashamed to say that it had never entered my head, but I was delighted to act on his proposal for both your sakes.\"\n\"I will not say,\" replied Fanny, \"that I was not half afraid at the time of its being so, for there was something in your look that frightened me, but not at first; I was as unsuspicious of it at first-indeed, indeed I was. It is as true as that I sit here. And had I had an idea of it, nothing should have induced me to accept the necklace. As to your brother's behaviour, certainly I was sensible of a particularity: I had been sensible of it some little time, perhaps two or three weeks; but then I considered it as meaning nothing: I put it down as simply being his way, and was as far from supposing as from wishing him to have any serious thoughts of me. I had not, Miss Crawford, been an inattentive observer of what was passing between him and some part of this family in the summer and autumn. I was quiet, but I was not blind. I could not but see that Mr. Crawford amused himself in gallantries which did mean nothing.\"\n\"Ah! I cannot deny it. He has now and then been a sad flirt, and cared very little for the havoc he might be making in young ladies' affections. I have often scolded him for it, but it is his only fault; and there is this to be said, that very few young ladies have any affections worth caring for. And then, Fanny, the glory of fixing one who has been shot at by so many; of having it in one's power to pay off the debts of one's sex! Oh! I am sure it is not in woman's nature to refuse such a triumph.\"\nFanny shook her head. \"I cannot think well of a man who sports with any woman's feelings; and there may often be a great deal more suffered than a stander-by can judge of.\"\n\"I do not defend him. I leave him entirely to your mercy, and when he has got you at Everingham, I do not care how much you lecture him. But this I will say, that his fault, the liking to make girls a little in love with him, is not half so dangerous to a wife's happiness as a tendency to fall in love himself, which he has never been addicted to. And I do seriously and truly believe that he is attached to you in a way that he never was to any woman before; that he loves you with all his heart, and will love you as nearly for ever as possible. If any man ever loved a woman for ever, I think Henry will do as much for you.\"\nFanny could not avoid a faint smile, but had nothing to say.\n\"I cannot imagine Henry ever to have been happier,\" continued Mary presently, \"than when he had succeeded in getting your brother's commission.\"\nShe had made a sure push at Fanny's feelings here.\n\"Oh! yes. How very, very kind of him.\"\n\"I know he must have exerted himself very much, for I know the parties he had to move. The Admiral hates trouble, and scorns asking favours; and there are so many young men's claims to be attended to in the same way, that a friendship and energy, not very determined, is easily put by. What a happy creature William must be! I wish we could see him.\"\nPoor Fanny's mind was thrown into the most distressing of all its varieties. The recollection of what had been done for William was always the most powerful disturber of every decision against Mr. Crawford; and she sat thinking deeply of it till Mary, who had been first watching her complacently, and then musing on something else, suddenly called her attention by saying: \"I should like to sit talking with you here all day, but we must not forget the ladies below, and so good-bye, my dear, my amiable, my excellent Fanny, for though we shall nominally part in the breakfast-parlour, I must take leave of you here. And I do take leave, longing for a happy reunion, and trusting that when we meet again, it will be under circumstances which may open our hearts to each other without any remnant or shadow of reserve.\"\nA very, very kind embrace, and some agitation of manner, accompanied these words.\n\"I shall see your cousin in town soon: he talks of being there tolerably soon; and Sir Thomas, I dare say, in the course of the spring; and your eldest cousin, and the Rushworths, and Julia, I am sure of meeting again and again, and all but you. I have two favours to ask, Fanny: one is your correspondence. You must write to me. And the other, that you will often call on Mrs. Grant, and make her amends for my being gone.\"\nThe first, at least, of these favours Fanny would rather not have been asked; but it was impossible for her to refuse the correspondence; it was impossible for her even not to accede to it more readily than her own judgment authorised. There was no resisting so much apparent affection. Her disposition was peculiarly calculated to value a fond treatment, and from having hitherto known so little of it, she was the more overcome by Miss Crawford's. Besides, there was gratitude towards her, for having made their _tte--tte_ so much less painful than her fears had predicted.\nIt was over, and she had escaped without reproaches and without detection. Her secret was still her own; and while that was the case, she thought she could resign herself to almost everything.\nIn the evening there was another parting. Henry Crawford came and sat some time with them; and her spirits not being previously in the strongest state, her heart was softened for a while towards him, because he really seemed to feel. Quite unlike his usual self, he scarcely said anything. He was evidently oppressed, and Fanny must grieve for him, though hoping she might never see him again till he were the husband of some other woman.\nWhen it came to the moment of parting, he would take her hand, he would not be denied it; he said nothing, however, or nothing that she heard, and when he had left the room, she was better pleased that such a token of friendship had passed.\nOn the morrow the Crawfords were gone.",
        "paragraph_chars": [
            [
                0,
                441
            ],
            [
                441,
                715
            ],
            [
                715,
                1300
            ],
            [
                1300,
                1993
            ],
            [
                1993,
                2820
            ],
            [
                2820,
                3737
            ],
            [
                3737,
                4282
            ],
            [
                4282,
                4413
            ],
            [
                4413,
                6327
            ],
            [
                6327,
                6885
            ],
            [
                6885,
                7044
            ],
            [
                7044,
                7800
            ],
            [
                7800,
                8015
            ],
            [
                8015,
                8477
            ],
            [
                8477,
                8575
            ],
            [
                8575,
                12297
            ],
            [
                12297,
                12422
            ],
            [
                12422,
                13013
            ],
            [
                13013,
                13125
            ],
            [
                13125,
                13306
            ],
            [
                13306,
                14236
            ],
            [
                14236,
                14741
            ],
            [
                14741,
                14914
            ],
            [
                14914,
                15543
            ],
            [
                15543,
                15604
            ],
            [
                15604,
                15749
            ],
            [
                15749,
                15800
            ],
            [
                15800,
                15839
            ],
            [
                15839,
                16190
            ],
            [
                16190,
                17010
            ],
            [
                17010,
                17092
            ],
            [
                17092,
                17517
            ],
            [
                17517,
                18093
            ],
            [
                18093,
                18286
            ],
            [
                18286,
                18725
            ],
            [
                18725,
                18966
            ],
            [
                18966,
                19004
            ]
        ],
        "segment_chars": [
            [
                0,
                155
            ],
            [
                155,
                314
            ],
            [
                314,
                441
            ],
            [
                441,
                715
            ],
            [
                715,
                757
            ],
            [
                757,
                1220
            ],
            [
                1220,
                1300
            ],
            [
                1300,
                1445
            ],
            [
                1445,
                1622
            ],
            [
                1622,
                1814
            ],
            [
                1814,
                1993
            ],
            [
                1993,
                2008
            ],
            [
                2008,
                2326
            ],
            [
                2326,
                2403
            ],
            [
                2403,
                2625
            ],
            [
                2625,
                2648
            ],
            [
                2648,
                2762
            ],
            [
                2762,
                2820
            ],
            [
                2820,
                2920
            ],
            [
                2920,
                3066
            ],
            [
                3066,
                3114
            ],
            [
                3114,
                3274
            ],
            [
                3274,
                3542
            ],
            [
                3542,
                3737
            ],
            [
                3737,
                3743
            ],
            [
                3743,
                3796
            ],
            [
                3796,
                3811
            ],
            [
                3811,
                3968
            ],
            [
                3968,
                3988
            ],
            [
                3988,
                4008
            ],
            [
                4008,
                4054
            ],
            [
                4054,
                4090
            ],
            [
                4090,
                4114
            ],
            [
                4114,
                4139
            ],
            [
                4139,
                4240
            ],
            [
                4240,
                4244
            ],
            [
                4244,
                4282
            ],
            [
                4282,
                4331
            ],
            [
                4331,
                4369
            ],
            [
                4369,
                4413
            ],
            [
                4413,
                4467
            ],
            [
                4467,
                4516
            ],
            [
                4516,
                4574
            ],
            [
                4574,
                4681
            ],
            [
                4681,
                4777
            ],
            [
                4777,
                4882
            ],
            [
                4882,
                4954
            ],
            [
                4954,
                5057
            ],
            [
                5057,
                5161
            ],
            [
                5161,
                5198
            ],
            [
                5198,
                5202
            ],
            [
                5202,
                5234
            ],
            [
                5234,
                5280
            ],
            [
                5280,
                5333
            ],
            [
                5333,
                5375
            ],
            [
                5375,
                5500
            ],
            [
                5500,
                5526
            ],
            [
                5526,
                5579
            ],
            [
                5579,
                5633
            ],
            [
                5633,
                5825
            ],
            [
                5825,
                6127
            ],
            [
                6127,
                6187
            ],
            [
                6187,
                6327
            ],
            [
                6327,
                6347
            ],
            [
                6347,
                6471
            ],
            [
                6471,
                6677
            ],
            [
                6677,
                6730
            ],
            [
                6730,
                6764
            ],
            [
                6764,
                6781
            ],
            [
                6781,
                6885
            ],
            [
                6885,
                7000
            ],
            [
                7000,
                7044
            ],
            [
                7044,
                7061
            ],
            [
                7061,
                7112
            ],
            [
                7112,
                7165
            ],
            [
                7165,
                7271
            ],
            [
                7271,
                7353
            ],
            [
                7353,
                7472
            ],
            [
                7472,
                7610
            ],
            [
                7610,
                7800
            ],
            [
                7800,
                7990
            ],
            [
                7990,
                8015
            ],
            [
                8015,
                8172
            ],
            [
                8172,
                8382
            ],
            [
                8382,
                8436
            ],
            [
                8436,
                8477
            ],
            [
                8477,
                8575
            ],
            [
                8575,
                8621
            ],
            [
                8621,
                8677
            ],
            [
                8677,
                8681
            ],
            [
                8681,
                8823
            ],
            [
                8823,
                8827
            ],
            [
                8827,
                8957
            ],
            [
                8957,
                9046
            ],
            [
                9046,
                9111
            ],
            [
                9111,
                9184
            ],
            [
                9184,
                9298
            ],
            [
                9298,
                9503
            ],
            [
                9503,
                9507
            ],
            [
                9507,
                9553
            ],
            [
                9553,
                9754
            ],
            [
                9754,
                9882
            ],
            [
                9882,
                10020
            ],
            [
                10020,
                10081
            ],
            [
                10081,
                10104
            ],
            [
                10104,
                10329
            ],
            [
                10329,
                10423
            ],
            [
                10423,
                10512
            ],
            [
                10512,
                10606
            ],
            [
                10606,
                10807
            ],
            [
                10807,
                10848
            ],
            [
                10848,
                10938
            ],
            [
                10938,
                11102
            ],
            [
                11102,
                11488
            ],
            [
                11488,
                11554
            ],
            [
                11554,
                11802
            ],
            [
                11802,
                11932
            ],
            [
                11932,
                12006
            ],
            [
                12006,
                12125
            ],
            [
                12125,
                12218
            ],
            [
                12218,
                12269
            ],
            [
                12269,
                12297
            ],
            [
                12297,
                12422
            ],
            [
                12422,
                12443
            ],
            [
                12443,
                12465
            ],
            [
                12465,
                12499
            ],
            [
                12499,
                12625
            ],
            [
                12625,
                12736
            ],
            [
                12736,
                12821
            ],
            [
                12821,
                12860
            ],
            [
                12860,
                12900
            ],
            [
                12900,
                12904
            ],
            [
                12904,
                12942
            ],
            [
                12942,
                12987
            ],
            [
                12987,
                13013
            ],
            [
                13013,
                13084
            ],
            [
                13084,
                13088
            ],
            [
                13088,
                13125
            ],
            [
                13125,
                13138
            ],
            [
                13138,
                13186
            ],
            [
                13186,
                13306
            ],
            [
                13306,
                13530
            ],
            [
                13530,
                13564
            ],
            [
                13564,
                13648
            ],
            [
                13648,
                13967
            ],
            [
                13967,
                14109
            ],
            [
                14109,
                14143
            ],
            [
                14143,
                14236
            ],
            [
                14236,
                14241
            ],
            [
                14241,
                14259
            ],
            [
                14259,
                14381
            ],
            [
                14381,
                14535
            ],
            [
                14535,
                14672
            ],
            [
                14672,
                14676
            ],
            [
                14676,
                14741
            ],
            [
                14741,
                14763
            ],
            [
                14763,
                14914
            ],
            [
                14914,
                14936
            ],
            [
                14936,
                15051
            ],
            [
                15051,
                15263
            ],
            [
                15263,
                15463
            ],
            [
                15463,
                15543
            ],
            [
                15543,
                15604
            ],
            [
                15604,
                15749
            ],
            [
                15749,
                15800
            ],
            [
                15800,
                15805
            ],
            [
                15805,
                15810
            ],
            [
                15810,
                15839
            ],
            [
                15839,
                15926
            ],
            [
                15926,
                16125
            ],
            [
                16125,
                16164
            ],
            [
                16164,
                16190
            ],
            [
                16190,
                16267
            ],
            [
                16267,
                16808
            ],
            [
                16808,
                17010
            ],
            [
                17010,
                17092
            ],
            [
                17092,
                17338
            ],
            [
                17338,
                17400
            ],
            [
                17400,
                17422
            ],
            [
                17422,
                17517
            ],
            [
                17517,
                17753
            ],
            [
                17753,
                17804
            ],
            [
                17804,
                17967
            ],
            [
                17967,
                18093
            ],
            [
                18093,
                18168
            ],
            [
                18168,
                18286
            ],
            [
                18286,
                18328
            ],
            [
                18328,
                18520
            ],
            [
                18520,
                18576
            ],
            [
                18576,
                18725
            ],
            [
                18725,
                18966
            ],
            [
                18966,
                19004
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                133,
                155
            ],
            [
                218,
                222
            ],
            [
                158,
                166
            ],
            [
                191,
                200
            ],
            [
                312,
                314
            ],
            [
                314,
                317
            ],
            [
                326,
                337
            ],
            [
                352,
                382
            ],
            [
                392,
                441
            ],
            [
                441,
                461
            ],
            [
                496,
                526
            ],
            [
                539,
                551
            ],
            [
                552,
                564
            ],
            [
                611,
                659
            ],
            [
                671,
                715
            ],
            [
                715,
                757
            ],
            [
                797,
                799
            ],
            [
                757,
                784
            ],
            [
                814,
                824
            ],
            [
                864,
                872
            ],
            [
                887,
                892
            ],
            [
                898,
                909
            ],
            [
                924,
                929
            ],
            [
                981,
                1048
            ],
            [
                1059,
                1148
            ],
            [
                1158,
                1220
            ],
            [
                1220,
                1272
            ],
            [
                1281,
                1289
            ],
            [
                1290,
                1300
            ],
            [
                1300,
                1402
            ],
            [
                1443,
                1445
            ],
            [
                1445,
                1525
            ],
            [
                1573,
                1580
            ],
            [
                1594,
                1622
            ],
            [
                1709,
                1814
            ],
            [
                1814,
                1993
            ],
            [
                1993,
                2008
            ],
            [
                2008,
                2091
            ],
            [
                2223,
                2228
            ],
            [
                2243,
                2326
            ],
            [
                2326,
                2372
            ],
            [
                2411,
                2445
            ],
            [
                2456,
                2467
            ],
            [
                2482,
                2585
            ],
            [
                2623,
                2625
            ],
            [
                2625,
                2648
            ],
            [
                2648,
                2705
            ],
            [
                2713,
                2761
            ],
            [
                2820,
                2856
            ],
            [
                2898,
                2911
            ],
            [
                2936,
                3001
            ],
            [
                3009,
                3017
            ],
            [
                3066,
                3114
            ],
            [
                3114,
                3163
            ],
            [
                3274,
                3279
            ],
            [
                3290,
                3332
            ],
            [
                3389,
                3468
            ],
            [
                3474,
                3502
            ],
            [
                3540,
                3542
            ],
            [
                3542,
                3554
            ],
            [
                3577,
                3580
            ],
            [
                3590,
                3737
            ],
            [
                3737,
                3743
            ],
            [
                3743,
                3752
            ],
            [
                3776,
                3796
            ],
            [
                3811,
                3886
            ],
            [
                3949,
                3950
            ],
            [
                3968,
                3988
            ],
            [
                3988,
                4008
            ],
            [
                4008,
                4033
            ],
            [
                4054,
                4090
            ],
            [
                4090,
                4114
            ],
            [
                4114,
                4139
            ],
            [
                4240,
                4244
            ],
            [
                4244,
                4282
            ],
            [
                4282,
                4331
            ],
            [
                4331,
                4367
            ],
            [
                4377,
                4413
            ],
            [
                4413,
                4467
            ],
            [
                4467,
                4516
            ],
            [
                4516,
                4522
            ],
            [
                4544,
                4572
            ],
            [
                4595,
                4681
            ],
            [
                4681,
                4777
            ],
            [
                4777,
                4778
            ],
            [
                4795,
                4798
            ],
            [
                4838,
                4882
            ],
            [
                4954,
                4958
            ],
            [
                4986,
                5038
            ],
            [
                5103,
                5161
            ],
            [
                5161,
                5198
            ],
            [
                5198,
                5202
            ],
            [
                5202,
                5234
            ],
            [
                5234,
                5278
            ],
            [
                5298,
                5333
            ],
            [
                5375,
                5500
            ],
            [
                5500,
                5526
            ],
            [
                5526,
                5579
            ],
            [
                5579,
                5633
            ],
            [
                5633,
                5636
            ],
            [
                5653,
                5824
            ],
            [
                5825,
                5958
            ],
            [
                5962,
                6033
            ],
            [
                6070,
                6127
            ],
            [
                6127,
                6144
            ],
            [
                6150,
                6187
            ],
            [
                6187,
                6327
            ],
            [
                6351,
                6367
            ],
            [
                6380,
                6471
            ],
            [
                6471,
                6563
            ],
            [
                6568,
                6614
            ],
            [
                6649,
                6677
            ],
            [
                6677,
                6730
            ],
            [
                6730,
                6764
            ],
            [
                6764,
                6781
            ],
            [
                6781,
                6885
            ],
            [
                6885,
                6910
            ],
            [
                6934,
                6944
            ],
            [
                7000,
                7044
            ],
            [
                7044,
                7045
            ],
            [
                7050,
                7061
            ],
            [
                7061,
                7112
            ],
            [
                7112,
                7165
            ],
            [
                7165,
                7209
            ],
            [
                7269,
                7271
            ],
            [
                7271,
                7296
            ],
            [
                7298,
                7303
            ],
            [
                7305,
                7353
            ],
            [
                7353,
                7420
            ],
            [
                7470,
                7472
            ],
            [
                7472,
                7519
            ],
            [
                7527,
                7544
            ],
            [
                7578,
                7610
            ],
            [
                7610,
                7613
            ],
            [
                7640,
                7688
            ],
            [
                7690,
                7693
            ],
            [
                7695,
                7698
            ],
            [
                7706,
                7773
            ],
            [
                7636,
                7639
            ],
            [
                7780,
                7800
            ],
            [
                7800,
                7835
            ],
            [
                7849,
                7856
            ],
            [
                7942,
                7946
            ],
            [
                8002,
                8015
            ],
            [
                8015,
                8040
            ],
            [
                8044,
                8172
            ],
            [
                8172,
                8191
            ],
            [
                8239,
                8264
            ],
            [
                8270,
                8277
            ],
            [
                8292,
                8382
            ],
            [
                8436,
                8477
            ],
            [
                8477,
                8518
            ],
            [
                8542,
                8575
            ],
            [
                8575,
                8621
            ],
            [
                8621,
                8677
            ],
            [
                8677,
                8681
            ],
            [
                8686,
                8707
            ],
            [
                8725,
                8823
            ],
            [
                8823,
                8827
            ],
            [
                8827,
                8879
            ],
            [
                8892,
                8957
            ],
            [
                8957,
                8981
            ],
            [
                9023,
                9046
            ],
            [
                9111,
                9147
            ],
            [
                9065,
                9071
            ],
            [
                9182,
                9184
            ],
            [
                9210,
                9255
            ],
            [
                9298,
                9306
            ],
            [
                9321,
                9330
            ],
            [
                9387,
                9392
            ],
            [
                9331,
                9334
            ],
            [
                9402,
                9403
            ],
            [
                9404,
                9412
            ],
            [
                9445,
                9503
            ],
            [
                9503,
                9507
            ],
            [
                9507,
                9553
            ],
            [
                9553,
                9619
            ],
            [
                9669,
                9692
            ],
            [
                9700,
                9754
            ],
            [
                9754,
                9803
            ],
            [
                9834,
                9882
            ],
            [
                9882,
                9944
            ],
            [
                9955,
                9966
            ],
            [
                9973,
                9997
            ],
            [
                10004,
                10020
            ],
            [
                10020,
                10081
            ],
            [
                10104,
                10107
            ],
            [
                10136,
                10219
            ],
            [
                10230,
                10243
            ],
            [
                10269,
                10299
            ],
            [
                10301,
                10329
            ],
            [
                10329,
                10342
            ],
            [
                10373,
                10423
            ],
            [
                10444,
                10454
            ],
            [
                10484,
                10512
            ],
            [
                10606,
                10620
            ],
            [
                10631,
                10632
            ],
            [
                10642,
                10672
            ],
            [
                10681,
                10739
            ],
            [
                10741,
                10743
            ],
            [
                10745,
                10807
            ],
            [
                10938,
                10981
            ],
            [
                11102,
                11133
            ],
            [
                11137,
                11155
            ],
            [
                11180,
                11185
            ],
            [
                11190,
                11196
            ],
            [
                11486,
                11488
            ],
            [
                11554,
                11718
            ],
            [
                11727,
                11748
            ],
            [
                11749,
                11802
            ],
            [
                11950,
                12006
            ],
            [
                12006,
                12016
            ],
            [
                12028,
                12056
            ],
            [
                12064,
                12068
            ],
            [
                12081,
                12113
            ],
            [
                12123,
                12125
            ],
            [
                12125,
                12130
            ],
            [
                12136,
                12145
            ],
            [
                12157,
                12189
            ],
            [
                12204,
                12218
            ],
            [
                12218,
                12269
            ],
            [
                12273,
                12297
            ],
            [
                12297,
                12315
            ],
            [
                12324,
                12325
            ],
            [
                12319,
                12323
            ],
            [
                12326,
                12364
            ],
            [
                12420,
                12422
            ],
            [
                12422,
                12443
            ],
            [
                12443,
                12465
            ],
            [
                12499,
                12519
            ],
            [
                12577,
                12581
            ],
            [
                12549,
                12551
            ],
            [
                12563,
                12573
            ],
            [
                12601,
                12625
            ],
            [
                12653,
                12714
            ],
            [
                12734,
                12736
            ],
            [
                12736,
                12759
            ],
            [
                12763,
                12821
            ],
            [
                12821,
                12860
            ],
            [
                12860,
                12863
            ],
            [
                12886,
                12900
            ],
            [
                12900,
                12904
            ],
            [
                12904,
                12942
            ],
            [
                12942,
                12987
            ],
            [
                12987,
                13013
            ],
            [
                13013,
                13084
            ],
            [
                13084,
                13088
            ],
            [
                13088,
                13102
            ],
            [
                13104,
                13108
            ],
            [
                13110,
                13125
            ],
            [
                13125,
                13138
            ],
            [
                13138,
                13167
            ],
            [
                13184,
                13186
            ],
            [
                13186,
                13283
            ],
            [
                13303,
                13306
            ],
            [
                13306,
                13308
            ],
            [
                13347,
                13350
            ],
            [
                13355,
                13394
            ],
            [
                13321,
                13323
            ],
            [
                13332,
                13337
            ],
            [
                13339,
                13340
            ],
            [
                13453,
                13476
            ],
            [
                13480,
                13507
            ],
            [
                13514,
                13522
            ],
            [
                13528,
                13530
            ],
            [
                13572,
                13577
            ],
            [
                13589,
                13648
            ],
            [
                13648,
                13679
            ],
            [
                13725,
                13735
            ],
            [
                13705,
                13723
            ],
            [
                13751,
                13755
            ],
            [
                13777,
                13795
            ],
            [
                13767,
                13768
            ],
            [
                13797,
                13800
            ],
            [
                13806,
                13879
            ],
            [
                13965,
                13967
            ],
            [
                13967,
                13968
            ],
            [
                14025,
                14062
            ],
            [
                14068,
                14109
            ],
            [
                14126,
                14143
            ],
            [
                14143,
                14154
            ],
            [
                14163,
                14180
            ],
            [
                14188,
                14195
            ],
            [
                14199,
                14236
            ],
            [
                14236,
                14241
            ],
            [
                14241,
                14259
            ],
            [
                14259,
                14381
            ],
            [
                14381,
                14535
            ],
            [
                14535,
                14607
            ],
            [
                14670,
                14672
            ],
            [
                14672,
                14676
            ],
            [
                14686,
                14741
            ],
            [
                14741,
                14763
            ],
            [
                14763,
                14914
            ],
            [
                14914,
                14936
            ],
            [
                14936,
                15051
            ],
            [
                15267,
                15463
            ],
            [
                15463,
                15543
            ],
            [
                15543,
                15604
            ],
            [
                15604,
                15605
            ],
            [
                15646,
                15670
            ],
            [
                15680,
                15695
            ],
            [
                15700,
                15749
            ],
            [
                15749,
                15800
            ],
            [
                15800,
                15805
            ],
            [
                15805,
                15810
            ],
            [
                15810,
                15813
            ],
            [
                15820,
                15839
            ],
            [
                15839,
                15890
            ],
            [
                15926,
                15978
            ],
            [
                16123,
                16125
            ],
            [
                16125,
                16162
            ],
            [
                16190,
                16211
            ],
            [
                16265,
                16267
            ],
            [
                16267,
                16424
            ],
            [
                16431,
                16440
            ],
            [
                16562,
                16585
            ],
            [
                16603,
                16607
            ],
            [
                16586,
                16593
            ],
            [
                16599,
                16602
            ],
            [
                16608,
                16656
            ],
            [
                16662,
                16719
            ],
            [
                16777,
                16808
            ],
            [
                16808,
                16828
            ],
            [
                16862,
                16978
            ],
            [
                16990,
                17010
            ],
            [
                17010,
                17011
            ],
            [
                17018,
                17035
            ],
            [
                17067,
                17092
            ],
            [
                17092,
                17154
            ],
            [
                17169,
                17201
            ],
            [
                17216,
                17281
            ],
            [
                17336,
                17338
            ],
            [
                17338,
                17378
            ],
            [
                17400,
                17422
            ],
            [
                17422,
                17517
            ],
            [
                17517,
                17526
            ],
            [
                17538,
                17634
            ],
            [
                17751,
                17753
            ],
            [
                17753,
                17804
            ],
            [
                17882,
                17967
            ],
            [
                17967,
                17975
            ],
            [
                17982,
                17985
            ],
            [
                18004,
                18007
            ],
            [
                18009,
                18030
            ],
            [
                18032,
                18040
            ],
            [
                18042,
                18067
            ],
            [
                18078,
                18081
            ],
            [
                18091,
                18093
            ],
            [
                18093,
                18168
            ],
            [
                18168,
                18196
            ],
            [
                18284,
                18286
            ],
            [
                18286,
                18328
            ],
            [
                18328,
                18384
            ],
            [
                18442,
                18460
            ],
            [
                18473,
                18520
            ],
            [
                18520,
                18576
            ],
            [
                18576,
                18725
            ],
            [
                18725,
                18766
            ],
            [
                18778,
                18786
            ],
            [
                18813,
                18840
            ],
            [
                18868,
                18871
            ],
            [
                18884,
                18897
            ],
            [
                18964,
                18966
            ],
            [
                18966,
                19004
            ]
        ],
        "row_chars": [
            [
                0,
                155
            ],
            [
                155,
                314
            ],
            [
                314,
                441
            ],
            [
                441,
                715
            ],
            [
                715,
                757
            ],
            [
                757,
                1220
            ],
            [
                1220,
                1300
            ],
            [
                1300,
                1445
            ],
            [
                1445,
                1622
            ],
            [
                1622,
                1814
            ],
            [
                1814,
                1993
            ],
            [
                1993,
                2008
            ],
            [
                2008,
                2326
            ],
            [
                2326,
                2625
            ],
            [
                2625,
                2648
            ],
            [
                2648,
                2762
            ],
            [
                2762,
                2820
            ],
            [
                2820,
                3114
            ],
            [
                3114,
                3274
            ],
            [
                3274,
                3542
            ],
            [
                3542,
                3737
            ],
            [
                3737,
                3743
            ],
            [
                3743,
                3796
            ],
            [
                3796,
                3811
            ],
            [
                3811,
                3988
            ],
            [
                3988,
                4008
            ],
            [
                4008,
                4090
            ],
            [
                4090,
                4114
            ],
            [
                4114,
                4139
            ],
            [
                4139,
                4240
            ],
            [
                4240,
                4244
            ],
            [
                4244,
                4282
            ],
            [
                4282,
                4331
            ],
            [
                4331,
                4413
            ],
            [
                4413,
                4467
            ],
            [
                4467,
                4516
            ],
            [
                4516,
                4681
            ],
            [
                4681,
                4777
            ],
            [
                4777,
                4882
            ],
            [
                4882,
                4954
            ],
            [
                4954,
                5161
            ],
            [
                5161,
                5198
            ],
            [
                5198,
                5202
            ],
            [
                5202,
                5234
            ],
            [
                5234,
                5333
            ],
            [
                5333,
                5375
            ],
            [
                5375,
                5500
            ],
            [
                5500,
                5526
            ],
            [
                5526,
                5579
            ],
            [
                5579,
                5633
            ],
            [
                5633,
                5825
            ],
            [
                5825,
                6127
            ],
            [
                6127,
                6187
            ],
            [
                6187,
                6327
            ],
            [
                6327,
                6347
            ],
            [
                6347,
                6471
            ],
            [
                6471,
                6677
            ],
            [
                6677,
                6730
            ],
            [
                6730,
                6764
            ],
            [
                6764,
                6781
            ],
            [
                6781,
                6885
            ],
            [
                6885,
                7044
            ],
            [
                7044,
                7061
            ],
            [
                7061,
                7112
            ],
            [
                7112,
                7165
            ],
            [
                7165,
                7271
            ],
            [
                7271,
                7353
            ],
            [
                7353,
                7472
            ],
            [
                7472,
                7610
            ],
            [
                7610,
                7800
            ],
            [
                7800,
                8015
            ],
            [
                8015,
                8172
            ],
            [
                8172,
                8382
            ],
            [
                8382,
                8436
            ],
            [
                8436,
                8477
            ],
            [
                8477,
                8575
            ],
            [
                8575,
                8621
            ],
            [
                8621,
                8677
            ],
            [
                8677,
                8681
            ],
            [
                8681,
                8823
            ],
            [
                8823,
                8827
            ],
            [
                8827,
                8957
            ],
            [
                8957,
                9046
            ],
            [
                9046,
                9184
            ],
            [
                9184,
                9503
            ],
            [
                9503,
                9507
            ],
            [
                9507,
                9553
            ],
            [
                9553,
                9754
            ],
            [
                9754,
                9882
            ],
            [
                9882,
                10020
            ],
            [
                10020,
                10081
            ],
            [
                10081,
                10104
            ],
            [
                10104,
                10329
            ],
            [
                10329,
                10423
            ],
            [
                10423,
                10512
            ],
            [
                10512,
                10606
            ],
            [
                10606,
                10807
            ],
            [
                10807,
                10848
            ],
            [
                10848,
                10938
            ],
            [
                10938,
                11488
            ],
            [
                11488,
                11554
            ],
            [
                11554,
                11802
            ],
            [
                11802,
                11932
            ],
            [
                11932,
                12006
            ],
            [
                12006,
                12125
            ],
            [
                12125,
                12218
            ],
            [
                12218,
                12269
            ],
            [
                12269,
                12297
            ],
            [
                12297,
                12422
            ],
            [
                12422,
                12443
            ],
            [
                12443,
                12465
            ],
            [
                12465,
                12499
            ],
            [
                12499,
                12625
            ],
            [
                12625,
                12736
            ],
            [
                12736,
                12821
            ],
            [
                12821,
                12860
            ],
            [
                12860,
                12900
            ],
            [
                12900,
                12904
            ],
            [
                12904,
                12942
            ],
            [
                12942,
                12987
            ],
            [
                12987,
                13013
            ],
            [
                13013,
                13084
            ],
            [
                13084,
                13088
            ],
            [
                13088,
                13125
            ],
            [
                13125,
                13138
            ],
            [
                13138,
                13186
            ],
            [
                13186,
                13306
            ],
            [
                13306,
                13530
            ],
            [
                13530,
                13564
            ],
            [
                13564,
                13648
            ],
            [
                13648,
                13967
            ],
            [
                13967,
                14109
            ],
            [
                14109,
                14143
            ],
            [
                14143,
                14236
            ],
            [
                14236,
                14241
            ],
            [
                14241,
                14259
            ],
            [
                14259,
                14381
            ],
            [
                14381,
                14535
            ],
            [
                14535,
                14672
            ],
            [
                14672,
                14676
            ],
            [
                14676,
                14741
            ],
            [
                14741,
                14763
            ],
            [
                14763,
                14914
            ],
            [
                14914,
                14936
            ],
            [
                14936,
                15051
            ],
            [
                15051,
                15263
            ],
            [
                15263,
                15463
            ],
            [
                15463,
                15543
            ],
            [
                15543,
                15604
            ],
            [
                15604,
                15749
            ],
            [
                15749,
                15800
            ],
            [
                15800,
                15805
            ],
            [
                15805,
                15810
            ],
            [
                15810,
                15839
            ],
            [
                15839,
                16125
            ],
            [
                16125,
                16164
            ],
            [
                16164,
                16190
            ],
            [
                16190,
                16267
            ],
            [
                16267,
                16808
            ],
            [
                16808,
                17010
            ],
            [
                17010,
                17092
            ],
            [
                17092,
                17338
            ],
            [
                17338,
                17422
            ],
            [
                17422,
                17517
            ],
            [
                17517,
                17753
            ],
            [
                17753,
                17804
            ],
            [
                17804,
                17967
            ],
            [
                17967,
                18093
            ],
            [
                18093,
                18168
            ],
            [
                18168,
                18286
            ],
            [
                18286,
                18328
            ],
            [
                18328,
                18520
            ],
            [
                18520,
                18576
            ],
            [
                18576,
                18725
            ],
            [
                18725,
                18966
            ],
            [
                18966,
                19004
            ]
        ]
    },
    "abridged": {
        "text": "Edmund now believed himself perfectly acquainted with all that Fanny could tell, and he was satisfied. Crawford had been too hasty. Once she was used to the idea of his being in love with her, a return of affection might not be very distant.\nHe gave this opinion to his father; and recommended that nothing more be said to her: but that everything should be left to Crawford's diligence, and the natural workings of her own mind.\nSir Thomas promised that it should be so. He believed Edmund's account of Fanny's nature to be just, but he considered it as unfortunate; for he could not help fearing that if such very long allowances of time were necessary for her, she might not have persuaded herself into receiving his addresses before the young man's inclination for paying them were over. There was nothing to be done, however, but to submit and hope for the best.\nThe promised visit from \"her friend,\" as Edmund called Miss Crawford, was a formidable threat to Fanny. As a sister, so partial and so angry, and so little scrupulous of what she said, she was an object of painful alarm. The dependence of having others present when they met was Fanny's only support in looking forward to it. She absented herself as little as possible from Lady Bertram, kept away from the East room, and took no solitary walk in the shrubbery, in her caution to avoid any sudden attack.\nShe succeeded. She was safe in the breakfast-room, with her aunt, when Miss Crawford did come; and Fanny hoped there would be nothing worse to be endured than a half-hour of moderate agitation. But here she hoped too much; Miss Crawford was determined to see Fanny alone, and said to her, in a low voice, \"I must speak to you for a few minutes somewhere\"; words that Fanny felt all over her. Denial was impossible. Her habits of ready submission, on the contrary, made her instantly rise and lead the way out of the room.\nThey were no sooner in the hall than Miss Crawford shook her head at Fanny with arch, yet affectionate reproach, and took her hand: she said nothing, however, but, \"Sad, sad girl! I do not know when I shall have done scolding you.\"\nFanny turned upstairs, and took her guest to the East Room, opening the door, however, with a most aching heart, and feeling that she had a distressing scene before her. But the evil was delayed by the sudden change in Miss Crawford's ideas; by the strong effect on her mind which the finding herself in the East room again produced.\n\"Ha!\" she cried, \"am I here again? Once only was I in this room before\"; and after stopping to look about her, \"Do you remember it? I came to rehearse. Your cousin came too; and you were our audience and prompter. A delightful rehearsal. I shall never forget it. Oh! why will such things ever pass away?\"\nHappily for her companion, she wanted no answer. Her mind was entirely self-engrossed, in a reverie of sweet remembrances.\n\"The scene we were rehearsing was so very remarkable! The subject of it so very-very-what shall I say? He was recommending matrimony to me, trying to be as demure and composed as Anhalt ought, through the two long speeches. 'When two sympathetic hearts meet in the marriage state, matrimony may be called a happy life.' I can never forget his looks and voice as he said those words. If I could relive any one week of my existence, it should be that week; for I never knew such exquisite happiness in any other. His sturdy spirit to bend as it did! Oh! it was sweet beyond expression. But alas, that very evening destroyed it all, and brought your most unwelcome uncle. Yet, Fanny, do not imagine I would now speak disrespectfully of Sir Thomas, though I certainly did hate him for many a week. No, I do him justice now. He is just what the head of such a family should be. Nay, in sober sadness, I believe I now love you all.\" And with a degree of tenderness and consciousness which Fanny had never seen in her before, and now thought only too becoming, she turned away for a moment to recover herself.\n\"I have had a little fit since I came into this room, as you may perceive,\" said she presently, with a playful smile, \"but it is over; so let us sit down and be comfortable; for as to scolding you, Fanny, I have not the heart for it when it comes to the point.\" And embracing her affectionately, \"Good, gentle Fanny! when I think of this being the last time of seeing you for I do not know how long, I feel it quite impossible to do anything but love you.\"\nFanny had not foreseen this, and her feelings could seldom withstand the melancholy influence of the word \"last.\" She cried as if she had loved Miss Crawford more than she possibly could; and Miss Crawford, farther softened by the sight of such emotion, said, \"I hate to leave you. I shall see no one half so amiable where I am going. Who says we shall not be sisters? I know we shall. I feel that we are born to be connected; and those tears convince me that you feel it too, dear Fanny.\"\nFanny roused herself, and said, \"But you are going to a very particular friend.\"\n\"Very true. Mrs. Fraser has been my intimate friend for years. But I have not the least inclination to go near her. I can think only of the friends I am leaving. You have all so much more heart among you than one finds in the world at large. You all give me a feeling of being able to trust and confide in you. I wish I had settled with Mrs. Fraser not to go till after Easter, but now I cannot put her off. And then I must go to her sister, Lady Stornaway, because she was my most particular friend of the two, but I have not cared much for her these three years.\"\nAfter this speech the two girls sat silent, before Mary spoke again.\n\"How perfectly I remember resolving to look for you upstairs, and setting off to find my way to the East room, without having an idea whereabouts it was! How well I remember looking in and seeing you sitting at work; and then your cousin's astonishment, when he opened the door, at seeing me here! There never was anything quite like it.\"\nAnother short fit of abstraction followed; then she thus attacked her companion.\n\"Why, Fanny, you are absolutely in a reverie. Thinking, I hope, of one who is always thinking of you. Oh! if only I could transport you into our circle in town, that you might understand how your power over Henry is thought of there! Oh! the envyings and heartburnings of dozens and dozens; the incredulity that will be felt at hearing what you have done! For as to secrecy, Henry glories in his chains. If you were to see how he is courted in London! I shall not be half so welcome to Mrs. Fraser when she knows the truth; for she has a step-daughter whom she is wild to get married, and wants Henry to take. Oh! she has been trying for him to such a degree. Innocent and quiet as you sit here, you cannot have an idea of the curiosity there will be about you, of the endless questions I shall have to answer! Poor Margaret Fraser will be at me for ever about how you do your hair, and who makes your shoes. I wish Margaret were married, for my poor friend's sake, for I think the Frasers are about as unhappy as most married people. And yet it was a most desirable match for Janet at the time. She had to accept him, for he was rich, and she had nothing; but he turns out ill-tempered and demanding, and wants a young woman of five-and-twenty to be as steady as himself. And my friend does not seem to know how to make the best of it. His irritation is certainly very ill-bred. Even Dr. Grant shows a confidence in my sister, and a consideration for her judgment, which makes one feel there is attachment; but of that I shall see nothing with the Frasers. Poor Janet has been sadly taken in, and yet she took three days to consider his proposals, and asked everyone's advice. I have not so much to say for my friend Flora, who jilted a very nice young man in the Blues for the sake of that horrid Lord Stornaway, who has about as much sense as Mr. Rushworth, but is much worse-looking, and with a blackguard character. Flora Ross was dying for Henry the first winter she came out. But were I to tell you of all the women who have been in love with him, I should never finish. It is only you, unfeeling Fanny, who can think of him with indifference. But are you so insensible as you profess yourself? No, I see you are not.\"\nThere was, indeed, a deep blush over Fanny's face at that moment.\n\"Excellent creature! I will not tease you. But, dear Fanny, you cannot have been so unprepared as your cousin fancies. You must have had some thoughts on the subject, some surmises. You must have seen that Henry was trying to please you by every attention in his power. Was not he devoted to you at the ball? And the necklace! Oh! you received it just as it was meant. You were as conscious as heart could desire. I remember it perfectly.\"\n\"Do you mean, then, that your brother knew of the necklace beforehand? Oh! Miss Crawford, that was not fair.\"\n\"Knew of it! It was his own doing entirely. I am ashamed to say that it had never entered my head, but I was delighted to act on his proposal.\"\n\"I was half afraid at the time of its being so,\" said Fanny; \"but not at first; I was unsuspicious of it at first, indeed. If I had suspected it, nothing should have induced me to accept the necklace. As to your brother's behaviour, I had been aware of a particularity some two or three weeks, but I considered it as meaning nothing: I put it down as simply being his way. I observed what was passing between him and some of this family in the summer and autumn. I was not blind. I could not help seeing that Mr. Crawford allowed himself gallantries which did mean nothing.\"\n\"Ah! I cannot deny it. He has now and then been a sad flirt, and cared very little for the havoc he might be making in young ladies' affections. I have often scolded him for it, but it is his only fault; and there is this to be said, that very few young ladies have any affections worth caring for. And then, Fanny, the glory of fixing one who has been shot at by so many! Oh! it is not in woman's nature to refuse such a triumph.\"\nFanny shook her head. \"I cannot think well of a man who sports with any woman's feelings; and there may often be a great deal more suffered than a stander-by can judge of.\"\n\"I do not defend him. I leave him entirely to your mercy, and when he has got you at Everingham, I do not care how much you lecture him. I do seriously and truly believe that he is attached to you in a way that he never was to any woman before; that he loves you with all his heart, and will love you as nearly for ever as possible. If any man ever loved a woman for ever, I think Henry will do as much for you.\"\nFanny could not avoid a faint smile, but had nothing to say.\n\"He was never happier,\" continued Mary, \"than when he succeeded in getting your brother's commission.\"\nShe had made a sure push at Fanny's feelings here.\n\"Oh! yes. How very kind of him.\"\n\"I know he must have exerted himself very much, for the Admiral hates trouble, and scorns asking favours. What a happy creature William must be!\"\nPoor Fanny's mind was distressed. The recollection of what had been done for William was always the most powerful disturber of every decision against Mr. Crawford; and she sat thinking deeply till Mary said: \"I should like to sit here talking to you all day, but we must not forget the ladies below: so good-bye, my dear, my amiable, my excellent Fanny, for I must take leave of you here. And I do take leave, trusting that when we meet again, it will be under circumstances which may open our hearts to each other without any shadow of reserve.\"\nA very kind embrace accompanied these words.\n\"I shall see your cousin in town soon: he talks of being there; and Sir Thomas, I dare say, in the spring; and your eldest cousin, and the Rushworths, and Julia. I have two favours to ask, Fanny: one is, that you must write to me. And the other, that you will often call on Mrs. Grant, and make her amends for my being gone.\"\nThe first of these favours Fanny would rather not have been asked; but it was impossible for her to refuse. There was no resisting so much apparent affection. Having hitherto known so little of it, she was the more overcome by Miss Crawford's. Besides, she was grateful to her for having made their tte--tte so much less painful than she had feared.\nIt was over, and she had escaped without reproaches and without detection. Her secret was still her own.\nIn the evening there was another parting. Henry Crawford came and sat some time with them; and her heart was softened towards him, because he really seemed to feel. Quite unlike his usual self, he scarcely said anything. He was evidently oppressed, and Fanny must grieve for him, though hoping she might never see him again till he were the husband of some other woman.\nWhen it came to the moment of parting, he took her hand; he said nothing, however, and left the room.\nOn the morrow the Crawfords were gone.",
        "paragraph_chars": [
            [
                0,
                242
            ],
            [
                242,
                430
            ],
            [
                430,
                868
            ],
            [
                868,
                1373
            ],
            [
                1373,
                1895
            ],
            [
                1895,
                2127
            ],
            [
                2127,
                2461
            ],
            [
                2461,
                2766
            ],
            [
                2766,
                2889
            ],
            [
                2889,
                3992
            ],
            [
                3992,
                4449
            ],
            [
                4449,
                4939
            ],
            [
                4939,
                5020
            ],
            [
                5020,
                5586
            ],
            [
                5586,
                5655
            ],
            [
                5655,
                5994
            ],
            [
                5994,
                6075
            ],
            [
                6075,
                8301
            ],
            [
                8301,
                8367
            ],
            [
                8367,
                8807
            ],
            [
                8807,
                8917
            ],
            [
                8917,
                9061
            ],
            [
                9061,
                9636
            ],
            [
                9636,
                10068
            ],
            [
                10068,
                10241
            ],
            [
                10241,
                10654
            ],
            [
                10654,
                10715
            ],
            [
                10715,
                10818
            ],
            [
                10818,
                10869
            ],
            [
                10869,
                10902
            ],
            [
                10902,
                11048
            ],
            [
                11048,
                11595
            ],
            [
                11595,
                11640
            ],
            [
                11640,
                11966
            ],
            [
                11966,
                12316
            ],
            [
                12316,
                12421
            ],
            [
                12421,
                12791
            ],
            [
                12791,
                12893
            ],
            [
                12893,
                12931
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                132
            ],
            [
                132,
                242
            ],
            [
                242,
                430
            ],
            [
                430,
                472
            ],
            [
                472,
                792
            ],
            [
                792,
                868
            ],
            [
                868,
                972
            ],
            [
                972,
                1089
            ],
            [
                1089,
                1194
            ],
            [
                1194,
                1373
            ],
            [
                1373,
                1388
            ],
            [
                1388,
                1567
            ],
            [
                1567,
                1765
            ],
            [
                1765,
                1788
            ],
            [
                1788,
                1895
            ],
            [
                1895,
                2075
            ],
            [
                2075,
                2127
            ],
            [
                2127,
                2297
            ],
            [
                2297,
                2461
            ],
            [
                2461,
                2467
            ],
            [
                2467,
                2496
            ],
            [
                2496,
                2593
            ],
            [
                2593,
                2613
            ],
            [
                2613,
                2675
            ],
            [
                2675,
                2699
            ],
            [
                2699,
                2724
            ],
            [
                2724,
                2728
            ],
            [
                2728,
                2766
            ],
            [
                2766,
                2815
            ],
            [
                2815,
                2889
            ],
            [
                2889,
                2943
            ],
            [
                2943,
                2992
            ],
            [
                2992,
                3113
            ],
            [
                3113,
                3209
            ],
            [
                3209,
                3272
            ],
            [
                3272,
                3400
            ],
            [
                3400,
                3437
            ],
            [
                3437,
                3441
            ],
            [
                3441,
                3473
            ],
            [
                3473,
                3558
            ],
            [
                3558,
                3683
            ],
            [
                3683,
                3709
            ],
            [
                3709,
                3762
            ],
            [
                3762,
                3816
            ],
            [
                3816,
                3992
            ],
            [
                3992,
                4254
            ],
            [
                4254,
                4309
            ],
            [
                4309,
                4449
            ],
            [
                4449,
                4563
            ],
            [
                4563,
                4731
            ],
            [
                4731,
                4784
            ],
            [
                4784,
                4818
            ],
            [
                4818,
                4835
            ],
            [
                4835,
                4939
            ],
            [
                4939,
                5020
            ],
            [
                5020,
                5032
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5136
            ],
            [
                5136,
                5182
            ],
            [
                5182,
                5262
            ],
            [
                5262,
                5331
            ],
            [
                5331,
                5428
            ],
            [
                5428,
                5586
            ],
            [
                5586,
                5655
            ],
            [
                5655,
                5809
            ],
            [
                5809,
                5953
            ],
            [
                5953,
                5994
            ],
            [
                5994,
                6075
            ],
            [
                6075,
                6121
            ],
            [
                6121,
                6177
            ],
            [
                6177,
                6181
            ],
            [
                6181,
                6309
            ],
            [
                6309,
                6313
            ],
            [
                6313,
                6431
            ],
            [
                6431,
                6479
            ],
            [
                6479,
                6527
            ],
            [
                6527,
                6685
            ],
            [
                6685,
                6689
            ],
            [
                6689,
                6735
            ],
            [
                6735,
                6886
            ],
            [
                6886,
                6984
            ],
            [
                6984,
                7110
            ],
            [
                7110,
                7171
            ],
            [
                7171,
                7348
            ],
            [
                7348,
                7412
            ],
            [
                7412,
                7455
            ],
            [
                7455,
                7633
            ],
            [
                7633,
                7753
            ],
            [
                7753,
                7996
            ],
            [
                7996,
                8058
            ],
            [
                8058,
                8153
            ],
            [
                8153,
                8226
            ],
            [
                8226,
                8277
            ],
            [
                8277,
                8301
            ],
            [
                8301,
                8367
            ],
            [
                8367,
                8388
            ],
            [
                8388,
                8410
            ],
            [
                8410,
                8486
            ],
            [
                8486,
                8549
            ],
            [
                8549,
                8637
            ],
            [
                8637,
                8676
            ],
            [
                8676,
                8694
            ],
            [
                8694,
                8698
            ],
            [
                8698,
                8736
            ],
            [
                8736,
                8781
            ],
            [
                8781,
                8807
            ],
            [
                8807,
                8878
            ],
            [
                8878,
                8882
            ],
            [
                8882,
                8917
            ],
            [
                8917,
                8930
            ],
            [
                8930,
                8961
            ],
            [
                8961,
                9061
            ],
            [
                9061,
                9184
            ],
            [
                9184,
                9262
            ],
            [
                9262,
                9434
            ],
            [
                9434,
                9524
            ],
            [
                9524,
                9541
            ],
            [
                9541,
                9636
            ],
            [
                9636,
                9641
            ],
            [
                9641,
                9659
            ],
            [
                9659,
                9781
            ],
            [
                9781,
                9935
            ],
            [
                9935,
                10009
            ],
            [
                10009,
                10013
            ],
            [
                10013,
                10068
            ],
            [
                10068,
                10090
            ],
            [
                10090,
                10241
            ],
            [
                10241,
                10263
            ],
            [
                10263,
                10378
            ],
            [
                10378,
                10574
            ],
            [
                10574,
                10654
            ],
            [
                10654,
                10715
            ],
            [
                10715,
                10818
            ],
            [
                10818,
                10869
            ],
            [
                10869,
                10874
            ],
            [
                10874,
                10879
            ],
            [
                10879,
                10902
            ],
            [
                10902,
                11008
            ],
            [
                11008,
                11048
            ],
            [
                11048,
                11082
            ],
            [
                11082,
                11437
            ],
            [
                11437,
                11595
            ],
            [
                11595,
                11640
            ],
            [
                11640,
                11802
            ],
            [
                11802,
                11871
            ],
            [
                11871,
                11966
            ],
            [
                11966,
                12074
            ],
            [
                12074,
                12125
            ],
            [
                12125,
                12210
            ],
            [
                12210,
                12316
            ],
            [
                12316,
                12391
            ],
            [
                12391,
                12421
            ],
            [
                12421,
                12463
            ],
            [
                12463,
                12586
            ],
            [
                12586,
                12642
            ],
            [
                12642,
                12791
            ],
            [
                12791,
                12893
            ],
            [
                12893,
                12931
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                81,
                103
            ],
            [
                107,
                111
            ],
            [
                112,
                120
            ],
            [
                121,
                130
            ],
            [
                130,
                132
            ],
            [
                137,
                140
            ],
            [
                145,
                156
            ],
            [
                162,
                192
            ],
            [
                193,
                242
            ],
            [
                242,
                262
            ],
            [
                263,
                293
            ],
            [
                299,
                311
            ],
            [
                315,
                327
            ],
            [
                328,
                376
            ],
            [
                386,
                430
            ],
            [
                430,
                472
            ],
            [
                472,
                474
            ],
            [
                484,
                511
            ],
            [
                519,
                529
            ],
            [
                529,
                537
            ],
            [
                549,
                554
            ],
            [
                555,
                566
            ],
            [
                566,
                571
            ],
            [
                572,
                639
            ],
            [
                640,
                729
            ],
            [
                730,
                792
            ],
            [
                792,
                844
            ],
            [
                845,
                853
            ],
            [
                858,
                868
            ],
            [
                868,
                970
            ],
            [
                970,
                972
            ],
            [
                972,
                1052
            ],
            [
                1053,
                1060
            ],
            [
                1061,
                1089
            ],
            [
                1089,
                1194
            ],
            [
                1194,
                1373
            ],
            [
                1373,
                1388
            ],
            [
                1388,
                1471
            ],
            [
                1472,
                1477
            ],
            [
                1484,
                1567
            ],
            [
                1567,
                1613
            ],
            [
                1614,
                1648
            ],
            [
                1649,
                1660
            ],
            [
                1660,
                1763
            ],
            [
                1763,
                1765
            ],
            [
                1765,
                1788
            ],
            [
                1788,
                1845
            ],
            [
                1846,
                1894
            ],
            [
                1895,
                1931
            ],
            [
                1932,
                1945
            ],
            [
                1946,
                2011
            ],
            [
                2017,
                2025
            ],
            [
                2027,
                2075
            ],
            [
                2075,
                2124
            ],
            [
                2127,
                2132
            ],
            [
                2133,
                2175
            ],
            [
                2187,
                2266
            ],
            [
                2267,
                2295
            ],
            [
                2295,
                2297
            ],
            [
                2297,
                2309
            ],
            [
                2310,
                2313
            ],
            [
                2314,
                2461
            ],
            [
                2461,
                2467
            ],
            [
                2467,
                2476
            ],
            [
                2476,
                2496
            ],
            [
                2496,
                2571
            ],
            [
                2572,
                2573
            ],
            [
                2573,
                2593
            ],
            [
                2593,
                2613
            ],
            [
                2613,
                2638
            ],
            [
                2639,
                2675
            ],
            [
                2675,
                2699
            ],
            [
                2699,
                2724
            ],
            [
                2724,
                2728
            ],
            [
                2728,
                2766
            ],
            [
                2766,
                2815
            ],
            [
                2815,
                2851
            ],
            [
                2853,
                2889
            ],
            [
                2889,
                2943
            ],
            [
                2943,
                2992
            ],
            [
                2992,
                2998
            ],
            [
                2999,
                3027
            ],
            [
                3027,
                3113
            ],
            [
                3113,
                3209
            ],
            [
                3209,
                3210
            ],
            [
                3211,
                3214
            ],
            [
                3228,
                3272
            ],
            [
                3272,
                3276
            ],
            [
                3290,
                3342
            ],
            [
                3342,
                3400
            ],
            [
                3400,
                3437
            ],
            [
                3437,
                3441
            ],
            [
                3441,
                3473
            ],
            [
                3473,
                3517
            ],
            [
                3523,
                3558
            ],
            [
                3558,
                3683
            ],
            [
                3683,
                3709
            ],
            [
                3709,
                3762
            ],
            [
                3762,
                3816
            ],
            [
                3816,
                3819
            ],
            [
                3820,
                3991
            ],
            [
                3992,
                4125
            ],
            [
                4125,
                4196
            ],
            [
                4197,
                4254
            ],
            [
                4254,
                4271
            ],
            [
                4272,
                4309
            ],
            [
                4309,
                4449
            ],
            [
                4455,
                4471
            ],
            [
                4472,
                4563
            ],
            [
                4563,
                4655
            ],
            [
                4656,
                4702
            ],
            [
                4703,
                4731
            ],
            [
                4731,
                4784
            ],
            [
                4784,
                4818
            ],
            [
                4818,
                4835
            ],
            [
                4835,
                4939
            ],
            [
                4939,
                4964
            ],
            [
                4965,
                4975
            ],
            [
                4976,
                5020
            ],
            [
                5020,
                5021
            ],
            [
                5021,
                5032
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5136
            ],
            [
                5136,
                5180
            ],
            [
                5180,
                5182
            ],
            [
                5182,
                5207
            ],
            [
                5208,
                5213
            ],
            [
                5214,
                5262
            ],
            [
                5262,
                5329
            ],
            [
                5329,
                5331
            ],
            [
                5331,
                5378
            ],
            [
                5379,
                5396
            ],
            [
                5396,
                5428
            ],
            [
                5428,
                5431
            ],
            [
                5437,
                5485
            ],
            [
                5486,
                5489
            ],
            [
                5490,
                5493
            ],
            [
                5494,
                5561
            ],
            [
                5562,
                5565
            ],
            [
                5566,
                5586
            ],
            [
                5586,
                5621
            ],
            [
                5622,
                5629
            ],
            [
                5637,
                5641
            ],
            [
                5642,
                5655
            ],
            [
                5655,
                5680
            ],
            [
                5681,
                5809
            ],
            [
                5809,
                5828
            ],
            [
                5829,
                5854
            ],
            [
                5855,
                5862
            ],
            [
                5863,
                5953
            ],
            [
                5953,
                5994
            ],
            [
                5994,
                6035
            ],
            [
                6042,
                6075
            ],
            [
                6075,
                6121
            ],
            [
                6121,
                6177
            ],
            [
                6177,
                6181
            ],
            [
                6189,
                6210
            ],
            [
                6211,
                6309
            ],
            [
                6309,
                6313
            ],
            [
                6313,
                6365
            ],
            [
                6366,
                6431
            ],
            [
                6431,
                6455
            ],
            [
                6456,
                6479
            ],
            [
                6479,
                6515
            ],
            [
                6519,
                6525
            ],
            [
                6525,
                6527
            ],
            [
                6527,
                6572
            ],
            [
                6573,
                6581
            ],
            [
                6588,
                6597
            ],
            [
                6597,
                6602
            ],
            [
                6603,
                6606
            ],
            [
                6611,
                6612
            ],
            [
                6618,
                6626
            ],
            [
                6627,
                6685
            ],
            [
                6685,
                6689
            ],
            [
                6689,
                6735
            ],
            [
                6735,
                6801
            ],
            [
                6802,
                6825
            ],
            [
                6832,
                6886
            ],
            [
                6886,
                6935
            ],
            [
                6936,
                6984
            ],
            [
                6984,
                7046
            ],
            [
                7053,
                7064
            ],
            [
                7069,
                7093
            ],
            [
                7094,
                7110
            ],
            [
                7110,
                7171
            ],
            [
                7171,
                7174
            ],
            [
                7182,
                7265
            ],
            [
                7275,
                7288
            ],
            [
                7289,
                7319
            ],
            [
                7320,
                7348
            ],
            [
                7348,
                7361
            ],
            [
                7362,
                7412
            ],
            [
                7416,
                7426
            ],
            [
                7427,
                7455
            ],
            [
                7455,
                7469
            ],
            [
                7476,
                7477
            ],
            [
                7478,
                7508
            ],
            [
                7509,
                7567
            ],
            [
                7568,
                7570
            ],
            [
                7571,
                7633
            ],
            [
                7633,
                7676
            ],
            [
                7677,
                7708
            ],
            [
                7709,
                7727
            ],
            [
                7728,
                7733
            ],
            [
                7745,
                7751
            ],
            [
                7751,
                7753
            ],
            [
                7753,
                7917
            ],
            [
                7918,
                7939
            ],
            [
                7943,
                7996
            ],
            [
                8002,
                8058
            ],
            [
                8058,
                8068
            ],
            [
                8069,
                8097
            ],
            [
                8102,
                8106
            ],
            [
                8112,
                8144
            ],
            [
                8151,
                8153
            ],
            [
                8153,
                8158
            ],
            [
                8159,
                8168
            ],
            [
                8179,
                8211
            ],
            [
                8212,
                8226
            ],
            [
                8226,
                8277
            ],
            [
                8277,
                8301
            ],
            [
                8301,
                8319
            ],
            [
                8320,
                8321
            ],
            [
                8322,
                8326
            ],
            [
                8327,
                8365
            ],
            [
                8365,
                8367
            ],
            [
                8367,
                8388
            ],
            [
                8388,
                8410
            ],
            [
                8410,
                8430
            ],
            [
                8438,
                8442
            ],
            [
                8448,
                8450
            ],
            [
                8451,
                8461
            ],
            [
                8462,
                8486
            ],
            [
                8486,
                8547
            ],
            [
                8547,
                8549
            ],
            [
                8549,
                8572
            ],
            [
                8579,
                8637
            ],
            [
                8637,
                8676
            ],
            [
                8676,
                8679
            ],
            [
                8680,
                8694
            ],
            [
                8694,
                8698
            ],
            [
                8698,
                8736
            ],
            [
                8736,
                8781
            ],
            [
                8781,
                8807
            ],
            [
                8807,
                8878
            ],
            [
                8878,
                8882
            ],
            [
                8882,
                8896
            ],
            [
                8897,
                8901
            ],
            [
                8902,
                8917
            ],
            [
                8917,
                8930
            ],
            [
                8930,
                8959
            ],
            [
                8959,
                8961
            ],
            [
                8961,
                9058
            ],
            [
                9058,
                9061
            ],
            [
                9061,
                9063
            ],
            [
                9064,
                9067
            ],
            [
                9068,
                9107
            ],
            [
                9107,
                9109
            ],
            [
                9115,
                9120
            ],
            [
                9122,
                9123
            ],
            [
                9123,
                9146
            ],
            [
                9147,
                9174
            ],
            [
                9174,
                9182
            ],
            [
                9182,
                9184
            ],
            [
                9187,
                9192
            ],
            [
                9203,
                9262
            ],
            [
                9262,
                9293
            ],
            [
                9294,
                9304
            ],
            [
                9311,
                9329
            ],
            [
                9330,
                9334
            ],
            [
                9335,
                9353
            ],
            [
                9353,
                9354
            ],
            [
                9355,
                9358
            ],
            [
                9359,
                9432
            ],
            [
                9432,
                9434
            ],
            [
                9434,
                9435
            ],
            [
                9445,
                9482
            ],
            [
                9483,
                9524
            ],
            [
                9524,
                9541
            ],
            [
                9541,
                9552
            ],
            [
                9565,
                9582
            ],
            [
                9591,
                9598
            ],
            [
                9599,
                9636
            ],
            [
                9636,
                9641
            ],
            [
                9641,
                9659
            ],
            [
                9659,
                9781
            ],
            [
                9781,
                9935
            ],
            [
                9935,
                10007
            ],
            [
                10007,
                10009
            ],
            [
                10009,
                10013
            ],
            [
                10013,
                10068
            ],
            [
                10068,
                10090
            ],
            [
                10090,
                10241
            ],
            [
                10241,
                10263
            ],
            [
                10263,
                10378
            ],
            [
                10378,
                10574
            ],
            [
                10574,
                10654
            ],
            [
                10654,
                10715
            ],
            [
                10715,
                10716
            ],
            [
                10729,
                10753
            ],
            [
                10753,
                10768
            ],
            [
                10769,
                10818
            ],
            [
                10818,
                10869
            ],
            [
                10869,
                10874
            ],
            [
                10874,
                10879
            ],
            [
                10879,
                10882
            ],
            [
                10883,
                10902
            ],
            [
                10902,
                10953
            ],
            [
                10954,
                11006
            ],
            [
                11006,
                11008
            ],
            [
                11008,
                11045
            ],
            [
                11048,
                11069
            ],
            [
                11080,
                11082
            ],
            [
                11082,
                11239
            ],
            [
                11240,
                11249
            ],
            [
                11254,
                11277
            ],
            [
                11278,
                11282
            ],
            [
                11283,
                11290
            ],
            [
                11294,
                11297
            ],
            [
                11298,
                11346
            ],
            [
                11348,
                11405
            ],
            [
                11406,
                11437
            ],
            [
                11437,
                11457
            ],
            [
                11458,
                11574
            ],
            [
                11575,
                11595
            ],
            [
                11595,
                11596
            ],
            [
                11597,
                11614
            ],
            [
                11615,
                11640
            ],
            [
                11640,
                11702
            ],
            [
                11702,
                11734
            ],
            [
                11735,
                11800
            ],
            [
                11800,
                11802
            ],
            [
                11802,
                11842
            ],
            [
                11849,
                11871
            ],
            [
                11871,
                11966
            ],
            [
                11966,
                11975
            ],
            [
                11976,
                12072
            ],
            [
                12072,
                12074
            ],
            [
                12074,
                12125
            ],
            [
                12125,
                12210
            ],
            [
                12210,
                12218
            ],
            [
                12223,
                12226
            ],
            [
                12239,
                12242
            ],
            [
                12243,
                12264
            ],
            [
                12265,
                12273
            ],
            [
                12274,
                12299
            ],
            [
                12304,
                12307
            ],
            [
                12314,
                12316
            ],
            [
                12316,
                12391
            ],
            [
                12391,
                12419
            ],
            [
                12419,
                12421
            ],
            [
                12421,
                12463
            ],
            [
                12463,
                12519
            ],
            [
                12520,
                12538
            ],
            [
                12539,
                12586
            ],
            [
                12586,
                12642
            ],
            [
                12642,
                12791
            ],
            [
                12791,
                12832
            ],
            [
                12838,
                12846
            ],
            [
                12846,
                12873
            ],
            [
                12874,
                12877
            ],
            [
                12878,
                12891
            ],
            [
                12891,
                12893
            ],
            [
                12893,
                12931
            ]
        ],
        "row_chars": [
            [
                0,
                103
            ],
            [
                103,
                132
            ],
            [
                132,
                242
            ],
            [
                242,
                430
            ],
            [
                430,
                472
            ],
            [
                472,
                792
            ],
            [
                792,
                868
            ],
            [
                868,
                972
            ],
            [
                972,
                1089
            ],
            [
                1089,
                1194
            ],
            [
                1194,
                1373
            ],
            [
                1373,
                1388
            ],
            [
                1388,
                1567
            ],
            [
                1567,
                1765
            ],
            [
                1765,
                1788
            ],
            [
                1788,
                1895
            ],
            [
                1895,
                1895
            ],
            [
                1895,
                2075
            ],
            [
                2075,
                2127
            ],
            [
                2127,
                2297
            ],
            [
                2297,
                2461
            ],
            [
                2461,
                2467
            ],
            [
                2467,
                2496
            ],
            [
                2496,
                2496
            ],
            [
                2496,
                2593
            ],
            [
                2593,
                2613
            ],
            [
                2613,
                2675
            ],
            [
                2675,
                2699
            ],
            [
                2699,
                2724
            ],
            [
                2724,
                2724
            ],
            [
                2724,
                2728
            ],
            [
                2728,
                2766
            ],
            [
                2766,
                2815
            ],
            [
                2815,
                2889
            ],
            [
                2889,
                2943
            ],
            [
                2943,
                2992
            ],
            [
                2992,
                3113
            ],
            [
                3113,
                3209
            ],
            [
                3209,
                3272
            ],
            [
                3272,
                3272
            ],
            [
                3272,
                3400
            ],
            [
                3400,
                3437
            ],
            [
                3437,
                3441
            ],
            [
                3441,
                3473
            ],
            [
                3473,
                3558
            ],
            [
                3558,
                3558
            ],
            [
                3558,
                3683
            ],
            [
                3683,
                3709
            ],
            [
                3709,
                3762
            ],
            [
                3762,
                3816
            ],
            [
                3816,
                3992
            ],
            [
                3992,
                4254
            ],
            [
                4254,
                4309
            ],
            [
                4309,
                4449
            ],
            [
                4449,
                4449
            ],
            [
                4449,
                4563
            ],
            [
                4563,
                4731
            ],
            [
                4731,
                4784
            ],
            [
                4784,
                4818
            ],
            [
                4818,
                4835
            ],
            [
                4835,
                4939
            ],
            [
                4939,
                5020
            ],
            [
                5020,
                5032
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5136
            ],
            [
                5136,
                5182
            ],
            [
                5182,
                5262
            ],
            [
                5262,
                5331
            ],
            [
                5331,
                5428
            ],
            [
                5428,
                5586
            ],
            [
                5586,
                5655
            ],
            [
                5655,
                5809
            ],
            [
                5809,
                5953
            ],
            [
                5953,
                5953
            ],
            [
                5953,
                5994
            ],
            [
                5994,
                6075
            ],
            [
                6075,
                6121
            ],
            [
                6121,
                6177
            ],
            [
                6177,
                6181
            ],
            [
                6181,
                6309
            ],
            [
                6309,
                6313
            ],
            [
                6313,
                6431
            ],
            [
                6431,
                6479
            ],
            [
                6479,
                6527
            ],
            [
                6527,
                6685
            ],
            [
                6685,
                6689
            ],
            [
                6689,
                6735
            ],
            [
                6735,
                6886
            ],
            [
                6886,
                6984
            ],
            [
                6984,
                7110
            ],
            [
                7110,
                7171
            ],
            [
                7171,
                7171
            ],
            [
                7171,
                7348
            ],
            [
                7348,
                7412
            ],
            [
                7412,
                7455
            ],
            [
                7455,
                7455
            ],
            [
                7455,
                7633
            ],
            [
                7633,
                7633
            ],
            [
                7633,
                7633
            ],
            [
                7633,
                7753
            ],
            [
                7753,
                7753
            ],
            [
                7753,
                7996
            ],
            [
                7996,
                7996
            ],
            [
                7996,
                8058
            ],
            [
                8058,
                8153
            ],
            [
                8153,
                8226
            ],
            [
                8226,
                8277
            ],
            [
                8277,
                8301
            ],
            [
                8301,
                8367
            ],
            [
                8367,
                8388
            ],
            [
                8388,
                8410
            ],
            [
                8410,
                8410
            ],
            [
                8410,
                8486
            ],
            [
                8486,
                8549
            ],
            [
                8549,
                8637
            ],
            [
                8637,
                8676
            ],
            [
                8676,
                8694
            ],
            [
                8694,
                8698
            ],
            [
                8698,
                8736
            ],
            [
                8736,
                8781
            ],
            [
                8781,
                8807
            ],
            [
                8807,
                8878
            ],
            [
                8878,
                8882
            ],
            [
                8882,
                8917
            ],
            [
                8917,
                8930
            ],
            [
                8930,
                8961
            ],
            [
                8961,
                9061
            ],
            [
                9061,
                9184
            ],
            [
                9184,
                9184
            ],
            [
                9184,
                9262
            ],
            [
                9262,
                9434
            ],
            [
                9434,
                9524
            ],
            [
                9524,
                9541
            ],
            [
                9541,
                9636
            ],
            [
                9636,
                9641
            ],
            [
                9641,
                9659
            ],
            [
                9659,
                9781
            ],
            [
                9781,
                9935
            ],
            [
                9935,
                10009
            ],
            [
                10009,
                10013
            ],
            [
                10013,
                10068
            ],
            [
                10068,
                10090
            ],
            [
                10090,
                10241
            ],
            [
                10241,
                10263
            ],
            [
                10263,
                10378
            ],
            [
                10378,
                10378
            ],
            [
                10378,
                10574
            ],
            [
                10574,
                10654
            ],
            [
                10654,
                10715
            ],
            [
                10715,
                10818
            ],
            [
                10818,
                10869
            ],
            [
                10869,
                10874
            ],
            [
                10874,
                10879
            ],
            [
                10879,
                10902
            ],
            [
                10902,
                11008
            ],
            [
                11008,
                11048
            ],
            [
                11048,
                11048
            ],
            [
                11048,
                11082
            ],
            [
                11082,
                11437
            ],
            [
                11437,
                11595
            ],
            [
                11595,
                11640
            ],
            [
                11640,
                11802
            ],
            [
                11802,
                11871
            ],
            [
                11871,
                11966
            ],
            [
                11966,
                12074
            ],
            [
                12074,
                12125
            ],
            [
                12125,
                12210
            ],
            [
                12210,
                12316
            ],
            [
                12316,
                12391
            ],
            [
                12391,
                12421
            ],
            [
                12421,
                12463
            ],
            [
                12463,
                12586
            ],
            [
                12586,
                12642
            ],
            [
                12642,
                12791
            ],
            [
                12791,
                12893
            ],
            [
                12893,
                12931
            ]
        ]
    }
}