{
    "original": {
        "text": "Mr. Crawford gone, Sir Thomas's next object was that he should be missed; and he entertained great hope that his niece would find a blank in the loss of those attentions which at the time she had felt, or fancied, an evil. She had tasted of consequence in its most flattering form; and he did hope that the loss of it, the sinking again into nothing, would awaken very wholesome regrets in her mind. He watched her with this idea; but he could hardly tell with what success. He hardly knew whether there were any difference in her spirits or not. She was always so gentle and retiring that her emotions were beyond his discrimination. He did not understand her: he felt that he did not; and therefore applied to Edmund to tell him how she stood affected on the present occasion, and whether she were more or less happy than she had been.\nEdmund did not discern any symptoms of regret, and thought his father a little unreasonable in supposing the first three or four days could produce any.\nWhat chiefly surprised Edmund was, that Crawford's sister, the friend and companion who had been so much to her, should not be more visibly regretted. He wondered that Fanny spoke so seldom of _her_, and had so little voluntarily to say of her concern at this separation.\nAlas! it was this sister, this friend and companion, who was now the chief bane of Fanny's comfort. If she could have believed Mary's future fate as unconnected with Mansfield as she was determined the brother's should be, if she could have hoped her return thither to be as distant as she was much inclined to think his, she would have been light of heart indeed; but the more she recollected and observed, the more deeply was she convinced that everything was now in a fairer train for Miss Crawford's marrying Edmund than it had ever been before. On his side the inclination was stronger, on hers less equivocal. His objections, the scruples of his integrity, seemed all done away, nobody could tell how; and the doubts and hesitations of her ambition were equally got over-and equally without apparent reason. It could only be imputed to increasing attachment. His good and her bad feelings yielded to love, and such love must unite them. He was to go to town as soon as some business relative to Thornton Lacey were completed-perhaps within a fortnight; he talked of going, he loved to talk of it; and when once with her again, Fanny could not doubt the rest. Her acceptance must be as certain as his offer; and yet there were bad feelings still remaining which made the prospect of it most sorrowful to her, independently, she believed, independently of self.\nIn their very last conversation, Miss Crawford, in spite of some amiable sensations, and much personal kindness, had still been Miss Crawford; still shewn a mind led astray and bewildered, and without any suspicion of being so; darkened, yet fancying itself light. She might love, but she did not deserve Edmund by any other sentiment. Fanny believed there was scarcely a second feeling in common between them; and she may be forgiven by older sages for looking on the chance of Miss Crawford's future improvement as nearly desperate, for thinking that if Edmund's influence in this season of love had already done so little in clearing her judgment, and regulating her notions, his worth would be finally wasted on her even in years of matrimony.\nExperience might have hoped more for any young people so circumstanced, and impartiality would not have denied to Miss Crawford's nature that participation of the general nature of women which would lead her to adopt the opinions of the man she loved and respected as her own. But as such were Fanny's persuasions, she suffered very much from them, and could never speak of Miss Crawford without pain.\nSir Thomas, meanwhile, went on with his own hopes and his own observations, still feeling a right, by all his knowledge of human nature, to expect to see the effect of the loss of power and consequence on his niece's spirits, and the past attentions of the lover producing a craving for their return; and he was soon afterwards able to account for his not yet completely and indubitably seeing all this, by the prospect of another visitor, whose approach he could allow to be quite enough to support the spirits he was watching. William had obtained a ten days' leave of absence, to be given to Northamptonshire, and was coming, the happiest of lieutenants, because the latest made, to shew his happiness and describe his uniform.\nHe came; and he would have been delighted to shew his uniform there too, had not cruel custom prohibited its appearance except on duty. So the uniform remained at Portsmouth, and Edmund conjectured that before Fanny had any chance of seeing it, all its own freshness and all the freshness of its wearer's feelings must be worn away. It would be sunk into a badge of disgrace; for what can be more unbecoming, or more worthless, than the uniform of a lieutenant, who has been a lieutenant a year or two, and sees others made commanders before him? So reasoned Edmund, till his father made him the confidant of a scheme which placed Fanny's chance of seeing the second lieutenant of H.M.S. Thrush in all his glory in another light.\nThis scheme was that she should accompany her brother back to Portsmouth, and spend a little time with her own family. It had occurred to Sir Thomas, in one of his dignified musings, as a right and desirable measure; but before he absolutely made up his mind, he consulted his son. Edmund considered it every way, and saw nothing but what was right. The thing was good in itself, and could not be done at a better time; and he had no doubt of it being highly agreeable to Fanny. This was enough to determine Sir Thomas; and a decisive \"then so it shall be\" closed that stage of the business; Sir Thomas retiring from it with some feelings of satisfaction, and views of good over and above what he had communicated to his son; for his prime motive in sending her away had very little to do with the propriety of her seeing her parents again, and nothing at all with any idea of making her happy. He certainly wished her to go willingly, but he as certainly wished her to be heartily sick of home before her visit ended; and that a little abstinence from the elegancies and luxuries of Mansfield Park would bring her mind into a sober state, and incline her to a juster estimate of the value of that home of greater permanence, and equal comfort, of which she had the offer.\nIt was a medicinal project upon his niece's understanding, which he must consider as at present diseased. A residence of eight or nine years in the abode of wealth and plenty had a little disordered her powers of comparing and judging. Her father's house would, in all probability, teach her the value of a good income; and he trusted that she would be the wiser and happier woman, all her life, for the experiment he had devised.\nHad Fanny been at all addicted to raptures, she must have had a strong attack of them when she first understood what was intended, when her uncle first made her the offer of visiting the parents, and brothers, and sisters, from whom she had been divided almost half her life; of returning for a couple of months to the scenes of her infancy, with William for the protector and companion of her journey, and the certainty of continuing to see William to the last hour of his remaining on land. Had she ever given way to bursts of delight, it must have been then, for she was delighted, but her happiness was of a quiet, deep, heart-swelling sort; and though never a great talker, she was always more inclined to silence when feeling most strongly. At the moment she could only thank and accept. Afterwards, when familiarised with the visions of enjoyment so suddenly opened, she could speak more largely to William and Edmund of what she felt; but still there were emotions of tenderness that could not be clothed in words. The remembrance of all her earliest pleasures, and of what she had suffered in being torn from them, came over her with renewed strength, and it seemed as if to be at home again would heal every pain that had since grown out of the separation. To be in the centre of such a circle, loved by so many, and more loved by all than she had ever been before; to feel affection without fear or restraint; to feel herself the equal of those who surrounded her; to be at peace from all mention of the Crawfords, safe from every look which could be fancied a reproach on their account. This was a prospect to be dwelt on with a fondness that could be but half acknowledged.\nEdmund, too-to be two months from _him_ (and perhaps she might be allowed to make her absence three) must do her good. At a distance, unassailed by his looks or his kindness, and safe from the perpetual irritation of knowing his heart, and striving to avoid his confidence, she should be able to reason herself into a properer state; she should be able to think of him as in London, and arranging everything there, without wretchedness. What might have been hard to bear at Mansfield was to become a slight evil at Portsmouth.\nThe only drawback was the doubt of her aunt Bertram's being comfortable without her. She was of use to no one else; but _there_ she might be missed to a degree that she did not like to think of; and that part of the arrangement was, indeed, the hardest for Sir Thomas to accomplish, and what only _he_ could have accomplished at all.\nBut he was master at Mansfield Park. When he had really resolved on any measure, he could always carry it through; and now by dint of long talking on the subject, explaining and dwelling on the duty of Fanny's sometimes seeing her family, he did induce his wife to let her go; obtaining it rather from submission, however, than conviction, for Lady Bertram was convinced of very little more than that Sir Thomas thought Fanny ought to go, and therefore that she must. In the calmness of her own dressing-room, in the impartial flow of her own meditations, unbiassed by his bewildering statements, she could not acknowledge any necessity for Fanny's ever going near a father and mother who had done without her so long, while she was so useful to herself. And as to the not missing her, which under Mrs. Norris's discussion was the point attempted to be proved, she set herself very steadily against admitting any such thing.\nSir Thomas had appealed to her reason, conscience, and dignity. He called it a sacrifice, and demanded it of her goodness and self-command as such. But Mrs. Norris wanted to persuade her that Fanny could be very well spared-_she_ being ready to give up all her own time to her as requested-and, in short, could not really be wanted or missed.\n\"That may be, sister,\" was all Lady Bertram's reply. \"I dare say you are very right; but I am sure I shall miss her very much.\"\nThe next step was to communicate with Portsmouth. Fanny wrote to offer herself; and her mother's answer, though short, was so kind-a few simple lines expressed so natural and motherly a joy in the prospect of seeing her child again, as to confirm all the daughter's views of happiness in being with her-convincing her that she should now find a warm and affectionate friend in the \"mama\" who had certainly shewn no remarkable fondness for her formerly; but this she could easily suppose to have been her own fault or her own fancy. She had probably alienated love by the helplessness and fretfulness of a fearful temper, or been unreasonable in wanting a larger share than any one among so many could deserve. Now, when she knew better how to be useful, and how to forbear, and when her mother could be no longer occupied by the incessant demands of a house full of little children, there would be leisure and inclination for every comfort, and they should soon be what mother and daughter ought to be to each other.\nWilliam was almost as happy in the plan as his sister. It would be the greatest pleasure to him to have her there to the last moment before he sailed, and perhaps find her there still when he came in from his first cruise. And besides, he wanted her so very much to see the Thrush before she went out of harbour-the Thrush was certainly the finest sloop in the service-and there were several improvements in the dockyard, too, which he quite longed to shew her.\nHe did not scruple to add that her being at home for a while would be a great advantage to everybody.\n\"I do not know how it is,\" said he; \"but we seem to want some of your nice ways and orderliness at my father's. The house is always in confusion. You will set things going in a better way, I am sure. You will tell my mother how it all ought to be, and you will be so useful to Susan, and you will teach Betsey, and make the boys love and mind you. How right and comfortable it will all be!\"\nBy the time Mrs. Price's answer arrived, there remained but a very few days more to be spent at Mansfield; and for part of one of those days the young travellers were in a good deal of alarm on the subject of their journey, for when the mode of it came to be talked of, and Mrs. Norris found that all her anxiety to save her brother-in-law's money was vain, and that in spite of her wishes and hints for a less expensive conveyance of Fanny, they were to travel post; when she saw Sir Thomas actually give William notes for the purpose, she was struck with the idea of there being room for a third in the carriage, and suddenly seized with a strong inclination to go with them, to go and see her poor dear sister Price. She proclaimed her thoughts. She must say that she had more than half a mind to go with the young people; it would be such an indulgence to her; she had not seen her poor dear sister Price for more than twenty years; and it would be a help to the young people in their journey to have her older head to manage for them; and she could not help thinking her poor dear sister Price would feel it very unkind of her not to come by such an opportunity.\nWilliam and Fanny were horror-struck at the idea.\nAll the comfort of their comfortable journey would be destroyed at once. With woeful countenances they looked at each other. Their suspense lasted an hour or two. No one interfered to encourage or dissuade. Mrs. Norris was left to settle the matter by herself; and it ended, to the infinite joy of her nephew and niece, in the recollection that she could not possibly be spared from Mansfield Park at present; that she was a great deal too necessary to Sir Thomas and Lady Bertram for her to be able to answer it to herself to leave them even for a week, and therefore must certainly sacrifice every other pleasure to that of being useful to them.\nIt had, in fact, occurred to her, that though taken to Portsmouth for nothing, it would be hardly possible for her to avoid paying her own expenses back again. So her poor dear sister Price was left to all the disappointment of her missing such an opportunity, and another twenty years' absence, perhaps, begun.\nEdmund's plans were affected by this Portsmouth journey, this absence of Fanny's. He too had a sacrifice to make to Mansfield Park as well as his aunt. He had intended, about this time, to be going to London; but he could not leave his father and mother just when everybody else of most importance to their comfort was leaving them; and with an effort, felt but not boasted of, he delayed for a week or two longer a journey which he was looking forward to with the hope of its fixing his happiness for ever.\nHe told Fanny of it. She knew so much already, that she must know everything. It made the substance of one other confidential discourse about Miss Crawford; and Fanny was the more affected from feeling it to be the last time in which Miss Crawford's name would ever be mentioned between them with any remains of liberty. Once afterwards she was alluded to by him. Lady Bertram had been telling her niece in the evening to write to her soon and often, and promising to be a good correspondent herself; and Edmund, at a convenient moment, then added in a whisper, \"And _I_ shall write to you, Fanny, when I have anything worth writing about, anything to say that I think you will like to hear, and that you will not hear so soon from any other quarter.\" Had she doubted his meaning while she listened, the glow in his face, when she looked up at him, would have been decisive.\nFor this letter she must try to arm herself. That a letter from Edmund should be a subject of terror! She began to feel that she had not yet gone through all the changes of opinion and sentiment which the progress of time and variation of circumstances occasion in this world of changes. The vicissitudes of the human mind had not yet been exhausted by her.\nPoor Fanny! though going as she did willingly and eagerly, the last evening at Mansfield Park must still be wretchedness. Her heart was completely sad at parting. She had tears for every room in the house, much more for every beloved inhabitant. She clung to her aunt, because she would miss her; she kissed the hand of her uncle with struggling sobs, because she had displeased him; and as for Edmund, she could neither speak, nor look, nor think, when the last moment came with _him_; and it was not till it was over that she knew he was giving her the affectionate farewell of a brother.\nAll this passed overnight, for the journey was to begin very early in the morning; and when the small, diminished party met at breakfast, William and Fanny were talked of as already advanced one stage.",
        "paragraph_chars": [
            [
                0,
                838
            ],
            [
                838,
                991
            ],
            [
                991,
                1263
            ],
            [
                1263,
                2629
            ],
            [
                2629,
                3377
            ],
            [
                3377,
                3779
            ],
            [
                3779,
                4510
            ],
            [
                4510,
                5240
            ],
            [
                5240,
                6513
            ],
            [
                6513,
                6944
            ],
            [
                6944,
                8631
            ],
            [
                8631,
                9158
            ],
            [
                9158,
                9492
            ],
            [
                9492,
                10417
            ],
            [
                10417,
                10760
            ],
            [
                10760,
                10888
            ],
            [
                10888,
                11905
            ],
            [
                11905,
                12367
            ],
            [
                12367,
                12469
            ],
            [
                12469,
                12860
            ],
            [
                12860,
                14028
            ],
            [
                14028,
                14078
            ],
            [
                14078,
                14726
            ],
            [
                14726,
                15038
            ],
            [
                15038,
                15546
            ],
            [
                15546,
                16421
            ],
            [
                16421,
                16779
            ],
            [
                16779,
                17370
            ],
            [
                17370,
                17571
            ]
        ],
        "segment_chars": [
            [
                0,
                223
            ],
            [
                223,
                400
            ],
            [
                400,
                475
            ],
            [
                475,
                547
            ],
            [
                547,
                635
            ],
            [
                635,
                838
            ],
            [
                838,
                991
            ],
            [
                991,
                1142
            ],
            [
                1142,
                1263
            ],
            [
                1263,
                1269
            ],
            [
                1269,
                1363
            ],
            [
                1363,
                1813
            ],
            [
                1813,
                1879
            ],
            [
                1879,
                2077
            ],
            [
                2077,
                2128
            ],
            [
                2128,
                2206
            ],
            [
                2206,
                2428
            ],
            [
                2428,
                2629
            ],
            [
                2629,
                2894
            ],
            [
                2894,
                2965
            ],
            [
                2965,
                3377
            ],
            [
                3377,
                3654
            ],
            [
                3654,
                3779
            ],
            [
                3779,
                4308
            ],
            [
                4308,
                4510
            ],
            [
                4510,
                4646
            ],
            [
                4646,
                4843
            ],
            [
                4843,
                5057
            ],
            [
                5057,
                5198
            ],
            [
                5198,
                5240
            ],
            [
                5240,
                5359
            ],
            [
                5359,
                5522
            ],
            [
                5522,
                5590
            ],
            [
                5590,
                5719
            ],
            [
                5719,
                6135
            ],
            [
                6135,
                6513
            ],
            [
                6513,
                6619
            ],
            [
                6619,
                6749
            ],
            [
                6749,
                6944
            ],
            [
                6944,
                7437
            ],
            [
                7437,
                7691
            ],
            [
                7691,
                7738
            ],
            [
                7738,
                7967
            ],
            [
                7967,
                8211
            ],
            [
                8211,
                8543
            ],
            [
                8543,
                8631
            ],
            [
                8631,
                8750
            ],
            [
                8750,
                9068
            ],
            [
                9068,
                9158
            ],
            [
                9158,
                9243
            ],
            [
                9243,
                9492
            ],
            [
                9492,
                9529
            ],
            [
                9529,
                9960
            ],
            [
                9960,
                10247
            ],
            [
                10247,
                10417
            ],
            [
                10417,
                10481
            ],
            [
                10481,
                10565
            ],
            [
                10565,
                10760
            ],
            [
                10760,
                10813
            ],
            [
                10813,
                10888
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                11420
            ],
            [
                11420,
                11598
            ],
            [
                11598,
                11905
            ],
            [
                11905,
                11960
            ],
            [
                11960,
                12128
            ],
            [
                12128,
                12367
            ],
            [
                12367,
                12469
            ],
            [
                12469,
                12581
            ],
            [
                12581,
                12615
            ],
            [
                12615,
                12669
            ],
            [
                12669,
                12817
            ],
            [
                12817,
                12860
            ],
            [
                12860,
                13580
            ],
            [
                13580,
                13609
            ],
            [
                13609,
                14028
            ],
            [
                14028,
                14078
            ],
            [
                14078,
                14151
            ],
            [
                14151,
                14203
            ],
            [
                14203,
                14241
            ],
            [
                14241,
                14285
            ],
            [
                14285,
                14726
            ],
            [
                14726,
                14886
            ],
            [
                14886,
                15038
            ],
            [
                15038,
                15120
            ],
            [
                15120,
                15190
            ],
            [
                15190,
                15546
            ],
            [
                15546,
                15567
            ],
            [
                15567,
                15624
            ],
            [
                15624,
                15867
            ],
            [
                15867,
                15910
            ],
            [
                15910,
                16298
            ],
            [
                16298,
                16421
            ],
            [
                16421,
                16466
            ],
            [
                16466,
                16523
            ],
            [
                16523,
                16709
            ],
            [
                16709,
                16779
            ],
            [
                16779,
                16791
            ],
            [
                16791,
                16901
            ],
            [
                16901,
                16942
            ],
            [
                16942,
                17025
            ],
            [
                17025,
                17370
            ],
            [
                17370,
                17571
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                104,
                152
            ],
            [
                159,
                169
            ],
            [
                200,
                201
            ],
            [
                282,
                285
            ],
            [
                298,
                302
            ],
            [
                323,
                349
            ],
            [
                351,
                363
            ],
            [
                369,
                400
            ],
            [
                400,
                475
            ],
            [
                547,
                614
            ],
            [
                633,
                635
            ],
            [
                635,
                661
            ],
            [
                687,
                730
            ],
            [
                783,
                838
            ],
            [
                838,
                852
            ],
            [
                861,
                883
            ],
            [
                989,
                990
            ],
            [
                991,
                1013
            ],
            [
                1021,
                1024
            ],
            [
                1026,
                1060
            ],
            [
                1075,
                1117
            ],
            [
                1118,
                1122
            ],
            [
                1140,
                1142
            ],
            [
                1142,
                1183
            ],
            [
                1185,
                1188
            ],
            [
                1261,
                1263
            ],
            [
                1263,
                1269
            ],
            [
                1269,
                1300
            ],
            [
                1314,
                1363
            ],
            [
                1363,
                1408
            ],
            [
                1412,
                1438
            ],
            [
                1583,
                1644
            ],
            [
                1661,
                1733
            ],
            [
                1741,
                1782
            ],
            [
                1811,
                1813
            ],
            [
                1879,
                1894
            ],
            [
                1911,
                1914
            ],
            [
                1899,
                1907
            ],
            [
                1924,
                1974
            ],
            [
                1979,
                1985
            ],
            [
                2005,
                2077
            ],
            [
                2077,
                2093
            ],
            [
                2105,
                2128
            ],
            [
                2128,
                2205
            ],
            [
                2206,
                2226
            ],
            [
                2302,
                2324
            ],
            [
                2345,
                2361
            ],
            [
                2335,
                2340
            ],
            [
                2364,
                2428
            ],
            [
                2428,
                2483
            ],
            [
                2535,
                2553
            ],
            [
                2554,
                2590
            ],
            [
                2620,
                2629
            ],
            [
                2629,
                2637
            ],
            [
                2643,
                2688
            ],
            [
                2718,
                2777
            ],
            [
                2784,
                2894
            ],
            [
                2894,
                2965
            ],
            [
                2965,
                3043
            ],
            [
                3177,
                3203
            ],
            [
                3227,
                3256
            ],
            [
                3284,
                3376
            ],
            [
                3658,
                3660
            ],
            [
                3671,
                3676
            ],
            [
                3690,
                3714
            ],
            [
                3724,
                3779
            ],
            [
                3779,
                3801
            ],
            [
                3855,
                3860
            ],
            [
                3926,
                3958
            ],
            [
                3969,
                4003
            ],
            [
                4084,
                4095
            ],
            [
                4107,
                4138
            ],
            [
                4177,
                4189
            ],
            [
                4225,
                4233
            ],
            [
                4199,
                4217
            ],
            [
                3916,
                3918
            ],
            [
                4283,
                4290
            ],
            [
                4306,
                4308
            ],
            [
                4308,
                4358
            ],
            [
                4392,
                4436
            ],
            [
                4359,
                4361
            ],
            [
                4470,
                4510
            ],
            [
                4510,
                4554
            ],
            [
                4560,
                4571
            ],
            [
                4578,
                4646
            ],
            [
                4646,
                4695
            ],
            [
                4708,
                4712
            ],
            [
                4720,
                4725
            ],
            [
                4846,
                4851
            ],
            [
                4730,
                4743
            ],
            [
                4751,
                4754
            ],
            [
                4713,
                4719
            ],
            [
                4759,
                4762
            ],
            [
                4767,
                4776
            ],
            [
                4832,
                4841
            ],
            [
                4884,
                4885
            ],
            [
                5119,
                5133
            ],
            [
                5141,
                5146
            ],
            [
                5166,
                5192
            ],
            [
                5198,
                5221
            ],
            [
                5238,
                5240
            ],
            [
                5240,
                5323
            ],
            [
                5333,
                5359
            ],
            [
                5752,
                5758
            ],
            [
                5503,
                5520
            ],
            [
                5388,
                5389
            ],
            [
                5359,
                5361
            ],
            [
                5634,
                5636
            ],
            [
                5692,
                5717
            ],
            [
                5455,
                5460
            ],
            [
                5378,
                5388
            ],
            [
                5362,
                5365
            ],
            [
                5980,
                6006
            ],
            [
                5421,
                5422
            ],
            [
                5667,
                5670
            ],
            [
                6085,
                6099
            ],
            [
                6023,
                6028
            ],
            [
                6100,
                6135
            ],
            [
                6135,
                6262
            ],
            [
                6268,
                6296
            ],
            [
                6312,
                6344
            ],
            [
                6367,
                6372
            ],
            [
                6351,
                6359
            ],
            [
                6378,
                6383
            ],
            [
                6392,
                6398
            ],
            [
                6506,
                6513
            ],
            [
                6513,
                6539
            ],
            [
                6570,
                6571
            ],
            [
                6578,
                6580
            ],
            [
                6545,
                6570
            ],
            [
                6581,
                6585
            ],
            [
                6598,
                6608
            ],
            [
                6609,
                6619
            ],
            [
                6619,
                6653
            ],
            [
                6670,
                6691
            ],
            [
                6701,
                6725
            ],
            [
                6740,
                6749
            ],
            [
                6749,
                6773
            ],
            [
                6795,
                6893
            ],
            [
                6895,
                6944
            ],
            [
                6944,
                7034
            ],
            [
                7080,
                7139
            ],
            [
                7144,
                7232
            ],
            [
                7256,
                7258
            ],
            [
                7286,
                7298
            ],
            [
                7321,
                7330
            ],
            [
                7345,
                7350
            ],
            [
                7368,
                7393
            ],
            [
                7428,
                7437
            ],
            [
                7510,
                7517
            ],
            [
                7518,
                7588
            ],
            [
                7689,
                7691
            ],
            [
                7691,
                7737
            ],
            [
                7738,
                7748
            ],
            [
                7816,
                7833
            ],
            [
                7847,
                7907
            ],
            [
                7920,
                7926
            ],
            [
                7908,
                7916
            ],
            [
                7931,
                7967
            ],
            [
                7967,
                8175
            ],
            [
                8182,
                8211
            ],
            [
                8211,
                8265
            ],
            [
                8318,
                8345
            ],
            [
                8354,
                8468
            ],
            [
                8541,
                8543
            ],
            [
                8543,
                8582
            ],
            [
                8585,
                8593
            ],
            [
                8629,
                8631
            ],
            [
                8631,
                8664
            ],
            [
                8666,
                8669
            ],
            [
                8732,
                8750
            ],
            [
                8750,
                8805
            ],
            [
                8905,
                8948
            ],
            [
                8958,
                9068
            ],
            [
                9068,
                9158
            ],
            [
                9158,
                9243
            ],
            [
                9357,
                9439
            ],
            [
                9490,
                9492
            ],
            [
                9492,
                9529
            ],
            [
                9529,
                9617
            ],
            [
                9670,
                9767
            ],
            [
                9958,
                9959
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                11018
            ],
            [
                11121,
                11237
            ],
            [
                11255,
                11293
            ],
            [
                11300,
                11401
            ],
            [
                11418,
                11420
            ],
            [
                11420,
                11454
            ],
            [
                11476,
                11487
            ],
            [
                11507,
                11560
            ],
            [
                11565,
                11598
            ],
            [
                11598,
                11640
            ],
            [
                11660,
                11793
            ],
            [
                11810,
                11905
            ],
            [
                11905,
                11960
            ],
            [
                11960,
                11993
            ],
            [
                12001,
                12128
            ],
            [
                12128,
                12277
            ],
            [
                12313,
                12356
            ],
            [
                12362,
                12366
            ],
            [
                12398,
                12469
            ],
            [
                12469,
                12538
            ],
            [
                12553,
                12581
            ],
            [
                12581,
                12615
            ],
            [
                12615,
                12669
            ],
            [
                12817,
                12860
            ],
            [
                12971,
                12974
            ],
            [
                12920,
                12921
            ],
            [
                12927,
                12930
            ],
            [
                13001,
                13050
            ],
            [
                13069,
                13082
            ],
            [
                13134,
                13156
            ],
            [
                13227,
                13242
            ],
            [
                13254,
                13327
            ],
            [
                12967,
                12970
            ],
            [
                13328,
                13351
            ],
            [
                13361,
                13373
            ],
            [
                13202,
                13207
            ],
            [
                13380,
                13536
            ],
            [
                12941,
                12943
            ],
            [
                13548,
                13580
            ],
            [
                13580,
                13608
            ],
            [
                14028,
                14077
            ],
            [
                14078,
                14081
            ],
            [
                14097,
                14102
            ],
            [
                14086,
                14093
            ],
            [
                14123,
                14141
            ],
            [
                14149,
                14151
            ],
            [
                14151,
                14203
            ],
            [
                14285,
                14486
            ],
            [
                14724,
                14726
            ],
            [
                14726,
                14886
            ],
            [
                14886,
                14953
            ],
            [
                15020,
                15030
            ],
            [
                14991,
                15020
            ],
            [
                15036,
                15038
            ],
            [
                15038,
                15093
            ],
            [
                15118,
                15120
            ],
            [
                15190,
                15369
            ],
            [
                15375,
                15546
            ],
            [
                15546,
                15567
            ],
            [
                15567,
                15624
            ],
            [
                15707,
                15716
            ],
            [
                15726,
                15734
            ],
            [
                15740,
                15846
            ],
            [
                15858,
                15867
            ],
            [
                15867,
                15882
            ],
            [
                15891,
                15901
            ],
            [
                15908,
                15910
            ],
            [
                15910,
                15949
            ],
            [
                15965,
                16000
            ],
            [
                16051,
                16057
            ],
            [
                16088,
                16112
            ],
            [
                16114,
                16115
            ],
            [
                16117,
                16164
            ],
            [
                16195,
                16236
            ],
            [
                16295,
                16298
            ],
            [
                16298,
                16325
            ],
            [
                16344,
                16421
            ],
            [
                16421,
                16466
            ],
            [
                16466,
                16523
            ],
            [
                16523,
                16545
            ],
            [
                16579,
                16582
            ],
            [
                16726,
                16779
            ],
            [
                16779,
                16791
            ],
            [
                16791,
                16803
            ],
            [
                16829,
                16895
            ],
            [
                16899,
                16901
            ],
            [
                16942,
                16984
            ],
            [
                16999,
                17025
            ],
            [
                17025,
                17226
            ],
            [
                17264,
                17370
            ],
            [
                17401,
                17412
            ],
            [
                17426,
                17465
            ],
            [
                17473,
                17571
            ]
        ],
        "row_chars": [
            [
                0,
                400
            ],
            [
                400,
                475
            ],
            [
                475,
                547
            ],
            [
                547,
                635
            ],
            [
                635,
                838
            ],
            [
                838,
                991
            ],
            [
                991,
                1142
            ],
            [
                1142,
                1263
            ],
            [
                1263,
                1269
            ],
            [
                1269,
                1363
            ],
            [
                1363,
                1813
            ],
            [
                1813,
                1879
            ],
            [
                1879,
                2077
            ],
            [
                2077,
                2128
            ],
            [
                2128,
                2206
            ],
            [
                2206,
                2428
            ],
            [
                2428,
                2629
            ],
            [
                2629,
                2894
            ],
            [
                2894,
                2965
            ],
            [
                2965,
                3377
            ],
            [
                3377,
                3654
            ],
            [
                3654,
                3779
            ],
            [
                3779,
                4308
            ],
            [
                4308,
                4510
            ],
            [
                4510,
                4646
            ],
            [
                4646,
                5240
            ],
            [
                5240,
                5359
            ],
            [
                5359,
                6135
            ],
            [
                6135,
                6513
            ],
            [
                6513,
                6619
            ],
            [
                6619,
                6749
            ],
            [
                6749,
                6944
            ],
            [
                6944,
                7437
            ],
            [
                7437,
                7691
            ],
            [
                7691,
                7738
            ],
            [
                7738,
                7967
            ],
            [
                7967,
                8211
            ],
            [
                8211,
                8543
            ],
            [
                8543,
                8631
            ],
            [
                8631,
                8750
            ],
            [
                8750,
                9068
            ],
            [
                9068,
                9158
            ],
            [
                9158,
                9243
            ],
            [
                9243,
                9492
            ],
            [
                9492,
                9529
            ],
            [
                9529,
                9960
            ],
            [
                9960,
                10247
            ],
            [
                10247,
                10417
            ],
            [
                10417,
                10481
            ],
            [
                10481,
                10565
            ],
            [
                10565,
                10760
            ],
            [
                10760,
                10813
            ],
            [
                10813,
                10888
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                11420
            ],
            [
                11420,
                11598
            ],
            [
                11598,
                11905
            ],
            [
                11905,
                11960
            ],
            [
                11960,
                12128
            ],
            [
                12128,
                12367
            ],
            [
                12367,
                12469
            ],
            [
                12469,
                12581
            ],
            [
                12581,
                12615
            ],
            [
                12615,
                12669
            ],
            [
                12669,
                12817
            ],
            [
                12817,
                12860
            ],
            [
                12860,
                13580
            ],
            [
                13580,
                13609
            ],
            [
                13609,
                14028
            ],
            [
                14028,
                14078
            ],
            [
                14078,
                14151
            ],
            [
                14151,
                14203
            ],
            [
                14203,
                14241
            ],
            [
                14241,
                14285
            ],
            [
                14285,
                14726
            ],
            [
                14726,
                14886
            ],
            [
                14886,
                15038
            ],
            [
                15038,
                15120
            ],
            [
                15120,
                15190
            ],
            [
                15190,
                15546
            ],
            [
                15546,
                15567
            ],
            [
                15567,
                15624
            ],
            [
                15624,
                15867
            ],
            [
                15867,
                15910
            ],
            [
                15910,
                16298
            ],
            [
                16298,
                16421
            ],
            [
                16421,
                16466
            ],
            [
                16466,
                16523
            ],
            [
                16523,
                16779
            ],
            [
                16779,
                16791
            ],
            [
                16791,
                16901
            ],
            [
                16901,
                16942
            ],
            [
                16942,
                17025
            ],
            [
                17025,
                17370
            ],
            [
                17370,
                17571
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Crawford gone, Sir Thomas's next object was that he should be missed; and he hoped that his niece would find a blank in the loss of his attentions, and that her sinking again into nothing would awaken wholesome regrets in her mind. He watched her with this idea; but he could hardly tell with what success. She was always so gentle and retiring that her emotions were beyond him. He did not understand her: and therefore applied to Edmund to tell him whether she were more or less happy than she had been.\nEdmund did not see any symptoms of regret. What chiefly surprised him was that Crawford's sister, the friend who had been so much to her, should not be missed more. He wondered that Fanny spoke so seldom of her.\nAlas! it was this sister, this friend, who was now the chief bane of Fanny's comfort. If she could have believed Mary's future fate unconnected with Mansfield, she would have been light of heart indeed; but the more she observed, the more deeply was she convinced that everything was now in a fair train for Miss Crawford's marrying Edmund. His objections, his scruples, seemed all done away, nobody could tell how; and his doubts about her ambition were equally got over-and equally without apparent reason. It could only be through increasing attachment. His good and her bad feelings yielded to love, and such love must unite them.\nHe was to go to town within a fortnight; he loved to talk of going; and when once with her again, Fanny could not doubt the rest. Her acceptance must be as certain as his offer; and yet the prospect of it was most sorrowful to her, independently of self.\nIn their last conversation, Miss Crawford, in spite of much personal kindness, had still been Miss Crawford; still shown a mind led astray and bewildered, and without any suspicion of being so; darkened, yet fancying itself light. She might love, but she did not deserve Edmund by any other sentiment. Fanny believed there was scarcely a second feeling in common between them; and felt that if Edmund's influence had already done so little in regulating her notions, his worth would be finally wasted on her even in years of matrimony. As Fanny was convinced of this, she suffered very much, and could never speak of Miss Crawford without pain.\nSir Thomas, meanwhile, still expected to see the effect of the loss of consequence on his niece's spirits. He was soon able to account for his not yet observing this, by the approach of another visitor to lift Fanny's spirits. William had obtained a ten days' leave of absence, and was coming, the happiest of lieutenants, to show his happiness and describe his uniform.\nHe came; and he would have been delighted to show his uniform too, had not cruel custom prohibited its appearance except on duty. So the uniform remained at Portsmouth, and Edmund thought that Fanny would not have any chance of viewing it, before its freshness was worn away; until Sir Thomas formed a scheme which meant Fanny could see the second lieutenant of HMS Thrush in all his glory.\nThis scheme was that she should accompany her brother back to Portsmouth, and spend some time with her own family. Sir Thomas consulted his son, who thought it would be highly agreeable to Fanny; but Sir Thomas had another motive in sending her away, which had nothing at all to do with any idea of making her happy. He certainly wished her to go willingly, but he as certainly wished her to be heartily sick of home before her visit ended; and hoped a little abstinence from the luxuries of Mansfield Park would sober her mind, and help her to better appreciate Henry Crawford's offer.\nIt was a medicinal project, for he considered that his niece's understanding must at present be diseased. A residence of eight or nine years amidst wealth and plenty had disordered her powers of judging. Her father's house would teach her the value of a good income; and he trusted that she would be the wiser and happier woman all her life, for the experiment he had devised.\nHad Fanny been at all addicted to raptures, she must have had a strong attack of them when her uncle first made her the offer of visiting the parents, brothers, and sisters, from whom she had been divided almost half her life; of returning to them with William as companion, and continuing to see William while he remained on land. She was indeed delighted, but her happiness was of a quiet, deep, heart-swelling sort. At the moment she could only thank and accept.\nAfterwards, she could speak to William and Edmund of what she felt; but still there were tender emotions that could not be clothed in words. The remembrance of all her earliest pleasures, and of what she had suffered in being torn from them, came over her with renewed strength, and it seemed as if to be at home again would heal every pain that had grown out of the separation. To be in the centre of such a circle, loved by so many; to feel affection without restraint; to feel herself the equal of those who surrounded her; to be at peace from all mention of the Crawfords. This was a prospect to be dwelt on with fondness.\nEdmund, too-to be two months from him must do her good. At a distance, unassailed by his looks or his kindness, she should be able to reason herself into a more proper state; she should be able to think of him as in London, and arranging everything there, without wretchedness. What might have been hard to bear at Mansfield was to become a slight evil at Portsmouth.\nThe only drawback was the doubt of her aunt Bertram's being comfortable without her. That part of the arrangement was, indeed, the hardest for Sir Thomas to accomplish.\nBut he was master at Mansfield Park. When he had really resolved on any measure, he could always carry it through; and now by dwelling on the duty of Fanny's sometimes seeing her family, he did induce his wife to let her go.\nThe next step was to communicate with Portsmouth. Fanny wrote to offer herself; and her mother's answer, though short, was so kind as to confirm all the daughter's views of happiness in being with her-convincing her that she should now find a warm friend in the \"mama\" who had certainly shown no remarkable fondness for her formerly; but this she could easily suppose to have been her own fault. She had probably alienated love by fretfulness, or been unreasonable in wanting a larger share than one among so many could deserve. Now, when she knew better how to be useful, and when her mother could be no longer occupied by the incessant demands of a house full of little children, there would be leisure for every comfort, and they should soon be what mother and daughter ought to be to each other.\nWilliam was almost as happy in the plan as his sister. It would be the greatest pleasure to have her there to the last moment before he sailed, and perhaps find her there still when he came in from his first cruise. And besides, he wanted her so very much to see the Thrush before she went out of harbour-the Thrush was certainly the finest sloop in the service-and the dockyard, too, which he quite longed to show her. In addition, her being at home for a while would be a great advantage to everybody.\n\"I do not know how it is,\" said he; \"but we seem to want some of your orderliness at my father's. The house is always in confusion. You will set things going in a better way, I am sure. How right and comfortable it will all be!\"\nFor a few hours the young travellers were in a good deal of alarm about their journey: Mrs. Norris found that in spite of her hints for a less expensive conveyance of Fanny, they were to travel post; and when she saw Sir Thomas give William money for the purpose, she was struck with the idea of there being room for a third in the carriage, and suddenly seized with a strong inclination to go with them to see her poor dear sister Price. She proclaimed her thoughts.\nWilliam and Fanny were horror-struck at the idea. All their comfort would be destroyed. With woeful countenances they looked at each other. Mrs. Norris was left to settle the matter by herself; and it ended, to the infinite joy of her nephew and niece, in the recollection that she could not possibly be spared from Mansfield Park at present.\nIt had, in fact, occurred to her, that though taken to Portsmouth for nothing, it would be hardly possible for her to avoid paying her own expenses back again. So her poor dear sister Price was left to all the disappointment of, perhaps, another twenty years' absence.\nEdmund's plans were affected by this Portsmouth journey. He had intended, about this time, to be going to London; but he could not leave his father and mother just when everybody else of most importance to their comfort was leaving them. With an effort, felt but not boasted of, he delayed for a week or two longer a journey which he was looking forward to with the hope of its fixing his happiness for ever.\nHe told Fanny of it. She knew so much already, that she must know everything. Fanny was affected, feeling it to be the last time in which Miss Crawford's name would ever be mentioned between them with any liberty. Once afterwards he alluded to her. Lady Bertram had been telling her niece to write to her soon and often, and Edmund added in a whisper, \"And I shall write to you, Fanny, when I have anything to say that I think you will like to hear.\" Had she doubted his meaning, the glow in his face, when she looked up at him, would have been decisive.\nFor this letter she must try to arm herself. That a letter from Edmund should be a subject of terror! She began to feel that the varied trials of the human mind had not yet been exhausted by her.\nPoor Fanny! though going eagerly, the last evening at Mansfield Park must still be wretched. She had tears for every room in the house, and every beloved inhabitant. She clung to her aunt, because she would miss her; she kissed the hand of her uncle with struggling sobs, because she had displeased him; and as for Edmund, she could neither speak, nor look, nor think; and it was not till it was over that she knew he was giving her the affectionate farewell of a brother.\nThe journey began very early in the morning; and when the diminished party met at breakfast, William and Fanny were talked of as already advanced one stage.",
        "paragraph_chars": [
            [
                0,
                510
            ],
            [
                510,
                722
            ],
            [
                722,
                1357
            ],
            [
                1357,
                1612
            ],
            [
                1612,
                2257
            ],
            [
                2257,
                2628
            ],
            [
                2628,
                3019
            ],
            [
                3019,
                3606
            ],
            [
                3606,
                3983
            ],
            [
                3983,
                4449
            ],
            [
                4449,
                5076
            ],
            [
                5076,
                5444
            ],
            [
                5444,
                5613
            ],
            [
                5613,
                5838
            ],
            [
                5838,
                6638
            ],
            [
                6638,
                7142
            ],
            [
                7142,
                7371
            ],
            [
                7371,
                7839
            ],
            [
                7839,
                8182
            ],
            [
                8182,
                8451
            ],
            [
                8451,
                8860
            ],
            [
                8860,
                9415
            ],
            [
                9415,
                9611
            ],
            [
                9611,
                10084
            ],
            [
                10084,
                10240
            ]
        ],
        "segment_chars": [
            [
                0,
                236
            ],
            [
                236,
                311
            ],
            [
                311,
                384
            ],
            [
                384,
                510
            ],
            [
                510,
                553
            ],
            [
                553,
                675
            ],
            [
                675,
                722
            ],
            [
                722,
                728
            ],
            [
                728,
                808
            ],
            [
                808,
                1063
            ],
            [
                1063,
                1231
            ],
            [
                1231,
                1279
            ],
            [
                1279,
                1357
            ],
            [
                1357,
                1487
            ],
            [
                1487,
                1612
            ],
            [
                1612,
                1843
            ],
            [
                1843,
                1914
            ],
            [
                1914,
                2148
            ],
            [
                2148,
                2257
            ],
            [
                2257,
                2364
            ],
            [
                2364,
                2484
            ],
            [
                2484,
                2628
            ],
            [
                2628,
                2758
            ],
            [
                2758,
                3019
            ],
            [
                3019,
                3134
            ],
            [
                3134,
                3336
            ],
            [
                3336,
                3606
            ],
            [
                3606,
                3712
            ],
            [
                3712,
                3810
            ],
            [
                3810,
                3983
            ],
            [
                3983,
                4315
            ],
            [
                4315,
                4402
            ],
            [
                4402,
                4449
            ],
            [
                4449,
                4590
            ],
            [
                4590,
                4828
            ],
            [
                4828,
                5026
            ],
            [
                5026,
                5076
            ],
            [
                5076,
                5132
            ],
            [
                5132,
                5354
            ],
            [
                5354,
                5444
            ],
            [
                5444,
                5529
            ],
            [
                5529,
                5613
            ],
            [
                5613,
                5650
            ],
            [
                5650,
                5838
            ],
            [
                5838,
                5888
            ],
            [
                5888,
                6234
            ],
            [
                6234,
                6367
            ],
            [
                6367,
                6638
            ],
            [
                6638,
                6693
            ],
            [
                6693,
                6854
            ],
            [
                6854,
                7058
            ],
            [
                7058,
                7142
            ],
            [
                7142,
                7240
            ],
            [
                7240,
                7274
            ],
            [
                7274,
                7328
            ],
            [
                7328,
                7371
            ],
            [
                7371,
                7810
            ],
            [
                7810,
                7839
            ],
            [
                7839,
                7889
            ],
            [
                7889,
                7927
            ],
            [
                7927,
                7979
            ],
            [
                7979,
                8182
            ],
            [
                8182,
                8342
            ],
            [
                8342,
                8451
            ],
            [
                8451,
                8508
            ],
            [
                8508,
                8689
            ],
            [
                8689,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8881,
                8938
            ],
            [
                8938,
                9074
            ],
            [
                9074,
                9109
            ],
            [
                9109,
                9311
            ],
            [
                9311,
                9415
            ],
            [
                9415,
                9460
            ],
            [
                9460,
                9517
            ],
            [
                9517,
                9611
            ],
            [
                9611,
                9623
            ],
            [
                9623,
                9704
            ],
            [
                9704,
                9777
            ],
            [
                9777,
                10084
            ],
            [
                10084,
                10240
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                87,
                135
            ],
            [
                140,
                150
            ],
            [
                150,
                151
            ],
            [
                152,
                155
            ],
            [
                156,
                160
            ],
            [
                165,
                191
            ],
            [
                192,
                204
            ],
            [
                205,
                236
            ],
            [
                236,
                311
            ],
            [
                311,
                378
            ],
            [
                382,
                384
            ],
            [
                384,
                410
            ],
            [
                411,
                454
            ],
            [
                455,
                510
            ],
            [
                510,
                524
            ],
            [
                529,
                551
            ],
            [
                551,
                552
            ],
            [
                553,
                575
            ],
            [
                580,
                583
            ],
            [
                584,
                618
            ],
            [
                619,
                661
            ],
            [
                669,
                673
            ],
            [
                673,
                675
            ],
            [
                675,
                716
            ],
            [
                717,
                720
            ],
            [
                720,
                722
            ],
            [
                722,
                728
            ],
            [
                728,
                759
            ],
            [
                759,
                808
            ],
            [
                808,
                853
            ],
            [
                854,
                880
            ],
            [
                880,
                941
            ],
            [
                942,
                1014
            ],
            [
                1020,
                1061
            ],
            [
                1061,
                1063
            ],
            [
                1063,
                1078
            ],
            [
                1079,
                1082
            ],
            [
                1083,
                1091
            ],
            [
                1091,
                1141
            ],
            [
                1146,
                1152
            ],
            [
                1159,
                1231
            ],
            [
                1231,
                1247
            ],
            [
                1256,
                1279
            ],
            [
                1279,
                1356
            ],
            [
                1357,
                1377
            ],
            [
                1378,
                1400
            ],
            [
                1401,
                1417
            ],
            [
                1418,
                1423
            ],
            [
                1423,
                1487
            ],
            [
                1487,
                1542
            ],
            [
                1543,
                1561
            ],
            [
                1566,
                1602
            ],
            [
                1603,
                1612
            ],
            [
                1612,
                1620
            ],
            [
                1621,
                1666
            ],
            [
                1667,
                1726
            ],
            [
                1733,
                1843
            ],
            [
                1843,
                1914
            ],
            [
                1914,
                1992
            ],
            [
                1998,
                2024
            ],
            [
                2025,
                2054
            ],
            [
                2055,
                2147
            ],
            [
                2148,
                2150
            ],
            [
                2151,
                2156
            ],
            [
                2178,
                2202
            ],
            [
                2202,
                2257
            ],
            [
                2257,
                2279
            ],
            [
                2280,
                2285
            ],
            [
                2295,
                2327
            ],
            [
                2328,
                2362
            ],
            [
                2364,
                2375
            ],
            [
                2376,
                2407
            ],
            [
                2418,
                2430
            ],
            [
                2431,
                2439
            ],
            [
                2440,
                2458
            ],
            [
                2459,
                2461
            ],
            [
                2475,
                2482
            ],
            [
                2482,
                2484
            ],
            [
                2484,
                2534
            ],
            [
                2535,
                2579
            ],
            [
                2580,
                2582
            ],
            [
                2588,
                2628
            ],
            [
                2628,
                2672
            ],
            [
                2678,
                2689
            ],
            [
                2690,
                2758
            ],
            [
                2758,
                2807
            ],
            [
                2816,
                2820
            ],
            [
                2821,
                2826
            ],
            [
                2827,
                2832
            ],
            [
                2842,
                2855
            ],
            [
                2864,
                2867
            ],
            [
                2868,
                2874
            ],
            [
                2875,
                2878
            ],
            [
                2879,
                2888
            ],
            [
                2893,
                2902
            ],
            [
                2902,
                2903
            ],
            [
                2928,
                2942
            ],
            [
                2949,
                2954
            ],
            [
                2965,
                2991
            ],
            [
                2994,
                3017
            ],
            [
                3017,
                3019
            ],
            [
                3019,
                3102
            ],
            [
                3108,
                3134
            ],
            [
                3138,
                3144
            ],
            [
                3145,
                3162
            ],
            [
                3162,
                3163
            ],
            [
                3176,
                3178
            ],
            [
                3185,
                3187
            ],
            [
                3188,
                3213
            ],
            [
                3213,
                3218
            ],
            [
                3219,
                3229
            ],
            [
                3230,
                3233
            ],
            [
                3242,
                3268
            ],
            [
                3268,
                3269
            ],
            [
                3276,
                3279
            ],
            [
                3280,
                3294
            ],
            [
                3295,
                3300
            ],
            [
                3301,
                3336
            ],
            [
                3336,
                3463
            ],
            [
                3470,
                3498
            ],
            [
                3499,
                3531
            ],
            [
                3532,
                3537
            ],
            [
                3538,
                3546
            ],
            [
                3546,
                3551
            ],
            [
                3557,
                3563
            ],
            [
                3599,
                3606
            ],
            [
                3606,
                3632
            ],
            [
                3632,
                3633
            ],
            [
                3638,
                3640
            ],
            [
                3657,
                3682
            ],
            [
                3683,
                3687
            ],
            [
                3688,
                3698
            ],
            [
                3702,
                3712
            ],
            [
                3712,
                3746
            ],
            [
                3754,
                3775
            ],
            [
                3776,
                3800
            ],
            [
                3801,
                3810
            ],
            [
                3810,
                3834
            ],
            [
                3835,
                3933
            ],
            [
                3934,
                3983
            ],
            [
                3983,
                4073
            ],
            [
                4074,
                4133
            ],
            [
                4134,
                4222
            ],
            [
                4223,
                4225
            ],
            [
                4231,
                4243
            ],
            [
                4247,
                4256
            ],
            [
                4256,
                4261
            ],
            [
                4262,
                4287
            ],
            [
                4306,
                4315
            ],
            [
                4315,
                4322
            ],
            [
                4330,
                4400
            ],
            [
                4400,
                4402
            ],
            [
                4402,
                4448
            ],
            [
                4449,
                4459
            ],
            [
                4459,
                4476
            ],
            [
                4477,
                4537
            ],
            [
                4538,
                4544
            ],
            [
                4545,
                4553
            ],
            [
                4554,
                4590
            ],
            [
                4590,
                4798
            ],
            [
                4799,
                4828
            ],
            [
                4828,
                4882
            ],
            [
                4882,
                4909
            ],
            [
                4910,
                5024
            ],
            [
                5024,
                5026
            ],
            [
                5026,
                5065
            ],
            [
                5066,
                5074
            ],
            [
                5074,
                5076
            ],
            [
                5076,
                5109
            ],
            [
                5110,
                5113
            ],
            [
                5114,
                5132
            ],
            [
                5132,
                5187
            ],
            [
                5188,
                5231
            ],
            [
                5244,
                5354
            ],
            [
                5354,
                5444
            ],
            [
                5444,
                5529
            ],
            [
                5529,
                5611
            ],
            [
                5611,
                5613
            ],
            [
                5613,
                5650
            ],
            [
                5650,
                5738
            ],
            [
                5739,
                5836
            ],
            [
                5836,
                5837
            ],
            [
                5838,
                5888
            ],
            [
                5888,
                5968
            ],
            [
                5969,
                6085
            ],
            [
                6086,
                6124
            ],
            [
                6131,
                6232
            ],
            [
                6232,
                6234
            ],
            [
                6234,
                6268
            ],
            [
                6269,
                6280
            ],
            [
                6280,
                6333
            ],
            [
                6334,
                6367
            ],
            [
                6367,
                6409
            ],
            [
                6409,
                6542
            ],
            [
                6543,
                6638
            ],
            [
                6638,
                6693
            ],
            [
                6693,
                6726
            ],
            [
                6727,
                6854
            ],
            [
                6854,
                7003
            ],
            [
                7004,
                7047
            ],
            [
                7053,
                7057
            ],
            [
                7071,
                7142
            ],
            [
                7142,
                7211
            ],
            [
                7212,
                7240
            ],
            [
                7240,
                7274
            ],
            [
                7274,
                7328
            ],
            [
                7328,
                7371
            ],
            [
                7371,
                7374
            ],
            [
                7375,
                7376
            ],
            [
                7377,
                7380
            ],
            [
                7387,
                7436
            ],
            [
                7443,
                7456
            ],
            [
                7458,
                7480
            ],
            [
                7481,
                7496
            ],
            [
                7497,
                7570
            ],
            [
                7571,
                7574
            ],
            [
                7575,
                7598
            ],
            [
                7599,
                7611
            ],
            [
                7612,
                7617
            ],
            [
                7618,
                7774
            ],
            [
                7775,
                7777
            ],
            [
                7778,
                7810
            ],
            [
                7810,
                7838
            ],
            [
                7839,
                7888
            ],
            [
                7889,
                7892
            ],
            [
                7893,
                7898
            ],
            [
                7899,
                7906
            ],
            [
                7907,
                7925
            ],
            [
                7925,
                7927
            ],
            [
                7927,
                7979
            ],
            [
                7979,
                8180
            ],
            [
                8180,
                8182
            ],
            [
                8182,
                8342
            ],
            [
                8342,
                8409
            ],
            [
                8409,
                8419
            ],
            [
                8420,
                8449
            ],
            [
                8449,
                8451
            ],
            [
                8451,
                8506
            ],
            [
                8506,
                8508
            ],
            [
                8508,
                8687
            ],
            [
                8689,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8881,
                8938
            ],
            [
                8938,
                8947
            ],
            [
                8948,
                8956
            ],
            [
                8958,
                9064
            ],
            [
                9065,
                9074
            ],
            [
                9074,
                9089
            ],
            [
                9093,
                9103
            ],
            [
                9107,
                9109
            ],
            [
                9109,
                9148
            ],
            [
                9149,
                9184
            ],
            [
                9185,
                9191
            ],
            [
                9192,
                9216
            ],
            [
                9217,
                9218
            ],
            [
                9219,
                9266
            ],
            [
                9267,
                9308
            ],
            [
                9308,
                9311
            ],
            [
                9311,
                9338
            ],
            [
                9338,
                9415
            ],
            [
                9415,
                9460
            ],
            [
                9460,
                9517
            ],
            [
                9517,
                9539
            ],
            [
                9540,
                9543
            ],
            [
                9558,
                9611
            ],
            [
                9611,
                9623
            ],
            [
                9623,
                9635
            ],
            [
                9636,
                9702
            ],
            [
                9702,
                9704
            ],
            [
                9704,
                9746
            ],
            [
                9751,
                9777
            ],
            [
                9777,
                9978
            ],
            [
                9978,
                10084
            ],
            [
                10084,
                10095
            ],
            [
                10102,
                10141
            ],
            [
                10142,
                10240
            ]
        ],
        "row_chars": [
            [
                0,
                236
            ],
            [
                236,
                311
            ],
            [
                311,
                311
            ],
            [
                311,
                384
            ],
            [
                384,
                510
            ],
            [
                510,
                553
            ],
            [
                553,
                675
            ],
            [
                675,
                722
            ],
            [
                722,
                728
            ],
            [
                728,
                808
            ],
            [
                808,
                1063
            ],
            [
                1063,
                1063
            ],
            [
                1063,
                1231
            ],
            [
                1231,
                1279
            ],
            [
                1279,
                1357
            ],
            [
                1357,
                1487
            ],
            [
                1487,
                1612
            ],
            [
                1612,
                1843
            ],
            [
                1843,
                1914
            ],
            [
                1914,
                2148
            ],
            [
                2148,
                2148
            ],
            [
                2148,
                2257
            ],
            [
                2257,
                2484
            ],
            [
                2484,
                2628
            ],
            [
                2628,
                2758
            ],
            [
                2758,
                3019
            ],
            [
                3019,
                3134
            ],
            [
                3134,
                3336
            ],
            [
                3336,
                3606
            ],
            [
                3606,
                3712
            ],
            [
                3712,
                3810
            ],
            [
                3810,
                3983
            ],
            [
                3983,
                4315
            ],
            [
                4315,
                4402
            ],
            [
                4402,
                4449
            ],
            [
                4449,
                4590
            ],
            [
                4590,
                4828
            ],
            [
                4828,
                5026
            ],
            [
                5026,
                5076
            ],
            [
                5076,
                5132
            ],
            [
                5132,
                5354
            ],
            [
                5354,
                5444
            ],
            [
                5444,
                5529
            ],
            [
                5529,
                5613
            ],
            [
                5613,
                5650
            ],
            [
                5650,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5838
            ],
            [
                5838,
                5888
            ],
            [
                5888,
                6234
            ],
            [
                6234,
                6367
            ],
            [
                6367,
                6638
            ],
            [
                6638,
                6693
            ],
            [
                6693,
                6854
            ],
            [
                6854,
                7058
            ],
            [
                7058,
                7142
            ],
            [
                7142,
                7240
            ],
            [
                7240,
                7274
            ],
            [
                7274,
                7328
            ],
            [
                7328,
                7328
            ],
            [
                7328,
                7371
            ],
            [
                7371,
                7810
            ],
            [
                7810,
                7839
            ],
            [
                7839,
                7839
            ],
            [
                7839,
                7889
            ],
            [
                7889,
                7927
            ],
            [
                7927,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                8182
            ],
            [
                8182,
                8342
            ],
            [
                8342,
                8451
            ],
            [
                8451,
                8508
            ],
            [
                8508,
                8508
            ],
            [
                8508,
                8860
            ],
            [
                8860,
                8881
            ],
            [
                8881,
                8938
            ],
            [
                8938,
                9074
            ],
            [
                9074,
                9109
            ],
            [
                9109,
                9311
            ],
            [
                9311,
                9415
            ],
            [
                9415,
                9460
            ],
            [
                9460,
                9517
            ],
            [
                9517,
                9611
            ],
            [
                9611,
                9623
            ],
            [
                9623,
                9704
            ],
            [
                9704,
                9704
            ],
            [
                9704,
                9777
            ],
            [
                9777,
                10084
            ],
            [
                10084,
                10240
            ]
        ]
    }
}