{
    "original": {
        "text": "Could Sir Thomas have seen all his niece's feelings, when she wrote her first letter to her aunt, he would not have despaired; for though a good night's rest, a pleasant morning, the hope of soon seeing William again, and the comparatively quiet state of the house, from Tom and Charles being gone to school, Sam on some project of his own, and her father on his usual lounges, enabled her to express herself cheerfully on the subject of home, there were still, to her own perfect consciousness, many drawbacks suppressed. Could he have seen only half that she felt before the end of a week, he would have thought Mr. Crawford sure of her, and been delighted with his own sagacity.\nBefore the week ended, it was all disappointment. In the first place, William was gone. The Thrush had had her orders, the wind had changed, and he was sailed within four days from their reaching Portsmouth; and during those days she had seen him only twice, in a short and hurried way, when he had come ashore on duty. There had been no free conversation, no walk on the ramparts, no visit to the dockyard, no acquaintance with the Thrush, nothing of all that they had planned and depended on. Everything in that quarter failed her, except William's affection. His last thought on leaving home was for her. He stepped back again to the door to say, \"Take care of Fanny, mother. She is tender, and not used to rough it like the rest of us. I charge you, take care of Fanny.\"\nWilliam was gone: and the home he had left her in was, Fanny could not conceal it from herself, in almost every respect the very reverse of what she could have wished. It was the abode of noise, disorder, and impropriety. Nobody was in their right place, nothing was done as it ought to be. She could not respect her parents as she had hoped. On her father, her confidence had not been sanguine, but he was more negligent of his family, his habits were worse, and his manners coarser, than she had been prepared for. He did not want abilities but he had no curiosity, and no information beyond his profession; he read only the newspaper and the navy-list; he talked only of the dockyard, the harbour, Spithead, and the Motherbank; he swore and he drank, he was dirty and gross. She had never been able to recall anything approaching to tenderness in his former treatment of herself. There had remained only a general impression of roughness and loudness; and now he scarcely ever noticed her, but to make her the object of a coarse joke.\nHer disappointment in her mother was greater: _there_ she had hoped much, and found almost nothing. Every flattering scheme of being of consequence to her soon fell to the ground. Mrs. Price was not unkind; but, instead of gaining on her affection and confidence, and becoming more and more dear, her daughter never met with greater kindness from her than on the first day of her arrival. The instinct of nature was soon satisfied, and Mrs. Price's attachment had no other source. Her heart and her time were already quite full; she had neither leisure nor affection to bestow on Fanny. Her daughters never had been much to her. She was fond of her sons, especially of William, but Betsey was the first of her girls whom she had ever much regarded. To her she was most injudiciously indulgent. William was her pride; Betsey her darling; and John, Richard, Sam, Tom, and Charles occupied all the rest of her maternal solicitude, alternately her worries and her comforts. These shared her heart: her time was given chiefly to her house and her servants. Her days were spent in a kind of slow bustle; all was busy without getting on, always behindhand and lamenting it, without altering her ways; wishing to be an economist, without contrivance or regularity; dissatisfied with her servants, without skill to make them better, and whether helping, or reprimanding, or indulging them, without any power of engaging their respect.\nOf her two sisters, Mrs. Price very much more resembled Lady Bertram than Mrs. Norris. She was a manager by necessity, without any of Mrs. Norris's inclination for it, or any of her activity. Her disposition was naturally easy and indolent, like Lady Bertram's; and a situation of similar affluence and do-nothingness would have been much more suited to her capacity than the exertions and self-denials of the one which her imprudent marriage had placed her in. She might have made just as good a woman of consequence as Lady Bertram, but Mrs. Norris would have been a more respectable mother of nine children on a small income.\nMuch of all this Fanny could not but be sensible of. She might scruple to make use of the words, but she must and did feel that her mother was a partial, ill-judging parent, a dawdle, a slattern, who neither taught nor restrained her children, whose house was the scene of mismanagement and discomfort from beginning to end, and who had no talent, no conversation, no affection towards herself; no curiosity to know her better, no desire of her friendship, and no inclination for her company that could lessen her sense of such feelings.\nFanny was very anxious to be useful, and not to appear above her home, or in any way disqualified or disinclined, by her foreign education, from contributing her help to its comforts, and therefore set about working for Sam immediately; and by working early and late, with perseverance and great despatch, did so much that the boy was shipped off at last, with more than half his linen ready. She had great pleasure in feeling her usefulness, but could not conceive how they would have managed without her.\nSam, loud and overbearing as he was, she rather regretted when he went, for he was clever and intelligent, and glad to be employed in any errand in the town; and though spurning the remonstrances of Susan, given as they were, though very reasonable in themselves, with ill-timed and powerless warmth, was beginning to be influenced by Fanny's services and gentle persuasions; and she found that the best of the three younger ones was gone in him: Tom and Charles being at least as many years as they were his juniors distant from that age of feeling and reason, which might suggest the expediency of making friends, and of endeavouring to be less disagreeable. Their sister soon despaired of making the smallest impression on _them_; they were quite untameable by any means of address which she had spirits or time to attempt. Every afternoon brought a return of their riotous games all over the house; and she very early learned to sigh at the approach of Saturday's constant half-holiday.\nBetsey, too, a spoiled child, trained up to think the alphabet her greatest enemy, left to be with the servants at her pleasure, and then encouraged to report any evil of them, she was almost as ready to despair of being able to love or assist; and of Susan's temper she had many doubts. Her continual disagreements with her mother, her rash squabbles with Tom and Charles, and petulance with Betsey, were at least so distressing to Fanny that, though admitting they were by no means without provocation, she feared the disposition that could push them to such length must be far from amiable, and from affording any repose to herself.\nSuch was the home which was to put Mansfield out of her head, and teach her to think of her cousin Edmund with moderated feelings. On the contrary, she could think of nothing but Mansfield, its beloved inmates, its happy ways. Everything where she now was in full contrast to it. The elegance, propriety, regularity, harmony, and perhaps, above all, the peace and tranquillity of Mansfield, were brought to her remembrance every hour of the day, by the prevalence of everything opposite to them _here_.\nThe living in incessant noise was, to a frame and temper delicate and nervous like Fanny's, an evil which no superadded elegance or harmony could have entirely atoned for. It was the greatest misery of all. At Mansfield, no sounds of contention, no raised voice, no abrupt bursts, no tread of violence, was ever heard; all proceeded in a regular course of cheerful orderliness; everybody had their due importance; everybody's feelings were consulted. If tenderness could be ever supposed wanting, good sense and good breeding supplied its place; and as to the little irritations sometimes introduced by aunt Norris, they were short, they were trifling, they were as a drop of water to the ocean, compared with the ceaseless tumult of her present abode. Here everybody was noisy, every voice was loud (excepting, perhaps, her mother's, which resembled the soft monotony of Lady Bertram's, only worn into fretfulness). Whatever was wanted was hallooed for, and the servants hallooed out their excuses from the kitchen. The doors were in constant banging, the stairs were never at rest, nothing was done without a clatter, nobody sat still, and nobody could command attention when they spoke.\nIn a review of the two houses, as they appeared to her before the end of a week, Fanny was tempted to apply to them Dr. Johnson's celebrated judgment as to matrimony and celibacy, and say, that though Mansfield Park might have some pains, Portsmouth could have no pleasures.",
        "paragraph_chars": [
            [
                0,
                682
            ],
            [
                682,
                1457
            ],
            [
                1457,
                2495
            ],
            [
                2495,
                3921
            ],
            [
                3921,
                4550
            ],
            [
                4550,
                5088
            ],
            [
                5088,
                5595
            ],
            [
                5595,
                6586
            ],
            [
                6586,
                7222
            ],
            [
                7222,
                7725
            ],
            [
                7725,
                8915
            ],
            [
                8915,
                9189
            ]
        ],
        "segment_chars": [
            [
                0,
                523
            ],
            [
                523,
                682
            ],
            [
                682,
                732
            ],
            [
                732,
                770
            ],
            [
                770,
                1002
            ],
            [
                1002,
                1177
            ],
            [
                1177,
                1244
            ],
            [
                1244,
                1290
            ],
            [
                1290,
                1361
            ],
            [
                1361,
                1422
            ],
            [
                1422,
                1457
            ],
            [
                1457,
                1625
            ],
            [
                1625,
                1679
            ],
            [
                1679,
                1748
            ],
            [
                1748,
                1800
            ],
            [
                1800,
                1974
            ],
            [
                1974,
                2235
            ],
            [
                2235,
                2340
            ],
            [
                2340,
                2495
            ],
            [
                2495,
                2595
            ],
            [
                2595,
                2675
            ],
            [
                2675,
                2884
            ],
            [
                2884,
                2976
            ],
            [
                2976,
                3082
            ],
            [
                3082,
                3124
            ],
            [
                3124,
                3244
            ],
            [
                3244,
                3289
            ],
            [
                3289,
                3465
            ],
            [
                3465,
                3547
            ],
            [
                3547,
                3921
            ],
            [
                3921,
                4008
            ],
            [
                4008,
                4113
            ],
            [
                4113,
                4383
            ],
            [
                4383,
                4550
            ],
            [
                4550,
                4603
            ],
            [
                4603,
                5088
            ],
            [
                5088,
                5481
            ],
            [
                5481,
                5595
            ],
            [
                5595,
                6256
            ],
            [
                6256,
                6422
            ],
            [
                6422,
                6586
            ],
            [
                6586,
                6874
            ],
            [
                6874,
                7222
            ],
            [
                7222,
                7353
            ],
            [
                7353,
                7449
            ],
            [
                7449,
                7502
            ],
            [
                7502,
                7725
            ],
            [
                7725,
                7897
            ],
            [
                7897,
                7932
            ],
            [
                7932,
                8176
            ],
            [
                8176,
                8478
            ],
            [
                8478,
                8642
            ],
            [
                8642,
                8742
            ],
            [
                8742,
                8915
            ],
            [
                8915,
                9189
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                31,
                51
            ],
            [
                96,
                130
            ],
            [
                138,
                157
            ],
            [
                177,
                308
            ],
            [
                438,
                442
            ],
            [
                455,
                460
            ],
            [
                496,
                510
            ],
            [
                521,
                523
            ],
            [
                523,
                605
            ],
            [
                644,
                682
            ],
            [
                682,
                732
            ],
            [
                752,
                770
            ],
            [
                770,
                800
            ],
            [
                823,
                826
            ],
            [
                834,
                857
            ],
            [
                888,
                945
            ],
            [
                956,
                967
            ],
            [
                1000,
                1002
            ],
            [
                1002,
                1089
            ],
            [
                1123,
                1159
            ],
            [
                1175,
                1177
            ],
            [
                1177,
                1187
            ],
            [
                1204,
                1210
            ],
            [
                1214,
                1244
            ],
            [
                1244,
                1252
            ],
            [
                1261,
                1276
            ],
            [
                1332,
                1361
            ],
            [
                1361,
                1420
            ],
            [
                1457,
                1478
            ],
            [
                1500,
                1503
            ],
            [
                1483,
                1487
            ],
            [
                1507,
                1510
            ],
            [
                1577,
                1625
            ],
            [
                1625,
                1679
            ],
            [
                1679,
                1748
            ],
            [
                1748,
                1800
            ],
            [
                1803,
                1813
            ],
            [
                1860,
                1974
            ],
            [
                1974,
                1984
            ],
            [
                1990,
                1999
            ],
            [
                2023,
                2024
            ],
            [
                2000,
                2023
            ],
            [
                2065,
                2111
            ],
            [
                2186,
                2235
            ],
            [
                2235,
                2338
            ],
            [
                2410,
                2495
            ],
            [
                2495,
                2540
            ],
            [
                2542,
                2547
            ],
            [
                2549,
                2595
            ],
            [
                2675,
                2705
            ],
            [
                2792,
                2857
            ],
            [
                2864,
                2884
            ],
            [
                2976,
                3011
            ],
            [
                3018,
                3082
            ],
            [
                3082,
                3124
            ],
            [
                3124,
                3160
            ],
            [
                3164,
                3244
            ],
            [
                3244,
                3289
            ],
            [
                3289,
                3421
            ],
            [
                3463,
                3465
            ],
            [
                3547,
                3592
            ],
            [
                3597,
                3624
            ],
            [
                3687,
                3688
            ],
            [
                3644,
                3647
            ],
            [
                3752,
                3818
            ],
            [
                3737,
                3739
            ],
            [
                3884,
                3921
            ],
            [
                3941,
                3951
            ],
            [
                3967,
                3989
            ],
            [
                3962,
                3966
            ],
            [
                3990,
                4008
            ],
            [
                4008,
                4087
            ],
            [
                4111,
                4113
            ],
            [
                4383,
                4386
            ],
            [
                4129,
                4142
            ],
            [
                4152,
                4179
            ],
            [
                4181,
                4186
            ],
            [
                4460,
                4550
            ],
            [
                4567,
                4586
            ],
            [
                4562,
                4566
            ],
            [
                4601,
                4603
            ],
            [
                4603,
                4623
            ],
            [
                4629,
                4632
            ],
            [
                4636,
                4659
            ],
            [
                4668,
                4692
            ],
            [
                4704,
                4722
            ],
            [
                4732,
                4836
            ],
            [
                4852,
                4944
            ],
            [
                4660,
                4663
            ],
            [
                4945,
                4976
            ],
            [
                5086,
                5088
            ],
            [
                5088,
                5158
            ],
            [
                5272,
                5331
            ],
            [
                5340,
                5354
            ],
            [
                5392,
                5442
            ],
            [
                5444,
                5480
            ],
            [
                5595,
                5728
            ],
            [
                5733,
                5736
            ],
            [
                5751,
                5776
            ],
            [
                5864,
                5873
            ],
            [
                5821,
                5827
            ],
            [
                5833,
                5843
            ],
            [
                5777,
                5800
            ],
            [
                5896,
                5937
            ],
            [
                5951,
                5969
            ],
            [
                6254,
                6256
            ],
            [
                6386,
                6389
            ],
            [
                6274,
                6320
            ],
            [
                6402,
                6404
            ],
            [
                6327,
                6355
            ],
            [
                6420,
                6422
            ],
            [
                6422,
                6505
            ],
            [
                6517,
                6586
            ],
            [
                6586,
                6673
            ],
            [
                6680,
                6697
            ],
            [
                6713,
                6800
            ],
            [
                6829,
                6874
            ],
            [
                6878,
                6922
            ],
            [
                6928,
                6991
            ],
            [
                7001,
                7029
            ],
            [
                7091,
                7101
            ],
            [
                7106,
                7117
            ],
            [
                7154,
                7178
            ],
            [
                7220,
                7222
            ],
            [
                7222,
                7282
            ],
            [
                7351,
                7353
            ],
            [
                7353,
                7449
            ],
            [
                7502,
                7526
            ],
            [
                7539,
                7551
            ],
            [
                7561,
                7655
            ],
            [
                7666,
                7716
            ],
            [
                7718,
                7722
            ],
            [
                7725,
                7728
            ],
            [
                7739,
                7764
            ],
            [
                7782,
                7790
            ],
            [
                7775,
                7781
            ],
            [
                7803,
                7816
            ],
            [
                7904,
                7932
            ],
            [
                7932,
                7948
            ],
            [
                7974,
                7986
            ],
            [
                8004,
                8043
            ],
            [
                8139,
                8176
            ],
            [
                8176,
                8221
            ],
            [
                8237,
                8303
            ],
            [
                8398,
                8400
            ],
            [
                8328,
                8350
            ],
            [
                8368,
                8376
            ],
            [
                8419,
                8470
            ],
            [
                8476,
                8478
            ],
            [
                8478,
                8558
            ],
            [
                8639,
                8642
            ],
            [
                8642,
                8742
            ],
            [
                8742,
                8915
            ],
            [
                8977,
                9016
            ],
            [
                9099,
                9189
            ]
        ],
        "row_chars": [
            [
                0,
                523
            ],
            [
                523,
                682
            ],
            [
                682,
                732
            ],
            [
                732,
                770
            ],
            [
                770,
                1002
            ],
            [
                1002,
                1177
            ],
            [
                1177,
                1244
            ],
            [
                1244,
                1361
            ],
            [
                1361,
                1422
            ],
            [
                1422,
                1457
            ],
            [
                1457,
                1625
            ],
            [
                1625,
                1679
            ],
            [
                1679,
                1748
            ],
            [
                1748,
                1800
            ],
            [
                1800,
                1974
            ],
            [
                1974,
                2235
            ],
            [
                2235,
                2495
            ],
            [
                2495,
                2595
            ],
            [
                2595,
                2675
            ],
            [
                2675,
                2884
            ],
            [
                2884,
                2976
            ],
            [
                2976,
                3082
            ],
            [
                3082,
                3124
            ],
            [
                3124,
                3244
            ],
            [
                3244,
                3289
            ],
            [
                3289,
                3465
            ],
            [
                3465,
                3547
            ],
            [
                3547,
                3921
            ],
            [
                3921,
                4008
            ],
            [
                4008,
                4113
            ],
            [
                4113,
                4550
            ],
            [
                4550,
                4603
            ],
            [
                4603,
                5088
            ],
            [
                5088,
                5481
            ],
            [
                5481,
                5595
            ],
            [
                5595,
                6256
            ],
            [
                6256,
                6422
            ],
            [
                6422,
                6586
            ],
            [
                6586,
                6874
            ],
            [
                6874,
                7222
            ],
            [
                7222,
                7353
            ],
            [
                7353,
                7449
            ],
            [
                7449,
                7502
            ],
            [
                7502,
                7725
            ],
            [
                7725,
                7932
            ],
            [
                7932,
                8176
            ],
            [
                8176,
                8478
            ],
            [
                8478,
                8642
            ],
            [
                8642,
                8742
            ],
            [
                8742,
                8915
            ],
            [
                8915,
                9189
            ]
        ]
    },
    "abridged": {
        "text": "Could Sir Thomas have seen his niece's feelings, he would not have despaired; for despite a good night's rest, the hope of soon seeing William again, and the comparatively quiet state of the house, from Tom and Charles being gone to school, home still held many drawbacks. Could he have seen only half that she felt before the end of a week, he would have been delighted with his own sagacity.\nBefore the week ended, it was all disappointment. William was gone. The Thrush had had her orders, and sailed within four days; and during those days she had seen him only twice, in a hurried way. There had been no free conversation, no walk on the ramparts, no visit to the dockyard, nothing of all that they had planned. Everything failed, except William's affection. His last words on leaving home were: \"Take care of Fanny, mother. She is tender, and not used to rough it like the rest of us.\"\nWilliam was gone: and her home was the very reverse of what she could have wished. It was the abode of noise, disorder, and impropriety. Nobody was in their right place, nothing was done as it ought to be. She could not respect her parents as she had hoped. Her father was more negligent of his family, his habits were worse, and his manners coarser, than she had been prepared for. He did not lack abilities, but he had no curiosity; he read only the newspaper and the navy-list; he swore and he drank, he was dirty and gross. She had never been able to recall anything approaching to tenderness in his former treatment of herself; and now he scarcely ever noticed her, but to make her the object of a coarse joke.\nHer disappointment in her mother was greater: there she had hoped much, and found almost nothing. Mrs. Price was not unkind; but her daughter never met with greater kindness from her than on the day of her arrival. Her heart and her time were already full; she had neither leisure nor affection to bestow on Fanny. Her daughters never had been much to her. She was fond of her sons, especially William, but Betsey was the first of her girls whom she had ever much regarded. To her she was most injudiciously indulgent. William was her pride; Betsey her darling; and John, Richard, Sam, Tom, and Charles occupied all the rest of her maternal solicitude. Her days were spent in a kind of slow bustle; she was busy without getting on; and dissatisfied with her servants, without skill to make them better, or any power of engaging their respect.\nMrs. Price resembled Lady Bertram more than Mrs. Norris. She was a manager by necessity, without any of Mrs. Norris's inclination for it. She was naturally indolent, like Lady Bertram; and Mrs. Norris would have been a more respectable mother of nine children on a small income.\nFanny could not but feel this. She might scruple to use the words, but she must feel that her mother was an ill-judging parent, a slattern, who neither taught nor restrained her children, whose house was the scene of mismanagement from beginning to end, and who had no talent, no conversation, no affection towards herself; and no curiosity to know her better.\nFanny was very anxious to be useful, and not to appear above her home, and therefore set about working for Sam immediately; and by sewing early and late, did so much that the boy was shipped off at last with more than half his linen ready.\nSam, loud and overbearing as he was, she rather regretted when he went, for he was clever and intelligent, and glad to be employed in errands; and though spurning the ill-timed though reasonable remonstrances of Susan, he was beginning to be influenced by Fanny's gentle persuasions. She despaired of making the smallest impression on Tom or Charles; they were quite untameable. Every afternoon brought a return of their riotous games all over the house; and she learned to sigh at the approach of Saturday's constant half-holiday.\nBetsey, too, a spoiled child, trained up to think the alphabet her greatest enemy, left with the servants, and then encouraged to report any evil of them, she was almost as ready to despair of; and of Susan's temper she had many doubts. Susan's continual disagreements with her mother, her squabbles with Tom and Charles, and petulance with Betsey, were so distressing to Fanny that she feared Susan's disposition must be far from amiable.\nSuch was the home which was to put Mansfield out of her head. On the contrary, she could think of nothing but Mansfield, its beloved inmates, its happy ways. The elegance, propriety, harmony, and above all, the peace and tranquillity of Mansfield, were brought to her remembrance every hour, by the prevalence of everything opposite to them here.\nThe incessant noise was, to a delicate temper like Fanny's, the greatest misery of all. At Mansfield, no raised voice, no tread of violence, was ever heard; everybody's feelings were consulted. If tenderness could be ever supposed wanting, good breeding supplied its place; and as to the little irritations of aunt Norris, they were trifling, compared with the ceaseless tumult of her present home. Here everybody was noisy, every voice was loud (excepting, perhaps, her mother's). Whatever was wanted was hallooed for, and the servants hallooed out their excuses from the kitchen. The doors were in constant banging, the stairs were never at rest, nothing was done without a clatter, nobody sat still, and nobody could command attention when they spoke.\nAt the end of a week, Fanny was tempted to say, that though Mansfield Park might have some pains, Portsmouth could have no pleasures.",
        "paragraph_chars": [
            [
                0,
                394
            ],
            [
                394,
                892
            ],
            [
                892,
                1608
            ],
            [
                1608,
                2451
            ],
            [
                2451,
                2730
            ],
            [
                2730,
                3091
            ],
            [
                3091,
                3331
            ],
            [
                3331,
                3863
            ],
            [
                3863,
                4303
            ],
            [
                4303,
                4650
            ],
            [
                4650,
                5405
            ],
            [
                5405,
                5538
            ]
        ],
        "segment_chars": [
            [
                0,
                273
            ],
            [
                273,
                394
            ],
            [
                394,
                444
            ],
            [
                444,
                462
            ],
            [
                462,
                591
            ],
            [
                591,
                717
            ],
            [
                717,
                764
            ],
            [
                764,
                830
            ],
            [
                830,
                892
            ],
            [
                892,
                975
            ],
            [
                975,
                1029
            ],
            [
                1029,
                1098
            ],
            [
                1098,
                1150
            ],
            [
                1150,
                1275
            ],
            [
                1275,
                1420
            ],
            [
                1420,
                1608
            ],
            [
                1608,
                1706
            ],
            [
                1706,
                1823
            ],
            [
                1823,
                1923
            ],
            [
                1923,
                1965
            ],
            [
                1965,
                2082
            ],
            [
                2082,
                2127
            ],
            [
                2127,
                2261
            ],
            [
                2261,
                2451
            ],
            [
                2451,
                2508
            ],
            [
                2508,
                2589
            ],
            [
                2589,
                2730
            ],
            [
                2730,
                2761
            ],
            [
                2761,
                3091
            ],
            [
                3091,
                3331
            ],
            [
                3331,
                3615
            ],
            [
                3615,
                3710
            ],
            [
                3710,
                3863
            ],
            [
                3863,
                4100
            ],
            [
                4100,
                4303
            ],
            [
                4303,
                4365
            ],
            [
                4365,
                4461
            ],
            [
                4461,
                4650
            ],
            [
                4650,
                4738
            ],
            [
                4738,
                4844
            ],
            [
                4844,
                5049
            ],
            [
                5049,
                5132
            ],
            [
                5132,
                5232
            ],
            [
                5232,
                5405
            ],
            [
                5405,
                5538
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                27,
                47
            ],
            [
                47,
                81
            ],
            [
                90,
                109
            ],
            [
                109,
                240
            ],
            [
                241,
                245
            ],
            [
                246,
                251
            ],
            [
                257,
                271
            ],
            [
                271,
                273
            ],
            [
                273,
                355
            ],
            [
                356,
                394
            ],
            [
                394,
                444
            ],
            [
                444,
                462
            ],
            [
                462,
                492
            ],
            [
                493,
                496
            ],
            [
                497,
                520
            ],
            [
                520,
                577
            ],
            [
                578,
                589
            ],
            [
                589,
                591
            ],
            [
                591,
                678
            ],
            [
                679,
                715
            ],
            [
                715,
                717
            ],
            [
                717,
                727
            ],
            [
                728,
                734
            ],
            [
                734,
                764
            ],
            [
                764,
                772
            ],
            [
                779,
                794
            ],
            [
                801,
                830
            ],
            [
                830,
                889
            ],
            [
                892,
                913
            ],
            [
                914,
                917
            ],
            [
                918,
                922
            ],
            [
                923,
                926
            ],
            [
                927,
                975
            ],
            [
                975,
                1029
            ],
            [
                1029,
                1098
            ],
            [
                1098,
                1150
            ],
            [
                1150,
                1160
            ],
            [
                1161,
                1275
            ],
            [
                1275,
                1285
            ],
            [
                1291,
                1300
            ],
            [
                1300,
                1301
            ],
            [
                1302,
                1325
            ],
            [
                1325,
                1371
            ],
            [
                1371,
                1420
            ],
            [
                1420,
                1523
            ],
            [
                1523,
                1608
            ],
            [
                1608,
                1653
            ],
            [
                1654,
                1659
            ],
            [
                1660,
                1706
            ],
            [
                1706,
                1736
            ],
            [
                1737,
                1802
            ],
            [
                1803,
                1823
            ],
            [
                1823,
                1858
            ],
            [
                1859,
                1923
            ],
            [
                1923,
                1965
            ],
            [
                1965,
                2001
            ],
            [
                2002,
                2082
            ],
            [
                2082,
                2127
            ],
            [
                2127,
                2259
            ],
            [
                2259,
                2261
            ],
            [
                2261,
                2306
            ],
            [
                2311,
                2338
            ],
            [
                2338,
                2339
            ],
            [
                2340,
                2343
            ],
            [
                2344,
                2410
            ],
            [
                2411,
                2413
            ],
            [
                2414,
                2451
            ],
            [
                2451,
                2461
            ],
            [
                2462,
                2484
            ],
            [
                2485,
                2489
            ],
            [
                2490,
                2508
            ],
            [
                2508,
                2587
            ],
            [
                2587,
                2589
            ],
            [
                2589,
                2592
            ],
            [
                2593,
                2606
            ],
            [
                2607,
                2634
            ],
            [
                2634,
                2639
            ],
            [
                2640,
                2730
            ],
            [
                2730,
                2749
            ],
            [
                2755,
                2759
            ],
            [
                2759,
                2761
            ],
            [
                2761,
                2781
            ],
            [
                2782,
                2785
            ],
            [
                2786,
                2809
            ],
            [
                2810,
                2834
            ],
            [
                2838,
                2856
            ],
            [
                2856,
                2960
            ],
            [
                2961,
                3053
            ],
            [
                3054,
                3057
            ],
            [
                3058,
                3089
            ],
            [
                3089,
                3091
            ],
            [
                3091,
                3161
            ],
            [
                3162,
                3221
            ],
            [
                3229,
                3243
            ],
            [
                3243,
                3293
            ],
            [
                3294,
                3330
            ],
            [
                3331,
                3464
            ],
            [
                3465,
                3468
            ],
            [
                3472,
                3497
            ],
            [
                3498,
                3507
            ],
            [
                3508,
                3514
            ],
            [
                3515,
                3525
            ],
            [
                3526,
                3549
            ],
            [
                3553,
                3594
            ],
            [
                3595,
                3613
            ],
            [
                3613,
                3615
            ],
            [
                3615,
                3618
            ],
            [
                3619,
                3665
            ],
            [
                3670,
                3672
            ],
            [
                3680,
                3708
            ],
            [
                3708,
                3710
            ],
            [
                3710,
                3793
            ],
            [
                3794,
                3863
            ],
            [
                3863,
                3950
            ],
            [
                3951,
                3968
            ],
            [
                3968,
                4055
            ],
            [
                4055,
                4100
            ],
            [
                4108,
                4152
            ],
            [
                4153,
                4216
            ],
            [
                4217,
                4245
            ],
            [
                4246,
                4256
            ],
            [
                4265,
                4276
            ],
            [
                4277,
                4301
            ],
            [
                4301,
                4303
            ],
            [
                4303,
                4363
            ],
            [
                4363,
                4365
            ],
            [
                4365,
                4461
            ],
            [
                4461,
                4485
            ],
            [
                4486,
                4498
            ],
            [
                4499,
                4593
            ],
            [
                4593,
                4643
            ],
            [
                4644,
                4648
            ],
            [
                4650,
                4653
            ],
            [
                4654,
                4679
            ],
            [
                4680,
                4688
            ],
            [
                4689,
                4695
            ],
            [
                4696,
                4709
            ],
            [
                4710,
                4738
            ],
            [
                4738,
                4754
            ],
            [
                4755,
                4767
            ],
            [
                4767,
                4806
            ],
            [
                4807,
                4844
            ],
            [
                4844,
                4889
            ],
            [
                4890,
                4956
            ],
            [
                4957,
                4959
            ],
            [
                4960,
                4982
            ],
            [
                4983,
                4991
            ],
            [
                4991,
                5042
            ],
            [
                5047,
                5049
            ],
            [
                5049,
                5129
            ],
            [
                5129,
                5132
            ],
            [
                5132,
                5232
            ],
            [
                5232,
                5405
            ],
            [
                5408,
                5447
            ],
            [
                5448,
                5538
            ]
        ],
        "row_chars": [
            [
                0,
                273
            ],
            [
                273,
                394
            ],
            [
                394,
                444
            ],
            [
                444,
                462
            ],
            [
                462,
                591
            ],
            [
                591,
                717
            ],
            [
                717,
                764
            ],
            [
                764,
                830
            ],
            [
                830,
                892
            ],
            [
                892,
                892
            ],
            [
                892,
                975
            ],
            [
                975,
                1029
            ],
            [
                1029,
                1098
            ],
            [
                1098,
                1150
            ],
            [
                1150,
                1275
            ],
            [
                1275,
                1420
            ],
            [
                1420,
                1608
            ],
            [
                1608,
                1706
            ],
            [
                1706,
                1706
            ],
            [
                1706,
                1823
            ],
            [
                1823,
                1823
            ],
            [
                1823,
                1923
            ],
            [
                1923,
                1965
            ],
            [
                1965,
                2082
            ],
            [
                2082,
                2127
            ],
            [
                2127,
                2261
            ],
            [
                2261,
                2261
            ],
            [
                2261,
                2451
            ],
            [
                2451,
                2508
            ],
            [
                2508,
                2589
            ],
            [
                2589,
                2730
            ],
            [
                2730,
                2761
            ],
            [
                2761,
                3091
            ],
            [
                3091,
                3331
            ],
            [
                3331,
                3331
            ],
            [
                3331,
                3615
            ],
            [
                3615,
                3710
            ],
            [
                3710,
                3863
            ],
            [
                3863,
                4100
            ],
            [
                4100,
                4303
            ],
            [
                4303,
                4365
            ],
            [
                4365,
                4461
            ],
            [
                4461,
                4461
            ],
            [
                4461,
                4650
            ],
            [
                4650,
                4738
            ],
            [
                4738,
                4844
            ],
            [
                4844,
                5049
            ],
            [
                5049,
                5132
            ],
            [
                5132,
                5232
            ],
            [
                5232,
                5405
            ],
            [
                5405,
                5538
            ]
        ]
    }
}