{
    "original": {
        "text": "Fanny was right enough in not expecting to hear from Miss Crawford now at the rapid rate in which their correspondence had begun; Mary's next letter was after a decidedly longer interval than the last, but she was not right in supposing that such an interval would be felt a great relief to herself. Here was another strange revolution of mind! She was really glad to receive the letter when it did come. In her present exile from good society, and distance from everything that had been wont to interest her, a letter from one belonging to the set where her heart lived, written with affection, and some degree of elegance, was thoroughly acceptable. The usual plea of increasing engagements was made in excuse for not having written to her earlier; \"And now that I have begun,\" she continued, \"my letter will not be worth your reading, for there will be no little offering of love at the end, no three or four lines _passionnes_ from the most devoted H. C. in the world, for Henry is in Norfolk; business called him to Everingham ten days ago, or perhaps he only pretended the call, for the sake of being travelling at the same time that you were. But there he is, and, by the bye, his absence may sufficiently account for any remissness of his sister's in writing, for there has been no 'Well, Mary, when do you write to Fanny? Is not it time for you to write to Fanny?' to spur me on. At last, after various attempts at meeting, I have seen your cousins, 'dear Julia and dearest Mrs. Rushworth'; they found me at home yesterday, and we were glad to see each other again. We _seemed_ _very_ glad to see each other, and I do really think we were a little. We had a vast deal to say. Shall I tell you how Mrs. Rushworth looked when your name was mentioned? I did not use to think her wanting in self-possession, but she had not quite enough for the demands of yesterday. Upon the whole, Julia was in the best looks of the two, at least after you were spoken of. There was no recovering the complexion from the moment that I spoke of 'Fanny,' and spoke of her as a sister should. But Mrs. Rushworth's day of good looks will come; we have cards for her first party on the 28th. Then she will be in beauty, for she will open one of the best houses in Wimpole Street. I was in it two years ago, when it was Lady Lascelle's, and prefer it to almost any I know in London, and certainly she will then feel, to use a vulgar phrase, that she has got her pennyworth for her penny. Henry could not have afforded her such a house. I hope she will recollect it, and be satisfied, as well as she may, with moving the queen of a palace, though the king may appear best in the background; and as I have no desire to tease her, I shall never _force_ your name upon her again. She will grow sober by degrees. From all that I hear and guess, Baron Wildenheim's attentions to Julia continue, but I do not know that he has any serious encouragement. She ought to do better. A poor honourable is no catch, and I cannot imagine any liking in the case, for take away his rants, and the poor baron has nothing. What a difference a vowel makes! If his rents were but equal to his rants! Your cousin Edmund moves slowly; detained, perchance, by parish duties. There may be some old woman at Thornton Lacey to be converted. I am unwilling to fancy myself neglected for a _young_ one. Adieu! my dear sweet Fanny, this is a long letter from London: write me a pretty one in reply to gladden Henry's eyes, when he comes back, and send me an account of all the dashing young captains whom you disdain for his sake.\"\nThere was great food for meditation in this letter, and chiefly for unpleasant meditation; and yet, with all the uneasiness it supplied, it connected her with the absent, it told her of people and things about whom she had never felt so much curiosity as now, and she would have been glad to have been sure of such a letter every week. Her correspondence with her aunt Bertram was her only concern of higher interest.\nAs for any society in Portsmouth, that could at all make amends for deficiencies at home, there were none within the circle of her father's and mother's acquaintance to afford her the smallest satisfaction: she saw nobody in whose favour she could wish to overcome her own shyness and reserve. The men appeared to her all coarse, the women all pert, everybody underbred; and she gave as little contentment as she received from introductions either to old or new acquaintance. The young ladies who approached her at first with some respect, in consideration of her coming from a baronet's family, were soon offended by what they termed \"airs\"; for, as she neither played on the pianoforte nor wore fine pelisses, they could, on farther observation, admit no right of superiority.\nThe first solid consolation which Fanny received for the evils of home, the first which her judgment could entirely approve, and which gave any promise of durability, was in a better knowledge of Susan, and a hope of being of service to her. Susan had always behaved pleasantly to herself, but the determined character of her general manners had astonished and alarmed her, and it was at least a fortnight before she began to understand a disposition so totally different from her own. Susan saw that much was wrong at home, and wanted to set it right. That a girl of fourteen, acting only on her own unassisted reason, should err in the method of reform, was not wonderful; and Fanny soon became more disposed to admire the natural light of the mind which could so early distinguish justly, than to censure severely the faults of conduct to which it led. Susan was only acting on the same truths, and pursuing the same system, which her own judgment acknowledged, but which her more supine and yielding temper would have shrunk from asserting. Susan tried to be useful, where _she_ could only have gone away and cried; and that Susan was useful she could perceive; that things, bad as they were, would have been worse but for such interposition, and that both her mother and Betsey were restrained from some excesses of very offensive indulgence and vulgarity.\nIn every argument with her mother, Susan had in point of reason the advantage, and never was there any maternal tenderness to buy her off. The blind fondness which was for ever producing evil around her she had never known. There was no gratitude for affection past or present to make her better bear with its excesses to the others.\nAll this became gradually evident, and gradually placed Susan before her sister as an object of mingled compassion and respect. That her manner was wrong, however, at times very wrong, her measures often ill-chosen and ill-timed, and her looks and language very often indefensible, Fanny could not cease to feel; but she began to hope they might be rectified. Susan, she found, looked up to her and wished for her good opinion; and new as anything like an office of authority was to Fanny, new as it was to imagine herself capable of guiding or informing any one, she did resolve to give occasional hints to Susan, and endeavour to exercise for her advantage the juster notions of what was due to everybody, and what would be wisest for herself, which her own more favoured education had fixed in her.\nHer influence, or at least the consciousness and use of it, originated in an act of kindness by Susan, which, after many hesitations of delicacy, she at last worked herself up to. It had very early occurred to her that a small sum of money might, perhaps, restore peace for ever on the sore subject of the silver knife, canvassed as it now was continually, and the riches which she was in possession of herself, her uncle having given her 10 at parting, made her as able as she was willing to be generous. But she was so wholly unused to confer favours, except on the very poor, so unpractised in removing evils, or bestowing kindnesses among her equals, and so fearful of appearing to elevate herself as a great lady at home, that it took some time to determine that it would not be unbecoming in her to make such a present. It was made, however, at last: a silver knife was bought for Betsey, and accepted with great delight, its newness giving it every advantage over the other that could be desired; Susan was established in the full possession of her own, Betsey handsomely declaring that now she had got one so much prettier herself, she should never want _that_ again; and no reproach seemed conveyed to the equally satisfied mother, which Fanny had almost feared to be impossible. The deed thoroughly answered: a source of domestic altercation was entirely done away, and it was the means of opening Susan's heart to her, and giving her something more to love and be interested in. Susan shewed that she had delicacy: pleased as she was to be mistress of property which she had been struggling for at least two years, she yet feared that her sister's judgment had been against her, and that a reproof was designed her for having so struggled as to make the purchase necessary for the tranquillity of the house.\nHer temper was open. She acknowledged her fears, blamed herself for having contended so warmly; and from that hour Fanny, understanding the worth of her disposition and perceiving how fully she was inclined to seek her good opinion and refer to her judgment, began to feel again the blessing of affection, and to entertain the hope of being useful to a mind so much in need of help, and so much deserving it. She gave advice, advice too sound to be resisted by a good understanding, and given so mildly and considerately as not to irritate an imperfect temper, and she had the happiness of observing its good effects not unfrequently. More was not expected by one who, while seeing all the obligation and expediency of submission and forbearance, saw also with sympathetic acuteness of feeling all that must be hourly grating to a girl like Susan. Her greatest wonder on the subject soon became-not that Susan should have been provoked into disrespect and impatience against her better knowledge-but that so much better knowledge, so many good notions should have been hers at all; and that, brought up in the midst of negligence and error, she should have formed such proper opinions of what ought to be; she, who had had no cousin Edmund to direct her thoughts or fix her principles.\nThe intimacy thus begun between them was a material advantage to each. By sitting together upstairs, they avoided a great deal of the disturbance of the house; Fanny had peace, and Susan learned to think it no misfortune to be quietly employed. They sat without a fire; but that was a privation familiar even to Fanny, and she suffered the less because reminded by it of the East room. It was the only point of resemblance. In space, light, furniture, and prospect, there was nothing alike in the two apartments; and she often heaved a sigh at the remembrance of all her books and boxes, and various comforts there. By degrees the girls came to spend the chief of the morning upstairs, at first only in working and talking, but after a few days, the remembrance of the said books grew so potent and stimulative that Fanny found it impossible not to try for books again. There were none in her father's house; but wealth is luxurious and daring, and some of hers found its way to a circulating library. She became a subscriber; amazed at being anything _in propria persona_, amazed at her own doings in every way, to be a renter, a chuser of books! And to be having any one's improvement in view in her choice! But so it was. Susan had read nothing, and Fanny longed to give her a share in her own first pleasures, and inspire a taste for the biography and poetry which she delighted in herself.\nIn this occupation she hoped, moreover, to bury some of the recollections of Mansfield, which were too apt to seize her mind if her fingers only were busy; and, especially at this time, hoped it might be useful in diverting her thoughts from pursuing Edmund to London, whither, on the authority of her aunt's last letter, she knew he was gone. She had no doubt of what would ensue. The promised notification was hanging over her head. The postman's knock within the neighbourhood was beginning to bring its daily terrors, and if reading could banish the idea for even half an hour, it was something gained.",
        "paragraph_chars": [
            [
                0,
                3585
            ],
            [
                3585,
                4003
            ],
            [
                4003,
                4782
            ],
            [
                4782,
                6144
            ],
            [
                6144,
                6478
            ],
            [
                6478,
                7280
            ],
            [
                7280,
                9099
            ],
            [
                9099,
                10385
            ],
            [
                10385,
                11780
            ],
            [
                11780,
                12386
            ]
        ],
        "segment_chars": [
            [
                0,
                300
            ],
            [
                300,
                345
            ],
            [
                345,
                405
            ],
            [
                405,
                652
            ],
            [
                652,
                1150
            ],
            [
                1150,
                1331
            ],
            [
                1331,
                1374
            ],
            [
                1374,
                1389
            ],
            [
                1389,
                1575
            ],
            [
                1575,
                1658
            ],
            [
                1658,
                1685
            ],
            [
                1685,
                1758
            ],
            [
                1758,
                1872
            ],
            [
                1872,
                1963
            ],
            [
                1963,
                2080
            ],
            [
                2080,
                2177
            ],
            [
                2177,
                2265
            ],
            [
                2265,
                2472
            ],
            [
                2472,
                2520
            ],
            [
                2520,
                2760
            ],
            [
                2760,
                2792
            ],
            [
                2792,
                2930
            ],
            [
                2930,
                2954
            ],
            [
                2954,
                3087
            ],
            [
                3087,
                3120
            ],
            [
                3120,
                3162
            ],
            [
                3162,
                3234
            ],
            [
                3234,
                3297
            ],
            [
                3297,
                3357
            ],
            [
                3357,
                3364
            ],
            [
                3364,
                3585
            ],
            [
                3585,
                3921
            ],
            [
                3921,
                4003
            ],
            [
                4003,
                4297
            ],
            [
                4297,
                4479
            ],
            [
                4479,
                4782
            ],
            [
                4782,
                5024
            ],
            [
                5024,
                5268
            ],
            [
                5268,
                5335
            ],
            [
                5335,
                5638
            ],
            [
                5638,
                5827
            ],
            [
                5827,
                6144
            ],
            [
                6144,
                6283
            ],
            [
                6283,
                6368
            ],
            [
                6368,
                6478
            ],
            [
                6478,
                6606
            ],
            [
                6606,
                6838
            ],
            [
                6838,
                7280
            ],
            [
                7280,
                7460
            ],
            [
                7460,
                7786
            ],
            [
                7786,
                8106
            ],
            [
                8106,
                8569
            ],
            [
                8569,
                8770
            ],
            [
                8770,
                9099
            ],
            [
                9099,
                9120
            ],
            [
                9120,
                9508
            ],
            [
                9508,
                9734
            ],
            [
                9734,
                9947
            ],
            [
                9947,
                10385
            ],
            [
                10385,
                10456
            ],
            [
                10456,
                10630
            ],
            [
                10630,
                10771
            ],
            [
                10771,
                10809
            ],
            [
                10809,
                11001
            ],
            [
                11001,
                11255
            ],
            [
                11255,
                11387
            ],
            [
                11387,
                11533
            ],
            [
                11533,
                11595
            ],
            [
                11595,
                11610
            ],
            [
                11610,
                11780
            ],
            [
                11780,
                12124
            ],
            [
                12124,
                12162
            ],
            [
                12162,
                12215
            ],
            [
                12215,
                12386
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                23,
                66
            ],
            [
                128,
                267
            ],
            [
                273,
                287
            ],
            [
                298,
                300
            ],
            [
                300,
                345
            ],
            [
                345,
                405
            ],
            [
                405,
                443
            ],
            [
                508,
                594
            ],
            [
                445,
                448
            ],
            [
                615,
                651
            ],
            [
                795,
                836
            ],
            [
                777,
                779
            ],
            [
                793,
                794
            ],
            [
                751,
                752
            ],
            [
                838,
                893
            ],
            [
                931,
                972
            ],
            [
                977,
                996
            ],
            [
                1148,
                1150
            ],
            [
                1165,
                1170
            ],
            [
                1184,
                1199
            ],
            [
                1213,
                1224
            ],
            [
                1243,
                1255
            ],
            [
                1229,
                1239
            ],
            [
                1256,
                1331
            ],
            [
                1331,
                1362
            ],
            [
                1371,
                1374
            ],
            [
                1374,
                1389
            ],
            [
                1389,
                1396
            ],
            [
                1431,
                1497
            ],
            [
                1575,
                1577
            ],
            [
                1588,
                1592
            ],
            [
                1594,
                1658
            ],
            [
                1658,
                1685
            ],
            [
                1685,
                1758
            ],
            [
                1817,
                1834
            ],
            [
                1796,
                1811
            ],
            [
                1835,
                1872
            ],
            [
                1888,
                1963
            ],
            [
                2080,
                2137
            ],
            [
                2144,
                2177
            ],
            [
                2177,
                2265
            ],
            [
                2472,
                2520
            ],
            [
                2520,
                2535
            ],
            [
                2554,
                2566
            ],
            [
                2588,
                2592
            ],
            [
                2600,
                2642
            ],
            [
                2650,
                2672
            ],
            [
                2678,
                2725
            ],
            [
                2727,
                2732
            ],
            [
                2734,
                2760
            ],
            [
                2792,
                2812
            ],
            [
                2822,
                2876
            ],
            [
                2907,
                2930
            ],
            [
                2930,
                2954
            ],
            [
                2954,
                3005
            ],
            [
                3028,
                3062
            ],
            [
                3068,
                3087
            ],
            [
                3120,
                3137
            ],
            [
                3142,
                3162
            ],
            [
                3162,
                3234
            ],
            [
                3234,
                3297
            ],
            [
                3297,
                3343
            ],
            [
                3345,
                3350
            ],
            [
                3352,
                3357
            ],
            [
                3357,
                3364
            ],
            [
                3364,
                3383
            ],
            [
                3418,
                3437
            ],
            [
                3445,
                3474
            ],
            [
                3494,
                3585
            ],
            [
                3585,
                3635
            ],
            [
                3674,
                3755
            ],
            [
                3845,
                3881
            ],
            [
                3895,
                3921
            ],
            [
                3921,
                4003
            ],
            [
                4003,
                4036
            ],
            [
                4093,
                4108
            ],
            [
                4130,
                4133
            ],
            [
                4156,
                4208
            ],
            [
                4295,
                4297
            ],
            [
                4297,
                4351
            ],
            [
                4372,
                4424
            ],
            [
                4477,
                4479
            ],
            [
                4479,
                4541
            ],
            [
                4597,
                4704
            ],
            [
                4713,
                4725
            ],
            [
                4751,
                4759
            ],
            [
                4769,
                4782
            ],
            [
                4782,
                4791
            ],
            [
                4798,
                4852
            ],
            [
                4947,
                5024
            ],
            [
                5024,
                5062
            ],
            [
                5070,
                5138
            ],
            [
                5151,
                5166
            ],
            [
                5176,
                5267
            ],
            [
                5268,
                5335
            ],
            [
                5335,
                5359
            ],
            [
                5400,
                5445
            ],
            [
                5455,
                5471
            ],
            [
                5493,
                5502
            ],
            [
                5524,
                5572
            ],
            [
                5636,
                5638
            ],
            [
                5638,
                5678
            ],
            [
                5710,
                5715
            ],
            [
                5733,
                5765
            ],
            [
                5777,
                5827
            ],
            [
                5827,
                5858
            ],
            [
                5860,
                5863
            ],
            [
                5865,
                5946
            ],
            [
                5961,
                5978
            ],
            [
                5953,
                5959
            ],
            [
                5979,
                6000
            ],
            [
                6027,
                6032
            ],
            [
                6038,
                6117
            ],
            [
                6133,
                6144
            ],
            [
                6478,
                6493
            ],
            [
                6504,
                6573
            ],
            [
                6582,
                6606
            ],
            [
                6606,
                6625
            ],
            [
                6656,
                6734
            ],
            [
                6740,
                6838
            ],
            [
                6838,
                6843
            ],
            [
                6856,
                6916
            ],
            [
                6975,
                6977
            ],
            [
                6954,
                6966
            ],
            [
                6982,
                7019
            ],
            [
                7040,
                7085
            ],
            [
                7275,
                7280
            ],
            [
                7280,
                7293
            ],
            [
                7351,
                7372
            ],
            [
                7376,
                7412
            ],
            [
                7424,
                7460
            ],
            [
                7460,
                7466
            ],
            [
                7478,
                7598
            ],
            [
                7637,
                7657
            ],
            [
                7692,
                7701
            ],
            [
                7709,
                7718
            ],
            [
                7734,
                7742
            ],
            [
                7746,
                7750
            ],
            [
                7770,
                7786
            ],
            [
                7786,
                7832
            ],
            [
                7933,
                7997
            ],
            [
                8005,
                8032
            ],
            [
                8082,
                8105
            ],
            [
                8106,
                8135
            ],
            [
                8567,
                8568
            ],
            [
                8137,
                8260
            ],
            [
                8284,
                8441
            ],
            [
                8261,
                8265
            ],
            [
                8449,
                8459
            ],
            [
                8491,
                8494
            ],
            [
                8513,
                8519
            ],
            [
                8495,
                8512
            ],
            [
                8660,
                8701
            ],
            [
                8708,
                8720
            ],
            [
                8725,
                8770
            ],
            [
                8770,
                8775
            ],
            [
                8783,
                8805
            ],
            [
                8817,
                8824
            ],
            [
                8806,
                8813
            ],
            [
                8825,
                8842
            ],
            [
                8843,
                8851
            ],
            [
                8904,
                8909
            ],
            [
                8914,
                9005
            ],
            [
                9041,
                9053
            ],
            [
                9054,
                9099
            ],
            [
                9099,
                9120
            ],
            [
                9120,
                9146
            ],
            [
                9195,
                9198
            ],
            [
                9148,
                9173
            ],
            [
                9184,
                9186
            ],
            [
                9191,
                9193
            ],
            [
                9214,
                9234
            ],
            [
                9248,
                9251
            ],
            [
                9239,
                9244
            ],
            [
                9264,
                9282
            ],
            [
                9489,
                9493
            ],
            [
                9289,
                9292
            ],
            [
                9314,
                9330
            ],
            [
                9356,
                9366
            ],
            [
                9426,
                9464
            ],
            [
                9331,
                9334
            ],
            [
                9494,
                9503
            ],
            [
                9476,
                9480
            ],
            [
                9506,
                9508
            ],
            [
                9508,
                9516
            ],
            [
                9536,
                9541
            ],
            [
                9517,
                9524
            ],
            [
                9592,
                9715
            ],
            [
                9732,
                9734
            ],
            [
                9846,
                9849
            ],
            [
                9855,
                9859
            ],
            [
                9893,
                9947
            ],
            [
                9947,
                9966
            ],
            [
                9982,
                10065
            ],
            [
                10094,
                10103
            ],
            [
                10130,
                10304
            ],
            [
                10322,
                10341
            ],
            [
                10365,
                10385
            ],
            [
                10385,
                10421
            ],
            [
                10450,
                10456
            ],
            [
                10456,
                10498
            ],
            [
                10512,
                10582
            ],
            [
                10612,
                10630
            ],
            [
                10630,
                10669
            ],
            [
                10680,
                10688
            ],
            [
                10694,
                10720
            ],
            [
                10725,
                10770
            ],
            [
                10771,
                10809
            ],
            [
                10809,
                10925
            ],
            [
                10948,
                10965
            ],
            [
                10985,
                10993
            ],
            [
                10999,
                11001
            ],
            [
                11001,
                11035
            ],
            [
                11046,
                11070
            ],
            [
                11088,
                11130
            ],
            [
                11201,
                11255
            ],
            [
                11255,
                11297
            ],
            [
                11387,
                11410
            ],
            [
                11361,
                11385
            ],
            [
                11457,
                11468
            ],
            [
                11504,
                11515
            ],
            [
                11523,
                11533
            ],
            [
                11595,
                11610
            ],
            [
                11610,
                11697
            ],
            [
                11768,
                11770
            ],
            [
                11727,
                11747
            ],
            [
                11778,
                11780
            ],
            [
                11799,
                11819
            ],
            [
                11972,
                12007
            ],
            [
                12008,
                12048
            ],
            [
                12102,
                12117
            ],
            [
                12118,
                12124
            ],
            [
                12124,
                12154
            ],
            [
                12160,
                12162
            ],
            [
                12215,
                12234
            ],
            [
                12260,
                12282
            ],
            [
                12287,
                12342
            ],
            [
                12348,
                12386
            ]
        ],
        "row_chars": [
            [
                0,
                300
            ],
            [
                300,
                345
            ],
            [
                345,
                405
            ],
            [
                405,
                652
            ],
            [
                652,
                1150
            ],
            [
                1150,
                1331
            ],
            [
                1331,
                1374
            ],
            [
                1374,
                1389
            ],
            [
                1389,
                1575
            ],
            [
                1575,
                1658
            ],
            [
                1658,
                1685
            ],
            [
                1685,
                1758
            ],
            [
                1758,
                1872
            ],
            [
                1872,
                1963
            ],
            [
                1963,
                2080
            ],
            [
                2080,
                2177
            ],
            [
                2177,
                2265
            ],
            [
                2265,
                2472
            ],
            [
                2472,
                2520
            ],
            [
                2520,
                2760
            ],
            [
                2760,
                2792
            ],
            [
                2792,
                2930
            ],
            [
                2930,
                2954
            ],
            [
                2954,
                3087
            ],
            [
                3087,
                3120
            ],
            [
                3120,
                3162
            ],
            [
                3162,
                3234
            ],
            [
                3234,
                3297
            ],
            [
                3297,
                3357
            ],
            [
                3357,
                3364
            ],
            [
                3364,
                3585
            ],
            [
                3585,
                3921
            ],
            [
                3921,
                4003
            ],
            [
                4003,
                4297
            ],
            [
                4297,
                4479
            ],
            [
                4479,
                4782
            ],
            [
                4782,
                5024
            ],
            [
                5024,
                5268
            ],
            [
                5268,
                5335
            ],
            [
                5335,
                5638
            ],
            [
                5638,
                5827
            ],
            [
                5827,
                6144
            ],
            [
                6144,
                6283
            ],
            [
                6283,
                6368
            ],
            [
                6368,
                6478
            ],
            [
                6478,
                6606
            ],
            [
                6606,
                6838
            ],
            [
                6838,
                7280
            ],
            [
                7280,
                7460
            ],
            [
                7460,
                7786
            ],
            [
                7786,
                8106
            ],
            [
                8106,
                8569
            ],
            [
                8569,
                8770
            ],
            [
                8770,
                9099
            ],
            [
                9099,
                9120
            ],
            [
                9120,
                9508
            ],
            [
                9508,
                9734
            ],
            [
                9734,
                9947
            ],
            [
                9947,
                10385
            ],
            [
                10385,
                10456
            ],
            [
                10456,
                10630
            ],
            [
                10630,
                10771
            ],
            [
                10771,
                10809
            ],
            [
                10809,
                11001
            ],
            [
                11001,
                11255
            ],
            [
                11255,
                11533
            ],
            [
                11533,
                11595
            ],
            [
                11595,
                11610
            ],
            [
                11610,
                11780
            ],
            [
                11780,
                12124
            ],
            [
                12124,
                12162
            ],
            [
                12162,
                12215
            ],
            [
                12215,
                12386
            ]
        ]
    },
    "abridged": {
        "text": "Fanny was right in not expecting to hear from Miss Crawford so regularly; Mary's next letter was after a decidedly longer interval than the last, but she was not right in supposing that such an interval would be a great relief. Here was another strange revolution of mind! She was really glad to receive the letter when it did come. In her present exile from good society, a letter from one belonging to the set where her heart lived, written with affection and elegance, was thoroughly acceptable.\n\"My letter will not be worth your reading,\" Mary wrote, \"for there will be no little offering of love at the end from the most devoted H. C. in the world, as Henry is in Norfolk. Business called him to Everingham, and his absence may account for his sister's remissness in writing, for there has been no 'Well, Mary, when do you write to Fanny? Is not it time for you to write?' to spur me on. At last, I have seen your cousins, 'dear Julia and dearest Mrs. Rushworth'. We seemed very glad to see each other, and I do really think we were a little. We had a vast deal to say. Shall I tell you how Mrs. Rushworth looked when your name was mentioned? She had not quite self-possession enough for the demands of yesterday. Julia was in the best looks of the two, at least after you were spoken of. But Mrs. Rushworth's day of good looks will come; we have invitations for her first party on the 28th. Then she will be in beauty, for she will open one of the best houses in Wimpole Street. Henry could not have afforded her such a house. I hope she will be satisfied with being the queen of a palace, though the king may be best in the background. As I have no desire to tease her, I shall never force your name upon her again. From all that I hear, Baron Wildenheim's attentions to Julia continue, but without serious encouragement. She ought to do better. A poor honourable is no catch, and I cannot imagine that she likes him, for take away his rants, and the baron has nothing. If his rents were only equal to his rants! Your cousin Edmund moves slowly; detained, perchance, by parish duties. There may be some old woman at Thornton Lacey to be converted. I am unwilling to fancy myself neglected for a young one. Adieu! my dear sweet Fanny: write me a pretty reply to gladden Henry's eyes, and send me an account of all the dashing young captains whom you disdain for his sake.\"\nThere was great food for meditation in this letter; and yet, with all the uneasiness it supplied, it connected her with the absent, and she would have been glad to have such a letter every week. Her correspondence with her aunt Bertram was her only concern of higher interest.\nAs for any society in Portsmouth, there were none amongst her parents' acquaintance to afford her the smallest satisfaction. The men appeared to her all coarse, the women all pert; and she gave as little contentment as she received. The young ladies who approached her at first with some respect, were soon offended by what they termed \"airs\"; for, as she neither played on the pianoforte nor wore fine furs, they could admit no superiority.\nThe first consolation which Fanny received for the evils of home, was in a better knowledge of Susan, and a hope of being of service to her. Susan had always behaved pleasantly to Fanny, but the determined character of her general manners had astonished her, and it was a fortnight before she began to understand a disposition so totally different from her own.\nSusan saw that much was wrong at home, and wanted to set it right. That a girl of fourteen, without guidance, should err in the method of reform, was not extraordinary; and Fanny soon came to admire the mind which could so early distinguish justly. Susan was only acting on the same truths which Fanny herself acknowledged, but which her more yielding temper would have shrunk from asserting. Susan tried to be useful, where she could only have gone away and cried; and that Susan was useful she could perceive. Bad as they were, things would have been worse without her intervention, and both her mother and Betsey were restrained from some excesses of very offensive vulgarity.\nAll this became evident, and gradually placed Susan before her sister as an object of compassion and respect. That her manner was wrong, her measures often ill-chosen and ill-timed, and her looks and language often indefensible, Fanny could not cease to feel; but she began to hope they might be rectified. Susan looked up to her and wished for her good opinion; and new as it was to Fanny to imagine herself capable of guiding anyone, she did resolve to give occasional hints to her.\nHer influence began in an act of kindness to Susan, which, after many hesitations, she at last worked herself up to. It had occurred to her that a small sum of money might, perhaps, restore peace for ever on the sore subject of the silver knife; and the riches which her uncle had given her made her able to be generous. But she was so wholly unused to confer favours, and so fearful of appearing to elevate herself as a great lady, that it took some time to decide to make such a present.\nIt was made, however, at last. A silver knife was bought for Betsey, and accepted with great delight, its newness giving it every advantage over the other. Susan was established in the full possession of her own, Betsey handsomely declaring that now she had got one so much prettier herself, she should never want that again; and the mother was equally satisfied.\nIt was the means of opening Susan's heart, and giving Fanny something more to love and be interested in. Susan showed that she had delicacy: although she was pleased to be mistress of her property, she feared that her sister's judgment had been against her, and that a reproof was designed her in the purchase, made necessary for the tranquillity of the house.\nHer temper was open. She acknowledged her fears and blamed herself for having argued so heatedly. Fanny, understanding her worth and perceiving how much she wished for her good opinion, began to hope of being useful to a mind so much needing and deserving help. She gave sound advice, yet so mildly and considerately as not to irritate an imperfect temper, and she had the happiness of observing its good effects. She saw with acute sympathy all that must be hourly grating to a girl like Susan. Her greatest wonder soon became-not that Susan should have been provoked into disrespect and impatience-but that so many good notions should have been hers at all; and that, brought up in the midst of negligence and error, she should have formed such proper opinions of what ought to be; even with no cousin Edmund to fix her principles.\nThe intimacy thus begun between them benefited each. By sitting together upstairs, they avoided much of the disturbance of the house; Fanny had peace, and Susan learned to enjoy being quietly employed. They sat without a fire; but that was a hardship familiar to Fanny, and she suffered less because reminded by it of the East room.\nIt was the only point of resemblance. In space, light, furniture, and prospect, there was nothing alike in the two apartments; and she often heaved a sigh as she remembered all her books and comforts. By degrees the girls came to spend most of the morning upstairs, working and talking, but after a few days, Fanny found it impossible not to try for books again. There were none in her father's house; but she became a subscriber to a circulating library, amazed at becoming a renter, a chooser of books! But so it was. Susan had read nothing, and Fanny longed to give her a share in her own first pleasures in biography and poetry.\nShe hoped, moreover, that it might be useful in diverting her own thoughts from pursuing Edmund to London, where she knew he was now gone. She had no doubt of what would follow. The postman's knock was beginning to bring daily terrors, and if reading could banish the idea for half an hour, it was something gained.",
        "paragraph_chars": [
            [
                0,
                499
            ],
            [
                499,
                2379
            ],
            [
                2379,
                2656
            ],
            [
                2656,
                3098
            ],
            [
                3098,
                3460
            ],
            [
                3460,
                4140
            ],
            [
                4140,
                4625
            ],
            [
                4625,
                5115
            ],
            [
                5115,
                5479
            ],
            [
                5479,
                5840
            ],
            [
                5840,
                6674
            ],
            [
                6674,
                7007
            ],
            [
                7007,
                7640
            ],
            [
                7640,
                7955
            ]
        ],
        "segment_chars": [
            [
                0,
                228
            ],
            [
                228,
                273
            ],
            [
                273,
                333
            ],
            [
                333,
                499
            ],
            [
                499,
                678
            ],
            [
                678,
                844
            ],
            [
                844,
                878
            ],
            [
                878,
                893
            ],
            [
                893,
                969
            ],
            [
                969,
                1048
            ],
            [
                1048,
                1075
            ],
            [
                1075,
                1148
            ],
            [
                1148,
                1219
            ],
            [
                1219,
                1294
            ],
            [
                1294,
                1397
            ],
            [
                1397,
                1485
            ],
            [
                1485,
                1533
            ],
            [
                1533,
                1643
            ],
            [
                1643,
                1723
            ],
            [
                1723,
                1829
            ],
            [
                1829,
                1853
            ],
            [
                1853,
                1977
            ],
            [
                1977,
                2020
            ],
            [
                2020,
                2092
            ],
            [
                2092,
                2155
            ],
            [
                2155,
                2213
            ],
            [
                2213,
                2220
            ],
            [
                2220,
                2379
            ],
            [
                2379,
                2574
            ],
            [
                2574,
                2656
            ],
            [
                2656,
                2781
            ],
            [
                2781,
                2889
            ],
            [
                2889,
                3098
            ],
            [
                3098,
                3239
            ],
            [
                3239,
                3460
            ],
            [
                3460,
                3527
            ],
            [
                3527,
                3709
            ],
            [
                3709,
                3853
            ],
            [
                3853,
                3972
            ],
            [
                3972,
                4140
            ],
            [
                4140,
                4250
            ],
            [
                4250,
                4447
            ],
            [
                4447,
                4625
            ],
            [
                4625,
                4742
            ],
            [
                4742,
                4946
            ],
            [
                4946,
                5115
            ],
            [
                5115,
                5146
            ],
            [
                5146,
                5271
            ],
            [
                5271,
                5479
            ],
            [
                5479,
                5584
            ],
            [
                5584,
                5840
            ],
            [
                5840,
                5861
            ],
            [
                5861,
                5938
            ],
            [
                5938,
                6102
            ],
            [
                6102,
                6254
            ],
            [
                6254,
                6336
            ],
            [
                6336,
                6674
            ],
            [
                6674,
                6727
            ],
            [
                6727,
                6876
            ],
            [
                6876,
                7007
            ],
            [
                7007,
                7045
            ],
            [
                7045,
                7208
            ],
            [
                7208,
                7370
            ],
            [
                7370,
                7512
            ],
            [
                7512,
                7527
            ],
            [
                7527,
                7640
            ],
            [
                7640,
                7779
            ],
            [
                7779,
                7818
            ],
            [
                7818,
                7955
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                16,
                59
            ],
            [
                72,
                211
            ],
            [
                212,
                226
            ],
            [
                226,
                228
            ],
            [
                228,
                273
            ],
            [
                273,
                333
            ],
            [
                333,
                371
            ],
            [
                371,
                457
            ],
            [
                458,
                461
            ],
            [
                462,
                498
            ],
            [
                499,
                540
            ],
            [
                540,
                542
            ],
            [
                553,
                554
            ],
            [
                555,
                556
            ],
            [
                556,
                611
            ],
            [
                612,
                653
            ],
            [
                657,
                676
            ],
            [
                676,
                678
            ],
            [
                711,
                716
            ],
            [
                717,
                732
            ],
            [
                733,
                744
            ],
            [
                745,
                757
            ],
            [
                758,
                768
            ],
            [
                769,
                844
            ],
            [
                844,
                875
            ],
            [
                875,
                878
            ],
            [
                878,
                893
            ],
            [
                893,
                900
            ],
            [
                900,
                966
            ],
            [
                969,
                971
            ],
            [
                979,
                983
            ],
            [
                984,
                1048
            ],
            [
                1048,
                1075
            ],
            [
                1075,
                1148
            ],
            [
                1148,
                1165
            ],
            [
                1166,
                1181
            ],
            [
                1182,
                1219
            ],
            [
                1219,
                1294
            ],
            [
                1294,
                1351
            ],
            [
                1364,
                1397
            ],
            [
                1397,
                1485
            ],
            [
                1485,
                1533
            ],
            [
                1533,
                1548
            ],
            [
                1549,
                1561
            ],
            [
                1562,
                1566
            ],
            [
                1573,
                1615
            ],
            [
                1619,
                1641
            ],
            [
                1643,
                1690
            ],
            [
                1691,
                1696
            ],
            [
                1697,
                1723
            ],
            [
                1723,
                1743
            ],
            [
                1743,
                1797
            ],
            [
                1806,
                1829
            ],
            [
                1829,
                1853
            ],
            [
                1853,
                1904
            ],
            [
                1923,
                1957
            ],
            [
                1958,
                1977
            ],
            [
                1977,
                1994
            ],
            [
                2000,
                2020
            ],
            [
                2020,
                2092
            ],
            [
                2092,
                2155
            ],
            [
                2155,
                2201
            ],
            [
                2202,
                2207
            ],
            [
                2208,
                2213
            ],
            [
                2213,
                2220
            ],
            [
                2220,
                2239
            ],
            [
                2239,
                2258
            ],
            [
                2259,
                2288
            ],
            [
                2288,
                2379
            ],
            [
                2379,
                2429
            ],
            [
                2429,
                2510
            ],
            [
                2511,
                2547
            ],
            [
                2548,
                2574
            ],
            [
                2574,
                2656
            ],
            [
                2656,
                2689
            ],
            [
                2690,
                2705
            ],
            [
                2714,
                2717
            ],
            [
                2727,
                2779
            ],
            [
                2779,
                2781
            ],
            [
                2781,
                2835
            ],
            [
                2835,
                2887
            ],
            [
                2887,
                2889
            ],
            [
                2889,
                2951
            ],
            [
                2951,
                3058
            ],
            [
                3063,
                3075
            ],
            [
                3076,
                3084
            ],
            [
                3085,
                3098
            ],
            [
                3098,
                3107
            ],
            [
                3108,
                3162
            ],
            [
                3162,
                3239
            ],
            [
                3239,
                3277
            ],
            [
                3283,
                3351
            ],
            [
                3352,
                3367
            ],
            [
                3368,
                3459
            ],
            [
                3460,
                3527
            ],
            [
                3527,
                3551
            ],
            [
                3568,
                3613
            ],
            [
                3627,
                3643
            ],
            [
                3649,
                3658
            ],
            [
                3659,
                3707
            ],
            [
                3707,
                3709
            ],
            [
                3709,
                3749
            ],
            [
                3750,
                3755
            ],
            [
                3770,
                3802
            ],
            [
                3803,
                3853
            ],
            [
                3853,
                3884
            ],
            [
                3885,
                3888
            ],
            [
                3889,
                3970
            ],
            [
                3972,
                3989
            ],
            [
                3990,
                3996
            ],
            [
                3997,
                4018
            ],
            [
                4043,
                4048
            ],
            [
                4049,
                4128
            ],
            [
                4129,
                4140
            ],
            [
                4140,
                4155
            ],
            [
                4156,
                4225
            ],
            [
                4226,
                4250
            ],
            [
                4250,
                4269
            ],
            [
                4270,
                4348
            ],
            [
                4349,
                4447
            ],
            [
                4447,
                4452
            ],
            [
                4453,
                4513
            ],
            [
                4514,
                4516
            ],
            [
                4517,
                4529
            ],
            [
                4530,
                4567
            ],
            [
                4574,
                4619
            ],
            [
                4620,
                4625
            ],
            [
                4625,
                4638
            ],
            [
                4645,
                4666
            ],
            [
                4670,
                4706
            ],
            [
                4706,
                4742
            ],
            [
                4742,
                4748
            ],
            [
                4749,
                4869
            ],
            [
                4871,
                4891
            ],
            [
                4892,
                4901
            ],
            [
                4906,
                4915
            ],
            [
                4916,
                4924
            ],
            [
                4925,
                4929
            ],
            [
                4930,
                4946
            ],
            [
                4946,
                4992
            ],
            [
                4992,
                5056
            ],
            [
                5056,
                5083
            ],
            [
                5091,
                5114
            ],
            [
                5115,
                5144
            ],
            [
                5144,
                5145
            ],
            [
                5146,
                5269
            ],
            [
                5271,
                5428
            ],
            [
                5429,
                5433
            ],
            [
                5434,
                5444
            ],
            [
                5445,
                5448
            ],
            [
                5449,
                5455
            ],
            [
                5460,
                5477
            ],
            [
                5479,
                5520
            ],
            [
                5520,
                5532
            ],
            [
                5539,
                5584
            ],
            [
                5584,
                5589
            ],
            [
                5597,
                5619
            ],
            [
                5629,
                5636
            ],
            [
                5637,
                5644
            ],
            [
                5645,
                5662
            ],
            [
                5667,
                5675
            ],
            [
                5675,
                5680
            ],
            [
                5681,
                5772
            ],
            [
                5776,
                5788
            ],
            [
                5795,
                5840
            ],
            [
                5840,
                5861
            ],
            [
                5861,
                5887
            ],
            [
                5888,
                5891
            ],
            [
                5892,
                5917
            ],
            [
                5925,
                5927
            ],
            [
                5934,
                5936
            ],
            [
                5938,
                5958
            ],
            [
                5959,
                5962
            ],
            [
                5963,
                5968
            ],
            [
                5969,
                5987
            ],
            [
                5988,
                5992
            ],
            [
                5993,
                5996
            ],
            [
                6008,
                6024
            ],
            [
                6024,
                6034
            ],
            [
                6035,
                6073
            ],
            [
                6082,
                6085
            ],
            [
                6086,
                6095
            ],
            [
                6096,
                6100
            ],
            [
                6100,
                6102
            ],
            [
                6102,
                6110
            ],
            [
                6111,
                6116
            ],
            [
                6117,
                6124
            ],
            [
                6129,
                6252
            ],
            [
                6252,
                6254
            ],
            [
                6258,
                6261
            ],
            [
                6262,
                6266
            ],
            [
                6282,
                6336
            ],
            [
                6336,
                6355
            ],
            [
                6356,
                6439
            ],
            [
                6439,
                6448
            ],
            [
                6449,
                6623
            ],
            [
                6634,
                6653
            ],
            [
                6654,
                6674
            ],
            [
                6674,
                6710
            ],
            [
                6721,
                6727
            ],
            [
                6727,
                6769
            ],
            [
                6775,
                6845
            ],
            [
                6858,
                6876
            ],
            [
                6876,
                6915
            ],
            [
                6925,
                6933
            ],
            [
                6934,
                6960
            ],
            [
                6961,
                7006
            ],
            [
                7007,
                7045
            ],
            [
                7045,
                7161
            ],
            [
                7180,
                7197
            ],
            [
                7198,
                7206
            ],
            [
                7206,
                7208
            ],
            [
                7208,
                7242
            ],
            [
                7248,
                7272
            ],
            [
                7273,
                7315
            ],
            [
                7316,
                7370
            ],
            [
                7370,
                7412
            ],
            [
                7413,
                7436
            ],
            [
                7437,
                7461
            ],
            [
                7461,
                7472
            ],
            [
                7482,
                7493
            ],
            [
                7502,
                7512
            ],
            [
                7512,
                7527
            ],
            [
                7527,
                7614
            ],
            [
                7615,
                7617
            ],
            [
                7618,
                7638
            ],
            [
                7638,
                7640
            ],
            [
                7640,
                7660
            ],
            [
                7666,
                7701
            ],
            [
                7706,
                7746
            ],
            [
                7753,
                7768
            ],
            [
                7773,
                7779
            ],
            [
                7779,
                7809
            ],
            [
                7816,
                7818
            ],
            [
                7818,
                7837
            ],
            [
                7838,
                7860
            ],
            [
                7861,
                7916
            ],
            [
                7917,
                7955
            ]
        ],
        "row_chars": [
            [
                0,
                228
            ],
            [
                228,
                273
            ],
            [
                273,
                333
            ],
            [
                333,
                499
            ],
            [
                499,
                678
            ],
            [
                678,
                844
            ],
            [
                844,
                878
            ],
            [
                878,
                893
            ],
            [
                893,
                969
            ],
            [
                969,
                1048
            ],
            [
                1048,
                1075
            ],
            [
                1075,
                1148
            ],
            [
                1148,
                1219
            ],
            [
                1219,
                1294
            ],
            [
                1294,
                1294
            ],
            [
                1294,
                1397
            ],
            [
                1397,
                1485
            ],
            [
                1485,
                1485
            ],
            [
                1485,
                1533
            ],
            [
                1533,
                1723
            ],
            [
                1723,
                1723
            ],
            [
                1723,
                1829
            ],
            [
                1829,
                1853
            ],
            [
                1853,
                1977
            ],
            [
                1977,
                1977
            ],
            [
                1977,
                2020
            ],
            [
                2020,
                2092
            ],
            [
                2092,
                2155
            ],
            [
                2155,
                2213
            ],
            [
                2213,
                2220
            ],
            [
                2220,
                2379
            ],
            [
                2379,
                2574
            ],
            [
                2574,
                2656
            ],
            [
                2656,
                2781
            ],
            [
                2781,
                2889
            ],
            [
                2889,
                3098
            ],
            [
                3098,
                3239
            ],
            [
                3239,
                3460
            ],
            [
                3460,
                3527
            ],
            [
                3527,
                3709
            ],
            [
                3709,
                3853
            ],
            [
                3853,
                4140
            ],
            [
                4140,
                4140
            ],
            [
                4140,
                4140
            ],
            [
                4140,
                4140
            ],
            [
                4140,
                4250
            ],
            [
                4250,
                4447
            ],
            [
                4447,
                4625
            ],
            [
                4625,
                4742
            ],
            [
                4742,
                4946
            ],
            [
                4946,
                5115
            ],
            [
                5115,
                5479
            ],
            [
                5479,
                5584
            ],
            [
                5584,
                5840
            ],
            [
                5840,
                5861
            ],
            [
                5861,
                6102
            ],
            [
                6102,
                6254
            ],
            [
                6254,
                6336
            ],
            [
                6336,
                6674
            ],
            [
                6674,
                6727
            ],
            [
                6727,
                6876
            ],
            [
                6876,
                7007
            ],
            [
                7007,
                7045
            ],
            [
                7045,
                7208
            ],
            [
                7208,
                7370
            ],
            [
                7370,
                7512
            ],
            [
                7512,
                7512
            ],
            [
                7512,
                7527
            ],
            [
                7527,
                7640
            ],
            [
                7640,
                7779
            ],
            [
                7779,
                7818
            ],
            [
                7818,
                7818
            ],
            [
                7818,
                7955
            ]
        ]
    }
}