{
    "original": {
        "text": "It was presumed that Mr. Crawford was travelling back, to London, on the morrow, for nothing more was seen of him at Mr. Price's; and two days afterwards, it was a fact ascertained to Fanny by the following letter from his sister, opened and read by her, on another account, with the most anxious curiosity:-\n\"I have to inform you, my dearest Fanny, that Henry has been down to Portsmouth to see you; that he had a delightful walk with you to the dockyard last Saturday, and one still more to be dwelt on the next day, on the ramparts; when the balmy air, the sparkling sea, and your sweet looks and conversation were altogether in the most delicious harmony, and afforded sensations which are to raise ecstasy even in retrospect. This, as well as I understand, is to be the substance of my information. He makes me write, but I do not know what else is to be communicated, except this said visit to Portsmouth, and these two said walks, and his introduction to your family, especially to a fair sister of yours, a fine girl of fifteen, who was of the party on the ramparts, taking her first lesson, I presume, in love. I have not time for writing much, but it would be out of place if I had, for this is to be a mere letter of business, penned for the purpose of conveying necessary information, which could not be delayed without risk of evil. My dear, dear Fanny, if I had you here, how I would talk to you! You should listen to me till you were tired, and advise me till you were still tired more; but it is impossible to put a hundredth part of my great mind on paper, so I will abstain altogether, and leave you to guess what you like. I have no news for you. You have politics, of course; and it would be too bad to plague you with the names of people and parties that fill up my time. I ought to have sent you an account of your cousin's first party, but I was lazy, and now it is too long ago; suffice it, that everything was just as it ought to be, in a style that any of her connexions must have been gratified to witness, and that her own dress and manners did her the greatest credit. My friend, Mrs. Fraser, is mad for such a house, and it would not make _me_ miserable. I go to Lady Stornaway after Easter; she seems in high spirits, and very happy. I fancy Lord S. is very good-humoured and pleasant in his own family, and I do not think him so very ill-looking as I did-at least, one sees many worse. He will not do by the side of your cousin Edmund. Of the last-mentioned hero, what shall I say? If I avoided his name entirely, it would look suspicious. I will say, then, that we have seen him two or three times, and that my friends here are very much struck with his gentlemanlike appearance. Mrs. Fraser (no bad judge) declares she knows but three men in town who have so good a person, height, and air; and I must confess, when he dined here the other day, there were none to compare with him, and we were a party of sixteen. Luckily there is no distinction of dress nowadays to tell tales, but-but-but Yours affectionately.\"\n\"I had almost forgot (it was Edmund's fault: he gets into my head more than does me good) one very material thing I had to say from Henry and myself-I mean about our taking you back into Northamptonshire. My dear little creature, do not stay at Portsmouth to lose your pretty looks. Those vile sea-breezes are the ruin of beauty and health. My poor aunt always felt affected if within ten miles of the sea, which the Admiral of course never believed, but I know it was so. I am at your service and Henry's, at an hour's notice. I should like the scheme, and we would make a little circuit, and shew you Everingham in our way, and perhaps you would not mind passing through London, and seeing the inside of St. George's, Hanover Square. Only keep your cousin Edmund from me at such a time: I should not like to be tempted. What a long letter! one word more. Henry, I find, has some idea of going into Norfolk again upon some business that _you_ approve; but this cannot possibly be permitted before the middle of next week; that is, he cannot anyhow be spared till after the 14th, for _we_ have a party that evening. The value of a man like Henry, on such an occasion, is what you can have no conception of; so you must take it upon my word to be inestimable. He will see the Rushworths, which I own I am not sorry for-having a little curiosity, and so I think has he-though he will not acknowledge it.\"\nThis was a letter to be run through eagerly, to be read deliberately, to supply matter for much reflection, and to leave everything in greater suspense than ever. The only certainty to be drawn from it was, that nothing decisive had yet taken place. Edmund had not yet spoken. How Miss Crawford really felt, how she meant to act, or might act without or against her meaning; whether his importance to her were quite what it had been before the last separation; whether, if lessened, it were likely to lessen more, or to recover itself, were subjects for endless conjecture, and to be thought of on that day and many days to come, without producing any conclusion. The idea that returned the oftenest was that Miss Crawford, after proving herself cooled and staggered by a return to London habits, would yet prove herself in the end too much attached to him to give him up. She would try to be more ambitious than her heart would allow. She would hesitate, she would tease, she would condition, she would require a great deal, but she would finally accept.\nThis was Fanny's most frequent expectation. A house in town-that, she thought, must be impossible. Yet there was no saying what Miss Crawford might not ask. The prospect for her cousin grew worse and worse. The woman who could speak of him, and speak only of his appearance! What an unworthy attachment! To be deriving support from the commendations of Mrs. Fraser! _She_ who had known him intimately half a year! Fanny was ashamed of her. Those parts of the letter which related only to Mr. Crawford and herself, touched her, in comparison, slightly. Whether Mr. Crawford went into Norfolk before or after the 14th was certainly no concern of hers, though, everything considered, she thought he _would_ go without delay. That Miss Crawford should endeavour to secure a meeting between him and Mrs. Rushworth, was all in her worst line of conduct, and grossly unkind and ill-judged; but she hoped _he_ would not be actuated by any such degrading curiosity. He acknowledged no such inducement, and his sister ought to have given him credit for better feelings than her own.\nShe was yet more impatient for another letter from town after receiving this than she had been before; and for a few days was so unsettled by it altogether, by what had come, and what might come, that her usual readings and conversation with Susan were much suspended. She could not command her attention as she wished. If Mr. Crawford remembered her message to her cousin, she thought it very likely, most likely, that he would write to her at all events; it would be most consistent with his usual kindness; and till she got rid of this idea, till it gradually wore off, by no letters appearing in the course of three or four days more, she was in a most restless, anxious state.\nAt length, a something like composure succeeded. Suspense must be submitted to, and must not be allowed to wear her out, and make her useless. Time did something, her own exertions something more, and she resumed her attentions to Susan, and again awakened the same interest in them.\nSusan was growing very fond of her, and though without any of the early delight in books which had been so strong in Fanny, with a disposition much less inclined to sedentary pursuits, or to information for information's sake, she had so strong a desire of not _appearing_ ignorant, as, with a good clear understanding, made her a most attentive, profitable, thankful pupil. Fanny was her oracle. Fanny's explanations and remarks were a most important addition to every essay, or every chapter of history. What Fanny told her of former times dwelt more on her mind than the pages of Goldsmith; and she paid her sister the compliment of preferring her style to that of any printed author. The early habit of reading was wanting.\nTheir conversations, however, were not always on subjects so high as history or morals. Others had their hour; and of lesser matters, none returned so often, or remained so long between them, as Mansfield Park, a description of the people, the manners, the amusements, the ways of Mansfield Park. Susan, who had an innate taste for the genteel and well-appointed, was eager to hear, and Fanny could not but indulge herself in dwelling on so beloved a theme. She hoped it was not wrong; though, after a time, Susan's very great admiration of everything said or done in her uncle's house, and earnest longing to go into Northamptonshire, seemed almost to blame her for exciting feelings which could not be gratified.\nPoor Susan was very little better fitted for home than her elder sister; and as Fanny grew thoroughly to understand this, she began to feel that when her own release from Portsmouth came, her happiness would have a material drawback in leaving Susan behind. That a girl so capable of being made everything good should be left in such hands, distressed her more and more. Were _she_ likely to have a home to invite her to, what a blessing it would be! And had it been possible for her to return Mr. Crawford's regard, the probability of his being very far from objecting to such a measure would have been the greatest increase of all her own comforts. She thought he was really good-tempered, and could fancy his entering into a plan of that sort most pleasantly.",
        "paragraph_chars": [
            [
                0,
                309
            ],
            [
                309,
                3048
            ],
            [
                3048,
                4451
            ],
            [
                4451,
                5507
            ],
            [
                5507,
                6580
            ],
            [
                6580,
                7262
            ],
            [
                7262,
                7546
            ],
            [
                7546,
                8274
            ],
            [
                8274,
                8989
            ],
            [
                8989,
                9751
            ]
        ],
        "segment_chars": [
            [
                0,
                309
            ],
            [
                309,
                731
            ],
            [
                731,
                804
            ],
            [
                804,
                1120
            ],
            [
                1120,
                1346
            ],
            [
                1346,
                1411
            ],
            [
                1411,
                1642
            ],
            [
                1642,
                1666
            ],
            [
                1666,
                1793
            ],
            [
                1793,
                2098
            ],
            [
                2098,
                2185
            ],
            [
                2185,
                2265
            ],
            [
                2265,
                2418
            ],
            [
                2418,
                2468
            ],
            [
                2468,
                2514
            ],
            [
                2514,
                2572
            ],
            [
                2572,
                2713
            ],
            [
                2713,
                2948
            ],
            [
                2948,
                3048
            ],
            [
                3048,
                3253
            ],
            [
                3253,
                3331
            ],
            [
                3331,
                3389
            ],
            [
                3389,
                3521
            ],
            [
                3521,
                3576
            ],
            [
                3576,
                3784
            ],
            [
                3784,
                3870
            ],
            [
                3870,
                3890
            ],
            [
                3890,
                3905
            ],
            [
                3905,
                4164
            ],
            [
                4164,
                4307
            ],
            [
                4307,
                4451
            ],
            [
                4451,
                4614
            ],
            [
                4614,
                4701
            ],
            [
                4701,
                4728
            ],
            [
                4728,
                5115
            ],
            [
                5115,
                5324
            ],
            [
                5324,
                5387
            ],
            [
                5387,
                5507
            ],
            [
                5507,
                5551
            ],
            [
                5551,
                5606
            ],
            [
                5606,
                5664
            ],
            [
                5664,
                5714
            ],
            [
                5714,
                5782
            ],
            [
                5782,
                5811
            ],
            [
                5811,
                5873
            ],
            [
                5873,
                5921
            ],
            [
                5921,
                5947
            ],
            [
                5947,
                6059
            ],
            [
                6059,
                6229
            ],
            [
                6229,
                6464
            ],
            [
                6464,
                6580
            ],
            [
                6580,
                6849
            ],
            [
                6849,
                6900
            ],
            [
                6900,
                7262
            ],
            [
                7262,
                7311
            ],
            [
                7311,
                7405
            ],
            [
                7405,
                7546
            ],
            [
                7546,
                7921
            ],
            [
                7921,
                7943
            ],
            [
                7943,
                8052
            ],
            [
                8052,
                8234
            ],
            [
                8234,
                8274
            ],
            [
                8274,
                8362
            ],
            [
                8362,
                8571
            ],
            [
                8571,
                8732
            ],
            [
                8732,
                8989
            ],
            [
                8989,
                9247
            ],
            [
                9247,
                9360
            ],
            [
                9360,
                9440
            ],
            [
                9440,
                9640
            ],
            [
                9640,
                9751
            ]
        ],
        "overlap_chars": [
            [
                23,
                53
            ],
            [
                55,
                64
            ],
            [
                66,
                79
            ],
            [
                128,
                154
            ],
            [
                184,
                189
            ],
            [
                242,
                246
            ],
            [
                162,
                163
            ],
            [
                207,
                229
            ],
            [
                275,
                279
            ],
            [
                289,
                309
            ],
            [
                309,
                489
            ],
            [
                505,
                658
            ],
            [
                729,
                731
            ],
            [
                731,
                736
            ],
            [
                745,
                804
            ],
            [
                804,
                859
            ],
            [
                886,
                890
            ],
            [
                872,
                880
            ],
            [
                942,
                1120
            ],
            [
                1120,
                1152
            ],
            [
                1191,
                1295
            ],
            [
                1344,
                1346
            ],
            [
                1346,
                1411
            ],
            [
                1411,
                1500
            ],
            [
                1640,
                1642
            ],
            [
                1793,
                1843
            ],
            [
                1843,
                1958
            ],
            [
                2034,
                2098
            ],
            [
                2098,
                2168
            ],
            [
                2170,
                2172
            ],
            [
                2174,
                2185
            ],
            [
                2185,
                2265
            ],
            [
                2265,
                2302
            ],
            [
                2316,
                2386
            ],
            [
                2416,
                2418
            ],
            [
                2418,
                2468
            ],
            [
                2468,
                2470
            ],
            [
                2494,
                2514
            ],
            [
                2514,
                2535
            ],
            [
                2544,
                2572
            ],
            [
                2572,
                2651
            ],
            [
                2657,
                2665
            ],
            [
                2671,
                2713
            ],
            [
                2713,
                2797
            ],
            [
                2806,
                2914
            ],
            [
                2946,
                2948
            ],
            [
                2948,
                3048
            ],
            [
                3048,
                3141
            ],
            [
                3156,
                3253
            ],
            [
                3253,
                3331
            ],
            [
                3331,
                3389
            ],
            [
                3521,
                3576
            ],
            [
                3606,
                3614
            ],
            [
                3647,
                3661
            ],
            [
                3665,
                3766
            ],
            [
                3768,
                3784
            ],
            [
                3784,
                3870
            ],
            [
                3870,
                3890
            ],
            [
                3890,
                3905
            ],
            [
                3905,
                3985
            ],
            [
                3987,
                3990
            ],
            [
                3992,
                4004
            ],
            [
                4080,
                4089
            ],
            [
                4097,
                4131
            ],
            [
                4133,
                4135
            ],
            [
                4137,
                4164
            ],
            [
                4164,
                4218
            ],
            [
                4305,
                4307
            ],
            [
                4307,
                4451
            ],
            [
                4451,
                4494
            ],
            [
                4519,
                4614
            ],
            [
                4614,
                4656
            ],
            [
                4658,
                4701
            ],
            [
                4701,
                4727
            ],
            [
                4728,
                4779
            ],
            [
                4824,
                4890
            ],
            [
                4779,
                4780
            ],
            [
                5058,
                5061
            ],
            [
                4912,
                4951
            ],
            [
                4971,
                4978
            ],
            [
                4985,
                5045
            ],
            [
                5062,
                5115
            ],
            [
                5115,
                5174
            ],
            [
                5197,
                5203
            ],
            [
                5218,
                5263
            ],
            [
                5272,
                5324
            ],
            [
                5387,
                5507
            ],
            [
                5507,
                5551
            ],
            [
                5551,
                5571
            ],
            [
                5586,
                5606
            ],
            [
                5606,
                5664
            ],
            [
                5664,
                5714
            ],
            [
                5752,
                5782
            ],
            [
                5811,
                5873
            ],
            [
                5874,
                5877
            ],
            [
                5879,
                5921
            ],
            [
                5921,
                5946
            ],
            [
                5947,
                5986
            ],
            [
                5992,
                6019
            ],
            [
                6021,
                6048
            ],
            [
                5987,
                5991
            ],
            [
                6049,
                6059
            ],
            [
                6059,
                6126
            ],
            [
                6137,
                6155
            ],
            [
                6227,
                6229
            ],
            [
                6229,
                6254
            ],
            [
                6265,
                6267
            ],
            [
                6275,
                6315
            ],
            [
                6317,
                6320
            ],
            [
                6359,
                6403
            ],
            [
                6405,
                6407
            ],
            [
                6409,
                6418
            ],
            [
                6438,
                6464
            ],
            [
                6504,
                6580
            ],
            [
                6580,
                6656
            ],
            [
                6681,
                6718
            ],
            [
                6725,
                6735
            ],
            [
                6776,
                6799
            ],
            [
                6817,
                6849
            ],
            [
                6849,
                6900
            ],
            [
                6900,
                6952
            ],
            [
                6952,
                6980
            ],
            [
                6995,
                7021
            ],
            [
                7088,
                7098
            ],
            [
                7114,
                7123
            ],
            [
                7133,
                7193
            ],
            [
                7208,
                7212
            ],
            [
                7217,
                7262
            ],
            [
                7262,
                7311
            ],
            [
                7311,
                7354
            ],
            [
                7387,
                7405
            ],
            [
                7405,
                7498
            ],
            [
                7544,
                7546
            ],
            [
                7546,
                7607
            ],
            [
                7663,
                7668
            ],
            [
                7618,
                7634
            ],
            [
                7737,
                7806
            ],
            [
                7819,
                7874
            ],
            [
                7882,
                7891
            ],
            [
                7914,
                7921
            ],
            [
                7921,
                7943
            ],
            [
                7943,
                7963
            ],
            [
                7976,
                8015
            ],
            [
                8032,
                8051
            ],
            [
                8274,
                8339
            ],
            [
                8360,
                8362
            ],
            [
                8389,
                8430
            ],
            [
                8466,
                8501
            ],
            [
                8506,
                8513
            ],
            [
                8518,
                8526
            ],
            [
                8385,
                8388
            ],
            [
                8547,
                8551
            ],
            [
                8569,
                8571
            ],
            [
                8571,
                8576
            ],
            [
                8638,
                8676
            ],
            [
                8689,
                8732
            ],
            [
                8732,
                8766
            ],
            [
                8782,
                8789
            ],
            [
                8795,
                8909
            ],
            [
                8933,
                8936
            ],
            [
                8950,
                8989
            ],
            [
                8989,
                9079
            ],
            [
                9091,
                9203
            ],
            [
                9213,
                9247
            ],
            [
                9247,
                9251
            ],
            [
                9300,
                9360
            ],
            [
                9366,
                9369
            ],
            [
                9386,
                9440
            ],
            [
                9440,
                9505
            ],
            [
                9525,
                9528
            ],
            [
                9559,
                9640
            ],
            [
                9640,
                9751
            ]
        ],
        "row_chars": [
            [
                0,
                309
            ],
            [
                309,
                731
            ],
            [
                731,
                804
            ],
            [
                804,
                1120
            ],
            [
                1120,
                1346
            ],
            [
                1346,
                1411
            ],
            [
                1411,
                1642
            ],
            [
                1642,
                1666
            ],
            [
                1666,
                1793
            ],
            [
                1793,
                2098
            ],
            [
                2098,
                2185
            ],
            [
                2185,
                2265
            ],
            [
                2265,
                2418
            ],
            [
                2418,
                2468
            ],
            [
                2468,
                2514
            ],
            [
                2514,
                2572
            ],
            [
                2572,
                2713
            ],
            [
                2713,
                2948
            ],
            [
                2948,
                3048
            ],
            [
                3048,
                3253
            ],
            [
                3253,
                3331
            ],
            [
                3331,
                3389
            ],
            [
                3389,
                3521
            ],
            [
                3521,
                3576
            ],
            [
                3576,
                3784
            ],
            [
                3784,
                3870
            ],
            [
                3870,
                3890
            ],
            [
                3890,
                3905
            ],
            [
                3905,
                4164
            ],
            [
                4164,
                4307
            ],
            [
                4307,
                4451
            ],
            [
                4451,
                4614
            ],
            [
                4614,
                4701
            ],
            [
                4701,
                4728
            ],
            [
                4728,
                5115
            ],
            [
                5115,
                5324
            ],
            [
                5324,
                5387
            ],
            [
                5387,
                5507
            ],
            [
                5507,
                5551
            ],
            [
                5551,
                5606
            ],
            [
                5606,
                5664
            ],
            [
                5664,
                5714
            ],
            [
                5714,
                5782
            ],
            [
                5782,
                5811
            ],
            [
                5811,
                5873
            ],
            [
                5873,
                5921
            ],
            [
                5921,
                5947
            ],
            [
                5947,
                6059
            ],
            [
                6059,
                6229
            ],
            [
                6229,
                6464
            ],
            [
                6464,
                6580
            ],
            [
                6580,
                6849
            ],
            [
                6849,
                6900
            ],
            [
                6900,
                7262
            ],
            [
                7262,
                7311
            ],
            [
                7311,
                7405
            ],
            [
                7405,
                7546
            ],
            [
                7546,
                7921
            ],
            [
                7921,
                7943
            ],
            [
                7943,
                8052
            ],
            [
                8052,
                8234
            ],
            [
                8234,
                8274
            ],
            [
                8274,
                8362
            ],
            [
                8362,
                8571
            ],
            [
                8571,
                8732
            ],
            [
                8732,
                8989
            ],
            [
                8989,
                9247
            ],
            [
                9247,
                9360
            ],
            [
                9360,
                9440
            ],
            [
                9440,
                9640
            ],
            [
                9640,
                9751
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Crawford was travelling back to London on the morrow; and two days afterwards, Fanny read a letter from his sister with anxious curiosity:-\n\"I have to inform you, my dearest Fanny, that Henry has been down to Portsmouth to see you; that he had a delightful walk with you to the dockyard last Saturday, and one still more delightful the next day, on the ramparts; when the balmy air, the sparkling sea, and your sweet looks and conversation were altogether in the most delicious harmony. This, as I understand, is to be the substance of my information. He makes me write, but I do not know what else is to be said, except his introduction to your family, especially to a fair sister of yours, a fine girl of fifteen, who was of the party on the ramparts, taking her first lesson, I presume, in love. I have not time for writing much, for this is to be a mere letter of business, penned for the purpose of conveying necessary information. My dear, dear Fanny, if I had you here, how I would talk to you! You should listen to me till you were tired, and advise me till you were still tired more. I ought to have sent you an account of your cousin Maria's first party, but I was lazy, and now it is too long ago; suffice it, that everything was just as it ought to be, and that her own dress and manners did her the greatest credit. My friend, Mrs. Fraser, is mad for such a house, and it would not make me miserable. I go to Lady Stornaway after Easter; she seems in high spirits, and very happy. I fancy Lord S. is very good-humoured in his own family, and I do not think him so very ill-looking as I did. However, he will not do by the side of your cousin Edmund. Of whom, what shall I say? If I avoided his name, it would look suspicious. I will say, then, that we have seen him two or three times, and that my friends are very struck with his gentlemanlike appearance. Mrs. Fraser (no bad judge) declares she knows but three men in town who have so good an appearance, height, and air; and I must confess, when he dined here the other day, there were none to compare with him. Luckily there is no distinction of dress nowadays to tell tales, but-but-but Yours affectionately.\"\n\"I had almost forgot (it was Edmund's fault: he gets into my head more than does me good) one thing I had to say from Henry and myself-I mean about our taking you back into Northamptonshire. My dear little creature, do not stay at Portsmouth to lose your pretty looks. Those vile sea-breezes are the ruin of beauty and health. I am at your service and Henry's, at an hour's notice. We would show you Everingham on our way, and perhaps you would not mind passing through London, and seeing the inside of St. George's church on Hanover Square. Only keep your cousin Edmund from me at such a time: I should not like to be tempted. What a long letter! one word more. Henry, I find, has some idea of going into Norfolk again upon some business that you approve; but he cannot be spared till after the 14th, for we have a party that evening. The value of a man like Henry, on such an occasion, is immense. He will see the Rushworths, which I own I am not sorry for-having a little curiosity, and so I think has he-though he will not acknowledge it.\"\nThis was a letter to be run through eagerly, to supply matter for much reflection, and to leave everything in greater suspense than ever. The only certainty to be drawn from it was that nothing decisive had yet taken place. Edmund had not yet spoken.\nHow Miss Crawford really felt, how she meant to act; whether his importance to her were quite what it had been before, and whether, if lessened, it were likely to recover, were subjects for endless conjecture, and to be thought of for many days to come, without producing any conclusion. The idea that returned the oftenest was that Miss Crawford, though cooled by a return to London habits, would yet prove in the end too much attached to him to give him up. She would hesitate, she would tease, she would condition, she would require a great deal, but she would finally accept.\nThis was Fanny's most frequent expectation. A house in town-that must be impossible. Yet there was no saying what Miss Crawford might not ask. The prospect for her cousin grew worse and worse. To speak only of his appearance! To be deriving support from the commendations of Mrs. Fraser! She who had known him intimately half a year! Fanny was ashamed of her.\nThose parts of the letter which related to Mr. Crawford and herself touched her, in comparison, only slightly. Whether Mr. Crawford went into Norfolk before or after the 14th was no concern of hers. That Miss Crawford should try to arrange a meeting between him and Mrs. Rushworth was grossly unkind and ill-judged; but she hoped he would not feel such degrading curiosity. His sister ought to have given him credit for better feelings than her own.\nShe was yet more impatient for another letter from town after receiving this; and for a few days was so unsettled altogether that her usual readings with Susan were much suspended. She could not command her attention as she wished. If Mr. Crawford remembered her message to her cousin Edmund, she thought it very likely that he would write to her; and till this idea gradually wore off, by no letters appearing in the course of several days, she was in a most restless, anxious state.\nAt length, a something like composure succeeded. Suspense must be submitted to, and must not make her useless. Time did something, her own exertions something more, and she resumed her attentions to Susan.\nSusan was growing very fond of her, and though without any of Fanny's delight in books and information for information's sake, she had so strong a desire of not appearing ignorant, as, with a good clear understanding, made her an attentive pupil. Fanny was her oracle. Fanny's explanations were a most important addition to every chapter of history.\nTheir conversations, however, were not always on subjects so high. Of lesser matters, none returned so often as Mansfield Park, a description of its people, its manners, and its ways. Susan was eager to hear, and Fanny could not help indulging herself in dwelling on so beloved a theme. She hoped it was not wrong; though Susan's great admiration of everything said or done in her uncle's house, and earnest longing to go into Northamptonshire, made her fear she was creating feelings which could not be gratified.\nPoor Susan was very little better fitted for home than her elder sister; and as Fanny grew to understand this, she began to feel that when her own release from Portsmouth came, her happiness would have a drawback in leaving Susan behind. That Susan should be left in such hands, distressed her more and more. If she had a home to invite her to, what a blessing it would be! And had it been possible for her to return Mr. Crawford's regard, his probable assent to such a measure would have been the greatest increase of all her own comforts. She thought he was really good-tempered, and could fancy his entering into a plan of that sort most pleasantly.",
        "paragraph_chars": [
            [
                0,
                144
            ],
            [
                144,
                2182
            ],
            [
                2182,
                3226
            ],
            [
                3226,
                3477
            ],
            [
                3477,
                4057
            ],
            [
                4057,
                4417
            ],
            [
                4417,
                4867
            ],
            [
                4867,
                5352
            ],
            [
                5352,
                5558
            ],
            [
                5558,
                5908
            ],
            [
                5908,
                6423
            ],
            [
                6423,
                7075
            ]
        ],
        "segment_chars": [
            [
                0,
                144
            ],
            [
                144,
                491
            ],
            [
                491,
                556
            ],
            [
                556,
                803
            ],
            [
                803,
                941
            ],
            [
                941,
                1006
            ],
            [
                1006,
                1097
            ],
            [
                1097,
                1333
            ],
            [
                1333,
                1418
            ],
            [
                1418,
                1498
            ],
            [
                1498,
                1608
            ],
            [
                1608,
                1667
            ],
            [
                1667,
                1694
            ],
            [
                1694,
                1743
            ],
            [
                1743,
                1874
            ],
            [
                1874,
                2082
            ],
            [
                2082,
                2182
            ],
            [
                2182,
                2373
            ],
            [
                2373,
                2451
            ],
            [
                2451,
                2509
            ],
            [
                2509,
                2564
            ],
            [
                2564,
                2724
            ],
            [
                2724,
                2810
            ],
            [
                2810,
                2830
            ],
            [
                2830,
                2845
            ],
            [
                2845,
                3018
            ],
            [
                3018,
                3082
            ],
            [
                3082,
                3226
            ],
            [
                3226,
                3364
            ],
            [
                3364,
                3450
            ],
            [
                3450,
                3477
            ],
            [
                3477,
                3765
            ],
            [
                3765,
                3937
            ],
            [
                3937,
                4057
            ],
            [
                4057,
                4101
            ],
            [
                4101,
                4142
            ],
            [
                4142,
                4200
            ],
            [
                4200,
                4250
            ],
            [
                4250,
                4283
            ],
            [
                4283,
                4345
            ],
            [
                4345,
                4391
            ],
            [
                4391,
                4417
            ],
            [
                4417,
                4528
            ],
            [
                4528,
                4616
            ],
            [
                4616,
                4791
            ],
            [
                4791,
                4867
            ],
            [
                4867,
                5048
            ],
            [
                5048,
                5099
            ],
            [
                5099,
                5352
            ],
            [
                5352,
                5401
            ],
            [
                5401,
                5463
            ],
            [
                5463,
                5558
            ],
            [
                5558,
                5805
            ],
            [
                5805,
                5827
            ],
            [
                5827,
                5908
            ],
            [
                5908,
                5975
            ],
            [
                5975,
                6092
            ],
            [
                6092,
                6195
            ],
            [
                6195,
                6423
            ],
            [
                6423,
                6661
            ],
            [
                6661,
                6732
            ],
            [
                6732,
                6797
            ],
            [
                6797,
                6964
            ],
            [
                6964,
                7075
            ]
        ],
        "overlap_chars": [
            [
                2,
                32
            ],
            [
                33,
                42
            ],
            [
                43,
                56
            ],
            [
                56,
                82
            ],
            [
                83,
                88
            ],
            [
                89,
                93
            ],
            [
                94,
                95
            ],
            [
                96,
                118
            ],
            [
                119,
                123
            ],
            [
                124,
                144
            ],
            [
                144,
                324
            ],
            [
                336,
                489
            ],
            [
                489,
                491
            ],
            [
                491,
                496
            ],
            [
                497,
                556
            ],
            [
                556,
                611
            ],
            [
                612,
                616
            ],
            [
                616,
                624
            ],
            [
                625,
                803
            ],
            [
                803,
                835
            ],
            [
                835,
                939
            ],
            [
                939,
                941
            ],
            [
                941,
                1006
            ],
            [
                1006,
                1095
            ],
            [
                1095,
                1097
            ],
            [
                1097,
                1147
            ],
            [
                1153,
                1268
            ],
            [
                1269,
                1333
            ],
            [
                1333,
                1403
            ],
            [
                1404,
                1406
            ],
            [
                1407,
                1418
            ],
            [
                1418,
                1498
            ],
            [
                1498,
                1535
            ],
            [
                1536,
                1606
            ],
            [
                1606,
                1608
            ],
            [
                1617,
                1667
            ],
            [
                1667,
                1669
            ],
            [
                1674,
                1694
            ],
            [
                1694,
                1715
            ],
            [
                1715,
                1743
            ],
            [
                1743,
                1822
            ],
            [
                1823,
                1831
            ],
            [
                1832,
                1874
            ],
            [
                1874,
                1958
            ],
            [
                1972,
                2080
            ],
            [
                2080,
                2082
            ],
            [
                2082,
                2182
            ],
            [
                2182,
                2275
            ],
            [
                2276,
                2373
            ],
            [
                2373,
                2451
            ],
            [
                2451,
                2509
            ],
            [
                2509,
                2564
            ],
            [
                2564,
                2572
            ],
            [
                2578,
                2592
            ],
            [
                2596,
                2697
            ],
            [
                2708,
                2724
            ],
            [
                2724,
                2810
            ],
            [
                2810,
                2830
            ],
            [
                2830,
                2845
            ],
            [
                2845,
                2925
            ],
            [
                2926,
                2929
            ],
            [
                2930,
                2942
            ],
            [
                2943,
                2952
            ],
            [
                2953,
                2987
            ],
            [
                2988,
                2990
            ],
            [
                2991,
                3018
            ],
            [
                3018,
                3072
            ],
            [
                3080,
                3082
            ],
            [
                3082,
                3226
            ],
            [
                3226,
                3269
            ],
            [
                3269,
                3364
            ],
            [
                3364,
                3406
            ],
            [
                3407,
                3450
            ],
            [
                3450,
                3476
            ],
            [
                3477,
                3528
            ],
            [
                3528,
                3594
            ],
            [
                3594,
                3595
            ],
            [
                3596,
                3599
            ],
            [
                3600,
                3639
            ],
            [
                3640,
                3647
            ],
            [
                3647,
                3707
            ],
            [
                3712,
                3765
            ],
            [
                3765,
                3824
            ],
            [
                3832,
                3838
            ],
            [
                3839,
                3884
            ],
            [
                3885,
                3937
            ],
            [
                3937,
                4057
            ],
            [
                4057,
                4101
            ],
            [
                4101,
                4121
            ],
            [
                4122,
                4142
            ],
            [
                4142,
                4200
            ],
            [
                4200,
                4250
            ],
            [
                4253,
                4283
            ],
            [
                4283,
                4345
            ],
            [
                4345,
                4348
            ],
            [
                4349,
                4391
            ],
            [
                4391,
                4416
            ],
            [
                4417,
                4456
            ],
            [
                4457,
                4484
            ],
            [
                4485,
                4512
            ],
            [
                4513,
                4517
            ],
            [
                4518,
                4528
            ],
            [
                4528,
                4595
            ],
            [
                4596,
                4614
            ],
            [
                4614,
                4616
            ],
            [
                4616,
                4641
            ],
            [
                4646,
                4648
            ],
            [
                4657,
                4697
            ],
            [
                4698,
                4701
            ],
            [
                4702,
                4746
            ],
            [
                4747,
                4749
            ],
            [
                4750,
                4759
            ],
            [
                4765,
                4791
            ],
            [
                4791,
                4867
            ],
            [
                4867,
                4943
            ],
            [
                4943,
                4980
            ],
            [
                4981,
                4991
            ],
            [
                4992,
                5015
            ],
            [
                5016,
                5048
            ],
            [
                5048,
                5099
            ],
            [
                5099,
                5151
            ],
            [
                5158,
                5186
            ],
            [
                5187,
                5213
            ],
            [
                5213,
                5223
            ],
            [
                5224,
                5233
            ],
            [
                5234,
                5294
            ],
            [
                5303,
                5307
            ],
            [
                5307,
                5352
            ],
            [
                5352,
                5401
            ],
            [
                5401,
                5444
            ],
            [
                5445,
                5463
            ],
            [
                5463,
                5556
            ],
            [
                5556,
                5558
            ],
            [
                5558,
                5619
            ],
            [
                5620,
                5625
            ],
            [
                5628,
                5644
            ],
            [
                5649,
                5718
            ],
            [
                5729,
                5784
            ],
            [
                5788,
                5797
            ],
            [
                5798,
                5805
            ],
            [
                5805,
                5827
            ],
            [
                5827,
                5847
            ],
            [
                5848,
                5887
            ],
            [
                5888,
                5907
            ],
            [
                5908,
                5973
            ],
            [
                5973,
                5975
            ],
            [
                5975,
                6016
            ],
            [
                6017,
                6052
            ],
            [
                6057,
                6064
            ],
            [
                6069,
                6077
            ],
            [
                6078,
                6081
            ],
            [
                6086,
                6090
            ],
            [
                6090,
                6092
            ],
            [
                6092,
                6097
            ],
            [
                6098,
                6136
            ],
            [
                6152,
                6195
            ],
            [
                6195,
                6229
            ],
            [
                6230,
                6237
            ],
            [
                6238,
                6352
            ],
            [
                6358,
                6361
            ],
            [
                6384,
                6423
            ],
            [
                6423,
                6513
            ],
            [
                6514,
                6626
            ],
            [
                6627,
                6661
            ],
            [
                6661,
                6665
            ],
            [
                6672,
                6732
            ],
            [
                6735,
                6738
            ],
            [
                6743,
                6797
            ],
            [
                6797,
                6862
            ],
            [
                6863,
                6866
            ],
            [
                6883,
                6964
            ],
            [
                6964,
                7075
            ]
        ],
        "row_chars": [
            [
                0,
                144
            ],
            [
                144,
                491
            ],
            [
                491,
                556
            ],
            [
                556,
                803
            ],
            [
                803,
                941
            ],
            [
                941,
                1006
            ],
            [
                1006,
                1097
            ],
            [
                1097,
                1097
            ],
            [
                1097,
                1097
            ],
            [
                1097,
                1333
            ],
            [
                1333,
                1418
            ],
            [
                1418,
                1498
            ],
            [
                1498,
                1608
            ],
            [
                1608,
                1667
            ],
            [
                1667,
                1694
            ],
            [
                1694,
                1743
            ],
            [
                1743,
                1874
            ],
            [
                1874,
                2082
            ],
            [
                2082,
                2182
            ],
            [
                2182,
                2373
            ],
            [
                2373,
                2451
            ],
            [
                2451,
                2509
            ],
            [
                2509,
                2509
            ],
            [
                2509,
                2564
            ],
            [
                2564,
                2724
            ],
            [
                2724,
                2810
            ],
            [
                2810,
                2830
            ],
            [
                2830,
                2845
            ],
            [
                2845,
                3018
            ],
            [
                3018,
                3082
            ],
            [
                3082,
                3226
            ],
            [
                3226,
                3364
            ],
            [
                3364,
                3450
            ],
            [
                3450,
                3477
            ],
            [
                3477,
                3765
            ],
            [
                3765,
                3937
            ],
            [
                3937,
                3937
            ],
            [
                3937,
                4057
            ],
            [
                4057,
                4101
            ],
            [
                4101,
                4142
            ],
            [
                4142,
                4200
            ],
            [
                4200,
                4250
            ],
            [
                4250,
                4283
            ],
            [
                4283,
                4283
            ],
            [
                4283,
                4345
            ],
            [
                4345,
                4391
            ],
            [
                4391,
                4417
            ],
            [
                4417,
                4528
            ],
            [
                4528,
                4616
            ],
            [
                4616,
                4791
            ],
            [
                4791,
                4867
            ],
            [
                4867,
                5048
            ],
            [
                5048,
                5099
            ],
            [
                5099,
                5352
            ],
            [
                5352,
                5401
            ],
            [
                5401,
                5463
            ],
            [
                5463,
                5558
            ],
            [
                5558,
                5805
            ],
            [
                5805,
                5827
            ],
            [
                5827,
                5908
            ],
            [
                5908,
                5908
            ],
            [
                5908,
                5908
            ],
            [
                5908,
                5975
            ],
            [
                5975,
                6092
            ],
            [
                6092,
                6195
            ],
            [
                6195,
                6423
            ],
            [
                6423,
                6661
            ],
            [
                6661,
                6732
            ],
            [
                6732,
                6797
            ],
            [
                6797,
                6964
            ],
            [
                6964,
                7075
            ]
        ]
    }
}