{
    "original": {
        "text": "Seven weeks of the two months were very nearly gone, when the one letter, the letter from Edmund, so long expected, was put into Fanny's hands. As she opened, and saw its length, she prepared herself for a minute detail of happiness and a profusion of love and praise towards the fortunate creature who was now mistress of his fate. These were the contents-\n\"My Dear Fanny,-Excuse me that I have not written before. Crawford told me that you were wishing to hear from me, but I found it impossible to write from London, and persuaded myself that you would understand my silence. Could I have sent a few happy lines, they should not have been wanting, but nothing of that nature was ever in my power. I am returned to Mansfield in a less assured state than when I left it. My hopes are much weaker. You are probably aware of this already. So very fond of you as Miss Crawford is, it is most natural that she should tell you enough of her own feelings to furnish a tolerable guess at mine. I will not be prevented, however, from making my own communication. Our confidences in you need not clash. I ask no questions. There is something soothing in the idea that we have the same friend, and that whatever unhappy differences of opinion may exist between us, we are united in our love of you. It will be a comfort to me to tell you how things now are, and what are my present plans, if plans I can be said to have. I have been returned since Saturday. I was three weeks in London, and saw her (for London) very often. I had every attention from the Frasers that could be reasonably expected. I dare say I was not reasonable in carrying with me hopes of an intercourse at all like that of Mansfield. It was her manner, however, rather than any unfrequency of meeting. Had she been different when I did see her, I should have made no complaint, but from the very first she was altered: my first reception was so unlike what I had hoped, that I had almost resolved on leaving London again directly. I need not particularise. You know the weak side of her character, and may imagine the sentiments and expressions which were torturing me. She was in high spirits, and surrounded by those who were giving all the support of their own bad sense to her too lively mind. I do not like Mrs. Fraser. She is a cold-hearted, vain woman, who has married entirely from convenience, and though evidently unhappy in her marriage, places her disappointment not to faults of judgment, or temper, or disproportion of age, but to her being, after all, less affluent than many of her acquaintance, especially than her sister, Lady Stornaway, and is the determined supporter of everything mercenary and ambitious, provided it be only mercenary and ambitious enough. I look upon her intimacy with those two sisters as the greatest misfortune of her life and mine. They have been leading her astray for years. Could she be detached from them!-and sometimes I do not despair of it, for the affection appears to me principally on their side. They are very fond of her; but I am sure she does not love them as she loves you. When I think of her great attachment to you, indeed, and the whole of her judicious, upright conduct as a sister, she appears a very different creature, capable of everything noble, and I am ready to blame myself for a too harsh construction of a playful manner. I cannot give her up, Fanny. She is the only woman in the world whom I could ever think of as a wife. If I did not believe that she had some regard for me, of course I should not say this, but I do believe it. I am convinced that she is not without a decided preference. I have no jealousy of any individual. It is the influence of the fashionable world altogether that I am jealous of. It is the habits of wealth that I fear. Her ideas are not higher than her own fortune may warrant, but they are beyond what our incomes united could authorise. There is comfort, however, even here. I could better bear to lose her because not rich enough, than because of my profession. That would only prove her affection not equal to sacrifices, which, in fact, I am scarcely justified in asking; and, if I am refused, that, I think, will be the honest motive. Her prejudices, I trust, are not so strong as they were. You have my thoughts exactly as they arise, my dear Fanny; perhaps they are sometimes contradictory, but it will not be a less faithful picture of my mind. Having once begun, it is a pleasure to me to tell you all I feel. I cannot give her up. Connected as we already are, and, I hope, are to be, to give up Mary Crawford would be to give up the society of some of those most dear to me; to banish myself from the very houses and friends whom, under any other distress, I should turn to for consolation. The loss of Mary I must consider as comprehending the loss of Crawford and of Fanny. Were it a decided thing, an actual refusal, I hope I should know how to bear it, and how to endeavour to weaken her hold on my heart, and in the course of a few years-but I am writing nonsense. Were I refused, I must bear it; and till I am, I can never cease to try for her. This is the truth. The only question is _how_? What may be the likeliest means? I have sometimes thought of going to London again after Easter, and sometimes resolved on doing nothing till she returns to Mansfield. Even now, she speaks with pleasure of being in Mansfield in June; but June is at a great distance, and I believe I shall write to her. I have nearly determined on explaining myself by letter. To be at an early certainty is a material object. My present state is miserably irksome. Considering everything, I think a letter will be decidedly the best method of explanation. I shall be able to write much that I could not say, and shall be giving her time for reflection before she resolves on her answer, and I am less afraid of the result of reflection than of an immediate hasty impulse; I think I am. My greatest danger would lie in her consulting Mrs. Fraser, and I at a distance unable to help my own cause. A letter exposes to all the evil of consultation, and where the mind is anything short of perfect decision, an adviser may, in an unlucky moment, lead it to do what it may afterwards regret. I must think this matter over a little. This long letter, full of my own concerns alone, will be enough to tire even the friendship of a Fanny. The last time I saw Crawford was at Mrs. Fraser's party. I am more and more satisfied with all that I see and hear of him. There is not a shadow of wavering. He thoroughly knows his own mind, and acts up to his resolutions: an inestimable quality. I could not see him and my eldest sister in the same room without recollecting what you once told me, and I acknowledge that they did not meet as friends. There was marked coolness on her side. They scarcely spoke. I saw him draw back surprised, and I was sorry that Mrs. Rushworth should resent any former supposed slight to Miss Bertram. You will wish to hear my opinion of Maria's degree of comfort as a wife. There is no appearance of unhappiness. I hope they get on pretty well together. I dined twice in Wimpole Street, and might have been there oftener, but it is mortifying to be with Rushworth as a brother. Julia seems to enjoy London exceedingly. I had little enjoyment there, but have less here. We are not a lively party. You are very much wanted. I miss you more than I can express. My mother desires her best love, and hopes to hear from you soon. She talks of you almost every hour, and I am sorry to find how many weeks more she is likely to be without you. My father means to fetch you himself, but it will not be till after Easter, when he has business in town. You are happy at Portsmouth, I hope, but this must not be a yearly visit. I want you at home, that I may have your opinion about Thornton Lacey. I have little heart for extensive improvements till I know that it will ever have a mistress. I think I shall certainly write. It is quite settled that the Grants go to Bath; they leave Mansfield on Monday. I am glad of it. I am not comfortable enough to be fit for anybody; but your aunt seems to feel out of luck that such an article of Mansfield news should fall to my pen instead of hers.-Yours ever, my dearest Fanny.\"\n\"I never will, no, I certainly never will wish for a letter again,\" was Fanny's secret declaration as she finished this. \"What do they bring but disappointment and sorrow? Not till after Easter! How shall I bear it? And my poor aunt talking of me every hour!\"\nFanny checked the tendency of these thoughts as well as she could, but she was within half a minute of starting the idea that Sir Thomas was quite unkind, both to her aunt and to herself. As for the main subject of the letter, there was nothing in that to soothe irritation. She was almost vexed into displeasure and anger against Edmund. \"There is no good in this delay,\" said she. \"Why is not it settled? He is blinded, and nothing will open his eyes; nothing can, after having had truths before him so long in vain. He will marry her, and be poor and miserable. God grant that her influence do not make him cease to be respectable!\" She looked over the letter again. \"'So very fond of me!' 'tis nonsense all. She loves nobody but herself and her brother. Her friends leading her astray for years! She is quite as likely to have led _them_ astray. They have all, perhaps, been corrupting one another; but if they are so much fonder of her than she is of them, she is the less likely to have been hurt, except by their flattery. 'The only woman in the world whom he could ever think of as a wife.' I firmly believe it. It is an attachment to govern his whole life. Accepted or refused, his heart is wedded to her for ever. 'The loss of Mary I must consider as comprehending the loss of Crawford and Fanny.' Edmund, you do not know me. The families would never be connected if you did not connect them! Oh! write, write. Finish it at once. Let there be an end of this suspense. Fix, commit, condemn yourself.\"\nSuch sensations, however, were too near akin to resentment to be long guiding Fanny's soliloquies. She was soon more softened and sorrowful. His warm regard, his kind expressions, his confidential treatment, touched her strongly. He was only too good to everybody. It was a letter, in short, which she would not but have had for the world, and which could never be valued enough. This was the end of it.\nEverybody at all addicted to letter-writing, without having much to say, which will include a large proportion of the female world at least, must feel with Lady Bertram that she was out of luck in having such a capital piece of Mansfield news as the certainty of the Grants going to Bath, occur at a time when she could make no advantage of it, and will admit that it must have been very mortifying to her to see it fall to the share of her thankless son, and treated as concisely as possible at the end of a long letter, instead of having it to spread over the largest part of a page of her own. For though Lady Bertram rather shone in the epistolary line, having early in her marriage, from the want of other employment, and the circumstance of Sir Thomas's being in Parliament, got into the way of making and keeping correspondents, and formed for herself a very creditable, common-place, amplifying style, so that a very little matter was enough for her: she could not do entirely without any; she must have something to write about, even to her niece; and being so soon to lose all the benefit of Dr. Grant's gouty symptoms and Mrs. Grant's morning calls, it was very hard upon her to be deprived of one of the last epistolary uses she could put them to.\nThere was a rich amends, however, preparing for her. Lady Bertram's hour of good luck came. Within a few days from the receipt of Edmund's letter, Fanny had one from her aunt, beginning thus-\n\"My Dear Fanny,-I take up my pen to communicate some very alarming intelligence, which I make no doubt will give you much concern\".\nThis was a great deal better than to have to take up the pen to acquaint her with all the particulars of the Grants' intended journey, for the present intelligence was of a nature to promise occupation for the pen for many days to come, being no less than the dangerous illness of her eldest son, of which they had received notice by express a few hours before.\nTom had gone from London with a party of young men to Newmarket, where a neglected fall and a good deal of drinking had brought on a fever; and when the party broke up, being unable to move, had been left by himself at the house of one of these young men to the comforts of sickness and solitude, and the attendance only of servants. Instead of being soon well enough to follow his friends, as he had then hoped, his disorder increased considerably, and it was not long before he thought so ill of himself as to be as ready as his physician to have a letter despatched to Mansfield.\n\"This distressing intelligence, as you may suppose,\" observed her ladyship, after giving the substance of it, \"has agitated us exceedingly, and we cannot prevent ourselves from being greatly alarmed and apprehensive for the poor invalid, whose state Sir Thomas fears may be very critical; and Edmund kindly proposes attending his brother immediately, but I am happy to add that Sir Thomas will not leave me on this distressing occasion, as it would be too trying for me. We shall greatly miss Edmund in our small circle, but I trust and hope he will find the poor invalid in a less alarming state than might be apprehended, and that he will be able to bring him to Mansfield shortly, which Sir Thomas proposes should be done, and thinks best on every account, and I flatter myself the poor sufferer will soon be able to bear the removal without material inconvenience or injury. As I have little doubt of your feeling for us, my dear Fanny, under these distressing circumstances, I will write again very soon.\"\nFanny's feelings on the occasion were indeed considerably more warm and genuine than her aunt's style of writing. She felt truly for them all. Tom dangerously ill, Edmund gone to attend him, and the sadly small party remaining at Mansfield, were cares to shut out every other care, or almost every other. She could just find selfishness enough to wonder whether Edmund _had_ written to Miss Crawford before this summons came, but no sentiment dwelt long with her that was not purely affectionate and disinterestedly anxious. Her aunt did not neglect her: she wrote again and again; they were receiving frequent accounts from Edmund, and these accounts were as regularly transmitted to Fanny, in the same diffuse style, and the same medley of trusts, hopes, and fears, all following and producing each other at haphazard. It was a sort of playing at being frightened. The sufferings which Lady Bertram did not see had little power over her fancy; and she wrote very comfortably about agitation, and anxiety, and poor invalids, till Tom was actually conveyed to Mansfield, and her own eyes had beheld his altered appearance. Then a letter which she had been previously preparing for Fanny was finished in a different style, in the language of real feeling and alarm; then she wrote as she might have spoken. \"He is just come, my dear Fanny, and is taken upstairs; and I am so shocked to see him, that I do not know what to do. I am sure he has been very ill. Poor Tom! I am quite grieved for him, and very much frightened, and so is Sir Thomas; and how glad I should be if you were here to comfort me. But Sir Thomas hopes he will be better to-morrow, and says we must consider his journey.\"\nThe real solicitude now awakened in the maternal bosom was not soon over. Tom's extreme impatience to be removed to Mansfield, and experience those comforts of home and family which had been little thought of in uninterrupted health, had probably induced his being conveyed thither too early, as a return of fever came on, and for a week he was in a more alarming state than ever. They were all very seriously frightened. Lady Bertram wrote her daily terrors to her niece, who might now be said to live upon letters, and pass all her time between suffering from that of to-day and looking forward to to-morrow's. Without any particular affection for her eldest cousin, her tenderness of heart made her feel that she could not spare him, and the purity of her principles added yet a keener solicitude, when she considered how little useful, how little self-denying his life had (apparently) been.\nSusan was her only companion and listener on this, as on more common occasions. Susan was always ready to hear and to sympathise. Nobody else could be interested in so remote an evil as illness in a family above an hundred miles off; not even Mrs. Price, beyond a brief question or two, if she saw her daughter with a letter in her hand, and now and then the quiet observation of, \"My poor sister Bertram must be in a great deal of trouble.\"\nSo long divided and so differently situated, the ties of blood were little more than nothing. An attachment, originally as tranquil as their tempers, was now become a mere name. Mrs. Price did quite as much for Lady Bertram as Lady Bertram would have done for Mrs. Price. Three or four Prices might have been swept away, any or all except Fanny and William, and Lady Bertram would have thought little about it; or perhaps might have caught from Mrs. Norris's lips the cant of its being a very happy thing and a great blessing to their poor dear sister Price to have them so well provided for.",
        "paragraph_chars": [
            [
                0,
                358
            ],
            [
                358,
                8287
            ],
            [
                8287,
                8547
            ],
            [
                8547,
                10057
            ],
            [
                10057,
                10461
            ],
            [
                10461,
                11721
            ],
            [
                11721,
                11913
            ],
            [
                11913,
                12045
            ],
            [
                12045,
                12407
            ],
            [
                12407,
                12990
            ],
            [
                12990,
                14001
            ],
            [
                14001,
                15691
            ],
            [
                15691,
                16587
            ],
            [
                16587,
                17029
            ],
            [
                17029,
                17621
            ]
        ],
        "segment_chars": [
            [
                0,
                144
            ],
            [
                144,
                333
            ],
            [
                333,
                358
            ],
            [
                358,
                416
            ],
            [
                416,
                579
            ],
            [
                579,
                700
            ],
            [
                700,
                772
            ],
            [
                772,
                798
            ],
            [
                798,
                838
            ],
            [
                838,
                988
            ],
            [
                988,
                1056
            ],
            [
                1056,
                1095
            ],
            [
                1095,
                1115
            ],
            [
                1115,
                1290
            ],
            [
                1290,
                1412
            ],
            [
                1412,
                1449
            ],
            [
                1449,
                1515
            ],
            [
                1515,
                1589
            ],
            [
                1589,
                1696
            ],
            [
                1696,
                1764
            ],
            [
                1764,
                1993
            ],
            [
                1993,
                2019
            ],
            [
                2019,
                2132
            ],
            [
                2132,
                2260
            ],
            [
                2260,
                2287
            ],
            [
                2287,
                2741
            ],
            [
                2741,
                2838
            ],
            [
                2838,
                2883
            ],
            [
                2883,
                3013
            ],
            [
                3013,
                3095
            ],
            [
                3095,
                3358
            ],
            [
                3358,
                3387
            ],
            [
                3387,
                3460
            ],
            [
                3460,
                3568
            ],
            [
                3568,
                3629
            ],
            [
                3629,
                3667
            ],
            [
                3667,
                3745
            ],
            [
                3745,
                3785
            ],
            [
                3785,
                3905
            ],
            [
                3905,
                3943
            ],
            [
                3943,
                4031
            ],
            [
                4031,
                4207
            ],
            [
                4207,
                4264
            ],
            [
                4264,
                4420
            ],
            [
                4420,
                4486
            ],
            [
                4486,
                4508
            ],
            [
                4508,
                4768
            ],
            [
                4768,
                4853
            ],
            [
                4853,
                5047
            ],
            [
                5047,
                5128
            ],
            [
                5128,
                5147
            ],
            [
                5147,
                5175
            ],
            [
                5175,
                5208
            ],
            [
                5208,
                5343
            ],
            [
                5343,
                5478
            ],
            [
                5478,
                5535
            ],
            [
                5535,
                5585
            ],
            [
                5585,
                5624
            ],
            [
                5624,
                5715
            ],
            [
                5715,
                5945
            ],
            [
                5945,
                6054
            ],
            [
                6054,
                6245
            ],
            [
                6245,
                6285
            ],
            [
                6285,
                6389
            ],
            [
                6389,
                6446
            ],
            [
                6446,
                6512
            ],
            [
                6512,
                6547
            ],
            [
                6547,
                6637
            ],
            [
                6637,
                6792
            ],
            [
                6792,
                6831
            ],
            [
                6831,
                6852
            ],
            [
                6852,
                6977
            ],
            [
                6977,
                7050
            ],
            [
                7050,
                7089
            ],
            [
                7089,
                7130
            ],
            [
                7130,
                7254
            ],
            [
                7254,
                7295
            ],
            [
                7295,
                7345
            ],
            [
                7345,
                7372
            ],
            [
                7372,
                7398
            ],
            [
                7398,
                7434
            ],
            [
                7434,
                7500
            ],
            [
                7500,
                7612
            ],
            [
                7612,
                7718
            ],
            [
                7718,
                7792
            ],
            [
                7792,
                7863
            ],
            [
                7863,
                7957
            ],
            [
                7957,
                7990
            ],
            [
                7990,
                8070
            ],
            [
                8070,
                8087
            ],
            [
                8087,
                8287
            ],
            [
                8287,
                8408
            ],
            [
                8408,
                8459
            ],
            [
                8459,
                8482
            ],
            [
                8482,
                8503
            ],
            [
                8503,
                8547
            ],
            [
                8547,
                8735
            ],
            [
                8735,
                8822
            ],
            [
                8822,
                8886
            ],
            [
                8886,
                8930
            ],
            [
                8930,
                8954
            ],
            [
                8954,
                9066
            ],
            [
                9066,
                9112
            ],
            [
                9112,
                9183
            ],
            [
                9183,
                9217
            ],
            [
                9217,
                9240
            ],
            [
                9240,
                9259
            ],
            [
                9259,
                9305
            ],
            [
                9305,
                9347
            ],
            [
                9347,
                9397
            ],
            [
                9397,
                9577
            ],
            [
                9577,
                9646
            ],
            [
                9646,
                9667
            ],
            [
                9667,
                9713
            ],
            [
                9713,
                9771
            ],
            [
                9771,
                9855
            ],
            [
                9855,
                9883
            ],
            [
                9883,
                9950
            ],
            [
                9950,
                9954
            ],
            [
                9954,
                9968
            ],
            [
                9968,
                9987
            ],
            [
                9987,
                10025
            ],
            [
                10025,
                10057
            ],
            [
                10057,
                10156
            ],
            [
                10156,
                10198
            ],
            [
                10198,
                10287
            ],
            [
                10287,
                10322
            ],
            [
                10322,
                10437
            ],
            [
                10437,
                10461
            ],
            [
                10461,
                11058
            ],
            [
                11058,
                11721
            ],
            [
                11721,
                11774
            ],
            [
                11774,
                11813
            ],
            [
                11813,
                11913
            ],
            [
                11913,
                12045
            ],
            [
                12045,
                12407
            ],
            [
                12407,
                12741
            ],
            [
                12741,
                12990
            ],
            [
                12990,
                13461
            ],
            [
                13461,
                13869
            ],
            [
                13869,
                14001
            ],
            [
                14001,
                14115
            ],
            [
                14115,
                14144
            ],
            [
                14144,
                14306
            ],
            [
                14306,
                14526
            ],
            [
                14526,
                14822
            ],
            [
                14822,
                14868
            ],
            [
                14868,
                15124
            ],
            [
                15124,
                15307
            ],
            [
                15307,
                15426
            ],
            [
                15426,
                15468
            ],
            [
                15468,
                15601
            ],
            [
                15601,
                15691
            ],
            [
                15691,
                15765
            ],
            [
                15765,
                16072
            ],
            [
                16072,
                16113
            ],
            [
                16113,
                16304
            ],
            [
                16304,
                16587
            ],
            [
                16587,
                16667
            ],
            [
                16667,
                16717
            ],
            [
                16717,
                17029
            ],
            [
                17029,
                17123
            ],
            [
                17123,
                17207
            ],
            [
                17207,
                17301
            ],
            [
                17301,
                17621
            ]
        ],
        "overlap_chars": [
            [
                0,
                34
            ],
            [
                47,
                61
            ],
            [
                66,
                144
            ],
            [
                144,
                150
            ],
            [
                163,
                251
            ],
            [
                261,
                275
            ],
            [
                323,
                326
            ],
            [
                331,
                333
            ],
            [
                333,
                358
            ],
            [
                358,
                380
            ],
            [
                396,
                399
            ],
            [
                408,
                416
            ],
            [
                416,
                441
            ],
            [
                455,
                579
            ],
            [
                579,
                615
            ],
            [
                621,
                627
            ],
            [
                632,
                636
            ],
            [
                649,
                700
            ],
            [
                700,
                772
            ],
            [
                772,
                798
            ],
            [
                798,
                836
            ],
            [
                836,
                838
            ],
            [
                988,
                989
            ],
            [
                1011,
                1020
            ],
            [
                1054,
                1056
            ],
            [
                1056,
                1095
            ],
            [
                1115,
                1290
            ],
            [
                1290,
                1347
            ],
            [
                1410,
                1411
            ],
            [
                1449,
                1489
            ],
            [
                1503,
                1515
            ],
            [
                1589,
                1623
            ],
            [
                1641,
                1652
            ],
            [
                1672,
                1696
            ],
            [
                1844,
                1883
            ],
            [
                1890,
                1938
            ],
            [
                1943,
                1993
            ],
            [
                2132,
                2196
            ],
            [
                2201,
                2260
            ],
            [
                2260,
                2287
            ],
            [
                2287,
                2410
            ],
            [
                2418,
                2440
            ],
            [
                2444,
                2462
            ],
            [
                2464,
                2473
            ],
            [
                2498,
                2516
            ],
            [
                2529,
                2542
            ],
            [
                2585,
                2616
            ],
            [
                2622,
                2624
            ],
            [
                2664,
                2687
            ],
            [
                2739,
                2741
            ],
            [
                2741,
                2752
            ],
            [
                2757,
                2838
            ],
            [
                2838,
                2883
            ],
            [
                2889,
                2892
            ],
            [
                2883,
                2888
            ],
            [
                2893,
                3013
            ],
            [
                3044,
                3095
            ],
            [
                3095,
                3151
            ],
            [
                3165,
                3168
            ],
            [
                3188,
                3339
            ],
            [
                3342,
                3358
            ],
            [
                3358,
                3387
            ],
            [
                3387,
                3460
            ],
            [
                3460,
                3493
            ],
            [
                3499,
                3568
            ],
            [
                3568,
                3629
            ],
            [
                3629,
                3667
            ],
            [
                3667,
                3711
            ],
            [
                3723,
                3745
            ],
            [
                3745,
                3785
            ],
            [
                3785,
                3905
            ],
            [
                3905,
                3943
            ],
            [
                3943,
                4031
            ],
            [
                4207,
                4264
            ],
            [
                4264,
                4420
            ],
            [
                4420,
                4486
            ],
            [
                4486,
                4508
            ],
            [
                4508,
                4768
            ],
            [
                4768,
                4784
            ],
            [
                4787,
                4791
            ],
            [
                4818,
                4853
            ],
            [
                4853,
                4860
            ],
            [
                4878,
                5047
            ],
            [
                5047,
                5128
            ],
            [
                5128,
                5147
            ],
            [
                5147,
                5167
            ],
            [
                5169,
                5172
            ],
            [
                5173,
                5175
            ],
            [
                5208,
                5343
            ],
            [
                5343,
                5478
            ],
            [
                5585,
                5624
            ],
            [
                5624,
                5672
            ],
            [
                5687,
                5691
            ],
            [
                5713,
                5715
            ],
            [
                5715,
                5795
            ],
            [
                5811,
                5821
            ],
            [
                5844,
                5945
            ],
            [
                5945,
                6003
            ],
            [
                6052,
                6054
            ],
            [
                6108,
                6125
            ],
            [
                6135,
                6245
            ],
            [
                6245,
                6274
            ],
            [
                6283,
                6284
            ],
            [
                6285,
                6326
            ],
            [
                6332,
                6389
            ],
            [
                6389,
                6446
            ],
            [
                6446,
                6512
            ],
            [
                6512,
                6547
            ],
            [
                6547,
                6611
            ],
            [
                6635,
                6637
            ],
            [
                6637,
                6792
            ],
            [
                6792,
                6831
            ],
            [
                6831,
                6852
            ],
            [
                6852,
                6977
            ],
            [
                6977,
                7050
            ],
            [
                7050,
                7089
            ],
            [
                7089,
                7130
            ],
            [
                7130,
                7254
            ],
            [
                7254,
                7295
            ],
            [
                7295,
                7345
            ],
            [
                7345,
                7372
            ],
            [
                7372,
                7398
            ],
            [
                7398,
                7434
            ],
            [
                7434,
                7500
            ],
            [
                7500,
                7516
            ],
            [
                7524,
                7612
            ],
            [
                7612,
                7686
            ],
            [
                7716,
                7718
            ],
            [
                7718,
                7758
            ],
            [
                7792,
                7863
            ],
            [
                7863,
                7957
            ],
            [
                7957,
                7988
            ],
            [
                8254,
                8287
            ],
            [
                8287,
                8366
            ],
            [
                8374,
                8408
            ],
            [
                8408,
                8459
            ],
            [
                8459,
                8482
            ],
            [
                8482,
                8503
            ],
            [
                8503,
                8547
            ],
            [
                8547,
                8560
            ],
            [
                8577,
                8621
            ],
            [
                8668,
                8735
            ],
            [
                8735,
                8773
            ],
            [
                8822,
                8847
            ],
            [
                8864,
                8886
            ],
            [
                8886,
                8930
            ],
            [
                8930,
                8954
            ],
            [
                8954,
                8999
            ],
            [
                9064,
                9066
            ],
            [
                9066,
                9110
            ],
            [
                9183,
                9217
            ],
            [
                9217,
                9240
            ],
            [
                9240,
                9259
            ],
            [
                9259,
                9305
            ],
            [
                9305,
                9347
            ],
            [
                9347,
                9381
            ],
            [
                9383,
                9387
            ],
            [
                9389,
                9397
            ],
            [
                9397,
                9448
            ],
            [
                9575,
                9577
            ],
            [
                9577,
                9646
            ],
            [
                9646,
                9667
            ],
            [
                9667,
                9713
            ],
            [
                9713,
                9771
            ],
            [
                9771,
                9788
            ],
            [
                9791,
                9795
            ],
            [
                9822,
                9846
            ],
            [
                9847,
                9855
            ],
            [
                9855,
                9883
            ],
            [
                9883,
                9950
            ],
            [
                9950,
                9954
            ],
            [
                9954,
                9968
            ],
            [
                9968,
                9987
            ],
            [
                9987,
                10025
            ],
            [
                10025,
                10057
            ],
            [
                10057,
                10091
            ],
            [
                10102,
                10118
            ],
            [
                10122,
                10126
            ],
            [
                10154,
                10156
            ],
            [
                10156,
                10198
            ],
            [
                10198,
                10213
            ],
            [
                10235,
                10287
            ],
            [
                10287,
                10322
            ],
            [
                10322,
                10437
            ],
            [
                10437,
                10461
            ],
            [
                11820,
                11830
            ],
            [
                11851,
                11913
            ],
            [
                11913,
                12045
            ],
            [
                12098,
                12101
            ],
            [
                12196,
                12212
            ],
            [
                12288,
                12368
            ],
            [
                12387,
                12407
            ],
            [
                12407,
                12575
            ],
            [
                12598,
                12661
            ],
            [
                12596,
                12597
            ],
            [
                12708,
                12741
            ],
            [
                12741,
                12807
            ],
            [
                12813,
                12842
            ],
            [
                12855,
                12860
            ],
            [
                12956,
                12964
            ],
            [
                12864,
                12867
            ],
            [
                12965,
                12990
            ],
            [
                12990,
                13065
            ],
            [
                13100,
                13188
            ],
            [
                13206,
                13461
            ],
            [
                13515,
                13531
            ],
            [
                13483,
                13489
            ],
            [
                13535,
                13690
            ],
            [
                13720,
                13843
            ],
            [
                13861,
                13869
            ],
            [
                13869,
                13930
            ],
            [
                13970,
                14001
            ],
            [
                14001,
                14115
            ],
            [
                14115,
                14144
            ],
            [
                14144,
                14199
            ],
            [
                14212,
                14264
            ],
            [
                14286,
                14304
            ],
            [
                14277,
                14281
            ],
            [
                14304,
                14306
            ],
            [
                14306,
                14369
            ],
            [
                14371,
                14374
            ],
            [
                14376,
                14430
            ],
            [
                14464,
                14468
            ],
            [
                14434,
                14443
            ],
            [
                14473,
                14476
            ],
            [
                14450,
                14454
            ],
            [
                14524,
                14525
            ],
            [
                14526,
                14534
            ],
            [
                14560,
                14749
            ],
            [
                14783,
                14786
            ],
            [
                14751,
                14756
            ],
            [
                14758,
                14767
            ],
            [
                14820,
                14822
            ],
            [
                14822,
                14868
            ],
            [
                14868,
                14983
            ],
            [
                15012,
                15088
            ],
            [
                15093,
                15124
            ],
            [
                15124,
                15151
            ],
            [
                15182,
                15306
            ],
            [
                15307,
                15426
            ],
            [
                15426,
                15468
            ],
            [
                15468,
                15601
            ],
            [
                15601,
                15691
            ],
            [
                15695,
                15710
            ],
            [
                15746,
                15765
            ],
            [
                15765,
                15770
            ],
            [
                15779,
                15816
            ],
            [
                15925,
                15937
            ],
            [
                15946,
                15955
            ],
            [
                15973,
                15982
            ],
            [
                15987,
                16072
            ],
            [
                16072,
                16113
            ],
            [
                16113,
                16206
            ],
            [
                16302,
                16304
            ],
            [
                16304,
                16529
            ],
            [
                16555,
                16587
            ],
            [
                16587,
                16605
            ],
            [
                16620,
                16643
            ],
            [
                16656,
                16667
            ],
            [
                16667,
                16717
            ],
            [
                16717,
                16780
            ],
            [
                16799,
                16872
            ],
            [
                16923,
                17028
            ],
            [
                17029,
                17122
            ]
        ],
        "row_chars": [
            [
                0,
                144
            ],
            [
                144,
                333
            ],
            [
                333,
                358
            ],
            [
                358,
                416
            ],
            [
                416,
                579
            ],
            [
                579,
                700
            ],
            [
                700,
                772
            ],
            [
                772,
                798
            ],
            [
                798,
                838
            ],
            [
                838,
                988
            ],
            [
                988,
                1056
            ],
            [
                1056,
                1095
            ],
            [
                1095,
                1115
            ],
            [
                1115,
                1290
            ],
            [
                1290,
                1412
            ],
            [
                1412,
                1449
            ],
            [
                1449,
                1515
            ],
            [
                1515,
                1589
            ],
            [
                1589,
                1696
            ],
            [
                1696,
                1764
            ],
            [
                1764,
                1993
            ],
            [
                1993,
                2019
            ],
            [
                2019,
                2132
            ],
            [
                2132,
                2260
            ],
            [
                2260,
                2287
            ],
            [
                2287,
                2741
            ],
            [
                2741,
                2838
            ],
            [
                2838,
                2883
            ],
            [
                2883,
                3013
            ],
            [
                3013,
                3095
            ],
            [
                3095,
                3358
            ],
            [
                3358,
                3387
            ],
            [
                3387,
                3460
            ],
            [
                3460,
                3568
            ],
            [
                3568,
                3629
            ],
            [
                3629,
                3667
            ],
            [
                3667,
                3745
            ],
            [
                3745,
                3785
            ],
            [
                3785,
                3905
            ],
            [
                3905,
                3943
            ],
            [
                3943,
                4031
            ],
            [
                4031,
                4207
            ],
            [
                4207,
                4264
            ],
            [
                4264,
                4420
            ],
            [
                4420,
                4486
            ],
            [
                4486,
                4508
            ],
            [
                4508,
                4768
            ],
            [
                4768,
                4853
            ],
            [
                4853,
                5047
            ],
            [
                5047,
                5128
            ],
            [
                5128,
                5147
            ],
            [
                5147,
                5175
            ],
            [
                5175,
                5208
            ],
            [
                5208,
                5343
            ],
            [
                5343,
                5478
            ],
            [
                5478,
                5535
            ],
            [
                5535,
                5585
            ],
            [
                5585,
                5624
            ],
            [
                5624,
                5715
            ],
            [
                5715,
                5945
            ],
            [
                5945,
                6054
            ],
            [
                6054,
                6245
            ],
            [
                6245,
                6285
            ],
            [
                6285,
                6389
            ],
            [
                6389,
                6446
            ],
            [
                6446,
                6512
            ],
            [
                6512,
                6547
            ],
            [
                6547,
                6637
            ],
            [
                6637,
                6792
            ],
            [
                6792,
                6831
            ],
            [
                6831,
                6852
            ],
            [
                6852,
                6977
            ],
            [
                6977,
                7050
            ],
            [
                7050,
                7089
            ],
            [
                7089,
                7130
            ],
            [
                7130,
                7254
            ],
            [
                7254,
                7295
            ],
            [
                7295,
                7345
            ],
            [
                7345,
                7372
            ],
            [
                7372,
                7398
            ],
            [
                7398,
                7434
            ],
            [
                7434,
                7500
            ],
            [
                7500,
                7612
            ],
            [
                7612,
                7718
            ],
            [
                7718,
                7863
            ],
            [
                7863,
                7957
            ],
            [
                7957,
                8287
            ],
            [
                8287,
                8408
            ],
            [
                8408,
                8459
            ],
            [
                8459,
                8482
            ],
            [
                8482,
                8503
            ],
            [
                8503,
                8547
            ],
            [
                8547,
                8735
            ],
            [
                8735,
                8886
            ],
            [
                8886,
                8930
            ],
            [
                8930,
                8954
            ],
            [
                8954,
                9066
            ],
            [
                9066,
                9112
            ],
            [
                9112,
                9183
            ],
            [
                9183,
                9217
            ],
            [
                9217,
                9240
            ],
            [
                9240,
                9259
            ],
            [
                9259,
                9305
            ],
            [
                9305,
                9347
            ],
            [
                9347,
                9397
            ],
            [
                9397,
                9577
            ],
            [
                9577,
                9646
            ],
            [
                9646,
                9667
            ],
            [
                9667,
                9713
            ],
            [
                9713,
                9771
            ],
            [
                9771,
                9855
            ],
            [
                9855,
                9883
            ],
            [
                9883,
                9950
            ],
            [
                9950,
                9954
            ],
            [
                9954,
                9968
            ],
            [
                9968,
                9987
            ],
            [
                9987,
                10025
            ],
            [
                10025,
                10057
            ],
            [
                10057,
                10156
            ],
            [
                10156,
                10198
            ],
            [
                10198,
                10287
            ],
            [
                10287,
                10322
            ],
            [
                10322,
                10437
            ],
            [
                10437,
                10461
            ],
            [
                10461,
                11058
            ],
            [
                11058,
                11721
            ],
            [
                11721,
                11774
            ],
            [
                11774,
                11813
            ],
            [
                11813,
                11913
            ],
            [
                11913,
                12045
            ],
            [
                12045,
                12407
            ],
            [
                12407,
                12741
            ],
            [
                12741,
                12990
            ],
            [
                12990,
                13461
            ],
            [
                13461,
                13869
            ],
            [
                13869,
                14001
            ],
            [
                14001,
                14115
            ],
            [
                14115,
                14144
            ],
            [
                14144,
                14306
            ],
            [
                14306,
                14526
            ],
            [
                14526,
                14822
            ],
            [
                14822,
                14868
            ],
            [
                14868,
                15124
            ],
            [
                15124,
                15307
            ],
            [
                15307,
                15426
            ],
            [
                15426,
                15468
            ],
            [
                15468,
                15601
            ],
            [
                15601,
                15691
            ],
            [
                15691,
                15765
            ],
            [
                15765,
                16072
            ],
            [
                16072,
                16113
            ],
            [
                16113,
                16304
            ],
            [
                16304,
                16587
            ],
            [
                16587,
                16667
            ],
            [
                16667,
                16717
            ],
            [
                16717,
                17029
            ],
            [
                17029,
                17123
            ],
            [
                17123,
                17207
            ],
            [
                17207,
                17301
            ],
            [
                17301,
                17621
            ]
        ]
    },
    "abridged": {
        "text": "Seven weeks of the two months were gone, when the letter, the letter from Edmund, so long expected, was put into Fanny's hands. As she saw its length, she prepared herself for a minute detail of happiness and a profusion of praise towards his future wife. These were the contents-\n\"My Dear Fanny,-Excuse my not writing before. Crawford told me that you wished to hear from me, but I found it impossible to write from London, and persuaded myself that you would understand my silence. Could I have sent a few happy lines, I should have done so, but nothing of that nature was ever in my power. I am returned to Mansfield in a less assured state than when I left it. My hopes are much weaker. You are probably aware of this already from your friend. I may tell you myself, however. Our confidences in you need not clash. There is something soothing in the idea that we have the same friend, and that whatever unhappy differences of opinion may exist between us, we are united in our love of you. It will be a comfort to me to tell you how things now are.\n\"I was three weeks in London, and saw her very often. I dare say I was not reasonable in bringing hopes of an intimacy like that of Mansfield. From the very first she was altered: my reception was so unlike what I had hoped, that I almost resolved on leaving London again directly. She was in high spirits, and surrounded by those who were giving the support of their own bad sense to her too lively mind. I do not like Mrs. Fraser. She is a cold-hearted, vain woman, who has married entirely from convenience, and though evidently unhappy in her marriage, blames her disappointment not on faults of judgment or temper, but to her being less affluent than her sister, Lady Stornaway; she is mercenary and ambitious. I look upon Miss Crawford's intimacy with those two sisters as the greatest misfortune of her life and mine. They have been leading her astray for years. If only she could be detached from them!-and sometimes I do not despair of it, for the affection appears to me principally on their side. I am sure she does not love them as she loves you. When I think of her great attachment to you, indeed, and her conduct as a sister, she appears a very different creature, capable of everything noble, and I am ready to blame myself for a too harsh construction of her playful manner. I cannot give her up, Fanny. She is the only woman in the world whom I could ever think of as a wife. If I did not believe that she had regard for me, of course I should not say this, but I do believe it. I am convinced that she is not without a decided preference. I have no jealousy of any individual. It is the influence of the fashionable world that I am jealous of. It is the habits of wealth that I fear. Her ideas are not higher than her own fortune may warrant, but they are beyond what our incomes united could authorise. There is comfort, however, even here. I could better bear to lose her because not rich enough, than because of my profession. Her prejudices, I trust, are not so strong as they were. You have my thoughts exactly as they arise, my dear Fanny; perhaps they are sometimes contradictory, but it will not be a less faithful picture of my mind. Having once begun, it is a pleasure to me to tell you all I feel. I cannot give her up. Connected as we already are, and, I hope, are to be, to give up Mary Crawford would be to give up the society of some of those most dear to me; to banish myself from the very houses and friends whom, under any other distress, I should turn to for consolation. The loss of Mary must include the loss of Crawford and of Fanny. Were it an actual refusal, I hope I should know how to bear it, and how to endeavour to weaken her hold on my heart, and in the course of a few years-but I am writing nonsense. Were I refused, I must bear it; and till I am, I can never cease to try for her. This is the truth. The only question is how? I have sometimes thought of going to London again after Easter, and sometimes resolved on doing nothing till she returns to Mansfield. Even now, she speaks with pleasure of being in Mansfield in June; but June is at a great distance, and I believe I shall write to her. My present state is miserably irksome. Considering everything, I think a letter will be best. I shall be able to write much that I could not say, and shall be giving her time to reflect before she answers, and I am less afraid of the result of reflection than of an immediate hasty impulse; I think I am. My greatest danger would lie in her consulting Mrs. Fraser. Where the mind is short of perfect decision, an adviser may, in an unlucky moment, lead it to do what it may afterwards regret. I must think this matter over.\n\"This long letter, full of my own concerns, will be enough to tire even the friendship of a Fanny. The last time I saw Crawford was at Mrs. Fraser's party. I am more and more satisfied with all that I see and hear of him. There is not a shadow of wavering. He thoroughly knows his own mind, and acts up to his resolutions. I could not see him and my eldest sister in the same room without recollecting what you once told me, and I acknowledge that they did not meet as friends. There was marked coolness on her side. They scarcely spoke. I saw him draw back surprised, and I was sorry that Mrs. Rushworth should resent any former supposed slight to Miss Bertram. You will wish to hear my opinion of Maria's degree of comfort as a wife. There is no appearance of unhappiness. I hope they get on pretty well together. I dined twice in Wimpole Street, and might have been there oftener, but it is mortifying to be with Rushworth as a brother. Julia seems to enjoy London exceedingly. I had little enjoyment there, but have less here. We are not a lively party. You are very much wanted. I miss you more than I can express. My mother desires her best love, and hopes to hear from you soon. She talks of you every hour, and I am sorry to find how many weeks more she is likely to be without you. My father means to fetch you himself, but it will not be till after Easter. You are happy at Portsmouth, I hope, but I want you at home, that I may have your opinion about Thornton Lacey. I have little heart for extensive improvements till I know that it will ever have a mistress. I think I shall certainly write.-Yours ever, my dearest Fanny.\"\n\"I never will, no, I certainly never will wish for a letter again,\" was Fanny's declaration as she finished this. \"What do they bring but disappointment and sorrow? Not till after Easter! How shall I bear it? And my poor aunt talking of me every hour!\"\nFanny checked these thoughts as well as she could, but she almost considered that Sir Thomas was quite unkind, both to her aunt and to herself. As for the main subject of the letter, she was almost vexed into anger against Edmund. \"There is no good in this delay,\" said she. \"Why is not it settled? He is blinded, and nothing will open his eyes. He will marry her, and be poor and miserable.\" She looked over the letter again. \"'So very fond of me!' 'tis nonsense all. She loves nobody but herself and her brother. Her friends leading her astray for years! She is quite as likely to have led them astray. They have all, perhaps, been corrupting one another. 'The only woman in the world whom he could ever think of as a wife.' I firmly believe it. It is an attachment to govern his whole life. Accepted or refused, his heart is wedded to her for ever. 'The loss of Mary must include the loss of Crawford and of Fanny.' Edmund, you do not know me. The families would never be connected if you did not connect them! Oh! write, write. Finish it at once. Let there be an end of this suspense. Fix, commit, condemn yourself.\"\nSuch sensations, however, were too close to resentment to last long. She was soon more softened and sorrowful. His warm regard, his confidential treatment, touched her strongly. He was only too good to everybody. It was a letter, in short, which she would not but have had for the world, and which could never be valued enough. This was the end of it.\nA few days after receiving Edmund's letter, Fanny had one from her aunt, beginning thus-\n\"My Dear Fanny,-I take up my pen to communicate some very alarming intelligence, which I make no doubt will give you much concern\".\nThe intelligence was no less than the dangerous illness of her eldest son, of which they had received news a few hours before.\nTom had gone from London with a party of young men to Newmarket, where a neglected fall and a good deal of drinking had brought on a fever; and when the party broke up, he had been left by himself at the house of one of these young men, with the attendance only of servants. Instead of being soon well enough to follow his friends, as he had hoped, his disorder increased, and a letter was despatched to Mansfield.\n\"This distressing intelligence, as you may suppose,\" observed her ladyship, \"has agitated us exceedingly, and we cannot prevent ourselves from being greatly alarmed for the poor invalid, whose state Sir Thomas fears may be very critical; and Edmund kindly proposes attending his brother immediately, but I am happy to add that Sir Thomas will not leave me on this distressing occasion, as it would be too trying for me. I trust and hope Edmund will find the poor invalid in a less alarming state than might be apprehended, and that he will be able to bring him to Mansfield shortly, which Sir Thomas thinks best on every account, and I flatter myself the poor sufferer will soon be able to bear the removal without material injury. As I have little doubt of your feeling for us, my dear Fanny, I will write again very soon.\"\nFanny's feelings on the occasion were indeed considerably more warm and genuine than her aunt's style of writing. She felt truly for them all. Tom dangerously ill, Edmund gone to attend him, and the sad party remaining at Mansfield, were cares to shut out almost every other care. She could just find selfishness enough to wonder whether Edmund had written to Miss Crawford before this summons came, but that sentiment did not dwell long.\nHer aunt wrote again and again; they were receiving frequent accounts from Edmund, and these accounts were as regularly transmitted to Fanny, in the same diffuse style, and the same medley of trusts and hopes and fears. It was a sort of playing at being frightened. The sufferings which Lady Bertram did not see had little power over her fancy; and she wrote very comfortably about poor invalids, till Tom was actually conveyed to Mansfield, and her own eyes beheld his altered appearance. Then a letter which she had started to Fanny was finished in a different style, in the language of real feeling and alarm; then she wrote as she might have spoken.\n\"He is just come, my dear Fanny, and is taken upstairs; and I am so shocked to see him, that I do not know what to do. I am sure he has been very ill. Poor Tom! I am quite grieved for him, and very much frightened, and so is Sir Thomas; and how glad I should be if you were here to comfort me. But Sir Thomas hopes he will be better to-morrow, and says we must consider his journey.\"\nThis real solicitude was not soon over. Tom's impatience to be removed to Mansfield had probably led to his being brought there too early; a return of fever came on, and for a week he was in a more alarming state than ever. They were all very seriously frightened. Lady Bertram wrote her daily terrors to her niece, who might now be said to live upon letters. Without any particular affection for her eldest cousin, her tenderness of heart made her feel that she could not spare him, and the purity of her principles added yet a keener solicitude, when she considered how little useful his life had (apparently) been.\nSusan was her only listener on this, as on other occasions. Susan was always ready to hear and to sympathise. Nobody else could be interested in so remote an evil as illness an hundred miles off; not even Mrs. Price, beyond a brief question or two, and now and then the quiet observation of, \"My poor sister Bertram must be in a great deal of trouble.\" So long divided and so differently situated, the ties of blood were little more than nothing.",
        "paragraph_chars": [
            [
                0,
                281
            ],
            [
                281,
                1053
            ],
            [
                1053,
                4725
            ],
            [
                4725,
                6362
            ],
            [
                6362,
                6615
            ],
            [
                6615,
                7736
            ],
            [
                7736,
                8088
            ],
            [
                8088,
                8177
            ],
            [
                8177,
                8309
            ],
            [
                8309,
                8436
            ],
            [
                8436,
                8851
            ],
            [
                8851,
                9676
            ],
            [
                9676,
                10115
            ],
            [
                10115,
                10769
            ],
            [
                10769,
                11153
            ],
            [
                11153,
                11771
            ],
            [
                11771,
                12217
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                256
            ],
            [
                256,
                281
            ],
            [
                281,
                327
            ],
            [
                327,
                484
            ],
            [
                484,
                593
            ],
            [
                593,
                665
            ],
            [
                665,
                691
            ],
            [
                691,
                748
            ],
            [
                748,
                780
            ],
            [
                780,
                819
            ],
            [
                819,
                994
            ],
            [
                994,
                1053
            ],
            [
                1053,
                1107
            ],
            [
                1107,
                1196
            ],
            [
                1196,
                1335
            ],
            [
                1335,
                1459
            ],
            [
                1459,
                1486
            ],
            [
                1486,
                1769
            ],
            [
                1769,
                1878
            ],
            [
                1878,
                1923
            ],
            [
                1923,
                2061
            ],
            [
                2061,
                2112
            ],
            [
                2112,
                2345
            ],
            [
                2345,
                2374
            ],
            [
                2374,
                2447
            ],
            [
                2447,
                2550
            ],
            [
                2550,
                2611
            ],
            [
                2611,
                2649
            ],
            [
                2649,
                2716
            ],
            [
                2716,
                2756
            ],
            [
                2756,
                2876
            ],
            [
                2876,
                2914
            ],
            [
                2914,
                3002
            ],
            [
                3002,
                3059
            ],
            [
                3059,
                3215
            ],
            [
                3215,
                3281
            ],
            [
                3281,
                3303
            ],
            [
                3303,
                3563
            ],
            [
                3563,
                3628
            ],
            [
                3628,
                3805
            ],
            [
                3805,
                3886
            ],
            [
                3886,
                3905
            ],
            [
                3905,
                3931
            ],
            [
                3931,
                4066
            ],
            [
                4066,
                4201
            ],
            [
                4201,
                4240
            ],
            [
                4240,
                4295
            ],
            [
                4295,
                4506
            ],
            [
                4506,
                4566
            ],
            [
                4566,
                4694
            ],
            [
                4694,
                4725
            ],
            [
                4725,
                4824
            ],
            [
                4824,
                4881
            ],
            [
                4881,
                4947
            ],
            [
                4947,
                4982
            ],
            [
                4982,
                5048
            ],
            [
                5048,
                5203
            ],
            [
                5203,
                5242
            ],
            [
                5242,
                5263
            ],
            [
                5263,
                5388
            ],
            [
                5388,
                5461
            ],
            [
                5461,
                5500
            ],
            [
                5500,
                5541
            ],
            [
                5541,
                5665
            ],
            [
                5665,
                5706
            ],
            [
                5706,
                5756
            ],
            [
                5756,
                5783
            ],
            [
                5783,
                5809
            ],
            [
                5809,
                5845
            ],
            [
                5845,
                5911
            ],
            [
                5911,
                6016
            ],
            [
                6016,
                6092
            ],
            [
                6092,
                6204
            ],
            [
                6204,
                6298
            ],
            [
                6298,
                6362
            ],
            [
                6362,
                6476
            ],
            [
                6476,
                6527
            ],
            [
                6527,
                6550
            ],
            [
                6550,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6759
            ],
            [
                6759,
                6846
            ],
            [
                6846,
                6890
            ],
            [
                6890,
                6914
            ],
            [
                6914,
                6961
            ],
            [
                6961,
                7008
            ],
            [
                7008,
                7042
            ],
            [
                7042,
                7065
            ],
            [
                7065,
                7084
            ],
            [
                7084,
                7130
            ],
            [
                7130,
                7172
            ],
            [
                7172,
                7220
            ],
            [
                7220,
                7273
            ],
            [
                7273,
                7342
            ],
            [
                7342,
                7363
            ],
            [
                7363,
                7409
            ],
            [
                7409,
                7467
            ],
            [
                7467,
                7534
            ],
            [
                7534,
                7562
            ],
            [
                7562,
                7629
            ],
            [
                7629,
                7633
            ],
            [
                7633,
                7647
            ],
            [
                7647,
                7666
            ],
            [
                7666,
                7704
            ],
            [
                7704,
                7736
            ],
            [
                7736,
                7805
            ],
            [
                7805,
                7847
            ],
            [
                7847,
                7914
            ],
            [
                7914,
                7949
            ],
            [
                7949,
                8064
            ],
            [
                8064,
                8088
            ],
            [
                8088,
                8177
            ],
            [
                8177,
                8309
            ],
            [
                8309,
                8436
            ],
            [
                8436,
                8711
            ],
            [
                8711,
                8851
            ],
            [
                8851,
                9271
            ],
            [
                9271,
                9583
            ],
            [
                9583,
                9676
            ],
            [
                9676,
                9790
            ],
            [
                9790,
                9819
            ],
            [
                9819,
                9957
            ],
            [
                9957,
                10115
            ],
            [
                10115,
                10335
            ],
            [
                10335,
                10381
            ],
            [
                10381,
                10605
            ],
            [
                10605,
                10769
            ],
            [
                10769,
                10888
            ],
            [
                10888,
                10930
            ],
            [
                10930,
                11063
            ],
            [
                11063,
                11153
            ],
            [
                11153,
                11193
            ],
            [
                11193,
                11377
            ],
            [
                11377,
                11418
            ],
            [
                11418,
                11513
            ],
            [
                11513,
                11771
            ],
            [
                11771,
                11831
            ],
            [
                11831,
                11881
            ],
            [
                11881,
                12124
            ],
            [
                12124,
                12217
            ]
        ],
        "overlap_chars": [
            [
                0,
                34
            ],
            [
                35,
                49
            ],
            [
                50,
                128
            ],
            [
                128,
                134
            ],
            [
                135,
                223
            ],
            [
                224,
                238
            ],
            [
                239,
                242
            ],
            [
                254,
                256
            ],
            [
                256,
                281
            ],
            [
                281,
                303
            ],
            [
                307,
                310
            ],
            [
                319,
                327
            ],
            [
                327,
                352
            ],
            [
                360,
                484
            ],
            [
                484,
                520
            ],
            [
                523,
                529
            ],
            [
                530,
                534
            ],
            [
                542,
                593
            ],
            [
                593,
                665
            ],
            [
                665,
                691
            ],
            [
                691,
                729
            ],
            [
                746,
                748
            ],
            [
                748,
                749
            ],
            [
                769,
                778
            ],
            [
                778,
                780
            ],
            [
                780,
                819
            ],
            [
                819,
                994
            ],
            [
                994,
                1051
            ],
            [
                1051,
                1052
            ],
            [
                1054,
                1094
            ],
            [
                1095,
                1107
            ],
            [
                1107,
                1141
            ],
            [
                1151,
                1162
            ],
            [
                1172,
                1196
            ],
            [
                1196,
                1235
            ],
            [
                1236,
                1284
            ],
            [
                1285,
                1335
            ],
            [
                1335,
                1399
            ],
            [
                1400,
                1459
            ],
            [
                1459,
                1486
            ],
            [
                1486,
                1609
            ],
            [
                1617,
                1639
            ],
            [
                1643,
                1661
            ],
            [
                1662,
                1671
            ],
            [
                1671,
                1689
            ],
            [
                1690,
                1703
            ],
            [
                1704,
                1735
            ],
            [
                1741,
                1743
            ],
            [
                1744,
                1767
            ],
            [
                1767,
                1769
            ],
            [
                1769,
                1780
            ],
            [
                1797,
                1878
            ],
            [
                1878,
                1923
            ],
            [
                1931,
                1934
            ],
            [
                1935,
                1940
            ],
            [
                1941,
                2061
            ],
            [
                2061,
                2112
            ],
            [
                2112,
                2168
            ],
            [
                2169,
                2172
            ],
            [
                2173,
                2324
            ],
            [
                2329,
                2345
            ],
            [
                2345,
                2374
            ],
            [
                2374,
                2447
            ],
            [
                2447,
                2480
            ],
            [
                2481,
                2550
            ],
            [
                2550,
                2611
            ],
            [
                2611,
                2649
            ],
            [
                2649,
                2693
            ],
            [
                2694,
                2716
            ],
            [
                2716,
                2756
            ],
            [
                2756,
                2876
            ],
            [
                2876,
                2914
            ],
            [
                2914,
                3002
            ],
            [
                3002,
                3059
            ],
            [
                3059,
                3215
            ],
            [
                3215,
                3281
            ],
            [
                3281,
                3303
            ],
            [
                3303,
                3563
            ],
            [
                3563,
                3579
            ],
            [
                3580,
                3584
            ],
            [
                3593,
                3628
            ],
            [
                3628,
                3635
            ],
            [
                3636,
                3805
            ],
            [
                3805,
                3886
            ],
            [
                3886,
                3905
            ],
            [
                3905,
                3925
            ],
            [
                3926,
                3929
            ],
            [
                3929,
                3931
            ],
            [
                3931,
                4066
            ],
            [
                4066,
                4201
            ],
            [
                4201,
                4240
            ],
            [
                4240,
                4288
            ],
            [
                4289,
                4293
            ],
            [
                4293,
                4295
            ],
            [
                4295,
                4375
            ],
            [
                4387,
                4397
            ],
            [
                4405,
                4506
            ],
            [
                4506,
                4564
            ],
            [
                4564,
                4566
            ],
            [
                4566,
                4583
            ],
            [
                4584,
                4694
            ],
            [
                4694,
                4723
            ],
            [
                4723,
                4724
            ],
            [
                4726,
                4767
            ],
            [
                4767,
                4824
            ],
            [
                4824,
                4881
            ],
            [
                4881,
                4947
            ],
            [
                4947,
                4982
            ],
            [
                4982,
                5046
            ],
            [
                5046,
                5048
            ],
            [
                5048,
                5203
            ],
            [
                5203,
                5242
            ],
            [
                5242,
                5263
            ],
            [
                5263,
                5388
            ],
            [
                5388,
                5461
            ],
            [
                5461,
                5500
            ],
            [
                5500,
                5541
            ],
            [
                5541,
                5665
            ],
            [
                5665,
                5706
            ],
            [
                5706,
                5756
            ],
            [
                5756,
                5783
            ],
            [
                5783,
                5809
            ],
            [
                5809,
                5845
            ],
            [
                5845,
                5911
            ],
            [
                5911,
                5927
            ],
            [
                5928,
                6016
            ],
            [
                6016,
                6090
            ],
            [
                6090,
                6092
            ],
            [
                6092,
                6132
            ],
            [
                6133,
                6204
            ],
            [
                6204,
                6298
            ],
            [
                6298,
                6329
            ],
            [
                6329,
                6362
            ],
            [
                6362,
                6441
            ],
            [
                6442,
                6476
            ],
            [
                6476,
                6527
            ],
            [
                6527,
                6550
            ],
            [
                6550,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6628
            ],
            [
                6629,
                6673
            ],
            [
                6692,
                6759
            ],
            [
                6759,
                6797
            ],
            [
                6798,
                6823
            ],
            [
                6824,
                6846
            ],
            [
                6846,
                6890
            ],
            [
                6890,
                6914
            ],
            [
                6914,
                6959
            ],
            [
                6959,
                6961
            ],
            [
                6961,
                7005
            ],
            [
                7008,
                7042
            ],
            [
                7042,
                7065
            ],
            [
                7065,
                7084
            ],
            [
                7084,
                7130
            ],
            [
                7130,
                7172
            ],
            [
                7172,
                7206
            ],
            [
                7207,
                7211
            ],
            [
                7212,
                7220
            ],
            [
                7220,
                7271
            ],
            [
                7271,
                7273
            ],
            [
                7273,
                7342
            ],
            [
                7342,
                7363
            ],
            [
                7363,
                7409
            ],
            [
                7409,
                7467
            ],
            [
                7467,
                7484
            ],
            [
                7485,
                7489
            ],
            [
                7498,
                7522
            ],
            [
                7526,
                7534
            ],
            [
                7534,
                7562
            ],
            [
                7562,
                7629
            ],
            [
                7629,
                7633
            ],
            [
                7633,
                7647
            ],
            [
                7647,
                7666
            ],
            [
                7666,
                7704
            ],
            [
                7704,
                7736
            ],
            [
                7736,
                7770
            ],
            [
                7777,
                7793
            ],
            [
                7799,
                7803
            ],
            [
                7803,
                7805
            ],
            [
                7805,
                7847
            ],
            [
                7847,
                7862
            ],
            [
                7862,
                7914
            ],
            [
                7914,
                7949
            ],
            [
                7949,
                8064
            ],
            [
                8064,
                8088
            ],
            [
                8088,
                8098
            ],
            [
                8115,
                8177
            ],
            [
                8177,
                8309
            ],
            [
                8309,
                8312
            ],
            [
                8313,
                8329
            ],
            [
                8330,
                8410
            ],
            [
                8416,
                8436
            ],
            [
                8436,
                8604
            ],
            [
                8608,
                8671
            ],
            [
                8671,
                8672
            ],
            [
                8678,
                8711
            ],
            [
                8711,
                8777
            ],
            [
                8778,
                8807
            ],
            [
                8807,
                8812
            ],
            [
                8813,
                8821
            ],
            [
                8822,
                8825
            ],
            [
                8826,
                8851
            ],
            [
                8851,
                8926
            ],
            [
                8927,
                9015
            ],
            [
                9016,
                9271
            ],
            [
                9271,
                9287
            ],
            [
                9288,
                9294
            ],
            [
                9295,
                9450
            ],
            [
                9451,
                9574
            ],
            [
                9575,
                9583
            ],
            [
                9583,
                9644
            ],
            [
                9645,
                9676
            ],
            [
                9676,
                9790
            ],
            [
                9790,
                9819
            ],
            [
                9819,
                9874
            ],
            [
                9879,
                9931
            ],
            [
                9932,
                9950
            ],
            [
                9951,
                9955
            ],
            [
                9955,
                9957
            ],
            [
                9957,
                10020
            ],
            [
                10021,
                10024
            ],
            [
                10025,
                10079
            ],
            [
                10080,
                10084
            ],
            [
                10085,
                10094
            ],
            [
                10099,
                10102
            ],
            [
                10109,
                10113
            ],
            [
                10113,
                10114
            ],
            [
                10115,
                10123
            ],
            [
                10124,
                10313
            ],
            [
                10314,
                10317
            ],
            [
                10318,
                10323
            ],
            [
                10324,
                10333
            ],
            [
                10333,
                10335
            ],
            [
                10335,
                10381
            ],
            [
                10381,
                10496
            ],
            [
                10497,
                10573
            ],
            [
                10574,
                10605
            ],
            [
                10605,
                10632
            ],
            [
                10644,
                10768
            ],
            [
                10769,
                10888
            ],
            [
                10888,
                10930
            ],
            [
                10930,
                11063
            ],
            [
                11063,
                11153
            ],
            [
                11158,
                11173
            ],
            [
                11174,
                11193
            ],
            [
                11193,
                11198
            ],
            [
                11199,
                11236
            ],
            [
                11237,
                11249
            ],
            [
                11257,
                11266
            ],
            [
                11281,
                11290
            ],
            [
                11292,
                11377
            ],
            [
                11377,
                11418
            ],
            [
                11418,
                11511
            ],
            [
                11511,
                11513
            ],
            [
                11513,
                11738
            ],
            [
                11739,
                11771
            ],
            [
                11771,
                11789
            ],
            [
                11790,
                11813
            ],
            [
                11820,
                11831
            ],
            [
                11831,
                11881
            ],
            [
                11881,
                11944
            ],
            [
                11945,
                12018
            ],
            [
                12018,
                12123
            ],
            [
                12124,
                12217
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                256
            ],
            [
                256,
                281
            ],
            [
                281,
                327
            ],
            [
                327,
                484
            ],
            [
                484,
                593
            ],
            [
                593,
                665
            ],
            [
                665,
                691
            ],
            [
                691,
                748
            ],
            [
                748,
                748
            ],
            [
                748,
                780
            ],
            [
                780,
                819
            ],
            [
                819,
                819
            ],
            [
                819,
                994
            ],
            [
                994,
                1053
            ],
            [
                1053,
                1053
            ],
            [
                1053,
                1107
            ],
            [
                1107,
                1107
            ],
            [
                1107,
                1196
            ],
            [
                1196,
                1196
            ],
            [
                1196,
                1335
            ],
            [
                1335,
                1335
            ],
            [
                1335,
                1335
            ],
            [
                1335,
                1459
            ],
            [
                1459,
                1486
            ],
            [
                1486,
                1769
            ],
            [
                1769,
                1878
            ],
            [
                1878,
                1923
            ],
            [
                1923,
                2061
            ],
            [
                2061,
                2112
            ],
            [
                2112,
                2345
            ],
            [
                2345,
                2374
            ],
            [
                2374,
                2447
            ],
            [
                2447,
                2550
            ],
            [
                2550,
                2611
            ],
            [
                2611,
                2649
            ],
            [
                2649,
                2716
            ],
            [
                2716,
                2756
            ],
            [
                2756,
                2876
            ],
            [
                2876,
                2914
            ],
            [
                2914,
                3002
            ],
            [
                3002,
                3002
            ],
            [
                3002,
                3059
            ],
            [
                3059,
                3215
            ],
            [
                3215,
                3281
            ],
            [
                3281,
                3303
            ],
            [
                3303,
                3563
            ],
            [
                3563,
                3628
            ],
            [
                3628,
                3805
            ],
            [
                3805,
                3886
            ],
            [
                3886,
                3905
            ],
            [
                3905,
                3931
            ],
            [
                3931,
                3931
            ],
            [
                3931,
                4066
            ],
            [
                4066,
                4201
            ],
            [
                4201,
                4201
            ],
            [
                4201,
                4201
            ],
            [
                4201,
                4240
            ],
            [
                4240,
                4295
            ],
            [
                4295,
                4506
            ],
            [
                4506,
                4566
            ],
            [
                4566,
                4694
            ],
            [
                4694,
                4725
            ],
            [
                4725,
                4824
            ],
            [
                4824,
                4881
            ],
            [
                4881,
                4947
            ],
            [
                4947,
                4982
            ],
            [
                4982,
                5048
            ],
            [
                5048,
                5203
            ],
            [
                5203,
                5242
            ],
            [
                5242,
                5263
            ],
            [
                5263,
                5388
            ],
            [
                5388,
                5461
            ],
            [
                5461,
                5500
            ],
            [
                5500,
                5541
            ],
            [
                5541,
                5665
            ],
            [
                5665,
                5706
            ],
            [
                5706,
                5756
            ],
            [
                5756,
                5783
            ],
            [
                5783,
                5809
            ],
            [
                5809,
                5845
            ],
            [
                5845,
                5911
            ],
            [
                5911,
                6016
            ],
            [
                6016,
                6092
            ],
            [
                6092,
                6204
            ],
            [
                6204,
                6298
            ],
            [
                6298,
                6362
            ],
            [
                6362,
                6476
            ],
            [
                6476,
                6527
            ],
            [
                6527,
                6550
            ],
            [
                6550,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6759
            ],
            [
                6759,
                6846
            ],
            [
                6846,
                6890
            ],
            [
                6890,
                6914
            ],
            [
                6914,
                6961
            ],
            [
                6961,
                7008
            ],
            [
                7008,
                7008
            ],
            [
                7008,
                7042
            ],
            [
                7042,
                7065
            ],
            [
                7065,
                7084
            ],
            [
                7084,
                7130
            ],
            [
                7130,
                7172
            ],
            [
                7172,
                7220
            ],
            [
                7220,
                7273
            ],
            [
                7273,
                7342
            ],
            [
                7342,
                7363
            ],
            [
                7363,
                7409
            ],
            [
                7409,
                7467
            ],
            [
                7467,
                7534
            ],
            [
                7534,
                7562
            ],
            [
                7562,
                7629
            ],
            [
                7629,
                7633
            ],
            [
                7633,
                7647
            ],
            [
                7647,
                7666
            ],
            [
                7666,
                7704
            ],
            [
                7704,
                7736
            ],
            [
                7736,
                7805
            ],
            [
                7805,
                7847
            ],
            [
                7847,
                7914
            ],
            [
                7914,
                7949
            ],
            [
                7949,
                8064
            ],
            [
                8064,
                8088
            ],
            [
                8088,
                8088
            ],
            [
                8088,
                8088
            ],
            [
                8088,
                8088
            ],
            [
                8088,
                8088
            ],
            [
                8088,
                8177
            ],
            [
                8177,
                8309
            ],
            [
                8309,
                8436
            ],
            [
                8436,
                8711
            ],
            [
                8711,
                8851
            ],
            [
                8851,
                9271
            ],
            [
                9271,
                9583
            ],
            [
                9583,
                9676
            ],
            [
                9676,
                9790
            ],
            [
                9790,
                9819
            ],
            [
                9819,
                9957
            ],
            [
                9957,
                10115
            ],
            [
                10115,
                10335
            ],
            [
                10335,
                10381
            ],
            [
                10381,
                10605
            ],
            [
                10605,
                10769
            ],
            [
                10769,
                10888
            ],
            [
                10888,
                10930
            ],
            [
                10930,
                11063
            ],
            [
                11063,
                11153
            ],
            [
                11153,
                11193
            ],
            [
                11193,
                11377
            ],
            [
                11377,
                11418
            ],
            [
                11418,
                11513
            ],
            [
                11513,
                11771
            ],
            [
                11771,
                11831
            ],
            [
                11831,
                11881
            ],
            [
                11881,
                12124
            ],
            [
                12124,
                12217
            ],
            [
                12217,
                12217
            ],
            [
                12217,
                12217
            ],
            [
                12217,
                12217
            ]
        ]
    }
}