{
    "original": {
        "text": "At about the week's end from his return to Mansfield, Tom's immediate danger was over, and he was so far pronounced safe as to make his mother perfectly easy; for being now used to the sight of him in his suffering, helpless state, and hearing only the best, and never thinking beyond what she heard, with no disposition for alarm and no aptitude at a hint, Lady Bertram was the happiest subject in the world for a little medical imposition. The fever was subdued; the fever had been his complaint; of course he would soon be well again. Lady Bertram could think nothing less, and Fanny shared her aunt's security, till she received a few lines from Edmund, written purposely to give her a clearer idea of his brother's situation, and acquaint her with the apprehensions which he and his father had imbibed from the physician with respect to some strong hectic symptoms, which seemed to seize the frame on the departure of the fever. They judged it best that Lady Bertram should not be harassed by alarms which, it was to be hoped, would prove unfounded; but there was no reason why Fanny should not know the truth. They were apprehensive for his lungs.\nA very few lines from Edmund shewed her the patient and the sickroom in a juster and stronger light than all Lady Bertram's sheets of paper could do. There was hardly any one in the house who might not have described, from personal observation, better than herself; not one who was not more useful at times to her son. She could do nothing but glide in quietly and look at him; but when able to talk or be talked to, or read to, Edmund was the companion he preferred. His aunt worried him by her cares, and Sir Thomas knew not how to bring down his conversation or his voice to the level of irritation and feebleness. Edmund was all in all. Fanny would certainly believe him so at least, and must find that her estimation of him was higher than ever when he appeared as the attendant, supporter, cheerer of a suffering brother. There was not only the debility of recent illness to assist: there was also, as she now learnt, nerves much affected, spirits much depressed to calm and raise, and her own imagination added that there must be a mind to be properly guided.\nThe family were not consumptive, and she was more inclined to hope than fear for her cousin, except when she thought of Miss Crawford; but Miss Crawford gave her the idea of being the child of good luck, and to her selfishness and vanity it would be good luck to have Edmund the only son.\nEven in the sick chamber the fortunate Mary was not forgotten. Edmund's letter had this postscript. \"On the subject of my last, I had actually begun a letter when called away by Tom's illness, but I have now changed my mind, and fear to trust the influence of friends. When Tom is better, I shall go.\"\nSuch was the state of Mansfield, and so it continued, with scarcely any change, till Easter. A line occasionally added by Edmund to his mother's letter was enough for Fanny's information. Tom's amendment was alarmingly slow.\nEaster came particularly late this year, as Fanny had most sorrowfully considered, on first learning that she had no chance of leaving Portsmouth till after it. It came, and she had yet heard nothing of her return-nothing even of the going to London, which was to precede her return. Her aunt often expressed a wish for her, but there was no notice, no message from the uncle on whom all depended. She supposed he could not yet leave his son, but it was a cruel, a terrible delay to her. The end of April was coming on; it would soon be almost three months, instead of two, that she had been absent from them all, and that her days had been passing in a state of penance, which she loved them too well to hope they would thoroughly understand; and who could yet say when there might be leisure to think of or fetch her?\nHer eagerness, her impatience, her longings to be with them, were such as to bring a line or two of Cowper's Tirocinium for ever before her. \"With what intense desire she wants her home,\" was continually on her tongue, as the truest description of a yearning which she could not suppose any schoolboy's bosom to feel more keenly.\nWhen she had been coming to Portsmouth, she had loved to call it her home, had been fond of saying that she was going home; the word had been very dear to her, and so it still was, but it must be applied to Mansfield. _That_ was now the home. Portsmouth was Portsmouth; Mansfield was home. They had been long so arranged in the indulgence of her secret meditations, and nothing was more consolatory to her than to find her aunt using the same language: \"I cannot but say I much regret your being from home at this distressing time, so very trying to my spirits. I trust and hope, and sincerely wish you may never be absent from home so long again,\" were most delightful sentences to her. Still, however, it was her private regale. Delicacy to her parents made her careful not to betray such a preference of her uncle's house. It was always: \"When I go back into Northamptonshire, or when I return to Mansfield, I shall do so and so.\" For a great while it was so, but at last the longing grew stronger, it overthrew caution, and she found herself talking of what she should do when she went home before she was aware. She reproached herself, coloured, and looked fearfully towards her father and mother. She need not have been uneasy. There was no sign of displeasure, or even of hearing her. They were perfectly free from any jealousy of Mansfield. She was as welcome to wish herself there as to be there.\nIt was sad to Fanny to lose all the pleasures of spring. She had not known before what pleasures she _had_ to lose in passing March and April in a town. She had not known before how much the beginnings and progress of vegetation had delighted her. What animation, both of body and mind, she had derived from watching the advance of that season which cannot, in spite of its capriciousness, be unlovely, and seeing its increasing beauties from the earliest flowers in the warmest divisions of her aunt's garden, to the opening of leaves of her uncle's plantations, and the glory of his woods. To be losing such pleasures was no trifle; to be losing them, because she was in the midst of closeness and noise, to have confinement, bad air, bad smells, substituted for liberty, freshness, fragrance, and verdure, was infinitely worse: but even these incitements to regret were feeble, compared with what arose from the conviction of being missed by her best friends, and the longing to be useful to those who were wanting her!\nCould she have been at home, she might have been of service to every creature in the house. She felt that she must have been of use to all. To all she must have saved some trouble of head or hand; and were it only in supporting the spirits of her aunt Bertram, keeping her from the evil of solitude, or the still greater evil of a restless, officious companion, too apt to be heightening danger in order to enhance her own importance, her being there would have been a general good. She loved to fancy how she could have read to her aunt, how she could have talked to her, and tried at once to make her feel the blessing of what was, and prepare her mind for what might be; and how many walks up and down stairs she might have saved her, and how many messages she might have carried.\nIt astonished her that Tom's sisters could be satisfied with remaining in London at such a time, through an illness which had now, under different degrees of danger, lasted several weeks. _They_ might return to Mansfield when they chose; travelling could be no difficulty to _them_, and she could not comprehend how both could still keep away. If Mrs. Rushworth could imagine any interfering obligations, Julia was certainly able to quit London whenever she chose. It appeared from one of her aunt's letters that Julia had offered to return if wanted, but this was all. It was evident that she would rather remain where she was.\nFanny was disposed to think the influence of London very much at war with all respectable attachments. She saw the proof of it in Miss Crawford, as well as in her cousins; _her_ attachment to Edmund had been respectable, the most respectable part of her character; her friendship for herself had at least been blameless. Where was either sentiment now? It was so long since Fanny had had any letter from her, that she had some reason to think lightly of the friendship which had been so dwelt on. It was weeks since she had heard anything of Miss Crawford or of her other connexions in town, except through Mansfield, and she was beginning to suppose that she might never know whether Mr. Crawford had gone into Norfolk again or not till they met, and might never hear from his sister any more this spring, when the following letter was received to revive old and create some new sensations-\n\"Forgive me, my dear Fanny, as soon as you can, for my long silence, and behave as if you could forgive me directly. This is my modest request and expectation, for you are so good, that I depend upon being treated better than I deserve, and I write now to beg an immediate answer. I want to know the state of things at Mansfield Park, and you, no doubt, are perfectly able to give it. One should be a brute not to feel for the distress they are in; and from what I hear, poor Mr. Bertram has a bad chance of ultimate recovery. I thought little of his illness at first. I looked upon him as the sort of person to be made a fuss with, and to make a fuss himself in any trifling disorder, and was chiefly concerned for those who had to nurse him; but now it is confidently asserted that he is really in a decline, that the symptoms are most alarming, and that part of the family, at least, are aware of it. If it be so, I am sure you must be included in that part, that discerning part, and therefore entreat you to let me know how far I have been rightly informed. I need not say how rejoiced I shall be to hear there has been any mistake, but the report is so prevalent that I confess I cannot help trembling. To have such a fine young man cut off in the flower of his days is most melancholy. Poor Sir Thomas will feel it dreadfully. I really am quite agitated on the subject. Fanny, Fanny, I see you smile and look cunning, but, upon my honour, I never bribed a physician in my life. Poor young man! If he is to die, there will be _two_ poor young men less in the world; and with a fearless face and bold voice would I say to any one, that wealth and consequence could fall into no hands more deserving of them. It was a foolish precipitation last Christmas, but the evil of a few days may be blotted out in part. Varnish and gilding hide many stains. It will be but the loss of the Esquire after his name. With real affection, Fanny, like mine, more might be overlooked. Write to me by return of post, judge of my anxiety, and do not trifle with it. Tell me the real truth, as you have it from the fountainhead. And now, do not trouble yourself to be ashamed of either my feelings or your own. Believe me, they are not only natural, they are philanthropic and virtuous. I put it to your conscience, whether 'Sir Edmund' would not do more good with all the Bertram property than any other possible 'Sir.' Had the Grants been at home I would not have troubled you, but you are now the only one I can apply to for the truth, his sisters not being within my reach. Mrs. R. has been spending the Easter with the Aylmers at Twickenham (as to be sure you know), and is not yet returned; and Julia is with the cousins who live near Bedford Square, but I forget their name and street. Could I immediately apply to either, however, I should still prefer you, because it strikes me that they have all along been so unwilling to have their own amusements cut up, as to shut their eyes to the truth. I suppose Mrs. R.'s Easter holidays will not last much longer; no doubt they are thorough holidays to her. The Aylmers are pleasant people; and her husband away, she can have nothing but enjoyment. I give her credit for promoting his going dutifully down to Bath, to fetch his mother; but how will she and the dowager agree in one house? Henry is not at hand, so I have nothing to say from him. Do not you think Edmund would have been in town again long ago, but for this illness?-Yours ever, Mary.\"\n\"I had actually begun folding my letter when Henry walked in, but he brings no intelligence to prevent my sending it. Mrs. R. knows a decline is apprehended; he saw her this morning: she returns to Wimpole Street to-day; the old lady is come. Now do not make yourself uneasy with any queer fancies because he has been spending a few days at Richmond. He does it every spring. Be assured he cares for nobody but you. At this very moment he is wild to see you, and occupied only in contriving the means for doing so, and for making his pleasure conduce to yours. In proof, he repeats, and more eagerly, what he said at Portsmouth about our conveying you home, and I join him in it with all my soul. Dear Fanny, write directly, and tell us to come. It will do us all good. He and I can go to the Parsonage, you know, and be no trouble to our friends at Mansfield Park. It would really be gratifying to see them all again, and a little addition of society might be of infinite use to them; and as to yourself, you must feel yourself to be so wanted there, that you cannot in conscience-conscientious as you are-keep away, when you have the means of returning. I have not time or patience to give half Henry's messages; be satisfied that the spirit of each and every one is unalterable affection.\"\nFanny's disgust at the greater part of this letter, with her extreme reluctance to bring the writer of it and her cousin Edmund together, would have made her (as she felt) incapable of judging impartially whether the concluding offer might be accepted or not. To herself, individually, it was most tempting. To be finding herself, perhaps within three days, transported to Mansfield, was an image of the greatest felicity, but it would have been a material drawback to be owing such felicity to persons in whose feelings and conduct, at the present moment, she saw so much to condemn: the sister's feelings, the brother's conduct, _her_ cold-hearted ambition, _his_ thoughtless vanity. To have him still the acquaintance, the flirt perhaps, of Mrs. Rushworth! She was mortified. She had thought better of him. Happily, however, she was not left to weigh and decide between opposite inclinations and doubtful notions of right; there was no occasion to determine whether she ought to keep Edmund and Mary asunder or not. She had a rule to apply to, which settled everything. Her awe of her uncle, and her dread of taking a liberty with him, made it instantly plain to her what she had to do. She must absolutely decline the proposal. If he wanted, he would send for her; and even to offer an early return was a presumption which hardly anything would have seemed to justify. She thanked Miss Crawford, but gave a decided negative. \"Her uncle, she understood, meant to fetch her; and as her cousin's illness had continued so many weeks without her being thought at all necessary, she must suppose her return would be unwelcome at present, and that she should be felt an encumbrance.\"\nHer representation of her cousin's state at this time was exactly according to her own belief of it, and such as she supposed would convey to the sanguine mind of her correspondent the hope of everything she was wishing for. Edmund would be forgiven for being a clergyman, it seemed, under certain conditions of wealth; and this, she suspected, was all the conquest of prejudice which he was so ready to congratulate himself upon. She had only learnt to think nothing of consequence but money.",
        "paragraph_chars": [
            [
                0,
                1154
            ],
            [
                1154,
                2221
            ],
            [
                2221,
                2510
            ],
            [
                2510,
                2812
            ],
            [
                2812,
                3037
            ],
            [
                3037,
                3857
            ],
            [
                3857,
                4187
            ],
            [
                4187,
                5593
            ],
            [
                5593,
                6616
            ],
            [
                6616,
                7400
            ],
            [
                7400,
                8029
            ],
            [
                8029,
                8921
            ],
            [
                8921,
                12410
            ],
            [
                12410,
                13703
            ],
            [
                13703,
                15384
            ],
            [
                15384,
                15877
            ]
        ],
        "segment_chars": [
            [
                0,
                442
            ],
            [
                442,
                538
            ],
            [
                538,
                934
            ],
            [
                934,
                1116
            ],
            [
                1116,
                1154
            ],
            [
                1154,
                1304
            ],
            [
                1304,
                1473
            ],
            [
                1473,
                1622
            ],
            [
                1622,
                1772
            ],
            [
                1772,
                1795
            ],
            [
                1795,
                1982
            ],
            [
                1982,
                2221
            ],
            [
                2221,
                2510
            ],
            [
                2510,
                2573
            ],
            [
                2573,
                2610
            ],
            [
                2610,
                2779
            ],
            [
                2779,
                2812
            ],
            [
                2812,
                2905
            ],
            [
                2905,
                3000
            ],
            [
                3000,
                3037
            ],
            [
                3037,
                3198
            ],
            [
                3198,
                3321
            ],
            [
                3321,
                3435
            ],
            [
                3435,
                3525
            ],
            [
                3525,
                3857
            ],
            [
                3857,
                3998
            ],
            [
                3998,
                4187
            ],
            [
                4187,
                4405
            ],
            [
                4405,
                4430
            ],
            [
                4430,
                4477
            ],
            [
                4477,
                4749
            ],
            [
                4749,
                4875
            ],
            [
                4875,
                4918
            ],
            [
                4918,
                5013
            ],
            [
                5013,
                5121
            ],
            [
                5121,
                5304
            ],
            [
                5304,
                5390
            ],
            [
                5390,
                5421
            ],
            [
                5421,
                5479
            ],
            [
                5479,
                5536
            ],
            [
                5536,
                5593
            ],
            [
                5593,
                5650
            ],
            [
                5650,
                5746
            ],
            [
                5746,
                5841
            ],
            [
                5841,
                6185
            ],
            [
                6185,
                6616
            ],
            [
                6616,
                6708
            ],
            [
                6708,
                6756
            ],
            [
                6756,
                7099
            ],
            [
                7099,
                7400
            ],
            [
                7400,
                7588
            ],
            [
                7588,
                7744
            ],
            [
                7744,
                7865
            ],
            [
                7865,
                7970
            ],
            [
                7970,
                8029
            ],
            [
                8029,
                8132
            ],
            [
                8132,
                8350
            ],
            [
                8350,
                8382
            ],
            [
                8382,
                8526
            ],
            [
                8526,
                8921
            ],
            [
                8921,
                9038
            ],
            [
                9038,
                9202
            ],
            [
                9202,
                9306
            ],
            [
                9306,
                9448
            ],
            [
                9448,
                9490
            ],
            [
                9490,
                9825
            ],
            [
                9825,
                9984
            ],
            [
                9984,
                10130
            ],
            [
                10130,
                10214
            ],
            [
                10214,
                10255
            ],
            [
                10255,
                10298
            ],
            [
                10298,
                10406
            ],
            [
                10406,
                10422
            ],
            [
                10422,
                10634
            ],
            [
                10634,
                10736
            ],
            [
                10736,
                10774
            ],
            [
                10774,
                10829
            ],
            [
                10829,
                10894
            ],
            [
                10894,
                10973
            ],
            [
                10973,
                11035
            ],
            [
                11035,
                11117
            ],
            [
                11117,
                11193
            ],
            [
                11193,
                11327
            ],
            [
                11327,
                11484
            ],
            [
                11484,
                11699
            ],
            [
                11699,
                11910
            ],
            [
                11910,
                12017
            ],
            [
                12017,
                12108
            ],
            [
                12108,
                12248
            ],
            [
                12248,
                12305
            ],
            [
                12305,
                12410
            ],
            [
                12410,
                12528
            ],
            [
                12528,
                12653
            ],
            [
                12653,
                12761
            ],
            [
                12761,
                12786
            ],
            [
                12786,
                12826
            ],
            [
                12826,
                12971
            ],
            [
                12971,
                13107
            ],
            [
                13107,
                13156
            ],
            [
                13156,
                13180
            ],
            [
                13180,
                13276
            ],
            [
                13276,
                13566
            ],
            [
                13566,
                13703
            ],
            [
                13703,
                13963
            ],
            [
                13963,
                14011
            ],
            [
                14011,
                14389
            ],
            [
                14389,
                14463
            ],
            [
                14463,
                14482
            ],
            [
                14482,
                14513
            ],
            [
                14513,
                14722
            ],
            [
                14722,
                14776
            ],
            [
                14776,
                14893
            ],
            [
                14893,
                14935
            ],
            [
                14935,
                15076
            ],
            [
                15076,
                15132
            ],
            [
                15132,
                15384
            ],
            [
                15384,
                15609
            ],
            [
                15609,
                15815
            ],
            [
                15815,
                15877
            ]
        ],
        "overlap_chars": [
            [
                3,
                8
            ],
            [
                350,
                351
            ],
            [
                13,
                17
            ],
            [
                29,
                162
            ],
            [
                358,
                429
            ],
            [
                440,
                442
            ],
            [
                442,
                463
            ],
            [
                497,
                538
            ],
            [
                538,
                665
            ],
            [
                676,
                756
            ],
            [
                771,
                825
            ],
            [
                932,
                934
            ],
            [
                934,
                1116
            ],
            [
                1116,
                1154
            ],
            [
                1154,
                1182
            ],
            [
                1190,
                1205
            ],
            [
                1223,
                1227
            ],
            [
                1248,
                1304
            ],
            [
                1583,
                1622
            ],
            [
                1622,
                1715
            ],
            [
                1729,
                1772
            ],
            [
                1772,
                1795
            ],
            [
                1795,
                1800
            ],
            [
                1807,
                1816
            ],
            [
                1825,
                1831
            ],
            [
                1840,
                1860
            ],
            [
                1879,
                1882
            ],
            [
                1894,
                1927
            ],
            [
                1950,
                1982
            ],
            [
                2059,
                2077
            ],
            [
                2078,
                2084
            ],
            [
                2053,
                2057
            ],
            [
                2085,
                2098
            ],
            [
                1982,
                1987
            ],
            [
                2100,
                2221
            ],
            [
                2221,
                2265
            ],
            [
                2271,
                2287
            ],
            [
                2312,
                2373
            ],
            [
                2401,
                2510
            ],
            [
                2510,
                2534
            ],
            [
                2549,
                2573
            ],
            [
                2573,
                2610
            ],
            [
                2610,
                2611
            ],
            [
                2638,
                2667
            ],
            [
                2744,
                2746
            ],
            [
                2668,
                2743
            ],
            [
                2753,
                2769
            ],
            [
                2770,
                2779
            ],
            [
                2779,
                2812
            ],
            [
                2812,
                2843
            ],
            [
                2864,
                2905
            ],
            [
                3000,
                3037
            ],
            [
                3037,
                3048
            ],
            [
                3062,
                3122
            ],
            [
                3129,
                3198
            ],
            [
                3198,
                3218
            ],
            [
                3223,
                3250
            ],
            [
                3319,
                3321
            ],
            [
                3321,
                3378
            ],
            [
                3390,
                3435
            ],
            [
                3435,
                3498
            ],
            [
                3511,
                3516
            ],
            [
                3523,
                3525
            ],
            [
                3525,
                3552
            ],
            [
                3555,
                3593
            ],
            [
                3611,
                3649
            ],
            [
                3779,
                3794
            ],
            [
                3799,
                3845
            ],
            [
                3739,
                3741
            ],
            [
                3846,
                3857
            ],
            [
                4192,
                4195
            ],
            [
                4212,
                4260
            ],
            [
                4309,
                4319
            ],
            [
                4295,
                4298
            ],
            [
                4357,
                4362
            ],
            [
                4334,
                4345
            ],
            [
                4366,
                4405
            ],
            [
                4430,
                4477
            ],
            [
                4557,
                4578
            ],
            [
                4593,
                4642
            ],
            [
                4722,
                4726
            ],
            [
                4660,
                4717
            ],
            [
                4747,
                4749
            ],
            [
                4749,
                4750
            ],
            [
                4771,
                4874
            ],
            [
                4880,
                4881
            ],
            [
                4918,
                4946
            ],
            [
                4951,
                5013
            ],
            [
                5013,
                5035
            ],
            [
                5077,
                5096
            ],
            [
                5118,
                5121
            ],
            [
                5150,
                5281
            ],
            [
                5302,
                5304
            ],
            [
                5304,
                5307
            ],
            [
                5328,
                5390
            ],
            [
                5390,
                5421
            ],
            [
                5421,
                5479
            ],
            [
                5479,
                5535
            ],
            [
                5607,
                5612
            ],
            [
                5596,
                5606
            ],
            [
                5616,
                5620
            ],
            [
                5625,
                5648
            ],
            [
                5708,
                5710
            ],
            [
                5740,
                5746
            ],
            [
                5746,
                5839
            ],
            [
                5841,
                5845
            ],
            [
                5880,
                5913
            ],
            [
                6011,
                6030
            ],
            [
                5922,
                5936
            ],
            [
                5855,
                5856
            ],
            [
                6031,
                6059
            ],
            [
                6085,
                6128
            ],
            [
                5951,
                5953
            ],
            [
                6132,
                6185
            ],
            [
                6185,
                6187
            ],
            [
                6198,
                6227
            ],
            [
                6300,
                6377
            ],
            [
                6389,
                6427
            ],
            [
                6276,
                6278
            ],
            [
                6259,
                6262
            ],
            [
                6504,
                6597
            ],
            [
                6611,
                6616
            ],
            [
                6636,
                6667
            ],
            [
                6676,
                6708
            ],
            [
                6756,
                6795
            ],
            [
                6811,
                6922
            ],
            [
                6929,
                6966
            ],
            [
                6976,
                6988
            ],
            [
                6992,
                6998
            ],
            [
                7004,
                7050
            ],
            [
                7055,
                7099
            ],
            [
                7099,
                7154
            ],
            [
                7174,
                7198
            ],
            [
                7207,
                7400
            ],
            [
                7400,
                7480
            ],
            [
                7495,
                7529
            ],
            [
                7566,
                7588
            ],
            [
                7589,
                7593
            ],
            [
                7595,
                7674
            ],
            [
                7676,
                7680
            ],
            [
                7742,
                7744
            ],
            [
                7744,
                7865
            ],
            [
                7865,
                7970
            ],
            [
                7990,
                8029
            ],
            [
                8029,
                8034
            ],
            [
                8057,
                8080
            ],
            [
                8035,
                8038
            ],
            [
                8091,
                8132
            ],
            [
                8174,
                8184
            ],
            [
                8188,
                8199
            ],
            [
                8172,
                8173
            ],
            [
                8132,
                8139
            ],
            [
                8144,
                8172
            ],
            [
                8348,
                8350
            ],
            [
                8382,
                8450
            ],
            [
                8456,
                8526
            ],
            [
                8526,
                8700
            ],
            [
                8793,
                8802
            ],
            [
                8814,
                8921
            ],
            [
                8921,
                8988
            ],
            [
                9036,
                9038
            ],
            [
                9085,
                9202
            ],
            [
                9202,
                9254
            ],
            [
                9304,
                9306
            ],
            [
                9306,
                9343
            ],
            [
                9348,
                9356
            ],
            [
                9368,
                9428
            ],
            [
                9438,
                9448
            ],
            [
                9448,
                9490
            ],
            [
                9490,
                9532
            ],
            [
                9561,
                9572
            ],
            [
                9581,
                9675
            ],
            [
                9700,
                9825
            ],
            [
                9838,
                9876
            ],
            [
                9899,
                9984
            ],
            [
                10012,
                10022
            ],
            [
                10003,
                10011
            ],
            [
                10023,
                10130
            ],
            [
                10130,
                10214
            ],
            [
                10214,
                10255
            ],
            [
                10255,
                10298
            ],
            [
                10298,
                10406
            ],
            [
                10406,
                10422
            ],
            [
                10422,
                10452
            ],
            [
                10454,
                10457
            ],
            [
                10459,
                10503
            ],
            [
                10522,
                10532
            ],
            [
                10539,
                10540
            ],
            [
                10533,
                10538
            ],
            [
                10541,
                10544
            ],
            [
                10557,
                10634
            ],
            [
                10634,
                10650
            ],
            [
                10665,
                10736
            ],
            [
                10736,
                10774
            ],
            [
                10774,
                10829
            ],
            [
                10829,
                10856
            ],
            [
                10868,
                10894
            ],
            [
                10894,
                10973
            ],
            [
                10973,
                10995
            ],
            [
                11033,
                11035
            ],
            [
                11035,
                11038
            ],
            [
                11044,
                11050
            ],
            [
                11071,
                11117
            ],
            [
                11117,
                11193
            ],
            [
                11193,
                11327
            ],
            [
                11390,
                11484
            ],
            [
                11484,
                11551
            ],
            [
                11661,
                11662
            ],
            [
                11578,
                11661
            ],
            [
                11697,
                11699
            ],
            [
                11699,
                11706
            ],
            [
                11719,
                11779
            ],
            [
                11799,
                11808
            ],
            [
                11819,
                11850
            ],
            [
                11855,
                11910
            ],
            [
                11910,
                11972
            ],
            [
                12054,
                12108
            ],
            [
                12108,
                12129
            ],
            [
                12150,
                12248
            ],
            [
                12248,
                12305
            ],
            [
                12305,
                12410
            ],
            [
                12410,
                12488
            ],
            [
                12502,
                12528
            ],
            [
                12528,
                12554
            ],
            [
                12566,
                12643
            ],
            [
                12644,
                12653
            ],
            [
                12653,
                12715
            ],
            [
                12719,
                12747
            ],
            [
                12759,
                12761
            ],
            [
                12761,
                12786
            ],
            [
                12786,
                12826
            ],
            [
                12826,
                12923
            ],
            [
                12969,
                12971
            ],
            [
                12981,
                12992
            ],
            [
                12997,
                13107
            ],
            [
                13107,
                13156
            ],
            [
                13156,
                13180
            ],
            [
                13180,
                13276
            ],
            [
                13276,
                13367
            ],
            [
                13390,
                13438
            ],
            [
                13445,
                13491
            ],
            [
                13517,
                13566
            ],
            [
                13566,
                13581
            ],
            [
                13594,
                13661
            ],
            [
                13672,
                13703
            ],
            [
                13703,
                13860
            ],
            [
                13875,
                13936
            ],
            [
                13943,
                13963
            ],
            [
                13989,
                14011
            ],
            [
                14011,
                14013
            ],
            [
                14025,
                14032
            ],
            [
                14061,
                14085
            ],
            [
                14087,
                14115
            ],
            [
                14124,
                14138
            ],
            [
                14014,
                14016
            ],
            [
                14149,
                14150
            ],
            [
                14160,
                14171
            ],
            [
                14181,
                14235
            ],
            [
                14260,
                14333
            ],
            [
                14335,
                14338
            ],
            [
                14340,
                14362
            ],
            [
                14364,
                14367
            ],
            [
                14369,
                14389
            ],
            [
                14389,
                14463
            ],
            [
                14463,
                14482
            ],
            [
                14482,
                14512
            ],
            [
                14513,
                14556
            ],
            [
                14568,
                14575
            ],
            [
                14602,
                14627
            ],
            [
                14720,
                14722
            ],
            [
                14722,
                14776
            ],
            [
                14776,
                14849
            ],
            [
                14860,
                14893
            ],
            [
                14893,
                14935
            ],
            [
                14935,
                14975
            ],
            [
                14981,
                15023
            ],
            [
                15074,
                15076
            ],
            [
                15076,
                15121
            ],
            [
                15130,
                15132
            ],
            [
                15132,
                15261
            ],
            [
                15269,
                15384
            ],
            [
                15384,
                15424
            ],
            [
                15438,
                15441
            ],
            [
                15450,
                15515
            ],
            [
                15565,
                15609
            ],
            [
                15609,
                15815
            ],
            [
                15815,
                15877
            ]
        ],
        "row_chars": [
            [
                0,
                442
            ],
            [
                442,
                538
            ],
            [
                538,
                934
            ],
            [
                934,
                1116
            ],
            [
                1116,
                1154
            ],
            [
                1154,
                1304
            ],
            [
                1304,
                1473
            ],
            [
                1473,
                1622
            ],
            [
                1622,
                1772
            ],
            [
                1772,
                1795
            ],
            [
                1795,
                1982
            ],
            [
                1982,
                2221
            ],
            [
                2221,
                2510
            ],
            [
                2510,
                2573
            ],
            [
                2573,
                2610
            ],
            [
                2610,
                2779
            ],
            [
                2779,
                2812
            ],
            [
                2812,
                2905
            ],
            [
                2905,
                3000
            ],
            [
                3000,
                3037
            ],
            [
                3037,
                3198
            ],
            [
                3198,
                3321
            ],
            [
                3321,
                3435
            ],
            [
                3435,
                3525
            ],
            [
                3525,
                3857
            ],
            [
                3857,
                3998
            ],
            [
                3998,
                4187
            ],
            [
                4187,
                4405
            ],
            [
                4405,
                4430
            ],
            [
                4430,
                4477
            ],
            [
                4477,
                4749
            ],
            [
                4749,
                4875
            ],
            [
                4875,
                5013
            ],
            [
                5013,
                5121
            ],
            [
                5121,
                5304
            ],
            [
                5304,
                5390
            ],
            [
                5390,
                5421
            ],
            [
                5421,
                5479
            ],
            [
                5479,
                5536
            ],
            [
                5536,
                5593
            ],
            [
                5593,
                5746
            ],
            [
                5746,
                6185
            ],
            [
                6185,
                6616
            ],
            [
                6616,
                6708
            ],
            [
                6708,
                6756
            ],
            [
                6756,
                7099
            ],
            [
                7099,
                7400
            ],
            [
                7400,
                7588
            ],
            [
                7588,
                7744
            ],
            [
                7744,
                7865
            ],
            [
                7865,
                7970
            ],
            [
                7970,
                8029
            ],
            [
                8029,
                8132
            ],
            [
                8132,
                8350
            ],
            [
                8350,
                8382
            ],
            [
                8382,
                8526
            ],
            [
                8526,
                8921
            ],
            [
                8921,
                9038
            ],
            [
                9038,
                9202
            ],
            [
                9202,
                9306
            ],
            [
                9306,
                9448
            ],
            [
                9448,
                9490
            ],
            [
                9490,
                9825
            ],
            [
                9825,
                9984
            ],
            [
                9984,
                10130
            ],
            [
                10130,
                10214
            ],
            [
                10214,
                10255
            ],
            [
                10255,
                10298
            ],
            [
                10298,
                10406
            ],
            [
                10406,
                10422
            ],
            [
                10422,
                10634
            ],
            [
                10634,
                10736
            ],
            [
                10736,
                10774
            ],
            [
                10774,
                10829
            ],
            [
                10829,
                10894
            ],
            [
                10894,
                10973
            ],
            [
                10973,
                11035
            ],
            [
                11035,
                11117
            ],
            [
                11117,
                11193
            ],
            [
                11193,
                11327
            ],
            [
                11327,
                11484
            ],
            [
                11484,
                11699
            ],
            [
                11699,
                11910
            ],
            [
                11910,
                12108
            ],
            [
                12108,
                12248
            ],
            [
                12248,
                12305
            ],
            [
                12305,
                12410
            ],
            [
                12410,
                12528
            ],
            [
                12528,
                12653
            ],
            [
                12653,
                12761
            ],
            [
                12761,
                12786
            ],
            [
                12786,
                12826
            ],
            [
                12826,
                12971
            ],
            [
                12971,
                13107
            ],
            [
                13107,
                13156
            ],
            [
                13156,
                13180
            ],
            [
                13180,
                13276
            ],
            [
                13276,
                13566
            ],
            [
                13566,
                13703
            ],
            [
                13703,
                13963
            ],
            [
                13963,
                14011
            ],
            [
                14011,
                14389
            ],
            [
                14389,
                14463
            ],
            [
                14463,
                14482
            ],
            [
                14482,
                14513
            ],
            [
                14513,
                14722
            ],
            [
                14722,
                14776
            ],
            [
                14776,
                14893
            ],
            [
                14893,
                14935
            ],
            [
                14935,
                15076
            ],
            [
                15076,
                15132
            ],
            [
                15132,
                15384
            ],
            [
                15384,
                15609
            ],
            [
                15609,
                15815
            ],
            [
                15815,
                15877
            ]
        ]
    },
    "abridged": {
        "text": "About a week after his return to Mansfield, Tom's immediate danger was over, and he was so far pronounced safe as to make his mother perfectly easy; for Lady Bertram was the happiest subject in the world for a little medical deceit. The fever was subdued; of course he would soon be well again. Lady Bertram could think nothing less, and Fanny shared her aunt's security, till she received a few lines from Edmund, written to give her a clearer idea of his brother's situation, and acquaint her with the worries which he and his father had imbibed from the physician. They judged it best that Lady Bertram should not be harassed by alarms which, it was to be hoped, would prove unfounded; but there was no reason why Fanny should not know the truth. They were apprehensive for his lungs.\nA very few lines from Edmund showed her the patient in a clearer light than all Lady Bertram's sheets of paper could do. Edmund was the companion he preferred. His aunt worried him by her cares, and Sir Thomas knew not how to bring down his conversation to the level of irritation and feebleness. Edmund was all in all. Fanny certainly believed him so, and must find that she esteemed him more highly than ever when he appeared as the cheerer of a suffering brother. As she now learnt, Tom's nerves were also much affected; there were spirits much depressed to calm and raise, and her own imagination added that there must be a mind to be properly guided.\nThe family were not consumptive, and she was inclined to hope, except when she thought of Miss Crawford; but Miss Crawford seemed to be the child of good luck, and to her selfishness and vanity it would be good luck to have Edmund the only son.\nEven in the sick chamber Mary was not forgotten. Edmund's letter had this postscript. \"I had actually begun a letter to Miss Crawford when called away by Tom's illness, but I have now changed my mind, and fear the influence of her friends. When Tom is better, I shall go.\"\nSuch was the state of Mansfield, with scarcely any change, till Easter. Tom's amendment was alarmingly slow.\nEaster came late this year, as Fanny had most sorrowfully considered, on learning that she had no chance of leaving Portsmouth till after it. It came, and she had still heard nothing of her return. Her aunt often expressed a wish for her, but there was no message from the uncle on whom all depended. She supposed he could not yet leave his son, but it was a cruel delay. The end of April was coming; it would soon be almost three months that she had been absent from them all; and who could say when there might be leisure to think of or to fetch her?\nBefore she came to Portsmouth, she had loved to call it her home; the word was still dear to her, but it must be applied to Mansfield. Portsmouth was Portsmouth; Mansfield was home. Nothing was more consoling than to find her aunt using the same language: \"I very much regret your being from home at this distressing time. I sincerely wish you may never be absent from home so long again,\" were most delightful sentences to her.\nHowever, delicacy to her parents made Fanny careful not to betray such a preference of her uncle's house. It was always: \"When I return to Mansfield.\" But at last the longing grew stronger, it overthrew caution, and she found herself talking of what she should do when she went home. She coloured, and looked fearfully towards her father and mother. She need not have been uneasy. There was no sign of displeasure, or even of hearing her. They were perfectly free from any jealousy of Mansfield.\nFanny was sad to lose the pleasures of spring from being in town. She had not known before how much the beginnings and progress of vegetation had delighted her: what enjoyment she had derived from watching the increasing beauties of that season, from the earliest flowers in her aunt's garden, to the opening of leaves in her uncle's plantations, and the glory of his woods. To lose such pleasures was no trifle; to have confinement, bad air, bad smells, substituted for liberty, freshness, and verdure, was infinitely worse: but worst of all was the conviction of being missed by her best friends, and the longing to be useful to those who needed her!\nAt home, she might have been of use to every creature in the house. To all she must have saved some trouble; and were it only in supporting the spirits of her aunt Bertram, keeping her from the evil of solitude, or the greater evil of a restless, officious sister, too apt to heighten danger in order to enhance her own importance, Fanny's being there would have been a general good. She loved to fancy how she could have read to her aunt, and talked to her, and tried to make her feel the blessing of what was, and prepare her mind for what might be; and how many walks up and down stairs she might have saved her, and how many messages she might have carried.\nIt astonished her that Tom's sisters could be satisfied with remaining in London, through an illness which had now lasted several weeks. They might return to Mansfield when they chose; travelling could be no difficulty to them. Even if Mrs. Rushworth could imagine any interfering obligations, Julia was certainly able to quit London whenever she chose. It appeared from one of her aunt's letters that Julia had offered to return if wanted, but this was all. She would rather remain where she was.\nFanny thought the influence of London was at war with all respectable attachments. As well as her cousins, she saw proof of it in Miss Crawford. It was so long since Fanny had had any letter from her, that she had reason to think lightly of the friendship which had been so dwelt on. It was weeks since she had heard anything of Miss Crawford or of her other connexions in town, except through Mansfield, and she was beginning to suppose that she might never hear from her any more this spring, when the following letter was received to revive old and create some new sensations-\n\"Forgive me, my dear Fanny, as soon as you can, for my long silence. You are so good, that I depend upon being treated better than I deserve, and I write now to beg an immediate answer. I want to know the state of things at Mansfield Park. One should be a brute not to feel for their distress; and from what I hear, poor Mr. Bertram has a bad chance of recovery. I thought little of his illness at first. I looked upon him as the sort of person to make a fuss in any trifling disorder, and was chiefly concerned for those who had to nurse him; but now it seems that he is really in a decline, that the symptoms are most alarming, and that part of the family, at least, are aware of it. I am sure you must be included in that part, and therefore entreat you to let me know how far I have been rightly informed. I shall be rejoiced to hear there has been any mistake, but the report is so prevalent that I confess I cannot help trembling. To have such a fine young man cut off in the flower of his days is most melancholy. Poor Sir Thomas will feel it dreadfully. I really am quite agitated on the subject. Fanny, Fanny, I see you smile and look cunning, but, upon my honour, I never bribed a physician in my life. Poor young man! If he is to die, there will be two poor young men less in the world; and with a bold voice I would say that wealth and consequence could fall into no hands more deserving of them. It was a foolish haste last Christmas, but the evil of a few days may be blotted out in part. Varnish and gilding hide many stains. It will be but the loss of the Esquire after his name. With real affection, Fanny, more might be overlooked. Write to me by return of post, judge of my anxiety, and do not trifle with it. Tell me the real truth. And do not be ashamed of either my feelings or your own. Believe me, they are not only natural, they are philanthropic and virtuous. I put it to your conscience, whether 'Sir Edmund' would not do more good with all the Bertram property than any other possible 'Sir.' You are now the only one I can apply to for the truth, his sisters not being within my reach. Mrs. R. has been spending the Easter with the Aylmers at Twickenham, and is not yet returned; and Julia is with the cousins who live near Bedford Square. Could I apply to either, however, I should still prefer you, because they have been so unwilling to have their amusements cut up, as to shut their eyes to the truth. I suppose Mrs. R.'s Easter holidays will not last much longer; with her husband away, she can have nothing but enjoyment. I give her credit for encouraging him to go dutifully down to Bath, to fetch his mother; but how will she and the dowager agree in one house? Henry is not at hand, so I have nothing to say from him. Do not you think Edmund would have been in town again long ago, but for this illness?-Yours ever, Mary.\"\n\"I had actually begun folding my letter when Henry walked in, but he brings no news to prevent my sending it. Mrs. R. knows a decline is feared; he saw her this morning: she returns to Wimpole Street to-day; the old lady, Mr. Rushworth's mother, is come. Now do not make yourself uneasy with any queer fancies because Henry has been spending a few days near Twickenham. He does it every spring. Be assured he cares for nobody but you. At this very moment he is wild to see you, and occupied only in contriving the means for doing so. He repeats, more eagerly, what he said at Portsmouth about our conveying you home, and I join him in it with all my soul. Dear Fanny, write directly, and tell us to come. It will do us all good. He and I can go to the Parsonage, you know, and be no trouble to our friends at Mansfield Park. It would really be gratifying to see them all again, and a little addition of society might benefit them; and as to yourself, you must feel yourself so wanted there, that you cannot in conscience keep away, when you have the means of returning. I have not time to give half Henry's messages; be satisfied that the spirit of each one is unalterable affection.\"\nFanny's disgust at the greater part of this letter, with her extreme reluctance to bring the writer of it and her cousin Edmund together, would have made her incapable of judging impartially whether the concluding offer should be accepted or not. It was most tempting. To find herself transported to Mansfield was an image of the greatest happiness, but it would be a drawback to owe such felicity to persons in whose feelings and conduct she saw so much to condemn: the sister's feelings, the brother's conduct, her cold-hearted ambition, his thoughtless vanity. To have him still the acquaintance, the flirt perhaps, of Mrs. Rushworth! She was mortified. She had thought better of him.\nHappily, however, she was not left to weigh between doubtful notions of right. She had a rule to apply to, which settled everything. Her awe of her uncle, and her dread of taking a liberty with him, made it plain to her what she had to do. She must absolutely decline the proposal. If he wanted, he would send for her; and to offer an early return was a presumption. She thanked Miss Crawford, but gave a decided no. \"Her uncle, she understood, meant to fetch her; and as her cousin's illness had continued so many weeks without her being thought necessary, she must suppose her return would be unwelcome at present, and that she should be felt an encumbrance.\"\nHer representation of her cousin's state was according to her own belief of it, and such as she supposed would give Miss Crawford the hope of everything she was wishing for. Edmund would be forgiven for being a clergyman, it seemed, under certain conditions of wealth; and this, she suspected, was all the conquest of prejudice which he was so ready to congratulate himself upon. She had only learnt to think nothing of consequence but money.",
        "paragraph_chars": [
            [
                0,
                788
            ],
            [
                788,
                1444
            ],
            [
                1444,
                1689
            ],
            [
                1689,
                1962
            ],
            [
                1962,
                2071
            ],
            [
                2071,
                2624
            ],
            [
                2624,
                3053
            ],
            [
                3053,
                3549
            ],
            [
                3549,
                4202
            ],
            [
                4202,
                4864
            ],
            [
                4864,
                5362
            ],
            [
                5362,
                5942
            ],
            [
                5942,
                8802
            ],
            [
                8802,
                9987
            ],
            [
                9987,
                10675
            ],
            [
                10675,
                11337
            ],
            [
                11337,
                11779
            ]
        ],
        "segment_chars": [
            [
                0,
                233
            ],
            [
                233,
                295
            ],
            [
                295,
                568
            ],
            [
                568,
                750
            ],
            [
                750,
                788
            ],
            [
                788,
                909
            ],
            [
                909,
                948
            ],
            [
                948,
                1085
            ],
            [
                1085,
                1108
            ],
            [
                1108,
                1255
            ],
            [
                1255,
                1444
            ],
            [
                1444,
                1689
            ],
            [
                1689,
                1738
            ],
            [
                1738,
                1775
            ],
            [
                1775,
                1929
            ],
            [
                1929,
                1962
            ],
            [
                1962,
                2034
            ],
            [
                2034,
                2071
            ],
            [
                2071,
                2213
            ],
            [
                2213,
                2269
            ],
            [
                2269,
                2372
            ],
            [
                2372,
                2443
            ],
            [
                2443,
                2624
            ],
            [
                2624,
                2759
            ],
            [
                2759,
                2806
            ],
            [
                2806,
                2947
            ],
            [
                2947,
                3053
            ],
            [
                3053,
                3159
            ],
            [
                3159,
                3204
            ],
            [
                3204,
                3337
            ],
            [
                3337,
                3403
            ],
            [
                3403,
                3434
            ],
            [
                3434,
                3492
            ],
            [
                3492,
                3549
            ],
            [
                3549,
                3615
            ],
            [
                3615,
                3924
            ],
            [
                3924,
                4202
            ],
            [
                4202,
                4270
            ],
            [
                4270,
                4586
            ],
            [
                4586,
                4864
            ],
            [
                4864,
                5001
            ],
            [
                5001,
                5092
            ],
            [
                5092,
                5218
            ],
            [
                5218,
                5323
            ],
            [
                5323,
                5362
            ],
            [
                5362,
                5445
            ],
            [
                5445,
                5507
            ],
            [
                5507,
                5646
            ],
            [
                5646,
                5942
            ],
            [
                5942,
                6011
            ],
            [
                6011,
                6128
            ],
            [
                6128,
                6182
            ],
            [
                6182,
                6305
            ],
            [
                6305,
                6347
            ],
            [
                6347,
                6628
            ],
            [
                6628,
                6752
            ],
            [
                6752,
                6879
            ],
            [
                6879,
                6963
            ],
            [
                6963,
                7004
            ],
            [
                7004,
                7047
            ],
            [
                7047,
                7155
            ],
            [
                7155,
                7171
            ],
            [
                7171,
                7351
            ],
            [
                7351,
                7445
            ],
            [
                7445,
                7483
            ],
            [
                7483,
                7538
            ],
            [
                7538,
                7592
            ],
            [
                7592,
                7671
            ],
            [
                7671,
                7695
            ],
            [
                7695,
                7752
            ],
            [
                7752,
                7828
            ],
            [
                7828,
                7962
            ],
            [
                7962,
                8056
            ],
            [
                8056,
                8210
            ],
            [
                8210,
                8376
            ],
            [
                8376,
                8498
            ],
            [
                8498,
                8640
            ],
            [
                8640,
                8697
            ],
            [
                8697,
                8802
            ],
            [
                8802,
                8912
            ],
            [
                8912,
                9057
            ],
            [
                9057,
                9172
            ],
            [
                9172,
                9197
            ],
            [
                9197,
                9237
            ],
            [
                9237,
                9336
            ],
            [
                9336,
                9458
            ],
            [
                9458,
                9507
            ],
            [
                9507,
                9531
            ],
            [
                9531,
                9627
            ],
            [
                9627,
                9872
            ],
            [
                9872,
                9987
            ],
            [
                9987,
                10234
            ],
            [
                10234,
                10256
            ],
            [
                10256,
                10551
            ],
            [
                10551,
                10625
            ],
            [
                10625,
                10644
            ],
            [
                10644,
                10675
            ],
            [
                10675,
                10754
            ],
            [
                10754,
                10808
            ],
            [
                10808,
                10915
            ],
            [
                10915,
                10957
            ],
            [
                10957,
                11042
            ],
            [
                11042,
                11092
            ],
            [
                11092,
                11337
            ],
            [
                11337,
                11511
            ],
            [
                11511,
                11717
            ],
            [
                11717,
                11779
            ]
        ],
        "overlap_chars": [
            [
                0,
                5
            ],
            [
                6,
                7
            ],
            [
                8,
                12
            ],
            [
                19,
                152
            ],
            [
                153,
                224
            ],
            [
                231,
                233
            ],
            [
                233,
                254
            ],
            [
                254,
                295
            ],
            [
                295,
                422
            ],
            [
                423,
                503
            ],
            [
                512,
                566
            ],
            [
                566,
                568
            ],
            [
                568,
                750
            ],
            [
                750,
                788
            ],
            [
                788,
                816
            ],
            [
                824,
                839
            ],
            [
                840,
                844
            ],
            [
                853,
                909
            ],
            [
                909,
                948
            ],
            [
                948,
                1041
            ],
            [
                1042,
                1085
            ],
            [
                1085,
                1108
            ],
            [
                1108,
                1113
            ],
            [
                1114,
                1123
            ],
            [
                1133,
                1139
            ],
            [
                1139,
                1159
            ],
            [
                1173,
                1176
            ],
            [
                1189,
                1222
            ],
            [
                1223,
                1255
            ],
            [
                1255,
                1273
            ],
            [
                1280,
                1286
            ],
            [
                1292,
                1296
            ],
            [
                1297,
                1310
            ],
            [
                1312,
                1317
            ],
            [
                1323,
                1444
            ],
            [
                1444,
                1488
            ],
            [
                1489,
                1505
            ],
            [
                1505,
                1566
            ],
            [
                1580,
                1689
            ],
            [
                1689,
                1713
            ],
            [
                1714,
                1738
            ],
            [
                1738,
                1775
            ],
            [
                1775,
                1776
            ],
            [
                1776,
                1805
            ],
            [
                1806,
                1808
            ],
            [
                1823,
                1898
            ],
            [
                1899,
                1915
            ],
            [
                1920,
                1929
            ],
            [
                1929,
                1962
            ],
            [
                1962,
                1993
            ],
            [
                1993,
                2034
            ],
            [
                2034,
                2071
            ],
            [
                2071,
                2082
            ],
            [
                2083,
                2143
            ],
            [
                2144,
                2213
            ],
            [
                2213,
                2233
            ],
            [
                2240,
                2267
            ],
            [
                2267,
                2269
            ],
            [
                2269,
                2326
            ],
            [
                2327,
                2372
            ],
            [
                2372,
                2435
            ],
            [
                2436,
                2441
            ],
            [
                2441,
                2443
            ],
            [
                2443,
                2470
            ],
            [
                2470,
                2508
            ],
            [
                2509,
                2547
            ],
            [
                2547,
                2562
            ],
            [
                2563,
                2609
            ],
            [
                2610,
                2612
            ],
            [
                2613,
                2624
            ],
            [
                2631,
                2634
            ],
            [
                2640,
                2688
            ],
            [
                2688,
                2698
            ],
            [
                2699,
                2702
            ],
            [
                2703,
                2708
            ],
            [
                2709,
                2720
            ],
            [
                2720,
                2759
            ],
            [
                2759,
                2806
            ],
            [
                2806,
                2827
            ],
            [
                2833,
                2882
            ],
            [
                2883,
                2887
            ],
            [
                2888,
                2945
            ],
            [
                2945,
                2947
            ],
            [
                2947,
                2948
            ],
            [
                2949,
                3052
            ],
            [
                3060,
                3061
            ],
            [
                3062,
                3090
            ],
            [
                3097,
                3159
            ],
            [
                3159,
                3181
            ],
            [
                3182,
                3201
            ],
            [
                3201,
                3204
            ],
            [
                3204,
                3335
            ],
            [
                3335,
                3337
            ],
            [
                3337,
                3340
            ],
            [
                3341,
                3403
            ],
            [
                3403,
                3434
            ],
            [
                3434,
                3492
            ],
            [
                3492,
                3548
            ],
            [
                3549,
                3554
            ],
            [
                3555,
                3565
            ],
            [
                3566,
                3570
            ],
            [
                3571,
                3594
            ],
            [
                3606,
                3608
            ],
            [
                3609,
                3615
            ],
            [
                3615,
                3708
            ],
            [
                3710,
                3714
            ],
            [
                3725,
                3758
            ],
            [
                3759,
                3778
            ],
            [
                3779,
                3793
            ],
            [
                3793,
                3794
            ],
            [
                3795,
                3823
            ],
            [
                3824,
                3867
            ],
            [
                3868,
                3870
            ],
            [
                3871,
                3924
            ],
            [
                3924,
                3926
            ],
            [
                3932,
                3961
            ],
            [
                3962,
                4039
            ],
            [
                4040,
                4078
            ],
            [
                4085,
                4087
            ],
            [
                4092,
                4095
            ],
            [
                4096,
                4189
            ],
            [
                4197,
                4202
            ],
            [
                4202,
                4233
            ],
            [
                4238,
                4270
            ],
            [
                4270,
                4309
            ],
            [
                4309,
                4420
            ],
            [
                4421,
                4458
            ],
            [
                4465,
                4477
            ],
            [
                4478,
                4484
            ],
            [
                4487,
                4533
            ],
            [
                4542,
                4586
            ],
            [
                4586,
                4641
            ],
            [
                4646,
                4670
            ],
            [
                4671,
                4864
            ],
            [
                4864,
                4944
            ],
            [
                4944,
                4978
            ],
            [
                4979,
                5001
            ],
            [
                5001,
                5005
            ],
            [
                5006,
                5085
            ],
            [
                5086,
                5090
            ],
            [
                5090,
                5092
            ],
            [
                5097,
                5218
            ],
            [
                5218,
                5323
            ],
            [
                5323,
                5362
            ],
            [
                5362,
                5367
            ],
            [
                5376,
                5399
            ],
            [
                5400,
                5403
            ],
            [
                5404,
                5445
            ],
            [
                5445,
                5455
            ],
            [
                5456,
                5467
            ],
            [
                5467,
                5468
            ],
            [
                5469,
                5476
            ],
            [
                5477,
                5505
            ],
            [
                5505,
                5507
            ],
            [
                5507,
                5575
            ],
            [
                5576,
                5646
            ],
            [
                5646,
                5820
            ],
            [
                5821,
                5830
            ],
            [
                5835,
                5942
            ],
            [
                5942,
                6009
            ],
            [
                6009,
                6011
            ],
            [
                6011,
                6128
            ],
            [
                6128,
                6180
            ],
            [
                6180,
                6182
            ],
            [
                6182,
                6219
            ],
            [
                6226,
                6234
            ],
            [
                6234,
                6294
            ],
            [
                6295,
                6305
            ],
            [
                6305,
                6347
            ],
            [
                6347,
                6389
            ],
            [
                6390,
                6401
            ],
            [
                6402,
                6496
            ],
            [
                6503,
                6628
            ],
            [
                6628,
                6666
            ],
            [
                6667,
                6752
            ],
            [
                6752,
                6762
            ],
            [
                6763,
                6771
            ],
            [
                6772,
                6879
            ],
            [
                6879,
                6963
            ],
            [
                6963,
                7004
            ],
            [
                7004,
                7047
            ],
            [
                7047,
                7155
            ],
            [
                7155,
                7171
            ],
            [
                7171,
                7201
            ],
            [
                7202,
                7205
            ],
            [
                7206,
                7250
            ],
            [
                7251,
                7261
            ],
            [
                7262,
                7263
            ],
            [
                7264,
                7269
            ],
            [
                7270,
                7273
            ],
            [
                7274,
                7351
            ],
            [
                7351,
                7367
            ],
            [
                7374,
                7445
            ],
            [
                7445,
                7483
            ],
            [
                7483,
                7538
            ],
            [
                7538,
                7565
            ],
            [
                7566,
                7592
            ],
            [
                7592,
                7671
            ],
            [
                7671,
                7693
            ],
            [
                7693,
                7695
            ],
            [
                7695,
                7698
            ],
            [
                7699,
                7705
            ],
            [
                7706,
                7752
            ],
            [
                7752,
                7828
            ],
            [
                7828,
                7962
            ],
            [
                7962,
                8056
            ],
            [
                8056,
                8123
            ],
            [
                8123,
                8124
            ],
            [
                8125,
                8208
            ],
            [
                8208,
                8210
            ],
            [
                8210,
                8217
            ],
            [
                8218,
                8278
            ],
            [
                8279,
                8288
            ],
            [
                8289,
                8320
            ],
            [
                8321,
                8376
            ],
            [
                8376,
                8438
            ],
            [
                8444,
                8498
            ],
            [
                8498,
                8519
            ],
            [
                8542,
                8640
            ],
            [
                8640,
                8697
            ],
            [
                8697,
                8802
            ],
            [
                8802,
                8880
            ],
            [
                8886,
                8912
            ],
            [
                8912,
                8938
            ],
            [
                8945,
                9022
            ],
            [
                9048,
                9057
            ],
            [
                9057,
                9119
            ],
            [
                9126,
                9154
            ],
            [
                9170,
                9172
            ],
            [
                9172,
                9197
            ],
            [
                9197,
                9237
            ],
            [
                9237,
                9334
            ],
            [
                9334,
                9336
            ],
            [
                9336,
                9347
            ],
            [
                9348,
                9458
            ],
            [
                9458,
                9507
            ],
            [
                9507,
                9531
            ],
            [
                9531,
                9627
            ],
            [
                9627,
                9718
            ],
            [
                9727,
                9775
            ],
            [
                9776,
                9822
            ],
            [
                9823,
                9872
            ],
            [
                9872,
                9887
            ],
            [
                9888,
                9955
            ],
            [
                9956,
                9987
            ],
            [
                9987,
                10144
            ],
            [
                10145,
                10206
            ],
            [
                10214,
                10234
            ],
            [
                10234,
                10256
            ],
            [
                10256,
                10258
            ],
            [
                10264,
                10271
            ],
            [
                10272,
                10296
            ],
            [
                10297,
                10325
            ],
            [
                10335,
                10349
            ],
            [
                10350,
                10352
            ],
            [
                10353,
                10354
            ],
            [
                10355,
                10366
            ],
            [
                10371,
                10425
            ],
            [
                10426,
                10499
            ],
            [
                10500,
                10503
            ],
            [
                10504,
                10526
            ],
            [
                10527,
                10530
            ],
            [
                10531,
                10551
            ],
            [
                10551,
                10625
            ],
            [
                10625,
                10644
            ],
            [
                10644,
                10674
            ],
            [
                10675,
                10718
            ],
            [
                10719,
                10726
            ],
            [
                10727,
                10752
            ],
            [
                10752,
                10754
            ],
            [
                10754,
                10808
            ],
            [
                10808,
                10881
            ],
            [
                10882,
                10915
            ],
            [
                10915,
                10957
            ],
            [
                10957,
                10997
            ],
            [
                10998,
                11040
            ],
            [
                11040,
                11042
            ],
            [
                11042,
                11087
            ],
            [
                11090,
                11092
            ],
            [
                11092,
                11221
            ],
            [
                11222,
                11337
            ],
            [
                11337,
                11377
            ],
            [
                11378,
                11381
            ],
            [
                11382,
                11447
            ],
            [
                11467,
                11511
            ],
            [
                11511,
                11717
            ],
            [
                11717,
                11779
            ]
        ],
        "row_chars": [
            [
                0,
                233
            ],
            [
                233,
                295
            ],
            [
                295,
                568
            ],
            [
                568,
                750
            ],
            [
                750,
                788
            ],
            [
                788,
                909
            ],
            [
                909,
                909
            ],
            [
                909,
                948
            ],
            [
                948,
                1085
            ],
            [
                1085,
                1108
            ],
            [
                1108,
                1255
            ],
            [
                1255,
                1444
            ],
            [
                1444,
                1689
            ],
            [
                1689,
                1738
            ],
            [
                1738,
                1775
            ],
            [
                1775,
                1929
            ],
            [
                1929,
                1962
            ],
            [
                1962,
                2034
            ],
            [
                2034,
                2034
            ],
            [
                2034,
                2071
            ],
            [
                2071,
                2213
            ],
            [
                2213,
                2269
            ],
            [
                2269,
                2372
            ],
            [
                2372,
                2443
            ],
            [
                2443,
                2624
            ],
            [
                2624,
                2624
            ],
            [
                2624,
                2624
            ],
            [
                2624,
                2759
            ],
            [
                2759,
                2759
            ],
            [
                2759,
                2806
            ],
            [
                2806,
                2947
            ],
            [
                2947,
                3053
            ],
            [
                3053,
                3159
            ],
            [
                3159,
                3204
            ],
            [
                3204,
                3337
            ],
            [
                3337,
                3403
            ],
            [
                3403,
                3434
            ],
            [
                3434,
                3492
            ],
            [
                3492,
                3549
            ],
            [
                3549,
                3549
            ],
            [
                3549,
                3615
            ],
            [
                3615,
                3924
            ],
            [
                3924,
                4202
            ],
            [
                4202,
                4270
            ],
            [
                4270,
                4270
            ],
            [
                4270,
                4586
            ],
            [
                4586,
                4864
            ],
            [
                4864,
                5001
            ],
            [
                5001,
                5092
            ],
            [
                5092,
                5218
            ],
            [
                5218,
                5323
            ],
            [
                5323,
                5362
            ],
            [
                5362,
                5445
            ],
            [
                5445,
                5507
            ],
            [
                5507,
                5507
            ],
            [
                5507,
                5646
            ],
            [
                5646,
                5942
            ],
            [
                5942,
                6011
            ],
            [
                6011,
                6128
            ],
            [
                6128,
                6182
            ],
            [
                6182,
                6305
            ],
            [
                6305,
                6347
            ],
            [
                6347,
                6628
            ],
            [
                6628,
                6752
            ],
            [
                6752,
                6879
            ],
            [
                6879,
                6963
            ],
            [
                6963,
                7004
            ],
            [
                7004,
                7047
            ],
            [
                7047,
                7155
            ],
            [
                7155,
                7171
            ],
            [
                7171,
                7351
            ],
            [
                7351,
                7445
            ],
            [
                7445,
                7483
            ],
            [
                7483,
                7538
            ],
            [
                7538,
                7592
            ],
            [
                7592,
                7671
            ],
            [
                7671,
                7695
            ],
            [
                7695,
                7752
            ],
            [
                7752,
                7828
            ],
            [
                7828,
                7962
            ],
            [
                7962,
                8056
            ],
            [
                8056,
                8210
            ],
            [
                8210,
                8376
            ],
            [
                8376,
                8498
            ],
            [
                8498,
                8640
            ],
            [
                8640,
                8697
            ],
            [
                8697,
                8802
            ],
            [
                8802,
                8912
            ],
            [
                8912,
                9057
            ],
            [
                9057,
                9172
            ],
            [
                9172,
                9197
            ],
            [
                9197,
                9237
            ],
            [
                9237,
                9336
            ],
            [
                9336,
                9458
            ],
            [
                9458,
                9507
            ],
            [
                9507,
                9531
            ],
            [
                9531,
                9627
            ],
            [
                9627,
                9872
            ],
            [
                9872,
                9987
            ],
            [
                9987,
                10234
            ],
            [
                10234,
                10256
            ],
            [
                10256,
                10551
            ],
            [
                10551,
                10625
            ],
            [
                10625,
                10644
            ],
            [
                10644,
                10675
            ],
            [
                10675,
                10754
            ],
            [
                10754,
                10808
            ],
            [
                10808,
                10915
            ],
            [
                10915,
                10957
            ],
            [
                10957,
                11042
            ],
            [
                11042,
                11092
            ],
            [
                11092,
                11337
            ],
            [
                11337,
                11511
            ],
            [
                11511,
                11717
            ],
            [
                11717,
                11779
            ]
        ]
    }
}