{
    "original": {
        "text": "As Fanny could not doubt that her answer was conveying a real disappointment, she was rather in expectation, from her knowledge of Miss Crawford's temper, of being urged again; and though no second letter arrived for the space of a week, she had still the same feeling when it did come.\nOn receiving it, she could instantly decide on its containing little writing, and was persuaded of its having the air of a letter of haste and business. Its object was unquestionable; and two moments were enough to start the probability of its being merely to give her notice that they should be in Portsmouth that very day, and to throw her into all the agitation of doubting what she ought to do in such a case. If two moments, however, can surround with difficulties, a third can disperse them; and before she had opened the letter, the possibility of Mr. and Miss Crawford's having applied to her uncle and obtained his permission was giving her ease. This was the letter-\n\"A most scandalous, ill-natured rumour has just reached me, and I write, dear Fanny, to warn you against giving the least credit to it, should it spread into the country. Depend upon it, there is some mistake, and that a day or two will clear it up; at any rate, that Henry is blameless, and in spite of a moment's _etourderie_, thinks of nobody but you. Say not a word of it; hear nothing, surmise nothing, whisper nothing till I write again. I am sure it will be all hushed up, and nothing proved but Rushworth's folly. If they are gone, I would lay my life they are only gone to Mansfield Park, and Julia with them. But why would not you let us come for you? I wish you may not repent it.-Yours, etc.\"\nFanny stood aghast. As no scandalous, ill-natured rumour had reached her, it was impossible for her to understand much of this strange letter. She could only perceive that it must relate to Wimpole Street and Mr. Crawford, and only conjecture that something very imprudent had just occurred in that quarter to draw the notice of the world, and to excite her jealousy, in Miss Crawford's apprehension, if she heard it. Miss Crawford need not be alarmed for her. She was only sorry for the parties concerned and for Mansfield, if the report should spread so far; but she hoped it might not. If the Rushworths were gone themselves to Mansfield, as was to be inferred from what Miss Crawford said, it was not likely that anything unpleasant should have preceded them, or at least should make any impression.\nAs to Mr. Crawford, she hoped it might give him a knowledge of his own disposition, convince him that he was not capable of being steadily attached to any one woman in the world, and shame him from persisting any longer in addressing herself.\nIt was very strange! She had begun to think he really loved her, and to fancy his affection for her something more than common; and his sister still said that he cared for nobody else. Yet there must have been some marked display of attentions to her cousin, there must have been some strong indiscretion, since her correspondent was not of a sort to regard a slight one.\nVery uncomfortable she was, and must continue, till she heard from Miss Crawford again. It was impossible to banish the letter from her thoughts, and she could not relieve herself by speaking of it to any human being. Miss Crawford need not have urged secrecy with so much warmth; she might have trusted to her sense of what was due to her cousin.\nThe next day came and brought no second letter. Fanny was disappointed. She could still think of little else all the morning; but, when her father came back in the afternoon with the daily newspaper as usual, she was so far from expecting any elucidation through such a channel that the subject was for a moment out of her head.\nShe was deep in other musing. The remembrance of her first evening in that room, of her father and his newspaper, came across her. No candle was now wanted. The sun was yet an hour and half above the horizon. She felt that she had, indeed, been three months there; and the sun's rays falling strongly into the parlour, instead of cheering, made her still more melancholy, for sunshine appeared to her a totally different thing in a town and in the country. Here, its power was only a glare: a stifling, sickly glare, serving but to bring forward stains and dirt that might otherwise have slept. There was neither health nor gaiety in sunshine in a town. She sat in a blaze of oppressive heat, in a cloud of moving dust, and her eyes could only wander from the walls, marked by her father's head, to the table cut and notched by her brothers, where stood the tea-board never thoroughly cleaned, the cups and saucers wiped in streaks, the milk a mixture of motes floating in thin blue, and the bread and butter growing every minute more greasy than even Rebecca's hands had first produced it. Her father read his newspaper, and her mother lamented over the ragged carpet as usual, while the tea was in preparation, and wished Rebecca would mend it; and Fanny was first roused by his calling out to her, after humphing and considering over a particular paragraph: \"What's the name of your great cousins in town, Fan?\"\nA moment's recollection enabled her to say, \"Rushworth, sir.\"\n\"And don't they live in Wimpole Street?\"\n\"Yes, sir.\"\n\"Then, there's the devil to pay among them, that's all! There\" (holding out the paper to her); \"much good may such fine relations do you. I don't know what Sir Thomas may think of such matters; he may be too much of the courtier and fine gentleman to like his daughter the less. But, by G-! if she belonged to _me_, I'd give her the rope's end as long as I could stand over her. A little flogging for man and woman too would be the best way of preventing such things.\"\nFanny read to herself that \"it was with infinite concern the newspaper had to announce to the world a matrimonial _fracas_ in the family of Mr. R. of Wimpole Street; the beautiful Mrs. R., whose name had not long been enrolled in the lists of Hymen, and who had promised to become so brilliant a leader in the fashionable world, having quitted her husband's roof in company with the well-known and captivating Mr. C., the intimate friend and associate of Mr. R., and it was not known even to the editor of the newspaper whither they were gone.\"\n\"It is a mistake, sir,\" said Fanny instantly; \"it must be a mistake, it cannot be true; it must mean some other people.\"\nShe spoke from the instinctive wish of delaying shame; she spoke with a resolution which sprung from despair, for she spoke what she did not, could not believe herself. It had been the shock of conviction as she read. The truth rushed on her; and how she could have spoken at all, how she could even have breathed, was afterwards matter of wonder to herself.\nMr. Price cared too little about the report to make her much answer. \"It might be all a lie,\" he acknowledged; \"but so many fine ladies were going to the devil nowadays that way, that there was no answering for anybody.\"\n\"Indeed, I hope it is not true,\" said Mrs. Price plaintively; \"it would be so very shocking! If I have spoken once to Rebecca about that carpet, I am sure I have spoke at least a dozen times; have not I, Betsey? And it would not be ten minutes' work.\"\nThe horror of a mind like Fanny's, as it received the conviction of such guilt, and began to take in some part of the misery that must ensue, can hardly be described. At first, it was a sort of stupefaction; but every moment was quickening her perception of the horrible evil. She could not doubt, she dared not indulge a hope, of the paragraph being false. Miss Crawford's letter, which she had read so often as to make every line her own, was in frightful conformity with it. Her eager defence of her brother, her hope of its being _hushed_ _up_, her evident agitation, were all of a piece with something very bad; and if there was a woman of character in existence, who could treat as a trifle this sin of the first magnitude, who would try to gloss it over, and desire to have it unpunished, she could believe Miss Crawford to be the woman! Now she could see her own mistake as to _who_ were gone, or _said_ to be gone. It was not Mr. and Mrs. Rushworth; it was Mrs. Rushworth and Mr. Crawford.\nFanny seemed to herself never to have been shocked before. There was no possibility of rest. The evening passed without a pause of misery, the night was totally sleepless. She passed only from feelings of sickness to shudderings of horror; and from hot fits of fever to cold. The event was so shocking, that there were moments even when her heart revolted from it as impossible: when she thought it could not be. A woman married only six months ago; a man professing himself devoted, even _engaged_ to another; that other her near relation; the whole family, both families connected as they were by tie upon tie; all friends, all intimate together! It was too horrible a confusion of guilt, too gross a complication of evil, for human nature, not in a state of utter barbarism, to be capable of! yet her judgment told her it was so. _His_ unsettled affections, wavering with his vanity, _Maria's_ decided attachment, and no sufficient principle on either side, gave it possibility: Miss Crawford's letter stampt it a fact.\nWhat would be the consequence? Whom would it not injure? Whose views might it not affect? Whose peace would it not cut up for ever? Miss Crawford, herself, Edmund; but it was dangerous, perhaps, to tread such ground. She confined herself, or tried to confine herself, to the simple, indubitable family misery which must envelop all, if it were indeed a matter of certified guilt and public exposure. The mother's sufferings, the father's; there she paused. Julia's, Tom's, Edmund's; there a yet longer pause. They were the two on whom it would fall most horribly. Sir Thomas's parental solicitude and high sense of honour and decorum, Edmund's upright principles, unsuspicious temper, and genuine strength of feeling, made her think it scarcely possible for them to support life and reason under such disgrace; and it appeared to her that, as far as this world alone was concerned, the greatest blessing to every one of kindred with Mrs. Rushworth would be instant annihilation.\nNothing happened the next day, or the next, to weaken her terrors. Two posts came in, and brought no refutation, public or private. There was no second letter to explain away the first from Miss Crawford; there was no intelligence from Mansfield, though it was now full time for her to hear again from her aunt. This was an evil omen. She had, indeed, scarcely the shadow of a hope to soothe her mind, and was reduced to so low and wan and trembling a condition, as no mother, not unkind, except Mrs. Price could have overlooked, when the third day did bring the sickening knock, and a letter was again put into her hands. It bore the London postmark, and came from Edmund.\n\"Dear Fanny,-You know our present wretchedness. May God support you under your share! We have been here two days, but there is nothing to be done. They cannot be traced. You may not have heard of the last blow-Julia's elopement; she is gone to Scotland with Yates. She left London a few hours before we entered it. At any other time this would have been felt dreadfully. Now it seems nothing; yet it is an heavy aggravation. My father is not overpowered. More cannot be hoped. He is still able to think and act; and I write, by his desire, to propose your returning home. He is anxious to get you there for my mother's sake. I shall be at Portsmouth the morning after you receive this, and hope to find you ready to set off for Mansfield. My father wishes you to invite Susan to go with you for a few months. Settle it as you like; say what is proper; I am sure you will feel such an instance of his kindness at such a moment! Do justice to his meaning, however I may confuse it. You may imagine something of my present state. There is no end of the evil let loose upon us. You will see me early by the mail.-Yours, etc.\"\nNever had Fanny more wanted a cordial. Never had she felt such a one as this letter contained. To-morrow! to leave Portsmouth to-morrow! She was, she felt she was, in the greatest danger of being exquisitely happy, while so many were miserable. The evil which brought such good to her! She dreaded lest she should learn to be insensible of it. To be going so soon, sent for so kindly, sent for as a comfort, and with leave to take Susan, was altogether such a combination of blessings as set her heart in a glow, and for a time seemed to distance every pain, and make her incapable of suitably sharing the distress even of those whose distress she thought of most. Julia's elopement could affect her comparatively but little; she was amazed and shocked; but it could not occupy her, could not dwell on her mind. She was obliged to call herself to think of it, and acknowledge it to be terrible and grievous, or it was escaping her, in the midst of all the agitating pressing joyful cares attending this summons to herself.\nThere is nothing like employment, active indispensable employment, for relieving sorrow. Employment, even melancholy, may dispel melancholy, and her occupations were hopeful. She had so much to do, that not even the horrible story of Mrs. Rushworth (now fixed to the last point of certainty), could affect her as it had done before. She had not time to be miserable. Within twenty-four hours she was hoping to be gone; her father and mother must be spoken to, Susan prepared, everything got ready. Business followed business; the day was hardly long enough. The happiness she was imparting, too, happiness very little alloyed by the black communication which must briefly precede it-the joyful consent of her father and mother to Susan's going with her-the general satisfaction with which the going of both seemed regarded, and the ecstasy of Susan herself, was all serving to support her spirits.\nThe affliction of the Bertrams was little felt in the family. Mrs. Price talked of her poor sister for a few minutes, but how to find anything to hold Susan's clothes, because Rebecca took away all the boxes and spoilt them, was much more in her thoughts: and as for Susan, now unexpectedly gratified in the first wish of her heart, and knowing nothing personally of those who had sinned, or of those who were sorrowing-if she could help rejoicing from beginning to end, it was as much as ought to be expected from human virtue at fourteen.\nAs nothing was really left for the decision of Mrs. Price, or the good offices of Rebecca, everything was rationally and duly accomplished, and the girls were ready for the morrow. The advantage of much sleep to prepare them for their journey was impossible. The cousin who was travelling towards them could hardly have less than visited their agitated spirits-one all happiness, the other all varying and indescribable perturbation.\nBy eight in the morning Edmund was in the house. The girls heard his entrance from above, and Fanny went down. The idea of immediately seeing him, with the knowledge of what he must be suffering, brought back all her own first feelings. He so near her, and in misery. She was ready to sink as she entered the parlour. He was alone, and met her instantly; and she found herself pressed to his heart with only these words, just articulate, \"My Fanny, my only sister; my only comfort now!\" She could say nothing; nor for some minutes could he say more.\nHe turned away to recover himself, and when he spoke again, though his voice still faltered, his manner shewed the wish of self-command, and the resolution of avoiding any farther allusion. \"Have you breakfasted? When shall you be ready? Does Susan go?\" were questions following each other rapidly. His great object was to be off as soon as possible. When Mansfield was considered, time was precious; and the state of his own mind made him find relief only in motion. It was settled that he should order the carriage to the door in half an hour. Fanny answered for their having breakfasted and being quite ready in half an hour. He had already ate, and declined staying for their meal. He would walk round the ramparts, and join them with the carriage. He was gone again; glad to get away even from Fanny.\nHe looked very ill; evidently suffering under violent emotions, which he was determined to suppress. She knew it must be so, but it was terrible to her.\nThe carriage came; and he entered the house again at the same moment, just in time to spend a few minutes with the family, and be a witness-but that he saw nothing-of the tranquil manner in which the daughters were parted with, and just in time to prevent their sitting down to the breakfast-table, which, by dint of much unusual activity, was quite and completely ready as the carriage drove from the door. Fanny's last meal in her father's house was in character with her first: she was dismissed from it as hospitably as she had been welcomed.\nHow her heart swelled with joy and gratitude as she passed the barriers of Portsmouth, and how Susan's face wore its broadest smiles, may be easily conceived. Sitting forwards, however, and screened by her bonnet, those smiles were unseen.\nThe journey was likely to be a silent one. Edmund's deep sighs often reached Fanny. Had he been alone with her, his heart must have opened in spite of every resolution; but Susan's presence drove him quite into himself, and his attempts to talk on indifferent subjects could never be long supported.\nFanny watched him with never-failing solicitude, and sometimes catching his eye, revived an affectionate smile, which comforted her; but the first day's journey passed without her hearing a word from him on the subjects that were weighing him down. The next morning produced a little more. Just before their setting out from Oxford, while Susan was stationed at a window, in eager observation of the departure of a large family from the inn, the other two were standing by the fire; and Edmund, particularly struck by the alteration in Fanny's looks, and from his ignorance of the daily evils of her father's house, attributing an undue share of the change, attributing _all_ to the recent event, took her hand, and said in a low, but very expressive tone, \"No wonder-you must feel it-you must suffer. How a man who had once loved, could desert you! But _yours_-your regard was new compared with--Fanny, think of _me_!\"\nThe first division of their journey occupied a long day, and brought them, almost knocked up, to Oxford; but the second was over at a much earlier hour. They were in the environs of Mansfield long before the usual dinner-time, and as they approached the beloved place, the hearts of both sisters sank a little. Fanny began to dread the meeting with her aunts and Tom, under so dreadful a humiliation; and Susan to feel with some anxiety, that all her best manners, all her lately acquired knowledge of what was practised here, was on the point of being called into action. Visions of good and ill breeding, of old vulgarisms and new gentilities, were before her; and she was meditating much upon silver forks, napkins, and finger-glasses. Fanny had been everywhere awake to the difference of the country since February; but when they entered the Park her perceptions and her pleasures were of the keenest sort. It was three months, full three months, since her quitting it, and the change was from winter to summer. Her eye fell everywhere on lawns and plantations of the freshest green; and the trees, though not fully clothed, were in that delightful state when farther beauty is known to be at hand, and when, while much is actually given to the sight, more yet remains for the imagination. Her enjoyment, however, was for herself alone. Edmund could not share it. She looked at him, but he was leaning back, sunk in a deeper gloom than ever, and with eyes closed, as if the view of cheerfulness oppressed him, and the lovely scenes of home must be shut out.\nIt made her melancholy again; and the knowledge of what must be enduring there, invested even the house, modern, airy, and well situated as it was, with a melancholy aspect.\nBy one of the suffering party within they were expected with such impatience as she had never known before. Fanny had scarcely passed the solemn-looking servants, when Lady Bertram came from the drawing-room to meet her; came with no indolent step; and falling on her neck, said, \"Dear Fanny! now I shall be comfortable.\"",
        "paragraph_chars": [
            [
                0,
                287
            ],
            [
                287,
                964
            ],
            [
                964,
                1669
            ],
            [
                1669,
                2473
            ],
            [
                2473,
                2716
            ],
            [
                2716,
                3088
            ],
            [
                3088,
                3436
            ],
            [
                3436,
                3765
            ],
            [
                3765,
                5180
            ],
            [
                5180,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5295
            ],
            [
                5295,
                5764
            ],
            [
                5764,
                6309
            ],
            [
                6309,
                6430
            ],
            [
                6430,
                6789
            ],
            [
                6789,
                7010
            ],
            [
                7010,
                7262
            ],
            [
                7262,
                8261
            ],
            [
                8261,
                9284
            ],
            [
                9284,
                10263
            ],
            [
                10263,
                10937
            ],
            [
                10937,
                12059
            ],
            [
                12059,
                13082
            ],
            [
                13082,
                13980
            ],
            [
                13980,
                14521
            ],
            [
                14521,
                14955
            ],
            [
                14955,
                15505
            ],
            [
                15505,
                16311
            ],
            [
                16311,
                16464
            ],
            [
                16464,
                17011
            ],
            [
                17011,
                17251
            ],
            [
                17251,
                17551
            ],
            [
                17551,
                18471
            ],
            [
                18471,
                20033
            ],
            [
                20033,
                20207
            ],
            [
                20207,
                20528
            ]
        ],
        "segment_chars": [
            [
                0,
                287
            ],
            [
                287,
                440
            ],
            [
                440,
                701
            ],
            [
                701,
                943
            ],
            [
                943,
                964
            ],
            [
                964,
                1135
            ],
            [
                1135,
                1319
            ],
            [
                1319,
                1408
            ],
            [
                1408,
                1486
            ],
            [
                1486,
                1583
            ],
            [
                1583,
                1626
            ],
            [
                1626,
                1669
            ],
            [
                1669,
                1689
            ],
            [
                1689,
                1812
            ],
            [
                1812,
                2087
            ],
            [
                2087,
                2130
            ],
            [
                2130,
                2258
            ],
            [
                2258,
                2473
            ],
            [
                2473,
                2716
            ],
            [
                2716,
                2737
            ],
            [
                2737,
                2901
            ],
            [
                2901,
                3088
            ],
            [
                3088,
                3176
            ],
            [
                3176,
                3306
            ],
            [
                3306,
                3436
            ],
            [
                3436,
                3484
            ],
            [
                3484,
                3508
            ],
            [
                3508,
                3765
            ],
            [
                3765,
                3795
            ],
            [
                3795,
                3896
            ],
            [
                3896,
                3922
            ],
            [
                3922,
                3974
            ],
            [
                3974,
                4222
            ],
            [
                4222,
                4360
            ],
            [
                4360,
                4419
            ],
            [
                4419,
                4856
            ],
            [
                4856,
                5180
            ],
            [
                5180,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5295
            ],
            [
                5295,
                5351
            ],
            [
                5351,
                5433
            ],
            [
                5433,
                5574
            ],
            [
                5574,
                5586
            ],
            [
                5586,
                5674
            ],
            [
                5674,
                5764
            ],
            [
                5764,
                6309
            ],
            [
                6309,
                6430
            ],
            [
                6430,
                6599
            ],
            [
                6599,
                6648
            ],
            [
                6648,
                6789
            ],
            [
                6789,
                6858
            ],
            [
                6858,
                7010
            ],
            [
                7010,
                7103
            ],
            [
                7103,
                7222
            ],
            [
                7222,
                7262
            ],
            [
                7262,
                7429
            ],
            [
                7429,
                7539
            ],
            [
                7539,
                7620
            ],
            [
                7620,
                7740
            ],
            [
                7740,
                8107
            ],
            [
                8107,
                8186
            ],
            [
                8186,
                8261
            ],
            [
                8261,
                8320
            ],
            [
                8320,
                8354
            ],
            [
                8354,
                8433
            ],
            [
                8433,
                8537
            ],
            [
                8537,
                8674
            ],
            [
                8674,
                8910
            ],
            [
                8910,
                9057
            ],
            [
                9057,
                9094
            ],
            [
                9094,
                9284
            ],
            [
                9284,
                9315
            ],
            [
                9315,
                9341
            ],
            [
                9341,
                9374
            ],
            [
                9374,
                9416
            ],
            [
                9416,
                9501
            ],
            [
                9501,
                9684
            ],
            [
                9684,
                9741
            ],
            [
                9741,
                9793
            ],
            [
                9793,
                9848
            ],
            [
                9848,
                10263
            ],
            [
                10263,
                10330
            ],
            [
                10330,
                10395
            ],
            [
                10395,
                10575
            ],
            [
                10575,
                10598
            ],
            [
                10598,
                10886
            ],
            [
                10886,
                10937
            ],
            [
                10937,
                10985
            ],
            [
                10985,
                11023
            ],
            [
                11023,
                11084
            ],
            [
                11084,
                11107
            ],
            [
                11107,
                11202
            ],
            [
                11202,
                11252
            ],
            [
                11252,
                11308
            ],
            [
                11308,
                11362
            ],
            [
                11362,
                11392
            ],
            [
                11392,
                11414
            ],
            [
                11414,
                11509
            ],
            [
                11509,
                11562
            ],
            [
                11562,
                11676
            ],
            [
                11676,
                11746
            ],
            [
                11746,
                11864
            ],
            [
                11864,
                11917
            ],
            [
                11917,
                11964
            ],
            [
                11964,
                12011
            ],
            [
                12011,
                12059
            ],
            [
                12059,
                12098
            ],
            [
                12098,
                12154
            ],
            [
                12154,
                12165
            ],
            [
                12165,
                12196
            ],
            [
                12196,
                12304
            ],
            [
                12304,
                12345
            ],
            [
                12345,
                12403
            ],
            [
                12403,
                12724
            ],
            [
                12724,
                12871
            ],
            [
                12871,
                13082
            ],
            [
                13082,
                13171
            ],
            [
                13171,
                13257
            ],
            [
                13257,
                13415
            ],
            [
                13415,
                13449
            ],
            [
                13449,
                13580
            ],
            [
                13580,
                13640
            ],
            [
                13640,
                13980
            ],
            [
                13980,
                14042
            ],
            [
                14042,
                14521
            ],
            [
                14521,
                14702
            ],
            [
                14702,
                14780
            ],
            [
                14780,
                14955
            ],
            [
                14955,
                15004
            ],
            [
                15004,
                15066
            ],
            [
                15066,
                15192
            ],
            [
                15192,
                15223
            ],
            [
                15223,
                15273
            ],
            [
                15273,
                15442
            ],
            [
                15442,
                15505
            ],
            [
                15505,
                15695
            ],
            [
                15695,
                15718
            ],
            [
                15718,
                15743
            ],
            [
                15743,
                15759
            ],
            [
                15759,
                15804
            ],
            [
                15804,
                15856
            ],
            [
                15856,
                15973
            ],
            [
                15973,
                16051
            ],
            [
                16051,
                16134
            ],
            [
                16134,
                16191
            ],
            [
                16191,
                16258
            ],
            [
                16258,
                16311
            ],
            [
                16311,
                16412
            ],
            [
                16412,
                16464
            ],
            [
                16464,
                16872
            ],
            [
                16872,
                17011
            ],
            [
                17011,
                17170
            ],
            [
                17170,
                17251
            ],
            [
                17251,
                17294
            ],
            [
                17294,
                17335
            ],
            [
                17335,
                17551
            ],
            [
                17551,
                17800
            ],
            [
                17800,
                17841
            ],
            [
                17841,
                18353
            ],
            [
                18353,
                18401
            ],
            [
                18401,
                18471
            ],
            [
                18471,
                18624
            ],
            [
                18624,
                18782
            ],
            [
                18782,
                19044
            ],
            [
                19044,
                19210
            ],
            [
                19210,
                19382
            ],
            [
                19382,
                19487
            ],
            [
                19487,
                19765
            ],
            [
                19765,
                19812
            ],
            [
                19812,
                19839
            ],
            [
                19839,
                20033
            ],
            [
                20033,
                20207
            ],
            [
                20207,
                20315
            ],
            [
                20315,
                20500
            ],
            [
                20500,
                20528
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                131,
                144
            ],
            [
                57,
                81
            ],
            [
                86,
                92
            ],
            [
                164,
                216
            ],
            [
                230,
                287
            ],
            [
                287,
                307
            ],
            [
                369,
                372
            ],
            [
                314,
                323
            ],
            [
                373,
                409
            ],
            [
                410,
                440
            ],
            [
                685,
                687
            ],
            [
                512,
                523
            ],
            [
                537,
                684
            ],
            [
                699,
                701
            ],
            [
                943,
                964
            ],
            [
                964,
                1098
            ],
            [
                1133,
                1135
            ],
            [
                1135,
                1177
            ],
            [
                1183,
                1213
            ],
            [
                1232,
                1278
            ],
            [
                1291,
                1319
            ],
            [
                1319,
                1408
            ],
            [
                1408,
                1486
            ],
            [
                1486,
                1583
            ],
            [
                1583,
                1626
            ],
            [
                1626,
                1669
            ],
            [
                1669,
                1689
            ],
            [
                1689,
                1812
            ],
            [
                1812,
                2068
            ],
            [
                2085,
                2086
            ],
            [
                2087,
                2130
            ],
            [
                2130,
                2221
            ],
            [
                2225,
                2258
            ],
            [
                2258,
                2285
            ],
            [
                2297,
                2313
            ],
            [
                2333,
                2337
            ],
            [
                2343,
                2356
            ],
            [
                2361,
                2431
            ],
            [
                2471,
                2473
            ],
            [
                2473,
                2716
            ],
            [
                2716,
                2737
            ],
            [
                2737,
                2901
            ],
            [
                2901,
                2974
            ],
            [
                2996,
                3088
            ],
            [
                3088,
                3176
            ],
            [
                3176,
                3251
            ],
            [
                3280,
                3288
            ],
            [
                3304,
                3305
            ],
            [
                3436,
                3484
            ],
            [
                3484,
                3508
            ],
            [
                3508,
                3548
            ],
            [
                3553,
                3618
            ],
            [
                3625,
                3652
            ],
            [
                3773,
                3780
            ],
            [
                3787,
                3795
            ],
            [
                3795,
                3896
            ],
            [
                3974,
                4082
            ],
            [
                4105,
                4201
            ],
            [
                4206,
                4222
            ],
            [
                4222,
                4281
            ],
            [
                4370,
                4395
            ],
            [
                4417,
                4419
            ],
            [
                4419,
                4524
            ],
            [
                4568,
                4606
            ],
            [
                4561,
                4563
            ],
            [
                4659,
                4856
            ],
            [
                4856,
                4886
            ],
            [
                5012,
                5064
            ],
            [
                5124,
                5180
            ],
            [
                5224,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5295
            ],
            [
                5295,
                5351
            ],
            [
                5351,
                5433
            ],
            [
                5433,
                5488
            ],
            [
                5574,
                5586
            ],
            [
                5586,
                5604
            ],
            [
                5606,
                5608
            ],
            [
                5609,
                5638
            ],
            [
                5672,
                5674
            ],
            [
                5674,
                5764
            ],
            [
                5764,
                5850
            ],
            [
                5864,
                5877
            ],
            [
                5887,
                5952
            ],
            [
                5968,
                5976
            ],
            [
                6012,
                6013
            ],
            [
                6018,
                6201
            ],
            [
                6216,
                6309
            ],
            [
                6309,
                6358
            ],
            [
                6381,
                6430
            ],
            [
                6430,
                6562
            ],
            [
                6572,
                6599
            ],
            [
                6599,
                6648
            ],
            [
                6648,
                6709
            ],
            [
                6745,
                6759
            ],
            [
                6760,
                6776
            ],
            [
                6787,
                6789
            ],
            [
                6789,
                6815
            ],
            [
                6833,
                6840
            ],
            [
                6845,
                6858
            ],
            [
                6858,
                6880
            ],
            [
                6901,
                6957
            ],
            [
                6966,
                7010
            ],
            [
                7010,
                7103
            ],
            [
                7103,
                7222
            ],
            [
                7226,
                7262
            ],
            [
                7262,
                7275
            ],
            [
                7288,
                7295
            ],
            [
                7278,
                7282
            ],
            [
                7295,
                7362
            ],
            [
                7376,
                7396
            ],
            [
                7402,
                7429
            ],
            [
                7429,
                7539
            ],
            [
                7560,
                7573
            ],
            [
                7584,
                7588
            ],
            [
                7590,
                7620
            ],
            [
                7620,
                7642
            ],
            [
                7703,
                7719
            ],
            [
                7731,
                7740
            ],
            [
                7740,
                7795
            ],
            [
                7806,
                7808
            ],
            [
                7809,
                8023
            ],
            [
                8058,
                8107
            ],
            [
                8107,
                8146
            ],
            [
                8148,
                8151
            ],
            [
                8153,
                8157
            ],
            [
                8180,
                8186
            ],
            [
                8186,
                8261
            ],
            [
                8261,
                8266
            ],
            [
                8277,
                8320
            ],
            [
                8354,
                8433
            ],
            [
                8433,
                8499
            ],
            [
                8535,
                8537
            ],
            [
                8537,
                8639
            ],
            [
                8657,
                8674
            ],
            [
                8674,
                8743
            ],
            [
                8760,
                8771
            ],
            [
                8820,
                8910
            ],
            [
                8910,
                8989
            ],
            [
                8990,
                9002
            ],
            [
                9039,
                9057
            ],
            [
                9057,
                9094
            ],
            [
                9095,
                9098
            ],
            [
                9100,
                9121
            ],
            [
                9149,
                9156
            ],
            [
                9158,
                9265
            ],
            [
                9273,
                9284
            ],
            [
                9284,
                9315
            ],
            [
                9315,
                9341
            ],
            [
                9374,
                9416
            ],
            [
                9416,
                9501
            ],
            [
                9501,
                9504
            ],
            [
                9526,
                9550
            ],
            [
                9552,
                9558
            ],
            [
                9567,
                9615
            ],
            [
                9682,
                9684
            ],
            [
                9684,
                9741
            ],
            [
                9741,
                9793
            ],
            [
                9793,
                9848
            ],
            [
                9848,
                9860
            ],
            [
                9885,
                10093
            ],
            [
                10124,
                10126
            ],
            [
                10166,
                10187
            ],
            [
                10111,
                10113
            ],
            [
                10217,
                10263
            ],
            [
                10263,
                10330
            ],
            [
                10330,
                10363
            ],
            [
                10374,
                10375
            ],
            [
                10405,
                10421
            ],
            [
                10448,
                10466
            ],
            [
                10422,
                10447
            ],
            [
                10466,
                10480
            ],
            [
                10494,
                10575
            ],
            [
                10575,
                10598
            ],
            [
                10598,
                10694
            ],
            [
                10703,
                10738
            ],
            [
                10752,
                10859
            ],
            [
                10866,
                10886
            ],
            [
                10886,
                10937
            ],
            [
                10937,
                10985
            ],
            [
                10985,
                11023
            ],
            [
                11023,
                11035
            ],
            [
                11041,
                11084
            ],
            [
                11084,
                11107
            ],
            [
                11107,
                11202
            ],
            [
                11202,
                11252
            ],
            [
                11252,
                11308
            ],
            [
                11308,
                11362
            ],
            [
                11362,
                11392
            ],
            [
                11392,
                11414
            ],
            [
                11414,
                11509
            ],
            [
                11509,
                11562
            ],
            [
                11562,
                11676
            ],
            [
                11676,
                11746
            ],
            [
                11746,
                11768
            ],
            [
                11789,
                11812
            ],
            [
                11833,
                11864
            ],
            [
                11864,
                11917
            ],
            [
                11917,
                11964
            ],
            [
                11964,
                12011
            ],
            [
                12011,
                12059
            ],
            [
                12163,
                12165
            ],
            [
                12165,
                12184
            ],
            [
                12194,
                12196
            ],
            [
                12205,
                12221
            ],
            [
                12223,
                12304
            ],
            [
                12304,
                12345
            ],
            [
                12345,
                12384
            ],
            [
                12396,
                12403
            ],
            [
                12403,
                12443
            ],
            [
                12467,
                12475
            ],
            [
                12482,
                12643
            ],
            [
                12653,
                12687
            ],
            [
                12703,
                12724
            ],
            [
                12724,
                12758
            ],
            [
                12773,
                12829
            ],
            [
                12852,
                12871
            ],
            [
                12871,
                12874
            ],
            [
                12935,
                12943
            ],
            [
                12957,
                12966
            ],
            [
                12915,
                12917
            ],
            [
                12986,
                13014
            ],
            [
                13034,
                13069
            ],
            [
                13080,
                13082
            ],
            [
                13082,
                13114
            ],
            [
                13149,
                13171
            ],
            [
                13171,
                13257
            ],
            [
                13257,
                13278
            ],
            [
                13280,
                13284
            ],
            [
                13415,
                13449
            ],
            [
                13501,
                13580
            ],
            [
                13580,
                13640
            ],
            [
                13640,
                13676
            ],
            [
                13765,
                13834
            ],
            [
                13904,
                13939
            ],
            [
                13944,
                13980
            ],
            [
                13980,
                14042
            ],
            [
                14042,
                14146
            ],
            [
                14205,
                14371
            ],
            [
                14381,
                14521
            ],
            [
                14612,
                14626
            ],
            [
                14642,
                14702
            ],
            [
                14882,
                14885
            ],
            [
                14764,
                14767
            ],
            [
                14886,
                14914
            ],
            [
                14927,
                14955
            ],
            [
                14955,
                15002
            ],
            [
                15043,
                15064
            ],
            [
                15064,
                15066
            ],
            [
                15066,
                15077
            ],
            [
                15090,
                15192
            ],
            [
                15192,
                15223
            ],
            [
                15223,
                15273
            ],
            [
                15273,
                15285
            ],
            [
                15308,
                15357
            ],
            [
                15363,
                15442
            ],
            [
                15442,
                15505
            ],
            [
                15505,
                15608
            ],
            [
                15616,
                15640
            ],
            [
                15693,
                15695
            ],
            [
                15695,
                15718
            ],
            [
                15718,
                15743
            ],
            [
                15743,
                15759
            ],
            [
                15759,
                15804
            ],
            [
                15804,
                15856
            ],
            [
                15887,
                15926
            ],
            [
                15931,
                15973
            ],
            [
                15973,
                16051
            ],
            [
                16051,
                16116
            ],
            [
                16132,
                16134
            ],
            [
                16134,
                16136
            ],
            [
                16158,
                16191
            ],
            [
                16191,
                16258
            ],
            [
                16258,
                16311
            ],
            [
                16311,
                16412
            ],
            [
                16412,
                16464
            ],
            [
                16464,
                16513
            ],
            [
                16532,
                16604
            ],
            [
                16608,
                16768
            ],
            [
                16770,
                16780
            ],
            [
                16786,
                16802
            ],
            [
                16804,
                16807
            ],
            [
                16818,
                16872
            ],
            [
                16872,
                17011
            ],
            [
                17011,
                17062
            ],
            [
                17086,
                17170
            ],
            [
                17170,
                17251
            ],
            [
                17251,
                17266
            ],
            [
                17280,
                17294
            ],
            [
                17294,
                17335
            ],
            [
                17335,
                17389
            ],
            [
                17418,
                17551
            ],
            [
                17551,
                17799
            ],
            [
                17800,
                17841
            ],
            [
                17841,
                17899
            ],
            [
                17979,
                17983
            ],
            [
                17913,
                17921
            ],
            [
                17991,
                18045
            ],
            [
                18059,
                18105
            ],
            [
                18125,
                18166
            ],
            [
                18197,
                18207
            ],
            [
                17923,
                17925
            ],
            [
                18227,
                18246
            ],
            [
                18248,
                18280
            ],
            [
                18291,
                18327
            ],
            [
                18345,
                18353
            ],
            [
                18353,
                18401
            ],
            [
                18401,
                18404
            ],
            [
                18413,
                18463
            ],
            [
                18465,
                18467
            ],
            [
                18468,
                18471
            ],
            [
                18580,
                18590
            ],
            [
                18490,
                18506
            ],
            [
                18591,
                18594
            ],
            [
                18595,
                18599
            ],
            [
                18622,
                18624
            ],
            [
                18624,
                18633
            ],
            [
                18653,
                18720
            ],
            [
                18738,
                18782
            ],
            [
                18782,
                18837
            ],
            [
                18870,
                18934
            ],
            [
                19002,
                19044
            ],
            [
                19044,
                19076
            ],
            [
                19117,
                19209
            ],
            [
                19382,
                19388
            ],
            [
                19403,
                19420
            ],
            [
                19422,
                19427
            ],
            [
                19432,
                19440
            ],
            [
                19443,
                19448
            ],
            [
                19469,
                19475
            ],
            [
                19476,
                19487
            ],
            [
                19487,
                19572
            ],
            [
                19600,
                19672
            ],
            [
                19763,
                19765
            ],
            [
                19765,
                19812
            ],
            [
                19812,
                19839
            ],
            [
                19839,
                19948
            ],
            [
                19993,
                20033
            ],
            [
                20033,
                20088
            ],
            [
                20089,
                20136
            ],
            [
                20181,
                20207
            ],
            [
                20207,
                20243
            ],
            [
                20244,
                20315
            ],
            [
                20315,
                20432
            ],
            [
                20454,
                20500
            ],
            [
                20500,
                20528
            ]
        ],
        "row_chars": [
            [
                0,
                287
            ],
            [
                287,
                440
            ],
            [
                440,
                701
            ],
            [
                701,
                943
            ],
            [
                943,
                964
            ],
            [
                964,
                1135
            ],
            [
                1135,
                1319
            ],
            [
                1319,
                1408
            ],
            [
                1408,
                1486
            ],
            [
                1486,
                1583
            ],
            [
                1583,
                1626
            ],
            [
                1626,
                1669
            ],
            [
                1669,
                1689
            ],
            [
                1689,
                1812
            ],
            [
                1812,
                2087
            ],
            [
                2087,
                2130
            ],
            [
                2130,
                2258
            ],
            [
                2258,
                2473
            ],
            [
                2473,
                2716
            ],
            [
                2716,
                2737
            ],
            [
                2737,
                2901
            ],
            [
                2901,
                3088
            ],
            [
                3088,
                3176
            ],
            [
                3176,
                3306
            ],
            [
                3306,
                3436
            ],
            [
                3436,
                3484
            ],
            [
                3484,
                3508
            ],
            [
                3508,
                3795
            ],
            [
                3795,
                3896
            ],
            [
                3896,
                3922
            ],
            [
                3922,
                3974
            ],
            [
                3974,
                4222
            ],
            [
                4222,
                4419
            ],
            [
                4419,
                4856
            ],
            [
                4856,
                5180
            ],
            [
                5180,
                5242
            ],
            [
                5242,
                5283
            ],
            [
                5283,
                5295
            ],
            [
                5295,
                5351
            ],
            [
                5351,
                5433
            ],
            [
                5433,
                5586
            ],
            [
                5586,
                5674
            ],
            [
                5674,
                5764
            ],
            [
                5764,
                6309
            ],
            [
                6309,
                6430
            ],
            [
                6430,
                6599
            ],
            [
                6599,
                6648
            ],
            [
                6648,
                6789
            ],
            [
                6789,
                6858
            ],
            [
                6858,
                7010
            ],
            [
                7010,
                7103
            ],
            [
                7103,
                7222
            ],
            [
                7222,
                7262
            ],
            [
                7262,
                7429
            ],
            [
                7429,
                7539
            ],
            [
                7539,
                7620
            ],
            [
                7620,
                7740
            ],
            [
                7740,
                8107
            ],
            [
                8107,
                8186
            ],
            [
                8186,
                8261
            ],
            [
                8261,
                8320
            ],
            [
                8320,
                8354
            ],
            [
                8354,
                8433
            ],
            [
                8433,
                8537
            ],
            [
                8537,
                8674
            ],
            [
                8674,
                8910
            ],
            [
                8910,
                9057
            ],
            [
                9057,
                9094
            ],
            [
                9094,
                9284
            ],
            [
                9284,
                9315
            ],
            [
                9315,
                9341
            ],
            [
                9341,
                9374
            ],
            [
                9374,
                9416
            ],
            [
                9416,
                9501
            ],
            [
                9501,
                9684
            ],
            [
                9684,
                9741
            ],
            [
                9741,
                9793
            ],
            [
                9793,
                9848
            ],
            [
                9848,
                10263
            ],
            [
                10263,
                10330
            ],
            [
                10330,
                10575
            ],
            [
                10575,
                10598
            ],
            [
                10598,
                10886
            ],
            [
                10886,
                10937
            ],
            [
                10937,
                10985
            ],
            [
                10985,
                11023
            ],
            [
                11023,
                11084
            ],
            [
                11084,
                11107
            ],
            [
                11107,
                11202
            ],
            [
                11202,
                11252
            ],
            [
                11252,
                11308
            ],
            [
                11308,
                11362
            ],
            [
                11362,
                11392
            ],
            [
                11392,
                11414
            ],
            [
                11414,
                11509
            ],
            [
                11509,
                11562
            ],
            [
                11562,
                11676
            ],
            [
                11676,
                11746
            ],
            [
                11746,
                11864
            ],
            [
                11864,
                11917
            ],
            [
                11917,
                11964
            ],
            [
                11964,
                12011
            ],
            [
                12011,
                12154
            ],
            [
                12154,
                12165
            ],
            [
                12165,
                12196
            ],
            [
                12196,
                12304
            ],
            [
                12304,
                12345
            ],
            [
                12345,
                12403
            ],
            [
                12403,
                12724
            ],
            [
                12724,
                12871
            ],
            [
                12871,
                13082
            ],
            [
                13082,
                13171
            ],
            [
                13171,
                13257
            ],
            [
                13257,
                13449
            ],
            [
                13449,
                13580
            ],
            [
                13580,
                13640
            ],
            [
                13640,
                13980
            ],
            [
                13980,
                14042
            ],
            [
                14042,
                14521
            ],
            [
                14521,
                14702
            ],
            [
                14702,
                14955
            ],
            [
                14955,
                15066
            ],
            [
                15066,
                15192
            ],
            [
                15192,
                15223
            ],
            [
                15223,
                15273
            ],
            [
                15273,
                15442
            ],
            [
                15442,
                15505
            ],
            [
                15505,
                15695
            ],
            [
                15695,
                15718
            ],
            [
                15718,
                15743
            ],
            [
                15743,
                15759
            ],
            [
                15759,
                15804
            ],
            [
                15804,
                15856
            ],
            [
                15856,
                15973
            ],
            [
                15973,
                16051
            ],
            [
                16051,
                16134
            ],
            [
                16134,
                16191
            ],
            [
                16191,
                16258
            ],
            [
                16258,
                16311
            ],
            [
                16311,
                16412
            ],
            [
                16412,
                16464
            ],
            [
                16464,
                16872
            ],
            [
                16872,
                17011
            ],
            [
                17011,
                17170
            ],
            [
                17170,
                17251
            ],
            [
                17251,
                17294
            ],
            [
                17294,
                17335
            ],
            [
                17335,
                17551
            ],
            [
                17551,
                17800
            ],
            [
                17800,
                17841
            ],
            [
                17841,
                18353
            ],
            [
                18353,
                18401
            ],
            [
                18401,
                18471
            ],
            [
                18471,
                18624
            ],
            [
                18624,
                18782
            ],
            [
                18782,
                19044
            ],
            [
                19044,
                19210
            ],
            [
                19210,
                19382
            ],
            [
                19382,
                19487
            ],
            [
                19487,
                19765
            ],
            [
                19765,
                19812
            ],
            [
                19812,
                19839
            ],
            [
                19839,
                20033
            ],
            [
                20033,
                20207
            ],
            [
                20207,
                20315
            ],
            [
                20315,
                20500
            ],
            [
                20500,
                20528
            ]
        ]
    },
    "abridged": {
        "text": "As Fanny could not doubt that her answer would give Miss Crawford real disappointment, she rather expected to be urged again; and though no second letter arrived for a week, she had still the same feeling when it did come.\nOn receiving it, she was instantly persuaded of its having the air of a brief letter of haste and business. In all probability it would be merely to give her notice that they should be in Portsmouth that very day, and to throw her into all the agitation of doubting what she ought to do. This was the letter-\n\"A most scandalous, ill-natured rumour has just reached me, and I write, dear Fanny, to warn you against giving the least credit to it. Depend upon it, there is some mistake, and a day or two will clear it up; Henry is blameless, and in spite of a moment's rashness, thinks of nobody but you. Say not a word of it; hear nothing, surmise nothing, whisper nothing till I write again. I am sure it will be all hushed up, and nothing proved but Rushworth's folly. If they are gone, I would lay my life they are only gone to Mansfield Park, and Julia with them. But why would not you let us come for you? I wish you may not repent it.-Yours, etc.\"\nFanny stood aghast. As no scandalous, ill-natured rumour had reached her, it was impossible for her to understand much of this strange letter. She could only perceive that it must relate to Wimpole Street and Mr. Crawford, and only conjecture that something very imprudent had just occurred in that quarter to draw the notice of the world, and to excite her jealousy, in Miss Crawford's apprehension.\nMiss Crawford need not be alarmed for her. She was only sorry for the parties concerned and for Mansfield, if the report should spread that far; but she hoped it might not. If the Rushworths were gone to Mansfield, as she gathered from Miss Crawford's words, it was not likely that anything unpleasant should have preceded them.\nAs to Mr. Crawford, she hoped it might give him a knowledge of his own disposition, convince him that he was not capable of being steadily attached to any one woman in the world, and shame him from persisting any longer in addressing herself.\nIt was very strange! She had begun to think he really loved her, and to fancy his affection for her something more than common; and his sister still said that he cared for nobody else. Yet there must have been some marked display of attentions to her cousin, some strong indiscretion, since her correspondent was not of a sort to regard a slight one.\nVery uncomfortable she was, and must continue, till she heard from Miss Crawford again. It was impossible to banish the letter from her thoughts, and she could not speak of it to anyone.\nThe next day came and brought no second letter. Fanny was disappointed. She could still think of little else all morning; but, when her father came back in the afternoon with the newspaper as usual, she was deep in musing. The remembrance of her first evening in that room, of her father and his newspaper, came across her. She felt that she had, indeed, been three months there; and the sun's rays falling strongly into the parlour made her still more melancholy, for sunshine appeared to her a totally different thing in a town from in the country. Here, its power was only a glare: a stifling, sickly glare, bringing neither health nor gaiety. She sat in a blaze of oppressive heat, in a cloud of moving dust, and her eyes could only wander from the table cut and notched by her brothers, to the cups and saucers wiped in streaks, the milk a mixture of motes floating in thin blue, and the bread and butter growing every minute more greasy than even Rebecca's hands had first produced it. Her father read his newspaper, and Fanny was first roused by his calling out to her: \"What's the name of your great cousins in town, Fan?\"\n\"Rushworth, sir.\"\n\"And don't they live in Wimpole Street?\"\n\"Yes, sir.\"\n\"Then, there's the devil to pay among them, that's all! There\" (holding out the paper to her); \"much good may such fine relations do you. I don't know what Sir Thomas may think of such matters; but, by G-! if she belonged to me, I'd give her the rope's end. A little flogging for man and woman too would be the best way of preventing such things.\"\nFanny read to herself that \"it was with infinite concern the newspaper had to announce a matrimonial fracas in the family of Mr. R. of Wimpole Street; the beautiful Mrs. R., not long married, who had promised to become so brilliant a leader in the fashionable world, having quitted her husband's roof in company with the well-known and captivating Mr. C., the intimate friend of Mr. R., and it was not known even to the editor of the newspaper whither they were gone.\"\n\"It is a mistake, sir,\" said Fanny instantly; \"it cannot be true; it must mean some other people.\"\nShe spoke from the instinctive wish of delaying shame; she spoke with a resolution which sprung from despair, for she spoke what she could not believe herself. It had been the shock of conviction as she read. The truth rushed on her; and how she could have spoken at all was afterwards a matter of wonder.\nMr. Price cared too little to make much answer. \"It might be all a lie, but so many fine ladies were going to the devil nowadays, that there was no answering for anybody.\"\n\"Indeed, I hope it is not true,\" said Mrs. Price plaintively; \"it would be so very shocking! If I have spoken once to Rebecca about that carpet, I am sure I have spoke at least a dozen times; have not I, Betsey? It would not be ten minutes' work.\"\nThe horror of Fanny's mind, as it received the conviction of such guilt, and began to take in the misery that must follow, can hardly be described. At first, it was a sort of stupefaction; but every moment was quickening her perception of the horrible evil. She dared not hope of the paragraph being false. Miss Crawford's letter was in frightful agreement with it. Her eager defence of her brother, her hope of its being hushed up, her evident agitation, were all of a piece with something very bad; and if there was a woman of character in existence, who could treat as a trifle this sin of the first magnitude, who would try to gloss it over, she could believe Miss Crawford to be the woman! Now she could see her own mistake as to who were gone. It was not Mr. and Mrs. Rushworth; it was Mrs. Rushworth and Mr. Crawford.\nFanny felt herself never to have been shocked before. The evening passed without a pause of misery, the night was totally sleepless. She passed only from feelings of sickness to shudderings of horror. The event was so shocking, that there were moments even when her heart revolted from it as impossible: it could not be. A woman married only six months ago; a man professing himself devoted to another; both families connected as they were by tie upon tie; all friends, all intimate together! It was too horrible a confusion of guilt, too gross a complication of evil, for civilized human nature to be capable of! yet her judgment told her it was so. His unsettled affections, Maria's decided attachment, and no sufficient principle on either side, gave it possibility: Miss Crawford's letter stamped it a fact.\nWhat would be the consequence? Whom would it not injure? Whose peace would it not cut up for ever? Miss Crawford, herself, Edmund; but it was dangerous, perhaps, to tread such ground. She tried to confine herself to the indubitable family misery which must envelop all. The mother's sufferings, the father's; there she paused. Julia's, Tom's, Edmund's; there a yet longer pause. They were the two on whom it would fall most horribly. Sir Thomas's high sense of honour and decorum, Edmund's upright principles, unsuspicious temper, and genuine strength of feeling, made her think it scarcely possible for them to support life and reason under such disgrace. She felt as if the greatest blessing for everyone related to Mrs. Rushworth would be instant annihilation.\nNothing happened the next day, or the next, to weaken her terrors. Two posts came in, and brought no denial, no second letter from Miss Crawford to explain away the first; there was no news from Mansfield, though it was now full time for her to hear again from her aunt. This was an evil omen. She had, indeed, scarcely the shadow of a hope to soothe her mind, and was reduced to so low and trembling a condition, as no mother except Mrs. Price could have overlooked, when the third day did bring the sickening knock, and a letter was put into her hands. It bore the London postmark, and came from Edmund.\n\"Dear Fanny,-You know our present wretchedness. May God support you under your share! We have been in London two days, but there is nothing to be done. They cannot be traced. You may not have heard of the last blow-Julia's elopement; she is gone to Scotland with Yates. She left London a few hours before we entered it. At any other time this would have been felt dreadfully. Now it seems nothing; yet it is an heavy aggravation. My father is not overpowered. More cannot be hoped. He is still able to think and act; and I write, by his desire, to propose your returning home. He is anxious to get you there for my mother's sake. I shall be at Portsmouth the morning after you receive this, and hope to find you ready to set off for Mansfield. My father wishes you to invite Susan to go with you for a few months. Settle it as you like; I am sure you will feel his kindness at such a moment! Do justice to his meaning, however I may confuse it. You may imagine something of my present state. There is no end of the evil let loose upon us. You will see me early by the mail.-Yours, etc.\"\nTomorrow! to leave Portsmouth tomorrow! She felt she was in the greatest danger of being exquisitely happy, while so many were miserable. The evil which brought such good to her! She dreaded lest she should learn to be careless of it. To be going so soon, sent for so kindly, and with permission to take Susan, was altogether such a combination of blessings as set her heart in a glow, and for a time seemed to distance every pain, and make her incapable of sharing the distress even of those she thought of most. Julia's elopement could affect her but little; she was amazed and shocked; but it could not dwell on her mind. She acknowledged it to be grievous, but it almost escaped her, in the midst of all the joyful cares attending this summons.\nThere is nothing like employment for relieving sorrow. Employment, even melancholy, may dispel melancholy, and her occupations were hopeful. She had so much to do that she had not time to be miserable. Her father and mother must be spoken to, Susan prepared, everything got ready. Business followed business; the day was hardly long enough. The happiness she was imparting, too,-the joyful consent of her father and mother to Susan's going with her, and the ecstasy of Susan herself, were all serving to support her spirits.\nThe affliction of the Bertrams was little felt in the family. Mrs. Price talked of her poor sister for a few minutes, but how to find anything to hold Susan's clothes was much more in her thoughts: and as for Susan, now unexpectedly gratified in the first wish of her heart, and knowing nothing personally of those who had sinned, or who were sorrowing-if she could help rejoicing from beginning to end, it was as much as ought to be expected from human virtue at fourteen.\nEverything was duly accomplished, and the girls were ready for the morrow. They slept little: one was all happiness, the other all indescribable perturbation.\nBy eight in the morning Edmund was in the house, and Fanny went down to him. The idea of seeing him, with the knowledge of what he must be suffering, brought back all her own first feelings. He so near her, and in misery. She was ready to sink as she entered the parlour. He was alone; and she found herself pressed to his heart with these words, just articulate, \"My Fanny, my only sister; my only comfort now!\" She could say nothing; nor for some minutes could he say more.\nHe turned away to recover himself, and when he spoke again, though his voice still faltered, his manner showed the wish of self-command. \"Have you breakfasted? When shall you be ready? Does Susan go?\" were questions following each other rapidly. His great object was to be off as soon as possible. Time was precious; and the state of his mind made him find relief only in motion. It was settled that he should order the carriage to the door in half an hour. Fanny answered for their having breakfasted and being quite ready. He declined staying for their meal. He would walk round the ramparts, and join them with the carriage. He was gone again; glad to get away even from Fanny.\nHe looked very ill; evidently suffering under violent emotions, which he was determined to suppress. She knew it must be so, but it was terrible to her.\nThe carriage came; and he entered the house again, just in time to spend a few minutes with the family, and be a witness-except that he saw nothing-of the tranquil manner in which the daughters were parted with, and just in time to prevent their sitting down to the breakfast-table, which by dint of unusual activity was completely ready as the carriage drove from the door. Fanny's last meal in her father's house was in character with her first: she was dismissed from it as hospitably as she had been welcomed.\nHow her heart swelled with joy and gratitude as she left Portsmouth, and how Susan's face wore its broadest smiles, may be easily conceived. Sitting forwards, however, and screened by her bonnet, those smiles were unseen.\nThe journey was a silent one. Edmund's deep sighs often reached Fanny. Had he been alone with her, his heart must have opened; but Susan's presence drove him quite into himself, and his attempts to talk on indifferent subjects could never be long supported.\nFanny watched him with never-failing solicitude, and sometimes catching his eye, revived an affectionate smile, which comforted her; but the first day's journey passed without her hearing a word from him on the subjects that were weighing him down.\nThe next morning produced a little more. Just before their setting out from Oxford, while Susan was eagerly looking from a window, the other two were standing by the fire; and Edmund, struck by the alteration in Fanny's looks, and ignorant of the daily evils of her father's house, attributed the change in her to the recent event. He took her hand, and said in a low expressive tone, \"No wonder-you must suffer. How a man who had once loved, could desert you! But your regard was new compared with--Fanny, think of me!\"\nThe second part of their journey was soon over. They were close to Mansfield long before the usual dinner-time, and as they approached, the hearts of both sisters sank a little. Fanny began to dread the meeting with her aunts and Tom; and Susan to feel with some anxiety, that all her best manners were on the point of being called into action. Visions of good and ill breeding were before her; and she was meditating much upon silver forks, napkins, and finger-glasses.\nIt was full three months since Fanny's quitting Mansfield, and winter had changed to summer. Her eye fell everywhere on lawns and plantations of the freshest green; and the trees were in that delightful state when farther beauty is known to be at hand. Her enjoyment, however, was for herself alone. Edmund could not share it. She looked at him, but he was leaning back, sunk in a deeper gloom than ever, and with eyes closed, as if the lovely scenes of home must be shut out.\nIt made her melancholy again; and the knowledge of what the family must be enduring there, invested even the house with a melancholy aspect.\nBy one of the suffering party within, they were expected with such impatience as she had never known before. Fanny had scarcely passed the solemn-looking servants, when Lady Bertram came from the drawing-room to meet her; came almost hastily; and falling on her neck, said, \"Dear Fanny! now I shall be comfortable.\"",
        "paragraph_chars": [
            [
                0,
                223
            ],
            [
                223,
                532
            ],
            [
                532,
                1175
            ],
            [
                1175,
                1576
            ],
            [
                1576,
                1905
            ],
            [
                1905,
                2148
            ],
            [
                2148,
                2499
            ],
            [
                2499,
                2686
            ],
            [
                2686,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3876
            ],
            [
                3876,
                3888
            ],
            [
                3888,
                4236
            ],
            [
                4236,
                4705
            ],
            [
                4705,
                4804
            ],
            [
                4804,
                5110
            ],
            [
                5110,
                5282
            ],
            [
                5282,
                5530
            ],
            [
                5530,
                6355
            ],
            [
                6355,
                7167
            ],
            [
                7167,
                7931
            ],
            [
                7931,
                8537
            ],
            [
                8537,
                9624
            ],
            [
                9624,
                10373
            ],
            [
                10373,
                10898
            ],
            [
                10898,
                11372
            ],
            [
                11372,
                11531
            ],
            [
                11531,
                12007
            ],
            [
                12007,
                12688
            ],
            [
                12688,
                12841
            ],
            [
                12841,
                13355
            ],
            [
                13355,
                13577
            ],
            [
                13577,
                13835
            ],
            [
                13835,
                14084
            ],
            [
                14084,
                14605
            ],
            [
                14605,
                15076
            ],
            [
                15076,
                15553
            ],
            [
                15553,
                15694
            ],
            [
                15694,
                16009
            ]
        ],
        "segment_chars": [
            [
                0,
                223
            ],
            [
                223,
                331
            ],
            [
                331,
                511
            ],
            [
                511,
                532
            ],
            [
                532,
                668
            ],
            [
                668,
                825
            ],
            [
                825,
                914
            ],
            [
                914,
                992
            ],
            [
                992,
                1089
            ],
            [
                1089,
                1132
            ],
            [
                1132,
                1175
            ],
            [
                1175,
                1195
            ],
            [
                1195,
                1318
            ],
            [
                1318,
                1576
            ],
            [
                1576,
                1619
            ],
            [
                1619,
                1749
            ],
            [
                1749,
                1905
            ],
            [
                1905,
                2148
            ],
            [
                2148,
                2169
            ],
            [
                2169,
                2333
            ],
            [
                2333,
                2499
            ],
            [
                2499,
                2587
            ],
            [
                2587,
                2686
            ],
            [
                2686,
                2734
            ],
            [
                2734,
                2758
            ],
            [
                2758,
                2909
            ],
            [
                2909,
                3010
            ],
            [
                3010,
                3237
            ],
            [
                3237,
                3333
            ],
            [
                3333,
                3678
            ],
            [
                3678,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3876
            ],
            [
                3876,
                3888
            ],
            [
                3888,
                3944
            ],
            [
                3944,
                4026
            ],
            [
                4026,
                4094
            ],
            [
                4094,
                4146
            ],
            [
                4146,
                4236
            ],
            [
                4236,
                4705
            ],
            [
                4705,
                4804
            ],
            [
                4804,
                4964
            ],
            [
                4964,
                5013
            ],
            [
                5013,
                5110
            ],
            [
                5110,
                5158
            ],
            [
                5158,
                5282
            ],
            [
                5282,
                5375
            ],
            [
                5375,
                5494
            ],
            [
                5494,
                5530
            ],
            [
                5530,
                5678
            ],
            [
                5678,
                5788
            ],
            [
                5788,
                5837
            ],
            [
                5837,
                5896
            ],
            [
                5896,
                6225
            ],
            [
                6225,
                6280
            ],
            [
                6280,
                6355
            ],
            [
                6355,
                6409
            ],
            [
                6409,
                6488
            ],
            [
                6488,
                6556
            ],
            [
                6556,
                6676
            ],
            [
                6676,
                6848
            ],
            [
                6848,
                6969
            ],
            [
                6969,
                7006
            ],
            [
                7006,
                7167
            ],
            [
                7167,
                7198
            ],
            [
                7198,
                7224
            ],
            [
                7224,
                7266
            ],
            [
                7266,
                7351
            ],
            [
                7351,
                7437
            ],
            [
                7437,
                7494
            ],
            [
                7494,
                7546
            ],
            [
                7546,
                7601
            ],
            [
                7601,
                7824
            ],
            [
                7824,
                7931
            ],
            [
                7931,
                7998
            ],
            [
                7998,
                8202
            ],
            [
                8202,
                8225
            ],
            [
                8225,
                8486
            ],
            [
                8486,
                8537
            ],
            [
                8537,
                8585
            ],
            [
                8585,
                8623
            ],
            [
                8623,
                8689
            ],
            [
                8689,
                8712
            ],
            [
                8712,
                8807
            ],
            [
                8807,
                8857
            ],
            [
                8857,
                8913
            ],
            [
                8913,
                8967
            ],
            [
                8967,
                8997
            ],
            [
                8997,
                9019
            ],
            [
                9019,
                9114
            ],
            [
                9114,
                9167
            ],
            [
                9167,
                9281
            ],
            [
                9281,
                9351
            ],
            [
                9351,
                9429
            ],
            [
                9429,
                9482
            ],
            [
                9482,
                9529
            ],
            [
                9529,
                9576
            ],
            [
                9576,
                9624
            ],
            [
                9624,
                9634
            ],
            [
                9634,
                9664
            ],
            [
                9664,
                9762
            ],
            [
                9762,
                9803
            ],
            [
                9803,
                9859
            ],
            [
                9859,
                10138
            ],
            [
                10138,
                10249
            ],
            [
                10249,
                10373
            ],
            [
                10373,
                10428
            ],
            [
                10428,
                10514
            ],
            [
                10514,
                10575
            ],
            [
                10575,
                10654
            ],
            [
                10654,
                10714
            ],
            [
                10714,
                10898
            ],
            [
                10898,
                10960
            ],
            [
                10960,
                11372
            ],
            [
                11372,
                11447
            ],
            [
                11447,
                11531
            ],
            [
                11531,
                11608
            ],
            [
                11608,
                11722
            ],
            [
                11722,
                11753
            ],
            [
                11753,
                11803
            ],
            [
                11803,
                11944
            ],
            [
                11944,
                12007
            ],
            [
                12007,
                12144
            ],
            [
                12144,
                12167
            ],
            [
                12167,
                12192
            ],
            [
                12192,
                12208
            ],
            [
                12208,
                12253
            ],
            [
                12253,
                12305
            ],
            [
                12305,
                12387
            ],
            [
                12387,
                12465
            ],
            [
                12465,
                12532
            ],
            [
                12532,
                12568
            ],
            [
                12568,
                12635
            ],
            [
                12635,
                12688
            ],
            [
                12688,
                12789
            ],
            [
                12789,
                12841
            ],
            [
                12841,
                13216
            ],
            [
                13216,
                13355
            ],
            [
                13355,
                13496
            ],
            [
                13496,
                13577
            ],
            [
                13577,
                13607
            ],
            [
                13607,
                13648
            ],
            [
                13648,
                13835
            ],
            [
                13835,
                14084
            ],
            [
                14084,
                14125
            ],
            [
                14125,
                14416
            ],
            [
                14416,
                14497
            ],
            [
                14497,
                14545
            ],
            [
                14545,
                14605
            ],
            [
                14605,
                14653
            ],
            [
                14653,
                14783
            ],
            [
                14783,
                14950
            ],
            [
                14950,
                15076
            ],
            [
                15076,
                15169
            ],
            [
                15169,
                15329
            ],
            [
                15329,
                15376
            ],
            [
                15376,
                15403
            ],
            [
                15403,
                15553
            ],
            [
                15553,
                15694
            ],
            [
                15694,
                15803
            ],
            [
                15803,
                15981
            ],
            [
                15981,
                16009
            ]
        ],
        "overlap_chars": [
            [
                0,
                40
            ],
            [
                52,
                65
            ],
            [
                66,
                90
            ],
            [
                91,
                97
            ],
            [
                113,
                165
            ],
            [
                166,
                223
            ],
            [
                223,
                243
            ],
            [
                244,
                247
            ],
            [
                248,
                257
            ],
            [
                258,
                294
            ],
            [
                301,
                331
            ],
            [
                331,
                333
            ],
            [
                338,
                349
            ],
            [
                362,
                509
            ],
            [
                509,
                511
            ],
            [
                511,
                532
            ],
            [
                532,
                666
            ],
            [
                666,
                668
            ],
            [
                668,
                710
            ],
            [
                711,
                741
            ],
            [
                742,
                788
            ],
            [
                797,
                825
            ],
            [
                825,
                914
            ],
            [
                914,
                992
            ],
            [
                992,
                1089
            ],
            [
                1089,
                1132
            ],
            [
                1132,
                1175
            ],
            [
                1175,
                1195
            ],
            [
                1195,
                1318
            ],
            [
                1318,
                1574
            ],
            [
                1574,
                1575
            ],
            [
                1576,
                1619
            ],
            [
                1619,
                1710
            ],
            [
                1716,
                1749
            ],
            [
                1749,
                1776
            ],
            [
                1777,
                1793
            ],
            [
                1807,
                1811
            ],
            [
                1812,
                1825
            ],
            [
                1833,
                1903
            ],
            [
                1903,
                1905
            ],
            [
                1905,
                2148
            ],
            [
                2148,
                2169
            ],
            [
                2169,
                2333
            ],
            [
                2333,
                2406
            ],
            [
                2407,
                2499
            ],
            [
                2499,
                2587
            ],
            [
                2587,
                2662
            ],
            [
                2669,
                2677
            ],
            [
                2684,
                2685
            ],
            [
                2686,
                2734
            ],
            [
                2734,
                2758
            ],
            [
                2758,
                2798
            ],
            [
                2799,
                2864
            ],
            [
                2865,
                2892
            ],
            [
                2893,
                2900
            ],
            [
                2901,
                2909
            ],
            [
                2909,
                3010
            ],
            [
                3010,
                3118
            ],
            [
                3119,
                3215
            ],
            [
                3221,
                3237
            ],
            [
                3237,
                3296
            ],
            [
                3306,
                3331
            ],
            [
                3331,
                3333
            ],
            [
                3333,
                3438
            ],
            [
                3439,
                3477
            ],
            [
                3478,
                3480
            ],
            [
                3481,
                3678
            ],
            [
                3678,
                3708
            ],
            [
                3709,
                3761
            ],
            [
                3761,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3876
            ],
            [
                3876,
                3888
            ],
            [
                3888,
                3944
            ],
            [
                3944,
                4026
            ],
            [
                4026,
                4081
            ],
            [
                4082,
                4094
            ],
            [
                4094,
                4112
            ],
            [
                4113,
                4115
            ],
            [
                4115,
                4144
            ],
            [
                4144,
                4146
            ],
            [
                4146,
                4236
            ],
            [
                4236,
                4322
            ],
            [
                4323,
                4336
            ],
            [
                4344,
                4409
            ],
            [
                4410,
                4418
            ],
            [
                4426,
                4427
            ],
            [
                4428,
                4611
            ],
            [
                4612,
                4705
            ],
            [
                4705,
                4754
            ],
            [
                4755,
                4804
            ],
            [
                4804,
                4936
            ],
            [
                4937,
                4964
            ],
            [
                4964,
                5013
            ],
            [
                5013,
                5074
            ],
            [
                5075,
                5089
            ],
            [
                5092,
                5108
            ],
            [
                5108,
                5110
            ],
            [
                5110,
                5136
            ],
            [
                5137,
                5144
            ],
            [
                5145,
                5158
            ],
            [
                5158,
                5180
            ],
            [
                5182,
                5238
            ],
            [
                5238,
                5282
            ],
            [
                5282,
                5375
            ],
            [
                5375,
                5494
            ],
            [
                5494,
                5530
            ],
            [
                5530,
                5543
            ],
            [
                5544,
                5551
            ],
            [
                5552,
                5556
            ],
            [
                5556,
                5623
            ],
            [
                5624,
                5644
            ],
            [
                5651,
                5678
            ],
            [
                5678,
                5788
            ],
            [
                5788,
                5801
            ],
            [
                5802,
                5806
            ],
            [
                5807,
                5837
            ],
            [
                5837,
                5859
            ],
            [
                5860,
                5876
            ],
            [
                5887,
                5896
            ],
            [
                5896,
                5951
            ],
            [
                5959,
                5961
            ],
            [
                5961,
                6175
            ],
            [
                6176,
                6225
            ],
            [
                6225,
                6264
            ],
            [
                6265,
                6268
            ],
            [
                6269,
                6273
            ],
            [
                6274,
                6280
            ],
            [
                6280,
                6355
            ],
            [
                6355,
                6360
            ],
            [
                6366,
                6409
            ],
            [
                6409,
                6488
            ],
            [
                6488,
                6554
            ],
            [
                6554,
                6556
            ],
            [
                6556,
                6658
            ],
            [
                6659,
                6676
            ],
            [
                6676,
                6745
            ],
            [
                6746,
                6757
            ],
            [
                6758,
                6848
            ],
            [
                6848,
                6927
            ],
            [
                6938,
                6950
            ],
            [
                6951,
                6969
            ],
            [
                6969,
                7006
            ],
            [
                7006,
                7009
            ],
            [
                7010,
                7031
            ],
            [
                7032,
                7039
            ],
            [
                7040,
                7147
            ],
            [
                7156,
                7167
            ],
            [
                7167,
                7198
            ],
            [
                7198,
                7224
            ],
            [
                7224,
                7266
            ],
            [
                7266,
                7351
            ],
            [
                7351,
                7354
            ],
            [
                7355,
                7379
            ],
            [
                7380,
                7386
            ],
            [
                7387,
                7435
            ],
            [
                7435,
                7437
            ],
            [
                7437,
                7494
            ],
            [
                7494,
                7546
            ],
            [
                7546,
                7601
            ],
            [
                7601,
                7613
            ],
            [
                7614,
                7822
            ],
            [
                7833,
                7835
            ],
            [
                7839,
                7860
            ],
            [
                7882,
                7884
            ],
            [
                7885,
                7931
            ],
            [
                7931,
                7998
            ],
            [
                7998,
                8031
            ],
            [
                8038,
                8039
            ],
            [
                8040,
                8056
            ],
            [
                8057,
                8075
            ],
            [
                8076,
                8101
            ],
            [
                8101,
                8115
            ],
            [
                8121,
                8202
            ],
            [
                8202,
                8225
            ],
            [
                8225,
                8321
            ],
            [
                8322,
                8357
            ],
            [
                8358,
                8465
            ],
            [
                8466,
                8486
            ],
            [
                8486,
                8537
            ],
            [
                8537,
                8585
            ],
            [
                8585,
                8623
            ],
            [
                8623,
                8635
            ],
            [
                8646,
                8689
            ],
            [
                8689,
                8712
            ],
            [
                8712,
                8807
            ],
            [
                8807,
                8857
            ],
            [
                8857,
                8913
            ],
            [
                8913,
                8967
            ],
            [
                8967,
                8997
            ],
            [
                8997,
                9019
            ],
            [
                9019,
                9114
            ],
            [
                9114,
                9167
            ],
            [
                9167,
                9281
            ],
            [
                9281,
                9351
            ],
            [
                9351,
                9373
            ],
            [
                9374,
                9397
            ],
            [
                9398,
                9429
            ],
            [
                9429,
                9482
            ],
            [
                9482,
                9529
            ],
            [
                9529,
                9576
            ],
            [
                9576,
                9624
            ],
            [
                9632,
                9634
            ],
            [
                9634,
                9653
            ],
            [
                9662,
                9664
            ],
            [
                9664,
                9680
            ],
            [
                9681,
                9762
            ],
            [
                9762,
                9803
            ],
            [
                9803,
                9842
            ],
            [
                9852,
                9859
            ],
            [
                9859,
                9899
            ],
            [
                9900,
                9908
            ],
            [
                9920,
                10081
            ],
            [
                10082,
                10116
            ],
            [
                10117,
                10138
            ],
            [
                10138,
                10172
            ],
            [
                10173,
                10229
            ],
            [
                10230,
                10249
            ],
            [
                10249,
                10252
            ],
            [
                10266,
                10274
            ],
            [
                10275,
                10284
            ],
            [
                10289,
                10291
            ],
            [
                10307,
                10335
            ],
            [
                10336,
                10371
            ],
            [
                10371,
                10373
            ],
            [
                10373,
                10405
            ],
            [
                10406,
                10428
            ],
            [
                10428,
                10514
            ],
            [
                10514,
                10535
            ],
            [
                10536,
                10540
            ],
            [
                10541,
                10575
            ],
            [
                10575,
                10654
            ],
            [
                10654,
                10714
            ],
            [
                10714,
                10750
            ],
            [
                10752,
                10821
            ],
            [
                10821,
                10856
            ],
            [
                10862,
                10898
            ],
            [
                10898,
                10960
            ],
            [
                10960,
                11064
            ],
            [
                11065,
                11231
            ],
            [
                11232,
                11372
            ],
            [
                11372,
                11386
            ],
            [
                11387,
                11447
            ],
            [
                11466,
                11469
            ],
            [
                11470,
                11473
            ],
            [
                11474,
                11502
            ],
            [
                11503,
                11531
            ],
            [
                11531,
                11578
            ],
            [
                11578,
                11599
            ],
            [
                11606,
                11608
            ],
            [
                11608,
                11619
            ],
            [
                11620,
                11722
            ],
            [
                11722,
                11753
            ],
            [
                11753,
                11803
            ],
            [
                11803,
                11815
            ],
            [
                11815,
                11864
            ],
            [
                11865,
                11944
            ],
            [
                11944,
                12007
            ],
            [
                12007,
                12110
            ],
            [
                12118,
                12142
            ],
            [
                12142,
                12144
            ],
            [
                12144,
                12167
            ],
            [
                12167,
                12192
            ],
            [
                12192,
                12208
            ],
            [
                12208,
                12253
            ],
            [
                12253,
                12305
            ],
            [
                12305,
                12344
            ],
            [
                12345,
                12387
            ],
            [
                12387,
                12465
            ],
            [
                12465,
                12530
            ],
            [
                12530,
                12532
            ],
            [
                12532,
                12534
            ],
            [
                12535,
                12568
            ],
            [
                12568,
                12635
            ],
            [
                12635,
                12688
            ],
            [
                12688,
                12789
            ],
            [
                12789,
                12841
            ],
            [
                12841,
                12890
            ],
            [
                12890,
                12962
            ],
            [
                12969,
                13129
            ],
            [
                13130,
                13140
            ],
            [
                13141,
                13157
            ],
            [
                13158,
                13161
            ],
            [
                13162,
                13216
            ],
            [
                13216,
                13355
            ],
            [
                13355,
                13406
            ],
            [
                13412,
                13496
            ],
            [
                13496,
                13577
            ],
            [
                13577,
                13592
            ],
            [
                13593,
                13607
            ],
            [
                13607,
                13648
            ],
            [
                13648,
                13702
            ],
            [
                13702,
                13835
            ],
            [
                13835,
                14083
            ],
            [
                14084,
                14125
            ],
            [
                14125,
                14183
            ],
            [
                14200,
                14204
            ],
            [
                14205,
                14213
            ],
            [
                14213,
                14267
            ],
            [
                14268,
                14314
            ],
            [
                14324,
                14365
            ],
            [
                14377,
                14387
            ],
            [
                14388,
                14390
            ],
            [
                14395,
                14414
            ],
            [
                14419,
                14451
            ],
            [
                14452,
                14488
            ],
            [
                14489,
                14497
            ],
            [
                14497,
                14545
            ],
            [
                14545,
                14548
            ],
            [
                14549,
                14599
            ],
            [
                14600,
                14602
            ],
            [
                14602,
                14605
            ],
            [
                14605,
                14615
            ],
            [
                14621,
                14637
            ],
            [
                14638,
                14641
            ],
            [
                14647,
                14651
            ],
            [
                14651,
                14653
            ],
            [
                14653,
                14662
            ],
            [
                14672,
                14739
            ],
            [
                14739,
                14783
            ],
            [
                14783,
                14838
            ],
            [
                14838,
                14902
            ],
            [
                14908,
                14950
            ],
            [
                14950,
                14982
            ],
            [
                14983,
                15075
            ],
            [
                15076,
                15082
            ],
            [
                15083,
                15100
            ],
            [
                15101,
                15106
            ],
            [
                15115,
                15123
            ],
            [
                15133,
                15138
            ],
            [
                15139,
                15145
            ],
            [
                15158,
                15169
            ],
            [
                15169,
                15254
            ],
            [
                15255,
                15327
            ],
            [
                15327,
                15329
            ],
            [
                15329,
                15376
            ],
            [
                15376,
                15403
            ],
            [
                15403,
                15512
            ],
            [
                15513,
                15553
            ],
            [
                15553,
                15608
            ],
            [
                15620,
                15667
            ],
            [
                15668,
                15694
            ],
            [
                15694,
                15730
            ],
            [
                15732,
                15803
            ],
            [
                15803,
                15920
            ],
            [
                15935,
                15981
            ],
            [
                15981,
                16009
            ]
        ],
        "row_chars": [
            [
                0,
                223
            ],
            [
                223,
                331
            ],
            [
                331,
                511
            ],
            [
                511,
                511
            ],
            [
                511,
                532
            ],
            [
                532,
                668
            ],
            [
                668,
                825
            ],
            [
                825,
                914
            ],
            [
                914,
                992
            ],
            [
                992,
                1089
            ],
            [
                1089,
                1132
            ],
            [
                1132,
                1175
            ],
            [
                1175,
                1195
            ],
            [
                1195,
                1318
            ],
            [
                1318,
                1576
            ],
            [
                1576,
                1619
            ],
            [
                1619,
                1749
            ],
            [
                1749,
                1905
            ],
            [
                1905,
                2148
            ],
            [
                2148,
                2169
            ],
            [
                2169,
                2333
            ],
            [
                2333,
                2499
            ],
            [
                2499,
                2587
            ],
            [
                2587,
                2686
            ],
            [
                2686,
                2686
            ],
            [
                2686,
                2734
            ],
            [
                2734,
                2758
            ],
            [
                2758,
                2909
            ],
            [
                2909,
                3010
            ],
            [
                3010,
                3010
            ],
            [
                3010,
                3010
            ],
            [
                3010,
                3237
            ],
            [
                3237,
                3333
            ],
            [
                3333,
                3678
            ],
            [
                3678,
                3817
            ],
            [
                3817,
                3835
            ],
            [
                3835,
                3876
            ],
            [
                3876,
                3888
            ],
            [
                3888,
                3944
            ],
            [
                3944,
                4026
            ],
            [
                4026,
                4094
            ],
            [
                4094,
                4146
            ],
            [
                4146,
                4236
            ],
            [
                4236,
                4705
            ],
            [
                4705,
                4804
            ],
            [
                4804,
                4964
            ],
            [
                4964,
                5013
            ],
            [
                5013,
                5110
            ],
            [
                5110,
                5158
            ],
            [
                5158,
                5282
            ],
            [
                5282,
                5375
            ],
            [
                5375,
                5494
            ],
            [
                5494,
                5530
            ],
            [
                5530,
                5678
            ],
            [
                5678,
                5788
            ],
            [
                5788,
                5837
            ],
            [
                5837,
                5896
            ],
            [
                5896,
                6225
            ],
            [
                6225,
                6280
            ],
            [
                6280,
                6355
            ],
            [
                6355,
                6409
            ],
            [
                6409,
                6409
            ],
            [
                6409,
                6488
            ],
            [
                6488,
                6556
            ],
            [
                6556,
                6676
            ],
            [
                6676,
                6848
            ],
            [
                6848,
                6969
            ],
            [
                6969,
                7006
            ],
            [
                7006,
                7167
            ],
            [
                7167,
                7198
            ],
            [
                7198,
                7224
            ],
            [
                7224,
                7224
            ],
            [
                7224,
                7266
            ],
            [
                7266,
                7351
            ],
            [
                7351,
                7437
            ],
            [
                7437,
                7494
            ],
            [
                7494,
                7546
            ],
            [
                7546,
                7601
            ],
            [
                7601,
                7931
            ],
            [
                7931,
                7998
            ],
            [
                7998,
                8202
            ],
            [
                8202,
                8225
            ],
            [
                8225,
                8486
            ],
            [
                8486,
                8537
            ],
            [
                8537,
                8585
            ],
            [
                8585,
                8623
            ],
            [
                8623,
                8689
            ],
            [
                8689,
                8712
            ],
            [
                8712,
                8807
            ],
            [
                8807,
                8857
            ],
            [
                8857,
                8913
            ],
            [
                8913,
                8967
            ],
            [
                8967,
                8997
            ],
            [
                8997,
                9019
            ],
            [
                9019,
                9114
            ],
            [
                9114,
                9167
            ],
            [
                9167,
                9281
            ],
            [
                9281,
                9351
            ],
            [
                9351,
                9429
            ],
            [
                9429,
                9482
            ],
            [
                9482,
                9529
            ],
            [
                9529,
                9576
            ],
            [
                9576,
                9624
            ],
            [
                9624,
                9634
            ],
            [
                9634,
                9664
            ],
            [
                9664,
                9762
            ],
            [
                9762,
                9803
            ],
            [
                9803,
                9859
            ],
            [
                9859,
                10138
            ],
            [
                10138,
                10249
            ],
            [
                10249,
                10373
            ],
            [
                10373,
                10428
            ],
            [
                10428,
                10514
            ],
            [
                10514,
                10575
            ],
            [
                10575,
                10654
            ],
            [
                10654,
                10714
            ],
            [
                10714,
                10898
            ],
            [
                10898,
                10960
            ],
            [
                10960,
                11372
            ],
            [
                11372,
                11447
            ],
            [
                11447,
                11531
            ],
            [
                11531,
                11608
            ],
            [
                11608,
                11722
            ],
            [
                11722,
                11753
            ],
            [
                11753,
                11803
            ],
            [
                11803,
                11944
            ],
            [
                11944,
                12007
            ],
            [
                12007,
                12144
            ],
            [
                12144,
                12167
            ],
            [
                12167,
                12192
            ],
            [
                12192,
                12208
            ],
            [
                12208,
                12253
            ],
            [
                12253,
                12305
            ],
            [
                12305,
                12387
            ],
            [
                12387,
                12465
            ],
            [
                12465,
                12532
            ],
            [
                12532,
                12568
            ],
            [
                12568,
                12635
            ],
            [
                12635,
                12688
            ],
            [
                12688,
                12789
            ],
            [
                12789,
                12841
            ],
            [
                12841,
                13216
            ],
            [
                13216,
                13355
            ],
            [
                13355,
                13496
            ],
            [
                13496,
                13577
            ],
            [
                13577,
                13607
            ],
            [
                13607,
                13648
            ],
            [
                13648,
                13835
            ],
            [
                13835,
                14084
            ],
            [
                14084,
                14125
            ],
            [
                14125,
                14497
            ],
            [
                14497,
                14545
            ],
            [
                14545,
                14605
            ],
            [
                14605,
                14653
            ],
            [
                14653,
                14783
            ],
            [
                14783,
                14950
            ],
            [
                14950,
                15076
            ],
            [
                15076,
                15076
            ],
            [
                15076,
                15169
            ],
            [
                15169,
                15329
            ],
            [
                15329,
                15376
            ],
            [
                15376,
                15403
            ],
            [
                15403,
                15553
            ],
            [
                15553,
                15694
            ],
            [
                15694,
                15803
            ],
            [
                15803,
                15981
            ],
            [
                15981,
                16009
            ]
        ]
    }
}