{
    "original": {
        "text": "It had been a miserable party, each of the three believing themselves most miserable. Mrs. Norris, however, as most attached to Maria, was really the greatest sufferer. Maria was her first favourite, the dearest of all; the match had been her own contriving, as she had been wont with such pride of heart to feel and say, and this conclusion of it almost overpowered her.\nShe was an altered creature, quieted, stupefied, indifferent to everything that passed. The being left with her sister and nephew, and all the house under her care, had been an advantage entirely thrown away; she had been unable to direct or dictate, or even fancy herself useful. When really touched by affliction, her active powers had been all benumbed; and neither Lady Bertram nor Tom had received from her the smallest support or attempt at support. She had done no more for them than they had done for each other. They had been all solitary, helpless, and forlorn alike; and now the arrival of the others only established her superiority in wretchedness. Her companions were relieved, but there was no good for _her_. Edmund was almost as welcome to his brother as Fanny to her aunt; but Mrs. Norris, instead of having comfort from either, was but the more irritated by the sight of the person whom, in the blindness of her anger, she could have charged as the daemon of the piece. Had Fanny accepted Mr. Crawford this could not have happened.\nSusan too was a grievance. She had not spirits to notice her in more than a few repulsive looks, but she felt her as a spy, and an intruder, and an indigent niece, and everything most odious. By her other aunt, Susan was received with quiet kindness. Lady Bertram could not give her much time, or many words, but she felt her, as Fanny's sister, to have a claim at Mansfield, and was ready to kiss and like her; and Susan was more than satisfied, for she came perfectly aware that nothing but ill-humour was to be expected from aunt Norris; and was so provided with happiness, so strong in that best of blessings, an escape from many certain evils, that she could have stood against a great deal more indifference than she met with from the others.\nShe was now left a good deal to herself, to get acquainted with the house and grounds as she could, and spent her days very happily in so doing, while those who might otherwise have attended to her were shut up, or wholly occupied each with the person quite dependent on them, at this time, for everything like comfort; Edmund trying to bury his own feelings in exertions for the relief of his brother's, and Fanny devoted to her aunt Bertram, returning to every former office with more than former zeal, and thinking she could never do enough for one who seemed so much to want her.\nTo talk over the dreadful business with Fanny, talk and lament, was all Lady Bertram's consolation. To be listened to and borne with, and hear the voice of kindness and sympathy in return, was everything that could be done for her. To be otherwise comforted was out of the question. The case admitted of no comfort. Lady Bertram did not think deeply, but, guided by Sir Thomas, she thought justly on all important points; and she saw, therefore, in all its enormity, what had happened, and neither endeavoured herself, nor required Fanny to advise her, to think little of guilt and infamy.\nHer affections were not acute, nor was her mind tenacious. After a time, Fanny found it not impossible to direct her thoughts to other subjects, and revive some interest in the usual occupations; but whenever Lady Bertram _was_ fixed on the event, she could see it only in one light, as comprehending the loss of a daughter, and a disgrace never to be wiped off.\nFanny learnt from her all the particulars which had yet transpired. Her aunt was no very methodical narrator, but with the help of some letters to and from Sir Thomas, and what she already knew herself, and could reasonably combine, she was soon able to understand quite as much as she wished of the circumstances attending the story.\nMrs. Rushworth had gone, for the Easter holidays, to Twickenham, with a family whom she had just grown intimate with: a family of lively, agreeable manners, and probably of morals and discretion to suit, for to _their_ house Mr. Crawford had constant access at all times. His having been in the same neighbourhood Fanny already knew. Mr. Rushworth had been gone at this time to Bath, to pass a few days with his mother, and bring her back to town, and Maria was with these friends without any restraint, without even Julia; for Julia had removed from Wimpole Street two or three weeks before, on a visit to some relations of Sir Thomas; a removal which her father and mother were now disposed to attribute to some view of convenience on Mr. Yates's account. Very soon after the Rushworths' return to Wimpole Street, Sir Thomas had received a letter from an old and most particular friend in London, who hearing and witnessing a good deal to alarm him in that quarter, wrote to recommend Sir Thomas's coming to London himself, and using his influence with his daughter to put an end to the intimacy which was already exposing her to unpleasant remarks, and evidently making Mr. Rushworth uneasy.\nSir Thomas was preparing to act upon this letter, without communicating its contents to any creature at Mansfield, when it was followed by another, sent express from the same friend, to break to him the almost desperate situation in which affairs then stood with the young people. Mrs. Rushworth had left her husband's house: Mr. Rushworth had been in great anger and distress to _him_ (Mr. Harding) for his advice; Mr. Harding feared there had been _at_ _least_ very flagrant indiscretion. The maidservant of Mrs. Rushworth, senior, threatened alarmingly. He was doing all in his power to quiet everything, with the hope of Mrs. Rushworth's return, but was so much counteracted in Wimpole Street by the influence of Mr. Rushworth's mother, that the worst consequences might be apprehended.\nThis dreadful communication could not be kept from the rest of the family. Sir Thomas set off, Edmund would go with him, and the others had been left in a state of wretchedness, inferior only to what followed the receipt of the next letters from London. Everything was by that time public beyond a hope. The servant of Mrs. Rushworth, the mother, had exposure in her power, and supported by her mistress, was not to be silenced. The two ladies, even in the short time they had been together, had disagreed; and the bitterness of the elder against her daughter-in-law might perhaps arise almost as much from the personal disrespect with which she had herself been treated as from sensibility for her son.\nHowever that might be, she was unmanageable. But had she been less obstinate, or of less weight with her son, who was always guided by the last speaker, by the person who could get hold of and shut him up, the case would still have been hopeless, for Mrs. Rushworth did not appear again, and there was every reason to conclude her to be concealed somewhere with Mr. Crawford, who had quitted his uncle's house, as for a journey, on the very day of her absenting herself.\nSir Thomas, however, remained yet a little longer in town, in the hope of discovering and snatching her from farther vice, though all was lost on the side of character.\n_His_ present state Fanny could hardly bear to think of. There was but one of his children who was not at this time a source of misery to him. Tom's complaints had been greatly heightened by the shock of his sister's conduct, and his recovery so much thrown back by it, that even Lady Bertram had been struck by the difference, and all her alarms were regularly sent off to her husband; and Julia's elopement, the additional blow which had met him on his arrival in London, though its force had been deadened at the moment, must, she knew, be sorely felt. She saw that it was. His letters expressed how much he deplored it. Under any circumstances it would have been an unwelcome alliance; but to have it so clandestinely formed, and such a period chosen for its completion, placed Julia's feelings in a most unfavourable light, and severely aggravated the folly of her choice. He called it a bad thing, done in the worst manner, and at the worst time; and though Julia was yet as more pardonable than Maria as folly than vice, he could not but regard the step she had taken as opening the worst probabilities of a conclusion hereafter like her sister's. Such was his opinion of the set into which she had thrown herself.\nFanny felt for him most acutely. He could have no comfort but in Edmund. Every other child must be racking his heart. His displeasure against herself she trusted, reasoning differently from Mrs. Norris, would now be done away. _She_ should be justified. Mr. Crawford would have fully acquitted her conduct in refusing him; but this, though most material to herself, would be poor consolation to Sir Thomas. Her uncle's displeasure was terrible to her; but what could her justification or her gratitude and attachment do for him? His stay must be on Edmund alone.\nShe was mistaken, however, in supposing that Edmund gave his father no present pain. It was of a much less poignant nature than what the others excited; but Sir Thomas was considering his happiness as very deeply involved in the offence of his sister and friend; cut off by it, as he must be, from the woman whom he had been pursuing with undoubted attachment and strong probability of success; and who, in everything but this despicable brother, would have been so eligible a connexion. He was aware of what Edmund must be suffering on his own behalf, in addition to all the rest, when they were in town: he had seen or conjectured his feelings; and, having reason to think that one interview with Miss Crawford had taken place, from which Edmund derived only increased distress, had been as anxious on that account as on others to get him out of town, and had engaged him in taking Fanny home to her aunt, with a view to his relief and benefit, no less than theirs. Fanny was not in the secret of her uncle's feelings, Sir Thomas not in the secret of Miss Crawford's character. Had he been privy to her conversation with his son, he would not have wished her to belong to him, though her twenty thousand pounds had been forty.\nThat Edmund must be for ever divided from Miss Crawford did not admit of a doubt with Fanny; and yet, till she knew that he felt the same, her own conviction was insufficient. She thought he did, but she wanted to be assured of it. If he would now speak to her with the unreserve which had sometimes been too much for her before, it would be most consoling; but _that_ she found was not to be. She seldom saw him: never alone. He probably avoided being alone with her. What was to be inferred? That his judgment submitted to all his own peculiar and bitter share of this family affliction, but that it was too keenly felt to be a subject of the slightest communication. This must be his state. He yielded, but it was with agonies which did not admit of speech. Long, long would it be ere Miss Crawford's name passed his lips again, or she could hope for a renewal of such confidential intercourse as had been.\nIt _was_ long. They reached Mansfield on Thursday, and it was not till Sunday evening that Edmund began to talk to her on the subject. Sitting with her on Sunday evening-a wet Sunday evening-the very time of all others when, if a friend is at hand, the heart must be opened, and everything told; no one else in the room, except his mother, who, after hearing an affecting sermon, had cried herself to sleep, it was impossible not to speak; and so, with the usual beginnings, hardly to be traced as to what came first, and the usual declaration that if she would listen to him for a few minutes, he should be very brief, and certainly never tax her kindness in the same way again; she need not fear a repetition; it would be a subject prohibited entirely: he entered upon the luxury of relating circumstances and sensations of the first interest to himself, to one of whose affectionate sympathy he was quite convinced.\nHow Fanny listened, with what curiosity and concern, what pain and what delight, how the agitation of his voice was watched, and how carefully her own eyes were fixed on any object but himself, may be imagined. The opening was alarming. He had seen Miss Crawford. He had been invited to see her. He had received a note from Lady Stornaway to beg him to call; and regarding it as what was meant to be the last, last interview of friendship, and investing her with all the feelings of shame and wretchedness which Crawford's sister ought to have known, he had gone to her in such a state of mind, so softened, so devoted, as made it for a few moments impossible to Fanny's fears that it should be the last. But as he proceeded in his story, these fears were over. She had met him, he said, with a serious-certainly a serious-even an agitated air; but before he had been able to speak one intelligible sentence, she had introduced the subject in a manner which he owned had shocked him. \"'I heard you were in town,' said she; 'I wanted to see you. Let us talk over this sad business. What can equal the folly of our two relations?' I could not answer, but I believe my looks spoke. She felt reproved. Sometimes how quick to feel! With a graver look and voice she then added, 'I do not mean to defend Henry at your sister's expense.' So she began, but how she went on, Fanny, is not fit, is hardly fit to be repeated to you. I cannot recall all her words. I would not dwell upon them if I could. Their substance was great anger at the _folly_ of each. She reprobated her brother's folly in being drawn on by a woman whom he had never cared for, to do what must lose him the woman he adored; but still more the folly of poor Maria, in sacrificing such a situation, plunging into such difficulties, under the idea of being really loved by a man who had long ago made his indifference clear. Guess what I must have felt. To hear the woman whom-no harsher name than folly given! So voluntarily, so freely, so coolly to canvass it! No reluctance, no horror, no feminine, shall I say, no modest loathings? This is what the world does. For where, Fanny, shall we find a woman whom nature had so richly endowed? Spoilt, spoilt!\"\nAfter a little reflection, he went on with a sort of desperate calmness. \"I will tell you everything, and then have done for ever. She saw it only as folly, and that folly stamped only by exposure. The want of common discretion, of caution: his going down to Richmond for the whole time of her being at Twickenham; her putting herself in the power of a servant; it was the detection, in short-oh, Fanny! it was the detection, not the offence, which she reprobated. It was the imprudence which had brought things to extremity, and obliged her brother to give up every dearer plan in order to fly with her.\"\nHe stopt. \"And what,\" said Fanny (believing herself required to speak), \"what could you say?\"\n\"Nothing, nothing to be understood. I was like a man stunned. She went on, began to talk of you; yes, then she began to talk of you, regretting, as well she might, the loss of such a-. There she spoke very rationally. But she has always done justice to you. 'He has thrown away,' said she, 'such a woman as he will never see again. She would have fixed him; she would have made him happy for ever.' My dearest Fanny, I am giving you, I hope, more pleasure than pain by this retrospect of what might have been-but what never can be now. You do not wish me to be silent? If you do, give me but a look, a word, and I have done.\"\nNo look or word was given.\n\"Thank God,\" said he. \"We were all disposed to wonder, but it seems to have been the merciful appointment of Providence that the heart which knew no guile should not suffer. She spoke of you with high praise and warm affection; yet, even here, there was alloy, a dash of evil; for in the midst of it she could exclaim, 'Why would not she have him? It is all her fault. Simple girl! I shall never forgive her. Had she accepted him as she ought, they might now have been on the point of marriage, and Henry would have been too happy and too busy to want any other object. He would have taken no pains to be on terms with Mrs. Rushworth again. It would have all ended in a regular standing flirtation, in yearly meetings at Sotherton and Everingham.' Could you have believed it possible? But the charm is broken. My eyes are opened.\"\n\"Cruel!\" said Fanny, \"quite cruel. At such a moment to give way to gaiety, to speak with lightness, and to you! Absolute cruelty.\"\n\"Cruelty, do you call it? We differ there. No, hers is not a cruel nature. I do not consider her as meaning to wound my feelings. The evil lies yet deeper: in her total ignorance, unsuspiciousness of there being such feelings; in a perversion of mind which made it natural to her to treat the subject as she did. She was speaking only as she had been used to hear others speak, as she imagined everybody else would speak. Hers are not faults of temper. She would not voluntarily give unnecessary pain to any one, and though I may deceive myself, I cannot but think that for me, for my feelings, she would-. Hers are faults of principle, Fanny; of blunted delicacy and a corrupted, vitiated mind. Perhaps it is best for me, since it leaves me so little to regret. Not so, however. Gladly would I submit to all the increased pain of losing her, rather than have to think of her as I do. I told her so.\"\n\"Did you?\"\n\"Yes; when I left her I told her so.\"\n\"How long were you together?\"\n\"Five-and-twenty minutes. Well, she went on to say that what remained now to be done was to bring about a marriage between them. She spoke of it, Fanny, with a steadier voice than I can.\" He was obliged to pause more than once as he continued. \"'We must persuade Henry to marry her,' said she; 'and what with honour, and the certainty of having shut himself out for ever from Fanny, I do not despair of it. Fanny he must give up. I do not think that even _he_ could now hope to succeed with one of her stamp, and therefore I hope we may find no insuperable difficulty. My influence, which is not small shall all go that way; and when once married, and properly supported by her own family, people of respectability as they are, she may recover her footing in society to a certain degree. In some circles, we know, she would never be admitted, but with good dinners, and large parties, there will always be those who will be glad of her acquaintance; and there is, undoubtedly, more liberality and candour on those points than formerly. What I advise is, that your father be quiet. Do not let him injure his own cause by interference. Persuade him to let things take their course. If by any officious exertions of his, she is induced to leave Henry's protection, there will be much less chance of his marrying her than if she remain with him. I know how he is likely to be influenced. Let Sir Thomas trust to his honour and compassion, and it may all end well; but if he get his daughter away, it will be destroying the chief hold.'\"\nAfter repeating this, Edmund was so much affected that Fanny, watching him with silent, but most tender concern, was almost sorry that the subject had been entered on at all. It was long before he could speak again. At last, \"Now, Fanny,\" said he, \"I shall soon have done. I have told you the substance of all that she said. As soon as I could speak, I replied that I had not supposed it possible, coming in such a state of mind into that house as I had done, that anything could occur to make me suffer more, but that she had been inflicting deeper wounds in almost every sentence. That though I had, in the course of our acquaintance, been often sensible of some difference in our opinions, on points, too, of some moment, it had not entered my imagination to conceive the difference could be such as she had now proved it. That the manner in which she treated the dreadful crime committed by her brother and my sister (with whom lay the greater seduction I pretended not to say), but the manner in which she spoke of the crime itself, giving it every reproach but the right; considering its ill consequences only as they were to be braved or overborne by a defiance of decency and impudence in wrong; and last of all, and above all, recommending to us a compliance, a compromise, an acquiescence in the continuance of the sin, on the chance of a marriage which, thinking as I now thought of her brother, should rather be prevented than sought; all this together most grievously convinced me that I had never understood her before, and that, as far as related to mind, it had been the creature of my own imagination, not Miss Crawford, that I had been too apt to dwell on for many months past. That, perhaps, it was best for me; I had less to regret in sacrificing a friendship, feelings, hopes which must, at any rate, have been torn from me now. And yet, that I must and would confess that, could I have restored her to what she had appeared to me before, I would infinitely prefer any increase of the pain of parting, for the sake of carrying with me the right of tenderness and esteem. This is what I said, the purport of it; but, as you may imagine, not spoken so collectedly or methodically as I have repeated it to you. She was astonished, exceedingly astonished-more than astonished. I saw her change countenance. She turned extremely red. I imagined I saw a mixture of many feelings: a great, though short struggle; half a wish of yielding to truths, half a sense of shame, but habit, habit carried it. She would have laughed if she could. It was a sort of laugh, as she answered, 'A pretty good lecture, upon my word. Was it part of your last sermon? At this rate you will soon reform everybody at Mansfield and Thornton Lacey; and when I hear of you next, it may be as a celebrated preacher in some great society of Methodists, or as a missionary into foreign parts.' She tried to speak carelessly, but she was not so careless as she wanted to appear. I only said in reply, that from my heart I wished her well, and earnestly hoped that she might soon learn to think more justly, and not owe the most valuable knowledge we could any of us acquire, the knowledge of ourselves and of our duty, to the lessons of affliction, and immediately left the room. I had gone a few steps, Fanny, when I heard the door open behind me. 'Mr. Bertram,' said she. I looked back. 'Mr. Bertram,' said she, with a smile; but it was a smile ill-suited to the conversation that had passed, a saucy playful smile, seeming to invite in order to subdue me; at least it appeared so to me. I resisted; it was the impulse of the moment to resist, and still walked on. I have since, sometimes, for a moment, regretted that I did not go back, but I know I was right, and such has been the end of our acquaintance. And what an acquaintance has it been! How have I been deceived! Equally in brother and sister deceived! I thank you for your patience, Fanny. This has been the greatest relief, and now we will have done.\"\nAnd such was Fanny's dependence on his words, that for five minutes she thought they _had_ done. Then, however, it all came on again, or something very like it, and nothing less than Lady Bertram's rousing thoroughly up could really close such a conversation. Till that happened, they continued to talk of Miss Crawford alone, and how she had attached him, and how delightful nature had made her, and how excellent she would have been, had she fallen into good hands earlier. Fanny, now at liberty to speak openly, felt more than justified in adding to his knowledge of her real character, by some hint of what share his brother's state of health might be supposed to have in her wish for a complete reconciliation. This was not an agreeable intimation. Nature resisted it for a while. It would have been a vast deal pleasanter to have had her more disinterested in her attachment; but his vanity was not of a strength to fight long against reason. He submitted to believe that Tom's illness had influenced her, only reserving for himself this consoling thought, that considering the many counteractions of opposing habits, she had certainly been _more_ attached to him than could have been expected, and for his sake been more near doing right. Fanny thought exactly the same; and they were also quite agreed in their opinion of the lasting effect, the indelible impression, which such a disappointment must make on his mind. Time would undoubtedly abate somewhat of his sufferings, but still it was a sort of thing which he never could get entirely the better of; and as to his ever meeting with any other woman who could-it was too impossible to be named but with indignation. Fanny's friendship was all that he had to cling to.",
        "paragraph_chars": [
            [
                0,
                372
            ],
            [
                372,
                1423
            ],
            [
                1423,
                2172
            ],
            [
                2172,
                2756
            ],
            [
                2756,
                3346
            ],
            [
                3346,
                3709
            ],
            [
                3709,
                4044
            ],
            [
                4044,
                5239
            ],
            [
                5239,
                6030
            ],
            [
                6030,
                6734
            ],
            [
                6734,
                7205
            ],
            [
                7205,
                7374
            ],
            [
                7374,
                8596
            ],
            [
                8596,
                9159
            ],
            [
                9159,
                10388
            ],
            [
                10388,
                11298
            ],
            [
                11298,
                12217
            ],
            [
                12217,
                14434
            ],
            [
                14434,
                15040
            ],
            [
                15040,
                15134
            ],
            [
                15134,
                15760
            ],
            [
                15760,
                15787
            ],
            [
                15787,
                16618
            ],
            [
                16618,
                16749
            ],
            [
                16749,
                17650
            ],
            [
                17650,
                17661
            ],
            [
                17661,
                17699
            ],
            [
                17699,
                17729
            ],
            [
                17729,
                19262
            ],
            [
                19262,
                23264
            ],
            [
                23264,
                24995
            ]
        ],
        "segment_chars": [
            [
                0,
                86
            ],
            [
                86,
                169
            ],
            [
                169,
                372
            ],
            [
                372,
                460
            ],
            [
                460,
                653
            ],
            [
                653,
                828
            ],
            [
                828,
                893
            ],
            [
                893,
                1034
            ],
            [
                1034,
                1097
            ],
            [
                1097,
                1361
            ],
            [
                1361,
                1423
            ],
            [
                1423,
                1450
            ],
            [
                1450,
                1615
            ],
            [
                1615,
                1674
            ],
            [
                1674,
                2172
            ],
            [
                2172,
                2756
            ],
            [
                2756,
                2856
            ],
            [
                2856,
                2988
            ],
            [
                2988,
                3039
            ],
            [
                3039,
                3072
            ],
            [
                3072,
                3346
            ],
            [
                3346,
                3405
            ],
            [
                3405,
                3709
            ],
            [
                3709,
                3777
            ],
            [
                3777,
                4044
            ],
            [
                4044,
                4316
            ],
            [
                4316,
                4378
            ],
            [
                4378,
                4802
            ],
            [
                4802,
                5239
            ],
            [
                5239,
                5520
            ],
            [
                5520,
                5730
            ],
            [
                5730,
                5796
            ],
            [
                5796,
                6030
            ],
            [
                6030,
                6105
            ],
            [
                6105,
                6284
            ],
            [
                6284,
                6334
            ],
            [
                6334,
                6459
            ],
            [
                6459,
                6734
            ],
            [
                6734,
                6779
            ],
            [
                6779,
                7205
            ],
            [
                7205,
                7374
            ],
            [
                7374,
                7431
            ],
            [
                7431,
                7517
            ],
            [
                7517,
                7930
            ],
            [
                7930,
                7951
            ],
            [
                7951,
                7998
            ],
            [
                7998,
                8252
            ],
            [
                8252,
                8529
            ],
            [
                8529,
                8596
            ],
            [
                8596,
                8629
            ],
            [
                8629,
                8669
            ],
            [
                8669,
                8714
            ],
            [
                8714,
                8823
            ],
            [
                8823,
                8850
            ],
            [
                8850,
                9003
            ],
            [
                9003,
                9125
            ],
            [
                9125,
                9159
            ],
            [
                9159,
                9244
            ],
            [
                9244,
                9647
            ],
            [
                9647,
                10127
            ],
            [
                10127,
                10239
            ],
            [
                10239,
                10388
            ],
            [
                10388,
                10564
            ],
            [
                10564,
                10620
            ],
            [
                10620,
                10782
            ],
            [
                10782,
                10815
            ],
            [
                10815,
                10857
            ],
            [
                10857,
                10882
            ],
            [
                10882,
                11058
            ],
            [
                11058,
                11082
            ],
            [
                11082,
                11149
            ],
            [
                11149,
                11298
            ],
            [
                11298,
                11313
            ],
            [
                11313,
                11433
            ],
            [
                11433,
                12217
            ],
            [
                12217,
                12428
            ],
            [
                12428,
                12454
            ],
            [
                12454,
                12481
            ],
            [
                12481,
                12513
            ],
            [
                12513,
                12922
            ],
            [
                12922,
                12979
            ],
            [
                12979,
                13201
            ],
            [
                13201,
                13262
            ],
            [
                13262,
                13298
            ],
            [
                13298,
                13346
            ],
            [
                13346,
                13396
            ],
            [
                13396,
                13415
            ],
            [
                13415,
                13444
            ],
            [
                13444,
                13547
            ],
            [
                13547,
                13638
            ],
            [
                13638,
                13669
            ],
            [
                13669,
                13709
            ],
            [
                13709,
                13765
            ],
            [
                13765,
                14102
            ],
            [
                14102,
                14131
            ],
            [
                14131,
                14188
            ],
            [
                14188,
                14240
            ],
            [
                14240,
                14313
            ],
            [
                14313,
                14342
            ],
            [
                14342,
                14417
            ],
            [
                14417,
                14434
            ],
            [
                14434,
                14507
            ],
            [
                14507,
                14565
            ],
            [
                14565,
                14632
            ],
            [
                14632,
                14838
            ],
            [
                14838,
                14899
            ],
            [
                14899,
                15040
            ],
            [
                15040,
                15050
            ],
            [
                15050,
                15134
            ],
            [
                15134,
                15170
            ],
            [
                15170,
                15196
            ],
            [
                15196,
                15319
            ],
            [
                15319,
                15352
            ],
            [
                15352,
                15392
            ],
            [
                15392,
                15466
            ],
            [
                15466,
                15533
            ],
            [
                15533,
                15670
            ],
            [
                15670,
                15703
            ],
            [
                15703,
                15760
            ],
            [
                15760,
                15787
            ],
            [
                15787,
                15809
            ],
            [
                15809,
                15961
            ],
            [
                15961,
                16135
            ],
            [
                16135,
                16156
            ],
            [
                16156,
                16169
            ],
            [
                16169,
                16196
            ],
            [
                16196,
                16357
            ],
            [
                16357,
                16428
            ],
            [
                16428,
                16535
            ],
            [
                16535,
                16572
            ],
            [
                16572,
                16597
            ],
            [
                16597,
                16618
            ],
            [
                16618,
                16627
            ],
            [
                16627,
                16653
            ],
            [
                16653,
                16730
            ],
            [
                16730,
                16749
            ],
            [
                16749,
                16775
            ],
            [
                16775,
                16792
            ],
            [
                16792,
                16824
            ],
            [
                16824,
                16879
            ],
            [
                16879,
                17062
            ],
            [
                17062,
                17171
            ],
            [
                17171,
                17202
            ],
            [
                17202,
                17356
            ],
            [
                17356,
                17445
            ],
            [
                17445,
                17512
            ],
            [
                17512,
                17529
            ],
            [
                17529,
                17634
            ],
            [
                17634,
                17650
            ],
            [
                17650,
                17661
            ],
            [
                17661,
                17699
            ],
            [
                17699,
                17729
            ],
            [
                17729,
                17755
            ],
            [
                17755,
                17858
            ],
            [
                17858,
                17917
            ],
            [
                17917,
                17973
            ],
            [
                17973,
                18136
            ],
            [
                18136,
                18159
            ],
            [
                18159,
                18298
            ],
            [
                18298,
                18517
            ],
            [
                18517,
                18765
            ],
            [
                18765,
                18810
            ],
            [
                18810,
                18863
            ],
            [
                18863,
                18909
            ],
            [
                18909,
                19071
            ],
            [
                19071,
                19113
            ],
            [
                19113,
                19262
            ],
            [
                19262,
                19437
            ],
            [
                19437,
                19478
            ],
            [
                19478,
                19535
            ],
            [
                19535,
                19587
            ],
            [
                19587,
                19845
            ],
            [
                19845,
                20088
            ],
            [
                20088,
                20958
            ],
            [
                20958,
                21112
            ],
            [
                21112,
                21354
            ],
            [
                21354,
                21491
            ],
            [
                21491,
                21556
            ],
            [
                21556,
                21586
            ],
            [
                21586,
                21612
            ],
            [
                21612,
                21776
            ],
            [
                21776,
                21813
            ],
            [
                21813,
                21892
            ],
            [
                21892,
                21925
            ],
            [
                21925,
                22143
            ],
            [
                22143,
                22227
            ],
            [
                22227,
                22528
            ],
            [
                22528,
                22597
            ],
            [
                22597,
                22602
            ],
            [
                22602,
                22622
            ],
            [
                22622,
                22637
            ],
            [
                22637,
                22642
            ],
            [
                22642,
                22838
            ],
            [
                22838,
                22915
            ],
            [
                22915,
                23059
            ],
            [
                23059,
                23097
            ],
            [
                23097,
                23123
            ],
            [
                23123,
                23163
            ],
            [
                23163,
                23201
            ],
            [
                23201,
                23264
            ],
            [
                23264,
                23361
            ],
            [
                23361,
                23524
            ],
            [
                23524,
                23740
            ],
            [
                23740,
                23980
            ],
            [
                23980,
                24018
            ],
            [
                24018,
                24050
            ],
            [
                24050,
                24213
            ],
            [
                24213,
                24510
            ],
            [
                24510,
                24691
            ],
            [
                24691,
                24944
            ],
            [
                24944,
                24995
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                84,
                86
            ],
            [
                86,
                97
            ],
            [
                106,
                169
            ],
            [
                169,
                198
            ],
            [
                218,
                258
            ],
            [
                322,
                372
            ],
            [
                372,
                406
            ],
            [
                408,
                460
            ],
            [
                581,
                653
            ],
            [
                653,
                664
            ],
            [
                686,
                804
            ],
            [
                826,
                828
            ],
            [
                828,
                893
            ],
            [
                893,
                948
            ],
            [
                1032,
                1034
            ],
            [
                1034,
                1053
            ],
            [
                1054,
                1089
            ],
            [
                1091,
                1094
            ],
            [
                1097,
                1149
            ],
            [
                1219,
                1222
            ],
            [
                1150,
                1178
            ],
            [
                1236,
                1281
            ],
            [
                1303,
                1324
            ],
            [
                1333,
                1361
            ],
            [
                1361,
                1423
            ],
            [
                1423,
                1450
            ],
            [
                1454,
                1483
            ],
            [
                1518,
                1546
            ],
            [
                1551,
                1562
            ],
            [
                1585,
                1615
            ],
            [
                1615,
                1674
            ],
            [
                1674,
                1705
            ],
            [
                1720,
                1739
            ],
            [
                1803,
                1848
            ],
            [
                1859,
                1868
            ],
            [
                1962,
                1963
            ],
            [
                1870,
                1877
            ],
            [
                1968,
                1974
            ],
            [
                2010,
                2012
            ],
            [
                1745,
                1748
            ],
            [
                2040,
                2154
            ],
            [
                2170,
                2172
            ],
            [
                2172,
                2402
            ],
            [
                2408,
                2412
            ],
            [
                2403,
                2407
            ],
            [
                2490,
                2615
            ],
            [
                2677,
                2756
            ],
            [
                2756,
                2856
            ],
            [
                2856,
                2858
            ],
            [
                2874,
                2877
            ],
            [
                2912,
                2948
            ],
            [
                2960,
                2988
            ],
            [
                3039,
                3062
            ],
            [
                3063,
                3072
            ],
            [
                3072,
                3346
            ],
            [
                3405,
                3433
            ],
            [
                3449,
                3518
            ],
            [
                3523,
                3567
            ],
            [
                3583,
                3709
            ],
            [
                3709,
                3750
            ],
            [
                3877,
                3880
            ],
            [
                3823,
                3875
            ],
            [
                3940,
                4044
            ],
            [
                4044,
                4135
            ],
            [
                4141,
                4254
            ],
            [
                4256,
                4261
            ],
            [
                4263,
                4316
            ],
            [
                4378,
                4752
            ],
            [
                4781,
                4801
            ],
            [
                4802,
                4904
            ],
            [
                4925,
                5020
            ],
            [
                5031,
                5041
            ],
            [
                5051,
                5073
            ],
            [
                5080,
                5239
            ],
            [
                5239,
                5287
            ],
            [
                5352,
                5496
            ],
            [
                5518,
                5520
            ],
            [
                5520,
                5618
            ],
            [
                5620,
                5623
            ],
            [
                5625,
                5688
            ],
            [
                5690,
                5692
            ],
            [
                5702,
                5730
            ],
            [
                5730,
                5796
            ],
            [
                5796,
                6016
            ],
            [
                6028,
                6030
            ],
            [
                6030,
                6105
            ],
            [
                6105,
                6123
            ],
            [
                6141,
                6145
            ],
            [
                6125,
                6131
            ],
            [
                6149,
                6207
            ],
            [
                6239,
                6283
            ],
            [
                6284,
                6334
            ],
            [
                6334,
                6459
            ],
            [
                6459,
                6466
            ],
            [
                6473,
                6536
            ],
            [
                6541,
                6596
            ],
            [
                6624,
                6679
            ],
            [
                6688,
                6708
            ],
            [
                6721,
                6734
            ],
            [
                6757,
                6779
            ],
            [
                6779,
                6810
            ],
            [
                6938,
                6984
            ],
            [
                7000,
                7143
            ],
            [
                7163,
                7205
            ],
            [
                7205,
                7234
            ],
            [
                7239,
                7313
            ],
            [
                7322,
                7374
            ],
            [
                7375,
                7378
            ],
            [
                7380,
                7431
            ],
            [
                7431,
                7440
            ],
            [
                7445,
                7517
            ],
            [
                7517,
                7522
            ],
            [
                7534,
                7542
            ],
            [
                7617,
                7619
            ],
            [
                7551,
                7598
            ],
            [
                7642,
                7803
            ],
            [
                7846,
                7930
            ],
            [
                7951,
                7998
            ],
            [
                7998,
                8107
            ],
            [
                8108,
                8114
            ],
            [
                8147,
                8161
            ],
            [
                8173,
                8201
            ],
            [
                8250,
                8252
            ],
            [
                8252,
                8343
            ],
            [
                8344,
                8347
            ],
            [
                8355,
                8381
            ],
            [
                8382,
                8390
            ],
            [
                8391,
                8404
            ],
            [
                8352,
                8354
            ],
            [
                8510,
                8529
            ],
            [
                8529,
                8596
            ],
            [
                8596,
                8629
            ],
            [
                8629,
                8669
            ],
            [
                8669,
                8714
            ],
            [
                8714,
                8745
            ],
            [
                8757,
                8758
            ],
            [
                8746,
                8757
            ],
            [
                8797,
                8823
            ],
            [
                8824,
                8827
            ],
            [
                8829,
                8848
            ],
            [
                8902,
                8913
            ],
            [
                8850,
                8862
            ],
            [
                8917,
                8935
            ],
            [
                8950,
                9003
            ],
            [
                9052,
                9087
            ],
            [
                9102,
                9125
            ],
            [
                9125,
                9128
            ],
            [
                9134,
                9141
            ],
            [
                9145,
                9159
            ],
            [
                9159,
                9244
            ],
            [
                9244,
                9255
            ],
            [
                9261,
                9286
            ],
            [
                9430,
                9432
            ],
            [
                9292,
                9302
            ],
            [
                9310,
                9326
            ],
            [
                9347,
                9380
            ],
            [
                9422,
                9429
            ],
            [
                9435,
                9580
            ],
            [
                9586,
                9647
            ],
            [
                9647,
                9692
            ],
            [
                9739,
                9763
            ],
            [
                9765,
                9771
            ],
            [
                9792,
                9948
            ],
            [
                9952,
                9975
            ],
            [
                9989,
                10092
            ],
            [
                10106,
                10126
            ],
            [
                10184,
                10190
            ],
            [
                10133,
                10136
            ],
            [
                10191,
                10239
            ],
            [
                10239,
                10388
            ],
            [
                10474,
                10479
            ],
            [
                10463,
                10468
            ],
            [
                10388,
                10443
            ],
            [
                10479,
                10549
            ],
            [
                10448,
                10451
            ],
            [
                10562,
                10564
            ],
            [
                10564,
                10620
            ],
            [
                10620,
                10648
            ],
            [
                10716,
                10749
            ],
            [
                10751,
                10755
            ],
            [
                10767,
                10782
            ],
            [
                10782,
                10815
            ],
            [
                10815,
                10855
            ],
            [
                10976,
                10977
            ],
            [
                10917,
                10924
            ],
            [
                10966,
                10976
            ],
            [
                10994,
                11015
            ],
            [
                11056,
                11058
            ],
            [
                11058,
                11082
            ],
            [
                11082,
                11097
            ],
            [
                11105,
                11149
            ],
            [
                11155,
                11171
            ],
            [
                11176,
                11218
            ],
            [
                11296,
                11298
            ],
            [
                11298,
                11300
            ],
            [
                11302,
                11305
            ],
            [
                11307,
                11313
            ],
            [
                11313,
                11375
            ],
            [
                11384,
                11433
            ],
            [
                11433,
                11452
            ],
            [
                11468,
                11502
            ],
            [
                11517,
                11521
            ],
            [
                11547,
                11641
            ],
            [
                11704,
                11736
            ],
            [
                11738,
                11754
            ],
            [
                11830,
                11921
            ],
            [
                11932,
                11977
            ],
            [
                12053,
                12217
            ],
            [
                12217,
                12301
            ],
            [
                12350,
                12428
            ],
            [
                12428,
                12454
            ],
            [
                12454,
                12481
            ],
            [
                12513,
                12555
            ],
            [
                12563,
                12600
            ],
            [
                12614,
                12660
            ],
            [
                12684,
                12687
            ],
            [
                12700,
                12760
            ],
            [
                12766,
                12796
            ],
            [
                12815,
                12823
            ],
            [
                12828,
                12835
            ],
            [
                12797,
                12811
            ],
            [
                12837,
                12847
            ],
            [
                12866,
                12921
            ],
            [
                12922,
                12979
            ],
            [
                12979,
                13019
            ],
            [
                13040,
                13102
            ],
            [
                13116,
                13174
            ],
            [
                13184,
                13200
            ],
            [
                13201,
                13262
            ],
            [
                13262,
                13298
            ],
            [
                13298,
                13346
            ],
            [
                13346,
                13396
            ],
            [
                13396,
                13415
            ],
            [
                13415,
                13444
            ],
            [
                13444,
                13462
            ],
            [
                13473,
                13547
            ],
            [
                13547,
                13591
            ],
            [
                13604,
                13638
            ],
            [
                13638,
                13669
            ],
            [
                13669,
                13709
            ],
            [
                13709,
                13747
            ],
            [
                13756,
                13765
            ],
            [
                13780,
                13976
            ],
            [
                14010,
                14102
            ],
            [
                14102,
                14131
            ],
            [
                14131,
                14186
            ],
            [
                14202,
                14203
            ],
            [
                14215,
                14224
            ],
            [
                14238,
                14240
            ],
            [
                14240,
                14264
            ],
            [
                14290,
                14313
            ],
            [
                14313,
                14342
            ],
            [
                14342,
                14417
            ],
            [
                14417,
                14434
            ],
            [
                14434,
                14507
            ],
            [
                14507,
                14565
            ],
            [
                14565,
                14632
            ],
            [
                14632,
                14643
            ],
            [
                14666,
                14674
            ],
            [
                14753,
                14838
            ],
            [
                14838,
                14886
            ],
            [
                14897,
                14899
            ],
            [
                14899,
                15040
            ],
            [
                15040,
                15042
            ],
            [
                15048,
                15050
            ],
            [
                15050,
                15134
            ],
            [
                15134,
                15142
            ],
            [
                15168,
                15170
            ],
            [
                15170,
                15196
            ],
            [
                15241,
                15265
            ],
            [
                15229,
                15230
            ],
            [
                15267,
                15319
            ],
            [
                15319,
                15352
            ],
            [
                15352,
                15392
            ],
            [
                15392,
                15466
            ],
            [
                15466,
                15533
            ],
            [
                15533,
                15646
            ],
            [
                15652,
                15670
            ],
            [
                15670,
                15703
            ],
            [
                15703,
                15760
            ],
            [
                15760,
                15787
            ],
            [
                15787,
                15809
            ],
            [
                15809,
                15810
            ],
            [
                15846,
                15880
            ],
            [
                15893,
                15961
            ],
            [
                15961,
                16040
            ],
            [
                16048,
                16090
            ],
            [
                16104,
                16135
            ],
            [
                16135,
                16156
            ],
            [
                16156,
                16169
            ],
            [
                16169,
                16196
            ],
            [
                16196,
                16321
            ],
            [
                16326,
                16357
            ],
            [
                16357,
                16428
            ],
            [
                16428,
                16535
            ],
            [
                16535,
                16572
            ],
            [
                16572,
                16597
            ],
            [
                16597,
                16618
            ],
            [
                16618,
                16627
            ],
            [
                16627,
                16653
            ],
            [
                16653,
                16669
            ],
            [
                16693,
                16730
            ],
            [
                16730,
                16749
            ],
            [
                16749,
                16775
            ],
            [
                16775,
                16792
            ],
            [
                16792,
                16824
            ],
            [
                16824,
                16879
            ],
            [
                16879,
                17062
            ],
            [
                17062,
                17171
            ],
            [
                17171,
                17202
            ],
            [
                17356,
                17429
            ],
            [
                17439,
                17445
            ],
            [
                17445,
                17512
            ],
            [
                17512,
                17529
            ],
            [
                17529,
                17634
            ],
            [
                17667,
                17682
            ],
            [
                17683,
                17699
            ],
            [
                17699,
                17729
            ],
            [
                17729,
                17755
            ],
            [
                17761,
                17858
            ],
            [
                17858,
                17917
            ],
            [
                17917,
                17972
            ],
            [
                17973,
                18136
            ],
            [
                18136,
                18159
            ],
            [
                18159,
                18183
            ],
            [
                18185,
                18187
            ],
            [
                18189,
                18236
            ],
            [
                18296,
                18298
            ],
            [
                18298,
                18310
            ],
            [
                18331,
                18418
            ],
            [
                18444,
                18517
            ],
            [
                18517,
                18575
            ],
            [
                18614,
                18691
            ],
            [
                18706,
                18721
            ],
            [
                18734,
                18765
            ],
            [
                18765,
                18810
            ],
            [
                18863,
                18909
            ],
            [
                18909,
                18918
            ],
            [
                18939,
                19071
            ],
            [
                19071,
                19113
            ],
            [
                19113,
                19136
            ],
            [
                19141,
                19262
            ],
            [
                19262,
                19436
            ],
            [
                19437,
                19478
            ],
            [
                19478,
                19535
            ],
            [
                19535,
                19587
            ],
            [
                19587,
                19845
            ],
            [
                19845,
                19862
            ],
            [
                19899,
                19903
            ],
            [
                19919,
                19954
            ],
            [
                19990,
                19997
            ],
            [
                20033,
                20088
            ],
            [
                20088,
                20153
            ],
            [
                20298,
                20403
            ],
            [
                20417,
                20441
            ],
            [
                20464,
                20477
            ],
            [
                20493,
                20529
            ],
            [
                20543,
                20804
            ],
            [
                20833,
                20915
            ],
            [
                20933,
                20958
            ],
            [
                20958,
                21028
            ],
            [
                21043,
                21051
            ],
            [
                21053,
                21069
            ],
            [
                21094,
                21112
            ],
            [
                21112,
                21120
            ],
            [
                21126,
                21127
            ],
            [
                21151,
                21353
            ],
            [
                21354,
                21361
            ],
            [
                21375,
                21389
            ],
            [
                21362,
                21373
            ],
            [
                21392,
                21444
            ],
            [
                21461,
                21491
            ],
            [
                21491,
                21498
            ],
            [
                21523,
                21556
            ],
            [
                21586,
                21612
            ],
            [
                21612,
                21745
            ],
            [
                21747,
                21776
            ],
            [
                21776,
                21813
            ],
            [
                21840,
                21892
            ],
            [
                21892,
                21925
            ],
            [
                21925,
                21981
            ],
            [
                22000,
                22065
            ],
            [
                22101,
                22143
            ],
            [
                22143,
                22227
            ],
            [
                22227,
                22228
            ],
            [
                22234,
                22238
            ],
            [
                22249,
                22321
            ],
            [
                22327,
                22394
            ],
            [
                22404,
                22413
            ],
            [
                22398,
                22403
            ],
            [
                22414,
                22495
            ],
            [
                22501,
                22528
            ],
            [
                22528,
                22597
            ],
            [
                22622,
                22636
            ],
            [
                22637,
                22642
            ],
            [
                22642,
                22838
            ],
            [
                22838,
                22849
            ],
            [
                22894,
                22915
            ],
            [
                22915,
                23059
            ],
            [
                23059,
                23097
            ],
            [
                23097,
                23123
            ],
            [
                23163,
                23201
            ],
            [
                23201,
                23264
            ],
            [
                23264,
                23267
            ],
            [
                23315,
                23348
            ],
            [
                23350,
                23353
            ],
            [
                23355,
                23361
            ],
            [
                23361,
                23469
            ],
            [
                23481,
                23524
            ],
            [
                23524,
                23528
            ],
            [
                23542,
                23583
            ],
            [
                23589,
                23739
            ],
            [
                23740,
                23783
            ],
            [
                23794,
                23916
            ],
            [
                23932,
                23954
            ],
            [
                23964,
                23980
            ],
            [
                23980,
                24005
            ],
            [
                24016,
                24018
            ],
            [
                24018,
                24050
            ],
            [
                24050,
                24168
            ],
            [
                24183,
                24213
            ],
            [
                24213,
                24280
            ],
            [
                24308,
                24317
            ],
            [
                24295,
                24302
            ],
            [
                24318,
                24325
            ],
            [
                24327,
                24347
            ],
            [
                24353,
                24410
            ],
            [
                24412,
                24416
            ],
            [
                24418,
                24509
            ],
            [
                24510,
                24605
            ],
            [
                24618,
                24638
            ],
            [
                24640,
                24691
            ],
            [
                24691,
                24713
            ],
            [
                24732,
                24764
            ],
            [
                24781,
                24888
            ],
            [
                24922,
                24925
            ],
            [
                24891,
                24894
            ],
            [
                24899,
                24909
            ],
            [
                24942,
                24944
            ],
            [
                24944,
                24970
            ],
            [
                24976,
                24995
            ]
        ],
        "row_chars": [
            [
                0,
                86
            ],
            [
                86,
                169
            ],
            [
                169,
                372
            ],
            [
                372,
                460
            ],
            [
                460,
                653
            ],
            [
                653,
                828
            ],
            [
                828,
                893
            ],
            [
                893,
                1034
            ],
            [
                1034,
                1097
            ],
            [
                1097,
                1361
            ],
            [
                1361,
                1423
            ],
            [
                1423,
                1450
            ],
            [
                1450,
                1615
            ],
            [
                1615,
                1674
            ],
            [
                1674,
                2172
            ],
            [
                2172,
                2756
            ],
            [
                2756,
                2856
            ],
            [
                2856,
                2988
            ],
            [
                2988,
                3072
            ],
            [
                3072,
                3346
            ],
            [
                3346,
                3405
            ],
            [
                3405,
                3709
            ],
            [
                3709,
                4044
            ],
            [
                4044,
                4316
            ],
            [
                4316,
                4378
            ],
            [
                4378,
                4802
            ],
            [
                4802,
                5239
            ],
            [
                5239,
                5520
            ],
            [
                5520,
                5730
            ],
            [
                5730,
                5796
            ],
            [
                5796,
                6030
            ],
            [
                6030,
                6105
            ],
            [
                6105,
                6284
            ],
            [
                6284,
                6334
            ],
            [
                6334,
                6459
            ],
            [
                6459,
                6734
            ],
            [
                6734,
                6779
            ],
            [
                6779,
                7205
            ],
            [
                7205,
                7374
            ],
            [
                7374,
                7431
            ],
            [
                7431,
                7517
            ],
            [
                7517,
                7930
            ],
            [
                7930,
                7951
            ],
            [
                7951,
                7998
            ],
            [
                7998,
                8252
            ],
            [
                8252,
                8529
            ],
            [
                8529,
                8596
            ],
            [
                8596,
                8629
            ],
            [
                8629,
                8669
            ],
            [
                8669,
                8714
            ],
            [
                8714,
                8823
            ],
            [
                8823,
                9003
            ],
            [
                9003,
                9125
            ],
            [
                9125,
                9159
            ],
            [
                9159,
                9244
            ],
            [
                9244,
                9647
            ],
            [
                9647,
                10127
            ],
            [
                10127,
                10239
            ],
            [
                10239,
                10388
            ],
            [
                10388,
                10564
            ],
            [
                10564,
                10620
            ],
            [
                10620,
                10782
            ],
            [
                10782,
                10815
            ],
            [
                10815,
                11058
            ],
            [
                11058,
                11082
            ],
            [
                11082,
                11149
            ],
            [
                11149,
                11298
            ],
            [
                11298,
                11313
            ],
            [
                11313,
                11433
            ],
            [
                11433,
                12217
            ],
            [
                12217,
                12428
            ],
            [
                12428,
                12454
            ],
            [
                12454,
                12481
            ],
            [
                12481,
                12513
            ],
            [
                12513,
                12922
            ],
            [
                12922,
                12979
            ],
            [
                12979,
                13201
            ],
            [
                13201,
                13262
            ],
            [
                13262,
                13298
            ],
            [
                13298,
                13346
            ],
            [
                13346,
                13396
            ],
            [
                13396,
                13415
            ],
            [
                13415,
                13444
            ],
            [
                13444,
                13547
            ],
            [
                13547,
                13638
            ],
            [
                13638,
                13669
            ],
            [
                13669,
                13709
            ],
            [
                13709,
                13765
            ],
            [
                13765,
                14102
            ],
            [
                14102,
                14131
            ],
            [
                14131,
                14240
            ],
            [
                14240,
                14313
            ],
            [
                14313,
                14342
            ],
            [
                14342,
                14417
            ],
            [
                14417,
                14434
            ],
            [
                14434,
                14507
            ],
            [
                14507,
                14565
            ],
            [
                14565,
                14632
            ],
            [
                14632,
                14838
            ],
            [
                14838,
                14899
            ],
            [
                14899,
                15040
            ],
            [
                15040,
                15050
            ],
            [
                15050,
                15134
            ],
            [
                15134,
                15170
            ],
            [
                15170,
                15196
            ],
            [
                15196,
                15319
            ],
            [
                15319,
                15352
            ],
            [
                15352,
                15392
            ],
            [
                15392,
                15466
            ],
            [
                15466,
                15533
            ],
            [
                15533,
                15670
            ],
            [
                15670,
                15703
            ],
            [
                15703,
                15760
            ],
            [
                15760,
                15787
            ],
            [
                15787,
                15809
            ],
            [
                15809,
                15961
            ],
            [
                15961,
                16135
            ],
            [
                16135,
                16156
            ],
            [
                16156,
                16169
            ],
            [
                16169,
                16196
            ],
            [
                16196,
                16357
            ],
            [
                16357,
                16428
            ],
            [
                16428,
                16535
            ],
            [
                16535,
                16572
            ],
            [
                16572,
                16597
            ],
            [
                16597,
                16618
            ],
            [
                16618,
                16627
            ],
            [
                16627,
                16653
            ],
            [
                16653,
                16730
            ],
            [
                16730,
                16749
            ],
            [
                16749,
                16775
            ],
            [
                16775,
                16792
            ],
            [
                16792,
                16824
            ],
            [
                16824,
                16879
            ],
            [
                16879,
                17062
            ],
            [
                17062,
                17171
            ],
            [
                17171,
                17202
            ],
            [
                17202,
                17356
            ],
            [
                17356,
                17445
            ],
            [
                17445,
                17512
            ],
            [
                17512,
                17529
            ],
            [
                17529,
                17634
            ],
            [
                17634,
                17650
            ],
            [
                17650,
                17661
            ],
            [
                17661,
                17699
            ],
            [
                17699,
                17729
            ],
            [
                17729,
                17755
            ],
            [
                17755,
                17858
            ],
            [
                17858,
                17917
            ],
            [
                17917,
                17973
            ],
            [
                17973,
                18136
            ],
            [
                18136,
                18159
            ],
            [
                18159,
                18298
            ],
            [
                18298,
                18517
            ],
            [
                18517,
                18765
            ],
            [
                18765,
                18810
            ],
            [
                18810,
                18863
            ],
            [
                18863,
                18909
            ],
            [
                18909,
                19071
            ],
            [
                19071,
                19113
            ],
            [
                19113,
                19262
            ],
            [
                19262,
                19437
            ],
            [
                19437,
                19478
            ],
            [
                19478,
                19535
            ],
            [
                19535,
                19587
            ],
            [
                19587,
                19845
            ],
            [
                19845,
                20088
            ],
            [
                20088,
                20958
            ],
            [
                20958,
                21112
            ],
            [
                21112,
                21354
            ],
            [
                21354,
                21491
            ],
            [
                21491,
                21556
            ],
            [
                21556,
                21586
            ],
            [
                21586,
                21612
            ],
            [
                21612,
                21776
            ],
            [
                21776,
                21813
            ],
            [
                21813,
                21892
            ],
            [
                21892,
                21925
            ],
            [
                21925,
                22143
            ],
            [
                22143,
                22227
            ],
            [
                22227,
                22528
            ],
            [
                22528,
                22597
            ],
            [
                22597,
                22602
            ],
            [
                22602,
                22622
            ],
            [
                22622,
                22637
            ],
            [
                22637,
                22642
            ],
            [
                22642,
                22838
            ],
            [
                22838,
                22915
            ],
            [
                22915,
                23059
            ],
            [
                23059,
                23097
            ],
            [
                23097,
                23123
            ],
            [
                23123,
                23163
            ],
            [
                23163,
                23201
            ],
            [
                23201,
                23264
            ],
            [
                23264,
                23361
            ],
            [
                23361,
                23524
            ],
            [
                23524,
                23740
            ],
            [
                23740,
                23980
            ],
            [
                23980,
                24018
            ],
            [
                24018,
                24050
            ],
            [
                24050,
                24213
            ],
            [
                24213,
                24510
            ],
            [
                24510,
                24691
            ],
            [
                24691,
                24944
            ],
            [
                24944,
                24995
            ]
        ]
    },
    "abridged": {
        "text": "It had been a miserable group at Mansfield. Mrs. Norris, as most attached to Maria, was really the greatest sufferer. Maria was her first favourite; the match had been her own contriving, and this conclusion of it almost overpowered her.\nShe was an altered creature, quiet, stupefied, indifferent to everything that passed. She had been unable to direct or dictate, or even fancy herself useful. When really afflicted, her active powers had been all benumbed; and neither Lady Bertram nor Tom had received from her the smallest support. She had done no more for them than they had done for each other. They had been all solitary, helpless, and forlorn alike. Her companions were now relieved, but there was no good for her. Edmund was almost as welcome to his brother as Fanny was to her aunt; but Mrs. Norris was irritated by the sight of the person whom, in blind anger, she could have blamed as the daemon of the piece. Had Fanny accepted Mr. Crawford this could not have happened.\nSusan too was a grievance. Mrs. Norris had not spirits to notice her much, but she felt her as a spy, an intruder, and everything most odious. By her other aunt, Susan was received with quiet kindness. Lady Bertram could not give her many words, but she was ready to kiss and like her; and Susan was satisfied; for she was so happy in her escape from many certain evils, that she could have stood against a great deal more indifference than she met with.\nShe was now left a good deal to herself, to get acquainted with the house and grounds as she could, and spent her days very happily in so doing, while those who might otherwise have attended to her were shut up, or wholly occupied with each other; Edmund trying to bury his own feelings in exertions for the relief of his brother's, and Fanny devoted to her aunt Bertram, and thinking she could never do enough for one who seemed so much to want her.\nTo talk over the dreadful business with Fanny, talk and lament, was all Lady Bertram's consolation. To listen and give her kindness and sympathy in return, was all that could be done for her. The case admitted of no other comfort. Lady Bertram did not think deeply, but, guided by Sir Thomas, she thought justly on all important points; and she saw, therefore, in all its enormity, what had happened, and neither endeavoured herself, nor required Fanny to advise her, to think little of guilt and infamy.\nAfter a time, Fanny found it possible to direct her thoughts to other subjects, and revive some interest in her usual occupations; but whenever Lady Bertram thought of the event, she could see it only in one light, as comprehending the loss of a daughter, and a disgrace never to be wiped off.\nFanny learnt from her all the particulars; and with the help of some letters to and from Sir Thomas, she was soon able to understand quite as much as she wished of the circumstances attending the story.\nMrs. Rushworth had gone, for the Easter holidays, to Twickenham, with a family whom she had grown intimate with: a family of lively, agreeable manners, and probably of morals and discretion to suit, for to their house Mr. Crawford had constant access at all times. Mr. Rushworth had been gone at this time to Bath, to pass a few days with his mother, and bring her back to town, and Maria was with these friends without any restraint, without even Julia; for Julia had removed from Wimpole Street two or three weeks before, on a visit to some relations of Sir Thomas; a removal which her father and mother were now disposed to attribute to Mr. Yates's account.\nVery soon after the Rushworths' return to Wimpole Street, Sir Thomas had received a letter from an old friend in London, who hearing and witnessing a good deal to alarm him in that quarter, wrote to advise Sir Thomas to come to London himself, and use his influence with his daughter to put an end to the intimacy which was already exposing her to unpleasant remarks, and evidently making Mr. Rushworth uneasy.\nSir Thomas was preparing to act upon this letter, when it was followed by another, sent express from the same friend, to break to him the almost desperate situation in which affairs then stood. Mrs. Rushworth had left her husband's house: Mr. Rushworth had been in great anger and distress to him (Mr. Harding) for his advice; Mr. Harding feared there had been at least very flagrant indiscretion. The maidservant of Mrs. Rushworth, senior, threatened alarmingly. He was doing all in his power to quiet everything, with the hope of Mrs. Rushworth's return, but was so much counteracted in Wimpole Street by the influence of Mr. Rushworth's mother, that the worst consequences might be feared.\nThis dreadful communication could not be kept from the rest of the family. Sir Thomas set off with Edmund, and the others had been left in a state of wretchedness, made worse by the receipt of the next letters from London.\nEverything was by that time public beyond a hope. The servant of Mrs. Rushworth, the mother, had exposure in her power, and supported by her mistress, was not to be silenced. The two Mrs. Rushworths, even in the short time they had been together, had disagreed; the bitterness of the elder against her daughter-in-law arising as much from the personal disrespect with which she had been treated as from her feelings for her son.\nShe was unmanageable. But had she been less obstinate, the case would still have been hopeless, for Maria did not appear again, and there was every reason to conclude her to be concealed somewhere with Mr. Crawford, who had quitted his uncle's house on the very day of her absenting herself.\nSir Thomas, however, remained a little longer in town, in the hope of discovering and snatching her from further vice, though all was lost on the side of character.\nHis present state Fanny could hardly bear to think of. There was only one of his children who was not at this time a source of misery to him. Tom's illness had been so heightened by the shock of his sister's conduct, that even Lady Bertram had been struck by the difference, and all her alarms were regularly sent off to her husband; and Julia's elopement, the additional blow, though its force had been deadened at the moment, must, she knew, be sorely felt. His letters expressed how much he deplored it. Under any circumstances it would have been an unwelcome alliance; but to have it so clandestinely formed, and at such a time, placed Julia in a most unfavourable light. He called it a bad thing, done in the worst manner, and at the worst time; and though Julia's act was more pardonable than Maria's, as folly rather than vice, he regarded it as probable that her state would end up like her sister's. Such was his opinion of the set into which she had thrown herself.\nFanny felt for him most acutely. He could have no comfort but in Edmund. Every other child must be racking his heart. His displeasure against herself, she trusted, would now be done away. She should be justified in refusing Mr. Crawford; but this, though important to herself, would be poor consolation to Sir Thomas. What could her justification or her attachment do for him? His support must be Edmund alone.\nShe was mistaken, however, in supposing that Edmund gave his father no present pain. It was of a less poignant nature than that caused by the others; but Sir Thomas considered Edmund's happiness as very deeply involved, cut off, as he must be, from the woman whom he had been pursuing with undoubted attachment and strong probability of success; and who, in everything but her despicable brother, would have been so eligible a connexion. He was aware of what Edmund must be suffering, when they were in town. He had guessed his feelings; and, having reason to think that one interview with Miss Crawford had taken place, from which Edmund derived only increased distress, had been anxious on that account to get him out of town, and had engaged him in taking Fanny home to her aunt, with a view to his relief no less than theirs.\nSir Thomas was not in the secret of Miss Crawford's character. Had he been privy to her conversation with his son, he would not have wished her to belong to him, though her twenty thousand pounds had been forty.\nFanny had no doubt that Edmund must be for ever divided from Miss Crawford; and yet, till she knew that he felt the same, her own conviction was not enough. She thought he did, but she wanted to be assured of it. If he would now speak to her, it would be most consoling; but that was not to be. She seldom saw him: never alone. He probably avoided being alone with her, his own affliction being too keenly felt to be communicated. This must be his state. He yielded, but with agonies which did not admit of speech. Long would it be before Miss Crawford's name passed his lips again.\nIt was long. They reached Mansfield on Thursday, and it was not till Sunday that Edmund began to talk to her on the subject. Sitting with her on a wet Sunday evening-the very time when the heart must be opened, and everything told; no one else in the room, except his mother, who was asleep, it was impossible not to speak. And so, with the declaration that if she would listen to him for a few minutes, he should be very brief, and never tax her kindness in the same way again; he entered upon the luxury of relating circumstances and sensations of the first interest to himself, to one of whose affectionate sympathy he was quite convinced.\nHow Fanny listened, with what curiosity and concern, what pain and what delight, how carefully her own eyes were fixed on any object but himself, may be imagined. The opening was alarming. He had seen Miss Crawford. He had received a note from Lady Stornaway begging him to call; and regarding it as what must be the last, last interview of friendship, and imagining the shame and wretchedness which Crawford's sister ought to have felt, he had gone to her in such a softened and devoted state of mind, as made it impossible to Fanny's fears that it should be the last.\nBut as he proceeded in his story, these fears were over. She had met him, he said, with a serious, even an agitated air; but before he had been able to speak one sentence, she had introduced the subject in a manner which had shocked him.\n\"'I heard you were in town,' said she; 'I wanted to see you. Let us talk over this sad business. What can equal the folly of our two relations?' I could not answer, but I believe my looks spoke. She felt reproved. Sometimes how quick to feel! With a graver look she then added, 'I do not mean to defend Henry at your sister's expense.' So she began, but how she went on, Fanny, is hardly fit to be repeated to you. I cannot recall all her words. I would not dwell upon them if I could. Their substance was great anger at the folly of each. Her brother's folly in being drawn on by a woman whom he had never cared for, to do what must lose him the woman he adored; but still more the folly of poor Maria, in sacrificing such a situation, under the idea of being really loved by a man who had long ago made his indifference clear. Guess what I must have felt. To hear the woman whom-no harsher name than folly given, and so coolly! No reluctance, no horror, no modest loathings? This is what the world does. For where, Fanny, shall we find a woman whom nature had so richly endowed? Spoilt, spoilt!\"\nAfter a little reflection, he went on with a sort of desperate calmness. \"I will tell you everything, and then have done for ever. She saw it only as folly, and that folly stamped only by exposure. The want of caution: Maria's putting herself in the power of a servant; it was the detection, in short-oh, Fanny! it was the detection, not the offence, which she deplored. It was the imprudence which had brought things to extremity, and obliged her brother to give up every dearer plan in order to fly with her.\"\nHe stopped. \"And what,\" said Fanny (believing herself required to speak), \"what could you say?\"\n\"Nothing. I was like a man stunned. She began to talk of you; regretting, as well she might, the loss of such a-. There she spoke very rationally. But she has always done justice to you. 'He has thrown away,' said she, 'such a woman as he will never see again. She would have fixed him; she would have made him happy for ever.' My dearest Fanny, I am giving you, I hope, more pleasure than pain by this retrospect of what might have been-but never can be now. You do not wish me to be silent? If you do, give me but a look, a word, and I have done.\"\nNo look or word was given.\n\"Thank God,\" said he. \"It seems to have been the merciful gift of Providence that the heart which knew no guile should not suffer. She spoke of you with high praise and warm affection; yet, even here, there was a dash of evil; for in the midst of it she exclaimed, 'Why would not she have him? It is all her fault. Simple girl! I shall never forgive her. Had she accepted him as she ought, they might now have been on the point of marriage, and Henry would have been too happy and busy to want any other object. He would have taken no pains to be on terms with Mrs. Rushworth again. It would have all ended in a regular standing flirtation, in yearly meetings at Sotherton and Everingham.' Could you have believed it possible? But the charm is broken. My eyes are opened.\"\n\"Cruel!\" said Fanny, \"quite cruel. At such a moment to speak with lightness, and to you! Absolute cruelty.\"\n\"Cruelty, do you call it? We differ there. No, hers is not a cruel nature. I do not consider her as meaning to wound my feelings. The evil lies yet deeper: in her total ignorance, unsuspiciousness of there being such feelings; in a perversion of mind which made it natural to her to treat the subject as she did. She was speaking only as she had been used to hear others speak, as she imagined everybody else would speak. Hers are not faults of temper. Hers are faults of principle, Fanny; of blunted delicacy and a corrupted, damaged mind. Perhaps it is best for me, since it leaves me so little to regret. Not so, however. Gladly would I submit to all the increased pain of losing her, rather than have to think of her as I do. When I left her, I told her so.\"\n\"How long were you together?\"\n\"Five-and-twenty minutes. She went on to say that what remained now to be done was to bring about a marriage between them. She spoke of it, Fanny, with a steadier voice than I can.\" He was obliged to pause more than once as he continued.\n\"'We must persuade Henry to marry her,' said she; 'and what with honour, and the certainty of having shut himself out for ever from Fanny, I do not despair of it. Fanny he must give up. I do not think that even he could now hope to succeed with one of her stamp. My influence shall all go that way; and when once married, and properly supported by her own family, respectable as they are, she may recover her footing in society to a certain degree. In some circles, we know, she would never be admitted, but there will always be those who will be glad of her acquaintance; and there is more liberality on those points than formerly. What I advise is, that your father be quiet. Persuade him to let things take their course. If by any interference of his, she is induced to leave Henry's protection, there will be much less chance of his marrying her than if she remain with him. I know how he is likely to be influenced. Let Sir Thomas trust to Henry's honour and compassion, and it may all end well; but if he get his daughter away, it will be destroying the chief hold.'\"\nAfter repeating this, Edmund was so much affected that Fanny, watching him with silent, but most tender concern, was almost sorry that the subject had been entered on at all.\nIt was long before he could speak again. At last, \"Now, Fanny,\" said he, \"I shall soon have done. I have told you the substance of all that she said. As soon as I could speak, I replied that I had not supposed it possible, coming in such a state of mind into that house as I had done, that anything could occur to make me suffer more, but that she had been inflicting deeper wounds in almost every sentence. That though I had been aware of some difference in our opinions, I had not imagined that the difference could be such as she had now proved it. That the manner in which she treated the dreadful crime committed, giving it every reproach but the right; considering its ill consequences only as they were to be braved by a defiance of decency; and last of all, recommending to us a compliance, an acquiescence in the continuance of the sin, on the chance of a marriage which, thinking as I now thought of her brother, should rather be prevented than sought; all this together most grievously convinced me that I had never understood her before, and that it had been the creature of my own imagination, not Miss Crawford, that I had been dwelling on for many months past. That, perhaps, it was best for me; I had less to regret in sacrificing feelings and hopes which must be torn from me now. And yet, I confessed that, could I have restored her to what she had appeared to me before, I would infinitely prefer any increase of the pain of parting, for the sake of carrying with me the right of tenderness and esteem.\n\"This is the purport of what I said; but, as you may imagine, not spoken so collectedly as I have repeated it to you. She was astonished-more than astonished. She turned extremely red. I imagined I saw a mixture of many feelings: a great, though short struggle; half a wish of yielding to truths, half a sense of shame; but habit, habit carried it. She would have laughed if she could. She answered, 'A pretty good lecture, upon my word. Was it part of your last sermon? At this rate you will soon reform everybody at Mansfield; and when I hear of you next, it may be as a celebrated preacher, or as a missionary into foreign parts.' She tried to speak carelessly, but she was not so careless as she wanted to appear. I said that from my heart I wished her well, and earnestly hoped that she might learn to think more justly, and not owe the most valuable knowledge any of us could acquire, the knowledge of ourselves and of our duty, to the lessons of affliction. I immediately left the room. I had gone a few steps, Fanny, when I heard the door open behind me. I looked back.\n'Mr. Bertram,' said she, with a smile; but it was a smile ill-suited to the conversation that had passed, a saucy playful smile, seeming to invite in order to subdue me; at least it appeared so to me. I resisted; and still walked on. I have since, sometimes, for a moment, regretted that I did not go back, but I know I was right, and such has been the end of our acquaintance. And what an acquaintance has it been! How have I been deceived! I thank you for your patience, Fanny. This has been the greatest relief, and now we will have done.\"\nAnd for five minutes she thought they had done. Then, however, it all came on again, or something very like it, and nothing less than Lady Bertram's rousing up could really close such a conversation. Till then, they continued to talk of Miss Crawford, and how she had attached him, and how delightful nature had made her, and how excellent she would have been, had she fallen into good hands earlier.\nFanny, now at liberty to speak openly, felt justified in adding to his knowledge of her real character, by some hint of what share his brother's state of health might have in her wish for a reconciliation. This was not an agreeable idea. Nature resisted it for a while. It would have been a vast deal pleasanter to have had her more disinterested in her attachment; but his vanity was not strong enough to fight long against reason. He submitted to believe that Tom's illness had influenced her, only consoling himself with the thought that considering the counteractions of opposing habits, she had certainly been more attached to him than could have been expected, and for his sake been more near doing right.\nFanny thought exactly the same; and they were also quite agreed in their opinion of the lasting and indelible impression which such a disappointment must make on his mind. Time would undoubtedly lessen his sufferings, but still it was something which he never could get entirely the better of; and as to his ever meeting with any other woman who could-but that was impossible. Fanny's friendship was all he had to cling to.",
        "paragraph_chars": [
            [
                0,
                238
            ],
            [
                238,
                985
            ],
            [
                985,
                1440
            ],
            [
                1440,
                1891
            ],
            [
                1891,
                2396
            ],
            [
                2396,
                2690
            ],
            [
                2690,
                2893
            ],
            [
                2893,
                3554
            ],
            [
                3554,
                3965
            ],
            [
                3965,
                4658
            ],
            [
                4658,
                4881
            ],
            [
                4881,
                5310
            ],
            [
                5310,
                5602
            ],
            [
                5602,
                5767
            ],
            [
                5767,
                6743
            ],
            [
                6743,
                7154
            ],
            [
                7154,
                7984
            ],
            [
                7984,
                8196
            ],
            [
                8196,
                8779
            ],
            [
                8779,
                9422
            ],
            [
                9422,
                9992
            ],
            [
                9992,
                10230
            ],
            [
                10230,
                11328
            ],
            [
                11328,
                11840
            ],
            [
                11840,
                11936
            ],
            [
                11936,
                12486
            ],
            [
                12486,
                12513
            ],
            [
                12513,
                13286
            ],
            [
                13286,
                13394
            ],
            [
                13394,
                14157
            ],
            [
                14157,
                14187
            ],
            [
                14187,
                14425
            ],
            [
                14425,
                15499
            ],
            [
                15499,
                15674
            ],
            [
                15674,
                17196
            ],
            [
                17196,
                18274
            ],
            [
                18274,
                18817
            ],
            [
                18817,
                19218
            ],
            [
                19218,
                19930
            ],
            [
                19930,
                20353
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                118
            ],
            [
                118,
                238
            ],
            [
                238,
                324
            ],
            [
                324,
                396
            ],
            [
                396,
                537
            ],
            [
                537,
                602
            ],
            [
                602,
                659
            ],
            [
                659,
                724
            ],
            [
                724,
                923
            ],
            [
                923,
                985
            ],
            [
                985,
                1012
            ],
            [
                1012,
                1128
            ],
            [
                1128,
                1187
            ],
            [
                1187,
                1440
            ],
            [
                1440,
                1891
            ],
            [
                1891,
                1991
            ],
            [
                1991,
                2083
            ],
            [
                2083,
                2122
            ],
            [
                2122,
                2396
            ],
            [
                2396,
                2690
            ],
            [
                2690,
                2893
            ],
            [
                2893,
                3158
            ],
            [
                3158,
                3554
            ],
            [
                3554,
                3965
            ],
            [
                3965,
                4159
            ],
            [
                4159,
                4363
            ],
            [
                4363,
                4429
            ],
            [
                4429,
                4658
            ],
            [
                4658,
                4733
            ],
            [
                4733,
                4881
            ],
            [
                4881,
                4931
            ],
            [
                4931,
                5056
            ],
            [
                5056,
                5310
            ],
            [
                5310,
                5332
            ],
            [
                5332,
                5602
            ],
            [
                5602,
                5767
            ],
            [
                5767,
                5822
            ],
            [
                5822,
                5909
            ],
            [
                5909,
                6227
            ],
            [
                6227,
                6274
            ],
            [
                6274,
                6443
            ],
            [
                6443,
                6676
            ],
            [
                6676,
                6743
            ],
            [
                6743,
                6776
            ],
            [
                6776,
                6816
            ],
            [
                6816,
                6861
            ],
            [
                6861,
                6931
            ],
            [
                6931,
                7061
            ],
            [
                7061,
                7120
            ],
            [
                7120,
                7154
            ],
            [
                7154,
                7239
            ],
            [
                7239,
                7592
            ],
            [
                7592,
                7663
            ],
            [
                7663,
                7984
            ],
            [
                7984,
                8047
            ],
            [
                8047,
                8196
            ],
            [
                8196,
                8353
            ],
            [
                8353,
                8409
            ],
            [
                8409,
                8491
            ],
            [
                8491,
                8524
            ],
            [
                8524,
                8627
            ],
            [
                8627,
                8651
            ],
            [
                8651,
                8711
            ],
            [
                8711,
                8779
            ],
            [
                8779,
                8792
            ],
            [
                8792,
                8904
            ],
            [
                8904,
                9103
            ],
            [
                9103,
                9422
            ],
            [
                9422,
                9585
            ],
            [
                9585,
                9611
            ],
            [
                9611,
                9638
            ],
            [
                9638,
                9992
            ],
            [
                9992,
                10049
            ],
            [
                10049,
                10230
            ],
            [
                10230,
                10291
            ],
            [
                10291,
                10327
            ],
            [
                10327,
                10375
            ],
            [
                10375,
                10425
            ],
            [
                10425,
                10444
            ],
            [
                10444,
                10473
            ],
            [
                10473,
                10566
            ],
            [
                10566,
                10645
            ],
            [
                10645,
                10676
            ],
            [
                10676,
                10716
            ],
            [
                10716,
                10770
            ],
            [
                10770,
                11059
            ],
            [
                11059,
                11088
            ],
            [
                11088,
                11160
            ],
            [
                11160,
                11207
            ],
            [
                11207,
                11236
            ],
            [
                11236,
                11311
            ],
            [
                11311,
                11328
            ],
            [
                11328,
                11401
            ],
            [
                11401,
                11459
            ],
            [
                11459,
                11526
            ],
            [
                11526,
                11640
            ],
            [
                11640,
                11699
            ],
            [
                11699,
                11840
            ],
            [
                11840,
                11852
            ],
            [
                11852,
                11936
            ],
            [
                11936,
                11946
            ],
            [
                11946,
                11972
            ],
            [
                11972,
                12050
            ],
            [
                12050,
                12083
            ],
            [
                12083,
                12123
            ],
            [
                12123,
                12197
            ],
            [
                12197,
                12264
            ],
            [
                12264,
                12396
            ],
            [
                12396,
                12429
            ],
            [
                12429,
                12486
            ],
            [
                12486,
                12513
            ],
            [
                12513,
                12535
            ],
            [
                12535,
                12644
            ],
            [
                12644,
                12807
            ],
            [
                12807,
                12828
            ],
            [
                12828,
                12841
            ],
            [
                12841,
                12868
            ],
            [
                12868,
                13025
            ],
            [
                13025,
                13096
            ],
            [
                13096,
                13203
            ],
            [
                13203,
                13240
            ],
            [
                13240,
                13265
            ],
            [
                13265,
                13286
            ],
            [
                13286,
                13295
            ],
            [
                13295,
                13321
            ],
            [
                13321,
                13375
            ],
            [
                13375,
                13394
            ],
            [
                13394,
                13420
            ],
            [
                13420,
                13437
            ],
            [
                13437,
                13469
            ],
            [
                13469,
                13524
            ],
            [
                13524,
                13707
            ],
            [
                13707,
                13816
            ],
            [
                13816,
                13847
            ],
            [
                13847,
                13935
            ],
            [
                13935,
                14002
            ],
            [
                14002,
                14019
            ],
            [
                14019,
                14124
            ],
            [
                14124,
                14157
            ],
            [
                14157,
                14187
            ],
            [
                14187,
                14213
            ],
            [
                14213,
                14310
            ],
            [
                14310,
                14369
            ],
            [
                14369,
                14425
            ],
            [
                14425,
                14588
            ],
            [
                14588,
                14611
            ],
            [
                14611,
                14688
            ],
            [
                14688,
                14874
            ],
            [
                14874,
                15058
            ],
            [
                15058,
                15103
            ],
            [
                15103,
                15149
            ],
            [
                15149,
                15304
            ],
            [
                15304,
                15346
            ],
            [
                15346,
                15499
            ],
            [
                15499,
                15674
            ],
            [
                15674,
                15715
            ],
            [
                15715,
                15772
            ],
            [
                15772,
                15824
            ],
            [
                15824,
                16082
            ],
            [
                16082,
                16226
            ],
            [
                16226,
                16850
            ],
            [
                16850,
                16972
            ],
            [
                16972,
                17196
            ],
            [
                17196,
                17314
            ],
            [
                17314,
                17355
            ],
            [
                17355,
                17381
            ],
            [
                17381,
                17545
            ],
            [
                17545,
                17582
            ],
            [
                17582,
                17634
            ],
            [
                17634,
                17667
            ],
            [
                17667,
                17830
            ],
            [
                17830,
                17914
            ],
            [
                17914,
                18161
            ],
            [
                18161,
                18190
            ],
            [
                18190,
                18259
            ],
            [
                18259,
                18274
            ],
            [
                18274,
                18279
            ],
            [
                18279,
                18475
            ],
            [
                18475,
                18508
            ],
            [
                18508,
                18652
            ],
            [
                18652,
                18690
            ],
            [
                18690,
                18716
            ],
            [
                18716,
                18754
            ],
            [
                18754,
                18817
            ],
            [
                18817,
                18865
            ],
            [
                18865,
                19017
            ],
            [
                19017,
                19218
            ],
            [
                19218,
                19424
            ],
            [
                19424,
                19456
            ],
            [
                19456,
                19488
            ],
            [
                19488,
                19651
            ],
            [
                19651,
                19930
            ],
            [
                19930,
                20102
            ],
            [
                20102,
                20307
            ],
            [
                20307,
                20353
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                42,
                44
            ],
            [
                44,
                55
            ],
            [
                55,
                118
            ],
            [
                118,
                147
            ],
            [
                147,
                187
            ],
            [
                188,
                238
            ],
            [
                238,
                272
            ],
            [
                272,
                324
            ],
            [
                324,
                396
            ],
            [
                396,
                407
            ],
            [
                417,
                535
            ],
            [
                535,
                537
            ],
            [
                537,
                602
            ],
            [
                602,
                657
            ],
            [
                657,
                659
            ],
            [
                659,
                678
            ],
            [
                683,
                718
            ],
            [
                719,
                722
            ],
            [
                724,
                776
            ],
            [
                777,
                780
            ],
            [
                781,
                809
            ],
            [
                814,
                859
            ],
            [
                866,
                887
            ],
            [
                895,
                923
            ],
            [
                923,
                985
            ],
            [
                985,
                1012
            ],
            [
                1024,
                1053
            ],
            [
                1058,
                1086
            ],
            [
                1087,
                1098
            ],
            [
                1098,
                1128
            ],
            [
                1128,
                1187
            ],
            [
                1187,
                1218
            ],
            [
                1219,
                1238
            ],
            [
                1239,
                1284
            ],
            [
                1285,
                1294
            ],
            [
                1294,
                1295
            ],
            [
                1296,
                1303
            ],
            [
                1304,
                1310
            ],
            [
                1317,
                1319
            ],
            [
                1320,
                1323
            ],
            [
                1324,
                1438
            ],
            [
                1438,
                1440
            ],
            [
                1440,
                1670
            ],
            [
                1671,
                1675
            ],
            [
                1676,
                1680
            ],
            [
                1686,
                1811
            ],
            [
                1812,
                1891
            ],
            [
                1891,
                1991
            ],
            [
                1991,
                1993
            ],
            [
                2001,
                2004
            ],
            [
                2014,
                2050
            ],
            [
                2055,
                2083
            ],
            [
                2083,
                2106
            ],
            [
                2113,
                2122
            ],
            [
                2122,
                2396
            ],
            [
                2396,
                2424
            ],
            [
                2434,
                2503
            ],
            [
                2508,
                2552
            ],
            [
                2564,
                2690
            ],
            [
                2690,
                2731
            ],
            [
                2733,
                2736
            ],
            [
                2737,
                2789
            ],
            [
                2789,
                2893
            ],
            [
                2893,
                2984
            ],
            [
                2985,
                3098
            ],
            [
                3099,
                3104
            ],
            [
                3105,
                3158
            ],
            [
                3158,
                3532
            ],
            [
                3533,
                3553
            ],
            [
                3554,
                3656
            ],
            [
                3657,
                3752
            ],
            [
                3760,
                3770
            ],
            [
                3779,
                3801
            ],
            [
                3806,
                3965
            ],
            [
                3965,
                4013
            ],
            [
                4013,
                4157
            ],
            [
                4157,
                4159
            ],
            [
                4159,
                4257
            ],
            [
                4258,
                4261
            ],
            [
                4262,
                4325
            ],
            [
                4326,
                4328
            ],
            [
                4335,
                4363
            ],
            [
                4363,
                4429
            ],
            [
                4429,
                4649
            ],
            [
                4656,
                4658
            ],
            [
                4658,
                4733
            ],
            [
                4733,
                4751
            ],
            [
                4752,
                4756
            ],
            [
                4757,
                4763
            ],
            [
                4763,
                4821
            ],
            [
                4836,
                4880
            ],
            [
                4881,
                4931
            ],
            [
                4931,
                5056
            ],
            [
                5056,
                5063
            ],
            [
                5079,
                5142
            ],
            [
                5143,
                5198
            ],
            [
                5207,
                5262
            ],
            [
                5263,
                5283
            ],
            [
                5297,
                5310
            ],
            [
                5310,
                5332
            ],
            [
                5332,
                5363
            ],
            [
                5363,
                5409
            ],
            [
                5416,
                5559
            ],
            [
                5560,
                5602
            ],
            [
                5602,
                5631
            ],
            [
                5632,
                5706
            ],
            [
                5715,
                5767
            ],
            [
                5767,
                5770
            ],
            [
                5771,
                5822
            ],
            [
                5822,
                5831
            ],
            [
                5837,
                5909
            ],
            [
                5909,
                5914
            ],
            [
                5923,
                5931
            ],
            [
                5932,
                5934
            ],
            [
                5935,
                5982
            ],
            [
                5982,
                6143
            ],
            [
                6143,
                6227
            ],
            [
                6227,
                6274
            ],
            [
                6274,
                6383
            ],
            [
                6387,
                6393
            ],
            [
                6398,
                6412
            ],
            [
                6413,
                6441
            ],
            [
                6441,
                6443
            ],
            [
                6443,
                6534
            ],
            [
                6541,
                6544
            ],
            [
                6545,
                6571
            ],
            [
                6575,
                6583
            ],
            [
                6591,
                6604
            ],
            [
                6617,
                6619
            ],
            [
                6657,
                6676
            ],
            [
                6676,
                6743
            ],
            [
                6743,
                6776
            ],
            [
                6776,
                6816
            ],
            [
                6816,
                6861
            ],
            [
                6861,
                6892
            ],
            [
                6892,
                6893
            ],
            [
                6894,
                6905
            ],
            [
                6905,
                6931
            ],
            [
                6931,
                6934
            ],
            [
                6935,
                6954
            ],
            [
                6955,
                6966
            ],
            [
                6967,
                6979
            ],
            [
                6979,
                6997
            ],
            [
                7008,
                7061
            ],
            [
                7061,
                7096
            ],
            [
                7097,
                7120
            ],
            [
                7120,
                7123
            ],
            [
                7132,
                7139
            ],
            [
                7140,
                7154
            ],
            [
                7154,
                7239
            ],
            [
                7239,
                7250
            ],
            [
                7251,
                7276
            ],
            [
                7289,
                7291
            ],
            [
                7292,
                7302
            ],
            [
                7302,
                7318
            ],
            [
                7339,
                7372
            ],
            [
                7374,
                7381
            ],
            [
                7381,
                7526
            ],
            [
                7531,
                7592
            ],
            [
                7592,
                7637
            ],
            [
                7637,
                7661
            ],
            [
                7663,
                7669
            ],
            [
                7678,
                7834
            ],
            [
                7835,
                7858
            ],
            [
                7859,
                7962
            ],
            [
                7963,
                7983
            ],
            [
                7988,
                7994
            ],
            [
                7995,
                7998
            ],
            [
                7999,
                8047
            ],
            [
                8047,
                8196
            ],
            [
                8196,
                8201
            ],
            [
                8209,
                8214
            ],
            [
                8215,
                8270
            ],
            [
                8270,
                8340
            ],
            [
                8341,
                8344
            ],
            [
                8351,
                8353
            ],
            [
                8353,
                8409
            ],
            [
                8409,
                8437
            ],
            [
                8437,
                8470
            ],
            [
                8471,
                8475
            ],
            [
                8476,
                8491
            ],
            [
                8491,
                8524
            ],
            [
                8524,
                8564
            ],
            [
                8564,
                8565
            ],
            [
                8566,
                8573
            ],
            [
                8574,
                8584
            ],
            [
                8591,
                8612
            ],
            [
                8625,
                8627
            ],
            [
                8627,
                8651
            ],
            [
                8651,
                8666
            ],
            [
                8667,
                8711
            ],
            [
                8711,
                8727
            ],
            [
                8735,
                8777
            ],
            [
                8777,
                8779
            ],
            [
                8779,
                8781
            ],
            [
                8782,
                8785
            ],
            [
                8786,
                8792
            ],
            [
                8792,
                8854
            ],
            [
                8855,
                8904
            ],
            [
                8904,
                8923
            ],
            [
                8924,
                8958
            ],
            [
                8959,
                8963
            ],
            [
                8964,
                9058
            ],
            [
                9069,
                9101
            ],
            [
                9103,
                9119
            ],
            [
                9120,
                9211
            ],
            [
                9212,
                9257
            ],
            [
                9258,
                9422
            ],
            [
                9422,
                9506
            ],
            [
                9507,
                9585
            ],
            [
                9585,
                9611
            ],
            [
                9611,
                9638
            ],
            [
                9638,
                9680
            ],
            [
                9689,
                9726
            ],
            [
                9732,
                9778
            ],
            [
                9789,
                9792
            ],
            [
                9793,
                9853
            ],
            [
                9858,
                9888
            ],
            [
                9889,
                9897
            ],
            [
                9902,
                9909
            ],
            [
                9910,
                9924
            ],
            [
                9925,
                9935
            ],
            [
                9936,
                9991
            ],
            [
                9992,
                10049
            ],
            [
                10049,
                10089
            ],
            [
                10091,
                10153
            ],
            [
                10154,
                10212
            ],
            [
                10213,
                10229
            ],
            [
                10230,
                10291
            ],
            [
                10291,
                10327
            ],
            [
                10327,
                10375
            ],
            [
                10375,
                10425
            ],
            [
                10425,
                10444
            ],
            [
                10444,
                10473
            ],
            [
                10473,
                10491
            ],
            [
                10492,
                10566
            ],
            [
                10566,
                10610
            ],
            [
                10611,
                10645
            ],
            [
                10645,
                10676
            ],
            [
                10676,
                10716
            ],
            [
                10716,
                10754
            ],
            [
                10761,
                10770
            ],
            [
                10770,
                10966
            ],
            [
                10967,
                11059
            ],
            [
                11059,
                11088
            ],
            [
                11088,
                11143
            ],
            [
                11143,
                11144
            ],
            [
                11149,
                11158
            ],
            [
                11158,
                11160
            ],
            [
                11160,
                11184
            ],
            [
                11184,
                11207
            ],
            [
                11207,
                11236
            ],
            [
                11236,
                11311
            ],
            [
                11311,
                11328
            ],
            [
                11328,
                11401
            ],
            [
                11401,
                11459
            ],
            [
                11459,
                11526
            ],
            [
                11526,
                11537
            ],
            [
                11538,
                11546
            ],
            [
                11555,
                11640
            ],
            [
                11640,
                11688
            ],
            [
                11697,
                11699
            ],
            [
                11699,
                11840
            ],
            [
                11840,
                11842
            ],
            [
                11850,
                11852
            ],
            [
                11852,
                11936
            ],
            [
                11936,
                11944
            ],
            [
                11944,
                11946
            ],
            [
                11946,
                11972
            ],
            [
                11972,
                11996
            ],
            [
                11996,
                11997
            ],
            [
                11998,
                12050
            ],
            [
                12050,
                12083
            ],
            [
                12083,
                12123
            ],
            [
                12123,
                12197
            ],
            [
                12197,
                12264
            ],
            [
                12264,
                12377
            ],
            [
                12378,
                12396
            ],
            [
                12396,
                12429
            ],
            [
                12429,
                12486
            ],
            [
                12486,
                12513
            ],
            [
                12513,
                12535
            ],
            [
                12535,
                12536
            ],
            [
                12536,
                12570
            ],
            [
                12576,
                12644
            ],
            [
                12644,
                12723
            ],
            [
                12724,
                12766
            ],
            [
                12776,
                12807
            ],
            [
                12807,
                12828
            ],
            [
                12828,
                12841
            ],
            [
                12841,
                12868
            ],
            [
                12868,
                12993
            ],
            [
                12994,
                13025
            ],
            [
                13025,
                13096
            ],
            [
                13096,
                13203
            ],
            [
                13203,
                13240
            ],
            [
                13240,
                13265
            ],
            [
                13265,
                13286
            ],
            [
                13286,
                13295
            ],
            [
                13295,
                13321
            ],
            [
                13321,
                13337
            ],
            [
                13338,
                13375
            ],
            [
                13375,
                13394
            ],
            [
                13394,
                13420
            ],
            [
                13420,
                13437
            ],
            [
                13437,
                13469
            ],
            [
                13469,
                13524
            ],
            [
                13524,
                13707
            ],
            [
                13707,
                13816
            ],
            [
                13816,
                13847
            ],
            [
                13847,
                13920
            ],
            [
                13929,
                13935
            ],
            [
                13935,
                14002
            ],
            [
                14002,
                14019
            ],
            [
                14019,
                14124
            ],
            [
                14124,
                14139
            ],
            [
                14141,
                14157
            ],
            [
                14157,
                14187
            ],
            [
                14187,
                14213
            ],
            [
                14213,
                14310
            ],
            [
                14310,
                14369
            ],
            [
                14369,
                14424
            ],
            [
                14425,
                14588
            ],
            [
                14588,
                14611
            ],
            [
                14611,
                14635
            ],
            [
                14636,
                14638
            ],
            [
                14639,
                14686
            ],
            [
                14686,
                14688
            ],
            [
                14688,
                14700
            ],
            [
                14701,
                14788
            ],
            [
                14801,
                14874
            ],
            [
                14874,
                14932
            ],
            [
                14933,
                15010
            ],
            [
                15011,
                15026
            ],
            [
                15027,
                15058
            ],
            [
                15058,
                15103
            ],
            [
                15103,
                15149
            ],
            [
                15149,
                15158
            ],
            [
                15172,
                15304
            ],
            [
                15304,
                15346
            ],
            [
                15346,
                15369
            ],
            [
                15378,
                15499
            ],
            [
                15499,
                15673
            ],
            [
                15674,
                15715
            ],
            [
                15715,
                15772
            ],
            [
                15772,
                15824
            ],
            [
                15824,
                16082
            ],
            [
                16082,
                16099
            ],
            [
                16100,
                16104
            ],
            [
                16111,
                16146
            ],
            [
                16149,
                16156
            ],
            [
                16171,
                16226
            ],
            [
                16226,
                16291
            ],
            [
                16291,
                16396
            ],
            [
                16397,
                16421
            ],
            [
                16421,
                16434
            ],
            [
                16435,
                16471
            ],
            [
                16471,
                16732
            ],
            [
                16733,
                16815
            ],
            [
                16825,
                16850
            ],
            [
                16850,
                16920
            ],
            [
                16921,
                16929
            ],
            [
                16934,
                16950
            ],
            [
                16954,
                16972
            ],
            [
                16972,
                16980
            ],
            [
                16981,
                16982
            ],
            [
                16993,
                17195
            ],
            [
                17197,
                17204
            ],
            [
                17205,
                17219
            ],
            [
                17220,
                17231
            ],
            [
                17231,
                17283
            ],
            [
                17284,
                17314
            ],
            [
                17314,
                17321
            ],
            [
                17322,
                17355
            ],
            [
                17355,
                17381
            ],
            [
                17381,
                17514
            ],
            [
                17516,
                17545
            ],
            [
                17545,
                17582
            ],
            [
                17582,
                17634
            ],
            [
                17634,
                17667
            ],
            [
                17667,
                17723
            ],
            [
                17723,
                17788
            ],
            [
                17788,
                17830
            ],
            [
                17830,
                17914
            ],
            [
                17914,
                17915
            ],
            [
                17916,
                17920
            ],
            [
                17921,
                17993
            ],
            [
                17994,
                18061
            ],
            [
                18062,
                18071
            ],
            [
                18072,
                18077
            ],
            [
                18078,
                18159
            ],
            [
                18163,
                18190
            ],
            [
                18190,
                18259
            ],
            [
                18259,
                18273
            ],
            [
                18274,
                18279
            ],
            [
                18279,
                18475
            ],
            [
                18475,
                18486
            ],
            [
                18487,
                18508
            ],
            [
                18508,
                18652
            ],
            [
                18652,
                18690
            ],
            [
                18690,
                18716
            ],
            [
                18716,
                18754
            ],
            [
                18754,
                18817
            ],
            [
                18817,
                18820
            ],
            [
                18821,
                18854
            ],
            [
                18855,
                18858
            ],
            [
                18859,
                18865
            ],
            [
                18865,
                18973
            ],
            [
                18974,
                19017
            ],
            [
                19017,
                19021
            ],
            [
                19026,
                19067
            ],
            [
                19067,
                19217
            ],
            [
                19218,
                19261
            ],
            [
                19262,
                19384
            ],
            [
                19385,
                19407
            ],
            [
                19408,
                19424
            ],
            [
                19424,
                19449
            ],
            [
                19454,
                19456
            ],
            [
                19456,
                19488
            ],
            [
                19488,
                19606
            ],
            [
                19621,
                19651
            ],
            [
                19651,
                19718
            ],
            [
                19719,
                19728
            ],
            [
                19729,
                19736
            ],
            [
                19746,
                19753
            ],
            [
                19754,
                19774
            ],
            [
                19775,
                19832
            ],
            [
                19833,
                19837
            ],
            [
                19838,
                19929
            ],
            [
                19930,
                20025
            ],
            [
                20030,
                20050
            ],
            [
                20051,
                20102
            ],
            [
                20102,
                20124
            ],
            [
                20132,
                20164
            ],
            [
                20175,
                20282
            ],
            [
                20282,
                20285
            ],
            [
                20291,
                20294
            ],
            [
                20295,
                20305
            ],
            [
                20305,
                20307
            ],
            [
                20307,
                20333
            ],
            [
                20334,
                20353
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                118
            ],
            [
                118,
                238
            ],
            [
                238,
                324
            ],
            [
                324,
                396
            ],
            [
                396,
                537
            ],
            [
                537,
                602
            ],
            [
                602,
                659
            ],
            [
                659,
                724
            ],
            [
                724,
                923
            ],
            [
                923,
                985
            ],
            [
                985,
                1012
            ],
            [
                1012,
                1128
            ],
            [
                1128,
                1187
            ],
            [
                1187,
                1440
            ],
            [
                1440,
                1891
            ],
            [
                1891,
                1991
            ],
            [
                1991,
                2083
            ],
            [
                2083,
                2122
            ],
            [
                2122,
                2396
            ],
            [
                2396,
                2396
            ],
            [
                2396,
                2690
            ],
            [
                2690,
                2893
            ],
            [
                2893,
                3158
            ],
            [
                3158,
                3158
            ],
            [
                3158,
                3554
            ],
            [
                3554,
                3965
            ],
            [
                3965,
                4159
            ],
            [
                4159,
                4363
            ],
            [
                4363,
                4429
            ],
            [
                4429,
                4658
            ],
            [
                4658,
                4733
            ],
            [
                4733,
                4881
            ],
            [
                4881,
                4931
            ],
            [
                4931,
                5056
            ],
            [
                5056,
                5310
            ],
            [
                5310,
                5332
            ],
            [
                5332,
                5602
            ],
            [
                5602,
                5767
            ],
            [
                5767,
                5822
            ],
            [
                5822,
                5909
            ],
            [
                5909,
                6227
            ],
            [
                6227,
                6227
            ],
            [
                6227,
                6274
            ],
            [
                6274,
                6443
            ],
            [
                6443,
                6676
            ],
            [
                6676,
                6743
            ],
            [
                6743,
                6776
            ],
            [
                6776,
                6816
            ],
            [
                6816,
                6861
            ],
            [
                6861,
                6931
            ],
            [
                6931,
                7061
            ],
            [
                7061,
                7120
            ],
            [
                7120,
                7154
            ],
            [
                7154,
                7239
            ],
            [
                7239,
                7592
            ],
            [
                7592,
                7984
            ],
            [
                7984,
                8047
            ],
            [
                8047,
                8196
            ],
            [
                8196,
                8353
            ],
            [
                8353,
                8409
            ],
            [
                8409,
                8491
            ],
            [
                8491,
                8524
            ],
            [
                8524,
                8627
            ],
            [
                8627,
                8651
            ],
            [
                8651,
                8711
            ],
            [
                8711,
                8779
            ],
            [
                8779,
                8792
            ],
            [
                8792,
                8904
            ],
            [
                8904,
                9422
            ],
            [
                9422,
                9585
            ],
            [
                9585,
                9611
            ],
            [
                9611,
                9638
            ],
            [
                9638,
                9638
            ],
            [
                9638,
                9992
            ],
            [
                9992,
                10049
            ],
            [
                10049,
                10230
            ],
            [
                10230,
                10291
            ],
            [
                10291,
                10327
            ],
            [
                10327,
                10375
            ],
            [
                10375,
                10425
            ],
            [
                10425,
                10444
            ],
            [
                10444,
                10473
            ],
            [
                10473,
                10566
            ],
            [
                10566,
                10645
            ],
            [
                10645,
                10676
            ],
            [
                10676,
                10716
            ],
            [
                10716,
                10770
            ],
            [
                10770,
                11059
            ],
            [
                11059,
                11088
            ],
            [
                11088,
                11160
            ],
            [
                11160,
                11207
            ],
            [
                11207,
                11236
            ],
            [
                11236,
                11311
            ],
            [
                11311,
                11328
            ],
            [
                11328,
                11401
            ],
            [
                11401,
                11459
            ],
            [
                11459,
                11526
            ],
            [
                11526,
                11640
            ],
            [
                11640,
                11699
            ],
            [
                11699,
                11840
            ],
            [
                11840,
                11852
            ],
            [
                11852,
                11936
            ],
            [
                11936,
                11946
            ],
            [
                11946,
                11972
            ],
            [
                11972,
                12050
            ],
            [
                12050,
                12083
            ],
            [
                12083,
                12123
            ],
            [
                12123,
                12197
            ],
            [
                12197,
                12264
            ],
            [
                12264,
                12396
            ],
            [
                12396,
                12429
            ],
            [
                12429,
                12486
            ],
            [
                12486,
                12513
            ],
            [
                12513,
                12535
            ],
            [
                12535,
                12644
            ],
            [
                12644,
                12807
            ],
            [
                12807,
                12828
            ],
            [
                12828,
                12841
            ],
            [
                12841,
                12868
            ],
            [
                12868,
                13025
            ],
            [
                13025,
                13096
            ],
            [
                13096,
                13203
            ],
            [
                13203,
                13240
            ],
            [
                13240,
                13265
            ],
            [
                13265,
                13286
            ],
            [
                13286,
                13295
            ],
            [
                13295,
                13321
            ],
            [
                13321,
                13375
            ],
            [
                13375,
                13394
            ],
            [
                13394,
                13420
            ],
            [
                13420,
                13437
            ],
            [
                13437,
                13469
            ],
            [
                13469,
                13524
            ],
            [
                13524,
                13707
            ],
            [
                13707,
                13816
            ],
            [
                13816,
                13847
            ],
            [
                13847,
                13847
            ],
            [
                13847,
                13935
            ],
            [
                13935,
                14002
            ],
            [
                14002,
                14019
            ],
            [
                14019,
                14124
            ],
            [
                14124,
                14124
            ],
            [
                14124,
                14124
            ],
            [
                14124,
                14157
            ],
            [
                14157,
                14187
            ],
            [
                14187,
                14213
            ],
            [
                14213,
                14310
            ],
            [
                14310,
                14369
            ],
            [
                14369,
                14425
            ],
            [
                14425,
                14588
            ],
            [
                14588,
                14611
            ],
            [
                14611,
                14688
            ],
            [
                14688,
                14874
            ],
            [
                14874,
                15058
            ],
            [
                15058,
                15103
            ],
            [
                15103,
                15103
            ],
            [
                15103,
                15149
            ],
            [
                15149,
                15304
            ],
            [
                15304,
                15346
            ],
            [
                15346,
                15499
            ],
            [
                15499,
                15674
            ],
            [
                15674,
                15715
            ],
            [
                15715,
                15772
            ],
            [
                15772,
                15824
            ],
            [
                15824,
                16082
            ],
            [
                16082,
                16226
            ],
            [
                16226,
                16850
            ],
            [
                16850,
                16972
            ],
            [
                16972,
                17196
            ],
            [
                17196,
                17314
            ],
            [
                17314,
                17355
            ],
            [
                17355,
                17355
            ],
            [
                17355,
                17381
            ],
            [
                17381,
                17545
            ],
            [
                17545,
                17582
            ],
            [
                17582,
                17634
            ],
            [
                17634,
                17667
            ],
            [
                17667,
                17830
            ],
            [
                17830,
                17914
            ],
            [
                17914,
                18190
            ],
            [
                18190,
                18259
            ],
            [
                18259,
                18259
            ],
            [
                18259,
                18259
            ],
            [
                18259,
                18274
            ],
            [
                18274,
                18279
            ],
            [
                18279,
                18475
            ],
            [
                18475,
                18508
            ],
            [
                18508,
                18652
            ],
            [
                18652,
                18690
            ],
            [
                18690,
                18716
            ],
            [
                18716,
                18716
            ],
            [
                18716,
                18754
            ],
            [
                18754,
                18817
            ],
            [
                18817,
                18865
            ],
            [
                18865,
                19017
            ],
            [
                19017,
                19218
            ],
            [
                19218,
                19424
            ],
            [
                19424,
                19456
            ],
            [
                19456,
                19488
            ],
            [
                19488,
                19651
            ],
            [
                19651,
                19930
            ],
            [
                19930,
                20102
            ],
            [
                20102,
                20307
            ],
            [
                20307,
                20353
            ]
        ]
    }
}