{
    "original": {
        "text": "Let other pens dwell on guilt and misery. I quit such odious subjects as soon as I can, impatient to restore everybody, not greatly in fault themselves, to tolerable comfort, and to have done with all the rest.\nMy Fanny, indeed, at this very time, I have the satisfaction of knowing, must have been happy in spite of everything. She must have been a happy creature in spite of all that she felt, or thought she felt, for the distress of those around her. She had sources of delight that must force their way. She was returned to Mansfield Park, she was useful, she was beloved; she was safe from Mr. Crawford; and when Sir Thomas came back she had every proof that could be given in his then melancholy state of spirits, of his perfect approbation and increased regard; and happy as all this must make her, she would still have been happy without any of it, for Edmund was no longer the dupe of Miss Crawford.\nIt is true that Edmund was very far from happy himself. He was suffering from disappointment and regret, grieving over what was, and wishing for what could never be. She knew it was so, and was sorry; but it was with a sorrow so founded on satisfaction, so tending to ease, and so much in harmony with every dearest sensation, that there are few who might not have been glad to exchange their greatest gaiety for it.\nSir Thomas, poor Sir Thomas, a parent, and conscious of errors in his own conduct as a parent, was the longest to suffer. He felt that he ought not to have allowed the marriage; that his daughter's sentiments had been sufficiently known to him to render him culpable in authorising it; that in so doing he had sacrificed the right to the expedient, and been governed by motives of selfishness and worldly wisdom. These were reflections that required some time to soften; but time will do almost everything; and though little comfort arose on Mrs. Rushworth's side for the misery she had occasioned, comfort was to be found greater than he had supposed in his other children. Julia's match became a less desperate business than he had considered it at first. She was humble, and wishing to be forgiven; and Mr. Yates, desirous of being really received into the family, was disposed to look up to him and be guided. He was not very solid; but there was a hope of his becoming less trifling, of his being at least tolerably domestic and quiet; and at any rate, there was comfort in finding his estate rather more, and his debts much less, than he had feared, and in being consulted and treated as the friend best worth attending to. There was comfort also in Tom, who gradually regained his health, without regaining the thoughtlessness and selfishness of his previous habits. He was the better for ever for his illness. He had suffered, and he had learned to think: two advantages that he had never known before; and the self-reproach arising from the deplorable event in Wimpole Street, to which he felt himself accessory by all the dangerous intimacy of his unjustifiable theatre, made an impression on his mind which, at the age of six-and-twenty, with no want of sense or good companions, was durable in its happy effects. He became what he ought to be: useful to his father, steady and quiet, and not living merely for himself.\nHere was comfort indeed! and quite as soon as Sir Thomas could place dependence on such sources of good, Edmund was contributing to his father's ease by improvement in the only point in which he had given him pain before-improvement in his spirits. After wandering about and sitting under trees with Fanny all the summer evenings, he had so well talked his mind into submission as to be very tolerably cheerful again.\nThese were the circumstances and the hopes which gradually brought their alleviation to Sir Thomas, deadening his sense of what was lost, and in part reconciling him to himself; though the anguish arising from the conviction of his own errors in the education of his daughters was never to be entirely done away.\nToo late he became aware how unfavourable to the character of any young people must be the totally opposite treatment which Maria and Julia had been always experiencing at home, where the excessive indulgence and flattery of their aunt had been continually contrasted with his own severity. He saw how ill he had judged, in expecting to counteract what was wrong in Mrs. Norris by its reverse in himself; clearly saw that he had but increased the evil by teaching them to repress their spirits in his presence so as to make their real disposition unknown to him, and sending them for all their indulgences to a person who had been able to attach them only by the blindness of her affection, and the excess of her praise.\nHere had been grievous mismanagement; but, bad as it was, he gradually grew to feel that it had not been the most direful mistake in his plan of education. Something must have been wanting _within_, or time would have worn away much of its ill effect. He feared that principle, active principle, had been wanting; that they had never been properly taught to govern their inclinations and tempers by that sense of duty which can alone suffice. They had been instructed theoretically in their religion, but never required to bring it into daily practice. To be distinguished for elegance and accomplishments, the authorised object of their youth, could have had no useful influence that way, no moral effect on the mind. He had meant them to be good, but his cares had been directed to the understanding and manners, not the disposition; and of the necessity of self-denial and humility, he feared they had never heard from any lips that could profit them.\nBitterly did he deplore a deficiency which now he could scarcely comprehend to have been possible. Wretchedly did he feel, that with all the cost and care of an anxious and expensive education, he had brought up his daughters without their understanding their first duties, or his being acquainted with their character and temper.\nThe high spirit and strong passions of Mrs. Rushworth, especially, were made known to him only in their sad result. She was not to be prevailed on to leave Mr. Crawford. She hoped to marry him, and they continued together till she was obliged to be convinced that such hope was vain, and till the disappointment and wretchedness arising from the conviction rendered her temper so bad, and her feelings for him so like hatred, as to make them for a while each other's punishment, and then induce a voluntary separation.\nShe had lived with him to be reproached as the ruin of all his happiness in Fanny, and carried away no better consolation in leaving him than that she _had_ divided them. What can exceed the misery of such a mind in such a situation?\nMr. Rushworth had no difficulty in procuring a divorce; and so ended a marriage contracted under such circumstances as to make any better end the effect of good luck not to be reckoned on. She had despised him, and loved another; and he had been very much aware that it was so. The indignities of stupidity, and the disappointments of selfish passion, can excite little pity. His punishment followed his conduct, as did a deeper punishment the deeper guilt of his wife. _He_ was released from the engagement to be mortified and unhappy, till some other pretty girl could attract him into matrimony again, and he might set forward on a second, and, it is to be hoped, more prosperous trial of the state: if duped, to be duped at least with good humour and good luck; while she must withdraw with infinitely stronger feelings to a retirement and reproach which could allow no second spring of hope or character.\nWhere she could be placed became a subject of most melancholy and momentous consultation. Mrs. Norris, whose attachment seemed to augment with the demerits of her niece, would have had her received at home and countenanced by them all. Sir Thomas would not hear of it; and Mrs. Norris's anger against Fanny was so much the greater, from considering _her_ residence there as the motive. She persisted in placing his scruples to _her_ account, though Sir Thomas very solemnly assured her that, had there been no young woman in question, had there been no young person of either sex belonging to him, to be endangered by the society or hurt by the character of Mrs. Rushworth, he would never have offered so great an insult to the neighbourhood as to expect it to notice her. As a daughter, he hoped a penitent one, she should be protected by him, and secured in every comfort, and supported by every encouragement to do right, which their relative situations admitted; but farther than _that_ he could not go. Maria had destroyed her own character, and he would not, by a vain attempt to restore what never could be restored, by affording his sanction to vice, or in seeking to lessen its disgrace, be anywise accessory to introducing such misery in another man's family as he had known himself.\nIt ended in Mrs. Norris's resolving to quit Mansfield and devote herself to her unfortunate Maria, and in an establishment being formed for them in another country, remote and private, where, shut up together with little society, on one side no affection, on the other no judgment, it may be reasonably supposed that their tempers became their mutual punishment.\nMrs. Norris's removal from Mansfield was the great supplementary comfort of Sir Thomas's life. His opinion of her had been sinking from the day of his return from Antigua: in every transaction together from that period, in their daily intercourse, in business, or in chat, she had been regularly losing ground in his esteem, and convincing him that either time had done her much disservice, or that he had considerably over-rated her sense, and wonderfully borne with her manners before. He had felt her as an hourly evil, which was so much the worse, as there seemed no chance of its ceasing but with life; she seemed a part of himself that must be borne for ever. To be relieved from her, therefore, was so great a felicity that, had she not left bitter remembrances behind her, there might have been danger of his learning almost to approve the evil which produced such a good.\nShe was regretted by no one at Mansfield. She had never been able to attach even those she loved best; and since Mrs. Rushworth's elopement, her temper had been in a state of such irritation as to make her everywhere tormenting. Not even Fanny had tears for aunt Norris, not even when she was gone for ever.\nThat Julia escaped better than Maria was owing, in some measure, to a favourable difference of disposition and circumstance, but in a greater to her having been less the darling of that very aunt, less flattered and less spoilt. Her beauty and acquirements had held but a second place. She had been always used to think herself a little inferior to Maria. Her temper was naturally the easiest of the two; her feelings, though quick, were more controllable, and education had not given her so very hurtful a degree of self-consequence.\nShe had submitted the best to the disappointment in Henry Crawford. After the first bitterness of the conviction of being slighted was over, she had been tolerably soon in a fair way of not thinking of him again; and when the acquaintance was renewed in town, and Mr. Rushworth's house became Crawford's object, she had had the merit of withdrawing herself from it, and of chusing that time to pay a visit to her other friends, in order to secure herself from being again too much attracted. This had been her motive in going to her cousin's. Mr. Yates's convenience had had nothing to do with it. She had been allowing his attentions some time, but with very little idea of ever accepting him; and had not her sister's conduct burst forth as it did, and her increased dread of her father and of home, on that event, imagining its certain consequence to herself would be greater severity and restraint, made her hastily resolve on avoiding such immediate horrors at all risks, it is probable that Mr. Yates would never have succeeded. She had not eloped with any worse feelings than those of selfish alarm. It had appeared to her the only thing to be done. Maria's guilt had induced Julia's folly.\nHenry Crawford, ruined by early independence and bad domestic example, indulged in the freaks of a cold-blooded vanity a little too long. Once it had, by an opening undesigned and unmerited, led him into the way of happiness. Could he have been satisfied with the conquest of one amiable woman's affections, could he have found sufficient exultation in overcoming the reluctance, in working himself into the esteem and tenderness of Fanny Price, there would have been every probability of success and felicity for him. His affection had already done something. Her influence over him had already given him some influence over her. Would he have deserved more, there can be no doubt that more would have been obtained, especially when that marriage had taken place, which would have given him the assistance of her conscience in subduing her first inclination, and brought them very often together. Would he have persevered, and uprightly, Fanny must have been his reward, and a reward very voluntarily bestowed, within a reasonable period from Edmund's marrying Mary.\nHad he done as he intended, and as he knew he ought, by going down to Everingham after his return from Portsmouth, he might have been deciding his own happy destiny. But he was pressed to stay for Mrs. Fraser's party; his staying was made of flattering consequence, and he was to meet Mrs. Rushworth there. Curiosity and vanity were both engaged, and the temptation of immediate pleasure was too strong for a mind unused to make any sacrifice to right: he resolved to defer his Norfolk journey, resolved that writing should answer the purpose of it, or that its purpose was unimportant, and staid. He saw Mrs. Rushworth, was received by her with a coldness which ought to have been repulsive, and have established apparent indifference between them for ever; but he was mortified, he could not bear to be thrown off by the woman whose smiles had been so wholly at his command: he must exert himself to subdue so proud a display of resentment; it was anger on Fanny's account; he must get the better of it, and make Mrs. Rushworth Maria Bertram again in her treatment of himself.\nIn this spirit he began the attack, and by animated perseverance had soon re-established the sort of familiar intercourse, of gallantry, of flirtation, which bounded his views; but in triumphing over the discretion which, though beginning in anger, might have saved them both, he had put himself in the power of feelings on her side more strong than he had supposed. She loved him; there was no withdrawing attentions avowedly dear to her. He was entangled by his own vanity, with as little excuse of love as possible, and without the smallest inconstancy of mind towards her cousin. To keep Fanny and the Bertrams from a knowledge of what was passing became his first object. Secrecy could not have been more desirable for Mrs. Rushworth's credit than he felt it for his own. When he returned from Richmond, he would have been glad to see Mrs. Rushworth no more. All that followed was the result of her imprudence; and he went off with her at last, because he could not help it, regretting Fanny even at the moment, but regretting her infinitely more when all the bustle of the intrigue was over, and a very few months had taught him, by the force of contrast, to place a yet higher value on the sweetness of her temper, the purity of her mind, and the excellence of her principles.\nThat punishment, the public punishment of disgrace, should in a just measure attend _his_ share of the offence is, we know, not one of the barriers which society gives to virtue. In this world the penalty is less equal than could be wished; but without presuming to look forward to a juster appointment hereafter, we may fairly consider a man of sense, like Henry Crawford, to be providing for himself no small portion of vexation and regret: vexation that must rise sometimes to self-reproach, and regret to wretchedness, in having so requited hospitality, so injured family peace, so forfeited his best, most estimable, and endeared acquaintance, and so lost the woman whom he had rationally as well as passionately loved.\nAfter what had passed to wound and alienate the two families, the continuance of the Bertrams and Grants in such close neighbourhood would have been most distressing; but the absence of the latter, for some months purposely lengthened, ended very fortunately in the necessity, or at least the practicability, of a permanent removal. Dr. Grant, through an interest on which he had almost ceased to form hopes, succeeded to a stall in Westminster, which, as affording an occasion for leaving Mansfield, an excuse for residence in London, and an increase of income to answer the expenses of the change, was highly acceptable to those who went and those who staid.\nMrs. Grant, with a temper to love and be loved, must have gone with some regret from the scenes and people she had been used to; but the same happiness of disposition must in any place, and any society, secure her a great deal to enjoy, and she had again a home to offer Mary; and Mary had had enough of her own friends, enough of vanity, ambition, love, and disappointment in the course of the last half-year, to be in need of the true kindness of her sister's heart, and the rational tranquillity of her ways. They lived together; and when Dr. Grant had brought on apoplexy and death, by three great institutionary dinners in one week, they still lived together; for Mary, though perfectly resolved against ever attaching herself to a younger brother again, was long in finding among the dashing representatives, or idle heir-apparents, who were at the command of her beauty, and her 20,000, any one who could satisfy the better taste she had acquired at Mansfield, whose character and manners could authorise a hope of the domestic happiness she had there learned to estimate, or put Edmund Bertram sufficiently out of her head.\nEdmund had greatly the advantage of her in this respect. He had not to wait and wish with vacant affections for an object worthy to succeed her in them. Scarcely had he done regretting Mary Crawford, and observing to Fanny how impossible it was that he should ever meet with such another woman, before it began to strike him whether a very different kind of woman might not do just as well, or a great deal better: whether Fanny herself were not growing as dear, as important to him in all her smiles and all her ways, as Mary Crawford had ever been; and whether it might not be a possible, a hopeful undertaking to persuade her that her warm and sisterly regard for him would be foundation enough for wedded love.\nI purposely abstain from dates on this occasion, that every one may be at liberty to fix their own, aware that the cure of unconquerable passions, and the transfer of unchanging attachments, must vary much as to time in different people. I only entreat everybody to believe that exactly at the time when it was quite natural that it should be so, and not a week earlier, Edmund did cease to care about Miss Crawford, and became as anxious to marry Fanny as Fanny herself could desire.\nWith such a regard for her, indeed, as his had long been, a regard founded on the most endearing claims of innocence and helplessness, and completed by every recommendation of growing worth, what could be more natural than the change? Loving, guiding, protecting her, as he had been doing ever since her being ten years old, her mind in so great a degree formed by his care, and her comfort depending on his kindness, an object to him of such close and peculiar interest, dearer by all his own importance with her than any one else at Mansfield, what was there now to add, but that he should learn to prefer soft light eyes to sparkling dark ones. And being always with her, and always talking confidentially, and his feelings exactly in that favourable state which a recent disappointment gives, those soft light eyes could not be very long in obtaining the pre-eminence.\nHaving once set out, and felt that he had done so on this road to happiness, there was nothing on the side of prudence to stop him or make his progress slow; no doubts of her deserving, no fears of opposition of taste, no need of drawing new hopes of happiness from dissimilarity of temper. Her mind, disposition, opinions, and habits wanted no half-concealment, no self-deception on the present, no reliance on future improvement. Even in the midst of his late infatuation, he had acknowledged Fanny's mental superiority. What must be his sense of it now, therefore? She was of course only too good for him; but as nobody minds having what is too good for them, he was very steadily earnest in the pursuit of the blessing, and it was not possible that encouragement from her should be long wanting. Timid, anxious, doubting as she was, it was still impossible that such tenderness as hers should not, at times, hold out the strongest hope of success, though it remained for a later period to tell him the whole delightful and astonishing truth. His happiness in knowing himself to have been so long the beloved of such a heart, must have been great enough to warrant any strength of language in which he could clothe it to her or to himself; it must have been a delightful happiness. But there was happiness elsewhere which no description can reach. Let no one presume to give the feelings of a young woman on receiving the assurance of that affection of which she has scarcely allowed herself to entertain a hope.\nTheir own inclinations ascertained, there were no difficulties behind, no drawback of poverty or parent. It was a match which Sir Thomas's wishes had even forestalled. Sick of ambitious and mercenary connexions, prizing more and more the sterling good of principle and temper, and chiefly anxious to bind by the strongest securities all that remained to him of domestic felicity, he had pondered with genuine satisfaction on the more than possibility of the two young friends finding their natural consolation in each other for all that had occurred of disappointment to either; and the joyful consent which met Edmund's application, the high sense of having realised a great acquisition in the promise of Fanny for a daughter, formed just such a contrast with his early opinion on the subject when the poor little girl's coming had been first agitated, as time is for ever producing between the plans and decisions of mortals, for their own instruction, and their neighbours' entertainment.\nFanny was indeed the daughter that he wanted. His charitable kindness had been rearing a prime comfort for himself. His liberality had a rich repayment, and the general goodness of his intentions by her deserved it. He might have made her childhood happier; but it had been an error of judgment only which had given him the appearance of harshness, and deprived him of her early love; and now, on really knowing each other, their mutual attachment became very strong. After settling her at Thornton Lacey with every kind attention to her comfort, the object of almost every day was to see her there, or to get her away from it.\nSelfishly dear as she had long been to Lady Bertram, she could not be parted with willingly by _her_. No happiness of son or niece could make her wish the marriage. But it was possible to part with her, because Susan remained to supply her place. Susan became the stationary niece, delighted to be so; and equally well adapted for it by a readiness of mind, and an inclination for usefulness, as Fanny had been by sweetness of temper, and strong feelings of gratitude. Susan could never be spared. First as a comfort to Fanny, then as an auxiliary, and last as her substitute, she was established at Mansfield, with every appearance of equal permanency. Her more fearless disposition and happier nerves made everything easy to her there. With quickness in understanding the tempers of those she had to deal with, and no natural timidity to restrain any consequent wishes, she was soon welcome and useful to all; and after Fanny's removal succeeded so naturally to her influence over the hourly comfort of her aunt, as gradually to become, perhaps, the most beloved of the two. In _her_ usefulness, in Fanny's excellence, in William's continued good conduct and rising fame, and in the general well-doing and success of the other members of the family, all assisting to advance each other, and doing credit to his countenance and aid, Sir Thomas saw repeated, and for ever repeated, reason to rejoice in what he had done for them all, and acknowledge the advantages of early hardship and discipline, and the consciousness of being born to struggle and endure.\nWith so much true merit and true love, and no want of fortune and friends, the happiness of the married cousins must appear as secure as earthly happiness can be. Equally formed for domestic life, and attached to country pleasures, their home was the home of affection and comfort; and to complete the picture of good, the acquisition of Mansfield living, by the death of Dr. Grant, occurred just after they had been married long enough to begin to want an increase of income, and feel their distance from the paternal abode an inconvenience.\nOn that event they removed to Mansfield; and the Parsonage there, which, under each of its two former owners, Fanny had never been able to approach but with some painful sensation of restraint or alarm, soon grew as dear to her heart, and as thoroughly perfect in her eyes, as everything else within the view and patronage of Mansfield Park had long been.\nFINIS.",
        "paragraph_chars": [
            [
                0,
                211
            ],
            [
                211,
                910
            ],
            [
                910,
                1327
            ],
            [
                1327,
                3258
            ],
            [
                3258,
                3676
            ],
            [
                3676,
                3989
            ],
            [
                3989,
                4710
            ],
            [
                4710,
                5665
            ],
            [
                5665,
                5996
            ],
            [
                5996,
                6515
            ],
            [
                6515,
                6749
            ],
            [
                6749,
                7659
            ],
            [
                7659,
                8953
            ],
            [
                8953,
                9316
            ],
            [
                9316,
                10197
            ],
            [
                10197,
                10505
            ],
            [
                10505,
                11040
            ],
            [
                11040,
                12238
            ],
            [
                12238,
                13306
            ],
            [
                13306,
                14385
            ],
            [
                14385,
                15669
            ],
            [
                15669,
                16394
            ],
            [
                16394,
                17055
            ],
            [
                17055,
                18187
            ],
            [
                18187,
                18902
            ],
            [
                18902,
                19387
            ],
            [
                19387,
                20260
            ],
            [
                20260,
                21776
            ],
            [
                21776,
                22768
            ],
            [
                22768,
                23396
            ],
            [
                23396,
                24955
            ],
            [
                24955,
                25498
            ],
            [
                25498,
                25854
            ],
            [
                25854,
                25860
            ]
        ],
        "segment_chars": [
            [
                0,
                42
            ],
            [
                42,
                211
            ],
            [
                211,
                329
            ],
            [
                329,
                455
            ],
            [
                455,
                509
            ],
            [
                509,
                910
            ],
            [
                910,
                966
            ],
            [
                966,
                1076
            ],
            [
                1076,
                1327
            ],
            [
                1327,
                1449
            ],
            [
                1449,
                1740
            ],
            [
                1740,
                2002
            ],
            [
                2002,
                2085
            ],
            [
                2085,
                2241
            ],
            [
                2241,
                2557
            ],
            [
                2557,
                2701
            ],
            [
                2701,
                2745
            ],
            [
                2745,
                3152
            ],
            [
                3152,
                3258
            ],
            [
                3258,
                3283
            ],
            [
                3283,
                3507
            ],
            [
                3507,
                3676
            ],
            [
                3676,
                3989
            ],
            [
                3989,
                4280
            ],
            [
                4280,
                4710
            ],
            [
                4710,
                4866
            ],
            [
                4866,
                4962
            ],
            [
                4962,
                5153
            ],
            [
                5153,
                5263
            ],
            [
                5263,
                5429
            ],
            [
                5429,
                5665
            ],
            [
                5665,
                5764
            ],
            [
                5764,
                5996
            ],
            [
                5996,
                6112
            ],
            [
                6112,
                6166
            ],
            [
                6166,
                6515
            ],
            [
                6515,
                6686
            ],
            [
                6686,
                6749
            ],
            [
                6749,
                6938
            ],
            [
                6938,
                7027
            ],
            [
                7027,
                7125
            ],
            [
                7125,
                7219
            ],
            [
                7219,
                7659
            ],
            [
                7659,
                7749
            ],
            [
                7749,
                7895
            ],
            [
                7895,
                8045
            ],
            [
                8045,
                8432
            ],
            [
                8432,
                8667
            ],
            [
                8667,
                8953
            ],
            [
                8953,
                9316
            ],
            [
                9316,
                9411
            ],
            [
                9411,
                9804
            ],
            [
                9804,
                9982
            ],
            [
                9982,
                10197
            ],
            [
                10197,
                10239
            ],
            [
                10239,
                10426
            ],
            [
                10426,
                10505
            ],
            [
                10505,
                10734
            ],
            [
                10734,
                10791
            ],
            [
                10791,
                10861
            ],
            [
                10861,
                11040
            ],
            [
                11040,
                11108
            ],
            [
                11108,
                11532
            ],
            [
                11532,
                11583
            ],
            [
                11583,
                11638
            ],
            [
                11638,
                12075
            ],
            [
                12075,
                12147
            ],
            [
                12147,
                12197
            ],
            [
                12197,
                12238
            ],
            [
                12238,
                12376
            ],
            [
                12376,
                12464
            ],
            [
                12464,
                12757
            ],
            [
                12757,
                12799
            ],
            [
                12799,
                12869
            ],
            [
                12869,
                13136
            ],
            [
                13136,
                13306
            ],
            [
                13306,
                13472
            ],
            [
                13472,
                13613
            ],
            [
                13613,
                13904
            ],
            [
                13904,
                14385
            ],
            [
                14385,
                14752
            ],
            [
                14752,
                14825
            ],
            [
                14825,
                14969
            ],
            [
                14969,
                15062
            ],
            [
                15062,
                15162
            ],
            [
                15162,
                15249
            ],
            [
                15249,
                15669
            ],
            [
                15669,
                15848
            ],
            [
                15848,
                16394
            ],
            [
                16394,
                16727
            ],
            [
                16727,
                17055
            ],
            [
                17055,
                17567
            ],
            [
                17567,
                18187
            ],
            [
                18187,
                18244
            ],
            [
                18244,
                18340
            ],
            [
                18340,
                18902
            ],
            [
                18902,
                19140
            ],
            [
                19140,
                19387
            ],
            [
                19387,
                19622
            ],
            [
                19622,
                20035
            ],
            [
                20035,
                20260
            ],
            [
                20260,
                20551
            ],
            [
                20551,
                20692
            ],
            [
                20692,
                20783
            ],
            [
                20783,
                20828
            ],
            [
                20828,
                21060
            ],
            [
                21060,
                21306
            ],
            [
                21306,
                21545
            ],
            [
                21545,
                21611
            ],
            [
                21611,
                21776
            ],
            [
                21776,
                21881
            ],
            [
                21881,
                21944
            ],
            [
                21944,
                22768
            ],
            [
                22768,
                22814
            ],
            [
                22814,
                22884
            ],
            [
                22884,
                22984
            ],
            [
                22984,
                23236
            ],
            [
                23236,
                23396
            ],
            [
                23396,
                23498
            ],
            [
                23498,
                23561
            ],
            [
                23561,
                23643
            ],
            [
                23643,
                23865
            ],
            [
                23865,
                23894
            ],
            [
                23894,
                24050
            ],
            [
                24050,
                24134
            ],
            [
                24134,
                24473
            ],
            [
                24473,
                24955
            ],
            [
                24955,
                25118
            ],
            [
                25118,
                25498
            ],
            [
                25498,
                25854
            ],
            [
                25854,
                25860
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                42,
                118
            ],
            [
                120,
                211
            ],
            [
                211,
                247
            ],
            [
                284,
                329
            ],
            [
                455,
                462
            ],
            [
                463,
                481
            ],
            [
                507,
                509
            ],
            [
                509,
                686
            ],
            [
                692,
                768
            ],
            [
                774,
                910
            ],
            [
                910,
                966
            ],
            [
                966,
                972
            ],
            [
                1015,
                1076
            ],
            [
                1076,
                1183
            ],
            [
                1237,
                1259
            ],
            [
                1266,
                1327
            ],
            [
                1339,
                1364
            ],
            [
                1370,
                1396
            ],
            [
                1401,
                1449
            ],
            [
                1449,
                1490
            ],
            [
                1495,
                1593
            ],
            [
                1611,
                1617
            ],
            [
                1630,
                1636
            ],
            [
                1680,
                1740
            ],
            [
                1740,
                1913
            ],
            [
                1924,
                1925
            ],
            [
                1926,
                1949
            ],
            [
                1979,
                2001
            ],
            [
                2002,
                2085
            ],
            [
                2085,
                2161
            ],
            [
                2169,
                2241
            ],
            [
                2241,
                2371
            ],
            [
                2385,
                2505
            ],
            [
                2518,
                2520
            ],
            [
                2525,
                2531
            ],
            [
                2555,
                2556
            ],
            [
                2557,
                2660
            ],
            [
                2677,
                2701
            ],
            [
                2701,
                2745
            ],
            [
                2745,
                2836
            ],
            [
                3150,
                3152
            ],
            [
                3152,
                3258
            ],
            [
                3258,
                3283
            ],
            [
                3283,
                3286
            ],
            [
                3296,
                3300
            ],
            [
                3363,
                3425
            ],
            [
                3494,
                3507
            ],
            [
                3507,
                3676
            ],
            [
                3676,
                3704
            ],
            [
                3719,
                3734
            ],
            [
                3826,
                3834
            ],
            [
                3764,
                3774
            ],
            [
                3842,
                3989
            ],
            [
                3989,
                4030
            ],
            [
                4068,
                4079
            ],
            [
                4097,
                4106
            ],
            [
                4048,
                4050
            ],
            [
                4113,
                4128
            ],
            [
                4158,
                4224
            ],
            [
                4225,
                4280
            ],
            [
                4280,
                4417
            ],
            [
                4422,
                4498
            ],
            [
                4550,
                4551
            ],
            [
                4499,
                4550
            ],
            [
                4552,
                4568
            ],
            [
                4595,
                4597
            ],
            [
                4583,
                4588
            ],
            [
                4598,
                4610
            ],
            [
                4628,
                4710
            ],
            [
                4710,
                4751
            ],
            [
                4768,
                4770
            ],
            [
                4781,
                4818
            ],
            [
                4832,
                4866
            ],
            [
                4866,
                4890
            ],
            [
                4900,
                4906
            ],
            [
                4960,
                4962
            ],
            [
                4962,
                4986
            ],
            [
                5006,
                5108
            ],
            [
                5114,
                5127
            ],
            [
                5151,
                5153
            ],
            [
                5153,
                5263
            ],
            [
                5263,
                5315
            ],
            [
                5355,
                5369
            ],
            [
                5400,
                5429
            ],
            [
                5429,
                5549
            ],
            [
                5606,
                5620
            ],
            [
                5570,
                5594
            ],
            [
                5663,
                5665
            ],
            [
                5665,
                5688
            ],
            [
                5762,
                5764
            ],
            [
                5764,
                5805
            ],
            [
                5815,
                5996
            ],
            [
                5996,
                6112
            ],
            [
                6112,
                6115
            ],
            [
                6120,
                6166
            ],
            [
                6166,
                6198
            ],
            [
                6209,
                6307
            ],
            [
                6325,
                6515
            ],
            [
                6515,
                6636
            ],
            [
                6652,
                6665
            ],
            [
                6667,
                6670
            ],
            [
                6672,
                6686
            ],
            [
                6686,
                6749
            ],
            [
                6749,
                6803
            ],
            [
                6936,
                6938
            ],
            [
                6938,
                7027
            ],
            [
                7027,
                7055
            ],
            [
                7101,
                7125
            ],
            [
                7125,
                7219
            ],
            [
                7220,
                7222
            ],
            [
                7224,
                7236
            ],
            [
                7257,
                7450
            ],
            [
                7513,
                7520
            ],
            [
                7525,
                7538
            ],
            [
                7573,
                7588
            ],
            [
                7602,
                7659
            ],
            [
                7659,
                7704
            ],
            [
                7710,
                7720
            ],
            [
                7735,
                7749
            ],
            [
                7749,
                7760
            ],
            [
                7829,
                7895
            ],
            [
                7895,
                7969
            ],
            [
                7989,
                8007
            ],
            [
                8009,
                8012
            ],
            [
                8014,
                8036
            ],
            [
                8099,
                8100
            ],
            [
                8101,
                8118
            ],
            [
                8124,
                8192
            ],
            [
                8331,
                8419
            ],
            [
                8070,
                8073
            ],
            [
                8281,
                8288
            ],
            [
                8430,
                8432
            ],
            [
                8472,
                8532
            ],
            [
                8624,
                8642
            ],
            [
                8644,
                8648
            ],
            [
                8650,
                8667
            ],
            [
                8667,
                8782
            ],
            [
                8856,
                8858
            ],
            [
                8867,
                8927
            ],
            [
                8951,
                8953
            ],
            [
                8953,
                9051
            ],
            [
                9056,
                9075
            ],
            [
                9082,
                9208
            ],
            [
                9052,
                9055
            ],
            [
                9209,
                9316
            ],
            [
                9316,
                9411
            ],
            [
                9411,
                9487
            ],
            [
                9523,
                9534
            ],
            [
                9587,
                9639
            ],
            [
                9802,
                9804
            ],
            [
                9804,
                9838
            ],
            [
                9857,
                9866
            ],
            [
                9868,
                9908
            ],
            [
                9922,
                9923
            ],
            [
                9928,
                9934
            ],
            [
                9924,
                9927
            ],
            [
                9958,
                9982
            ],
            [
                9982,
                10021
            ],
            [
                10031,
                10032
            ],
            [
                10025,
                10030
            ],
            [
                10033,
                10041
            ],
            [
                10195,
                10197
            ],
            [
                10197,
                10239
            ],
            [
                10239,
                10426
            ],
            [
                10426,
                10466
            ],
            [
                10477,
                10505
            ],
            [
                10505,
                10611
            ],
            [
                10628,
                10646
            ],
            [
                10647,
                10734
            ],
            [
                10762,
                10791
            ],
            [
                10791,
                10861
            ],
            [
                10861,
                11040
            ],
            [
                11040,
                11108
            ],
            [
                11108,
                11134
            ],
            [
                11153,
                11193
            ],
            [
                11204,
                11412
            ],
            [
                11421,
                11531
            ],
            [
                11532,
                11583
            ],
            [
                11583,
                11638
            ],
            [
                11638,
                11733
            ],
            [
                11739,
                11798
            ],
            [
                11943,
                11951
            ],
            [
                11871,
                11890
            ],
            [
                11815,
                11828
            ],
            [
                11911,
                11942
            ],
            [
                11952,
                11959
            ],
            [
                11891,
                11893
            ],
            [
                11980,
                11984
            ],
            [
                11995,
                12002
            ],
            [
                12015,
                12075
            ],
            [
                12075,
                12147
            ],
            [
                12197,
                12238
            ],
            [
                12238,
                12376
            ],
            [
                12464,
                12590
            ],
            [
                12642,
                12734
            ],
            [
                12748,
                12757
            ],
            [
                12757,
                12799
            ],
            [
                12898,
                12924
            ],
            [
                12875,
                12877
            ],
            [
                12930,
                12940
            ],
            [
                12892,
                12896
            ],
            [
                12954,
                13019
            ],
            [
                13026,
                13029
            ],
            [
                13066,
                13136
            ],
            [
                13142,
                13144
            ],
            [
                13150,
                13160
            ],
            [
                13166,
                13306
            ],
            [
                13306,
                13434
            ],
            [
                13449,
                13472
            ],
            [
                13472,
                13613
            ],
            [
                13613,
                13800
            ],
            [
                13893,
                13896
            ],
            [
                13902,
                13904
            ],
            [
                13904,
                13997
            ],
            [
                14063,
                14385
            ],
            [
                14385,
                14584
            ],
            [
                14589,
                14599
            ],
            [
                14600,
                14613
            ],
            [
                14624,
                14752
            ],
            [
                14752,
                14802
            ],
            [
                14812,
                14825
            ],
            [
                14825,
                14969
            ],
            [
                14969,
                15062
            ],
            [
                15162,
                15248
            ],
            [
                15249,
                15669
            ],
            [
                15669,
                15673
            ],
            [
                15686,
                15719
            ],
            [
                15721,
                15752
            ],
            [
                15754,
                15757
            ],
            [
                15759,
                15796
            ],
            [
                15823,
                15830
            ],
            [
                15846,
                15848
            ],
            [
                15848,
                16005
            ],
            [
                16027,
                16041
            ],
            [
                16043,
                16110
            ],
            [
                16190,
                16201
            ],
            [
                16227,
                16279
            ],
            [
                16164,
                16167
            ],
            [
                16316,
                16394
            ],
            [
                16394,
                16564
            ],
            [
                16706,
                16725
            ],
            [
                16577,
                16590
            ],
            [
                16725,
                16727
            ],
            [
                16727,
                16736
            ],
            [
                16803,
                16817
            ],
            [
                16824,
                16838
            ],
            [
                16838,
                16845
            ],
            [
                16847,
                16849
            ],
            [
                16895,
                16929
            ],
            [
                16994,
                17018
            ],
            [
                17053,
                17055
            ],
            [
                17055,
                17134
            ],
            [
                17182,
                17187
            ],
            [
                17210,
                17239
            ],
            [
                17258,
                17428
            ],
            [
                17466,
                17567
            ],
            [
                17567,
                17571
            ],
            [
                17704,
                17736
            ],
            [
                17747,
                17814
            ],
            [
                18122,
                18124
            ],
            [
                17835,
                17844
            ],
            [
                17873,
                17892
            ],
            [
                17894,
                17940
            ],
            [
                17947,
                18022
            ],
            [
                17870,
                17872
            ],
            [
                18023,
                18056
            ],
            [
                18138,
                18187
            ],
            [
                18187,
                18244
            ],
            [
                18244,
                18262
            ],
            [
                18272,
                18340
            ],
            [
                18340,
                18648
            ],
            [
                18663,
                18669
            ],
            [
                18706,
                18765
            ],
            [
                18768,
                18776
            ],
            [
                18800,
                18902
            ],
            [
                18902,
                18950
            ],
            [
                18951,
                19102
            ],
            [
                19108,
                19140
            ],
            [
                19140,
                19387
            ],
            [
                19387,
                19421
            ],
            [
                19576,
                19622
            ],
            [
                19622,
                19664
            ],
            [
                19676,
                19711
            ],
            [
                19805,
                19835
            ],
            [
                19849,
                20035
            ],
            [
                20039,
                20061
            ],
            [
                20101,
                20260
            ],
            [
                20337,
                20342
            ],
            [
                20418,
                20477
            ],
            [
                20549,
                20551
            ],
            [
                20551,
                20559
            ],
            [
                20572,
                20594
            ],
            [
                20602,
                20625
            ],
            [
                20660,
                20692
            ],
            [
                20692,
                20716
            ],
            [
                20722,
                20783
            ],
            [
                20783,
                20828
            ],
            [
                20828,
                21060
            ],
            [
                21060,
                21096
            ],
            [
                21104,
                21109
            ],
            [
                21177,
                21180
            ],
            [
                21200,
                21271
            ],
            [
                21287,
                21306
            ],
            [
                21306,
                21359
            ],
            [
                21364,
                21371
            ],
            [
                21387,
                21403
            ],
            [
                21523,
                21533
            ],
            [
                21543,
                21544
            ],
            [
                21545,
                21611
            ],
            [
                21611,
                21776
            ],
            [
                21812,
                21817
            ],
            [
                21847,
                21881
            ],
            [
                21881,
                21912
            ],
            [
                21942,
                21944
            ],
            [
                21944,
                21951
            ],
            [
                21966,
                22056
            ],
            [
                22065,
                22080
            ],
            [
                22109,
                22171
            ],
            [
                22198,
                22204
            ],
            [
                22215,
                22259
            ],
            [
                22274,
                22299
            ],
            [
                22353,
                22396
            ],
            [
                22408,
                22466
            ],
            [
                22482,
                22510
            ],
            [
                22521,
                22522
            ],
            [
                22523,
                22619
            ],
            [
                22766,
                22768
            ],
            [
                22768,
                22814
            ],
            [
                22814,
                22884
            ],
            [
                22984,
                23236
            ],
            [
                23236,
                23283
            ],
            [
                23289,
                23314
            ],
            [
                23319,
                23325
            ],
            [
                23329,
                23396
            ],
            [
                23498,
                23537
            ],
            [
                23435,
                23447
            ],
            [
                23542,
                23561
            ],
            [
                23561,
                23643
            ],
            [
                23643,
                23701
            ],
            [
                23710,
                23787
            ],
            [
                23863,
                23865
            ],
            [
                23865,
                23894
            ],
            [
                23894,
                24050
            ],
            [
                24050,
                24126
            ],
            [
                24132,
                24134
            ],
            [
                24268,
                24333
            ],
            [
                24207,
                24208
            ],
            [
                24334,
                24363
            ],
            [
                24409,
                24472
            ],
            [
                24473,
                24475
            ],
            [
                24477,
                24480
            ],
            [
                24482,
                24569
            ],
            [
                24730,
                24753
            ],
            [
                24778,
                24955
            ],
            [
                24955,
                24992
            ],
            [
                25028,
                25118
            ],
            [
                25118,
                25292
            ],
            [
                25461,
                25464
            ],
            [
                25293,
                25435
            ],
            [
                25436,
                25460
            ],
            [
                25465,
                25473
            ],
            [
                25480,
                25498
            ],
            [
                25498,
                25645
            ],
            [
                25655,
                25677
            ],
            [
                25691,
                25838
            ],
            [
                25852,
                25853
            ]
        ],
        "row_chars": [
            [
                0,
                42
            ],
            [
                42,
                211
            ],
            [
                211,
                329
            ],
            [
                329,
                455
            ],
            [
                455,
                509
            ],
            [
                509,
                910
            ],
            [
                910,
                966
            ],
            [
                966,
                1076
            ],
            [
                1076,
                1327
            ],
            [
                1327,
                1449
            ],
            [
                1449,
                1740
            ],
            [
                1740,
                2002
            ],
            [
                2002,
                2085
            ],
            [
                2085,
                2241
            ],
            [
                2241,
                2557
            ],
            [
                2557,
                2701
            ],
            [
                2701,
                2745
            ],
            [
                2745,
                3152
            ],
            [
                3152,
                3258
            ],
            [
                3258,
                3283
            ],
            [
                3283,
                3507
            ],
            [
                3507,
                3676
            ],
            [
                3676,
                3989
            ],
            [
                3989,
                4280
            ],
            [
                4280,
                4710
            ],
            [
                4710,
                4866
            ],
            [
                4866,
                4962
            ],
            [
                4962,
                5153
            ],
            [
                5153,
                5263
            ],
            [
                5263,
                5429
            ],
            [
                5429,
                5665
            ],
            [
                5665,
                5764
            ],
            [
                5764,
                5996
            ],
            [
                5996,
                6112
            ],
            [
                6112,
                6166
            ],
            [
                6166,
                6515
            ],
            [
                6515,
                6686
            ],
            [
                6686,
                6749
            ],
            [
                6749,
                6938
            ],
            [
                6938,
                7027
            ],
            [
                7027,
                7125
            ],
            [
                7125,
                7219
            ],
            [
                7219,
                7659
            ],
            [
                7659,
                7749
            ],
            [
                7749,
                7895
            ],
            [
                7895,
                8432
            ],
            [
                8432,
                8667
            ],
            [
                8667,
                8953
            ],
            [
                8953,
                9316
            ],
            [
                9316,
                9411
            ],
            [
                9411,
                9804
            ],
            [
                9804,
                9982
            ],
            [
                9982,
                10197
            ],
            [
                10197,
                10239
            ],
            [
                10239,
                10426
            ],
            [
                10426,
                10505
            ],
            [
                10505,
                10734
            ],
            [
                10734,
                10791
            ],
            [
                10791,
                10861
            ],
            [
                10861,
                11040
            ],
            [
                11040,
                11108
            ],
            [
                11108,
                11532
            ],
            [
                11532,
                11583
            ],
            [
                11583,
                11638
            ],
            [
                11638,
                12075
            ],
            [
                12075,
                12147
            ],
            [
                12147,
                12197
            ],
            [
                12197,
                12238
            ],
            [
                12238,
                12376
            ],
            [
                12376,
                12464
            ],
            [
                12464,
                12757
            ],
            [
                12757,
                12799
            ],
            [
                12799,
                12869
            ],
            [
                12869,
                13136
            ],
            [
                13136,
                13306
            ],
            [
                13306,
                13472
            ],
            [
                13472,
                13613
            ],
            [
                13613,
                13904
            ],
            [
                13904,
                14385
            ],
            [
                14385,
                14752
            ],
            [
                14752,
                14825
            ],
            [
                14825,
                14969
            ],
            [
                14969,
                15062
            ],
            [
                15062,
                15162
            ],
            [
                15162,
                15249
            ],
            [
                15249,
                15669
            ],
            [
                15669,
                15848
            ],
            [
                15848,
                16394
            ],
            [
                16394,
                16727
            ],
            [
                16727,
                17055
            ],
            [
                17055,
                17567
            ],
            [
                17567,
                18187
            ],
            [
                18187,
                18244
            ],
            [
                18244,
                18340
            ],
            [
                18340,
                18902
            ],
            [
                18902,
                19140
            ],
            [
                19140,
                19387
            ],
            [
                19387,
                19622
            ],
            [
                19622,
                20035
            ],
            [
                20035,
                20260
            ],
            [
                20260,
                20551
            ],
            [
                20551,
                20692
            ],
            [
                20692,
                20783
            ],
            [
                20783,
                20828
            ],
            [
                20828,
                21060
            ],
            [
                21060,
                21306
            ],
            [
                21306,
                21545
            ],
            [
                21545,
                21611
            ],
            [
                21611,
                21776
            ],
            [
                21776,
                21881
            ],
            [
                21881,
                21944
            ],
            [
                21944,
                22768
            ],
            [
                22768,
                22814
            ],
            [
                22814,
                22884
            ],
            [
                22884,
                22984
            ],
            [
                22984,
                23236
            ],
            [
                23236,
                23396
            ],
            [
                23396,
                23561
            ],
            [
                23561,
                23643
            ],
            [
                23643,
                23865
            ],
            [
                23865,
                23894
            ],
            [
                23894,
                24050
            ],
            [
                24050,
                24134
            ],
            [
                24134,
                24473
            ],
            [
                24473,
                24955
            ],
            [
                24955,
                25118
            ],
            [
                25118,
                25498
            ],
            [
                25498,
                25854
            ],
            [
                25854,
                25860
            ]
        ]
    },
    "abridged": {
        "text": "Let other pens dwell on guilt and misery. I quit such odious subjects as soon as I can, impatient to restore everybody not greatly in fault themselves, to tolerable comfort, and to have done with all the rest.\nMy Fanny, indeed, at this very time, must have been happy in spite of everything. She had many sources of delight. She was returned to Mansfield Park, she was useful, she was beloved; she was safe from Mr. Crawford; and when Sir Thomas came back she had every proof that could be given in his melancholy state of spirits, of his perfect approbation and increased regard. Happy as all this must make her, she would still have been happy without any of it, for Edmund was no longer the dupe of Miss Crawford.\nIt is true that Edmund was very far from happy himself. He was grieving over what was, and wishing for what could never be. She knew it was so, and was sorry; but it was with a sorrow so founded on satisfaction, so tending to ease, that there are few who would not have been glad to exchange their greatest gaiety for it.\nPoor Sir Thomas, a parent conscious of errors in his conduct as a parent, was the longest to suffer. He felt that he ought not to have allowed Maria's marriage; that his daughter's sentiments had been sufficiently known to him to render him culpable; that he had been governed by motives of selfishness and worldly wisdom. These were reflections that required some time to soften; but time will do almost everything; and though little comfort arose on Mrs. Rushworth's side for the misery she had caused, some comfort was to be found in his other children.\nJulia's match became a less desperate business than he had considered it at first. She was humble, and wishing to be forgiven; and Mr. Yates, desirous of being received into the family, was disposed to look up to him and be guided. He was not very solid; but there was a hope of his becoming less trifling, of his being at least tolerably domestic and quiet; and there was comfort in finding his estate rather more, and his debts much less, than he had feared, and in being consulted as a respected friend.\nThere was comfort also in Tom, who gradually regained his health, without regaining the thoughtlessness of his previous habits. He was the better for ever for his illness. He had suffered, and he had learned to think: two advantages that he had never known before. He became what he ought to be: useful to his father, steady and quiet, and not living merely for himself.\nHere was comfort indeed! and soon Edmund was contributing to his father's ease by improvement in his spirits. After wandering about and sitting under trees with Fanny all the summer evenings, he had so well talked his mind into submission as to be very tolerably cheerful again.\nThese were the circumstances which gradually reconciled Sir Thomas to himself; though the anguish arising from the conviction of his own errors in the education of his daughters was never to be entirely done away.\nToo late he became aware how unfavourable must be the treatment of Maria and Julia at home, where the excessive indulgence and flattery of their aunt Norris had been continually contrasted with his own severity. He saw how ill he had judged, in expecting to counteract what was wrong in Mrs. Norris by its reverse in himself; clearly saw that he had merely increased the evil by teaching them to repress their spirits in his presence, so as to make their real disposition unknown to him; and sending them to be indulged by a person who could attach them only by the blindness of her affection, and the excess of her praise.\nHere had been grievous mismanagement; but he grew to feel that it had not been the worst mistake in his plan of education. Something must have been lacking within. He feared that principle had been wanting; that they had never been properly taught to govern their inclinations and tempers by a sense of duty. They had been instructed theoretically in their religion, but never required to bring it into daily practice. To be distinguished for elegance and accomplishments could have had no moral effect on the mind. He had meant them to be good, but his cares had been directed to the understanding and manners, not the disposition; and they had never been instructed in self-denial and humility.\nBitterly did he deplore this. Wretchedly did he feel, that with all the care of an anxious and expensive education, he had brought up his daughters without their understanding their first duties, or his being acquainted with their character and temper.\nThe high spirit and strong passions of Mrs. Rushworth, especially, were made known to him only in their sad result. She could not to be prevailed on to leave Mr. Crawford. She hoped to marry him, and they stayed together till she was obliged to be convinced that such hope was vain, and till the disappointment arising from the conviction rendered her temper so bad, and her feelings for him so like hatred, as to make them for a while each other's punishment, and then induce a voluntary separation.\nShe had lived with him to be reproached as the ruin of all his happiness in Fanny, and carried away no better consolation than that she had divided them. What can exceed the misery of such a mind in such a situation?\nMr. Rushworth had no difficulty in procuring a divorce. She had despised him, and loved another; and he had been very much aware that it was so. The indignities of stupidity can excite little pity. His punishment followed his conduct, as did a deeper punishment the deeper guilt of his wife. He was released to be mortified and unhappy, till some other pretty girl could attract him into matrimony again, and he might set forward on a second, and, it is to be hoped, more prosperous trial of the state; while Maria must withdraw to a retirement which could allow no second spring of hope or character.\nWhere she could be placed became a subject of melancholy consultation. Mrs. Norris would have had her received at home and countenanced by them all. Sir Thomas would not hear of it; and Mrs. Norris's anger against Fanny was great, from considering her residence there as the reason, even though Sir Thomas solemnly assured her that, had there been no young woman in question, he would never have offered so great an insult to the neighbourhood as to expect it to receive his daughter into its society. She should be protected by him, and secured in every comfort; but farther than that he could not go. Maria had destroyed her own character, and he would not, by a vain attempt to restore what never could be restored, be an accessory to introducing such misery in another man's family.\nIt ended in Mrs. Norris's resolving to quit Mansfield and devote herself to her unfortunate Maria, in an establishment formed for them in another country, remote and private, where, shut up together with little society, on one side no affection, and on the other no judgment, it may be reasonably supposed that their tempers became their mutual punishment.\nMrs. Norris's removal from Mansfield was the great supplementary comfort of Sir Thomas's life. His opinion of her had been sinking from the day of his return from Antigua: ever since that period, she had been regularly losing ground in his esteem. He had felt her as an hourly evil, all the worse as there seemed no chance of its ceasing; it seemed she must be borne for ever. To be relieved from her, therefore, was a great felicity.\nShe was regretted by no one at Mansfield. She had never been able to attach even those she loved best; and since Mrs. Rushworth's elopement, her temper had been in a state of such irritation as to make her everywhere tormenting. Not even Fanny had tears for aunt Norris when she was gone for ever.\nThat Julia escaped better than Maria was owing, in some measure, to a favourable difference of disposition, but in a greater part to her having been less the darling of that very aunt, less flattered and less spoilt. She had held but a second place. She had been always used to think herself a little inferior to Maria. Her temper was naturally the easiest of the two; her feelings, though quick, were more controllable, and education had not given her so very hurtful a degree of self-consequence.\nShe had submitted the best to the disappointment in Henry Crawford. After the first bitterness of being slighted was over, she had been soon in a fair way of not thinking of him again; and when the acquaintance was renewed in town, and Mr. Rushworth's house became Crawford's object, she had had the merit of withdrawing herself from it, and of choosing that time to pay a visit to her other friends, in order to secure herself from being again too much attracted.\nThis had been her motive in going to her cousin's. Mr. Yates's convenience had had nothing to do with it. She had been allowing his attentions some time, but with very little idea of ever accepting him. Had not her sister's conduct burst forth as it did, and her made her fear the certain consequence of her father's greater severity and restraint, hastily resolving her to avoid such horrors, it is probable that Mr. Yates would never have succeeded. She had not eloped with any worse feelings than those of selfish alarm. Maria's guilt had induced Julia's folly.\nHenry Crawford, ruined by early independence and bad domestic example, indulged in the freaks of a cold-blooded vanity a little too long. Could he have been satisfied with the conquest of one amiable woman's affections, could he have found sufficient exultation in gaining the esteem and tenderness of Fanny Price, there would have been every probability of success for him. His affection had already done something. There can be no doubt that he would have gained more success, especially when that marriage had taken place, which would have assisted him by subduing her first inclination, and brought them very often together. If he had persevered uprightly, Fanny must have been his reward, and a reward very voluntarily bestowed, within a reasonable period from Edmund's marrying Mary.\nHad he done as he intended, and as he knew he ought, by going down to Everingham after his return from Portsmouth, he might have decided his own happy destiny. But he was pressed to stay for Mrs. Fraser's party; his staying was made of flattering consequence, and he was to meet Mrs. Rushworth there. Curiosity and vanity were both engaged, and the temptation of immediate pleasure was too strong for a mind unused to make any sacrifice to right: he resolved to defer his Norfolk journey, and stayed. He saw Mrs. Rushworth, was received by her with a coldness which ought to have been repulsive; but he was mortified, he could not bear to be thrown off by the woman whose smiles had been so wholly at his command: he must exert himself to subdue so proud a display of resentment; it was anger on Fanny's account; he must get the better of it, and make Mrs. Rushworth Maria Bertram again in her treatment of himself.\nIn this spirit he began the attack, and by animated perseverance had soon re-established the sort of familiar intercourse, of gallantry, of flirtation, which bounded his views; but in triumphing over Maria's discretion, which, though originating in anger, might have saved them both, he had put himself in the power of feelings on her side more strong than he had supposed. She loved him; there was no withdrawing attentions dear to her. He was entangled by his own vanity, with as little excuse of love as possible, and without the smallest inconstancy of mind towards her cousin. To keep Fanny and the Bertrams from a knowledge of what was passing became his first object. When he returned from Richmond, he would have been glad to see Mrs. Rushworth no more.\nAll that followed was the result of her imprudence; and he went off with her at last, because he could not help it, regretting Fanny even at the moment, but regretting her infinitely more when all the bustle of the intrigue was over, and a very few months had taught him, by the force of contrast, to place a yet higher value on the sweetness of her temper, the purity of her mind, and the excellence of her principles.\nThat the public punishment of disgrace should in a just measure attend his share of the offence is, we know, not customary in society. In this world the penalty is less equal than could be wished; but without presuming to look forward to a juster appointment hereafter, we may fairly consider Henry Crawford to be providing for himself no small portion of vexation and regret, in having so injured family peace, so forfeited his best, most esteemed and dearest friends, and so lost the woman whom he had rationally as well as passionately loved.\nAfter what had passed to wound and alienate the two families, the continuance of the Bertrams and Grants in such close neighbourhood would have been most distressing; but there was soon a permanent removal of the latter. Dr. Grant succeeded to a post in Westminster Abbey, which as an excuse for residence in London, was highly acceptable to all concerned.\nMrs. Grant, with a temper to love and be loved, must have gone with some regret; but her disposition must in any place secure her a great deal to enjoy, and she had again a home to offer Mary; and Mary had had enough of her own friends, enough of vanity, ambition, love, and disappointment to be in need of the true kindness of her sister's heart, and the rational tranquillity of her ways. They lived together; for Mary, though resolved against ever attaching herself to a younger brother again, failed to find among the idle heir-apparents who were at the command of her beauty, and her twenty thousand pounds, any one who could satisfy the better taste she had acquired at Mansfield, or whose character and manners could put Edmund Bertram sufficiently out of her head.\nEdmund had greatly the advantage of her in this respect. He had not to wait with vacant affections for an object worthy to succeed her in them. Scarcely had he done regretting Mary Crawford, and observing to Fanny how impossible it was that he should ever meet with such another woman, before it began to strike him whether a very different kind of woman might not do just as well, or a great deal better: whether Fanny herself were not growing as dear to him as Mary Crawford had ever been; and whether it might not be possible to persuade her that her warm and sisterly regard for him would be foundation enough for wedded love.\nI purposely abstain from dates on this occasion, so that every one may be at liberty to fix their own, aware that the cure of unconquerable passions, and the transfer of unchanging attachments, must vary as to time in different people. I only entreat everybody to believe that exactly at the time when it was quite natural that it should be so, and not a week earlier, Edmund did cease to care about Miss Crawford, and became as anxious to marry Fanny as Fanny herself could desire.\nWith such a regard for her, indeed, what could be more natural than the change? Loving, guiding, protecting her, as he had done ever since her being ten years old, an object to him of such close interest, dearer by all his own importance with her than any one else at Mansfield, what was there now to add, but that he should learn to prefer soft light eyes to sparkling dark ones. Being always with her, with his feelings exactly in that favourable state which a recent disappointment gives, those soft light eyes could not be very long in obtaining the pre-eminence.\nThere were no doubts of her deserving, no fears of opposition of taste. Her mind, opinions, and habits needed no half-concealment, no reliance on future improvement. Even in the midst of his infatuation, he had acknowledged Fanny's mental superiority. What must be his sense of it now, therefore? She was of course only too good for him; but as nobody minds having what is too good for them, he was very steadily earnest in the pursuit of the blessing, and it was not possible that encouragement from her should be long wanting. Timid, anxious, doubting as she was, he still held out strong hopes of success, though it remained for a later period to tell him the whole astonishing truth. His happiness in knowing himself to have been so long beloved, must have been delightful.\nBut there was happiness elsewhere which no description can reach. Let no one presume to give the feelings of a young woman on receiving the assurance of that affection of which she has scarcely allowed herself to entertain a hope.\nThere was no drawback of poverty or parent. It was a match which Sir Thomas now wished for. Sick of mercenary connexions, prizing more and more the sterling good of principle and temper, and anxious to bind all that remained to him of domestic felicity, he had pondered on the possibility of the two young friends finding consolation in each other; and the joyful consent which met Edmund's request, the high sense of having realised a great acquisition in Fanny for a daughter, formed a striking contrast with his early opinion on the subject when the poor little girl's coming had been first discussed.\nFanny was indeed the daughter that he wanted. His charitable kindness had been rearing a prime comfort for himself. He might have made her childhood happier; but it had been an error of judgment only which had given him the appearance of harshness, and deprived him of her early love; and now, on really knowing each other, their mutual attachment became very strong. After settling her at Thornton Lacey with every attention to her comfort, his object almost every day was to see her there, or to get her away from it.\nNo happiness of son or niece could make Lady Bertram wish the marriage. But it was possible to part with her, because Susan remained to supply her place. Susan became the stationary niece, delighted to be so; and well adapted for it by a readiness of mind, and an inclination for usefulness. Susan could never be spared. First as a comfort to Fanny, then as an auxiliary, and last as her substitute, she was established at Mansfield, with every appearance of equal permanency. Her more fearless disposition and happier nerves made everything easy to her. She was soon welcome and useful to all; and after Fanny's removal, succeeded so naturally to her, as gradually to become, perhaps, the most beloved of the two.\nIn her usefulness, in Fanny's excellence, in William's continued good conduct and rising fame, Sir Thomas saw repeated reason to rejoice in what he had done for them all, and acknowledge the advantages of early hardship and discipline, and the consciousness of being born to struggle and endure.\nWith so much true merit and true love, the happiness of the married cousins must appear as secure as earthly happiness can be. Equally formed for domestic life, and attached to country pleasures, their home was the home of affection and comfort; and to complete the picture of good, the acquisition of the Mansfield living, by the death of Dr. Grant, occurred just after they had been married long enough to begin to want an increase of income, and to feel their distance from their paternal home an inconvenience.\nOn that event they removed to Mansfield; and the Parsonage there, which, under each of its two former owners, Fanny had never been able to approach without some painful sensation or alarm, soon grew as dear to her heart, and as thoroughly perfect in her eyes, as everything else within the view and patronage of Mansfield Park.",
        "paragraph_chars": [
            [
                0,
                210
            ],
            [
                210,
                717
            ],
            [
                717,
                1039
            ],
            [
                1039,
                1596
            ],
            [
                1596,
                2103
            ],
            [
                2103,
                2474
            ],
            [
                2474,
                2753
            ],
            [
                2753,
                2967
            ],
            [
                2967,
                3591
            ],
            [
                3591,
                4288
            ],
            [
                4288,
                4541
            ],
            [
                4541,
                5042
            ],
            [
                5042,
                5259
            ],
            [
                5259,
                5861
            ],
            [
                5861,
                6648
            ],
            [
                6648,
                7005
            ],
            [
                7005,
                7440
            ],
            [
                7440,
                7738
            ],
            [
                7738,
                8237
            ],
            [
                8237,
                8702
            ],
            [
                8702,
                9267
            ],
            [
                9267,
                10057
            ],
            [
                10057,
                10973
            ],
            [
                10973,
                11735
            ],
            [
                11735,
                12155
            ],
            [
                12155,
                12701
            ],
            [
                12701,
                13058
            ],
            [
                13058,
                13831
            ],
            [
                13831,
                14462
            ],
            [
                14462,
                14945
            ],
            [
                14945,
                15513
            ],
            [
                15513,
                16291
            ],
            [
                16291,
                16522
            ],
            [
                16522,
                17127
            ],
            [
                17127,
                17647
            ],
            [
                17647,
                18362
            ],
            [
                18362,
                18658
            ],
            [
                18658,
                19173
            ],
            [
                19173,
                19500
            ]
        ],
        "segment_chars": [
            [
                0,
                42
            ],
            [
                42,
                210
            ],
            [
                210,
                292
            ],
            [
                292,
                325
            ],
            [
                325,
                581
            ],
            [
                581,
                717
            ],
            [
                717,
                773
            ],
            [
                773,
                841
            ],
            [
                841,
                1039
            ],
            [
                1039,
                1140
            ],
            [
                1140,
                1362
            ],
            [
                1362,
                1596
            ],
            [
                1596,
                1679
            ],
            [
                1679,
                1828
            ],
            [
                1828,
                2103
            ],
            [
                2103,
                2231
            ],
            [
                2231,
                2275
            ],
            [
                2275,
                2368
            ],
            [
                2368,
                2474
            ],
            [
                2474,
                2499
            ],
            [
                2499,
                2584
            ],
            [
                2584,
                2753
            ],
            [
                2753,
                2967
            ],
            [
                2967,
                3179
            ],
            [
                3179,
                3591
            ],
            [
                3591,
                3714
            ],
            [
                3714,
                3755
            ],
            [
                3755,
                3900
            ],
            [
                3900,
                4010
            ],
            [
                4010,
                4107
            ],
            [
                4107,
                4288
            ],
            [
                4288,
                4318
            ],
            [
                4318,
                4541
            ],
            [
                4541,
                4657
            ],
            [
                4657,
                4713
            ],
            [
                4713,
                5042
            ],
            [
                5042,
                5196
            ],
            [
                5196,
                5259
            ],
            [
                5259,
                5315
            ],
            [
                5315,
                5404
            ],
            [
                5404,
                5457
            ],
            [
                5457,
                5551
            ],
            [
                5551,
                5861
            ],
            [
                5861,
                5932
            ],
            [
                5932,
                6010
            ],
            [
                6010,
                6363
            ],
            [
                6363,
                6464
            ],
            [
                6464,
                6648
            ],
            [
                6648,
                7005
            ],
            [
                7005,
                7100
            ],
            [
                7100,
                7253
            ],
            [
                7253,
                7382
            ],
            [
                7382,
                7440
            ],
            [
                7440,
                7482
            ],
            [
                7482,
                7669
            ],
            [
                7669,
                7738
            ],
            [
                7738,
                7955
            ],
            [
                7955,
                7988
            ],
            [
                7988,
                8058
            ],
            [
                8058,
                8237
            ],
            [
                8237,
                8305
            ],
            [
                8305,
                8702
            ],
            [
                8702,
                8753
            ],
            [
                8753,
                8808
            ],
            [
                8808,
                8905
            ],
            [
                8905,
                9154
            ],
            [
                9154,
                9226
            ],
            [
                9226,
                9267
            ],
            [
                9267,
                9405
            ],
            [
                9405,
                9642
            ],
            [
                9642,
                9684
            ],
            [
                9684,
                9896
            ],
            [
                9896,
                10057
            ],
            [
                10057,
                10217
            ],
            [
                10217,
                10358
            ],
            [
                10358,
                10558
            ],
            [
                10558,
                10973
            ],
            [
                10973,
                11347
            ],
            [
                11347,
                11411
            ],
            [
                11411,
                11555
            ],
            [
                11555,
                11648
            ],
            [
                11648,
                11735
            ],
            [
                11735,
                12155
            ],
            [
                12155,
                12290
            ],
            [
                12290,
                12701
            ],
            [
                12701,
                12922
            ],
            [
                12922,
                13058
            ],
            [
                13058,
                13449
            ],
            [
                13449,
                13831
            ],
            [
                13831,
                13888
            ],
            [
                13888,
                13975
            ],
            [
                13975,
                14462
            ],
            [
                14462,
                14698
            ],
            [
                14698,
                14945
            ],
            [
                14945,
                15025
            ],
            [
                15025,
                15326
            ],
            [
                15326,
                15513
            ],
            [
                15513,
                15585
            ],
            [
                15585,
                15679
            ],
            [
                15679,
                15765
            ],
            [
                15765,
                15810
            ],
            [
                15810,
                16042
            ],
            [
                16042,
                16201
            ],
            [
                16201,
                16291
            ],
            [
                16291,
                16357
            ],
            [
                16357,
                16522
            ],
            [
                16522,
                16566
            ],
            [
                16566,
                16614
            ],
            [
                16614,
                17127
            ],
            [
                17127,
                17173
            ],
            [
                17173,
                17243
            ],
            [
                17243,
                17495
            ],
            [
                17495,
                17647
            ],
            [
                17647,
                17719
            ],
            [
                17719,
                17801
            ],
            [
                17801,
                17939
            ],
            [
                17939,
                17968
            ],
            [
                17968,
                18124
            ],
            [
                18124,
                18202
            ],
            [
                18202,
                18362
            ],
            [
                18362,
                18658
            ],
            [
                18658,
                18785
            ],
            [
                18785,
                19173
            ],
            [
                19173,
                19500
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                42,
                118
            ],
            [
                119,
                210
            ],
            [
                210,
                246
            ],
            [
                247,
                292
            ],
            [
                292,
                299
            ],
            [
                305,
                323
            ],
            [
                323,
                325
            ],
            [
                325,
                502
            ],
            [
                503,
                579
            ],
            [
                581,
                717
            ],
            [
                717,
                773
            ],
            [
                773,
                779
            ],
            [
                780,
                841
            ],
            [
                841,
                948
            ],
            [
                949,
                971
            ],
            [
                978,
                1039
            ],
            [
                1039,
                1064
            ],
            [
                1065,
                1091
            ],
            [
                1092,
                1140
            ],
            [
                1140,
                1181
            ],
            [
                1190,
                1288
            ],
            [
                1288,
                1294
            ],
            [
                1295,
                1301
            ],
            [
                1302,
                1362
            ],
            [
                1362,
                1535
            ],
            [
                1542,
                1543
            ],
            [
                1549,
                1572
            ],
            [
                1573,
                1595
            ],
            [
                1596,
                1679
            ],
            [
                1679,
                1755
            ],
            [
                1756,
                1828
            ],
            [
                1828,
                1958
            ],
            [
                1959,
                2079
            ],
            [
                2080,
                2082
            ],
            [
                2095,
                2101
            ],
            [
                2101,
                2102
            ],
            [
                2103,
                2206
            ],
            [
                2207,
                2231
            ],
            [
                2231,
                2275
            ],
            [
                2275,
                2366
            ],
            [
                2366,
                2368
            ],
            [
                2368,
                2474
            ],
            [
                2474,
                2499
            ],
            [
                2499,
                2502
            ],
            [
                2503,
                2507
            ],
            [
                2508,
                2570
            ],
            [
                2571,
                2584
            ],
            [
                2584,
                2753
            ],
            [
                2753,
                2781
            ],
            [
                2782,
                2797
            ],
            [
                2798,
                2806
            ],
            [
                2809,
                2819
            ],
            [
                2820,
                2967
            ],
            [
                2967,
                3008
            ],
            [
                3009,
                3020
            ],
            [
                3021,
                3030
            ],
            [
                3031,
                3033
            ],
            [
                3034,
                3049
            ],
            [
                3050,
                3116
            ],
            [
                3124,
                3179
            ],
            [
                3179,
                3316
            ],
            [
                3324,
                3400
            ],
            [
                3400,
                3401
            ],
            [
                3402,
                3453
            ],
            [
                3455,
                3471
            ],
            [
                3472,
                3474
            ],
            [
                3478,
                3483
            ],
            [
                3490,
                3502
            ],
            [
                3509,
                3591
            ],
            [
                3591,
                3632
            ],
            [
                3633,
                3635
            ],
            [
                3636,
                3673
            ],
            [
                3680,
                3714
            ],
            [
                3714,
                3738
            ],
            [
                3747,
                3753
            ],
            [
                3753,
                3755
            ],
            [
                3755,
                3779
            ],
            [
                3780,
                3882
            ],
            [
                3885,
                3898
            ],
            [
                3898,
                3900
            ],
            [
                3900,
                4010
            ],
            [
                4010,
                4062
            ],
            [
                4063,
                4077
            ],
            [
                4078,
                4107
            ],
            [
                4107,
                4227
            ],
            [
                4228,
                4242
            ],
            [
                4262,
                4286
            ],
            [
                4286,
                4288
            ],
            [
                4288,
                4311
            ],
            [
                4316,
                4318
            ],
            [
                4318,
                4359
            ],
            [
                4360,
                4541
            ],
            [
                4541,
                4657
            ],
            [
                4657,
                4660
            ],
            [
                4667,
                4713
            ],
            [
                4713,
                4745
            ],
            [
                4753,
                4851
            ],
            [
                4852,
                5042
            ],
            [
                5042,
                5163
            ],
            [
                5164,
                5177
            ],
            [
                5178,
                5181
            ],
            [
                5182,
                5196
            ],
            [
                5196,
                5259
            ],
            [
                5259,
                5313
            ],
            [
                5313,
                5315
            ],
            [
                5315,
                5404
            ],
            [
                5404,
                5432
            ],
            [
                5433,
                5457
            ],
            [
                5457,
                5551
            ],
            [
                5551,
                5553
            ],
            [
                5554,
                5566
            ],
            [
                5567,
                5760
            ],
            [
                5760,
                5767
            ],
            [
                5774,
                5787
            ],
            [
                5788,
                5803
            ],
            [
                5804,
                5861
            ],
            [
                5861,
                5906
            ],
            [
                5907,
                5917
            ],
            [
                5918,
                5932
            ],
            [
                5932,
                5943
            ],
            [
                5944,
                6010
            ],
            [
                6010,
                6084
            ],
            [
                6090,
                6108
            ],
            [
                6109,
                6112
            ],
            [
                6113,
                6135
            ],
            [
                6142,
                6143
            ],
            [
                6149,
                6166
            ],
            [
                6167,
                6235
            ],
            [
                6235,
                6323
            ],
            [
                6332,
                6335
            ],
            [
                6354,
                6361
            ],
            [
                6361,
                6363
            ],
            [
                6363,
                6423
            ],
            [
                6423,
                6441
            ],
            [
                6442,
                6446
            ],
            [
                6447,
                6464
            ],
            [
                6464,
                6579
            ],
            [
                6580,
                6582
            ],
            [
                6586,
                6646
            ],
            [
                6646,
                6648
            ],
            [
                6648,
                6746
            ],
            [
                6747,
                6766
            ],
            [
                6767,
                6893
            ],
            [
                6894,
                6897
            ],
            [
                6898,
                7005
            ],
            [
                7005,
                7100
            ],
            [
                7100,
                7176
            ],
            [
                7188,
                7199
            ],
            [
                7199,
                7251
            ],
            [
                7251,
                7253
            ],
            [
                7253,
                7287
            ],
            [
                7292,
                7301
            ],
            [
                7302,
                7342
            ],
            [
                7342,
                7343
            ],
            [
                7347,
                7353
            ],
            [
                7354,
                7357
            ],
            [
                7358,
                7382
            ],
            [
                7382,
                7421
            ],
            [
                7422,
                7423
            ],
            [
                7424,
                7429
            ],
            [
                7430,
                7438
            ],
            [
                7438,
                7440
            ],
            [
                7440,
                7482
            ],
            [
                7482,
                7669
            ],
            [
                7669,
                7709
            ],
            [
                7710,
                7738
            ],
            [
                7738,
                7844
            ],
            [
                7844,
                7862
            ],
            [
                7868,
                7955
            ],
            [
                7959,
                7988
            ],
            [
                7988,
                8058
            ],
            [
                8058,
                8237
            ],
            [
                8237,
                8305
            ],
            [
                8305,
                8331
            ],
            [
                8332,
                8372
            ],
            [
                8373,
                8581
            ],
            [
                8591,
                8701
            ],
            [
                8702,
                8753
            ],
            [
                8753,
                8808
            ],
            [
                8808,
                8903
            ],
            [
                8905,
                8964
            ],
            [
                8965,
                8973
            ],
            [
                8983,
                9002
            ],
            [
                9003,
                9016
            ],
            [
                9019,
                9050
            ],
            [
                9051,
                9058
            ],
            [
                9073,
                9075
            ],
            [
                9082,
                9086
            ],
            [
                9087,
                9094
            ],
            [
                9094,
                9154
            ],
            [
                9154,
                9226
            ],
            [
                9226,
                9267
            ],
            [
                9267,
                9405
            ],
            [
                9405,
                9531
            ],
            [
                9540,
                9632
            ],
            [
                9633,
                9642
            ],
            [
                9642,
                9684
            ],
            [
                9684,
                9710
            ],
            [
                9711,
                9713
            ],
            [
                9714,
                9724
            ],
            [
                9732,
                9736
            ],
            [
                9744,
                9809
            ],
            [
                9819,
                9822
            ],
            [
                9826,
                9896
            ],
            [
                9899,
                9901
            ],
            [
                9906,
                9916
            ],
            [
                9917,
                10057
            ],
            [
                10057,
                10185
            ],
            [
                10194,
                10217
            ],
            [
                10217,
                10358
            ],
            [
                10358,
                10545
            ],
            [
                10546,
                10549
            ],
            [
                10556,
                10558
            ],
            [
                10558,
                10651
            ],
            [
                10651,
                10973
            ],
            [
                10973,
                11172
            ],
            [
                11181,
                11191
            ],
            [
                11193,
                11206
            ],
            [
                11219,
                11347
            ],
            [
                11347,
                11397
            ],
            [
                11398,
                11411
            ],
            [
                11411,
                11555
            ],
            [
                11555,
                11648
            ],
            [
                11648,
                11734
            ],
            [
                11735,
                12155
            ],
            [
                12155,
                12159
            ],
            [
                12160,
                12193
            ],
            [
                12194,
                12225
            ],
            [
                12226,
                12229
            ],
            [
                12230,
                12267
            ],
            [
                12281,
                12288
            ],
            [
                12288,
                12290
            ],
            [
                12290,
                12447
            ],
            [
                12448,
                12462
            ],
            [
                12463,
                12530
            ],
            [
                12530,
                12541
            ],
            [
                12542,
                12594
            ],
            [
                12604,
                12607
            ],
            [
                12623,
                12701
            ],
            [
                12701,
                12871
            ],
            [
                12887,
                12906
            ],
            [
                12907,
                12920
            ],
            [
                12920,
                12922
            ],
            [
                12922,
                12931
            ],
            [
                12932,
                12946
            ],
            [
                12952,
                12966
            ],
            [
                12972,
                12979
            ],
            [
                12980,
                12982
            ],
            [
                12983,
                13017
            ],
            [
                13018,
                13042
            ],
            [
                13056,
                13058
            ],
            [
                13058,
                13137
            ],
            [
                13137,
                13142
            ],
            [
                13147,
                13176
            ],
            [
                13177,
                13347
            ],
            [
                13348,
                13449
            ],
            [
                13449,
                13453
            ],
            [
                13454,
                13486
            ],
            [
                13487,
                13554
            ],
            [
                13562,
                13564
            ],
            [
                13570,
                13579
            ],
            [
                13580,
                13599
            ],
            [
                13600,
                13646
            ],
            [
                13669,
                13744
            ],
            [
                13745,
                13747
            ],
            [
                13748,
                13781
            ],
            [
                13782,
                13831
            ],
            [
                13831,
                13888
            ],
            [
                13888,
                13906
            ],
            [
                13907,
                13975
            ],
            [
                13975,
                14283
            ],
            [
                14284,
                14290
            ],
            [
                14291,
                14350
            ],
            [
                14351,
                14359
            ],
            [
                14360,
                14462
            ],
            [
                14462,
                14510
            ],
            [
                14514,
                14665
            ],
            [
                14666,
                14698
            ],
            [
                14698,
                14945
            ],
            [
                14945,
                14979
            ],
            [
                14979,
                15025
            ],
            [
                15025,
                15067
            ],
            [
                15073,
                15108
            ],
            [
                15109,
                15139
            ],
            [
                15140,
                15326
            ],
            [
                15326,
                15348
            ],
            [
                15354,
                15513
            ],
            [
                15513,
                15518
            ],
            [
                15524,
                15583
            ],
            [
                15583,
                15585
            ],
            [
                15585,
                15593
            ],
            [
                15593,
                15615
            ],
            [
                15623,
                15646
            ],
            [
                15647,
                15679
            ],
            [
                15679,
                15703
            ],
            [
                15704,
                15765
            ],
            [
                15765,
                15810
            ],
            [
                15810,
                16042
            ],
            [
                16042,
                16078
            ],
            [
                16082,
                16087
            ],
            [
                16093,
                16096
            ],
            [
                16110,
                16181
            ],
            [
                16182,
                16201
            ],
            [
                16201,
                16254
            ],
            [
                16255,
                16262
            ],
            [
                16262,
                16278
            ],
            [
                16279,
                16289
            ],
            [
                16289,
                16290
            ],
            [
                16291,
                16357
            ],
            [
                16357,
                16522
            ],
            [
                16522,
                16527
            ],
            [
                16532,
                16566
            ],
            [
                16566,
                16597
            ],
            [
                16612,
                16614
            ],
            [
                16614,
                16621
            ],
            [
                16622,
                16712
            ],
            [
                16713,
                16728
            ],
            [
                16729,
                16791
            ],
            [
                16792,
                16798
            ],
            [
                16799,
                16843
            ],
            [
                16844,
                16869
            ],
            [
                16869,
                16912
            ],
            [
                16920,
                16978
            ],
            [
                16979,
                17007
            ],
            [
                17008,
                17009
            ],
            [
                17019,
                17115
            ],
            [
                17125,
                17127
            ],
            [
                17127,
                17173
            ],
            [
                17173,
                17243
            ],
            [
                17243,
                17495
            ],
            [
                17495,
                17542
            ],
            [
                17543,
                17568
            ],
            [
                17573,
                17579
            ],
            [
                17580,
                17647
            ],
            [
                17647,
                17686
            ],
            [
                17687,
                17699
            ],
            [
                17700,
                17719
            ],
            [
                17719,
                17801
            ],
            [
                17801,
                17859
            ],
            [
                17860,
                17937
            ],
            [
                17937,
                17939
            ],
            [
                17939,
                17968
            ],
            [
                17968,
                18124
            ],
            [
                18124,
                18200
            ],
            [
                18200,
                18202
            ],
            [
                18202,
                18267
            ],
            [
                18267,
                18268
            ],
            [
                18269,
                18298
            ],
            [
                18298,
                18361
            ],
            [
                18362,
                18364
            ],
            [
                18365,
                18368
            ],
            [
                18369,
                18456
            ],
            [
                18457,
                18480
            ],
            [
                18481,
                18658
            ],
            [
                18658,
                18695
            ],
            [
                18695,
                18785
            ],
            [
                18785,
                18959
            ],
            [
                18960,
                18963
            ],
            [
                18964,
                19106
            ],
            [
                19110,
                19134
            ],
            [
                19141,
                19149
            ],
            [
                19155,
                19173
            ],
            [
                19173,
                19320
            ],
            [
                19329,
                19351
            ],
            [
                19352,
                19499
            ],
            [
                19499,
                19500
            ]
        ],
        "row_chars": [
            [
                0,
                42
            ],
            [
                42,
                210
            ],
            [
                210,
                292
            ],
            [
                292,
                292
            ],
            [
                292,
                325
            ],
            [
                325,
                717
            ],
            [
                717,
                773
            ],
            [
                773,
                841
            ],
            [
                841,
                1039
            ],
            [
                1039,
                1140
            ],
            [
                1140,
                1362
            ],
            [
                1362,
                1596
            ],
            [
                1596,
                1679
            ],
            [
                1679,
                1828
            ],
            [
                1828,
                2103
            ],
            [
                2103,
                2231
            ],
            [
                2231,
                2275
            ],
            [
                2275,
                2368
            ],
            [
                2368,
                2474
            ],
            [
                2474,
                2499
            ],
            [
                2499,
                2584
            ],
            [
                2584,
                2753
            ],
            [
                2753,
                2967
            ],
            [
                2967,
                3179
            ],
            [
                3179,
                3591
            ],
            [
                3591,
                3714
            ],
            [
                3714,
                3755
            ],
            [
                3755,
                3900
            ],
            [
                3900,
                4010
            ],
            [
                4010,
                4107
            ],
            [
                4107,
                4288
            ],
            [
                4288,
                4318
            ],
            [
                4318,
                4541
            ],
            [
                4541,
                4657
            ],
            [
                4657,
                4713
            ],
            [
                4713,
                5042
            ],
            [
                5042,
                5196
            ],
            [
                5196,
                5259
            ],
            [
                5259,
                5315
            ],
            [
                5315,
                5404
            ],
            [
                5404,
                5457
            ],
            [
                5457,
                5551
            ],
            [
                5551,
                5861
            ],
            [
                5861,
                5932
            ],
            [
                5932,
                6010
            ],
            [
                6010,
                6363
            ],
            [
                6363,
                6464
            ],
            [
                6464,
                6648
            ],
            [
                6648,
                7005
            ],
            [
                7005,
                7100
            ],
            [
                7100,
                7253
            ],
            [
                7253,
                7382
            ],
            [
                7382,
                7440
            ],
            [
                7440,
                7482
            ],
            [
                7482,
                7669
            ],
            [
                7669,
                7738
            ],
            [
                7738,
                7955
            ],
            [
                7955,
                7988
            ],
            [
                7988,
                8058
            ],
            [
                8058,
                8237
            ],
            [
                8237,
                8305
            ],
            [
                8305,
                8702
            ],
            [
                8702,
                8753
            ],
            [
                8753,
                8808
            ],
            [
                8808,
                9154
            ],
            [
                9154,
                9226
            ],
            [
                9226,
                9226
            ],
            [
                9226,
                9267
            ],
            [
                9267,
                9405
            ],
            [
                9405,
                9405
            ],
            [
                9405,
                9642
            ],
            [
                9642,
                9684
            ],
            [
                9684,
                9684
            ],
            [
                9684,
                9896
            ],
            [
                9896,
                10057
            ],
            [
                10057,
                10217
            ],
            [
                10217,
                10358
            ],
            [
                10358,
                10558
            ],
            [
                10558,
                10973
            ],
            [
                10973,
                11347
            ],
            [
                11347,
                11411
            ],
            [
                11411,
                11555
            ],
            [
                11555,
                11648
            ],
            [
                11648,
                11648
            ],
            [
                11648,
                11735
            ],
            [
                11735,
                12155
            ],
            [
                12155,
                12290
            ],
            [
                12290,
                12701
            ],
            [
                12701,
                12922
            ],
            [
                12922,
                13058
            ],
            [
                13058,
                13449
            ],
            [
                13449,
                13831
            ],
            [
                13831,
                13888
            ],
            [
                13888,
                13975
            ],
            [
                13975,
                14462
            ],
            [
                14462,
                14698
            ],
            [
                14698,
                14945
            ],
            [
                14945,
                15025
            ],
            [
                15025,
                15326
            ],
            [
                15326,
                15513
            ],
            [
                15513,
                15585
            ],
            [
                15585,
                15679
            ],
            [
                15679,
                15765
            ],
            [
                15765,
                15810
            ],
            [
                15810,
                16042
            ],
            [
                16042,
                16201
            ],
            [
                16201,
                16291
            ],
            [
                16291,
                16357
            ],
            [
                16357,
                16522
            ],
            [
                16522,
                16566
            ],
            [
                16566,
                16614
            ],
            [
                16614,
                17127
            ],
            [
                17127,
                17173
            ],
            [
                17173,
                17243
            ],
            [
                17243,
                17243
            ],
            [
                17243,
                17495
            ],
            [
                17495,
                17647
            ],
            [
                17647,
                17719
            ],
            [
                17719,
                17801
            ],
            [
                17801,
                17939
            ],
            [
                17939,
                17968
            ],
            [
                17968,
                18124
            ],
            [
                18124,
                18202
            ],
            [
                18202,
                18362
            ],
            [
                18362,
                18658
            ],
            [
                18658,
                18785
            ],
            [
                18785,
                19173
            ],
            [
                19173,
                19500
            ],
            [
                19500,
                19500
            ]
        ]
    }
}