{
    "original": {
        "text": "\"Well, Fanny, and how do you like Miss Crawford _now_?\" said Edmund the next day, after thinking some time on the subject himself. \"How did you like her yesterday?\"\n\"Very well-very much. I like to hear her talk. She entertains me; and she is so extremely pretty, that I have great pleasure in looking at her.\"\n\"It is her countenance that is so attractive. She has a wonderful play of feature! But was there nothing in her conversation that struck you, Fanny, as not quite right?\"\n\"Oh yes! she ought not to have spoken of her uncle as she did. I was quite astonished. An uncle with whom she has been living so many years, and who, whatever his faults may be, is so very fond of her brother, treating him, they say, quite like a son. I could not have believed it!\"\n\"I thought you would be struck. It was very wrong; very indecorous.\"\n\"And very ungrateful, I think.\"\n\"Ungrateful is a strong word. I do not know that her uncle has any claim to her _gratitude_; his wife certainly had; and it is the warmth of her respect for her aunt's memory which misleads her here. She is awkwardly circumstanced. With such warm feelings and lively spirits it must be difficult to do justice to her affection for Mrs. Crawford, without throwing a shade on the Admiral. I do not pretend to know which was most to blame in their disagreements, though the Admiral's present conduct might incline one to the side of his wife; but it is natural and amiable that Miss Crawford should acquit her aunt entirely. I do not censure her _opinions_; but there certainly _is_ impropriety in making them public.\"\n\"Do not you think,\" said Fanny, after a little consideration, \"that this impropriety is a reflection itself upon Mrs. Crawford, as her niece has been entirely brought up by her? She cannot have given her right notions of what was due to the Admiral.\"\n\"That is a fair remark. Yes, we must suppose the faults of the niece to have been those of the aunt; and it makes one more sensible of the disadvantages she has been under. But I think her present home must do her good. Mrs. Grant's manners are just what they ought to be. She speaks of her brother with a very pleasing affection.\"\n\"Yes, except as to his writing her such short letters. She made me almost laugh; but I cannot rate so very highly the love or good-nature of a brother who will not give himself the trouble of writing anything worth reading to his sisters, when they are separated. I am sure William would never have used _me_ so, under any circumstances. And what right had she to suppose that _you_ would not write long letters when you were absent?\"\n\"The right of a lively mind, Fanny, seizing whatever may contribute to its own amusement or that of others; perfectly allowable, when untinctured by ill-humour or roughness; and there is not a shadow of either in the countenance or manner of Miss Crawford: nothing sharp, or loud, or coarse. She is perfectly feminine, except in the instances we have been speaking of. There she cannot be justified. I am glad you saw it all as I did.\"\nHaving formed her mind and gained her affections, he had a good chance of her thinking like him; though at this period, and on this subject, there began now to be some danger of dissimilarity, for he was in a line of admiration of Miss Crawford, which might lead him where Fanny could not follow. Miss Crawford's attractions did not lessen. The harp arrived, and rather added to her beauty, wit, and good-humour; for she played with the greatest obligingness, with an expression and taste which were peculiarly becoming, and there was something clever to be said at the close of every air. Edmund was at the Parsonage every day, to be indulged with his favourite instrument: one morning secured an invitation for the next; for the lady could not be unwilling to have a listener, and every thing was soon in a fair train.\nA young woman, pretty, lively, with a harp as elegant as herself, and both placed near a window, cut down to the ground, and opening on a little lawn, surrounded by shrubs in the rich foliage of summer, was enough to catch any man's heart. The season, the scene, the air, were all favourable to tenderness and sentiment. Mrs. Grant and her tambour frame were not without their use: it was all in harmony; and as everything will turn to account when love is once set going, even the sandwich tray, and Dr. Grant doing the honours of it, were worth looking at. Without studying the business, however, or knowing what he was about, Edmund was beginning, at the end of a week of such intercourse, to be a good deal in love; and to the credit of the lady it may be added that, without his being a man of the world or an elder brother, without any of the arts of flattery or the gaieties of small talk, he began to be agreeable to her. She felt it to be so, though she had not foreseen, and could hardly understand it; for he was not pleasant by any common rule: he talked no nonsense; he paid no compliments; his opinions were unbending, his attentions tranquil and simple. There was a charm, perhaps, in his sincerity, his steadiness, his integrity, which Miss Crawford might be equal to feel, though not equal to discuss with herself. She did not think very much about it, however: he pleased her for the present; she liked to have him near her; it was enough.\nFanny could not wonder that Edmund was at the Parsonage every morning; she would gladly have been there too, might she have gone in uninvited and unnoticed, to hear the harp; neither could she wonder that, when the evening stroll was over, and the two families parted again, he should think it right to attend Mrs. Grant and her sister to their home, while Mr. Crawford was devoted to the ladies of the Park; but she thought it a very bad exchange; and if Edmund were not there to mix the wine and water for her, would rather go without it than not. She was a little surprised that he could spend so many hours with Miss Crawford, and not see more of the sort of fault which he had already observed, and of which _she_ was almost always reminded by a something of the same nature whenever she was in her company; but so it was. Edmund was fond of speaking to her of Miss Crawford, but he seemed to think it enough that the Admiral had since been spared; and she scrupled to point out her own remarks to him, lest it should appear like ill-nature. The first actual pain which Miss Crawford occasioned her was the consequence of an inclination to learn to ride, which the former caught, soon after her being settled at Mansfield, from the example of the young ladies at the Park, and which, when Edmund's acquaintance with her increased, led to his encouraging the wish, and the offer of his own quiet mare for the purpose of her first attempts, as the best fitted for a beginner that either stable could furnish. No pain, no injury, however, was designed by him to his cousin in this offer: _she_ was not to lose a day's exercise by it. The mare was only to be taken down to the Parsonage half an hour before her ride were to begin; and Fanny, on its being first proposed, so far from feeling slighted, was almost over-powered with gratitude that he should be asking her leave for it.\nMiss Crawford made her first essay with great credit to herself, and no inconvenience to Fanny. Edmund, who had taken down the mare and presided at the whole, returned with it in excellent time, before either Fanny or the steady old coachman, who always attended her when she rode without her cousins, were ready to set forward. The second day's trial was not so guiltless. Miss Crawford's enjoyment of riding was such that she did not know how to leave off. Active and fearless, and though rather small, strongly made, she seemed formed for a horsewoman; and to the pure genuine pleasure of the exercise, something was probably added in Edmund's attendance and instructions, and something more in the conviction of very much surpassing her sex in general by her early progress, to make her unwilling to dismount. Fanny was ready and waiting, and Mrs. Norris was beginning to scold her for not being gone, and still no horse was announced, no Edmund appeared. To avoid her aunt, and look for him, she went out.\nThe houses, though scarcely half a mile apart, were not within sight of each other; but, by walking fifty yards from the hall door, she could look down the park, and command a view of the Parsonage and all its demesnes, gently rising beyond the village road; and in Dr. Grant's meadow she immediately saw the group-Edmund and Miss Crawford both on horse-back, riding side by side, Dr. and Mrs. Grant, and Mr. Crawford, with two or three grooms, standing about and looking on. A happy party it appeared to her, all interested in one object: cheerful beyond a doubt, for the sound of merriment ascended even to her. It was a sound which did not make _her_ cheerful; she wondered that Edmund should forget her, and felt a pang. She could not turn her eyes from the meadow; she could not help watching all that passed. At first Miss Crawford and her companion made the circuit of the field, which was not small, at a foot's pace; then, at _her_ apparent suggestion, they rose into a canter; and to Fanny's timid nature it was most astonishing to see how well she sat. After a few minutes they stopped entirely. Edmund was close to her; he was speaking to her; he was evidently directing her management of the bridle; he had hold of her hand; she saw it, or the imagination supplied what the eye could not reach. She must not wonder at all this; what could be more natural than that Edmund should be making himself useful, and proving his good-nature by any one? She could not but think, indeed, that Mr. Crawford might as well have saved him the trouble; that it would have been particularly proper and becoming in a brother to have done it himself; but Mr. Crawford, with all his boasted good-nature, and all his coachmanship, probably knew nothing of the matter, and had no active kindness in comparison of Edmund. She began to think it rather hard upon the mare to have such double duty; if she were forgotten, the poor mare should be remembered.\nHer feelings for one and the other were soon a little tranquillised by seeing the party in the meadow disperse, and Miss Crawford still on horseback, but attended by Edmund on foot, pass through a gate into the lane, and so into the park, and make towards the spot where she stood. She began then to be afraid of appearing rude and impatient; and walked to meet them with a great anxiety to avoid the suspicion.\n\"My dear Miss Price,\" said Miss Crawford, as soon as she was at all within hearing, \"I am come to make my own apologies for keeping you waiting; but I have nothing in the world to say for myself-I knew it was very late, and that I was behaving extremely ill; and therefore, if you please, you must forgive me. Selfishness must always be forgiven, you know, because there is no hope of a cure.\"\nFanny's answer was extremely civil, and Edmund added his conviction that she could be in no hurry. \"For there is more than time enough for my cousin to ride twice as far as she ever goes,\" said he, \"and you have been promoting her comfort by preventing her from setting off half an hour sooner: clouds are now coming up, and she will not suffer from the heat as she would have done then. I wish _you_ may not be fatigued by so much exercise. I wish you had saved yourself this walk home.\"\n\"No part of it fatigues me but getting off this horse, I assure you,\" said she, as she sprang down with his help; \"I am very strong. Nothing ever fatigues me but doing what I do not like. Miss Price, I give way to you with a very bad grace; but I sincerely hope you will have a pleasant ride, and that I may have nothing but good to hear of this dear, delightful, beautiful animal.\"\nThe old coachman, who had been waiting about with his own horse, now joining them, Fanny was lifted on hers, and they set off across another part of the park; her feelings of discomfort not lightened by seeing, as she looked back, that the others were walking down the hill together to the village; nor did her attendant do her much good by his comments on Miss Crawford's great cleverness as a horse-woman, which he had been watching with an interest almost equal to her own.\n\"It is a pleasure to see a lady with such a good heart for riding!\" said he. \"I never see one sit a horse better. She did not seem to have a thought of fear. Very different from you, miss, when you first began, six years ago come next Easter. Lord bless you! how you did tremble when Sir Thomas first had you put on!\"\nIn the drawing-room Miss Crawford was also celebrated. Her merit in being gifted by Nature with strength and courage was fully appreciated by the Miss Bertrams; her delight in riding was like their own; her early excellence in it was like their own, and they had great pleasure in praising it.\n\"I was sure she would ride well,\" said Julia; \"she has the make for it. Her figure is as neat as her brother's.\"\n\"Yes,\" added Maria, \"and her spirits are as good, and she has the same energy of character. I cannot but think that good horsemanship has a great deal to do with the mind.\"\nWhen they parted at night Edmund asked Fanny whether she meant to ride the next day.\n\"No, I do not know-not if you want the mare,\" was her answer.\n\"I do not want her at all for myself,\" said he; \"but whenever you are next inclined to stay at home, I think Miss Crawford would be glad to have her a longer time-for a whole morning, in short. She has a great desire to get as far as Mansfield Common: Mrs. Grant has been telling her of its fine views, and I have no doubt of her being perfectly equal to it. But any morning will do for this. She would be extremely sorry to interfere with you. It would be very wrong if she did. _She_ rides only for pleasure; _you_ for health.\"\n\"I shall not ride to-morrow, certainly,\" said Fanny; \"I have been out very often lately, and would rather stay at home. You know I am strong enough now to walk very well.\"\nEdmund looked pleased, which must be Fanny's comfort, and the ride to Mansfield Common took place the next morning: the party included all the young people but herself, and was much enjoyed at the time, and doubly enjoyed again in the evening discussion. A successful scheme of this sort generally brings on another; and the having been to Mansfield Common disposed them all for going somewhere else the day after. There were many other views to be shewn; and though the weather was hot, there were shady lanes wherever they wanted to go. A young party is always provided with a shady lane. Four fine mornings successively were spent in this manner, in shewing the Crawfords the country, and doing the honours of its finest spots. Everything answered; it was all gaiety and good-humour, the heat only supplying inconvenience enough to be talked of with pleasure-till the fourth day, when the happiness of one of the party was exceedingly clouded. Miss Bertram was the one. Edmund and Julia were invited to dine at the Parsonage, and _she_ was excluded. It was meant and done by Mrs. Grant, with perfect good-humour, on Mr. Rushworth's account, who was partly expected at the Park that day; but it was felt as a very grievous injury, and her good manners were severely taxed to conceal her vexation and anger till she reached home. As Mr. Rushworth did _not_ come, the injury was increased, and she had not even the relief of shewing her power over him; she could only be sullen to her mother, aunt, and cousin, and throw as great a gloom as possible over their dinner and dessert.\nBetween ten and eleven Edmund and Julia walked into the drawing-room, fresh with the evening air, glowing and cheerful, the very reverse of what they found in the three ladies sitting there, for Maria would scarcely raise her eyes from her book, and Lady Bertram was half-asleep; and even Mrs. Norris, discomposed by her niece's ill-humour, and having asked one or two questions about the dinner, which were not immediately attended to, seemed almost determined to say no more. For a few minutes the brother and sister were too eager in their praise of the night and their remarks on the stars, to think beyond themselves; but when the first pause came, Edmund, looking around, said, \"But where is Fanny? Is she gone to bed?\"\n\"No, not that I know of,\" replied Mrs. Norris; \"she was here a moment ago.\"\nHer own gentle voice speaking from the other end of the room, which was a very long one, told them that she was on the sofa. Mrs. Norris began scolding.\n\"That is a very foolish trick, Fanny, to be idling away all the evening upon a sofa. Why cannot you come and sit here, and employ yourself as _we_ do? If you have no work of your own, I can supply you from the poor basket. There is all the new calico, that was bought last week, not touched yet. I am sure I almost broke my back by cutting it out. You should learn to think of other people; and, take my word for it, it is a shocking trick for a young person to be always lolling upon a sofa.\"\nBefore half this was said, Fanny was returned to her seat at the table, and had taken up her work again; and Julia, who was in high good-humour, from the pleasures of the day, did her the justice of exclaiming, \"I must say, ma'am, that Fanny is as little upon the sofa as anybody in the house.\"\n\"Fanny,\" said Edmund, after looking at her attentively, \"I am sure you have the headache.\"\nShe could not deny it, but said it was not very bad.\n\"I can hardly believe you,\" he replied; \"I know your looks too well. How long have you had it?\"\n\"Since a little before dinner. It is nothing but the heat.\"\n\"Did you go out in the heat?\"\n\"Go out! to be sure she did,\" said Mrs. Norris: \"would you have her stay within such a fine day as this? Were not we _all_ out? Even your mother was out to-day for above an hour.\"\n\"Yes, indeed, Edmund,\" added her ladyship, who had been thoroughly awakened by Mrs. Norris's sharp reprimand to Fanny; \"I was out above an hour. I sat three-quarters of an hour in the flower-garden, while Fanny cut the roses; and very pleasant it was, I assure you, but very hot. It was shady enough in the alcove, but I declare I quite dreaded the coming home again.\"\n\"Fanny has been cutting roses, has she?\"\n\"Yes, and I am afraid they will be the last this year. Poor thing! _She_ found it hot enough; but they were so full-blown that one could not wait.\"\n\"There was no help for it, certainly,\" rejoined Mrs. Norris, in a rather softened voice; \"but I question whether her headache might not be caught _then_, sister. There is nothing so likely to give it as standing and stooping in a hot sun; but I dare say it will be well to-morrow. Suppose you let her have your aromatic vinegar; I always forget to have mine filled.\"\n\"She has got it,\" said Lady Bertram; \"she has had it ever since she came back from your house the second time.\"\n\"What!\" cried Edmund; \"has she been walking as well as cutting roses; walking across the hot park to your house, and doing it twice, ma'am? No wonder her head aches.\"\nMrs. Norris was talking to Julia, and did not hear.\n\"I was afraid it would be too much for her,\" said Lady Bertram; \"but when the roses were gathered, your aunt wished to have them, and then you know they must be taken home.\"\n\"But were there roses enough to oblige her to go twice?\"\n\"No; but they were to be put into the spare room to dry; and, unluckily, Fanny forgot to lock the door of the room and bring away the key, so she was obliged to go again.\"\nEdmund got up and walked about the room, saying, \"And could nobody be employed on such an errand but Fanny? Upon my word, ma'am, it has been a very ill-managed business.\"\n\"I am sure I do not know how it was to have been done better,\" cried Mrs. Norris, unable to be longer deaf; \"unless I had gone myself, indeed; but I cannot be in two places at once; and I was talking to Mr. Green at that very time about your mother's dairymaid, by _her_ desire, and had promised John Groom to write to Mrs. Jefferies about his son, and the poor fellow was waiting for me half an hour. I think nobody can justly accuse me of sparing myself upon any occasion, but really I cannot do everything at once. And as for Fanny's just stepping down to my house for me-it is not much above a quarter of a mile-I cannot think I was unreasonable to ask it. How often do I pace it three times a day, early and late, ay, and in all weathers too, and say nothing about it?\"\n\"I wish Fanny had half your strength, ma'am.\"\n\"If Fanny would be more regular in her exercise, she would not be knocked up so soon. She has not been out on horseback now this long while, and I am persuaded that, when she does not ride, she ought to walk. If she had been riding before, I should not have asked it of her. But I thought it would rather do her good after being stooping among the roses; for there is nothing so refreshing as a walk after a fatigue of that kind; and though the sun was strong, it was not so very hot. Between ourselves, Edmund,\" nodding significantly at his mother, \"it was cutting the roses, and dawdling about in the flower-garden, that did the mischief.\"\n\"I am afraid it was, indeed,\" said the more candid Lady Bertram, who had overheard her; \"I am very much afraid she caught the headache there, for the heat was enough to kill anybody. It was as much as I could bear myself. Sitting and calling to Pug, and trying to keep him from the flower-beds, was almost too much for me.\"\nEdmund said no more to either lady; but going quietly to another table, on which the supper-tray yet remained, brought a glass of Madeira to Fanny, and obliged her to drink the greater part. She wished to be able to decline it; but the tears, which a variety of feelings created, made it easier to swallow than to speak.\nVexed as Edmund was with his mother and aunt, he was still more angry with himself. His own forgetfulness of her was worse than anything which they had done. Nothing of this would have happened had she been properly considered; but she had been left four days together without any choice of companions or exercise, and without any excuse for avoiding whatever her unreasonable aunts might require. He was ashamed to think that for four days together she had not had the power of riding, and very seriously resolved, however unwilling he must be to check a pleasure of Miss Crawford's, that it should never happen again.\nFanny went to bed with her heart as full as on the first evening of her arrival at the Park. The state of her spirits had probably had its share in her indisposition; for she had been feeling neglected, and been struggling against discontent and envy for some days past. As she leant on the sofa, to which she had retreated that she might not be seen, the pain of her mind had been much beyond that in her head; and the sudden change which Edmund's kindness had then occasioned, made her hardly know how to support herself.",
        "paragraph_chars": [
            [
                0,
                165
            ],
            [
                165,
                310
            ],
            [
                310,
                480
            ],
            [
                480,
                763
            ],
            [
                763,
                832
            ],
            [
                832,
                864
            ],
            [
                864,
                1580
            ],
            [
                1580,
                1831
            ],
            [
                1831,
                2163
            ],
            [
                2163,
                2598
            ],
            [
                2598,
                3034
            ],
            [
                3034,
                3855
            ],
            [
                3855,
                5313
            ],
            [
                5313,
                7197
            ],
            [
                7197,
                8208
            ],
            [
                8208,
                10154
            ],
            [
                10154,
                10566
            ],
            [
                10566,
                10960
            ],
            [
                10960,
                11449
            ],
            [
                11449,
                11832
            ],
            [
                11832,
                12309
            ],
            [
                12309,
                12627
            ],
            [
                12627,
                12921
            ],
            [
                12921,
                13034
            ],
            [
                13034,
                13207
            ],
            [
                13207,
                13292
            ],
            [
                13292,
                13354
            ],
            [
                13354,
                13884
            ],
            [
                13884,
                14056
            ],
            [
                14056,
                15637
            ],
            [
                15637,
                16363
            ],
            [
                16363,
                16439
            ],
            [
                16439,
                16592
            ],
            [
                16592,
                17086
            ],
            [
                17086,
                17381
            ],
            [
                17381,
                17472
            ],
            [
                17472,
                17525
            ],
            [
                17525,
                17621
            ],
            [
                17621,
                17681
            ],
            [
                17681,
                17711
            ],
            [
                17711,
                17891
            ],
            [
                17891,
                18260
            ],
            [
                18260,
                18301
            ],
            [
                18301,
                18449
            ],
            [
                18449,
                18816
            ],
            [
                18816,
                18928
            ],
            [
                18928,
                19095
            ],
            [
                19095,
                19147
            ],
            [
                19147,
                19321
            ],
            [
                19321,
                19378
            ],
            [
                19378,
                19550
            ],
            [
                19550,
                19721
            ],
            [
                19721,
                20496
            ],
            [
                20496,
                20542
            ],
            [
                20542,
                21184
            ],
            [
                21184,
                21508
            ],
            [
                21508,
                21829
            ],
            [
                21829,
                22449
            ],
            [
                22449,
                22972
            ]
        ],
        "segment_chars": [
            [
                0,
                56
            ],
            [
                56,
                131
            ],
            [
                131,
                165
            ],
            [
                165,
                187
            ],
            [
                187,
                212
            ],
            [
                212,
                310
            ],
            [
                310,
                356
            ],
            [
                356,
                393
            ],
            [
                393,
                480
            ],
            [
                480,
                489
            ],
            [
                489,
                543
            ],
            [
                543,
                567
            ],
            [
                567,
                732
            ],
            [
                732,
                763
            ],
            [
                763,
                795
            ],
            [
                795,
                832
            ],
            [
                832,
                864
            ],
            [
                864,
                894
            ],
            [
                894,
                1064
            ],
            [
                1064,
                1096
            ],
            [
                1096,
                1251
            ],
            [
                1251,
                1486
            ],
            [
                1486,
                1580
            ],
            [
                1580,
                1758
            ],
            [
                1758,
                1831
            ],
            [
                1831,
                1855
            ],
            [
                1855,
                2004
            ],
            [
                2004,
                2051
            ],
            [
                2051,
                2104
            ],
            [
                2104,
                2163
            ],
            [
                2163,
                2218
            ],
            [
                2218,
                2427
            ],
            [
                2427,
                2501
            ],
            [
                2501,
                2598
            ],
            [
                2598,
                2890
            ],
            [
                2890,
                2967
            ],
            [
                2967,
                2998
            ],
            [
                2998,
                3034
            ],
            [
                3034,
                3331
            ],
            [
                3331,
                3375
            ],
            [
                3375,
                3624
            ],
            [
                3624,
                3855
            ],
            [
                3855,
                4095
            ],
            [
                4095,
                4176
            ],
            [
                4176,
                4414
            ],
            [
                4414,
                4785
            ],
            [
                4785,
                5024
            ],
            [
                5024,
                5187
            ],
            [
                5187,
                5313
            ],
            [
                5313,
                5863
            ],
            [
                5863,
                6141
            ],
            [
                6141,
                6360
            ],
            [
                6360,
                6825
            ],
            [
                6825,
                6949
            ],
            [
                6949,
                7197
            ],
            [
                7197,
                7293
            ],
            [
                7293,
                7526
            ],
            [
                7526,
                7571
            ],
            [
                7571,
                7656
            ],
            [
                7656,
                8011
            ],
            [
                8011,
                8157
            ],
            [
                8157,
                8208
            ],
            [
                8208,
                8684
            ],
            [
                8684,
                8822
            ],
            [
                8822,
                8933
            ],
            [
                8933,
                9023
            ],
            [
                9023,
                9272
            ],
            [
                9272,
                9315
            ],
            [
                9315,
                9516
            ],
            [
                9516,
                9666
            ],
            [
                9666,
                10021
            ],
            [
                10021,
                10154
            ],
            [
                10154,
                10436
            ],
            [
                10436,
                10566
            ],
            [
                10566,
                10876
            ],
            [
                10876,
                10960
            ],
            [
                10960,
                11059
            ],
            [
                11059,
                11348
            ],
            [
                11348,
                11402
            ],
            [
                11402,
                11449
            ],
            [
                11449,
                11582
            ],
            [
                11582,
                11637
            ],
            [
                11637,
                11832
            ],
            [
                11832,
                12309
            ],
            [
                12309,
                12377
            ],
            [
                12377,
                12386
            ],
            [
                12386,
                12423
            ],
            [
                12423,
                12467
            ],
            [
                12467,
                12552
            ],
            [
                12552,
                12568
            ],
            [
                12568,
                12627
            ],
            [
                12627,
                12682
            ],
            [
                12682,
                12921
            ],
            [
                12921,
                12993
            ],
            [
                12993,
                13034
            ],
            [
                13034,
                13126
            ],
            [
                13126,
                13207
            ],
            [
                13207,
                13292
            ],
            [
                13292,
                13354
            ],
            [
                13354,
                13548
            ],
            [
                13548,
                13713
            ],
            [
                13713,
                13747
            ],
            [
                13747,
                13799
            ],
            [
                13799,
                13834
            ],
            [
                13834,
                13884
            ],
            [
                13884,
                14004
            ],
            [
                14004,
                14056
            ],
            [
                14056,
                14311
            ],
            [
                14311,
                14471
            ],
            [
                14471,
                14595
            ],
            [
                14595,
                14647
            ],
            [
                14647,
                14787
            ],
            [
                14787,
                15003
            ],
            [
                15003,
                15029
            ],
            [
                15029,
                15109
            ],
            [
                15109,
                15387
            ],
            [
                15387,
                15637
            ],
            [
                15637,
                16115
            ],
            [
                16115,
                16342
            ],
            [
                16342,
                16363
            ],
            [
                16363,
                16439
            ],
            [
                16439,
                16564
            ],
            [
                16564,
                16592
            ],
            [
                16592,
                16677
            ],
            [
                16677,
                16743
            ],
            [
                16743,
                16815
            ],
            [
                16815,
                16888
            ],
            [
                16888,
                16940
            ],
            [
                16940,
                17086
            ],
            [
                17086,
                17381
            ],
            [
                17381,
                17472
            ],
            [
                17472,
                17525
            ],
            [
                17525,
                17594
            ],
            [
                17594,
                17621
            ],
            [
                17621,
                17652
            ],
            [
                17652,
                17681
            ],
            [
                17681,
                17711
            ],
            [
                17711,
                17720
            ],
            [
                17720,
                17816
            ],
            [
                17816,
                17839
            ],
            [
                17839,
                17891
            ],
            [
                17891,
                18036
            ],
            [
                18036,
                18171
            ],
            [
                18171,
                18260
            ],
            [
                18260,
                18301
            ],
            [
                18301,
                18356
            ],
            [
                18356,
                18368
            ],
            [
                18368,
                18449
            ],
            [
                18449,
                18611
            ],
            [
                18611,
                18730
            ],
            [
                18730,
                18816
            ],
            [
                18816,
                18928
            ],
            [
                18928,
                18936
            ],
            [
                18936,
                19068
            ],
            [
                19068,
                19095
            ],
            [
                19095,
                19147
            ],
            [
                19147,
                19321
            ],
            [
                19321,
                19378
            ],
            [
                19378,
                19550
            ],
            [
                19550,
                19658
            ],
            [
                19658,
                19721
            ],
            [
                19721,
                20123
            ],
            [
                20123,
                20239
            ],
            [
                20239,
                20382
            ],
            [
                20382,
                20496
            ],
            [
                20496,
                20542
            ],
            [
                20542,
                20628
            ],
            [
                20628,
                20751
            ],
            [
                20751,
                20817
            ],
            [
                20817,
                21027
            ],
            [
                21027,
                21184
            ],
            [
                21184,
                21367
            ],
            [
                21367,
                21406
            ],
            [
                21406,
                21508
            ],
            [
                21508,
                21699
            ],
            [
                21699,
                21829
            ],
            [
                21829,
                21913
            ],
            [
                21913,
                21987
            ],
            [
                21987,
                22227
            ],
            [
                22227,
                22449
            ],
            [
                22449,
                22542
            ],
            [
                22542,
                22720
            ],
            [
                22720,
                22972
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                18,
                47
            ],
            [
                53,
                56
            ],
            [
                56,
                80
            ],
            [
                129,
                130
            ],
            [
                165,
                175
            ],
            [
                185,
                187
            ],
            [
                187,
                210
            ],
            [
                229,
                310
            ],
            [
                356,
                393
            ],
            [
                393,
                480
            ],
            [
                480,
                489
            ],
            [
                489,
                543
            ],
            [
                567,
                649
            ],
            [
                656,
                663
            ],
            [
                669,
                688
            ],
            [
                730,
                732
            ],
            [
                732,
                763
            ],
            [
                763,
                795
            ],
            [
                795,
                812
            ],
            [
                829,
                832
            ],
            [
                832,
                836
            ],
            [
                842,
                864
            ],
            [
                864,
                894
            ],
            [
                894,
                943
            ],
            [
                955,
                956
            ],
            [
                985,
                990
            ],
            [
                1009,
                1057
            ],
            [
                1062,
                1064
            ],
            [
                1139,
                1217
            ],
            [
                1238,
                1251
            ],
            [
                1251,
                1421
            ],
            [
                1434,
                1475
            ],
            [
                1484,
                1486
            ],
            [
                1523,
                1528
            ],
            [
                1540,
                1542
            ],
            [
                1529,
                1538
            ],
            [
                1544,
                1565
            ],
            [
                1503,
                1506
            ],
            [
                1571,
                1577
            ],
            [
                1936,
                1948
            ],
            [
                1963,
                2004
            ],
            [
                2004,
                2051
            ],
            [
                2104,
                2134
            ],
            [
                2137,
                2163
            ],
            [
                2163,
                2193
            ],
            [
                2198,
                2218
            ],
            [
                2218,
                2247
            ],
            [
                2505,
                2539
            ],
            [
                2541,
                2544
            ],
            [
                2546,
                2574
            ],
            [
                2595,
                2598
            ],
            [
                2598,
                2654
            ],
            [
                2704,
                2810
            ],
            [
                2840,
                2853
            ],
            [
                2830,
                2836
            ],
            [
                2888,
                2890
            ],
            [
                2890,
                2967
            ],
            [
                2967,
                2998
            ],
            [
                2998,
                3034
            ],
            [
                3034,
                3056
            ],
            [
                3082,
                3137
            ],
            [
                3158,
                3279
            ],
            [
                3301,
                3330
            ],
            [
                3331,
                3375
            ],
            [
                3375,
                3396
            ],
            [
                3404,
                3466
            ],
            [
                3502,
                3522
            ],
            [
                3553,
                3624
            ],
            [
                3624,
                3634
            ],
            [
                3635,
                3651
            ],
            [
                3661,
                3708
            ],
            [
                3713,
                3755
            ],
            [
                3853,
                3855
            ],
            [
                3855,
                3920
            ],
            [
                3930,
                3950
            ],
            [
                3988,
                4019
            ],
            [
                4030,
                4095
            ],
            [
                4484,
                4504
            ],
            [
                4548,
                4585
            ],
            [
                4600,
                4604
            ],
            [
                4586,
                4592
            ],
            [
                4605,
                4644
            ],
            [
                4667,
                4684
            ],
            [
                4685,
                4720
            ],
            [
                4750,
                4785
            ],
            [
                4814,
                4834
            ],
            [
                4834,
                5011
            ],
            [
                5022,
                5024
            ],
            [
                5024,
                5099
            ],
            [
                5185,
                5187
            ],
            [
                5187,
                5265
            ],
            [
                5298,
                5313
            ],
            [
                5313,
                5387
            ],
            [
                5417,
                5420
            ],
            [
                5388,
                5405
            ],
            [
                5437,
                5441
            ],
            [
                5470,
                5517
            ],
            [
                5528,
                5542
            ],
            [
                5588,
                5760
            ],
            [
                5861,
                5863
            ],
            [
                5863,
                5870
            ],
            [
                5880,
                6011
            ],
            [
                6124,
                6140
            ],
            [
                6360,
                6401
            ],
            [
                6413,
                6439
            ],
            [
                6676,
                6680
            ],
            [
                6455,
                6471
            ],
            [
                6410,
                6412
            ],
            [
                6589,
                6594
            ],
            [
                6699,
                6721
            ],
            [
                6737,
                6790
            ],
            [
                6823,
                6825
            ],
            [
                6834,
                6843
            ],
            [
                6874,
                6876
            ],
            [
                6888,
                6902
            ],
            [
                6904,
                6907
            ],
            [
                6909,
                6941
            ],
            [
                6947,
                6949
            ],
            [
                6949,
                7055
            ],
            [
                7085,
                7188
            ],
            [
                7195,
                7197
            ],
            [
                7197,
                7225
            ],
            [
                7232,
                7293
            ],
            [
                7293,
                7299
            ],
            [
                7356,
                7369
            ],
            [
                7320,
                7328
            ],
            [
                7373,
                7438
            ],
            [
                7301,
                7304
            ],
            [
                7451,
                7463
            ],
            [
                7499,
                7525
            ],
            [
                7526,
                7571
            ],
            [
                7571,
                7596
            ],
            [
                7607,
                7656
            ],
            [
                7656,
                7687
            ],
            [
                7695,
                7763
            ],
            [
                7777,
                7854
            ],
            [
                7871,
                7876
            ],
            [
                7895,
                7912
            ],
            [
                7923,
                7941
            ],
            [
                7953,
                8011
            ],
            [
                8011,
                8020
            ],
            [
                8031,
                8135
            ],
            [
                8155,
                8157
            ],
            [
                8157,
                8188
            ],
            [
                8192,
                8208
            ],
            [
                8208,
                8349
            ],
            [
                8374,
                8409
            ],
            [
                8414,
                8417
            ],
            [
                8465,
                8470
            ],
            [
                8493,
                8631
            ],
            [
                8360,
                8363
            ],
            [
                8645,
                8652
            ],
            [
                8672,
                8684
            ],
            [
                8684,
                8709
            ],
            [
                8746,
                8747
            ],
            [
                8773,
                8808
            ],
            [
                8814,
                8822
            ],
            [
                8872,
                8933
            ],
            [
                9032,
                9093
            ],
            [
                9132,
                9142
            ],
            [
                9144,
                9147
            ],
            [
                9149,
                9229
            ],
            [
                9235,
                9271
            ],
            [
                9272,
                9304
            ],
            [
                9313,
                9315
            ],
            [
                9315,
                9362
            ],
            [
                9371,
                9516
            ],
            [
                9516,
                9599
            ],
            [
                9610,
                9624
            ],
            [
                9664,
                9666
            ],
            [
                9764,
                9782
            ],
            [
                9807,
                9818
            ],
            [
                9708,
                9716
            ],
            [
                9821,
                9831
            ],
            [
                9852,
                9870
            ],
            [
                9676,
                9679
            ],
            [
                9723,
                9725
            ],
            [
                10013,
                10020
            ],
            [
                10154,
                10166
            ],
            [
                10189,
                10193
            ],
            [
                10222,
                10264
            ],
            [
                10270,
                10283
            ],
            [
                10264,
                10265
            ],
            [
                10284,
                10303
            ],
            [
                10320,
                10335
            ],
            [
                10378,
                10396
            ],
            [
                10402,
                10436
            ],
            [
                10440,
                10520
            ],
            [
                10564,
                10566
            ],
            [
                10566,
                10607
            ],
            [
                10650,
                10652
            ],
            [
                10686,
                10709
            ],
            [
                10760,
                10774
            ],
            [
                10780,
                10824
            ],
            [
                10840,
                10874
            ],
            [
                10960,
                11059
            ],
            [
                11059,
                11072
            ],
            [
                11083,
                11171
            ],
            [
                11213,
                11233
            ],
            [
                11191,
                11198
            ],
            [
                11253,
                11318
            ],
            [
                11346,
                11348
            ],
            [
                11348,
                11354
            ],
            [
                11356,
                11359
            ],
            [
                11361,
                11400
            ],
            [
                11582,
                11635
            ],
            [
                11740,
                11741
            ],
            [
                11637,
                11673
            ],
            [
                11679,
                11695
            ],
            [
                11706,
                11740
            ],
            [
                11790,
                11794
            ],
            [
                11813,
                11832
            ],
            [
                11832,
                11848
            ],
            [
                11897,
                11934
            ],
            [
                12300,
                12303
            ],
            [
                11890,
                11895
            ],
            [
                11939,
                11957
            ],
            [
                11989,
                11994
            ],
            [
                12007,
                12041
            ],
            [
                12063,
                12091
            ],
            [
                12106,
                12238
            ],
            [
                12307,
                12309
            ],
            [
                12309,
                12377
            ],
            [
                12377,
                12386
            ],
            [
                12423,
                12434
            ],
            [
                12443,
                12467
            ],
            [
                12467,
                12518
            ],
            [
                12550,
                12552
            ],
            [
                12552,
                12568
            ],
            [
                12568,
                12587
            ],
            [
                12624,
                12627
            ],
            [
                12627,
                12669
            ],
            [
                12766,
                12809
            ],
            [
                12875,
                12880
            ],
            [
                12830,
                12850
            ],
            [
                12814,
                12828
            ],
            [
                12919,
                12921
            ],
            [
                12921,
                12965
            ],
            [
                12991,
                12993
            ],
            [
                12993,
                13034
            ],
            [
                13034,
                13082
            ],
            [
                13124,
                13126
            ],
            [
                13126,
                13127
            ],
            [
                13139,
                13207
            ],
            [
                13207,
                13292
            ],
            [
                13292,
                13335
            ],
            [
                13354,
                13372
            ],
            [
                13380,
                13502
            ],
            [
                13517,
                13522
            ],
            [
                13529,
                13536
            ],
            [
                13546,
                13548
            ],
            [
                13548,
                13557
            ],
            [
                13564,
                13604
            ],
            [
                13655,
                13689
            ],
            [
                13700,
                13713
            ],
            [
                13713,
                13736
            ],
            [
                13745,
                13747
            ],
            [
                13747,
                13799
            ],
            [
                13799,
                13834
            ],
            [
                13835,
                13838
            ],
            [
                13840,
                13864
            ],
            [
                13866,
                13869
            ],
            [
                13871,
                13884
            ],
            [
                13884,
                13953
            ],
            [
                13959,
                14004
            ],
            [
                14013,
                14056
            ],
            [
                14056,
                14245
            ],
            [
                14309,
                14311
            ],
            [
                14311,
                14376
            ],
            [
                14427,
                14430
            ],
            [
                14393,
                14395
            ],
            [
                14441,
                14471
            ],
            [
                14647,
                14708
            ],
            [
                14717,
                14742
            ],
            [
                14773,
                14787
            ],
            [
                14808,
                14841
            ],
            [
                14917,
                15002
            ],
            [
                15003,
                15029
            ],
            [
                15029,
                15088
            ],
            [
                15090,
                15093
            ],
            [
                15095,
                15109
            ],
            [
                15109,
                15115
            ],
            [
                15126,
                15174
            ],
            [
                15191,
                15198
            ],
            [
                15175,
                15188
            ],
            [
                15198,
                15207
            ],
            [
                15215,
                15266
            ],
            [
                15272,
                15292
            ],
            [
                15333,
                15344
            ],
            [
                15358,
                15387
            ],
            [
                15387,
                15407
            ],
            [
                15409,
                15412
            ],
            [
                15414,
                15444
            ],
            [
                15507,
                15533
            ],
            [
                15565,
                15610
            ],
            [
                15617,
                15623
            ],
            [
                15635,
                15637
            ],
            [
                15637,
                15937
            ],
            [
                16113,
                16115
            ],
            [
                16291,
                16322
            ],
            [
                16326,
                16342
            ],
            [
                16342,
                16363
            ],
            [
                16363,
                16364
            ],
            [
                16368,
                16439
            ],
            [
                16439,
                16499
            ],
            [
                16528,
                16564
            ],
            [
                16564,
                16592
            ],
            [
                16592,
                16642
            ],
            [
                16664,
                16677
            ],
            [
                16677,
                16730
            ],
            [
                16741,
                16743
            ],
            [
                16743,
                16762
            ],
            [
                16774,
                16815
            ],
            [
                16815,
                16823
            ],
            [
                16828,
                16888
            ],
            [
                16888,
                16920
            ],
            [
                16924,
                16940
            ],
            [
                16940,
                16981
            ],
            [
                17009,
                17086
            ],
            [
                17086,
                17097
            ],
            [
                17250,
                17252
            ],
            [
                17098,
                17118
            ],
            [
                17162,
                17165
            ],
            [
                17123,
                17134
            ],
            [
                17147,
                17156
            ],
            [
                17158,
                17161
            ],
            [
                17166,
                17183
            ],
            [
                17189,
                17229
            ],
            [
                17260,
                17381
            ],
            [
                17381,
                17402
            ],
            [
                17409,
                17472
            ],
            [
                17472,
                17525
            ],
            [
                17525,
                17594
            ],
            [
                17594,
                17621
            ],
            [
                17621,
                17652
            ],
            [
                17652,
                17681
            ],
            [
                17681,
                17711
            ],
            [
                17720,
                17790
            ],
            [
                17791,
                17806
            ],
            [
                17814,
                17816
            ],
            [
                17839,
                17870
            ],
            [
                17888,
                17891
            ],
            [
                17891,
                17932
            ],
            [
                18034,
                18036
            ],
            [
                18036,
                18041
            ],
            [
                18068,
                18142
            ],
            [
                18157,
                18169
            ],
            [
                18260,
                18301
            ],
            [
                18301,
                18356
            ],
            [
                18356,
                18368
            ],
            [
                18369,
                18372
            ],
            [
                18374,
                18449
            ],
            [
                18449,
                18474
            ],
            [
                18485,
                18539
            ],
            [
                18611,
                18645
            ],
            [
                18566,
                18574
            ],
            [
                18649,
                18660
            ],
            [
                18674,
                18730
            ],
            [
                18730,
                18776
            ],
            [
                18813,
                18816
            ],
            [
                18853,
                18868
            ],
            [
                18874,
                18925
            ],
            [
                18831,
                18851
            ],
            [
                18928,
                18936
            ],
            [
                18936,
                18971
            ],
            [
                19054,
                19059
            ],
            [
                19006,
                19025
            ],
            [
                19059,
                19068
            ],
            [
                19068,
                19095
            ],
            [
                19147,
                19215
            ],
            [
                19246,
                19270
            ],
            [
                19221,
                19230
            ],
            [
                19318,
                19321
            ],
            [
                19321,
                19322
            ],
            [
                19326,
                19378
            ],
            [
                19378,
                19475
            ],
            [
                19488,
                19550
            ],
            [
                19550,
                19580
            ],
            [
                19589,
                19658
            ],
            [
                19658,
                19690
            ],
            [
                19693,
                19709
            ],
            [
                19718,
                19721
            ],
            [
                19721,
                19722
            ],
            [
                19732,
                19802
            ],
            [
                19829,
                19854
            ],
            [
                19862,
                19981
            ],
            [
                20121,
                20123
            ],
            [
                20200,
                20239
            ],
            [
                20239,
                20288
            ],
            [
                20295,
                20336
            ],
            [
                20380,
                20382
            ],
            [
                20382,
                20423
            ],
            [
                20444,
                20467
            ],
            [
                20493,
                20496
            ],
            [
                20496,
                20542
            ],
            [
                20542,
                20628
            ],
            [
                20628,
                20661
            ],
            [
                20666,
                20751
            ],
            [
                20817,
                20839
            ],
            [
                20847,
                20864
            ],
            [
                20871,
                20896
            ],
            [
                21027,
                21052
            ],
            [
                21001,
                21002
            ],
            [
                21093,
                21117
            ],
            [
                21160,
                21184
            ],
            [
                21184,
                21222
            ],
            [
                21228,
                21247
            ],
            [
                21270,
                21273
            ],
            [
                21330,
                21367
            ],
            [
                21406,
                21432
            ],
            [
                21479,
                21508
            ],
            [
                21508,
                21527
            ],
            [
                21542,
                21564
            ],
            [
                21589,
                21604
            ],
            [
                21617,
                21680
            ],
            [
                21697,
                21699
            ],
            [
                21699,
                21709
            ],
            [
                21721,
                21739
            ],
            [
                21744,
                21749
            ],
            [
                21788,
                21829
            ],
            [
                21829,
                21913
            ],
            [
                22065,
                22078
            ],
            [
                22098,
                22109
            ],
            [
                22134,
                22227
            ],
            [
                22227,
                22269
            ],
            [
                22279,
                22290
            ],
            [
                22374,
                22376
            ],
            [
                22314,
                22319
            ],
            [
                22335,
                22343
            ],
            [
                22414,
                22449
            ],
            [
                22449,
                22481
            ],
            [
                22485,
                22489
            ],
            [
                22540,
                22542
            ],
            [
                22620,
                22627
            ],
            [
                22656,
                22713
            ],
            [
                22718,
                22720
            ],
            [
                22720,
                22744
            ],
            [
                22799,
                22972
            ]
        ],
        "row_chars": [
            [
                0,
                56
            ],
            [
                56,
                131
            ],
            [
                131,
                165
            ],
            [
                165,
                187
            ],
            [
                187,
                310
            ],
            [
                310,
                356
            ],
            [
                356,
                393
            ],
            [
                393,
                480
            ],
            [
                480,
                489
            ],
            [
                489,
                543
            ],
            [
                543,
                567
            ],
            [
                567,
                732
            ],
            [
                732,
                763
            ],
            [
                763,
                795
            ],
            [
                795,
                832
            ],
            [
                832,
                864
            ],
            [
                864,
                894
            ],
            [
                894,
                1064
            ],
            [
                1064,
                1096
            ],
            [
                1096,
                1251
            ],
            [
                1251,
                1486
            ],
            [
                1486,
                1580
            ],
            [
                1580,
                1758
            ],
            [
                1758,
                1831
            ],
            [
                1831,
                1855
            ],
            [
                1855,
                2004
            ],
            [
                2004,
                2051
            ],
            [
                2051,
                2104
            ],
            [
                2104,
                2163
            ],
            [
                2163,
                2218
            ],
            [
                2218,
                2598
            ],
            [
                2598,
                2890
            ],
            [
                2890,
                2967
            ],
            [
                2967,
                2998
            ],
            [
                2998,
                3034
            ],
            [
                3034,
                3331
            ],
            [
                3331,
                3375
            ],
            [
                3375,
                3624
            ],
            [
                3624,
                3855
            ],
            [
                3855,
                4095
            ],
            [
                4095,
                4176
            ],
            [
                4176,
                4414
            ],
            [
                4414,
                4785
            ],
            [
                4785,
                5024
            ],
            [
                5024,
                5187
            ],
            [
                5187,
                5313
            ],
            [
                5313,
                5863
            ],
            [
                5863,
                6141
            ],
            [
                6141,
                6360
            ],
            [
                6360,
                6825
            ],
            [
                6825,
                6949
            ],
            [
                6949,
                7197
            ],
            [
                7197,
                7293
            ],
            [
                7293,
                7526
            ],
            [
                7526,
                7571
            ],
            [
                7571,
                7656
            ],
            [
                7656,
                8011
            ],
            [
                8011,
                8157
            ],
            [
                8157,
                8208
            ],
            [
                8208,
                8684
            ],
            [
                8684,
                8822
            ],
            [
                8822,
                8933
            ],
            [
                8933,
                9023
            ],
            [
                9023,
                9272
            ],
            [
                9272,
                9315
            ],
            [
                9315,
                9516
            ],
            [
                9516,
                9666
            ],
            [
                9666,
                10021
            ],
            [
                10021,
                10154
            ],
            [
                10154,
                10436
            ],
            [
                10436,
                10566
            ],
            [
                10566,
                10876
            ],
            [
                10876,
                10960
            ],
            [
                10960,
                11059
            ],
            [
                11059,
                11348
            ],
            [
                11348,
                11402
            ],
            [
                11402,
                11449
            ],
            [
                11449,
                11582
            ],
            [
                11582,
                11832
            ],
            [
                11832,
                12309
            ],
            [
                12309,
                12377
            ],
            [
                12377,
                12386
            ],
            [
                12386,
                12423
            ],
            [
                12423,
                12467
            ],
            [
                12467,
                12552
            ],
            [
                12552,
                12568
            ],
            [
                12568,
                12627
            ],
            [
                12627,
                12921
            ],
            [
                12921,
                12993
            ],
            [
                12993,
                13034
            ],
            [
                13034,
                13126
            ],
            [
                13126,
                13207
            ],
            [
                13207,
                13292
            ],
            [
                13292,
                13354
            ],
            [
                13354,
                13548
            ],
            [
                13548,
                13713
            ],
            [
                13713,
                13747
            ],
            [
                13747,
                13799
            ],
            [
                13799,
                13834
            ],
            [
                13834,
                13884
            ],
            [
                13884,
                14004
            ],
            [
                14004,
                14056
            ],
            [
                14056,
                14311
            ],
            [
                14311,
                14471
            ],
            [
                14471,
                14595
            ],
            [
                14595,
                14647
            ],
            [
                14647,
                14787
            ],
            [
                14787,
                15003
            ],
            [
                15003,
                15029
            ],
            [
                15029,
                15109
            ],
            [
                15109,
                15387
            ],
            [
                15387,
                15637
            ],
            [
                15637,
                16115
            ],
            [
                16115,
                16342
            ],
            [
                16342,
                16363
            ],
            [
                16363,
                16439
            ],
            [
                16439,
                16564
            ],
            [
                16564,
                16592
            ],
            [
                16592,
                16677
            ],
            [
                16677,
                16743
            ],
            [
                16743,
                16815
            ],
            [
                16815,
                16888
            ],
            [
                16888,
                16940
            ],
            [
                16940,
                17086
            ],
            [
                17086,
                17381
            ],
            [
                17381,
                17472
            ],
            [
                17472,
                17525
            ],
            [
                17525,
                17594
            ],
            [
                17594,
                17621
            ],
            [
                17621,
                17652
            ],
            [
                17652,
                17681
            ],
            [
                17681,
                17711
            ],
            [
                17711,
                17720
            ],
            [
                17720,
                17816
            ],
            [
                17816,
                17839
            ],
            [
                17839,
                17891
            ],
            [
                17891,
                18036
            ],
            [
                18036,
                18171
            ],
            [
                18171,
                18260
            ],
            [
                18260,
                18301
            ],
            [
                18301,
                18356
            ],
            [
                18356,
                18368
            ],
            [
                18368,
                18449
            ],
            [
                18449,
                18730
            ],
            [
                18730,
                18816
            ],
            [
                18816,
                18928
            ],
            [
                18928,
                18936
            ],
            [
                18936,
                19068
            ],
            [
                19068,
                19095
            ],
            [
                19095,
                19147
            ],
            [
                19147,
                19321
            ],
            [
                19321,
                19378
            ],
            [
                19378,
                19550
            ],
            [
                19550,
                19658
            ],
            [
                19658,
                19721
            ],
            [
                19721,
                20123
            ],
            [
                20123,
                20239
            ],
            [
                20239,
                20382
            ],
            [
                20382,
                20496
            ],
            [
                20496,
                20542
            ],
            [
                20542,
                20628
            ],
            [
                20628,
                20751
            ],
            [
                20751,
                20817
            ],
            [
                20817,
                21184
            ],
            [
                21184,
                21367
            ],
            [
                21367,
                21406
            ],
            [
                21406,
                21508
            ],
            [
                21508,
                21699
            ],
            [
                21699,
                21829
            ],
            [
                21829,
                21913
            ],
            [
                21913,
                21987
            ],
            [
                21987,
                22227
            ],
            [
                22227,
                22449
            ],
            [
                22449,
                22542
            ],
            [
                22542,
                22720
            ],
            [
                22720,
                22972
            ]
        ]
    },
    "abridged": {
        "text": "\"Well, Fanny, how do you like Miss Crawford?\" said Edmund the next day.\n\"Very well. I like to hear her talk; and she is so extremely pretty, that I have great pleasure in looking at her.\"\n\"She has a wonderful play of feature! But was there nothing in her conversation that struck you, Fanny, as not quite right?\"\n\"Oh yes! she ought not to have spoken of her uncle as she did. An uncle with whom she has been living so many years, and who, whatever his faults, is so fond of her brother. I could not have believed it!\"\n\"I thought you would be struck. It was very wrong.\"\n\"And ungrateful, I think.\"\n\"Ungrateful is a strong word. I do not know that her uncle has any claim to her gratitude; it is respect for her aunt's memory which misleads her. It must be difficult to do justice to her affection for Mrs. Crawford, without accusing the Admiral. I do not pretend to know which was most to blame in their disagreements, though the Admiral's present conduct might incline one to the side of his wife; but it is natural that Miss Crawford should acquit her aunt. However, there is certainly impropriety in making her opinions public. It makes one aware of the disadvantages she has been under. But I think her present home must do her good. She speaks of her brother with very pleasing affection.\"\n\"Yes, except as to his writing such short letters. She made me almost laugh; but what right had she to suppose that you would not write long letters?\"\n\"The right of a lively mind, Fanny, seizing whatever may amuse it; perfectly allowable, when untinctured by ill-humour or roughness; and there is not a shadow of either in Miss Crawford's manner. She is perfectly feminine, except in the instances we have been speaking of. There she cannot be justified. I am glad you saw it all as I did.\"\nHaving formed her mind, he had a good chance of her thinking like him; though on this subject, there began now to be some danger of dissimilarity, for he was in a line of admiration of Miss Crawford, where Fanny could not follow.\nMiss Crawford's attractions did not lessen. The harp arrived, and added to her beauty, wit, and good-humour; for she played with expression and taste, and there was something clever to be said at the close of every air. Edmund was daily at the Parsonage, to be indulged with his favourite instrument: each morning secured an invitation for the next.\nA young woman, pretty, lively, with a harp as elegant as herself, placed near a window that opened on a little lawn, surrounded by the rich foliage of summer, was enough to catch any man's heart. Edmund was beginning to be a good deal in love; and to the lady's credit it may be added that, without his being an elder brother, and without any of the arts of flattery, he began to be agreeable to her. She had not foreseen this, and could hardly understand it; for he was not pleasant by any common rule: he talked no nonsense; he paid no compliments; his opinions were unbending, his attentions tranquil. There was a charm, perhaps, in his sincerity, his steadiness, his integrity. She did not think very much about it, however: he pleased her for the present; it was enough.\nFanny could not wonder that Edmund was at the Parsonage every morning; she too would gladly have gone to hear the harp; neither could she wonder that after their evening stroll he should think it right to attend Mrs. Grant and her sister to their home, while Mr. Crawford was devoted to the ladies of the Park; but she thought it a very bad exchange. She was surprised that he could spend so many hours with Miss Crawford, and not see more of the sort of fault which he had already observed; but so it was.\nThe first actual pain which Miss Crawford caused her was the consequence of a wish to learn to ride. Edward encouraged it, and offered his own quiet mare for her first attempts, as the best fitted for a beginner. He meant no injury to Fanny in this offer: she was not to lose a day's exercise. The mare was only to be taken down to the Parsonage half an hour before her ride were to begin; and Fanny, so far from feeling slighted, was almost over-powered with gratitude that he should be asking her leave.\nMiss Crawford made her first attempt with great credit to herself, and no inconvenience to Fanny. Edmund returned with the mare in excellent time, before either Fanny or the steady old coachman who attended her were ready to set forward.\nThe second day's trial was not so guiltless. Miss Crawford's enjoyment was such that she did not know how to leave off. Active and fearless, and though small, strongly made, she seemed formed for a horsewoman; and to the pleasure of the exercise, something was probably added in Edmund's attendance, and the conviction of surpassing her sex by her early progress, to make her unwilling to dismount. Fanny was waiting, and Mrs. Norris was beginning to scold her for not being gone, and still no horse was announced. To avoid her aunt, and look for Edward, she went out.\nThe houses, though scarcely half a mile apart, were not within sight of each other; but, by walking fifty yards from the hall door, she could command a view of the Parsonage and its surroundings; and she immediately saw the group-Edmund and Miss Crawford both on horse-back, riding side by side, Dr. and Mrs. Grant, and Mr. Crawford, with the grooms, looking on. A happy party it appeared: for the sound of merriment ascended to her. She wondered that Edmund should forget her, and felt a pang. Miss Crawford and her companion made the circuit of the field; then, at her apparent suggestion, they rose into a canter; and to Fanny's timid nature it was astonishing to see how well she sat.\nAfter a few minutes they stopped. Edmund was close to her; he was speaking to her, evidently directing her management of the bridle; he had hold of her hand; she saw it, or the imagination supplied what the eye could not reach. She must not wonder at all this; what could be more natural than that Edmund should make himself useful? It would have been becoming in Miss Crawford's brother to assist her; but Mr. Crawford was not as kind as Edmund.\nHer feelings were eased by seeing the party in the meadow disperse. Miss Crawford, still on horseback, with Edmund on foot, passed into the park, and came towards the spot where she stood. Fanny began then to be afraid of appearing rude and impatient; and walked to meet them.\n\"My dear Miss Price,\" said Miss Crawford, \"I apologise for keeping you waiting-I knew it was late, and that I was behaving extremely ill; if you please, you must forgive me.\"\nFanny's answer was extremely civil, and Edmund added his conviction that she could be in no hurry. \"For there is time enough for my cousin to ride twice as far as she ever goes,\" said he, \"and you have prevented her from setting off when it was too hot for comfort: clouds are now coming up, and she will not suffer from the heat. I wish you may not be fatigued by so much exercise.\"\n\"Nothing ever fatigues me but doing what I do not like,\" said she, as she sprang down with his help; \"Miss Price, I give way to you with a bad grace; but I hope you will have a pleasant ride on this beautiful animal.\"\nThe old coachman now joining them, Fanny was lifted on her horse, and they set off; her discomfort not lightened by seeing that the others were walking together to the village; nor did her attendant do her much good by his comments on Miss Crawford's great cleverness as a horse-woman.\n\"It is a pleasure to see a lady with such a good heart for riding!\" said he. \"She did not have a thought of fear. Very different from you, miss, when you first began. Lord bless you! how you did tremble!\"\nIn the drawing-room Miss Crawford was also praised by the Miss Bertrams; her delight in riding, and her early excellence, were like their own.\n\"I was sure she would ride well,\" said Julia. \"Her figure is as neat as her brother's.\"\n\"Yes,\" added Maria, \"and her spirits are as good. I think that good horsemanship has a great deal to do with the mind.\"\nWhen they parted at night Edmund asked Fanny whether she meant to ride the next day.\n\"No, I do not know-not if you want the mare.\"\n\"I do not want her for myself,\" said he; \"but whenever you are next inclined to stay at home, I think Miss Crawford would be glad to have her for a morning. She has a desire to get as far as Mansfield Common, and I have no doubt of her being equal to it. But any morning will do. She would be extremely sorry to interfere with you. It would be very wrong if she did. She rides only for pleasure; you for health.\"\n\"I shall not ride to-morrow, certainly,\" said Fanny; \"I have been out often lately, and would rather stay at home. I am strong enough now to walk very well.\"\nEdmund looked pleased, which must be Fanny's comfort, and the ride to Mansfield Common took place the next morning: the party included all the young people but herself, and was much enjoyed. A successful scheme of this sort generally brings on another; and they all wished to go somewhere else the day after. Four fine mornings successively were spent in this manner, in showing the Crawfords the country's finest spots. It was all gaiety and good-humour-till the fourth day, when the happiness of one of the party was exceedingly clouded.\nMiss Bertram was the one. Edmund and Julia were invited to dine at the Parsonage, and she was excluded. It was done by Mrs. Grant, with perfect good-humour, on account of Mr. Rushworth, who was expected at the Park that day; but it was felt as a grievous injury, and Maria could barely conceal her anger till she reached home. As Mr. Rushworth did not come, the injury was increased; she could only be sullen, and throw as great a gloom as possible over dinner.\nBetween ten and eleven Edmund and Julia walked into the drawing-room, fresh with the evening air, glowing and cheerful, the very reverse of what they found in the three ladies sitting there, for Maria would scarcely raise her eyes from her book, and Lady Bertram was half-asleep; and even Mrs. Norris said little. Edmund, looking around, said, \"Where is Fanny? Is she gone to bed?\"\n\"Not that I know of,\" replied Mrs. Norris; \"she was here a moment ago.\"\nHer own gentle voice speaking from the other end of the room told them that she was on the sofa. Mrs. Norris began scolding.\n\"That is a very foolish trick, Fanny, to be idling upon a sofa. Why cannot you come and sit here, and employ yourself? If you have no work, I can supply you from the poor basket. There is the new calico, that was bought last week, not touched yet. I am sure I almost broke my back cutting it out. You should learn to think of other people. It is a shocking trick for a young person to be always lolling upon a sofa.\"\nBefore half of this was said, Fanny had returned to the table and taken up her work; and Julia, who was in high good-humour, did her the justice of exclaiming, \"I must say, ma'am, that Fanny is as little upon the sofa as anybody in the house.\"\n\"Fanny,\" said Edmund, looking at her attentively, \"I am sure you have the headache.\"\nShe could not deny it, but said it was not very bad.\n\"I can hardly believe you,\" he replied; \"I know your looks too well. How long have you had it?\"\n\"Since a little before dinner. It is nothing but the heat.\"\n\"Did you go out in the heat?\"\n\"To be sure she did,\" said Mrs. Norris: \"would you have her stay within on such a fine day? Even your mother was out to-day.\"\n\"Yes, indeed, Edmund,\" added her ladyship. \"I sat in the flower-garden, while Fanny cut the roses; and very pleasant it was, but very hot.\"\n\"Fanny has been cutting roses, has she?\"\n\"Yes, and I am afraid they will be the last this year. Poor thing! She found it hot enough; but they were so full-blown that one could not wait.\"\n\"There was no help for it,\" rejoined Mrs. Norris, in a rather softened voice; \"There is nothing so likely to give one a headache as standing in a hot sun; but I dare say it will be well to-morrow. Suppose you let her have your aromatic vinegar.\"\n\"She has had it since she came back from your house the second time,\" said Lady Bertram.\n\"What!\" cried Edmund; \"has she been walking twice across the hot park, ma'am? No wonder her head aches.\"\n\"I was afraid it would be too much for her,\" said Lady Bertram; \"but your aunt wished to have the roses.\"\n\"Were there roses enough to oblige her to go twice?\"\n\"No; but they were to be put into the spare room to dry; and, unluckily, Fanny forgot to lock the room and bring away the key, so she was obliged to go again.\"\nEdmund got up and walked about, saying, \"And could nobody be employed on such an errand but Fanny? Upon my word, ma'am, it has been very ill-managed.\"\n\"I do not know how it was to have been done better,\" cried Mrs. Norris, \"unless I had gone myself; but I cannot be in two places at once; and I was talking to Mr. Green at that very time about your mother's dairymaid. Really I cannot do everything at once. And as for Fanny's just stepping down to my house-it is not much above a quarter of a mile. How often do I pace it three times a day, and in all weathers too?\"\n\"I wish Fanny had half your strength, ma'am.\"\n\"If Fanny would be more regular in her exercise, she would not be knocked up so soon. She has not been out on horseback this long while, and I am persuaded that, when she does not ride, she ought to walk. But I thought it would do her good after stooping among the roses; between ourselves, Edmund, it was cutting the roses that did the mischief.\"\n\"I am afraid it was, indeed,\" said the candid Lady Bertram; \"The heat was enough to kill anybody. Sitting and calling to Pug was almost too much for me.\"\nEdmund said no more; but going quietly to the supper-tray, brought a glass of Madeira to Fanny, and obliged her to drink. She wished to decline it; but her tears made it easier to swallow than to speak.\nVexed as Edmund was with his mother and aunt, he was still more angry with himself. Fanny had been left without any exercise, and without any excuse for avoiding whatever her unreasonable aunts might require. He was ashamed to think that for four days she had not been able to ride, and resolved that it should never happen again.\nFanny went to bed with her heart full. She had been struggling against discontent and envy for some days. As she leant on the sofa, the pain of her mind had been much beyond that in her head; and the sudden change which Edmund's kindness had then occasioned, made her hardly know how to support herself.",
        "paragraph_chars": [
            [
                0,
                72
            ],
            [
                72,
                188
            ],
            [
                188,
                313
            ],
            [
                313,
                518
            ],
            [
                518,
                570
            ],
            [
                570,
                597
            ],
            [
                597,
                1294
            ],
            [
                1294,
                1445
            ],
            [
                1445,
                1785
            ],
            [
                1785,
                2015
            ],
            [
                2015,
                2365
            ],
            [
                2365,
                3141
            ],
            [
                3141,
                3648
            ],
            [
                3648,
                4154
            ],
            [
                4154,
                4392
            ],
            [
                4392,
                4961
            ],
            [
                4961,
                5650
            ],
            [
                5650,
                6097
            ],
            [
                6097,
                6374
            ],
            [
                6374,
                6549
            ],
            [
                6549,
                6933
            ],
            [
                6933,
                7151
            ],
            [
                7151,
                7437
            ],
            [
                7437,
                7642
            ],
            [
                7642,
                7785
            ],
            [
                7785,
                7873
            ],
            [
                7873,
                7993
            ],
            [
                7993,
                8078
            ],
            [
                8078,
                8124
            ],
            [
                8124,
                8537
            ],
            [
                8537,
                8695
            ],
            [
                8695,
                9235
            ],
            [
                9235,
                9697
            ],
            [
                9697,
                10079
            ],
            [
                10079,
                10151
            ],
            [
                10151,
                10276
            ],
            [
                10276,
                10693
            ],
            [
                10693,
                10937
            ],
            [
                10937,
                11022
            ],
            [
                11022,
                11075
            ],
            [
                11075,
                11171
            ],
            [
                11171,
                11231
            ],
            [
                11231,
                11261
            ],
            [
                11261,
                11387
            ],
            [
                11387,
                11527
            ],
            [
                11527,
                11568
            ],
            [
                11568,
                11714
            ],
            [
                11714,
                11960
            ],
            [
                11960,
                12049
            ],
            [
                12049,
                12154
            ],
            [
                12154,
                12260
            ],
            [
                12260,
                12313
            ],
            [
                12313,
                12473
            ],
            [
                12473,
                12624
            ],
            [
                12624,
                13041
            ],
            [
                13041,
                13087
            ],
            [
                13087,
                13435
            ],
            [
                13435,
                13589
            ],
            [
                13589,
                13792
            ],
            [
                13792,
                14123
            ],
            [
                14123,
                14426
            ]
        ],
        "segment_chars": [
            [
                0,
                46
            ],
            [
                46,
                72
            ],
            [
                72,
                84
            ],
            [
                84,
                188
            ],
            [
                188,
                226
            ],
            [
                226,
                313
            ],
            [
                313,
                322
            ],
            [
                322,
                376
            ],
            [
                376,
                487
            ],
            [
                487,
                518
            ],
            [
                518,
                550
            ],
            [
                550,
                570
            ],
            [
                570,
                597
            ],
            [
                597,
                627
            ],
            [
                627,
                744
            ],
            [
                744,
                845
            ],
            [
                845,
                1059
            ],
            [
                1059,
                1130
            ],
            [
                1130,
                1190
            ],
            [
                1190,
                1237
            ],
            [
                1237,
                1294
            ],
            [
                1294,
                1345
            ],
            [
                1345,
                1445
            ],
            [
                1445,
                1641
            ],
            [
                1641,
                1718
            ],
            [
                1718,
                1749
            ],
            [
                1749,
                1785
            ],
            [
                1785,
                2015
            ],
            [
                2015,
                2059
            ],
            [
                2059,
                2235
            ],
            [
                2235,
                2365
            ],
            [
                2365,
                2561
            ],
            [
                2561,
                2766
            ],
            [
                2766,
                2970
            ],
            [
                2970,
                3047
            ],
            [
                3047,
                3141
            ],
            [
                3141,
                3492
            ],
            [
                3492,
                3648
            ],
            [
                3648,
                3749
            ],
            [
                3749,
                3861
            ],
            [
                3861,
                3942
            ],
            [
                3942,
                4154
            ],
            [
                4154,
                4252
            ],
            [
                4252,
                4392
            ],
            [
                4392,
                4437
            ],
            [
                4437,
                4512
            ],
            [
                4512,
                4791
            ],
            [
                4791,
                4907
            ],
            [
                4907,
                4961
            ],
            [
                4961,
                5324
            ],
            [
                5324,
                5395
            ],
            [
                5395,
                5456
            ],
            [
                5456,
                5650
            ],
            [
                5650,
                5684
            ],
            [
                5684,
                5878
            ],
            [
                5878,
                5983
            ],
            [
                5983,
                6097
            ],
            [
                6097,
                6165
            ],
            [
                6165,
                6286
            ],
            [
                6286,
                6374
            ],
            [
                6374,
                6549
            ],
            [
                6549,
                6648
            ],
            [
                6648,
                6880
            ],
            [
                6880,
                6933
            ],
            [
                6933,
                7151
            ],
            [
                7151,
                7437
            ],
            [
                7437,
                7505
            ],
            [
                7505,
                7514
            ],
            [
                7514,
                7551
            ],
            [
                7551,
                7604
            ],
            [
                7604,
                7620
            ],
            [
                7620,
                7642
            ],
            [
                7642,
                7785
            ],
            [
                7785,
                7831
            ],
            [
                7831,
                7873
            ],
            [
                7873,
                7923
            ],
            [
                7923,
                7993
            ],
            [
                7993,
                8078
            ],
            [
                8078,
                8124
            ],
            [
                8124,
                8281
            ],
            [
                8281,
                8379
            ],
            [
                8379,
                8404
            ],
            [
                8404,
                8456
            ],
            [
                8456,
                8491
            ],
            [
                8491,
                8537
            ],
            [
                8537,
                8652
            ],
            [
                8652,
                8695
            ],
            [
                8695,
                8886
            ],
            [
                8886,
                9004
            ],
            [
                9004,
                9116
            ],
            [
                9116,
                9235
            ],
            [
                9235,
                9261
            ],
            [
                9261,
                9339
            ],
            [
                9339,
                9562
            ],
            [
                9562,
                9697
            ],
            [
                9697,
                10011
            ],
            [
                10011,
                10058
            ],
            [
                10058,
                10079
            ],
            [
                10079,
                10151
            ],
            [
                10151,
                10248
            ],
            [
                10248,
                10276
            ],
            [
                10276,
                10340
            ],
            [
                10340,
                10395
            ],
            [
                10395,
                10455
            ],
            [
                10455,
                10524
            ],
            [
                10524,
                10573
            ],
            [
                10573,
                10616
            ],
            [
                10616,
                10693
            ],
            [
                10693,
                10937
            ],
            [
                10937,
                11022
            ],
            [
                11022,
                11075
            ],
            [
                11075,
                11144
            ],
            [
                11144,
                11171
            ],
            [
                11171,
                11202
            ],
            [
                11202,
                11231
            ],
            [
                11231,
                11261
            ],
            [
                11261,
                11353
            ],
            [
                11353,
                11387
            ],
            [
                11387,
                11430
            ],
            [
                11430,
                11527
            ],
            [
                11527,
                11568
            ],
            [
                11568,
                11623
            ],
            [
                11623,
                11635
            ],
            [
                11635,
                11714
            ],
            [
                11714,
                11911
            ],
            [
                11911,
                11960
            ],
            [
                11960,
                12049
            ],
            [
                12049,
                12057
            ],
            [
                12057,
                12127
            ],
            [
                12127,
                12154
            ],
            [
                12154,
                12260
            ],
            [
                12260,
                12313
            ],
            [
                12313,
                12473
            ],
            [
                12473,
                12572
            ],
            [
                12572,
                12624
            ],
            [
                12624,
                12842
            ],
            [
                12842,
                12881
            ],
            [
                12881,
                12973
            ],
            [
                12973,
                13041
            ],
            [
                13041,
                13087
            ],
            [
                13087,
                13173
            ],
            [
                13173,
                13292
            ],
            [
                13292,
                13435
            ],
            [
                13435,
                13533
            ],
            [
                13533,
                13589
            ],
            [
                13589,
                13711
            ],
            [
                13711,
                13792
            ],
            [
                13792,
                13876
            ],
            [
                13876,
                14001
            ],
            [
                14001,
                14123
            ],
            [
                14123,
                14162
            ],
            [
                14162,
                14229
            ],
            [
                14229,
                14426
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                14,
                43
            ],
            [
                43,
                46
            ],
            [
                46,
                70
            ],
            [
                70,
                71
            ],
            [
                72,
                82
            ],
            [
                82,
                84
            ],
            [
                84,
                107
            ],
            [
                107,
                188
            ],
            [
                189,
                226
            ],
            [
                226,
                313
            ],
            [
                313,
                322
            ],
            [
                322,
                376
            ],
            [
                376,
                458
            ],
            [
                458,
                465
            ],
            [
                466,
                485
            ],
            [
                485,
                487
            ],
            [
                487,
                518
            ],
            [
                518,
                550
            ],
            [
                550,
                567
            ],
            [
                567,
                570
            ],
            [
                570,
                574
            ],
            [
                575,
                597
            ],
            [
                597,
                627
            ],
            [
                627,
                676
            ],
            [
                686,
                687
            ],
            [
                688,
                693
            ],
            [
                694,
                742
            ],
            [
                742,
                744
            ],
            [
                744,
                822
            ],
            [
                832,
                845
            ],
            [
                845,
                1015
            ],
            [
                1016,
                1057
            ],
            [
                1057,
                1059
            ],
            [
                1068,
                1073
            ],
            [
                1074,
                1076
            ],
            [
                1077,
                1086
            ],
            [
                1087,
                1108
            ],
            [
                1109,
                1112
            ],
            [
                1122,
                1128
            ],
            [
                1130,
                1142
            ],
            [
                1149,
                1190
            ],
            [
                1190,
                1237
            ],
            [
                1237,
                1267
            ],
            [
                1268,
                1294
            ],
            [
                1294,
                1324
            ],
            [
                1325,
                1345
            ],
            [
                1345,
                1374
            ],
            [
                1375,
                1409
            ],
            [
                1410,
                1413
            ],
            [
                1414,
                1442
            ],
            [
                1442,
                1445
            ],
            [
                1445,
                1501
            ],
            [
                1510,
                1616
            ],
            [
                1617,
                1630
            ],
            [
                1633,
                1639
            ],
            [
                1639,
                1641
            ],
            [
                1641,
                1718
            ],
            [
                1718,
                1749
            ],
            [
                1749,
                1785
            ],
            [
                1785,
                1807
            ],
            [
                1807,
                1862
            ],
            [
                1863,
                1984
            ],
            [
                1985,
                2014
            ],
            [
                2015,
                2059
            ],
            [
                2059,
                2080
            ],
            [
                2081,
                2143
            ],
            [
                2144,
                2164
            ],
            [
                2164,
                2235
            ],
            [
                2235,
                2245
            ],
            [
                2252,
                2268
            ],
            [
                2268,
                2315
            ],
            [
                2321,
                2363
            ],
            [
                2363,
                2365
            ],
            [
                2365,
                2430
            ],
            [
                2431,
                2451
            ],
            [
                2464,
                2495
            ],
            [
                2496,
                2561
            ],
            [
                2561,
                2581
            ],
            [
                2582,
                2619
            ],
            [
                2620,
                2624
            ],
            [
                2627,
                2633
            ],
            [
                2634,
                2673
            ],
            [
                2674,
                2691
            ],
            [
                2696,
                2731
            ],
            [
                2731,
                2766
            ],
            [
                2766,
                2786
            ],
            [
                2791,
                2968
            ],
            [
                2968,
                2970
            ],
            [
                2970,
                3045
            ],
            [
                3045,
                3047
            ],
            [
                3047,
                3125
            ],
            [
                3126,
                3141
            ],
            [
                3141,
                3215
            ],
            [
                3216,
                3219
            ],
            [
                3220,
                3237
            ],
            [
                3238,
                3242
            ],
            [
                3243,
                3290
            ],
            [
                3303,
                3317
            ],
            [
                3318,
                3490
            ],
            [
                3490,
                3492
            ],
            [
                3492,
                3499
            ],
            [
                3500,
                3631
            ],
            [
                3631,
                3647
            ],
            [
                3648,
                3689
            ],
            [
                3697,
                3723
            ],
            [
                3726,
                3730
            ],
            [
                3731,
                3747
            ],
            [
                3749,
                3751
            ],
            [
                3769,
                3774
            ],
            [
                3783,
                3805
            ],
            [
                3806,
                3859
            ],
            [
                3859,
                3861
            ],
            [
                3870,
                3879
            ],
            [
                3880,
                3882
            ],
            [
                3889,
                3903
            ],
            [
                3904,
                3907
            ],
            [
                3908,
                3940
            ],
            [
                3940,
                3942
            ],
            [
                3942,
                4048
            ],
            [
                4049,
                4152
            ],
            [
                4152,
                4154
            ],
            [
                4154,
                4182
            ],
            [
                4191,
                4252
            ],
            [
                4252,
                4258
            ],
            [
                4259,
                4272
            ],
            [
                4273,
                4281
            ],
            [
                4282,
                4347
            ],
            [
                4348,
                4351
            ],
            [
                4352,
                4364
            ],
            [
                4365,
                4391
            ],
            [
                4392,
                4437
            ],
            [
                4437,
                4462
            ],
            [
                4463,
                4512
            ],
            [
                4512,
                4543
            ],
            [
                4544,
                4612
            ],
            [
                4613,
                4690
            ],
            [
                4690,
                4695
            ],
            [
                4696,
                4713
            ],
            [
                4714,
                4732
            ],
            [
                4733,
                4791
            ],
            [
                4791,
                4800
            ],
            [
                4801,
                4905
            ],
            [
                4905,
                4907
            ],
            [
                4907,
                4938
            ],
            [
                4945,
                4961
            ],
            [
                4961,
                5102
            ],
            [
                5103,
                5138
            ],
            [
                5139,
                5142
            ],
            [
                5155,
                5160
            ],
            [
                5161,
                5299
            ],
            [
                5300,
                5303
            ],
            [
                5304,
                5311
            ],
            [
                5312,
                5324
            ],
            [
                5324,
                5349
            ],
            [
                5349,
                5350
            ],
            [
                5351,
                5386
            ],
            [
                5387,
                5395
            ],
            [
                5395,
                5456
            ],
            [
                5456,
                5517
            ],
            [
                5517,
                5527
            ],
            [
                5528,
                5531
            ],
            [
                5532,
                5612
            ],
            [
                5613,
                5649
            ],
            [
                5650,
                5682
            ],
            [
                5682,
                5684
            ],
            [
                5684,
                5731
            ],
            [
                5733,
                5878
            ],
            [
                5878,
                5961
            ],
            [
                5967,
                5981
            ],
            [
                5981,
                5983
            ],
            [
                5983,
                6001
            ],
            [
                6002,
                6013
            ],
            [
                6019,
                6027
            ],
            [
                6030,
                6040
            ],
            [
                6051,
                6069
            ],
            [
                6074,
                6077
            ],
            [
                6078,
                6080
            ],
            [
                6089,
                6096
            ],
            [
                6097,
                6109
            ],
            [
                6110,
                6114
            ],
            [
                6121,
                6163
            ],
            [
                6165,
                6178
            ],
            [
                6178,
                6179
            ],
            [
                6180,
                6199
            ],
            [
                6205,
                6220
            ],
            [
                6228,
                6246
            ],
            [
                6252,
                6286
            ],
            [
                6292,
                6372
            ],
            [
                6372,
                6374
            ],
            [
                6374,
                6415
            ],
            [
                6416,
                6418
            ],
            [
                6429,
                6452
            ],
            [
                6452,
                6466
            ],
            [
                6467,
                6511
            ],
            [
                6512,
                6546
            ],
            [
                6549,
                6648
            ],
            [
                6648,
                6661
            ],
            [
                6662,
                6750
            ],
            [
                6761,
                6781
            ],
            [
                6806,
                6813
            ],
            [
                6813,
                6878
            ],
            [
                6878,
                6880
            ],
            [
                6880,
                6886
            ],
            [
                6887,
                6890
            ],
            [
                6891,
                6930
            ],
            [
                6934,
                6987
            ],
            [
                6998,
                6999
            ],
            [
                7035,
                7071
            ],
            [
                7072,
                7088
            ],
            [
                7089,
                7123
            ],
            [
                7127,
                7131
            ],
            [
                7132,
                7151
            ],
            [
                7151,
                7167
            ],
            [
                7168,
                7205
            ],
            [
                7206,
                7209
            ],
            [
                7210,
                7215
            ],
            [
                7215,
                7233
            ],
            [
                7233,
                7238
            ],
            [
                7239,
                7273
            ],
            [
                7274,
                7302
            ],
            [
                7303,
                7435
            ],
            [
                7435,
                7437
            ],
            [
                7437,
                7505
            ],
            [
                7505,
                7514
            ],
            [
                7515,
                7526
            ],
            [
                7527,
                7551
            ],
            [
                7551,
                7602
            ],
            [
                7602,
                7604
            ],
            [
                7604,
                7620
            ],
            [
                7620,
                7639
            ],
            [
                7639,
                7642
            ],
            [
                7642,
                7684
            ],
            [
                7693,
                7736
            ],
            [
                7736,
                7741
            ],
            [
                7742,
                7762
            ],
            [
                7769,
                7783
            ],
            [
                7783,
                7785
            ],
            [
                7785,
                7829
            ],
            [
                7829,
                7831
            ],
            [
                7832,
                7873
            ],
            [
                7873,
                7921
            ],
            [
                7921,
                7923
            ],
            [
                7923,
                7924
            ],
            [
                7925,
                7993
            ],
            [
                7993,
                8078
            ],
            [
                8078,
                8121
            ],
            [
                8124,
                8142
            ],
            [
                8143,
                8265
            ],
            [
                8266,
                8271
            ],
            [
                8272,
                8279
            ],
            [
                8279,
                8281
            ],
            [
                8281,
                8290
            ],
            [
                8291,
                8331
            ],
            [
                8331,
                8365
            ],
            [
                8366,
                8379
            ],
            [
                8379,
                8402
            ],
            [
                8402,
                8404
            ],
            [
                8404,
                8456
            ],
            [
                8456,
                8491
            ],
            [
                8491,
                8494
            ],
            [
                8495,
                8519
            ],
            [
                8520,
                8523
            ],
            [
                8524,
                8537
            ],
            [
                8537,
                8606
            ],
            [
                8607,
                8652
            ],
            [
                8652,
                8695
            ],
            [
                8695,
                8884
            ],
            [
                8884,
                8886
            ],
            [
                8886,
                8951
            ],
            [
                8957,
                8960
            ],
            [
                8968,
                8970
            ],
            [
                8974,
                9004
            ],
            [
                9004,
                9065
            ],
            [
                9074,
                9099
            ],
            [
                9102,
                9116
            ],
            [
                9116,
                9149
            ],
            [
                9149,
                9234
            ],
            [
                9235,
                9261
            ],
            [
                9261,
                9320
            ],
            [
                9321,
                9324
            ],
            [
                9325,
                9339
            ],
            [
                9339,
                9345
            ],
            [
                9346,
                9394
            ],
            [
                9395,
                9402
            ],
            [
                9406,
                9419
            ],
            [
                9419,
                9428
            ],
            [
                9429,
                9480
            ],
            [
                9481,
                9501
            ],
            [
                9521,
                9532
            ],
            [
                9533,
                9562
            ],
            [
                9562,
                9582
            ],
            [
                9583,
                9586
            ],
            [
                9587,
                9617
            ],
            [
                9617,
                9643
            ],
            [
                9643,
                9688
            ],
            [
                9689,
                9695
            ],
            [
                9695,
                9697
            ],
            [
                9697,
                9997
            ],
            [
                10009,
                10011
            ],
            [
                10011,
                10042
            ],
            [
                10042,
                10058
            ],
            [
                10058,
                10079
            ],
            [
                10079,
                10080
            ],
            [
                10080,
                10151
            ],
            [
                10151,
                10211
            ],
            [
                10212,
                10248
            ],
            [
                10248,
                10276
            ],
            [
                10276,
                10326
            ],
            [
                10327,
                10340
            ],
            [
                10340,
                10393
            ],
            [
                10393,
                10395
            ],
            [
                10395,
                10414
            ],
            [
                10414,
                10455
            ],
            [
                10455,
                10463
            ],
            [
                10464,
                10524
            ],
            [
                10524,
                10556
            ],
            [
                10557,
                10573
            ],
            [
                10573,
                10614
            ],
            [
                10616,
                10693
            ],
            [
                10693,
                10704
            ],
            [
                10705,
                10707
            ],
            [
                10708,
                10728
            ],
            [
                10729,
                10732
            ],
            [
                10733,
                10744
            ],
            [
                10745,
                10754
            ],
            [
                10755,
                10758
            ],
            [
                10759,
                10776
            ],
            [
                10776,
                10816
            ],
            [
                10816,
                10937
            ],
            [
                10937,
                10958
            ],
            [
                10959,
                11022
            ],
            [
                11022,
                11075
            ],
            [
                11075,
                11144
            ],
            [
                11144,
                11171
            ],
            [
                11171,
                11202
            ],
            [
                11202,
                11231
            ],
            [
                11231,
                11261
            ],
            [
                11262,
                11332
            ],
            [
                11336,
                11351
            ],
            [
                11351,
                11353
            ],
            [
                11353,
                11384
            ],
            [
                11384,
                11387
            ],
            [
                11387,
                11428
            ],
            [
                11428,
                11430
            ],
            [
                11431,
                11436
            ],
            [
                11437,
                11511
            ],
            [
                11512,
                11524
            ],
            [
                11527,
                11568
            ],
            [
                11568,
                11623
            ],
            [
                11623,
                11635
            ],
            [
                11635,
                11638
            ],
            [
                11639,
                11714
            ],
            [
                11714,
                11739
            ],
            [
                11739,
                11793
            ],
            [
                11793,
                11827
            ],
            [
                11834,
                11842
            ],
            [
                11843,
                11854
            ],
            [
                11855,
                11911
            ],
            [
                11911,
                11957
            ],
            [
                11957,
                11960
            ],
            [
                11960,
                11975
            ],
            [
                11976,
                12027
            ],
            [
                12027,
                12047
            ],
            [
                12049,
                12057
            ],
            [
                12057,
                12092
            ],
            [
                12093,
                12098
            ],
            [
                12099,
                12118
            ],
            [
                12118,
                12127
            ],
            [
                12127,
                12154
            ],
            [
                12154,
                12222
            ],
            [
                12223,
                12247
            ],
            [
                12248,
                12257
            ],
            [
                12257,
                12260
            ],
            [
                12260,
                12261
            ],
            [
                12261,
                12313
            ],
            [
                12313,
                12410
            ],
            [
                12411,
                12473
            ],
            [
                12473,
                12503
            ],
            [
                12503,
                12572
            ],
            [
                12572,
                12604
            ],
            [
                12605,
                12621
            ],
            [
                12621,
                12624
            ],
            [
                12624,
                12625
            ],
            [
                12625,
                12695
            ],
            [
                12696,
                12721
            ],
            [
                12721,
                12840
            ],
            [
                12840,
                12842
            ],
            [
                12842,
                12881
            ],
            [
                12881,
                12930
            ],
            [
                12930,
                12971
            ],
            [
                12971,
                12973
            ],
            [
                12973,
                13014
            ],
            [
                13015,
                13038
            ],
            [
                13038,
                13041
            ],
            [
                13041,
                13087
            ],
            [
                13087,
                13173
            ],
            [
                13173,
                13206
            ],
            [
                13207,
                13292
            ],
            [
                13292,
                13314
            ],
            [
                13315,
                13332
            ],
            [
                13333,
                13358
            ],
            [
                13359,
                13384
            ],
            [
                13384,
                13385
            ],
            [
                13386,
                13410
            ],
            [
                13411,
                13435
            ],
            [
                13435,
                13473
            ],
            [
                13474,
                13493
            ],
            [
                13493,
                13496
            ],
            [
                13496,
                13533
            ],
            [
                13533,
                13559
            ],
            [
                13560,
                13589
            ],
            [
                13589,
                13608
            ],
            [
                13608,
                13630
            ],
            [
                13631,
                13646
            ],
            [
                13646,
                13709
            ],
            [
                13709,
                13711
            ],
            [
                13711,
                13721
            ],
            [
                13722,
                13740
            ],
            [
                13745,
                13750
            ],
            [
                13751,
                13792
            ],
            [
                13792,
                13876
            ],
            [
                13882,
                13895
            ],
            [
                13896,
                13907
            ],
            [
                13908,
                14001
            ],
            [
                14001,
                14043
            ],
            [
                14044,
                14055
            ],
            [
                14066,
                14068
            ],
            [
                14073,
                14078
            ],
            [
                14079,
                14087
            ],
            [
                14088,
                14123
            ],
            [
                14123,
                14155
            ],
            [
                14156,
                14160
            ],
            [
                14160,
                14162
            ],
            [
                14162,
                14169
            ],
            [
                14170,
                14227
            ],
            [
                14227,
                14229
            ],
            [
                14229,
                14253
            ],
            [
                14253,
                14426
            ]
        ],
        "row_chars": [
            [
                0,
                46
            ],
            [
                46,
                72
            ],
            [
                72,
                72
            ],
            [
                72,
                84
            ],
            [
                84,
                188
            ],
            [
                188,
                188
            ],
            [
                188,
                226
            ],
            [
                226,
                313
            ],
            [
                313,
                322
            ],
            [
                322,
                376
            ],
            [
                376,
                376
            ],
            [
                376,
                487
            ],
            [
                487,
                518
            ],
            [
                518,
                550
            ],
            [
                550,
                570
            ],
            [
                570,
                597
            ],
            [
                597,
                627
            ],
            [
                627,
                744
            ],
            [
                744,
                744
            ],
            [
                744,
                845
            ],
            [
                845,
                1059
            ],
            [
                1059,
                1130
            ],
            [
                1130,
                1130
            ],
            [
                1130,
                1130
            ],
            [
                1130,
                1130
            ],
            [
                1130,
                1190
            ],
            [
                1190,
                1237
            ],
            [
                1237,
                1237
            ],
            [
                1237,
                1294
            ],
            [
                1294,
                1345
            ],
            [
                1345,
                1445
            ],
            [
                1445,
                1641
            ],
            [
                1641,
                1718
            ],
            [
                1718,
                1749
            ],
            [
                1749,
                1785
            ],
            [
                1785,
                2015
            ],
            [
                2015,
                2059
            ],
            [
                2059,
                2235
            ],
            [
                2235,
                2365
            ],
            [
                2365,
                2561
            ],
            [
                2561,
                2561
            ],
            [
                2561,
                2561
            ],
            [
                2561,
                2766
            ],
            [
                2766,
                2970
            ],
            [
                2970,
                3047
            ],
            [
                3047,
                3141
            ],
            [
                3141,
                3492
            ],
            [
                3492,
                3648
            ],
            [
                3648,
                3648
            ],
            [
                3648,
                3861
            ],
            [
                3861,
                3942
            ],
            [
                3942,
                4154
            ],
            [
                4154,
                4252
            ],
            [
                4252,
                4392
            ],
            [
                4392,
                4437
            ],
            [
                4437,
                4512
            ],
            [
                4512,
                4791
            ],
            [
                4791,
                4907
            ],
            [
                4907,
                4961
            ],
            [
                4961,
                5324
            ],
            [
                5324,
                5395
            ],
            [
                5395,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5650
            ],
            [
                5650,
                5684
            ],
            [
                5684,
                5878
            ],
            [
                5878,
                5983
            ],
            [
                5983,
                6097
            ],
            [
                6097,
                6097
            ],
            [
                6097,
                6286
            ],
            [
                6286,
                6374
            ],
            [
                6374,
                6549
            ],
            [
                6549,
                6549
            ],
            [
                6549,
                6648
            ],
            [
                6648,
                6880
            ],
            [
                6880,
                6933
            ],
            [
                6933,
                6933
            ],
            [
                6933,
                6933
            ],
            [
                6933,
                7151
            ],
            [
                7151,
                7437
            ],
            [
                7437,
                7505
            ],
            [
                7505,
                7514
            ],
            [
                7514,
                7514
            ],
            [
                7514,
                7551
            ],
            [
                7551,
                7604
            ],
            [
                7604,
                7620
            ],
            [
                7620,
                7642
            ],
            [
                7642,
                7785
            ],
            [
                7785,
                7831
            ],
            [
                7831,
                7873
            ],
            [
                7873,
                7923
            ],
            [
                7923,
                7993
            ],
            [
                7993,
                8078
            ],
            [
                8078,
                8124
            ],
            [
                8124,
                8281
            ],
            [
                8281,
                8379
            ],
            [
                8379,
                8404
            ],
            [
                8404,
                8456
            ],
            [
                8456,
                8491
            ],
            [
                8491,
                8537
            ],
            [
                8537,
                8652
            ],
            [
                8652,
                8695
            ],
            [
                8695,
                8886
            ],
            [
                8886,
                9004
            ],
            [
                9004,
                9004
            ],
            [
                9004,
                9004
            ],
            [
                9004,
                9116
            ],
            [
                9116,
                9235
            ],
            [
                9235,
                9261
            ],
            [
                9261,
                9339
            ],
            [
                9339,
                9562
            ],
            [
                9562,
                9697
            ],
            [
                9697,
                10011
            ],
            [
                10011,
                10058
            ],
            [
                10058,
                10079
            ],
            [
                10079,
                10151
            ],
            [
                10151,
                10248
            ],
            [
                10248,
                10276
            ],
            [
                10276,
                10340
            ],
            [
                10340,
                10395
            ],
            [
                10395,
                10455
            ],
            [
                10455,
                10524
            ],
            [
                10524,
                10573
            ],
            [
                10573,
                10693
            ],
            [
                10693,
                10937
            ],
            [
                10937,
                11022
            ],
            [
                11022,
                11075
            ],
            [
                11075,
                11144
            ],
            [
                11144,
                11171
            ],
            [
                11171,
                11202
            ],
            [
                11202,
                11231
            ],
            [
                11231,
                11261
            ],
            [
                11261,
                11261
            ],
            [
                11261,
                11353
            ],
            [
                11353,
                11353
            ],
            [
                11353,
                11387
            ],
            [
                11387,
                11430
            ],
            [
                11430,
                11527
            ],
            [
                11527,
                11527
            ],
            [
                11527,
                11568
            ],
            [
                11568,
                11623
            ],
            [
                11623,
                11635
            ],
            [
                11635,
                11714
            ],
            [
                11714,
                11911
            ],
            [
                11911,
                11960
            ],
            [
                11960,
                12049
            ],
            [
                12049,
                12057
            ],
            [
                12057,
                12127
            ],
            [
                12127,
                12154
            ],
            [
                12154,
                12154
            ],
            [
                12154,
                12260
            ],
            [
                12260,
                12313
            ],
            [
                12313,
                12473
            ],
            [
                12473,
                12572
            ],
            [
                12572,
                12624
            ],
            [
                12624,
                12842
            ],
            [
                12842,
                12881
            ],
            [
                12881,
                12973
            ],
            [
                12973,
                13041
            ],
            [
                13041,
                13087
            ],
            [
                13087,
                13173
            ],
            [
                13173,
                13292
            ],
            [
                13292,
                13292
            ],
            [
                13292,
                13435
            ],
            [
                13435,
                13533
            ],
            [
                13533,
                13533
            ],
            [
                13533,
                13589
            ],
            [
                13589,
                13711
            ],
            [
                13711,
                13792
            ],
            [
                13792,
                13876
            ],
            [
                13876,
                13876
            ],
            [
                13876,
                14001
            ],
            [
                14001,
                14123
            ],
            [
                14123,
                14162
            ],
            [
                14162,
                14229
            ],
            [
                14229,
                14426
            ]
        ]
    }
}