{
    "original": {
        "text": "Fanny's rides recommenced the very next day; and as it was a pleasant fresh-feeling morning, less hot than the weather had lately been, Edmund trusted that her losses, both of health and pleasure, would be soon made good. While she was gone Mr. Rushworth arrived, escorting his mother, who came to be civil and to shew her civility especially, in urging the execution of the plan for visiting Sotherton, which had been started a fortnight before, and which, in consequence of her subsequent absence from home, had since lain dormant. Mrs. Norris and her nieces were all well pleased with its revival, and an early day was named and agreed to, provided Mr. Crawford should be disengaged: the young ladies did not forget that stipulation, and though Mrs. Norris would willingly have answered for his being so, they would neither authorise the liberty nor run the risk; and at last, on a hint from Miss Bertram, Mr. Rushworth discovered that the properest thing to be done was for him to walk down to the Parsonage directly, and call on Mr. Crawford, and inquire whether Wednesday would suit him or not.\nBefore his return Mrs. Grant and Miss Crawford came in. Having been out some time, and taken a different route to the house, they had not met him. Comfortable hopes, however, were given that he would find Mr. Crawford at home. The Sotherton scheme was mentioned of course. It was hardly possible, indeed, that anything else should be talked of, for Mrs. Norris was in high spirits about it; and Mrs. Rushworth, a well-meaning, civil, prosing, pompous woman, who thought nothing of consequence, but as it related to her own and her son's concerns, had not yet given over pressing Lady Bertram to be of the party. Lady Bertram constantly declined it; but her placid manner of refusal made Mrs. Rushworth still think she wished to come, till Mrs. Norris's more numerous words and louder tone convinced her of the truth.\n\"The fatigue would be too much for my sister, a great deal too much, I assure you, my dear Mrs. Rushworth. Ten miles there, and ten back, you know. You must excuse my sister on this occasion, and accept of our two dear girls and myself without her. Sotherton is the only place that could give her a _wish_ to go so far, but it cannot be, indeed. She will have a companion in Fanny Price, you know, so it will all do very well; and as for Edmund, as he is not here to speak for himself, I will answer for his being most happy to join the party. He can go on horseback, you know.\"\nMrs. Rushworth being obliged to yield to Lady Bertram's staying at home, could only be sorry. \"The loss of her ladyship's company would be a great drawback, and she should have been extremely happy to have seen the young lady too, Miss Price, who had never been at Sotherton yet, and it was a pity she should not see the place.\"\n\"You are very kind, you are all kindness, my dear madam,\" cried Mrs. Norris; \"but as to Fanny, she will have opportunities in plenty of seeing Sotherton. She has time enough before her; and her going now is quite out of the question. Lady Bertram could not possibly spare her.\"\n\"Oh no! I cannot do without Fanny.\"\nMrs. Rushworth proceeded next, under the conviction that everybody must be wanting to see Sotherton, to include Miss Crawford in the invitation; and though Mrs. Grant, who had not been at the trouble of visiting Mrs. Rushworth, on her coming into the neighbourhood, civilly declined it on her own account, she was glad to secure any pleasure for her sister; and Mary, properly pressed and persuaded, was not long in accepting her share of the civility. Mr. Rushworth came back from the Parsonage successful; and Edmund made his appearance just in time to learn what had been settled for Wednesday, to attend Mrs. Rushworth to her carriage, and walk half-way down the park with the two other ladies.\nOn his return to the breakfast-room, he found Mrs. Norris trying to make up her mind as to whether Miss Crawford's being of the party were desirable or not, or whether her brother's barouche would not be full without her. The Miss Bertrams laughed at the idea, assuring her that the barouche would hold four perfectly well, independent of the box, on which _one_ might go with him.\n\"But why is it necessary,\" said Edmund, \"that Crawford's carriage, or his _only_, should be employed? Why is no use to be made of my mother's chaise? I could not, when the scheme was first mentioned the other day, understand why a visit from the family were not to be made in the carriage of the family.\"\n\"What!\" cried Julia: \"go boxed up three in a postchaise in this weather, when we may have seats in a barouche! No, my dear Edmund, that will not quite do.\"\n\"Besides,\" said Maria, \"I know that Mr. Crawford depends upon taking us. After what passed at first, he would claim it as a promise.\"\n\"And, my dear Edmund,\" added Mrs. Norris, \"taking out _two_ carriages when _one_ will do, would be trouble for nothing; and, between ourselves, coachman is not very fond of the roads between this and Sotherton: he always complains bitterly of the narrow lanes scratching his carriage, and you know one should not like to have dear Sir Thomas, when he comes home, find all the varnish scratched off.\"\n\"That would not be a very handsome reason for using Mr. Crawford's,\" said Maria; \"but the truth is, that Wilcox is a stupid old fellow, and does not know how to drive. I will answer for it that we shall find no inconvenience from narrow roads on Wednesday.\"\n\"There is no hardship, I suppose, nothing unpleasant,\" said Edmund, \"in going on the barouche box.\"\n\"Unpleasant!\" cried Maria: \"oh dear! I believe it would be generally thought the favourite seat. There can be no comparison as to one's view of the country. Probably Miss Crawford will choose the barouche-box herself.\"\n\"There can be no objection, then, to Fanny's going with you; there can be no doubt of your having room for her.\"\n\"Fanny!\" repeated Mrs. Norris; \"my dear Edmund, there is no idea of her going with us. She stays with her aunt. I told Mrs. Rushworth so. She is not expected.\"\n\"You can have no reason, I imagine, madam,\" said he, addressing his mother, \"for wishing Fanny _not_ to be of the party, but as it relates to yourself, to your own comfort. If you could do without her, you would not wish to keep her at home?\"\n\"To be sure not, but I _cannot_ do without her.\"\n\"You can, if I stay at home with you, as I mean to do.\"\nThere was a general cry out at this. \"Yes,\" he continued, \"there is no necessity for my going, and I mean to stay at home. Fanny has a great desire to see Sotherton. I know she wishes it very much. She has not often a gratification of the kind, and I am sure, ma'am, you would be glad to give her the pleasure now?\"\n\"Oh yes! very glad, if your aunt sees no objection.\"\nMrs. Norris was very ready with the only objection which could remain-their having positively assured Mrs. Rushworth that Fanny could not go, and the very strange appearance there would consequently be in taking her, which seemed to her a difficulty quite impossible to be got over. It must have the strangest appearance! It would be something so very unceremonious, so bordering on disrespect for Mrs. Rushworth, whose own manners were such a pattern of good-breeding and attention, that she really did not feel equal to it. Mrs. Norris had no affection for Fanny, and no wish of procuring her pleasure at any time; but her opposition to Edmund _now_, arose more from partiality for her own scheme, because it _was_ her own, than from anything else. She felt that she had arranged everything extremely well, and that any alteration must be for the worse. When Edmund, therefore, told her in reply, as he did when she would give him the hearing, that she need not distress herself on Mrs. Rushworth's account, because he had taken the opportunity, as he walked with her through the hall, of mentioning Miss Price as one who would probably be of the party, and had directly received a very sufficient invitation for his cousin, Mrs. Norris was too much vexed to submit with a very good grace, and would only say, \"Very well, very well, just as you chuse, settle it your own way, I am sure I do not care about it.\"\n\"It seems very odd,\" said Maria, \"that you should be staying at home instead of Fanny.\"\n\"I am sure she ought to be very much obliged to you,\" added Julia, hastily leaving the room as she spoke, from a consciousness that she ought to offer to stay at home herself.\n\"Fanny will feel quite as grateful as the occasion requires,\" was Edmund's only reply, and the subject dropt.\nFanny's gratitude, when she heard the plan, was, in fact, much greater than her pleasure. She felt Edmund's kindness with all, and more than all, the sensibility which he, unsuspicious of her fond attachment, could be aware of; but that he should forego any enjoyment on her account gave her pain, and her own satisfaction in seeing Sotherton would be nothing without him.\nThe next meeting of the two Mansfield families produced another alteration in the plan, and one that was admitted with general approbation. Mrs. Grant offered herself as companion for the day to Lady Bertram in lieu of her son, and Dr. Grant was to join them at dinner. Lady Bertram was very well pleased to have it so, and the young ladies were in spirits again. Even Edmund was very thankful for an arrangement which restored him to his share of the party; and Mrs. Norris thought it an excellent plan, and had it at her tongue's end, and was on the point of proposing it, when Mrs. Grant spoke.\nWednesday was fine, and soon after breakfast the barouche arrived, Mr. Crawford driving his sisters; and as everybody was ready, there was nothing to be done but for Mrs. Grant to alight and the others to take their places. The place of all places, the envied seat, the post of honour, was unappropriated. To whose happy lot was it to fall? While each of the Miss Bertrams were meditating how best, and with the most appearance of obliging the others, to secure it, the matter was settled by Mrs. Grant's saying, as she stepped from the carriage, \"As there are five of you, it will be better that one should sit with Henry; and as you were saying lately that you wished you could drive, Julia, I think this will be a good opportunity for you to take a lesson.\"\nHappy Julia! Unhappy Maria! The former was on the barouche-box in a moment, the latter took her seat within, in gloom and mortification; and the carriage drove off amid the good wishes of the two remaining ladies, and the barking of Pug in his mistress's arms.\nTheir road was through a pleasant country; and Fanny, whose rides had never been extensive, was soon beyond her knowledge, and was very happy in observing all that was new, and admiring all that was pretty. She was not often invited to join in the conversation of the others, nor did she desire it. Her own thoughts and reflections were habitually her best companions; and, in observing the appearance of the country, the bearings of the roads, the difference of soil, the state of the harvest, the cottages, the cattle, the children, she found entertainment that could only have been heightened by having Edmund to speak to of what she felt. That was the only point of resemblance between her and the lady who sat by her: in everything but a value for Edmund, Miss Crawford was very unlike her. She had none of Fanny's delicacy of taste, of mind, of feeling; she saw Nature, inanimate Nature, with little observation; her attention was all for men and women, her talents for the light and lively. In looking back after Edmund, however, when there was any stretch of road behind them, or when he gained on them in ascending a considerable hill, they were united, and a \"there he is\" broke at the same moment from them both, more than once.\nFor the first seven miles Miss Bertram had very little real comfort: her prospect always ended in Mr. Crawford and her sister sitting side by side, full of conversation and merriment; and to see only his expressive profile as he turned with a smile to Julia, or to catch the laugh of the other, was a perpetual source of irritation, which her own sense of propriety could but just smooth over. When Julia looked back, it was with a countenance of delight, and whenever she spoke to them, it was in the highest spirits: \"her view of the country was charming, she wished they could all see it,\" etc.; but her only offer of exchange was addressed to Miss Crawford, as they gained the summit of a long hill, and was not more inviting than this: \"Here is a fine burst of country. I wish you had my seat, but I dare say you will not take it, let me press you ever so much;\" and Miss Crawford could hardly answer before they were moving again at a good pace.\nWhen they came within the influence of Sotherton associations, it was better for Miss Bertram, who might be said to have two strings to her bow. She had Rushworth feelings, and Crawford feelings, and in the vicinity of Sotherton the former had considerable effect. Mr. Rushworth's consequence was hers. She could not tell Miss Crawford that \"those woods belonged to Sotherton,\" she could not carelessly observe that \"she believed that it was now all Mr. Rushworth's property on each side of the road,\" without elation of heart; and it was a pleasure to increase with their approach to the capital freehold mansion, and ancient manorial residence of the family, with all its rights of court-leet and court-baron.\n\"Now we shall have no more rough road, Miss Crawford; our difficulties are over. The rest of the way is such as it ought to be. Mr. Rushworth has made it since he succeeded to the estate. Here begins the village. Those cottages are really a disgrace. The church spire is reckoned remarkably handsome. I am glad the church is not so close to the great house as often happens in old places. The annoyance of the bells must be terrible. There is the parsonage: a tidy-looking house, and I understand the clergyman and his wife are very decent people. Those are almshouses, built by some of the family. To the right is the steward's house; he is a very respectable man. Now we are coming to the lodge-gates; but we have nearly a mile through the park still. It is not ugly, you see, at this end; there is some fine timber, but the situation of the house is dreadful. We go down hill to it for half a mile, and it is a pity, for it would not be an ill-looking place if it had a better approach.\"\nMiss Crawford was not slow to admire; she pretty well guessed Miss Bertram's feelings, and made it a point of honour to promote her enjoyment to the utmost. Mrs. Norris was all delight and volubility; and even Fanny had something to say in admiration, and might be heard with complacency. Her eye was eagerly taking in everything within her reach; and after being at some pains to get a view of the house, and observing that \"it was a sort of building which she could not look at but with respect,\" she added, \"Now, where is the avenue? The house fronts the east, I perceive. The avenue, therefore, must be at the back of it. Mr. Rushworth talked of the west front.\"\n\"Yes, it is exactly behind the house; begins at a little distance, and ascends for half a mile to the extremity of the grounds. You may see something of it here-something of the more distant trees. It is oak entirely.\"\nMiss Bertram could now speak with decided information of what she had known nothing about when Mr. Rushworth had asked her opinion; and her spirits were in as happy a flutter as vanity and pride could furnish, when they drove up to the spacious stone steps before the principal entrance.",
        "paragraph_chars": [
            [
                0,
                1101
            ],
            [
                1101,
                1918
            ],
            [
                1918,
                2497
            ],
            [
                2497,
                2826
            ],
            [
                2826,
                3104
            ],
            [
                3104,
                3140
            ],
            [
                3140,
                3839
            ],
            [
                3839,
                4221
            ],
            [
                4221,
                4526
            ],
            [
                4526,
                4682
            ],
            [
                4682,
                4816
            ],
            [
                4816,
                5216
            ],
            [
                5216,
                5474
            ],
            [
                5474,
                5574
            ],
            [
                5574,
                5793
            ],
            [
                5793,
                5906
            ],
            [
                5906,
                6066
            ],
            [
                6066,
                6309
            ],
            [
                6309,
                6358
            ],
            [
                6358,
                6414
            ],
            [
                6414,
                6730
            ],
            [
                6730,
                6783
            ],
            [
                6783,
                8196
            ],
            [
                8196,
                8284
            ],
            [
                8284,
                8460
            ],
            [
                8460,
                8570
            ],
            [
                8570,
                8943
            ],
            [
                8943,
                9541
            ],
            [
                9541,
                10302
            ],
            [
                10302,
                10563
            ],
            [
                10563,
                11803
            ],
            [
                11803,
                12755
            ],
            [
                12755,
                13467
            ],
            [
                13467,
                14458
            ],
            [
                14458,
                15125
            ],
            [
                15125,
                15344
            ],
            [
                15344,
                15631
            ]
        ],
        "segment_chars": [
            [
                0,
                222
            ],
            [
                222,
                534
            ],
            [
                534,
                1101
            ],
            [
                1101,
                1157
            ],
            [
                1157,
                1248
            ],
            [
                1248,
                1328
            ],
            [
                1328,
                1374
            ],
            [
                1374,
                1713
            ],
            [
                1713,
                1918
            ],
            [
                1918,
                2025
            ],
            [
                2025,
                2066
            ],
            [
                2066,
                2167
            ],
            [
                2167,
                2264
            ],
            [
                2264,
                2462
            ],
            [
                2462,
                2497
            ],
            [
                2497,
                2591
            ],
            [
                2591,
                2826
            ],
            [
                2826,
                2980
            ],
            [
                2980,
                3060
            ],
            [
                3060,
                3104
            ],
            [
                3104,
                3112
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3593
            ],
            [
                3593,
                3839
            ],
            [
                3839,
                4061
            ],
            [
                4061,
                4221
            ],
            [
                4221,
                4323
            ],
            [
                4323,
                4371
            ],
            [
                4371,
                4526
            ],
            [
                4526,
                4534
            ],
            [
                4534,
                4637
            ],
            [
                4637,
                4682
            ],
            [
                4682,
                4755
            ],
            [
                4755,
                4816
            ],
            [
                4816,
                5216
            ],
            [
                5216,
                5384
            ],
            [
                5384,
                5474
            ],
            [
                5474,
                5574
            ],
            [
                5574,
                5588
            ],
            [
                5588,
                5611
            ],
            [
                5611,
                5671
            ],
            [
                5671,
                5731
            ],
            [
                5731,
                5793
            ],
            [
                5793,
                5906
            ],
            [
                5906,
                5915
            ],
            [
                5915,
                5993
            ],
            [
                5993,
                6018
            ],
            [
                6018,
                6044
            ],
            [
                6044,
                6066
            ],
            [
                6066,
                6239
            ],
            [
                6239,
                6309
            ],
            [
                6309,
                6358
            ],
            [
                6358,
                6414
            ],
            [
                6414,
                6451
            ],
            [
                6451,
                6537
            ],
            [
                6537,
                6580
            ],
            [
                6580,
                6612
            ],
            [
                6612,
                6730
            ],
            [
                6730,
                6739
            ],
            [
                6739,
                6783
            ],
            [
                6783,
                7066
            ],
            [
                7066,
                7105
            ],
            [
                7105,
                7309
            ],
            [
                7309,
                7534
            ],
            [
                7534,
                7639
            ],
            [
                7639,
                8196
            ],
            [
                8196,
                8284
            ],
            [
                8284,
                8460
            ],
            [
                8460,
                8570
            ],
            [
                8570,
                8660
            ],
            [
                8660,
                8943
            ],
            [
                8943,
                9083
            ],
            [
                9083,
                9213
            ],
            [
                9213,
                9307
            ],
            [
                9307,
                9541
            ],
            [
                9541,
                9765
            ],
            [
                9765,
                9847
            ],
            [
                9847,
                9882
            ],
            [
                9882,
                10302
            ],
            [
                10302,
                10315
            ],
            [
                10315,
                10330
            ],
            [
                10330,
                10563
            ],
            [
                10563,
                10770
            ],
            [
                10770,
                10862
            ],
            [
                10862,
                11206
            ],
            [
                11206,
                11359
            ],
            [
                11359,
                11561
            ],
            [
                11561,
                11803
            ],
            [
                11803,
                12197
            ],
            [
                12197,
                12578
            ],
            [
                12578,
                12755
            ],
            [
                12755,
                12900
            ],
            [
                12900,
                13020
            ],
            [
                13020,
                13058
            ],
            [
                13058,
                13467
            ],
            [
                13467,
                13548
            ],
            [
                13548,
                13595
            ],
            [
                13595,
                13655
            ],
            [
                13655,
                13680
            ],
            [
                13680,
                13718
            ],
            [
                13718,
                13768
            ],
            [
                13768,
                13856
            ],
            [
                13856,
                13901
            ],
            [
                13901,
                14015
            ],
            [
                14015,
                14066
            ],
            [
                14066,
                14133
            ],
            [
                14133,
                14221
            ],
            [
                14221,
                14330
            ],
            [
                14330,
                14458
            ],
            [
                14458,
                14615
            ],
            [
                14615,
                14747
            ],
            [
                14747,
                14995
            ],
            [
                14995,
                15034
            ],
            [
                15034,
                15084
            ],
            [
                15084,
                15125
            ],
            [
                15125,
                15253
            ],
            [
                15253,
                15323
            ],
            [
                15323,
                15344
            ],
            [
                15344,
                15631
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                134,
                159
            ],
            [
                173,
                182
            ],
            [
                197,
                222
            ],
            [
                222,
                297
            ],
            [
                311,
                313
            ],
            [
                393,
                403
            ],
            [
                532,
                534
            ],
            [
                534,
                565
            ],
            [
                570,
                582
            ],
            [
                599,
                621
            ],
            [
                632,
                638
            ],
            [
                641,
                674
            ],
            [
                685,
                686
            ],
            [
                628,
                631
            ],
            [
                880,
                922
            ],
            [
                982,
                1092
            ],
            [
                1099,
                1101
            ],
            [
                1101,
                1157
            ],
            [
                1157,
                1163
            ],
            [
                1188,
                1246
            ],
            [
                1287,
                1328
            ],
            [
                1328,
                1374
            ],
            [
                1450,
                1558
            ],
            [
                1377,
                1380
            ],
            [
                1671,
                1695
            ],
            [
                1702,
                1705
            ],
            [
                1711,
                1713
            ],
            [
                1713,
                1745
            ],
            [
                1748,
                1851
            ],
            [
                1890,
                1918
            ],
            [
                1918,
                1963
            ],
            [
                2001,
                2025
            ],
            [
                2025,
                2066
            ],
            [
                2066,
                2074
            ],
            [
                2114,
                2120
            ],
            [
                2124,
                2167
            ],
            [
                2264,
                2304
            ],
            [
                2343,
                2362
            ],
            [
                2402,
                2462
            ],
            [
                2462,
                2497
            ],
            [
                2497,
                2511
            ],
            [
                2584,
                2591
            ],
            [
                2591,
                2592
            ],
            [
                2658,
                2707
            ],
            [
                2604,
                2616
            ],
            [
                2652,
                2657
            ],
            [
                2728,
                2775
            ],
            [
                2823,
                2826
            ],
            [
                2826,
                2827
            ],
            [
                2846,
                2907
            ],
            [
                2914,
                2919
            ],
            [
                2925,
                2980
            ],
            [
                3016,
                3032
            ],
            [
                3039,
                3060
            ],
            [
                3060,
                3104
            ],
            [
                3104,
                3112
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3169
            ],
            [
                3223,
                3225
            ],
            [
                3252,
                3265
            ],
            [
                3496,
                3506
            ],
            [
                3450,
                3453
            ],
            [
                3241,
                3243
            ],
            [
                3591,
                3593
            ],
            [
                3593,
                3839
            ],
            [
                3839,
                3906
            ],
            [
                3930,
                3987
            ],
            [
                3994,
                4061
            ],
            [
                4061,
                4086
            ],
            [
                4098,
                4195
            ],
            [
                4197,
                4200
            ],
            [
                4202,
                4221
            ],
            [
                4221,
                4229
            ],
            [
                4303,
                4309
            ],
            [
                4296,
                4300
            ],
            [
                4267,
                4286
            ],
            [
                4310,
                4321
            ],
            [
                4248,
                4259
            ],
            [
                4323,
                4369
            ],
            [
                4526,
                4534
            ],
            [
                4534,
                4559
            ],
            [
                4566,
                4635
            ],
            [
                4682,
                4753
            ],
            [
                4816,
                4859
            ],
            [
                4871,
                4874
            ],
            [
                4876,
                4890
            ],
            [
                4892,
                4895
            ],
            [
                4897,
                4939
            ],
            [
                4960,
                4968
            ],
            [
                5030,
                5046
            ],
            [
                5056,
                5075
            ],
            [
                5016,
                5025
            ],
            [
                5076,
                5104
            ],
            [
                5114,
                5216
            ],
            [
                5216,
                5384
            ],
            [
                5384,
                5474
            ],
            [
                5474,
                5480
            ],
            [
                5508,
                5526
            ],
            [
                5495,
                5506
            ],
            [
                5526,
                5574
            ],
            [
                5574,
                5588
            ],
            [
                5588,
                5602
            ],
            [
                5621,
                5669
            ],
            [
                5704,
                5731
            ],
            [
                5731,
                5793
            ],
            [
                5793,
                5895
            ],
            [
                5903,
                5906
            ],
            [
                5906,
                5915
            ],
            [
                5915,
                5993
            ],
            [
                5993,
                6018
            ],
            [
                6018,
                6044
            ],
            [
                6044,
                6066
            ],
            [
                6239,
                6267
            ],
            [
                6268,
                6309
            ],
            [
                6309,
                6331
            ],
            [
                6341,
                6358
            ],
            [
                6358,
                6394
            ],
            [
                6411,
                6414
            ],
            [
                6414,
                6451
            ],
            [
                6451,
                6507
            ],
            [
                6535,
                6537
            ],
            [
                6537,
                6580
            ],
            [
                6612,
                6730
            ],
            [
                6730,
                6739
            ],
            [
                6739,
                6783
            ],
            [
                6783,
                6814
            ],
            [
                6824,
                6833
            ],
            [
                6852,
                6968
            ],
            [
                6982,
                7066
            ],
            [
                7105,
                7113
            ],
            [
                7220,
                7224
            ],
            [
                7166,
                7195
            ],
            [
                7265,
                7309
            ],
            [
                7404,
                7428
            ],
            [
                7436,
                7493
            ],
            [
                7495,
                7498
            ],
            [
                7500,
                7534
            ],
            [
                7639,
                7671
            ],
            [
                7729,
                7733
            ],
            [
                7801,
                7807
            ],
            [
                7885,
                7895
            ],
            [
                7767,
                7770
            ],
            [
                7772,
                7781
            ],
            [
                7937,
                7946
            ],
            [
                7956,
                7964
            ],
            [
                7983,
                7997
            ],
            [
                7849,
                7852
            ],
            [
                8008,
                8055
            ],
            [
                8068,
                8106
            ],
            [
                8137,
                8159
            ],
            [
                8193,
                8196
            ],
            [
                8196,
                8284
            ],
            [
                8284,
                8350
            ],
            [
                8411,
                8460
            ],
            [
                8460,
                8545
            ],
            [
                8568,
                8570
            ],
            [
                8570,
                8660
            ],
            [
                8660,
                8686
            ],
            [
                8701,
                8710
            ],
            [
                8738,
                8837
            ],
            [
                8853,
                8943
            ],
            [
                8943,
                8966
            ],
            [
                8971,
                9029
            ],
            [
                9081,
                9083
            ],
            [
                9083,
                9150
            ],
            [
                9211,
                9213
            ],
            [
                9213,
                9247
            ],
            [
                9261,
                9266
            ],
            [
                9307,
                9322
            ],
            [
                9328,
                9377
            ],
            [
                9391,
                9401
            ],
            [
                9406,
                9455
            ],
            [
                9488,
                9516
            ],
            [
                9539,
                9541
            ],
            [
                9541,
                9640
            ],
            [
                9710,
                9711
            ],
            [
                9707,
                9710
            ],
            [
                9712,
                9717
            ],
            [
                9721,
                9727
            ],
            [
                9668,
                9669
            ],
            [
                9649,
                9668
            ],
            [
                9743,
                9765
            ],
            [
                9765,
                9806
            ],
            [
                9827,
                9830
            ],
            [
                9845,
                9847
            ],
            [
                9847,
                9882
            ],
            [
                9882,
                9933
            ],
            [
                9993,
                10053
            ],
            [
                10088,
                10089
            ],
            [
                10138,
                10141
            ],
            [
                10107,
                10113
            ],
            [
                10142,
                10234
            ],
            [
                10243,
                10302
            ],
            [
                10302,
                10315
            ],
            [
                10315,
                10330
            ],
            [
                10330,
                10465
            ],
            [
                10561,
                10563
            ],
            [
                10563,
                10658
            ],
            [
                10694,
                10734
            ],
            [
                10686,
                10689
            ],
            [
                10762,
                10770
            ],
            [
                10770,
                10823
            ],
            [
                10837,
                10862
            ],
            [
                10862,
                10878
            ],
            [
                10895,
                10984
            ],
            [
                11036,
                11082
            ],
            [
                10879,
                10882
            ],
            [
                11084,
                11178
            ],
            [
                11204,
                11205
            ],
            [
                11206,
                11359
            ],
            [
                11359,
                11394
            ],
            [
                11414,
                11437
            ],
            [
                11457,
                11561
            ],
            [
                11561,
                11646
            ],
            [
                11706,
                11785
            ],
            [
                11801,
                11803
            ],
            [
                11803,
                11857
            ],
            [
                11863,
                11986
            ],
            [
                12102,
                12145
            ],
            [
                12150,
                12174
            ],
            [
                11998,
                12002
            ],
            [
                12179,
                12197
            ],
            [
                12202,
                12220
            ],
            [
                12257,
                12262
            ],
            [
                12276,
                12281
            ],
            [
                12298,
                12463
            ],
            [
                12542,
                12545
            ],
            [
                12289,
                12290
            ],
            [
                12515,
                12518
            ],
            [
                12221,
                12223
            ],
            [
                12463,
                12464
            ],
            [
                12675,
                12738
            ],
            [
                12753,
                12755
            ],
            [
                12755,
                12769
            ],
            [
                12794,
                12803
            ],
            [
                12816,
                12900
            ],
            [
                12900,
                13020
            ],
            [
                13058,
                13343
            ],
            [
                13361,
                13368
            ],
            [
                13465,
                13467
            ],
            [
                13467,
                13520
            ],
            [
                13548,
                13570
            ],
            [
                13576,
                13595
            ],
            [
                13595,
                13612
            ],
            [
                13618,
                13655
            ],
            [
                13655,
                13680
            ],
            [
                13680,
                13718
            ],
            [
                13718,
                13768
            ],
            [
                13901,
                14015
            ],
            [
                14066,
                14133
            ],
            [
                14133,
                14221
            ],
            [
                14259,
                14330
            ],
            [
                14330,
                14367
            ],
            [
                14391,
                14458
            ],
            [
                14458,
                14499
            ],
            [
                14512,
                14615
            ],
            [
                14615,
                14642
            ],
            [
                14657,
                14708
            ],
            [
                14745,
                14747
            ],
            [
                14747,
                14787
            ],
            [
                14804,
                14809
            ],
            [
                14916,
                14919
            ],
            [
                14966,
                14969
            ],
            [
                14974,
                14995
            ],
            [
                15080,
                15082
            ],
            [
                15057,
                15079
            ],
            [
                14995,
                15004
            ],
            [
                15125,
                15136
            ],
            [
                15145,
                15161
            ],
            [
                15190,
                15219
            ],
            [
                15251,
                15253
            ],
            [
                15323,
                15344
            ],
            [
                15344,
                15521
            ],
            [
                15533,
                15631
            ]
        ],
        "row_chars": [
            [
                0,
                222
            ],
            [
                222,
                534
            ],
            [
                534,
                1101
            ],
            [
                1101,
                1157
            ],
            [
                1157,
                1328
            ],
            [
                1328,
                1374
            ],
            [
                1374,
                1713
            ],
            [
                1713,
                1918
            ],
            [
                1918,
                2025
            ],
            [
                2025,
                2066
            ],
            [
                2066,
                2167
            ],
            [
                2167,
                2264
            ],
            [
                2264,
                2462
            ],
            [
                2462,
                2497
            ],
            [
                2497,
                2591
            ],
            [
                2591,
                2826
            ],
            [
                2826,
                2980
            ],
            [
                2980,
                3060
            ],
            [
                3060,
                3104
            ],
            [
                3104,
                3112
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3593
            ],
            [
                3593,
                3839
            ],
            [
                3839,
                4061
            ],
            [
                4061,
                4221
            ],
            [
                4221,
                4323
            ],
            [
                4323,
                4371
            ],
            [
                4371,
                4526
            ],
            [
                4526,
                4534
            ],
            [
                4534,
                4637
            ],
            [
                4637,
                4682
            ],
            [
                4682,
                4755
            ],
            [
                4755,
                4816
            ],
            [
                4816,
                5216
            ],
            [
                5216,
                5384
            ],
            [
                5384,
                5474
            ],
            [
                5474,
                5574
            ],
            [
                5574,
                5588
            ],
            [
                5588,
                5731
            ],
            [
                5731,
                5793
            ],
            [
                5793,
                5906
            ],
            [
                5906,
                5915
            ],
            [
                5915,
                5993
            ],
            [
                5993,
                6018
            ],
            [
                6018,
                6044
            ],
            [
                6044,
                6066
            ],
            [
                6066,
                6239
            ],
            [
                6239,
                6309
            ],
            [
                6309,
                6358
            ],
            [
                6358,
                6414
            ],
            [
                6414,
                6451
            ],
            [
                6451,
                6537
            ],
            [
                6537,
                6580
            ],
            [
                6580,
                6612
            ],
            [
                6612,
                6730
            ],
            [
                6730,
                6739
            ],
            [
                6739,
                6783
            ],
            [
                6783,
                7066
            ],
            [
                7066,
                7105
            ],
            [
                7105,
                7309
            ],
            [
                7309,
                7534
            ],
            [
                7534,
                7639
            ],
            [
                7639,
                8196
            ],
            [
                8196,
                8284
            ],
            [
                8284,
                8460
            ],
            [
                8460,
                8570
            ],
            [
                8570,
                8660
            ],
            [
                8660,
                8943
            ],
            [
                8943,
                9083
            ],
            [
                9083,
                9213
            ],
            [
                9213,
                9541
            ],
            [
                9541,
                9765
            ],
            [
                9765,
                9847
            ],
            [
                9847,
                9882
            ],
            [
                9882,
                10302
            ],
            [
                10302,
                10315
            ],
            [
                10315,
                10330
            ],
            [
                10330,
                10563
            ],
            [
                10563,
                10770
            ],
            [
                10770,
                10862
            ],
            [
                10862,
                11206
            ],
            [
                11206,
                11359
            ],
            [
                11359,
                11561
            ],
            [
                11561,
                11803
            ],
            [
                11803,
                12197
            ],
            [
                12197,
                12578
            ],
            [
                12578,
                12755
            ],
            [
                12755,
                12900
            ],
            [
                12900,
                13020
            ],
            [
                13020,
                13058
            ],
            [
                13058,
                13467
            ],
            [
                13467,
                13595
            ],
            [
                13595,
                13655
            ],
            [
                13655,
                13680
            ],
            [
                13680,
                13718
            ],
            [
                13718,
                13768
            ],
            [
                13768,
                13856
            ],
            [
                13856,
                13901
            ],
            [
                13901,
                14015
            ],
            [
                14015,
                14066
            ],
            [
                14066,
                14133
            ],
            [
                14133,
                14221
            ],
            [
                14221,
                14330
            ],
            [
                14330,
                14458
            ],
            [
                14458,
                14615
            ],
            [
                14615,
                14747
            ],
            [
                14747,
                14995
            ],
            [
                14995,
                15084
            ],
            [
                15084,
                15125
            ],
            [
                15125,
                15253
            ],
            [
                15253,
                15323
            ],
            [
                15323,
                15344
            ],
            [
                15344,
                15631
            ]
        ]
    },
    "abridged": {
        "text": "Fanny's rides recommenced the very next day; and as it was cooler, Edmund trusted that her loss of health would be soon made good. While she was gone Mr. Rushworth arrived, escorting his mother, who came to urge them to visit Sotherton, as planned. Mrs. Norris and her nieces were well pleased, and an early day was agreed, provided Mr. Crawford should be free: and on a hint from Miss Bertram, Mr. Rushworth decided to walk down to the Parsonage directly, and call on Mr. Crawford, and inquire whether Wednesday would suit him.\nBefore his return Mrs. Grant and Miss Crawford came in. Having taken a different route to the house, they had not met him; but they hoped that he would find Mr. Crawford at home. The Sotherton scheme was mentioned of course. Mrs. Norris was in high spirits about it; and Mrs. Rushworth, a well-meaning, civil, prosing, pompous woman, was still pressing Lady Bertram to join the group. Lady Bertram constantly declined; but her placid manner of refusal made Mrs. Rushworth still think she wished to come, till Mrs. Norris convinced her of the truth.\n\"The fatigue would be too much for my sister, my dear Mrs. Rushworth. Ten miles there, and ten back, you know. You must accept our two dear girls and myself without her. She will have a companion in Fanny Price; and as for Edmund, I will answer for his being most happy to join the party. He can go on horseback, you know.\"\nMrs. Rushworth was sorry. \"She should have been extremely happy to have seen her Ladyship, and Miss Price, who had never been at Sotherton yet.\"\n\"You are all kindness, my dear madam,\" cried Mrs. Norris; \"but Fanny will have opportunities in plenty of seeing Sotherton. Her going now is out of the question. Lady Bertram could not possibly spare her.\"\n\"Oh no! I cannot do without Fanny.\"\nMrs. Rushworth proceeded next to invite Miss Crawford; and Mary was swift to accept. Mr. Rushworth came back from the Parsonage successful; and Edmund made his appearance just in time to learn what had been settled for Wednesday, to attend Mrs. Rushworth to her carriage, and walk half-way down the park with the two other ladies.\nOn his return to the breakfast-room, he found Mrs. Norris trying to decide whether Miss Crawford's being of the party were desirable, or whether her brother's barouche would not be full without her. The Miss Bertrams laughed, assuring her that the barouche would hold four perfectly well, independent of the box, on which one might go with him.\n\"But why should only Crawford's carriage be employed?\" said Edmund. \"Why is no use to be made of my mother's chaise?\"\n\"What!\" cried Julia: \"go boxed up in a postchaise in this weather, when we may have seats in a barouche!\"\n\"Besides,\" said Maria, \"I know that Mr. Crawford depends upon taking us.\"\n\"And, my dear Edmund,\" added Mrs. Norris, \"to take two carriages when one will do, would be trouble for nothing; and coachman always complains of the narrow lanes to Sotherton scratching his carriage, and one should not like to have dear Sir Thomas, when he comes home, find all the varnish scratched off.\"\n\"That would not be a very handsome reason for using Mr. Crawford's,\" said Maria; \"but the truth is, that Wilcox is a stupid old fellow, and does not know how to drive. I will answer for it that we shall find no inconvenience from narrow roads on Wednesday.\"\n\"There will be nothing unpleasant, I suppose,\" said Edmund, \"in going on the barouche box.\"\n\"Unpleasant!\" cried Maria: \"It would be generally thought the favourite seat, for one's view of the country. Probably Miss Crawford will choose the barouche-box herself.\"\n\"There can be no objection, then, to Fanny's going with you; there can be no doubt of your having room.\"\n\"Fanny!\" repeated Mrs. Norris; \"my dear Edmund, there is no idea of her going with us. She stays with her aunt. I told Mrs. Rushworth so. She is not expected.\"\n\"If you could do without her, madam,\" said he, addressing his mother, \"you would not wish to keep her at home?\"\n\"To be sure not, but I cannot do without her.\"\n\"You can, if I stay at home with you.\"\nThere was a general cry out at this. \"Yes,\" he continued, \"there is no necessity for my going. Fanny has a great desire to see Sotherton. She has not often a gratification of the kind, and I am sure, ma'am, you would be glad to give her the pleasure now?\"\n\"Oh yes! very glad, if your aunt sees no objection.\"\nMrs. Norris was very ready with her objection-their having positively assured Mrs. Rushworth that Fanny could not go, and the very strange appearance there would be in taking her, which seemed to her a difficulty quite impossible to be got over. It would show such disrespect for Mrs. Rushworth, that she really did not feel equal to it. Her opposition to Edmund arose more from partiality for her own scheme, because it was her own, than from anything else. When Edmund, therefore, told her that he had mentioned Miss Price to Mrs Rushworth, and had received an invitation for her, Mrs. Norris was too much vexed to submit with grace, and would only say, \"Very well, settle it your own way.\"\n\"It seems very odd,\" said Maria, \"that you should be staying at home instead of Fanny.\"\n\"I am sure she ought to be very much obliged to you,\" added Julia, conscious that she ought to offer to stay at home herself.\n\"Fanny will feel quite as grateful as the occasion requires,\" was Edmund's only reply.\nFanny's gratitude, when she heard the plan, was, in fact, much greater than her pleasure. She felt Edmund's kindness more than he, unsuspicious of her fond attachment, could be aware of; but that he should forego any enjoyment gave her pain, and her own satisfaction in seeing Sotherton would be nothing without him.\nThe next meeting of the Mansfield families produced another alteration in the plan. Mrs. Grant offered herself as companion for the day to Lady Bertram. Lady Bertram was very well pleased, and even Edmund was thankful for an arrangement which restored him to the party; while Mrs. Norris thought it an excellent plan, and had been on the point of proposing it herself.\nWednesday was fine, and soon after breakfast the barouche arrived, Mr. Crawford driving his sisters. When Mrs Grant alighted, everybody was ready to take their places. The place of all places, the envied seat, was vacant. To whose happy lot was it to fall? While each of the Miss Bertrams were meditating how to secure it, the matter was settled by Mrs. Grant's saying, \"One of you should sit with Henry; and as you were saying lately that you wished you could drive, Julia, this will be a good opportunity for you to take a lesson.\"\nHappy Julia! Unhappy Maria! The former was on the barouche-box in a moment, the latter took her seat within, in gloom and mortification; and the carriage drove off.\nTheir road was through a pleasant country; and Fanny, whose rides had never been extensive, was very happy in observing all that was new and pretty. She was not often invited to join in the conversation, nor did she desire it. Her own thoughts were habitually her best companions; and, in observing the appearance of the country, the state of the harvest, the cottages, the cattle and the children, she found entertainment that could only have been heightened by having Edmund to discuss it with.\nThat was the only point of resemblance between her and the lady who sat by her: in everything but a value for Edmund, Miss Crawford was very unlike her. She had none of Fanny's delicacy of feeling; she saw Nature with little observation; her attention was all for men and women, her talents for the light and lively. In looking back after Edmund, however, when there was any stretch of road behind them, they were united, and a \"there he is\" broke at the same moment from them both.\nFor the first seven miles Miss Bertram had very little comfort: her prospect always ended in Mr. Crawford and her sister sitting side by side, full of conversation and merriment; a perpetual source of irritation, which her sense of propriety could only just smooth over. Julia looked back, smiling, and spoke in the highest spirits: \"her view of the country was charming, she wished they could all see it,\" etc.; but her only offer of exchange was addressed to Miss Crawford: \"I wish you had my seat, but I dare say you will not take it, let me press you ever so much.\" Miss Crawford could hardly answer before they were moving again.\nWhen they came nearer to Sotherton, it was better for Miss Bertram, who might be said to have two strings to her bow. She had Rushworth feelings, and Crawford feelings, and in the vicinity of Sotherton the former had considerable effect. She could not tell Miss Crawford that \"those woods belonged to Sotherton,\" she could not carelessly observe that \"she believed that it was now all Mr. Rushworth's property on each side of the road,\" without elation of heart; and it was a pleasure to increase with their approach to the mansion.\n\"Now we shall have no more rough road, Miss Crawford; the rest of the way is as it ought to be. Mr. Rushworth has improved it since he succeeded to the estate. Here begins the village. Those cottages are really a disgrace. The church spire is reckoned remarkably handsome. There is the parsonage: a tidy-looking house, and I understand the clergyman and his wife are very decent people. To the right is the steward's house; he is a very respectable man. Now we are coming to the lodge-gates; but we have nearly a mile through the park still. There is some fine timber, but the situation of the house is dreadful. We go down hill to it for half a mile; it would not be an ill-looking place if it had a better approach.\"\nMiss Crawford was not slow to admire; she guessed Miss Bertram's feelings, and made it a point of honour to promote her enjoyment to the utmost. Mrs. Norris was all delight; and even Fanny had something to say in admiration. Her eye was eagerly taking in everything; and she asked, \"Where is the avenue? It must be at the back of the house.\"\n\"Yes, it is behind the house, and ascends for half a mile. It is oak entirely.\"\nMiss Bertram could now speak with decided information of what she had known nothing about when Mr. Rushworth had asked her opinion; and her spirits were in as happy a flutter as pride could furnish, when they drove up to the spacious stone steps before the principal entrance.",
        "paragraph_chars": [
            [
                0,
                529
            ],
            [
                529,
                1078
            ],
            [
                1078,
                1402
            ],
            [
                1402,
                1547
            ],
            [
                1547,
                1753
            ],
            [
                1753,
                1789
            ],
            [
                1789,
                2120
            ],
            [
                2120,
                2465
            ],
            [
                2465,
                2583
            ],
            [
                2583,
                2689
            ],
            [
                2689,
                2763
            ],
            [
                2763,
                3070
            ],
            [
                3070,
                3328
            ],
            [
                3328,
                3420
            ],
            [
                3420,
                3591
            ],
            [
                3591,
                3696
            ],
            [
                3696,
                3856
            ],
            [
                3856,
                3968
            ],
            [
                3968,
                4015
            ],
            [
                4015,
                4054
            ],
            [
                4054,
                4310
            ],
            [
                4310,
                4363
            ],
            [
                4363,
                5056
            ],
            [
                5056,
                5144
            ],
            [
                5144,
                5270
            ],
            [
                5270,
                5357
            ],
            [
                5357,
                5674
            ],
            [
                5674,
                6043
            ],
            [
                6043,
                6577
            ],
            [
                6577,
                6742
            ],
            [
                6742,
                7239
            ],
            [
                7239,
                7722
            ],
            [
                7722,
                8357
            ],
            [
                8357,
                8890
            ],
            [
                8890,
                9609
            ],
            [
                9609,
                9951
            ],
            [
                9951,
                10031
            ],
            [
                10031,
                10307
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                249
            ],
            [
                249,
                529
            ],
            [
                529,
                585
            ],
            [
                585,
                708
            ],
            [
                708,
                754
            ],
            [
                754,
                914
            ],
            [
                914,
                1078
            ],
            [
                1078,
                1148
            ],
            [
                1148,
                1189
            ],
            [
                1189,
                1248
            ],
            [
                1248,
                1367
            ],
            [
                1367,
                1402
            ],
            [
                1402,
                1428
            ],
            [
                1428,
                1547
            ],
            [
                1547,
                1671
            ],
            [
                1671,
                1709
            ],
            [
                1709,
                1753
            ],
            [
                1753,
                1761
            ],
            [
                1761,
                1789
            ],
            [
                1789,
                1874
            ],
            [
                1874,
                2120
            ],
            [
                2120,
                2319
            ],
            [
                2319,
                2465
            ],
            [
                2465,
                2520
            ],
            [
                2520,
                2533
            ],
            [
                2533,
                2583
            ],
            [
                2583,
                2591
            ],
            [
                2591,
                2689
            ],
            [
                2689,
                2763
            ],
            [
                2763,
                3070
            ],
            [
                3070,
                3238
            ],
            [
                3238,
                3328
            ],
            [
                3328,
                3420
            ],
            [
                3420,
                3434
            ],
            [
                3434,
                3529
            ],
            [
                3529,
                3591
            ],
            [
                3591,
                3696
            ],
            [
                3696,
                3705
            ],
            [
                3705,
                3783
            ],
            [
                3783,
                3808
            ],
            [
                3808,
                3834
            ],
            [
                3834,
                3856
            ],
            [
                3856,
                3968
            ],
            [
                3968,
                4015
            ],
            [
                4015,
                4054
            ],
            [
                4054,
                4091
            ],
            [
                4091,
                4149
            ],
            [
                4149,
                4192
            ],
            [
                4192,
                4310
            ],
            [
                4310,
                4319
            ],
            [
                4319,
                4363
            ],
            [
                4363,
                4609
            ],
            [
                4609,
                4701
            ],
            [
                4701,
                4822
            ],
            [
                4822,
                5056
            ],
            [
                5056,
                5144
            ],
            [
                5144,
                5270
            ],
            [
                5270,
                5357
            ],
            [
                5357,
                5447
            ],
            [
                5447,
                5674
            ],
            [
                5674,
                5758
            ],
            [
                5758,
                5827
            ],
            [
                5827,
                6043
            ],
            [
                6043,
                6144
            ],
            [
                6144,
                6211
            ],
            [
                6211,
                6265
            ],
            [
                6265,
                6300
            ],
            [
                6300,
                6577
            ],
            [
                6577,
                6590
            ],
            [
                6590,
                6605
            ],
            [
                6605,
                6742
            ],
            [
                6742,
                6891
            ],
            [
                6891,
                6969
            ],
            [
                6969,
                7239
            ],
            [
                7239,
                7392
            ],
            [
                7392,
                7556
            ],
            [
                7556,
                7722
            ],
            [
                7722,
                7993
            ],
            [
                7993,
                8292
            ],
            [
                8292,
                8357
            ],
            [
                8357,
                8475
            ],
            [
                8475,
                8595
            ],
            [
                8595,
                8890
            ],
            [
                8890,
                8986
            ],
            [
                8986,
                9050
            ],
            [
                9050,
                9075
            ],
            [
                9075,
                9113
            ],
            [
                9113,
                9163
            ],
            [
                9163,
                9277
            ],
            [
                9277,
                9344
            ],
            [
                9344,
                9432
            ],
            [
                9432,
                9503
            ],
            [
                9503,
                9609
            ],
            [
                9609,
                9754
            ],
            [
                9754,
                9834
            ],
            [
                9834,
                9913
            ],
            [
                9913,
                9951
            ],
            [
                9951,
                10010
            ],
            [
                10010,
                10031
            ],
            [
                10031,
                10307
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                65,
                90
            ],
            [
                96,
                105
            ],
            [
                106,
                131
            ],
            [
                131,
                206
            ],
            [
                217,
                219
            ],
            [
                226,
                236
            ],
            [
                247,
                249
            ],
            [
                249,
                280
            ],
            [
                281,
                293
            ],
            [
                293,
                315
            ],
            [
                316,
                322
            ],
            [
                322,
                355
            ],
            [
                360,
                361
            ],
            [
                362,
                365
            ],
            [
                366,
                408
            ],
            [
                417,
                527
            ],
            [
                527,
                529
            ],
            [
                529,
                585
            ],
            [
                585,
                591
            ],
            [
                592,
                650
            ],
            [
                667,
                708
            ],
            [
                708,
                754
            ],
            [
                754,
                862
            ],
            [
                863,
                866
            ],
            [
                873,
                897
            ],
            [
                903,
                906
            ],
            [
                912,
                914
            ],
            [
                914,
                946
            ],
            [
                946,
                1049
            ],
            [
                1050,
                1078
            ],
            [
                1078,
                1123
            ],
            [
                1124,
                1148
            ],
            [
                1148,
                1189
            ],
            [
                1189,
                1197
            ],
            [
                1198,
                1204
            ],
            [
                1205,
                1248
            ],
            [
                1248,
                1288
            ],
            [
                1288,
                1307
            ],
            [
                1307,
                1367
            ],
            [
                1367,
                1402
            ],
            [
                1402,
                1416
            ],
            [
                1421,
                1428
            ],
            [
                1428,
                1429
            ],
            [
                1429,
                1478
            ],
            [
                1479,
                1491
            ],
            [
                1491,
                1496
            ],
            [
                1497,
                1544
            ],
            [
                1544,
                1547
            ],
            [
                1547,
                1548
            ],
            [
                1548,
                1609
            ],
            [
                1610,
                1615
            ],
            [
                1616,
                1671
            ],
            [
                1671,
                1687
            ],
            [
                1688,
                1709
            ],
            [
                1709,
                1753
            ],
            [
                1753,
                1761
            ],
            [
                1761,
                1789
            ],
            [
                1789,
                1818
            ],
            [
                1819,
                1821
            ],
            [
                1829,
                1842
            ],
            [
                1842,
                1852
            ],
            [
                1853,
                1856
            ],
            [
                1863,
                1865
            ],
            [
                1872,
                1874
            ],
            [
                1874,
                2120
            ],
            [
                2120,
                2187
            ],
            [
                2195,
                2252
            ],
            [
                2252,
                2319
            ],
            [
                2319,
                2344
            ],
            [
                2344,
                2441
            ],
            [
                2442,
                2445
            ],
            [
                2446,
                2465
            ],
            [
                2465,
                2473
            ],
            [
                2474,
                2480
            ],
            [
                2481,
                2485
            ],
            [
                2486,
                2505
            ],
            [
                2506,
                2517
            ],
            [
                2520,
                2531
            ],
            [
                2534,
                2580
            ],
            [
                2583,
                2591
            ],
            [
                2591,
                2616
            ],
            [
                2617,
                2686
            ],
            [
                2689,
                2760
            ],
            [
                2763,
                2806
            ],
            [
                2814,
                2817
            ],
            [
                2818,
                2832
            ],
            [
                2833,
                2836
            ],
            [
                2837,
                2879
            ],
            [
                2880,
                2888
            ],
            [
                2889,
                2905
            ],
            [
                2906,
                2925
            ],
            [
                2929,
                2938
            ],
            [
                2939,
                2967
            ],
            [
                2968,
                3070
            ],
            [
                3070,
                3238
            ],
            [
                3238,
                3328
            ],
            [
                3328,
                3334
            ],
            [
                3343,
                3361
            ],
            [
                3361,
                3372
            ],
            [
                3372,
                3420
            ],
            [
                3420,
                3434
            ],
            [
                3434,
                3448
            ],
            [
                3448,
                3496
            ],
            [
                3502,
                3529
            ],
            [
                3529,
                3591
            ],
            [
                3591,
                3693
            ],
            [
                3693,
                3696
            ],
            [
                3696,
                3705
            ],
            [
                3705,
                3783
            ],
            [
                3783,
                3808
            ],
            [
                3808,
                3834
            ],
            [
                3834,
                3856
            ],
            [
                3857,
                3885
            ],
            [
                3927,
                3968
            ],
            [
                3968,
                3990
            ],
            [
                3998,
                4015
            ],
            [
                4015,
                4051
            ],
            [
                4051,
                4054
            ],
            [
                4054,
                4091
            ],
            [
                4091,
                4147
            ],
            [
                4147,
                4149
            ],
            [
                4149,
                4192
            ],
            [
                4192,
                4310
            ],
            [
                4310,
                4319
            ],
            [
                4319,
                4363
            ],
            [
                4363,
                4394
            ],
            [
                4399,
                4408
            ],
            [
                4408,
                4524
            ],
            [
                4525,
                4609
            ],
            [
                4609,
                4617
            ],
            [
                4623,
                4627
            ],
            [
                4628,
                4657
            ],
            [
                4657,
                4701
            ],
            [
                4701,
                4725
            ],
            [
                4726,
                4783
            ],
            [
                4784,
                4787
            ],
            [
                4788,
                4822
            ],
            [
                4822,
                4854
            ],
            [
                4855,
                4859
            ],
            [
                4860,
                4866
            ],
            [
                4877,
                4887
            ],
            [
                4891,
                4894
            ],
            [
                4895,
                4904
            ],
            [
                4904,
                4913
            ],
            [
                4914,
                4922
            ],
            [
                4926,
                4940
            ],
            [
                4941,
                4944
            ],
            [
                4944,
                4991
            ],
            [
                4992,
                5030
            ],
            [
                5031,
                5053
            ],
            [
                5053,
                5056
            ],
            [
                5056,
                5144
            ],
            [
                5144,
                5210
            ],
            [
                5221,
                5270
            ],
            [
                5270,
                5355
            ],
            [
                5355,
                5357
            ],
            [
                5357,
                5447
            ],
            [
                5447,
                5473
            ],
            [
                5474,
                5483
            ],
            [
                5484,
                5583
            ],
            [
                5584,
                5674
            ],
            [
                5674,
                5697
            ],
            [
                5698,
                5756
            ],
            [
                5756,
                5758
            ],
            [
                5758,
                5825
            ],
            [
                5825,
                5827
            ],
            [
                5827,
                5861
            ],
            [
                5861,
                5866
            ],
            [
                5867,
                5882
            ],
            [
                5883,
                5932
            ],
            [
                5933,
                5943
            ],
            [
                5950,
                5999
            ],
            [
                6005,
                6033
            ],
            [
                6041,
                6043
            ],
            [
                6043,
                6142
            ],
            [
                6142,
                6143
            ],
            [
                6149,
                6152
            ],
            [
                6153,
                6158
            ],
            [
                6159,
                6165
            ],
            [
                6167,
                6168
            ],
            [
                6169,
                6188
            ],
            [
                6189,
                6211
            ],
            [
                6211,
                6252
            ],
            [
                6253,
                6256
            ],
            [
                6263,
                6265
            ],
            [
                6265,
                6300
            ],
            [
                6300,
                6351
            ],
            [
                6352,
                6412
            ],
            [
                6413,
                6414
            ],
            [
                6414,
                6417
            ],
            [
                6418,
                6424
            ],
            [
                6425,
                6517
            ],
            [
                6518,
                6577
            ],
            [
                6577,
                6590
            ],
            [
                6590,
                6605
            ],
            [
                6605,
                6740
            ],
            [
                6740,
                6742
            ],
            [
                6742,
                6837
            ],
            [
                6838,
                6878
            ],
            [
                6879,
                6882
            ],
            [
                6883,
                6891
            ],
            [
                6891,
                6944
            ],
            [
                6944,
                6969
            ],
            [
                6969,
                6985
            ],
            [
                6986,
                7075
            ],
            [
                7076,
                7122
            ],
            [
                7123,
                7126
            ],
            [
                7127,
                7221
            ],
            [
                7237,
                7238
            ],
            [
                7239,
                7392
            ],
            [
                7392,
                7427
            ],
            [
                7428,
                7451
            ],
            [
                7452,
                7556
            ],
            [
                7556,
                7641
            ],
            [
                7641,
                7720
            ],
            [
                7720,
                7722
            ],
            [
                7722,
                7776
            ],
            [
                7777,
                7900
            ],
            [
                7901,
                7944
            ],
            [
                7945,
                7969
            ],
            [
                7970,
                7974
            ],
            [
                7975,
                7993
            ],
            [
                7993,
                8011
            ],
            [
                8019,
                8024
            ],
            [
                8025,
                8030
            ],
            [
                8031,
                8196
            ],
            [
                8196,
                8199
            ],
            [
                8221,
                8222
            ],
            [
                8247,
                8250
            ],
            [
                8256,
                8258
            ],
            [
                8258,
                8259
            ],
            [
                8292,
                8355
            ],
            [
                8355,
                8357
            ],
            [
                8357,
                8371
            ],
            [
                8382,
                8391
            ],
            [
                8391,
                8475
            ],
            [
                8475,
                8595
            ],
            [
                8595,
                8880
            ],
            [
                8881,
                8888
            ],
            [
                8888,
                8890
            ],
            [
                8890,
                8943
            ],
            [
                8944,
                8966
            ],
            [
                8967,
                8986
            ],
            [
                8986,
                9003
            ],
            [
                9013,
                9050
            ],
            [
                9050,
                9075
            ],
            [
                9075,
                9113
            ],
            [
                9113,
                9163
            ],
            [
                9163,
                9277
            ],
            [
                9277,
                9344
            ],
            [
                9344,
                9432
            ],
            [
                9432,
                9503
            ],
            [
                9503,
                9540
            ],
            [
                9542,
                9609
            ],
            [
                9609,
                9650
            ],
            [
                9651,
                9754
            ],
            [
                9754,
                9781
            ],
            [
                9781,
                9832
            ],
            [
                9832,
                9834
            ],
            [
                9834,
                9874
            ],
            [
                9874,
                9879
            ],
            [
                9880,
                9883
            ],
            [
                9889,
                9892
            ],
            [
                9892,
                9913
            ],
            [
                9913,
                9915
            ],
            [
                9916,
                9938
            ],
            [
                9939,
                9948
            ],
            [
                9951,
                9962
            ],
            [
                9963,
                9979
            ],
            [
                9979,
                10008
            ],
            [
                10008,
                10010
            ],
            [
                10010,
                10031
            ],
            [
                10031,
                10208
            ],
            [
                10209,
                10307
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                249
            ],
            [
                249,
                529
            ],
            [
                529,
                585
            ],
            [
                585,
                708
            ],
            [
                708,
                754
            ],
            [
                754,
                914
            ],
            [
                914,
                1078
            ],
            [
                1078,
                1148
            ],
            [
                1148,
                1189
            ],
            [
                1189,
                1248
            ],
            [
                1248,
                1248
            ],
            [
                1248,
                1367
            ],
            [
                1367,
                1402
            ],
            [
                1402,
                1428
            ],
            [
                1428,
                1547
            ],
            [
                1547,
                1671
            ],
            [
                1671,
                1709
            ],
            [
                1709,
                1753
            ],
            [
                1753,
                1761
            ],
            [
                1761,
                1789
            ],
            [
                1789,
                1874
            ],
            [
                1874,
                2120
            ],
            [
                2120,
                2319
            ],
            [
                2319,
                2465
            ],
            [
                2465,
                2533
            ],
            [
                2533,
                2583
            ],
            [
                2583,
                2583
            ],
            [
                2583,
                2591
            ],
            [
                2591,
                2689
            ],
            [
                2689,
                2689
            ],
            [
                2689,
                2763
            ],
            [
                2763,
                2763
            ],
            [
                2763,
                3070
            ],
            [
                3070,
                3238
            ],
            [
                3238,
                3328
            ],
            [
                3328,
                3420
            ],
            [
                3420,
                3434
            ],
            [
                3434,
                3529
            ],
            [
                3529,
                3591
            ],
            [
                3591,
                3696
            ],
            [
                3696,
                3705
            ],
            [
                3705,
                3783
            ],
            [
                3783,
                3808
            ],
            [
                3808,
                3834
            ],
            [
                3834,
                3856
            ],
            [
                3856,
                3856
            ],
            [
                3856,
                3968
            ],
            [
                3968,
                4015
            ],
            [
                4015,
                4054
            ],
            [
                4054,
                4091
            ],
            [
                4091,
                4149
            ],
            [
                4149,
                4192
            ],
            [
                4192,
                4192
            ],
            [
                4192,
                4310
            ],
            [
                4310,
                4319
            ],
            [
                4319,
                4363
            ],
            [
                4363,
                4609
            ],
            [
                4609,
                4609
            ],
            [
                4609,
                4701
            ],
            [
                4701,
                4822
            ],
            [
                4822,
                4822
            ],
            [
                4822,
                5056
            ],
            [
                5056,
                5144
            ],
            [
                5144,
                5270
            ],
            [
                5270,
                5357
            ],
            [
                5357,
                5447
            ],
            [
                5447,
                5674
            ],
            [
                5674,
                5758
            ],
            [
                5758,
                5827
            ],
            [
                5827,
                6043
            ],
            [
                6043,
                6211
            ],
            [
                6211,
                6265
            ],
            [
                6265,
                6300
            ],
            [
                6300,
                6577
            ],
            [
                6577,
                6590
            ],
            [
                6590,
                6605
            ],
            [
                6605,
                6742
            ],
            [
                6742,
                6891
            ],
            [
                6891,
                6969
            ],
            [
                6969,
                7239
            ],
            [
                7239,
                7392
            ],
            [
                7392,
                7556
            ],
            [
                7556,
                7722
            ],
            [
                7722,
                7993
            ],
            [
                7993,
                8292
            ],
            [
                8292,
                8357
            ],
            [
                8357,
                8475
            ],
            [
                8475,
                8595
            ],
            [
                8595,
                8595
            ],
            [
                8595,
                8890
            ],
            [
                8890,
                8986
            ],
            [
                8986,
                9050
            ],
            [
                9050,
                9075
            ],
            [
                9075,
                9113
            ],
            [
                9113,
                9163
            ],
            [
                9163,
                9163
            ],
            [
                9163,
                9163
            ],
            [
                9163,
                9277
            ],
            [
                9277,
                9277
            ],
            [
                9277,
                9344
            ],
            [
                9344,
                9432
            ],
            [
                9432,
                9503
            ],
            [
                9503,
                9609
            ],
            [
                9609,
                9754
            ],
            [
                9754,
                9834
            ],
            [
                9834,
                9913
            ],
            [
                9913,
                9951
            ],
            [
                9951,
                9951
            ],
            [
                9951,
                10010
            ],
            [
                10010,
                10010
            ],
            [
                10010,
                10031
            ],
            [
                10031,
                10307
            ]
        ]
    }
}