{
    "original": {
        "text": "Mr. Rushworth was at the door to receive his fair lady; and the whole party were welcomed by him with due attention. In the drawing-room they were met with equal cordiality by the mother, and Miss Bertram had all the distinction with each that she could wish. After the business of arriving was over, it was first necessary to eat, and the doors were thrown open to admit them through one or two intermediate rooms into the appointed dining-parlour, where a collation was prepared with abundance and elegance. Much was said, and much was ate, and all went well. The particular object of the day was then considered. How would Mr. Crawford like, in what manner would he chuse, to take a survey of the grounds? Mr. Rushworth mentioned his curricle. Mr. Crawford suggested the greater desirableness of some carriage which might convey more than two. \"To be depriving themselves of the advantage of other eyes and other judgments, might be an evil even beyond the loss of present pleasure.\"\nMrs. Rushworth proposed that the chaise should be taken also; but this was scarcely received as an amendment: the young ladies neither smiled nor spoke. Her next proposition, of shewing the house to such of them as had not been there before, was more acceptable, for Miss Bertram was pleased to have its size displayed, and all were glad to be doing something.\nThe whole party rose accordingly, and under Mrs. Rushworth's guidance were shewn through a number of rooms, all lofty, and many large, and amply furnished in the taste of fifty years back, with shining floors, solid mahogany, rich damask, marble, gilding, and carving, each handsome in its way. Of pictures there were abundance, and some few good, but the larger part were family portraits, no longer anything to anybody but Mrs. Rushworth, who had been at great pains to learn all that the housekeeper could teach, and was now almost equally well qualified to shew the house. On the present occasion she addressed herself chiefly to Miss Crawford and Fanny, but there was no comparison in the willingness of their attention; for Miss Crawford, who had seen scores of great houses, and cared for none of them, had only the appearance of civilly listening, while Fanny, to whom everything was almost as interesting as it was new, attended with unaffected earnestness to all that Mrs. Rushworth could relate of the family in former times, its rise and grandeur, regal visits and loyal efforts, delighted to connect anything with history already known, or warm her imagination with scenes of the past.\nThe situation of the house excluded the possibility of much prospect from any of the rooms; and while Fanny and some of the others were attending Mrs. Rushworth, Henry Crawford was looking grave and shaking his head at the windows. Every room on the west front looked across a lawn to the beginning of the avenue immediately beyond tall iron palisades and gates.\nHaving visited many more rooms than could be supposed to be of any other use than to contribute to the window-tax, and find employment for housemaids, \"Now,\" said Mrs. Rushworth, \"we are coming to the chapel, which properly we ought to enter from above, and look down upon; but as we are quite among friends, I will take you in this way, if you will excuse me.\"\nThey entered. Fanny's imagination had prepared her for something grander than a mere spacious, oblong room, fitted up for the purpose of devotion: with nothing more striking or more solemn than the profusion of mahogany, and the crimson velvet cushions appearing over the ledge of the family gallery above. \"I am disappointed,\" said she, in a low voice, to Edmund. \"This is not my idea of a chapel. There is nothing awful here, nothing melancholy, nothing grand. Here are no aisles, no arches, no inscriptions, no banners. No banners, cousin, to be 'blown by the night wind of heaven.' No signs that a 'Scottish monarch sleeps below.'\"\n\"You forget, Fanny, how lately all this has been built, and for how confined a purpose, compared with the old chapels of castles and monasteries. It was only for the private use of the family. They have been buried, I suppose, in the parish church. _There_ you must look for the banners and the achievements.\"\n\"It was foolish of me not to think of all that; but I am disappointed.\"\nMrs. Rushworth began her relation. \"This chapel was fitted up as you see it, in James the Second's time. Before that period, as I understand, the pews were only wainscot; and there is some reason to think that the linings and cushions of the pulpit and family seat were only purple cloth; but this is not quite certain. It is a handsome chapel, and was formerly in constant use both morning and evening. Prayers were always read in it by the domestic chaplain, within the memory of many; but the late Mr. Rushworth left it off.\"\n\"Every generation has its improvements,\" said Miss Crawford, with a smile, to Edmund.\nMrs. Rushworth was gone to repeat her lesson to Mr. Crawford; and Edmund, Fanny, and Miss Crawford remained in a cluster together.\n\"It is a pity,\" cried Fanny, \"that the custom should have been discontinued. It was a valuable part of former times. There is something in a chapel and chaplain so much in character with a great house, with one's ideas of what such a household should be! A whole family assembling regularly for the purpose of prayer is fine!\"\n\"Very fine indeed,\" said Miss Crawford, laughing. \"It must do the heads of the family a great deal of good to force all the poor housemaids and footmen to leave business and pleasure, and say their prayers here twice a day, while they are inventing excuses themselves for staying away.\"\n\"_That_ is hardly Fanny's idea of a family assembling,\" said Edmund. \"If the master and mistress do _not_ attend themselves, there must be more harm than good in the custom.\"\n\"At any rate, it is safer to leave people to their own devices on such subjects. Everybody likes to go their own way-to chuse their own time and manner of devotion. The obligation of attendance, the formality, the restraint, the length of time-altogether it is a formidable thing, and what nobody likes; and if the good people who used to kneel and gape in that gallery could have foreseen that the time would ever come when men and women might lie another ten minutes in bed, when they woke with a headache, without danger of reprobation, because chapel was missed, they would have jumped with joy and envy. Cannot you imagine with what unwilling feelings the former belles of the house of Rushworth did many a time repair to this chapel? The young Mrs. Eleanors and Mrs. Bridgets-starched up into seeming piety, but with heads full of something very different-especially if the poor chaplain were not worth looking at-and, in those days, I fancy parsons were very inferior even to what they are now.\"\nFor a few moments she was unanswered. Fanny coloured and looked at Edmund, but felt too angry for speech; and he needed a little recollection before he could say, \"Your lively mind can hardly be serious even on serious subjects. You have given us an amusing sketch, and human nature cannot say it was not so. We must all feel _at_ _times_ the difficulty of fixing our thoughts as we could wish; but if you are supposing it a frequent thing, that is to say, a weakness grown into a habit from neglect, what could be expected from the _private_ devotions of such persons? Do you think the minds which are suffered, which are indulged in wanderings in a chapel, would be more collected in a closet?\"\n\"Yes, very likely. They would have two chances at least in their favour. There would be less to distract the attention from without, and it would not be tried so long.\"\n\"The mind which does not struggle against itself under _one_ circumstance, would find objects to distract it in the _other_, I believe; and the influence of the place and of example may often rouse better feelings than are begun with. The greater length of the service, however, I admit to be sometimes too hard a stretch upon the mind. One wishes it were not so; but I have not yet left Oxford long enough to forget what chapel prayers are.\"\nWhile this was passing, the rest of the party being scattered about the chapel, Julia called Mr. Crawford's attention to her sister, by saying, \"Do look at Mr. Rushworth and Maria, standing side by side, exactly as if the ceremony were going to be performed. Have not they completely the air of it?\"\nMr. Crawford smiled his acquiescence, and stepping forward to Maria, said, in a voice which she only could hear, \"I do not like to see Miss Bertram so near the altar.\"\nStarting, the lady instinctively moved a step or two, but recovering herself in a moment, affected to laugh, and asked him, in a tone not much louder, \"If he would give her away?\"\n\"I am afraid I should do it very awkwardly,\" was his reply, with a look of meaning.\nJulia, joining them at the moment, carried on the joke.\n\"Upon my word, it is really a pity that it should not take place directly, if we had but a proper licence, for here we are altogether, and nothing in the world could be more snug and pleasant.\" And she talked and laughed about it with so little caution as to catch the comprehension of Mr. Rushworth and his mother, and expose her sister to the whispered gallantries of her lover, while Mrs. Rushworth spoke with proper smiles and dignity of its being a most happy event to her whenever it took place.\n\"If Edmund were but in orders!\" cried Julia, and running to where he stood with Miss Crawford and Fanny: \"My dear Edmund, if you were but in orders now, you might perform the ceremony directly. How unlucky that you are not ordained; Mr. Rushworth and Maria are quite ready.\"\nMiss Crawford's countenance, as Julia spoke, might have amused a disinterested observer. She looked almost aghast under the new idea she was receiving. Fanny pitied her. \"How distressed she will be at what she said just now,\" passed across her mind.\n\"Ordained!\" said Miss Crawford; \"what, are you to be a clergyman?\"\n\"Yes; I shall take orders soon after my father's return-probably at Christmas.\"\nMiss Crawford, rallying her spirits, and recovering her complexion, replied only, \"If I had known this before, I would have spoken of the cloth with more respect,\" and turned the subject.\nThe chapel was soon afterwards left to the silence and stillness which reigned in it, with few interruptions, throughout the year. Miss Bertram, displeased with her sister, led the way, and all seemed to feel that they had been there long enough.\nThe lower part of the house had been now entirely shewn, and Mrs. Rushworth, never weary in the cause, would have proceeded towards the principal staircase, and taken them through all the rooms above, if her son had not interposed with a doubt of there being time enough. \"For if,\" said he, with the sort of self-evident proposition which many a clearer head does not always avoid, \"we are _too_ long going over the house, we shall not have time for what is to be done out of doors. It is past two, and we are to dine at five.\"\nMrs. Rushworth submitted; and the question of surveying the grounds, with the who and the how, was likely to be more fully agitated, and Mrs. Norris was beginning to arrange by what junction of carriages and horses most could be done, when the young people, meeting with an outward door, temptingly open on a flight of steps which led immediately to turf and shrubs, and all the sweets of pleasure-grounds, as by one impulse, one wish for air and liberty, all walked out.\n\"Suppose we turn down here for the present,\" said Mrs. Rushworth, civilly taking the hint and following them. \"Here are the greatest number of our plants, and here are the curious pheasants.\"\n\"Query,\" said Mr. Crawford, looking round him, \"whether we may not find something to employ us here before we go farther? I see walls of great promise. Mr. Rushworth, shall we summon a council on this lawn?\"\n\"James,\" said Mrs. Rushworth to her son, \"I believe the wilderness will be new to all the party. The Miss Bertrams have never seen the wilderness yet.\"\nNo objection was made, but for some time there seemed no inclination to move in any plan, or to any distance. All were attracted at first by the plants or the pheasants, and all dispersed about in happy independence. Mr. Crawford was the first to move forward to examine the capabilities of that end of the house. The lawn, bounded on each side by a high wall, contained beyond the first planted area a bowling-green, and beyond the bowling-green a long terrace walk, backed by iron palisades, and commanding a view over them into the tops of the trees of the wilderness immediately adjoining. It was a good spot for fault-finding. Mr. Crawford was soon followed by Miss Bertram and Mr. Rushworth; and when, after a little time, the others began to form into parties, these three were found in busy consultation on the terrace by Edmund, Miss Crawford, and Fanny, who seemed as naturally to unite, and who, after a short participation of their regrets and difficulties, left them and walked on. The remaining three, Mrs. Rushworth, Mrs. Norris, and Julia, were still far behind; for Julia, whose happy star no longer prevailed, was obliged to keep by the side of Mrs. Rushworth, and restrain her impatient feet to that lady's slow pace, while her aunt, having fallen in with the housekeeper, who was come out to feed the pheasants, was lingering behind in gossip with her. Poor Julia, the only one out of the nine not tolerably satisfied with their lot, was now in a state of complete penance, and as different from the Julia of the barouche-box as could well be imagined. The politeness which she had been brought up to practise as a duty made it impossible for her to escape; while the want of that higher species of self-command, that just consideration of others, that knowledge of her own heart, that principle of right, which had not formed any essential part of her education, made her miserable under it.\n\"This is insufferably hot,\" said Miss Crawford, when they had taken one turn on the terrace, and were drawing a second time to the door in the middle which opened to the wilderness. \"Shall any of us object to being comfortable? Here is a nice little wood, if one can but get into it. What happiness if the door should not be locked! but of course it is; for in these great places the gardeners are the only people who can go where they like.\"\nThe door, however, proved not to be locked, and they were all agreed in turning joyfully through it, and leaving the unmitigated glare of day behind. A considerable flight of steps landed them in the wilderness, which was a planted wood of about two acres, and though chiefly of larch and laurel, and beech cut down, and though laid out with too much regularity, was darkness and shade, and natural beauty, compared with the bowling-green and the terrace. They all felt the refreshment of it, and for some time could only walk and admire. At length, after a short pause, Miss Crawford began with, \"So you are to be a clergyman, Mr. Bertram. This is rather a surprise to me.\"\n\"Why should it surprise you? You must suppose me designed for some profession, and might perceive that I am neither a lawyer, nor a soldier, nor a sailor.\"\n\"Very true; but, in short, it had not occurred to me. And you know there is generally an uncle or a grandfather to leave a fortune to the second son.\"\n\"A very praiseworthy practice,\" said Edmund, \"but not quite universal. I am one of the exceptions, and _being_ one, must do something for myself.\"\n\"But why are you to be a clergyman? I thought _that_ was always the lot of the youngest, where there were many to chuse before him.\"\n\"Do you think the church itself never chosen, then?\"\n\"_Never_ is a black word. But yes, in the _never_ of conversation, which means _not_ _very_ _often_, I do think it. For what is to be done in the church? Men love to distinguish themselves, and in either of the other lines distinction may be gained, but not in the church. A clergyman is nothing.\"\n\"The _nothing_ of conversation has its gradations, I hope, as well as the _never_. A clergyman cannot be high in state or fashion. He must not head mobs, or set the ton in dress. But I cannot call that situation nothing which has the charge of all that is of the first importance to mankind, individually or collectively considered, temporally and eternally, which has the guardianship of religion and morals, and consequently of the manners which result from their influence. No one here can call the _office_ nothing. If the man who holds it is so, it is by the neglect of his duty, by foregoing its just importance, and stepping out of his place to appear what he ought not to appear.\"\n\"_You_ assign greater consequence to the clergyman than one has been used to hear given, or than I can quite comprehend. One does not see much of this influence and importance in society, and how can it be acquired where they are so seldom seen themselves? How can two sermons a week, even supposing them worth hearing, supposing the preacher to have the sense to prefer Blair's to his own, do all that you speak of? govern the conduct and fashion the manners of a large congregation for the rest of the week? One scarcely sees a clergyman out of his pulpit.\"\n\"_You_ are speaking of London, _I_ am speaking of the nation at large.\"\n\"The metropolis, I imagine, is a pretty fair sample of the rest.\"\n\"Not, I should hope, of the proportion of virtue to vice throughout the kingdom. We do not look in great cities for our best morality. It is not there that respectable people of any denomination can do most good; and it certainly is not there that the influence of the clergy can be most felt. A fine preacher is followed and admired; but it is not in fine preaching only that a good clergyman will be useful in his parish and his neighbourhood, where the parish and neighbourhood are of a size capable of knowing his private character, and observing his general conduct, which in London can rarely be the case. The clergy are lost there in the crowds of their parishioners. They are known to the largest part only as preachers. And with regard to their influencing public manners, Miss Crawford must not misunderstand me, or suppose I mean to call them the arbiters of good-breeding, the regulators of refinement and courtesy, the masters of the ceremonies of life. The _manners_ I speak of might rather be called _conduct_, perhaps, the result of good principles; the effect, in short, of those doctrines which it is their duty to teach and recommend; and it will, I believe, be everywhere found, that as the clergy are, or are not what they ought to be, so are the rest of the nation.\"\n\"Certainly,\" said Fanny, with gentle earnestness.\n\"There,\" cried Miss Crawford, \"you have quite convinced Miss Price already.\"\n\"I wish I could convince Miss Crawford too.\"\n\"I do not think you ever will,\" said she, with an arch smile; \"I am just as much surprised now as I was at first that you should intend to take orders. You really are fit for something better. Come, do change your mind. It is not too late. Go into the law.\"\n\"Go into the law! With as much ease as I was told to go into this wilderness.\"\n\"Now you are going to say something about law being the worst wilderness of the two, but I forestall you; remember, I have forestalled you.\"\n\"You need not hurry when the object is only to prevent my saying a _bon_ _mot_, for there is not the least wit in my nature. I am a very matter-of-fact, plain-spoken being, and may blunder on the borders of a repartee for half an hour together without striking it out.\"\nA general silence succeeded. Each was thoughtful. Fanny made the first interruption by saying, \"I wonder that I should be tired with only walking in this sweet wood; but the next time we come to a seat, if it is not disagreeable to you, I should be glad to sit down for a little while.\"\n\"My dear Fanny,\" cried Edmund, immediately drawing her arm within his, \"how thoughtless I have been! I hope you are not very tired. Perhaps,\" turning to Miss Crawford, \"my other companion may do me the honour of taking an arm.\"\n\"Thank you, but I am not at all tired.\" She took it, however, as she spoke, and the gratification of having her do so, of feeling such a connexion for the first time, made him a little forgetful of Fanny. \"You scarcely touch me,\" said he. \"You do not make me of any use. What a difference in the weight of a woman's arm from that of a man! At Oxford I have been a good deal used to have a man lean on me for the length of a street, and you are only a fly in the comparison.\"\n\"I am really not tired, which I almost wonder at; for we must have walked at least a mile in this wood. Do not you think we have?\"\n\"Not half a mile,\" was his sturdy answer; for he was not yet so much in love as to measure distance, or reckon time, with feminine lawlessness.\n\"Oh! you do not consider how much we have wound about. We have taken such a very serpentine course, and the wood itself must be half a mile long in a straight line, for we have never seen the end of it yet since we left the first great path.\"\n\"But if you remember, before we left that first great path, we saw directly to the end of it. We looked down the whole vista, and saw it closed by iron gates, and it could not have been more than a furlong in length.\"\n\"Oh! I know nothing of your furlongs, but I am sure it is a very long wood, and that we have been winding in and out ever since we came into it; and therefore, when I say that we have walked a mile in it, I must speak within compass.\"\n\"We have been exactly a quarter of an hour here,\" said Edmund, taking out his watch. \"Do you think we are walking four miles an hour?\"\n\"Oh! do not attack me with your watch. A watch is always too fast or too slow. I cannot be dictated to by a watch.\"\nA few steps farther brought them out at the bottom of the very walk they had been talking of; and standing back, well shaded and sheltered, and looking over a ha-ha into the park, was a comfortable-sized bench, on which they all sat down.\n\"I am afraid you are very tired, Fanny,\" said Edmund, observing her; \"why would not you speak sooner? This will be a bad day's amusement for you if you are to be knocked up. Every sort of exercise fatigues her so soon, Miss Crawford, except riding.\"\n\"How abominable in you, then, to let me engross her horse as I did all last week! I am ashamed of you and of myself, but it shall never happen again.\"\n\"_Your_ attentiveness and consideration makes me more sensible of my own neglect. Fanny's interest seems in safer hands with you than with me.\"\n\"That she should be tired now, however, gives me no surprise; for there is nothing in the course of one's duties so fatiguing as what we have been doing this morning: seeing a great house, dawdling from one room to another, straining one's eyes and one's attention, hearing what one does not understand, admiring what one does not care for. It is generally allowed to be the greatest bore in the world, and Miss Price has found it so, though she did not know it.\"\n\"I shall soon be rested,\" said Fanny; \"to sit in the shade on a fine day, and look upon verdure, is the most perfect refreshment.\"\nAfter sitting a little while Miss Crawford was up again. \"I must move,\" said she; \"resting fatigues me. I have looked across the ha-ha till I am weary. I must go and look through that iron gate at the same view, without being able to see it so well.\"\nEdmund left the seat likewise. \"Now, Miss Crawford, if you will look up the walk, you will convince yourself that it cannot be half a mile long, or half half a mile.\"\n\"It is an immense distance,\" said she; \"I see _that_ with a glance.\"\nHe still reasoned with her, but in vain. She would not calculate, she would not compare. She would only smile and assert. The greatest degree of rational consistency could not have been more engaging, and they talked with mutual satisfaction. At last it was agreed that they should endeavour to determine the dimensions of the wood by walking a little more about it. They would go to one end of it, in the line they were then in-for there was a straight green walk along the bottom by the side of the ha-ha-and perhaps turn a little way in some other direction, if it seemed likely to assist them, and be back in a few minutes. Fanny said she was rested, and would have moved too, but this was not suffered. Edmund urged her remaining where she was with an earnestness which she could not resist, and she was left on the bench to think with pleasure of her cousin's care, but with great regret that she was not stronger. She watched them till they had turned the corner, and listened till all sound of them had ceased.",
        "paragraph_chars": [
            [
                0,
                987
            ],
            [
                987,
                1348
            ],
            [
                1348,
                2547
            ],
            [
                2547,
                2910
            ],
            [
                2910,
                3272
            ],
            [
                3272,
                3908
            ],
            [
                3908,
                4218
            ],
            [
                4218,
                4290
            ],
            [
                4290,
                4819
            ],
            [
                4819,
                4905
            ],
            [
                4905,
                5036
            ],
            [
                5036,
                5363
            ],
            [
                5363,
                5650
            ],
            [
                5650,
                5825
            ],
            [
                5825,
                6828
            ],
            [
                6828,
                7525
            ],
            [
                7525,
                7694
            ],
            [
                7694,
                8137
            ],
            [
                8137,
                8437
            ],
            [
                8437,
                8605
            ],
            [
                8605,
                8785
            ],
            [
                8785,
                8869
            ],
            [
                8869,
                8925
            ],
            [
                8925,
                9427
            ],
            [
                9427,
                9702
            ],
            [
                9702,
                9952
            ],
            [
                9952,
                10019
            ],
            [
                10019,
                10099
            ],
            [
                10099,
                10287
            ],
            [
                10287,
                10534
            ],
            [
                10534,
                11062
            ],
            [
                11062,
                11534
            ],
            [
                11534,
                11726
            ],
            [
                11726,
                11934
            ],
            [
                11934,
                12086
            ],
            [
                12086,
                13999
            ],
            [
                13999,
                14442
            ],
            [
                14442,
                15117
            ],
            [
                15117,
                15273
            ],
            [
                15273,
                15424
            ],
            [
                15424,
                15571
            ],
            [
                15571,
                15704
            ],
            [
                15704,
                15757
            ],
            [
                15757,
                16055
            ],
            [
                16055,
                16744
            ],
            [
                16744,
                17304
            ],
            [
                17304,
                17376
            ],
            [
                17376,
                17442
            ],
            [
                17442,
                18731
            ],
            [
                18731,
                18781
            ],
            [
                18781,
                18858
            ],
            [
                18858,
                18903
            ],
            [
                18903,
                19161
            ],
            [
                19161,
                19240
            ],
            [
                19240,
                19381
            ],
            [
                19381,
                19651
            ],
            [
                19651,
                19938
            ],
            [
                19938,
                20166
            ],
            [
                20166,
                20641
            ],
            [
                20641,
                20772
            ],
            [
                20772,
                20916
            ],
            [
                20916,
                21159
            ],
            [
                21159,
                21377
            ],
            [
                21377,
                21612
            ],
            [
                21612,
                21747
            ],
            [
                21747,
                21863
            ],
            [
                21863,
                22102
            ],
            [
                22102,
                22352
            ],
            [
                22352,
                22503
            ],
            [
                22503,
                22647
            ],
            [
                22647,
                23111
            ],
            [
                23111,
                23242
            ],
            [
                23242,
                23493
            ],
            [
                23493,
                23660
            ],
            [
                23660,
                23729
            ],
            [
                23729,
                24747
            ]
        ],
        "segment_chars": [
            [
                0,
                117
            ],
            [
                117,
                260
            ],
            [
                260,
                510
            ],
            [
                510,
                562
            ],
            [
                562,
                616
            ],
            [
                616,
                709
            ],
            [
                709,
                747
            ],
            [
                747,
                847
            ],
            [
                847,
                987
            ],
            [
                987,
                1140
            ],
            [
                1140,
                1348
            ],
            [
                1348,
                1643
            ],
            [
                1643,
                1925
            ],
            [
                1925,
                2547
            ],
            [
                2547,
                2779
            ],
            [
                2779,
                2910
            ],
            [
                2910,
                3272
            ],
            [
                3272,
                3286
            ],
            [
                3286,
                3579
            ],
            [
                3579,
                3637
            ],
            [
                3637,
                3671
            ],
            [
                3671,
                3735
            ],
            [
                3735,
                3795
            ],
            [
                3795,
                3858
            ],
            [
                3858,
                3908
            ],
            [
                3908,
                4054
            ],
            [
                4054,
                4101
            ],
            [
                4101,
                4157
            ],
            [
                4157,
                4218
            ],
            [
                4218,
                4290
            ],
            [
                4290,
                4325
            ],
            [
                4325,
                4395
            ],
            [
                4395,
                4610
            ],
            [
                4610,
                4694
            ],
            [
                4694,
                4819
            ],
            [
                4819,
                4905
            ],
            [
                4905,
                5036
            ],
            [
                5036,
                5113
            ],
            [
                5113,
                5153
            ],
            [
                5153,
                5291
            ],
            [
                5291,
                5363
            ],
            [
                5363,
                5413
            ],
            [
                5413,
                5650
            ],
            [
                5650,
                5719
            ],
            [
                5719,
                5825
            ],
            [
                5825,
                5906
            ],
            [
                5906,
                5990
            ],
            [
                5990,
                6434
            ],
            [
                6434,
                6565
            ],
            [
                6565,
                6828
            ],
            [
                6828,
                6866
            ],
            [
                6866,
                7057
            ],
            [
                7057,
                7137
            ],
            [
                7137,
                7398
            ],
            [
                7398,
                7525
            ],
            [
                7525,
                7544
            ],
            [
                7544,
                7598
            ],
            [
                7598,
                7694
            ],
            [
                7694,
                7929
            ],
            [
                7929,
                8031
            ],
            [
                8031,
                8137
            ],
            [
                8137,
                8396
            ],
            [
                8396,
                8437
            ],
            [
                8437,
                8605
            ],
            [
                8605,
                8785
            ],
            [
                8785,
                8869
            ],
            [
                8869,
                8925
            ],
            [
                8925,
                9119
            ],
            [
                9119,
                9427
            ],
            [
                9427,
                9459
            ],
            [
                9459,
                9621
            ],
            [
                9621,
                9702
            ],
            [
                9702,
                9791
            ],
            [
                9791,
                9854
            ],
            [
                9854,
                9872
            ],
            [
                9872,
                9952
            ],
            [
                9952,
                9964
            ],
            [
                9964,
                10019
            ],
            [
                10019,
                10099
            ],
            [
                10099,
                10287
            ],
            [
                10287,
                10418
            ],
            [
                10418,
                10534
            ],
            [
                10534,
                10806
            ],
            [
                10806,
                11017
            ],
            [
                11017,
                11062
            ],
            [
                11062,
                11534
            ],
            [
                11534,
                11644
            ],
            [
                11644,
                11726
            ],
            [
                11726,
                11848
            ],
            [
                11848,
                11878
            ],
            [
                11878,
                11934
            ],
            [
                11934,
                12031
            ],
            [
                12031,
                12086
            ],
            [
                12086,
                12196
            ],
            [
                12196,
                12303
            ],
            [
                12303,
                12400
            ],
            [
                12400,
                12680
            ],
            [
                12680,
                12718
            ],
            [
                12718,
                13081
            ],
            [
                13081,
                13459
            ],
            [
                13459,
                13659
            ],
            [
                13659,
                13999
            ],
            [
                13999,
                14181
            ],
            [
                14181,
                14227
            ],
            [
                14227,
                14283
            ],
            [
                14283,
                14332
            ],
            [
                14332,
                14442
            ],
            [
                14442,
                14592
            ],
            [
                14592,
                14898
            ],
            [
                14898,
                14981
            ],
            [
                14981,
                15083
            ],
            [
                15083,
                15117
            ],
            [
                15117,
                15146
            ],
            [
                15146,
                15273
            ],
            [
                15273,
                15327
            ],
            [
                15327,
                15424
            ],
            [
                15424,
                15495
            ],
            [
                15495,
                15571
            ],
            [
                15571,
                15607
            ],
            [
                15607,
                15704
            ],
            [
                15704,
                15757
            ],
            [
                15757,
                15783
            ],
            [
                15783,
                15873
            ],
            [
                15873,
                15911
            ],
            [
                15911,
                16030
            ],
            [
                16030,
                16055
            ],
            [
                16055,
                16138
            ],
            [
                16138,
                16186
            ],
            [
                16186,
                16234
            ],
            [
                16234,
                16532
            ],
            [
                16532,
                16575
            ],
            [
                16575,
                16744
            ],
            [
                16744,
                16865
            ],
            [
                16865,
                17001
            ],
            [
                17001,
                17161
            ],
            [
                17161,
                17254
            ],
            [
                17254,
                17304
            ],
            [
                17304,
                17376
            ],
            [
                17376,
                17442
            ],
            [
                17442,
                17523
            ],
            [
                17523,
                17577
            ],
            [
                17577,
                17736
            ],
            [
                17736,
                18054
            ],
            [
                18054,
                18117
            ],
            [
                18117,
                18171
            ],
            [
                18171,
                18409
            ],
            [
                18409,
                18731
            ],
            [
                18731,
                18781
            ],
            [
                18781,
                18858
            ],
            [
                18858,
                18903
            ],
            [
                18903,
                19055
            ],
            [
                19055,
                19096
            ],
            [
                19096,
                19123
            ],
            [
                19123,
                19143
            ],
            [
                19143,
                19161
            ],
            [
                19161,
                19179
            ],
            [
                19179,
                19240
            ],
            [
                19240,
                19381
            ],
            [
                19381,
                19506
            ],
            [
                19506,
                19651
            ],
            [
                19651,
                19680
            ],
            [
                19680,
                19701
            ],
            [
                19701,
                19938
            ],
            [
                19938,
                20039
            ],
            [
                20039,
                20070
            ],
            [
                20070,
                20166
            ],
            [
                20166,
                20206
            ],
            [
                20206,
                20371
            ],
            [
                20371,
                20405
            ],
            [
                20405,
                20437
            ],
            [
                20437,
                20506
            ],
            [
                20506,
                20641
            ],
            [
                20641,
                20745
            ],
            [
                20745,
                20772
            ],
            [
                20772,
                20916
            ],
            [
                20916,
                20921
            ],
            [
                20921,
                20971
            ],
            [
                20971,
                21159
            ],
            [
                21159,
                21253
            ],
            [
                21253,
                21377
            ],
            [
                21377,
                21382
            ],
            [
                21382,
                21612
            ],
            [
                21612,
                21697
            ],
            [
                21697,
                21747
            ],
            [
                21747,
                21752
            ],
            [
                21752,
                21786
            ],
            [
                21786,
                21826
            ],
            [
                21826,
                21863
            ],
            [
                21863,
                22102
            ],
            [
                22102,
                22204
            ],
            [
                22204,
                22276
            ],
            [
                22276,
                22352
            ],
            [
                22352,
                22434
            ],
            [
                22434,
                22503
            ],
            [
                22503,
                22585
            ],
            [
                22585,
                22647
            ],
            [
                22647,
                22988
            ],
            [
                22988,
                23111
            ],
            [
                23111,
                23242
            ],
            [
                23242,
                23299
            ],
            [
                23299,
                23346
            ],
            [
                23346,
                23394
            ],
            [
                23394,
                23493
            ],
            [
                23493,
                23524
            ],
            [
                23524,
                23660
            ],
            [
                23660,
                23729
            ],
            [
                23729,
                23770
            ],
            [
                23770,
                23818
            ],
            [
                23818,
                23851
            ],
            [
                23851,
                23972
            ],
            [
                23972,
                24096
            ],
            [
                24096,
                24357
            ],
            [
                24357,
                24437
            ],
            [
                24437,
                24650
            ],
            [
                24650,
                24747
            ]
        ],
        "overlap_chars": [
            [
                0,
                32
            ],
            [
                60,
                63
            ],
            [
                70,
                75
            ],
            [
                97,
                117
            ],
            [
                117,
                228
            ],
            [
                239,
                260
            ],
            [
                336,
                376
            ],
            [
                415,
                423
            ],
            [
                434,
                457
            ],
            [
                468,
                510
            ],
            [
                510,
                528
            ],
            [
                538,
                561
            ],
            [
                987,
                990
            ],
            [
                992,
                1001
            ],
            [
                1002,
                1010
            ],
            [
                1016,
                1019
            ],
            [
                1173,
                1182
            ],
            [
                990,
                991
            ],
            [
                1364,
                1422
            ],
            [
                1429,
                1466
            ],
            [
                1476,
                1643
            ],
            [
                1655,
                1665
            ],
            [
                1646,
                1654
            ],
            [
                1675,
                1676
            ],
            [
                1681,
                1685
            ],
            [
                1690,
                1699
            ],
            [
                1716,
                1787
            ],
            [
                1923,
                1924
            ],
            [
                1949,
                2005
            ],
            [
                2078,
                2239
            ],
            [
                2272,
                2285
            ],
            [
                2302,
                2309
            ],
            [
                2314,
                2384
            ],
            [
                2440,
                2474
            ],
            [
                1928,
                1931
            ],
            [
                2475,
                2482
            ],
            [
                2496,
                2500
            ],
            [
                2501,
                2547
            ],
            [
                2724,
                2727
            ],
            [
                2602,
                2642
            ],
            [
                2709,
                2723
            ],
            [
                2736,
                2741
            ],
            [
                2707,
                2708
            ],
            [
                2746,
                2779
            ],
            [
                2779,
                2859
            ],
            [
                2872,
                2898
            ],
            [
                2908,
                2910
            ],
            [
                3061,
                3117
            ],
            [
                3269,
                3272
            ],
            [
                3272,
                3286
            ],
            [
                3286,
                3291
            ],
            [
                3327,
                3351
            ],
            [
                3357,
                3448
            ],
            [
                3454,
                3496
            ],
            [
                3501,
                3524
            ],
            [
                3577,
                3578
            ],
            [
                3579,
                3608
            ],
            [
                3626,
                3637
            ],
            [
                3637,
                3671
            ],
            [
                3671,
                3679
            ],
            [
                3700,
                3735
            ],
            [
                3735,
                3781
            ],
            [
                3793,
                3795
            ],
            [
                3795,
                3805
            ],
            [
                3815,
                3855
            ],
            [
                3908,
                3967
            ],
            [
                4061,
                4101
            ],
            [
                4165,
                4178
            ],
            [
                4135,
                4155
            ],
            [
                4179,
                4194
            ],
            [
                4215,
                4218
            ],
            [
                4290,
                4310
            ],
            [
                4325,
                4395
            ],
            [
                4395,
                4401
            ],
            [
                4430,
                4464
            ],
            [
                4500,
                4503
            ],
            [
                4516,
                4524
            ],
            [
                4560,
                4577
            ],
            [
                4608,
                4610
            ],
            [
                4610,
                4667
            ],
            [
                4692,
                4694
            ],
            [
                4694,
                4706
            ],
            [
                4714,
                4819
            ],
            [
                4819,
                4905
            ],
            [
                5036,
                5113
            ],
            [
                5159,
                5161
            ],
            [
                5197,
                5236
            ],
            [
                5289,
                5291
            ],
            [
                5291,
                5363
            ],
            [
                5363,
                5413
            ],
            [
                5413,
                5448
            ],
            [
                5465,
                5502
            ],
            [
                5515,
                5517
            ],
            [
                5551,
                5650
            ],
            [
                5650,
                5651
            ],
            [
                5652,
                5656
            ],
            [
                5658,
                5718
            ],
            [
                5825,
                5826
            ],
            [
                5839,
                5906
            ],
            [
                5906,
                5924
            ],
            [
                5951,
                5990
            ],
            [
                5990,
                6018
            ],
            [
                6083,
                6104
            ],
            [
                6432,
                6434
            ],
            [
                6434,
                6512
            ],
            [
                6549,
                6565
            ],
            [
                6607,
                6785
            ],
            [
                6791,
                6828
            ],
            [
                6828,
                6866
            ],
            [
                6866,
                7057
            ],
            [
                7057,
                7137
            ],
            [
                7137,
                7153
            ],
            [
                7155,
                7157
            ],
            [
                7160,
                7165
            ],
            [
                7167,
                7226
            ],
            [
                7398,
                7420
            ],
            [
                7441,
                7525
            ],
            [
                7525,
                7530
            ],
            [
                7560,
                7563
            ],
            [
                7596,
                7598
            ],
            [
                7598,
                7643
            ],
            [
                7656,
                7677
            ],
            [
                7684,
                7694
            ],
            [
                7694,
                7703
            ],
            [
                7769,
                7774
            ],
            [
                7775,
                7802
            ],
            [
                7828,
                7860
            ],
            [
                7876,
                7929
            ],
            [
                7929,
                7932
            ],
            [
                7941,
                7962
            ],
            [
                7973,
                8005
            ],
            [
                8016,
                8031
            ],
            [
                8062,
                8137
            ],
            [
                8215,
                8269
            ],
            [
                8273,
                8358
            ],
            [
                8359,
                8394
            ],
            [
                8437,
                8456
            ],
            [
                8473,
                8605
            ],
            [
                8605,
                8673
            ],
            [
                8693,
                8785
            ],
            [
                8785,
                8869
            ],
            [
                8869,
                8888
            ],
            [
                8902,
                8925
            ],
            [
                8925,
                8926
            ],
            [
                8940,
                9009
            ],
            [
                9014,
                9015
            ],
            [
                9023,
                9035
            ],
            [
                9064,
                9098
            ],
            [
                9108,
                9119
            ],
            [
                9119,
                9133
            ],
            [
                9146,
                9224
            ],
            [
                9239,
                9240
            ],
            [
                9270,
                9291
            ],
            [
                9263,
                9265
            ],
            [
                9425,
                9427
            ],
            [
                9427,
                9459
            ],
            [
                9459,
                9470
            ],
            [
                9530,
                9560
            ],
            [
                9565,
                9621
            ],
            [
                9621,
                9658
            ],
            [
                9699,
                9702
            ],
            [
                9702,
                9715
            ],
            [
                9795,
                9821
            ],
            [
                9826,
                9834
            ],
            [
                9852,
                9854
            ],
            [
                9854,
                9872
            ],
            [
                9872,
                9952
            ],
            [
                9952,
                9964
            ],
            [
                9964,
                9985
            ],
            [
                9991,
                10019
            ],
            [
                10019,
                10044
            ],
            [
                10050,
                10099
            ],
            [
                10099,
                10134
            ],
            [
                10165,
                10287
            ],
            [
                10287,
                10337
            ],
            [
                10352,
                10371
            ],
            [
                10397,
                10418
            ],
            [
                10477,
                10534
            ],
            [
                10534,
                10565
            ],
            [
                10571,
                10574
            ],
            [
                10566,
                10570
            ],
            [
                10589,
                10609
            ],
            [
                10637,
                10669
            ],
            [
                10680,
                10689
            ],
            [
                10735,
                10764
            ],
            [
                10804,
                10806
            ],
            [
                10806,
                10807
            ],
            [
                10957,
                10979
            ],
            [
                10992,
                10994
            ],
            [
                10830,
                10833
            ],
            [
                10813,
                10823
            ],
            [
                11015,
                11017
            ],
            [
                11017,
                11062
            ],
            [
                11062,
                11087
            ],
            [
                11195,
                11243
            ],
            [
                11253,
                11348
            ],
            [
                11350,
                11360
            ],
            [
                11366,
                11386
            ],
            [
                11467,
                11487
            ],
            [
                11518,
                11534
            ],
            [
                11534,
                11644
            ],
            [
                11644,
                11692
            ],
            [
                11714,
                11726
            ],
            [
                11726,
                11727
            ],
            [
                11848,
                11876
            ],
            [
                11732,
                11742
            ],
            [
                11744,
                11767
            ],
            [
                11876,
                11878
            ],
            [
                12338,
                12360
            ],
            [
                12382,
                12400
            ],
            [
                12400,
                12417
            ],
            [
                12431,
                12456
            ],
            [
                12487,
                12579
            ],
            [
                12595,
                12620
            ],
            [
                12621,
                12628
            ],
            [
                12646,
                12656
            ],
            [
                12678,
                12680
            ],
            [
                12680,
                12718
            ],
            [
                12718,
                12734
            ],
            [
                12740,
                12787
            ],
            [
                12854,
                13000
            ],
            [
                13054,
                13080
            ],
            [
                13081,
                13228
            ],
            [
                13356,
                13360
            ],
            [
                13249,
                13337
            ],
            [
                13418,
                13453
            ],
            [
                13361,
                13376
            ],
            [
                13457,
                13459
            ],
            [
                13459,
                13469
            ],
            [
                13540,
                13547
            ],
            [
                13584,
                13640
            ],
            [
                13646,
                13659
            ],
            [
                13663,
                13673
            ],
            [
                13726,
                13786
            ],
            [
                13805,
                13823
            ],
            [
                13829,
                13852
            ],
            [
                13885,
                13988
            ],
            [
                13997,
                13999
            ],
            [
                13999,
                14051
            ],
            [
                14057,
                14066
            ],
            [
                14109,
                14110
            ],
            [
                14071,
                14100
            ],
            [
                14126,
                14134
            ],
            [
                14162,
                14181
            ],
            [
                14181,
                14227
            ],
            [
                14227,
                14283
            ],
            [
                14283,
                14332
            ],
            [
                14357,
                14442
            ],
            [
                14442,
                14494
            ],
            [
                14522,
                14542
            ],
            [
                14547,
                14558
            ],
            [
                14571,
                14592
            ],
            [
                14592,
                14593
            ],
            [
                14607,
                14697
            ],
            [
                14703,
                14709
            ],
            [
                14805,
                14808
            ],
            [
                14710,
                14738
            ],
            [
                14770,
                14804
            ],
            [
                14822,
                14827
            ],
            [
                14829,
                14847
            ],
            [
                14849,
                14862
            ],
            [
                14885,
                14898
            ],
            [
                14898,
                14911
            ],
            [
                14979,
                14981
            ],
            [
                14981,
                14990
            ],
            [
                15011,
                15032
            ],
            [
                15037,
                15083
            ],
            [
                15083,
                15090
            ],
            [
                15098,
                15117
            ],
            [
                15117,
                15121
            ],
            [
                15144,
                15146
            ],
            [
                15146,
                15194
            ],
            [
                15270,
                15273
            ],
            [
                15340,
                15424
            ],
            [
                15424,
                15495
            ],
            [
                15528,
                15533
            ],
            [
                15500,
                15522
            ],
            [
                15495,
                15496
            ],
            [
                15540,
                15571
            ],
            [
                15571,
                15579
            ],
            [
                15591,
                15607
            ],
            [
                15607,
                15616
            ],
            [
                15618,
                15622
            ],
            [
                15624,
                15665
            ],
            [
                15677,
                15681
            ],
            [
                15691,
                15704
            ],
            [
                15704,
                15757
            ],
            [
                15757,
                15758
            ],
            [
                15759,
                15764
            ],
            [
                15766,
                15783
            ],
            [
                15783,
                15798
            ],
            [
                15800,
                15805
            ],
            [
                15807,
                15835
            ],
            [
                15837,
                15840
            ],
            [
                15843,
                15847
            ],
            [
                15850,
                15855
            ],
            [
                15856,
                15873
            ],
            [
                15873,
                15911
            ],
            [
                15911,
                15953
            ],
            [
                15968,
                16030
            ],
            [
                16030,
                16055
            ],
            [
                16055,
                16059
            ],
            [
                16061,
                16068
            ],
            [
                16070,
                16104
            ],
            [
                16104,
                16112
            ],
            [
                16138,
                16186
            ],
            [
                16234,
                16251
            ],
            [
                16267,
                16274
            ],
            [
                16285,
                16346
            ],
            [
                16424,
                16456
            ],
            [
                16482,
                16484
            ],
            [
                16457,
                16463
            ],
            [
                16530,
                16532
            ],
            [
                16532,
                16538
            ],
            [
                16544,
                16556
            ],
            [
                16558,
                16564
            ],
            [
                16566,
                16573
            ],
            [
                16744,
                16745
            ],
            [
                16746,
                16749
            ],
            [
                16758,
                16799
            ],
            [
                16841,
                16846
            ],
            [
                16853,
                16865
            ],
            [
                16865,
                16894
            ],
            [
                16909,
                16930
            ],
            [
                17001,
                17063
            ],
            [
                17161,
                17179
            ],
            [
                17204,
                17254
            ],
            [
                17254,
                17304
            ],
            [
                17304,
                17305
            ],
            [
                17306,
                17309
            ],
            [
                17311,
                17334
            ],
            [
                17336,
                17337
            ],
            [
                17339,
                17376
            ],
            [
                17376,
                17442
            ],
            [
                17523,
                17577
            ],
            [
                17577,
                17579
            ],
            [
                17672,
                17736
            ],
            [
                17736,
                17754
            ],
            [
                17768,
                17850
            ],
            [
                17886,
                17922
            ],
            [
                17854,
                17857
            ],
            [
                17968,
                17982
            ],
            [
                17869,
                17872
            ],
            [
                18005,
                18054
            ],
            [
                18054,
                18117
            ],
            [
                18117,
                18131
            ],
            [
                18152,
                18171
            ],
            [
                18600,
                18731
            ],
            [
                18731,
                18781
            ],
            [
                18781,
                18820
            ],
            [
                18827,
                18858
            ],
            [
                18858,
                18903
            ],
            [
                18903,
                18970
            ],
            [
                18984,
                18997
            ],
            [
                19016,
                19055
            ],
            [
                19055,
                19096
            ],
            [
                19096,
                19101
            ],
            [
                19105,
                19123
            ],
            [
                19123,
                19143
            ],
            [
                19143,
                19161
            ],
            [
                19161,
                19179
            ],
            [
                19179,
                19240
            ],
            [
                19240,
                19295
            ],
            [
                19302,
                19344
            ],
            [
                19378,
                19381
            ],
            [
                19381,
                19394
            ],
            [
                19459,
                19506
            ],
            [
                19506,
                19632
            ],
            [
                19642,
                19651
            ],
            [
                19651,
                19652
            ],
            [
                19661,
                19668
            ],
            [
                19678,
                19680
            ],
            [
                19680,
                19701
            ],
            [
                19701,
                19853
            ],
            [
                19888,
                19938
            ],
            [
                19938,
                20039
            ],
            [
                20039,
                20070
            ],
            [
                20070,
                20166
            ],
            [
                20166,
                20206
            ],
            [
                20206,
                20227
            ],
            [
                20242,
                20263
            ],
            [
                20285,
                20331
            ],
            [
                20333,
                20371
            ],
            [
                20371,
                20405
            ],
            [
                20437,
                20506
            ],
            [
                20506,
                20527
            ],
            [
                20540,
                20623
            ],
            [
                20628,
                20641
            ],
            [
                20641,
                20745
            ],
            [
                20745,
                20772
            ],
            [
                20772,
                20788
            ],
            [
                20916,
                20921
            ],
            [
                20932,
                20971
            ],
            [
                21016,
                21019
            ],
            [
                20971,
                20978
            ],
            [
                21099,
                21114
            ],
            [
                21020,
                21028
            ],
            [
                21122,
                21145
            ],
            [
                21152,
                21159
            ],
            [
                21159,
                21206
            ],
            [
                21213,
                21253
            ],
            [
                21253,
                21377
            ],
            [
                21377,
                21382
            ],
            [
                21382,
                21535
            ],
            [
                21542,
                21574
            ],
            [
                21609,
                21612
            ],
            [
                21612,
                21697
            ],
            [
                21697,
                21747
            ],
            [
                21747,
                21752
            ],
            [
                21752,
                21786
            ],
            [
                21786,
                21824
            ],
            [
                21863,
                21874
            ],
            [
                21883,
                21960
            ],
            [
                21976,
                21991
            ],
            [
                22007,
                22019
            ],
            [
                21974,
                21975
            ],
            [
                22020,
                22027
            ],
            [
                22001,
                22002
            ],
            [
                22028,
                22048
            ],
            [
                22067,
                22102
            ],
            [
                22102,
                22154
            ],
            [
                22169,
                22204
            ],
            [
                22276,
                22352
            ],
            [
                22352,
                22434
            ],
            [
                22434,
                22503
            ],
            [
                22503,
                22504
            ],
            [
                22505,
                22509
            ],
            [
                22529,
                22556
            ],
            [
                22566,
                22585
            ],
            [
                22585,
                22592
            ],
            [
                22602,
                22647
            ],
            [
                22647,
                22648
            ],
            [
                22648,
                22656
            ],
            [
                22667,
                22676
            ],
            [
                22707,
                22729
            ],
            [
                22760,
                22775
            ],
            [
                22814,
                22988
            ],
            [
                22988,
                22993
            ],
            [
                23018,
                23111
            ],
            [
                23111,
                23169
            ],
            [
                23183,
                23242
            ],
            [
                23242,
                23299
            ],
            [
                23299,
                23346
            ],
            [
                23346,
                23394
            ],
            [
                23394,
                23493
            ],
            [
                23493,
                23524
            ],
            [
                23524,
                23551
            ],
            [
                23557,
                23583
            ],
            [
                23602,
                23636
            ],
            [
                23657,
                23660
            ],
            [
                23660,
                23686
            ],
            [
                23697,
                23698
            ],
            [
                23700,
                23705
            ],
            [
                23707,
                23711
            ],
            [
                23713,
                23729
            ],
            [
                23729,
                23731
            ],
            [
                23738,
                23755
            ],
            [
                23761,
                23770
            ],
            [
                23770,
                23793
            ],
            [
                23818,
                23849
            ],
            [
                23920,
                23928
            ],
            [
                23970,
                23972
            ],
            [
                23972,
                23979
            ],
            [
                23999,
                24003
            ],
            [
                23987,
                23993
            ],
            [
                24021,
                24096
            ],
            [
                24096,
                24127
            ],
            [
                24236,
                24239
            ],
            [
                24248,
                24290
            ],
            [
                24327,
                24356
            ],
            [
                24357,
                24426
            ],
            [
                24435,
                24437
            ],
            [
                24437,
                24453
            ],
            [
                24464,
                24477
            ],
            [
                24530,
                24609
            ],
            [
                24616,
                24650
            ],
            [
                24650,
                24747
            ]
        ],
        "row_chars": [
            [
                0,
                117
            ],
            [
                117,
                260
            ],
            [
                260,
                510
            ],
            [
                510,
                562
            ],
            [
                562,
                616
            ],
            [
                616,
                709
            ],
            [
                709,
                747
            ],
            [
                747,
                847
            ],
            [
                847,
                987
            ],
            [
                987,
                1348
            ],
            [
                1348,
                1643
            ],
            [
                1643,
                1925
            ],
            [
                1925,
                2547
            ],
            [
                2547,
                2779
            ],
            [
                2779,
                2910
            ],
            [
                2910,
                3272
            ],
            [
                3272,
                3286
            ],
            [
                3286,
                3579
            ],
            [
                3579,
                3637
            ],
            [
                3637,
                3671
            ],
            [
                3671,
                3735
            ],
            [
                3735,
                3795
            ],
            [
                3795,
                3858
            ],
            [
                3858,
                3908
            ],
            [
                3908,
                4101
            ],
            [
                4101,
                4218
            ],
            [
                4218,
                4290
            ],
            [
                4290,
                4395
            ],
            [
                4395,
                4610
            ],
            [
                4610,
                4694
            ],
            [
                4694,
                4819
            ],
            [
                4819,
                4905
            ],
            [
                4905,
                5036
            ],
            [
                5036,
                5113
            ],
            [
                5113,
                5153
            ],
            [
                5153,
                5291
            ],
            [
                5291,
                5363
            ],
            [
                5363,
                5413
            ],
            [
                5413,
                5650
            ],
            [
                5650,
                5719
            ],
            [
                5719,
                5825
            ],
            [
                5825,
                5906
            ],
            [
                5906,
                5990
            ],
            [
                5990,
                6434
            ],
            [
                6434,
                6565
            ],
            [
                6565,
                6828
            ],
            [
                6828,
                6866
            ],
            [
                6866,
                7057
            ],
            [
                7057,
                7137
            ],
            [
                7137,
                7525
            ],
            [
                7525,
                7598
            ],
            [
                7598,
                7694
            ],
            [
                7694,
                7929
            ],
            [
                7929,
                8031
            ],
            [
                8031,
                8137
            ],
            [
                8137,
                8396
            ],
            [
                8396,
                8437
            ],
            [
                8437,
                8605
            ],
            [
                8605,
                8785
            ],
            [
                8785,
                8869
            ],
            [
                8869,
                8925
            ],
            [
                8925,
                9119
            ],
            [
                9119,
                9427
            ],
            [
                9427,
                9459
            ],
            [
                9459,
                9621
            ],
            [
                9621,
                9702
            ],
            [
                9702,
                9854
            ],
            [
                9854,
                9872
            ],
            [
                9872,
                9952
            ],
            [
                9952,
                9964
            ],
            [
                9964,
                10019
            ],
            [
                10019,
                10099
            ],
            [
                10099,
                10287
            ],
            [
                10287,
                10418
            ],
            [
                10418,
                10534
            ],
            [
                10534,
                10806
            ],
            [
                10806,
                11017
            ],
            [
                11017,
                11062
            ],
            [
                11062,
                11534
            ],
            [
                11534,
                11644
            ],
            [
                11644,
                11726
            ],
            [
                11726,
                11878
            ],
            [
                11878,
                11934
            ],
            [
                11934,
                12031
            ],
            [
                12031,
                12086
            ],
            [
                12086,
                12196
            ],
            [
                12196,
                12303
            ],
            [
                12303,
                12400
            ],
            [
                12400,
                12680
            ],
            [
                12680,
                12718
            ],
            [
                12718,
                13081
            ],
            [
                13081,
                13459
            ],
            [
                13459,
                13659
            ],
            [
                13659,
                13999
            ],
            [
                13999,
                14181
            ],
            [
                14181,
                14227
            ],
            [
                14227,
                14283
            ],
            [
                14283,
                14332
            ],
            [
                14332,
                14442
            ],
            [
                14442,
                14592
            ],
            [
                14592,
                14898
            ],
            [
                14898,
                14981
            ],
            [
                14981,
                15083
            ],
            [
                15083,
                15117
            ],
            [
                15117,
                15146
            ],
            [
                15146,
                15273
            ],
            [
                15273,
                15327
            ],
            [
                15327,
                15424
            ],
            [
                15424,
                15495
            ],
            [
                15495,
                15571
            ],
            [
                15571,
                15607
            ],
            [
                15607,
                15704
            ],
            [
                15704,
                15757
            ],
            [
                15757,
                15783
            ],
            [
                15783,
                15873
            ],
            [
                15873,
                15911
            ],
            [
                15911,
                16030
            ],
            [
                16030,
                16055
            ],
            [
                16055,
                16138
            ],
            [
                16138,
                16186
            ],
            [
                16186,
                16234
            ],
            [
                16234,
                16532
            ],
            [
                16532,
                16575
            ],
            [
                16575,
                16744
            ],
            [
                16744,
                16865
            ],
            [
                16865,
                17001
            ],
            [
                17001,
                17254
            ],
            [
                17254,
                17304
            ],
            [
                17304,
                17376
            ],
            [
                17376,
                17442
            ],
            [
                17442,
                17523
            ],
            [
                17523,
                17577
            ],
            [
                17577,
                17736
            ],
            [
                17736,
                18054
            ],
            [
                18054,
                18117
            ],
            [
                18117,
                18171
            ],
            [
                18171,
                18409
            ],
            [
                18409,
                18731
            ],
            [
                18731,
                18781
            ],
            [
                18781,
                18858
            ],
            [
                18858,
                18903
            ],
            [
                18903,
                19055
            ],
            [
                19055,
                19096
            ],
            [
                19096,
                19123
            ],
            [
                19123,
                19143
            ],
            [
                19143,
                19161
            ],
            [
                19161,
                19179
            ],
            [
                19179,
                19240
            ],
            [
                19240,
                19381
            ],
            [
                19381,
                19506
            ],
            [
                19506,
                19651
            ],
            [
                19651,
                19680
            ],
            [
                19680,
                19701
            ],
            [
                19701,
                19938
            ],
            [
                19938,
                20039
            ],
            [
                20039,
                20070
            ],
            [
                20070,
                20166
            ],
            [
                20166,
                20206
            ],
            [
                20206,
                20371
            ],
            [
                20371,
                20405
            ],
            [
                20405,
                20437
            ],
            [
                20437,
                20506
            ],
            [
                20506,
                20641
            ],
            [
                20641,
                20745
            ],
            [
                20745,
                20772
            ],
            [
                20772,
                20916
            ],
            [
                20916,
                20921
            ],
            [
                20921,
                20971
            ],
            [
                20971,
                21159
            ],
            [
                21159,
                21253
            ],
            [
                21253,
                21377
            ],
            [
                21377,
                21382
            ],
            [
                21382,
                21612
            ],
            [
                21612,
                21697
            ],
            [
                21697,
                21747
            ],
            [
                21747,
                21752
            ],
            [
                21752,
                21786
            ],
            [
                21786,
                21826
            ],
            [
                21826,
                21863
            ],
            [
                21863,
                22102
            ],
            [
                22102,
                22204
            ],
            [
                22204,
                22276
            ],
            [
                22276,
                22352
            ],
            [
                22352,
                22434
            ],
            [
                22434,
                22503
            ],
            [
                22503,
                22585
            ],
            [
                22585,
                22647
            ],
            [
                22647,
                22988
            ],
            [
                22988,
                23111
            ],
            [
                23111,
                23242
            ],
            [
                23242,
                23299
            ],
            [
                23299,
                23346
            ],
            [
                23346,
                23394
            ],
            [
                23394,
                23493
            ],
            [
                23493,
                23524
            ],
            [
                23524,
                23660
            ],
            [
                23660,
                23729
            ],
            [
                23729,
                23770
            ],
            [
                23770,
                23972
            ],
            [
                23972,
                24096
            ],
            [
                24096,
                24357
            ],
            [
                24357,
                24437
            ],
            [
                24437,
                24650
            ],
            [
                24650,
                24747
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Rushworth was at the door to welcome the party with due attention. In the drawing-room they were met with equal cordiality by the mother, and Miss Bertram had all the distinction that she could wish. The doors were thrown open to admit them into the dining-parlour, where a luncheon was prepared with abundance and elegance. Much was said, and ate, and all went well.\nMrs Rushworth then proposed showing the party round the house. They rose accordingly, and under Mrs. Rushworth's guidance were shown through a number of rooms, all lofty, large, and amply furnished in the taste of fifty years back, with shining floors, solid mahogany, rich damask, marble, gilding, and carving, each handsome in its way. There were many pictures, some good, but most were family portraits, no longer anything to anybody but Mrs. Rushworth.\nShe addressed herself chiefly to Miss Crawford and Fanny. Miss Crawford, who had seen scores of great houses, and cared for none of them, had only the appearance of civilly listening, while Fanny, to whom everything was new, attended earnestly to all that Mrs. Rushworth could relate of the family in former times, delighted to connect anything with the history that she knew, or to warm her imagination with scenes of the past.\nThere was not much prospect from any of the rooms; and Henry Crawford looked grave, shaking his head at the windows. Every room on the west front looked across a lawn to the beginning of the avenue beyond tall iron palisades.\n\"Now,\" said Mrs. Rushworth, \"we are coming to the chapel.\"\nThey entered. Fanny expected something grander than a spacious, oblong room, fitted up for the purpose of devotion: with nothing more striking or solemn than the profusion of mahogany, and crimson velvet cushions.\n\"I am disappointed,\" said she quietly to Edmund. \"This is not my idea of a chapel. There is nothing melancholy, nothing grand. Here are no aisles, no arches, no inscriptions. No banners to be 'blown by the night wind of heaven.'\"\n\"You forget, Fanny, how lately all this has been built, and only for the private use of the family. You must look in the parish church for the banners.\"\nMrs. Rushworth began, \"This chapel was fitted up as you see it, in James the Second's time. Before then, the pews were only wainscot; and the cushions only purple cloth. It is a handsome chapel, and was formerly in constant use. Prayers were read in it by the domestic chaplain, within the memory of many; but the late Mr. Rushworth left it off.\"\n\"Every generation has its improvements,\" said Miss Crawford, with a smile, to Edmund.\n\"It is a pity,\" cried Fanny, \"that the custom should have been discontinued. It is so much in character with a great house! A whole family assembling regularly for the purpose of prayer is fine!\"\n\"Very fine indeed,\" said Miss Crawford, laughing. \"It must do the heads of the family good to force all the poor housemaids to say their prayers here twice a day, while they are inventing excuses themselves for staying away.\"\n\"That is hardly Fanny's idea of a family assembling,\" said Edmund.\n\"It is safer to leave people to their own devices on such subjects. Everybody likes to choose their own time and manner of devotion. The obligation of attendance is a formidable thing. Cannot you imagine with what unwilling feelings the former belles of the house came to this chapel? Starched up into seeming piety, but with heads full of something very different-especially if the poor chaplain were not worth looking at-and, in those days, I fancy parsons were inferior even to what they are now.\"\nFor a few moments she was unanswered. Fanny coloured and looked at Edmund, but felt too angry for speech; and he needed a little recollection before he could say, \"Your lively mind can hardly be serious even on serious subjects. You have given us an amusing sketch, and human nature cannot say it was not so. We must all feel at times the difficulty of fixing our thoughts as we could wish; but do you think the minds which are indulged in wanderings in a chapel, would be more collected in a closet?\"\n\"Yes, for two reasons. There would be less to distract the attention, and it would not be taxed so long.\"\n\"The mind would always find objects to distract it; and the influence of the place may often rouse better feelings than are begun with. The length of the service I admit to be sometimes too hard upon the mind. I have not yet left Oxford long enough to forget what chapel prayers are.\"\nMeanwhile, Julia called Mr. Crawford's attention to her sister, saying, \"Do look at Mr. Rushworth and Maria, standing side by side, exactly as if the wedding ceremony were going to be performed.\"\nMr. Crawford smiled, and stepping forward to Maria, said, in a voice which she only could hear, \"I do not like to see Miss Bertram so near the altar.\"\nStarting, the lady instinctively moved a step or two, but recovering, affected to laugh, and asked him, in a tone not much louder, \"If he would give her away?\"\n\"I am afraid I should do it very awkwardly,\" was his reply, with a look of meaning.\nJulia, joining them, carried on the joke.\n\"It is really a pity that it should not take place directly, if we had a licence, for nothing in the world could be more pleasant.\" And she talked about it with so little caution as to catch the comprehension of Mr. Rushworth, who whispered gallantries to Maria.\n\"If Edmund were but in orders!\" cried Julia: \"My dear Edmund, if you were in orders now, you might perform the ceremony directly. How unlucky that you are not ordained.\"\nMiss Crawford looked almost aghast under this new idea. Fanny pitied her. \"How distressed she will be at what she said just now,\" passed across her mind.\n\"Ordained!\" said Miss Crawford; \"are you to be a clergyman?\"\n\"Yes; I shall take orders after my father's return-probably at Christmas.\"\nMiss Crawford, rallying her spirits, replied only, \"If I had known this before, I would have spoken of the cloth with more respect,\" and turned the subject.\nThe chapel was soon afterwards left to the silence which reigned in it throughout the year. All seemed to feel that they had been there long enough.\nThe lower part of the house had now been shown, and Mrs. Rushworth would have proceeded towards the staircase if her son had not interposed. \"We shall not have time to survey the grounds,\" said he. \"It is past two, and we are to dine at five.\"\nMrs. Rushworth submitted; and Mrs. Norris was beginning to arrange by what combination of carriages and horses most could be done, when the young people, meeting with an outward door that opened temptingly on a flight of steps, as by one impulse, all walked out.\n\"Suppose we turn down here for the present,\" said Mrs. Rushworth, civilly taking the hint and following them. \"Here are the greatest number of our plants, and our pheasants.\"\n\"I see walls of great promise,\" said Mr Crawford, looking round. He moved forward to examine the end of the house. The lawn, bounded by a high wall, contained a bowling-green, and beyond the bowling-green a long terrace walk, backed by iron palisades, with a view over them into the tree-tops of a wilderness. It was a good spot for fault-finding. Mr. Crawford was followed by Miss Bertram and Mr. Rushworth; and these three were found in busy consultation on the terrace by Edmund, Miss Crawford, and Fanny, who seemed as naturally to unite, and who, after a few words, left them and walked on.\nThe remaining three, Mrs. Rushworth, Mrs. Norris, and Julia, were still far behind; for Julia, whose happy star no longer prevailed, was obliged to stay with Mrs. Rushworth, and restrain her impatient feet to that lady's slow pace, while her aunt was lingering behind in gossip with the housekeeper. Poor Julia was now as different from the Julia of the barouche-box as could be imagined. Politeness made it impossible for her to escape; while the want of that self-command, that consideration of others, that principle of right, which had not formed any essential part of her education, made her miserable.\n\"This is insufferably hot,\" said Miss Crawford, when her group of three had taken a turn on the terrace, and were near the door to the wilderness. \"Shall any of us object to being comfortable? Here is a nice little wood, if one can but get into it. What happiness if the door should not be locked! in these great places the gardeners are the only people who can go where they like.\"\nThe door, however, proved not to be locked, and they turned joyfully through it, leaving the glare of day behind. A flight of steps landed them in the wilderness, which was a planted wood of about two acres. Though it was chiefly of larch and laurel, laid out with too much regularity, it was shade and natural beauty compared with the terrace. They all felt refreshed as they walked. At length, Miss Crawford began, \"So you are to be a clergyman, Mr. Bertram. This is a surprise to me.\"\n\"Why? You must suppose me designed for some profession.\"\n\"There is generally an uncle or a grandfather to leave a fortune to the second son.\"\n\"A very praiseworthy practice,\" said Edmund, \"but not quite universal. Being one of the exceptions, I must do something for myself.\"\n\"But why be a clergyman? I thought that was always the lot of the youngest, where many chose before him.\"\n\"Do you think the church itself never chosen, then?\"\n\"Never is a black word. But yes, in the never of conversation, which means not very often, I do think it. For what is to be done in the church? Men love to distinguish themselves, and in other lines distinction may be gained, but not in the church. A clergyman is nothing.\"\n\"The nothing of conversation has its gradations too, I hope. A clergyman cannot be high in state or fashion. But I cannot call it nothing to have the charge of all that is of the first importance to mankind, the guardianship of religion and of morals. No one can call the office nothing.\"\n\"You give greater consequence to the clergyman than I can comprehend. One does not see much of this importance in society. How can two sermons a week, even supposing them worth hearing, govern the conduct of a large congregation for the rest of the week? One scarcely sees a clergyman out of his pulpit.\"\n\"You are speaking of London, I am speaking of the nation at large.\"\n\"The metropolis, I imagine, is a pretty fair sample of the rest.\"\n\"We do not look in great cities for our best morality. It is not there that the influence of the clergy can be most felt. A fine preacher is admired; but it is not in fine preaching only that a good clergyman will be useful, where the parish and neighbourhood know his character, and can observe his conduct, which in London can rarely be the case. The clergy are lost there in the crowds of their parishioners. They are known only as preachers. It will, I believe, be everywhere found, that as the clergy are, or are not what they ought to be, so are the rest of the nation.\"\n\"Certainly,\" said Fanny, with gentle earnestness.\n\"There,\" cried Miss Crawford, \"you have convinced Miss Price already.\"\n\"I wish I could convince Miss Crawford too.\"\n\"I do not think you ever will,\" said she, with an arch smile; \"I am still surprised now that you should intend to take orders. You really are fit for something better. Come, change your mind. It is not too late. Go into the law.\"\n\"Go into the law! With as much ease as I was told to go into this wilderness.\"\n\"Now you are going to say something about law being the worse wilderness of the two, but I forestall you.\"\n\"You need not, for there is not the least wit in my nature. I am a very matter-of-fact, plain-spoken being, and may blunder on the borders of a repartee for half an hour together without getting it out.\"\nA silence followed. Each was thoughtful. Fanny made the first interruption by saying, \"I wonder that I should be tired with only walking in this sweet wood; but the next time we come to a seat, I should be glad to sit down for a little while.\"\n\"My dear Fanny,\" cried Edmund, immediately drawing her arm within his, \"how thoughtless I have been! I hope you are not very tired. Perhaps,\" turning to Miss Crawford, \"my other companion may do me the honour of taking an arm.\"\n\"Thank you, but I am not at all tired.\" She took it, however, and the gratification of feeling such a connexion for the first time made him a little forgetful of Fanny. \"You scarcely touch me,\" said he. \"What a difference in the weight of a woman's arm from that of a man! At Oxford I have been used to have a man lean on me for the length of a street, and you are only a fly in comparison.\"\n\"I am really not tired, which I almost wonder at; for we must have walked at least a mile in this wood. Do not you think we have?\"\n\"Not half a mile.\"\n\"Oh! consider how much we have wound about. And we have not seen the end of the wood since we left the first path.\"\n\"But if you remember, before we left that first path, we saw directly to the end of it. We looked down the whole vista, and saw it closed by iron gates, and it could not have been more than a furlong in length.\"\n\"Oh! I know nothing of your furlongs, but I am sure it is a very long wood, and that we have been winding in and out ever since we came into it; and therefore I say that we have walked a mile.\"\n\"We have been exactly a quarter of an hour here,\" said Edmund, taking out his watch. \"Do you think we are walking four miles an hour?\"\n\"Oh! do not attack me with your watch. A watch is always too fast or too slow.\"\nA few steps brought them out at the bottom of the very walk they had been talking of; and well shaded and looking over a deep ditch, a ha-ha, into the park, was a bench, on which they all sat down.\n\"I am afraid you are very tired, Fanny,\" said Edmund; \"why would not you speak sooner? Every sort of exercise fatigues her so soon, Miss Crawford, except riding.\"\n\"How abominable in you, then, to let me engross her horse as I did all last week! I am ashamed of you and of myself, but it shall never happen again.\"\n\"Your consideration makes me more aware of my own neglect. Fanny's well-being seems in safer hands with you than with me.\"\n\"I am not surprised that she is tired now; for there is nothing so fatiguing as seeing a great house, dawdling from one room to another, straining one's eyes and one's attention, hearing what one does not understand, admiring what one does not care for. It is the greatest bore in the world, and Miss Price has found it so, though she did not know it.\"\n\"I shall soon be rested,\" said Fanny; \"to sit in the shade, and look upon verdure, is the most perfect refreshment.\"\nAfter sitting a little while Miss Crawford was up again. \"I must move,\" said she; \"resting fatigues me. I have looked across the ha-ha till I am weary. I must go and look through that iron gate at the same view, without being able to see it so well.\"\nEdmund left the seat likewise. \"Now, Miss Crawford, if you look up the walk, you will see that it cannot be half a mile long.\"\n\"It is an immense distance; I see that with a glance.\"\nHe reasoned with her in vain. She would not calculate; she would only smile and assert in a way that was most engaging. At last they agreed to determine the dimensions of the wood by walking a little more about it. They would go to one end of it, and turn a little way in some other direction, and be back in a few minutes.\nFanny said she was rested, and would have moved too, but this was not allowed. Edmund urged her to remain where she was. She was left on the bench to think with pleasure of her cousin's care, but with regret that she was not stronger. She watched them till they had turned the corner, and listened till all sound of them had ceased.",
        "paragraph_chars": [
            [
                0,
                372
            ],
            [
                372,
                829
            ],
            [
                829,
                1258
            ],
            [
                1258,
                1484
            ],
            [
                1484,
                1543
            ],
            [
                1543,
                1757
            ],
            [
                1757,
                1987
            ],
            [
                1987,
                2140
            ],
            [
                2140,
                2487
            ],
            [
                2487,
                2573
            ],
            [
                2573,
                2769
            ],
            [
                2769,
                2995
            ],
            [
                2995,
                3062
            ],
            [
                3062,
                3563
            ],
            [
                3563,
                4065
            ],
            [
                4065,
                4171
            ],
            [
                4171,
                4456
            ],
            [
                4456,
                4652
            ],
            [
                4652,
                4803
            ],
            [
                4803,
                4963
            ],
            [
                4963,
                5047
            ],
            [
                5047,
                5089
            ],
            [
                5089,
                5352
            ],
            [
                5352,
                5522
            ],
            [
                5522,
                5676
            ],
            [
                5676,
                5737
            ],
            [
                5737,
                5812
            ],
            [
                5812,
                5969
            ],
            [
                5969,
                6118
            ],
            [
                6118,
                6362
            ],
            [
                6362,
                6625
            ],
            [
                6625,
                6800
            ],
            [
                6800,
                7396
            ],
            [
                7396,
                8004
            ],
            [
                8004,
                8387
            ],
            [
                8387,
                8875
            ],
            [
                8875,
                8932
            ],
            [
                8932,
                9017
            ],
            [
                9017,
                9150
            ],
            [
                9150,
                9256
            ],
            [
                9256,
                9309
            ],
            [
                9309,
                9583
            ],
            [
                9583,
                9872
            ],
            [
                9872,
                10177
            ],
            [
                10177,
                10245
            ],
            [
                10245,
                10311
            ],
            [
                10311,
                10888
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                11009
            ],
            [
                11009,
                11054
            ],
            [
                11054,
                11284
            ],
            [
                11284,
                11363
            ],
            [
                11363,
                11470
            ],
            [
                11470,
                11674
            ],
            [
                11674,
                11918
            ],
            [
                11918,
                12146
            ],
            [
                12146,
                12538
            ],
            [
                12538,
                12669
            ],
            [
                12669,
                12688
            ],
            [
                12688,
                12804
            ],
            [
                12804,
                13016
            ],
            [
                13016,
                13210
            ],
            [
                13210,
                13345
            ],
            [
                13345,
                13425
            ],
            [
                13425,
                13623
            ],
            [
                13623,
                13786
            ],
            [
                13786,
                13937
            ],
            [
                13937,
                14060
            ],
            [
                14060,
                14413
            ],
            [
                14413,
                14530
            ],
            [
                14530,
                14781
            ],
            [
                14781,
                14908
            ],
            [
                14908,
                14963
            ],
            [
                14963,
                15287
            ],
            [
                15287,
                15619
            ]
        ],
        "segment_chars": [
            [
                0,
                71
            ],
            [
                71,
                204
            ],
            [
                204,
                329
            ],
            [
                329,
                372
            ],
            [
                372,
                435
            ],
            [
                435,
                710
            ],
            [
                710,
                829
            ],
            [
                829,
                887
            ],
            [
                887,
                1258
            ],
            [
                1258,
                1375
            ],
            [
                1375,
                1484
            ],
            [
                1484,
                1543
            ],
            [
                1543,
                1557
            ],
            [
                1557,
                1757
            ],
            [
                1757,
                1806
            ],
            [
                1806,
                1840
            ],
            [
                1840,
                1884
            ],
            [
                1884,
                1932
            ],
            [
                1932,
                1987
            ],
            [
                1987,
                2087
            ],
            [
                2087,
                2140
            ],
            [
                2140,
                2232
            ],
            [
                2232,
                2310
            ],
            [
                2310,
                2369
            ],
            [
                2369,
                2487
            ],
            [
                2487,
                2573
            ],
            [
                2573,
                2650
            ],
            [
                2650,
                2697
            ],
            [
                2697,
                2769
            ],
            [
                2769,
                2819
            ],
            [
                2819,
                2995
            ],
            [
                2995,
                3062
            ],
            [
                3062,
                3130
            ],
            [
                3130,
                3195
            ],
            [
                3195,
                3247
            ],
            [
                3247,
                3347
            ],
            [
                3347,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3792
            ],
            [
                3792,
                3872
            ],
            [
                3872,
                4065
            ],
            [
                4065,
                4088
            ],
            [
                4088,
                4171
            ],
            [
                4171,
                4307
            ],
            [
                4307,
                4381
            ],
            [
                4381,
                4456
            ],
            [
                4456,
                4652
            ],
            [
                4652,
                4803
            ],
            [
                4803,
                4963
            ],
            [
                4963,
                5047
            ],
            [
                5047,
                5089
            ],
            [
                5089,
                5221
            ],
            [
                5221,
                5352
            ],
            [
                5352,
                5384
            ],
            [
                5384,
                5482
            ],
            [
                5482,
                5522
            ],
            [
                5522,
                5578
            ],
            [
                5578,
                5596
            ],
            [
                5596,
                5676
            ],
            [
                5676,
                5688
            ],
            [
                5688,
                5737
            ],
            [
                5737,
                5812
            ],
            [
                5812,
                5969
            ],
            [
                5969,
                6061
            ],
            [
                6061,
                6118
            ],
            [
                6118,
                6259
            ],
            [
                6259,
                6316
            ],
            [
                6316,
                6362
            ],
            [
                6362,
                6625
            ],
            [
                6625,
                6735
            ],
            [
                6735,
                6800
            ],
            [
                6800,
                6865
            ],
            [
                6865,
                6915
            ],
            [
                6915,
                7110
            ],
            [
                7110,
                7148
            ],
            [
                7148,
                7396
            ],
            [
                7396,
                7696
            ],
            [
                7696,
                7785
            ],
            [
                7785,
                8004
            ],
            [
                8004,
                8151
            ],
            [
                8151,
                8197
            ],
            [
                8197,
                8253
            ],
            [
                8253,
                8302
            ],
            [
                8302,
                8387
            ],
            [
                8387,
                8501
            ],
            [
                8501,
                8595
            ],
            [
                8595,
                8732
            ],
            [
                8732,
                8772
            ],
            [
                8772,
                8848
            ],
            [
                8848,
                8875
            ],
            [
                8875,
                8881
            ],
            [
                8881,
                8932
            ],
            [
                8932,
                9017
            ],
            [
                9017,
                9088
            ],
            [
                9088,
                9150
            ],
            [
                9150,
                9175
            ],
            [
                9175,
                9256
            ],
            [
                9256,
                9309
            ],
            [
                9309,
                9333
            ],
            [
                9333,
                9415
            ],
            [
                9415,
                9453
            ],
            [
                9453,
                9558
            ],
            [
                9558,
                9583
            ],
            [
                9583,
                9644
            ],
            [
                9644,
                9692
            ],
            [
                9692,
                9835
            ],
            [
                9835,
                9872
            ],
            [
                9872,
                9942
            ],
            [
                9942,
                9995
            ],
            [
                9995,
                10127
            ],
            [
                10127,
                10177
            ],
            [
                10177,
                10245
            ],
            [
                10245,
                10311
            ],
            [
                10311,
                10366
            ],
            [
                10366,
                10433
            ],
            [
                10433,
                10660
            ],
            [
                10660,
                10723
            ],
            [
                10723,
                10757
            ],
            [
                10757,
                10888
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                11009
            ],
            [
                11009,
                11054
            ],
            [
                11054,
                11181
            ],
            [
                11181,
                11222
            ],
            [
                11222,
                11246
            ],
            [
                11246,
                11266
            ],
            [
                11266,
                11284
            ],
            [
                11284,
                11302
            ],
            [
                11302,
                11363
            ],
            [
                11363,
                11470
            ],
            [
                11470,
                11530
            ],
            [
                11530,
                11674
            ],
            [
                11674,
                11694
            ],
            [
                11694,
                11715
            ],
            [
                11715,
                11918
            ],
            [
                11918,
                12019
            ],
            [
                12019,
                12050
            ],
            [
                12050,
                12146
            ],
            [
                12146,
                12186
            ],
            [
                12186,
                12315
            ],
            [
                12315,
                12349
            ],
            [
                12349,
                12419
            ],
            [
                12419,
                12538
            ],
            [
                12538,
                12642
            ],
            [
                12642,
                12669
            ],
            [
                12669,
                12688
            ],
            [
                12688,
                12693
            ],
            [
                12693,
                12732
            ],
            [
                12732,
                12804
            ],
            [
                12804,
                12892
            ],
            [
                12892,
                13016
            ],
            [
                13016,
                13021
            ],
            [
                13021,
                13210
            ],
            [
                13210,
                13295
            ],
            [
                13295,
                13345
            ],
            [
                13345,
                13350
            ],
            [
                13350,
                13384
            ],
            [
                13384,
                13425
            ],
            [
                13425,
                13623
            ],
            [
                13623,
                13710
            ],
            [
                13710,
                13786
            ],
            [
                13786,
                13868
            ],
            [
                13868,
                13937
            ],
            [
                13937,
                13996
            ],
            [
                13996,
                14060
            ],
            [
                14060,
                14314
            ],
            [
                14314,
                14413
            ],
            [
                14413,
                14530
            ],
            [
                14530,
                14587
            ],
            [
                14587,
                14634
            ],
            [
                14634,
                14682
            ],
            [
                14682,
                14781
            ],
            [
                14781,
                14812
            ],
            [
                14812,
                14908
            ],
            [
                14908,
                14963
            ],
            [
                14963,
                14993
            ],
            [
                14993,
                15083
            ],
            [
                15083,
                15178
            ],
            [
                15178,
                15287
            ],
            [
                15287,
                15366
            ],
            [
                15366,
                15408
            ],
            [
                15408,
                15522
            ],
            [
                15522,
                15619
            ]
        ],
        "overlap_chars": [
            [
                0,
                32
            ],
            [
                41,
                44
            ],
            [
                45,
                50
            ],
            [
                51,
                71
            ],
            [
                71,
                182
            ],
            [
                183,
                204
            ],
            [
                204,
                244
            ],
            [
                245,
                253
            ],
            [
                254,
                277
            ],
            [
                287,
                329
            ],
            [
                329,
                347
            ],
            [
                348,
                371
            ],
            [
                372,
                375
            ],
            [
                376,
                385
            ],
            [
                391,
                399
            ],
            [
                408,
                411
            ],
            [
                424,
                433
            ],
            [
                433,
                434
            ],
            [
                440,
                498
            ],
            [
                505,
                542
            ],
            [
                543,
                710
            ],
            [
                710,
                720
            ],
            [
                726,
                734
            ],
            [
                734,
                735
            ],
            [
                736,
                740
            ],
            [
                741,
                750
            ],
            [
                756,
                827
            ],
            [
                827,
                828
            ],
            [
                829,
                885
            ],
            [
                887,
                1048
            ],
            [
                1049,
                1062
            ],
            [
                1063,
                1070
            ],
            [
                1073,
                1143
            ],
            [
                1144,
                1178
            ],
            [
                1179,
                1182
            ],
            [
                1183,
                1190
            ],
            [
                1204,
                1208
            ],
            [
                1212,
                1258
            ],
            [
                1264,
                1267
            ],
            [
                1272,
                1312
            ],
            [
                1313,
                1327
            ],
            [
                1335,
                1340
            ],
            [
                1340,
                1341
            ],
            [
                1342,
                1375
            ],
            [
                1375,
                1455
            ],
            [
                1456,
                1482
            ],
            [
                1482,
                1484
            ],
            [
                1484,
                1540
            ],
            [
                1540,
                1543
            ],
            [
                1543,
                1557
            ],
            [
                1557,
                1562
            ],
            [
                1572,
                1596
            ],
            [
                1597,
                1688
            ],
            [
                1689,
                1731
            ],
            [
                1732,
                1755
            ],
            [
                1755,
                1756
            ],
            [
                1757,
                1786
            ],
            [
                1795,
                1806
            ],
            [
                1806,
                1840
            ],
            [
                1840,
                1848
            ],
            [
                1849,
                1884
            ],
            [
                1884,
                1930
            ],
            [
                1930,
                1932
            ],
            [
                1932,
                1942
            ],
            [
                1943,
                1983
            ],
            [
                1987,
                2046
            ],
            [
                2047,
                2087
            ],
            [
                2087,
                2100
            ],
            [
                2101,
                2121
            ],
            [
                2122,
                2137
            ],
            [
                2137,
                2140
            ],
            [
                2140,
                2160
            ],
            [
                2162,
                2232
            ],
            [
                2232,
                2238
            ],
            [
                2243,
                2277
            ],
            [
                2278,
                2281
            ],
            [
                2282,
                2290
            ],
            [
                2291,
                2308
            ],
            [
                2308,
                2310
            ],
            [
                2310,
                2367
            ],
            [
                2367,
                2369
            ],
            [
                2369,
                2381
            ],
            [
                2382,
                2487
            ],
            [
                2487,
                2573
            ],
            [
                2573,
                2650
            ],
            [
                2653,
                2655
            ],
            [
                2656,
                2695
            ],
            [
                2695,
                2697
            ],
            [
                2697,
                2769
            ],
            [
                2769,
                2819
            ],
            [
                2819,
                2854
            ],
            [
                2855,
                2892
            ],
            [
                2893,
                2895
            ],
            [
                2896,
                2995
            ],
            [
                2995,
                2996
            ],
            [
                2996,
                3000
            ],
            [
                3001,
                3061
            ],
            [
                3062,
                3063
            ],
            [
                3063,
                3130
            ],
            [
                3130,
                3148
            ],
            [
                3156,
                3195
            ],
            [
                3195,
                3223
            ],
            [
                3224,
                3245
            ],
            [
                3245,
                3247
            ],
            [
                3247,
                3325
            ],
            [
                3331,
                3347
            ],
            [
                3347,
                3525
            ],
            [
                3526,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3792
            ],
            [
                3792,
                3872
            ],
            [
                3872,
                3888
            ],
            [
                3889,
                3891
            ],
            [
                3892,
                3897
            ],
            [
                3898,
                3957
            ],
            [
                3958,
                3980
            ],
            [
                3981,
                4065
            ],
            [
                4065,
                4070
            ],
            [
                4075,
                4078
            ],
            [
                4086,
                4088
            ],
            [
                4088,
                4133
            ],
            [
                4133,
                4154
            ],
            [
                4161,
                4171
            ],
            [
                4171,
                4180
            ],
            [
                4181,
                4186
            ],
            [
                4194,
                4221
            ],
            [
                4221,
                4253
            ],
            [
                4254,
                4307
            ],
            [
                4307,
                4310
            ],
            [
                4311,
                4332
            ],
            [
                4333,
                4365
            ],
            [
                4366,
                4381
            ],
            [
                4381,
                4456
            ],
            [
                4465,
                4519
            ],
            [
                4520,
                4605
            ],
            [
                4614,
                4649
            ],
            [
                4652,
                4671
            ],
            [
                4671,
                4803
            ],
            [
                4803,
                4871
            ],
            [
                4871,
                4963
            ],
            [
                4963,
                5047
            ],
            [
                5047,
                5066
            ],
            [
                5066,
                5089
            ],
            [
                5089,
                5090
            ],
            [
                5090,
                5159
            ],
            [
                5160,
                5161
            ],
            [
                5162,
                5174
            ],
            [
                5175,
                5209
            ],
            [
                5210,
                5221
            ],
            [
                5221,
                5235
            ],
            [
                5236,
                5314
            ],
            [
                5314,
                5315
            ],
            [
                5320,
                5341
            ],
            [
                5342,
                5344
            ],
            [
                5350,
                5352
            ],
            [
                5352,
                5384
            ],
            [
                5384,
                5395
            ],
            [
                5395,
                5425
            ],
            [
                5426,
                5482
            ],
            [
                5482,
                5519
            ],
            [
                5519,
                5522
            ],
            [
                5522,
                5535
            ],
            [
                5536,
                5562
            ],
            [
                5568,
                5576
            ],
            [
                5576,
                5578
            ],
            [
                5578,
                5596
            ],
            [
                5596,
                5676
            ],
            [
                5676,
                5688
            ],
            [
                5688,
                5709
            ],
            [
                5709,
                5737
            ],
            [
                5737,
                5762
            ],
            [
                5763,
                5812
            ],
            [
                5812,
                5847
            ],
            [
                5847,
                5969
            ],
            [
                5969,
                6019
            ],
            [
                6020,
                6039
            ],
            [
                6040,
                6061
            ],
            [
                6061,
                6118
            ],
            [
                6118,
                6149
            ],
            [
                6150,
                6153
            ],
            [
                6154,
                6158
            ],
            [
                6164,
                6184
            ],
            [
                6185,
                6217
            ],
            [
                6218,
                6227
            ],
            [
                6228,
                6257
            ],
            [
                6257,
                6259
            ],
            [
                6259,
                6260
            ],
            [
                6260,
                6282
            ],
            [
                6283,
                6285
            ],
            [
                6293,
                6296
            ],
            [
                6304,
                6314
            ],
            [
                6314,
                6316
            ],
            [
                6317,
                6362
            ],
            [
                6362,
                6387
            ],
            [
                6388,
                6436
            ],
            [
                6449,
                6544
            ],
            [
                6557,
                6567
            ],
            [
                6568,
                6588
            ],
            [
                6588,
                6608
            ],
            [
                6609,
                6625
            ],
            [
                6625,
                6735
            ],
            [
                6735,
                6783
            ],
            [
                6788,
                6800
            ],
            [
                6800,
                6801
            ],
            [
                6801,
                6829
            ],
            [
                6829,
                6839
            ],
            [
                6840,
                6863
            ],
            [
                6863,
                6865
            ],
            [
                6874,
                6896
            ],
            [
                6897,
                6915
            ],
            [
                6915,
                6932
            ],
            [
                6933,
                6958
            ],
            [
                6959,
                7051
            ],
            [
                7057,
                7082
            ],
            [
                7088,
                7095
            ],
            [
                7098,
                7108
            ],
            [
                7108,
                7110
            ],
            [
                7110,
                7148
            ],
            [
                7148,
                7164
            ],
            [
                7165,
                7212
            ],
            [
                7213,
                7359
            ],
            [
                7369,
                7395
            ],
            [
                7396,
                7543
            ],
            [
                7549,
                7553
            ],
            [
                7554,
                7642
            ],
            [
                7643,
                7678
            ],
            [
                7679,
                7694
            ],
            [
                7694,
                7696
            ],
            [
                7696,
                7706
            ],
            [
                7707,
                7714
            ],
            [
                7715,
                7771
            ],
            [
                7772,
                7785
            ],
            [
                7785,
                7795
            ],
            [
                7796,
                7856
            ],
            [
                7857,
                7875
            ],
            [
                7876,
                7899
            ],
            [
                7899,
                8002
            ],
            [
                8002,
                8004
            ],
            [
                8004,
                8056
            ],
            [
                8076,
                8085
            ],
            [
                8086,
                8087
            ],
            [
                8088,
                8117
            ],
            [
                8123,
                8131
            ],
            [
                8132,
                8151
            ],
            [
                8151,
                8197
            ],
            [
                8197,
                8253
            ],
            [
                8253,
                8302
            ],
            [
                8302,
                8387
            ],
            [
                8387,
                8439
            ],
            [
                8447,
                8467
            ],
            [
                8468,
                8479
            ],
            [
                8480,
                8501
            ],
            [
                8501,
                8502
            ],
            [
                8503,
                8593
            ],
            [
                8595,
                8601
            ],
            [
                8605,
                8608
            ],
            [
                8609,
                8637
            ],
            [
                8638,
                8672
            ],
            [
                8680,
                8685
            ],
            [
                8686,
                8704
            ],
            [
                8705,
                8718
            ],
            [
                8719,
                8732
            ],
            [
                8732,
                8745
            ],
            [
                8770,
                8772
            ],
            [
                8772,
                8781
            ],
            [
                8781,
                8802
            ],
            [
                8802,
                8848
            ],
            [
                8848,
                8855
            ],
            [
                8856,
                8875
            ],
            [
                8875,
                8879
            ],
            [
                8879,
                8881
            ],
            [
                8881,
                8929
            ],
            [
                8929,
                8932
            ],
            [
                8933,
                9017
            ],
            [
                9017,
                9088
            ],
            [
                9088,
                9093
            ],
            [
                9094,
                9116
            ],
            [
                9117,
                9118
            ],
            [
                9119,
                9150
            ],
            [
                9150,
                9158
            ],
            [
                9159,
                9175
            ],
            [
                9175,
                9184
            ],
            [
                9185,
                9189
            ],
            [
                9190,
                9231
            ],
            [
                9232,
                9236
            ],
            [
                9243,
                9256
            ],
            [
                9256,
                9309
            ],
            [
                9309,
                9310
            ],
            [
                9310,
                9315
            ],
            [
                9316,
                9333
            ],
            [
                9333,
                9348
            ],
            [
                9349,
                9354
            ],
            [
                9355,
                9383
            ],
            [
                9384,
                9387
            ],
            [
                9388,
                9392
            ],
            [
                9393,
                9398
            ],
            [
                9398,
                9415
            ],
            [
                9415,
                9453
            ],
            [
                9453,
                9495
            ],
            [
                9496,
                9558
            ],
            [
                9558,
                9583
            ],
            [
                9583,
                9587
            ],
            [
                9588,
                9595
            ],
            [
                9596,
                9630
            ],
            [
                9634,
                9642
            ],
            [
                9644,
                9692
            ],
            [
                9692,
                9709
            ],
            [
                9713,
                9720
            ],
            [
                9729,
                9790
            ],
            [
                9791,
                9823
            ],
            [
                9824,
                9826
            ],
            [
                9827,
                9833
            ],
            [
                9833,
                9835
            ],
            [
                9835,
                9841
            ],
            [
                9842,
                9854
            ],
            [
                9855,
                9861
            ],
            [
                9862,
                9869
            ],
            [
                9872,
                9873
            ],
            [
                9873,
                9876
            ],
            [
                9882,
                9923
            ],
            [
                9924,
                9929
            ],
            [
                9930,
                9942
            ],
            [
                9942,
                9971
            ],
            [
                9972,
                9993
            ],
            [
                9995,
                10057
            ],
            [
                10058,
                10076
            ],
            [
                10077,
                10127
            ],
            [
                10127,
                10177
            ],
            [
                10177,
                10178
            ],
            [
                10178,
                10181
            ],
            [
                10182,
                10205
            ],
            [
                10206,
                10207
            ],
            [
                10208,
                10245
            ],
            [
                10245,
                10311
            ],
            [
                10312,
                10366
            ],
            [
                10366,
                10368
            ],
            [
                10369,
                10433
            ],
            [
                10433,
                10451
            ],
            [
                10452,
                10534
            ],
            [
                10534,
                10570
            ],
            [
                10576,
                10579
            ],
            [
                10580,
                10594
            ],
            [
                10607,
                10610
            ],
            [
                10611,
                10660
            ],
            [
                10660,
                10723
            ],
            [
                10723,
                10737
            ],
            [
                10738,
                10757
            ],
            [
                10757,
                10888
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                10977
            ],
            [
                10978,
                11009
            ],
            [
                11009,
                11054
            ],
            [
                11054,
                11121
            ],
            [
                11128,
                11141
            ],
            [
                11142,
                11181
            ],
            [
                11181,
                11222
            ],
            [
                11222,
                11227
            ],
            [
                11228,
                11246
            ],
            [
                11246,
                11266
            ],
            [
                11266,
                11284
            ],
            [
                11284,
                11302
            ],
            [
                11302,
                11363
            ],
            [
                11363,
                11418
            ],
            [
                11425,
                11467
            ],
            [
                11467,
                11470
            ],
            [
                11470,
                11483
            ],
            [
                11483,
                11530
            ],
            [
                11530,
                11656
            ],
            [
                11665,
                11674
            ],
            [
                11674,
                11675
            ],
            [
                11676,
                11683
            ],
            [
                11692,
                11694
            ],
            [
                11694,
                11715
            ],
            [
                11715,
                11867
            ],
            [
                11868,
                11918
            ],
            [
                11918,
                12019
            ],
            [
                12019,
                12050
            ],
            [
                12050,
                12146
            ],
            [
                12146,
                12186
            ],
            [
                12186,
                12207
            ],
            [
                12208,
                12229
            ],
            [
                12230,
                12276
            ],
            [
                12277,
                12315
            ],
            [
                12315,
                12349
            ],
            [
                12350,
                12419
            ],
            [
                12419,
                12440
            ],
            [
                12441,
                12524
            ],
            [
                12525,
                12538
            ],
            [
                12538,
                12642
            ],
            [
                12642,
                12669
            ],
            [
                12669,
                12685
            ],
            [
                12688,
                12693
            ],
            [
                12693,
                12732
            ],
            [
                12732,
                12735
            ],
            [
                12736,
                12743
            ],
            [
                12748,
                12763
            ],
            [
                12764,
                12772
            ],
            [
                12773,
                12796
            ],
            [
                12797,
                12804
            ],
            [
                12804,
                12851
            ],
            [
                12852,
                12892
            ],
            [
                12892,
                13016
            ],
            [
                13016,
                13021
            ],
            [
                13021,
                13174
            ],
            [
                13175,
                13207
            ],
            [
                13207,
                13210
            ],
            [
                13210,
                13295
            ],
            [
                13295,
                13345
            ],
            [
                13345,
                13350
            ],
            [
                13350,
                13384
            ],
            [
                13384,
                13422
            ],
            [
                13425,
                13436
            ],
            [
                13437,
                13514
            ],
            [
                13515,
                13530
            ],
            [
                13531,
                13543
            ],
            [
                13556,
                13557
            ],
            [
                13558,
                13565
            ],
            [
                13565,
                13566
            ],
            [
                13567,
                13587
            ],
            [
                13588,
                13623
            ],
            [
                13623,
                13675
            ],
            [
                13675,
                13710
            ],
            [
                13710,
                13786
            ],
            [
                13786,
                13868
            ],
            [
                13868,
                13937
            ],
            [
                13937,
                13938
            ],
            [
                13938,
                13942
            ],
            [
                13943,
                13970
            ],
            [
                13977,
                13996
            ],
            [
                13996,
                14003
            ],
            [
                14015,
                14060
            ],
            [
                14060,
                14061
            ],
            [
                14080,
                14088
            ],
            [
                14092,
                14101
            ],
            [
                14101,
                14123
            ],
            [
                14124,
                14139
            ],
            [
                14140,
                14314
            ],
            [
                14314,
                14319
            ],
            [
                14320,
                14413
            ],
            [
                14413,
                14471
            ],
            [
                14471,
                14530
            ],
            [
                14530,
                14587
            ],
            [
                14587,
                14634
            ],
            [
                14634,
                14682
            ],
            [
                14682,
                14781
            ],
            [
                14781,
                14812
            ],
            [
                14812,
                14839
            ],
            [
                14840,
                14866
            ],
            [
                14871,
                14905
            ],
            [
                14905,
                14908
            ],
            [
                14908,
                14934
            ],
            [
                14934,
                14935
            ],
            [
                14936,
                14941
            ],
            [
                14942,
                14946
            ],
            [
                14947,
                14963
            ],
            [
                14963,
                14965
            ],
            [
                14966,
                14983
            ],
            [
                14984,
                14993
            ],
            [
                14993,
                15016
            ],
            [
                15018,
                15049
            ],
            [
                15073,
                15081
            ],
            [
                15081,
                15083
            ],
            [
                15083,
                15090
            ],
            [
                15091,
                15095
            ],
            [
                15096,
                15102
            ],
            [
                15103,
                15178
            ],
            [
                15178,
                15209
            ],
            [
                15210,
                15213
            ],
            [
                15214,
                15256
            ],
            [
                15257,
                15286
            ],
            [
                15287,
                15356
            ],
            [
                15364,
                15366
            ],
            [
                15366,
                15382
            ],
            [
                15393,
                15406
            ],
            [
                15408,
                15487
            ],
            [
                15488,
                15522
            ],
            [
                15522,
                15619
            ]
        ],
        "row_chars": [
            [
                0,
                71
            ],
            [
                71,
                204
            ],
            [
                204,
                329
            ],
            [
                329,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                372
            ],
            [
                372,
                435
            ],
            [
                435,
                710
            ],
            [
                710,
                829
            ],
            [
                829,
                1258
            ],
            [
                1258,
                1375
            ],
            [
                1375,
                1484
            ],
            [
                1484,
                1543
            ],
            [
                1543,
                1557
            ],
            [
                1557,
                1757
            ],
            [
                1757,
                1806
            ],
            [
                1806,
                1840
            ],
            [
                1840,
                1884
            ],
            [
                1884,
                1932
            ],
            [
                1932,
                1987
            ],
            [
                1987,
                1987
            ],
            [
                1987,
                2087
            ],
            [
                2087,
                2140
            ],
            [
                2140,
                2140
            ],
            [
                2140,
                2232
            ],
            [
                2232,
                2310
            ],
            [
                2310,
                2369
            ],
            [
                2369,
                2487
            ],
            [
                2487,
                2573
            ],
            [
                2573,
                2573
            ],
            [
                2573,
                2650
            ],
            [
                2650,
                2650
            ],
            [
                2650,
                2697
            ],
            [
                2697,
                2769
            ],
            [
                2769,
                2819
            ],
            [
                2819,
                2995
            ],
            [
                2995,
                3062
            ],
            [
                3062,
                3062
            ],
            [
                3062,
                3130
            ],
            [
                3130,
                3195
            ],
            [
                3195,
                3247
            ],
            [
                3247,
                3347
            ],
            [
                3347,
                3563
            ],
            [
                3563,
                3601
            ],
            [
                3601,
                3792
            ],
            [
                3792,
                3872
            ],
            [
                3872,
                4065
            ],
            [
                4065,
                4088
            ],
            [
                4088,
                4171
            ],
            [
                4171,
                4307
            ],
            [
                4307,
                4381
            ],
            [
                4381,
                4456
            ],
            [
                4456,
                4652
            ],
            [
                4652,
                4652
            ],
            [
                4652,
                4803
            ],
            [
                4803,
                4963
            ],
            [
                4963,
                5047
            ],
            [
                5047,
                5089
            ],
            [
                5089,
                5221
            ],
            [
                5221,
                5352
            ],
            [
                5352,
                5384
            ],
            [
                5384,
                5482
            ],
            [
                5482,
                5522
            ],
            [
                5522,
                5578
            ],
            [
                5578,
                5596
            ],
            [
                5596,
                5676
            ],
            [
                5676,
                5688
            ],
            [
                5688,
                5737
            ],
            [
                5737,
                5812
            ],
            [
                5812,
                5969
            ],
            [
                5969,
                6061
            ],
            [
                6061,
                6118
            ],
            [
                6118,
                6259
            ],
            [
                6259,
                6316
            ],
            [
                6316,
                6362
            ],
            [
                6362,
                6625
            ],
            [
                6625,
                6735
            ],
            [
                6735,
                6800
            ],
            [
                6800,
                6865
            ],
            [
                6865,
                6865
            ],
            [
                6865,
                6865
            ],
            [
                6865,
                6865
            ],
            [
                6865,
                6865
            ],
            [
                6865,
                6865
            ],
            [
                6865,
                6915
            ],
            [
                6915,
                7110
            ],
            [
                7110,
                7148
            ],
            [
                7148,
                7396
            ],
            [
                7396,
                7696
            ],
            [
                7696,
                7785
            ],
            [
                7785,
                8004
            ],
            [
                8004,
                8151
            ],
            [
                8151,
                8197
            ],
            [
                8197,
                8253
            ],
            [
                8253,
                8302
            ],
            [
                8302,
                8387
            ],
            [
                8387,
                8501
            ],
            [
                8501,
                8732
            ],
            [
                8732,
                8772
            ],
            [
                8772,
                8848
            ],
            [
                8848,
                8875
            ],
            [
                8875,
                8881
            ],
            [
                8881,
                8932
            ],
            [
                8932,
                8932
            ],
            [
                8932,
                9017
            ],
            [
                9017,
                9088
            ],
            [
                9088,
                9150
            ],
            [
                9150,
                9175
            ],
            [
                9175,
                9256
            ],
            [
                9256,
                9309
            ],
            [
                9309,
                9333
            ],
            [
                9333,
                9415
            ],
            [
                9415,
                9453
            ],
            [
                9453,
                9558
            ],
            [
                9558,
                9583
            ],
            [
                9583,
                9644
            ],
            [
                9644,
                9692
            ],
            [
                9692,
                9692
            ],
            [
                9692,
                9835
            ],
            [
                9835,
                9872
            ],
            [
                9872,
                9872
            ],
            [
                9872,
                9942
            ],
            [
                9942,
                9995
            ],
            [
                9995,
                10127
            ],
            [
                10127,
                10177
            ],
            [
                10177,
                10245
            ],
            [
                10245,
                10311
            ],
            [
                10311,
                10311
            ],
            [
                10311,
                10366
            ],
            [
                10366,
                10433
            ],
            [
                10433,
                10660
            ],
            [
                10660,
                10723
            ],
            [
                10723,
                10757
            ],
            [
                10757,
                10757
            ],
            [
                10757,
                10888
            ],
            [
                10888,
                10938
            ],
            [
                10938,
                11009
            ],
            [
                11009,
                11054
            ],
            [
                11054,
                11181
            ],
            [
                11181,
                11222
            ],
            [
                11222,
                11246
            ],
            [
                11246,
                11266
            ],
            [
                11266,
                11284
            ],
            [
                11284,
                11302
            ],
            [
                11302,
                11363
            ],
            [
                11363,
                11470
            ],
            [
                11470,
                11530
            ],
            [
                11530,
                11674
            ],
            [
                11674,
                11694
            ],
            [
                11694,
                11715
            ],
            [
                11715,
                11918
            ],
            [
                11918,
                12019
            ],
            [
                12019,
                12050
            ],
            [
                12050,
                12146
            ],
            [
                12146,
                12186
            ],
            [
                12186,
                12315
            ],
            [
                12315,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12419
            ],
            [
                12419,
                12538
            ],
            [
                12538,
                12642
            ],
            [
                12642,
                12669
            ],
            [
                12669,
                12688
            ],
            [
                12688,
                12693
            ],
            [
                12693,
                12732
            ],
            [
                12732,
                12804
            ],
            [
                12804,
                12892
            ],
            [
                12892,
                13016
            ],
            [
                13016,
                13021
            ],
            [
                13021,
                13210
            ],
            [
                13210,
                13295
            ],
            [
                13295,
                13345
            ],
            [
                13345,
                13350
            ],
            [
                13350,
                13384
            ],
            [
                13384,
                13425
            ],
            [
                13425,
                13425
            ],
            [
                13425,
                13623
            ],
            [
                13623,
                13710
            ],
            [
                13710,
                13710
            ],
            [
                13710,
                13786
            ],
            [
                13786,
                13868
            ],
            [
                13868,
                13937
            ],
            [
                13937,
                13996
            ],
            [
                13996,
                14060
            ],
            [
                14060,
                14314
            ],
            [
                14314,
                14413
            ],
            [
                14413,
                14530
            ],
            [
                14530,
                14587
            ],
            [
                14587,
                14634
            ],
            [
                14634,
                14682
            ],
            [
                14682,
                14781
            ],
            [
                14781,
                14812
            ],
            [
                14812,
                14908
            ],
            [
                14908,
                14963
            ],
            [
                14963,
                14993
            ],
            [
                14993,
                15083
            ],
            [
                15083,
                15178
            ],
            [
                15178,
                15287
            ],
            [
                15287,
                15366
            ],
            [
                15366,
                15522
            ],
            [
                15522,
                15619
            ]
        ]
    }
}