{
    "original": {
        "text": "A quarter of an hour, twenty minutes, passed away, and Fanny was still thinking of Edmund, Miss Crawford, and herself, without interruption from any one. She began to be surprised at being left so long, and to listen with an anxious desire of hearing their steps and their voices again. She listened, and at length she heard; she heard voices and feet approaching; but she had just satisfied herself that it was not those she wanted, when Miss Bertram, Mr. Rushworth, and Mr. Crawford issued from the same path which she had trod herself, and were before her.\n\"Miss Price all alone\" and \"My dear Fanny, how comes this?\" were the first salutations. She told her story. \"Poor dear Fanny,\" cried her cousin, \"how ill you have been used by them! You had better have staid with us.\"\nThen seating herself with a gentleman on each side, she resumed the conversation which had engaged them before, and discussed the possibility of improvements with much animation. Nothing was fixed on; but Henry Crawford was full of ideas and projects, and, generally speaking, whatever he proposed was immediately approved, first by her, and then by Mr. Rushworth, whose principal business seemed to be to hear the others, and who scarcely risked an original thought of his own beyond a wish that they had seen his friend Smith's place.\nAfter some minutes spent in this way, Miss Bertram, observing the iron gate, expressed a wish of passing through it into the park, that their views and their plans might be more comprehensive. It was the very thing of all others to be wished, it was the best, it was the only way of proceeding with any advantage, in Henry Crawford's opinion; and he directly saw a knoll not half a mile off, which would give them exactly the requisite command of the house. Go therefore they must to that knoll, and through that gate; but the gate was locked. Mr. Rushworth wished he had brought the key; he had been very near thinking whether he should not bring the key; he was determined he would never come without the key again; but still this did not remove the present evil. They could not get through; and as Miss Bertram's inclination for so doing did by no means lessen, it ended in Mr. Rushworth's declaring outright that he would go and fetch the key. He set off accordingly.\n\"It is undoubtedly the best thing we can do now, as we are so far from the house already,\" said Mr. Crawford, when he was gone.\n\"Yes, there is nothing else to be done. But now, sincerely, do not you find the place altogether worse than you expected?\"\n\"No, indeed, far otherwise. I find it better, grander, more complete in its style, though that style may not be the best. And to tell you the truth,\" speaking rather lower, \"I do not think that _I_ shall ever see Sotherton again with so much pleasure as I do now. Another summer will hardly improve it to me.\"\nAfter a moment's embarrassment the lady replied, \"You are too much a man of the world not to see with the eyes of the world. If other people think Sotherton improved, I have no doubt that you will.\"\n\"I am afraid I am not quite so much the man of the world as might be good for me in some points. My feelings are not quite so evanescent, nor my memory of the past under such easy dominion as one finds to be the case with men of the world.\"\nThis was followed by a short silence. Miss Bertram began again. \"You seemed to enjoy your drive here very much this morning. I was glad to see you so well entertained. You and Julia were laughing the whole way.\"\n\"Were we? Yes, I believe we were; but I have not the least recollection at what. Oh! I believe I was relating to her some ridiculous stories of an old Irish groom of my uncle's. Your sister loves to laugh.\"\n\"You think her more light-hearted than I am?\"\n\"More easily amused,\" he replied; \"consequently, you know,\" smiling, \"better company. I could not have hoped to entertain you with Irish anecdotes during a ten miles' drive.\"\n\"Naturally, I believe, I am as lively as Julia, but I have more to think of now.\"\n\"You have, undoubtedly; and there are situations in which very high spirits would denote insensibility. Your prospects, however, are too fair to justify want of spirits. You have a very smiling scene before you.\"\n\"Do you mean literally or figuratively? Literally, I conclude. Yes, certainly, the sun shines, and the park looks very cheerful. But unluckily that iron gate, that ha-ha, give me a feeling of restraint and hardship. 'I cannot get out,' as the starling said.\" As she spoke, and it was with expression, she walked to the gate: he followed her. \"Mr. Rushworth is so long fetching this key!\"\n\"And for the world you would not get out without the key and without Mr. Rushworth's authority and protection, or I think you might with little difficulty pass round the edge of the gate, here, with my assistance; I think it might be done, if you really wished to be more at large, and could allow yourself to think it not prohibited.\"\n\"Prohibited! nonsense! I certainly can get out that way, and I will. Mr. Rushworth will be here in a moment, you know; we shall not be out of sight.\"\n\"Or if we are, Miss Price will be so good as to tell him that he will find us near that knoll: the grove of oak on the knoll.\"\nFanny, feeling all this to be wrong, could not help making an effort to prevent it. \"You will hurt yourself, Miss Bertram,\" she cried; \"you will certainly hurt yourself against those spikes; you will tear your gown; you will be in danger of slipping into the ha-ha. You had better not go.\"\nHer cousin was safe on the other side while these words were spoken, and, smiling with all the good-humour of success, she said, \"Thank you, my dear Fanny, but I and my gown are alive and well, and so good-bye.\"\nFanny was again left to her solitude, and with no increase of pleasant feelings, for she was sorry for almost all that she had seen and heard, astonished at Miss Bertram, and angry with Mr. Crawford. By taking a circuitous, and, as it appeared to her, very unreasonable direction to the knoll, they were soon beyond her eye; and for some minutes longer she remained without sight or sound of any companion. She seemed to have the little wood all to herself. She could almost have thought that Edmund and Miss Crawford had left it, but that it was impossible for Edmund to forget her so entirely.\nShe was again roused from disagreeable musings by sudden footsteps: somebody was coming at a quick pace down the principal walk. She expected Mr. Rushworth, but it was Julia, who, hot and out of breath, and with a look of disappointment, cried out on seeing her, \"Heyday! Where are the others? I thought Maria and Mr. Crawford were with you.\"\nFanny explained.\n\"A pretty trick, upon my word! I cannot see them anywhere,\" looking eagerly into the park. \"But they cannot be very far off, and I think I am equal to as much as Maria, even without help.\"\n\"But, Julia, Mr. Rushworth will be here in a moment with the key. Do wait for Mr. Rushworth.\"\n\"Not I, indeed. I have had enough of the family for one morning. Why, child, I have but this moment escaped from his horrible mother. Such a penance as I have been enduring, while you were sitting here so composed and so happy! It might have been as well, perhaps, if you had been in my place, but you always contrive to keep out of these scrapes.\"\nThis was a most unjust reflection, but Fanny could allow for it, and let it pass: Julia was vexed, and her temper was hasty; but she felt that it would not last, and therefore, taking no notice, only asked her if she had not seen Mr. Rushworth.\n\"Yes, yes, we saw him. He was posting away as if upon life and death, and could but just spare time to tell us his errand, and where you all were.\"\n\"It is a pity he should have so much trouble for nothing.\"\n\"_That_ is Miss Maria's concern. I am not obliged to punish myself for _her_ sins. The mother I could not avoid, as long as my tiresome aunt was dancing about with the housekeeper, but the son I _can_ get away from.\"\nAnd she immediately scrambled across the fence, and walked away, not attending to Fanny's last question of whether she had seen anything of Miss Crawford and Edmund. The sort of dread in which Fanny now sat of seeing Mr. Rushworth prevented her thinking so much of their continued absence, however, as she might have done. She felt that he had been very ill-used, and was quite unhappy in having to communicate what had passed. He joined her within five minutes after Julia's exit; and though she made the best of the story, he was evidently mortified and displeased in no common degree. At first he scarcely said anything; his looks only expressed his extreme surprise and vexation, and he walked to the gate and stood there, without seeming to know what to do.\n\"They desired me to stay-my cousin Maria charged me to say that you would find them at that knoll, or thereabouts.\"\n\"I do not believe I shall go any farther,\" said he sullenly; \"I see nothing of them. By the time I get to the knoll they may be gone somewhere else. I have had walking enough.\"\nAnd he sat down with a most gloomy countenance by Fanny.\n\"I am very sorry,\" said she; \"it is very unlucky.\" And she longed to be able to say something more to the purpose.\nAfter an interval of silence, \"I think they might as well have staid for me,\" said he.\n\"Miss Bertram thought you would follow her.\"\n\"I should not have had to follow her if she had staid.\"\nThis could not be denied, and Fanny was silenced. After another pause, he went on-\"Pray, Miss Price, are you such a great admirer of this Mr. Crawford as some people are? For my part, I can see nothing in him.\"\n\"I do not think him at all handsome.\"\n\"Handsome! Nobody can call such an undersized man handsome. He is not five foot nine. I should not wonder if he is not more than five foot eight. I think he is an ill-looking fellow. In my opinion, these Crawfords are no addition at all. We did very well without them.\"\nA small sigh escaped Fanny here, and she did not know how to contradict him.\n\"If I had made any difficulty about fetching the key, there might have been some excuse, but I went the very moment she said she wanted it.\"\n\"Nothing could be more obliging than your manner, I am sure, and I dare say you walked as fast as you could; but still it is some distance, you know, from this spot to the house, quite into the house; and when people are waiting, they are bad judges of time, and every half minute seems like five.\"\nHe got up and walked to the gate again, and \"wished he had had the key about him at the time.\" Fanny thought she discerned in his standing there an indication of relenting, which encouraged her to another attempt, and she said, therefore, \"It is a pity you should not join them. They expected to have a better view of the house from that part of the park, and will be thinking how it may be improved; and nothing of that sort, you know, can be settled without you.\"\nShe found herself more successful in sending away than in retaining a companion. Mr. Rushworth was worked on. \"Well,\" said he, \"if you really think I had better go: it would be foolish to bring the key for nothing.\" And letting himself out, he walked off without farther ceremony.\nFanny's thoughts were now all engrossed by the two who had left her so long ago, and getting quite impatient, she resolved to go in search of them. She followed their steps along the bottom walk, and had just turned up into another, when the voice and the laugh of Miss Crawford once more caught her ear; the sound approached, and a few more windings brought them before her. They were just returned into the wilderness from the park, to which a sidegate, not fastened, had tempted them very soon after their leaving her, and they had been across a portion of the park into the very avenue which Fanny had been hoping the whole morning to reach at last, and had been sitting down under one of the trees. This was their history. It was evident that they had been spending their time pleasantly, and were not aware of the length of their absence. Fanny's best consolation was in being assured that Edmund had wished for her very much, and that he should certainly have come back for her, had she not been tired already; but this was not quite sufficient to do away with the pain of having been left a whole hour, when he had talked of only a few minutes, nor to banish the sort of curiosity she felt to know what they had been conversing about all that time; and the result of the whole was to her disappointment and depression, as they prepared by general agreement to return to the house.\nOn reaching the bottom of the steps to the terrace, Mrs. Rushworth and Mrs. Norris presented themselves at the top, just ready for the wilderness, at the end of an hour and a half from their leaving the house. Mrs. Norris had been too well employed to move faster. Whatever cross-accidents had occurred to intercept the pleasures of her nieces, she had found a morning of complete enjoyment; for the housekeeper, after a great many courtesies on the subject of pheasants, had taken her to the dairy, told her all about their cows, and given her the receipt for a famous cream cheese; and since Julia's leaving them they had been met by the gardener, with whom she had made a most satisfactory acquaintance, for she had set him right as to his grandson's illness, convinced him that it was an ague, and promised him a charm for it; and he, in return, had shewn her all his choicest nursery of plants, and actually presented her with a very curious specimen of heath.\nOn this _rencontre_ they all returned to the house together, there to lounge away the time as they could with sofas, and chit-chat, and Quarterly Reviews, till the return of the others, and the arrival of dinner. It was late before the Miss Bertrams and the two gentlemen came in, and their ramble did not appear to have been more than partially agreeable, or at all productive of anything useful with regard to the object of the day. By their own accounts they had been all walking after each other, and the junction which had taken place at last seemed, to Fanny's observation, to have been as much too late for re-establishing harmony, as it confessedly had been for determining on any alteration. She felt, as she looked at Julia and Mr. Rushworth, that hers was not the only dissatisfied bosom amongst them: there was gloom on the face of each. Mr. Crawford and Miss Bertram were much more gay, and she thought that he was taking particular pains, during dinner, to do away any little resentment of the other two, and restore general good-humour.\nDinner was soon followed by tea and coffee, a ten miles' drive home allowed no waste of hours; and from the time of their sitting down to table, it was a quick succession of busy nothings till the carriage came to the door, and Mrs. Norris, having fidgeted about, and obtained a few pheasants' eggs and a cream cheese from the housekeeper, and made abundance of civil speeches to Mrs. Rushworth, was ready to lead the way. At the same moment Mr. Crawford, approaching Julia, said, \"I hope I am not to lose my companion, unless she is afraid of the evening air in so exposed a seat.\" The request had not been foreseen, but was very graciously received, and Julia's day was likely to end almost as well as it began. Miss Bertram had made up her mind to something different, and was a little disappointed; but her conviction of being really the one preferred comforted her under it, and enabled her to receive Mr. Rushworth's parting attentions as she ought. He was certainly better pleased to hand her into the barouche than to assist her in ascending the box, and his complacency seemed confirmed by the arrangement.\n\"Well, Fanny, this has been a fine day for you, upon my word,\" said Mrs. Norris, as they drove through the park. \"Nothing but pleasure from beginning to end! I am sure you ought to be very much obliged to your aunt Bertram and me for contriving to let you go. A pretty good day's amusement you have had!\"\nMaria was just discontented enough to say directly, \"I think _you_ have done pretty well yourself, ma'am. Your lap seems full of good things, and here is a basket of something between us which has been knocking my elbow unmercifully.\"\n\"My dear, it is only a beautiful little heath, which that nice old gardener would make me take; but if it is in your way, I will have it in my lap directly. There, Fanny, you shall carry that parcel for me; take great care of it: do not let it fall; it is a cream cheese, just like the excellent one we had at dinner. Nothing would satisfy that good old Mrs. Whitaker, but my taking one of the cheeses. I stood out as long as I could, till the tears almost came into her eyes, and I knew it was just the sort that my sister would be delighted with. That Mrs. Whitaker is a treasure! She was quite shocked when I asked her whether wine was allowed at the second table, and she has turned away two housemaids for wearing white gowns. Take care of the cheese, Fanny. Now I can manage the other parcel and the basket very well.\"\n\"What else have you been spunging?\" said Maria, half-pleased that Sotherton should be so complimented.\n\"Spunging, my dear! It is nothing but four of those beautiful pheasants' eggs, which Mrs. Whitaker would quite force upon me: she would not take a denial. She said it must be such an amusement to me, as she understood I lived quite alone, to have a few living creatures of that sort; and so to be sure it will. I shall get the dairymaid to set them under the first spare hen, and if they come to good I can have them moved to my own house and borrow a coop; and it will be a great delight to me in my lonely hours to attend to them. And if I have good luck, your mother shall have some.\"\nIt was a beautiful evening, mild and still, and the drive was as pleasant as the serenity of Nature could make it; but when Mrs. Norris ceased speaking, it was altogether a silent drive to those within. Their spirits were in general exhausted; and to determine whether the day had afforded most pleasure or pain, might occupy the meditations of almost all.",
        "paragraph_chars": [
            [
                0,
                560
            ],
            [
                560,
                778
            ],
            [
                778,
                1315
            ],
            [
                1315,
                2287
            ],
            [
                2287,
                2415
            ],
            [
                2415,
                2538
            ],
            [
                2538,
                2848
            ],
            [
                2848,
                3047
            ],
            [
                3047,
                3288
            ],
            [
                3288,
                3500
            ],
            [
                3500,
                3707
            ],
            [
                3707,
                3753
            ],
            [
                3753,
                3928
            ],
            [
                3928,
                4010
            ],
            [
                4010,
                4223
            ],
            [
                4223,
                4611
            ],
            [
                4611,
                4947
            ],
            [
                4947,
                5097
            ],
            [
                5097,
                5224
            ],
            [
                5224,
                5514
            ],
            [
                5514,
                5726
            ],
            [
                5726,
                6322
            ],
            [
                6322,
                6665
            ],
            [
                6665,
                6682
            ],
            [
                6682,
                6871
            ],
            [
                6871,
                6965
            ],
            [
                6965,
                7314
            ],
            [
                7314,
                7559
            ],
            [
                7559,
                7707
            ],
            [
                7707,
                7766
            ],
            [
                7766,
                7983
            ],
            [
                7983,
                8746
            ],
            [
                8746,
                8862
            ],
            [
                8862,
                9039
            ],
            [
                9039,
                9096
            ],
            [
                9096,
                9211
            ],
            [
                9211,
                9298
            ],
            [
                9298,
                9343
            ],
            [
                9343,
                9399
            ],
            [
                9399,
                9610
            ],
            [
                9610,
                9648
            ],
            [
                9648,
                9918
            ],
            [
                9918,
                9995
            ],
            [
                9995,
                10136
            ],
            [
                10136,
                10435
            ],
            [
                10435,
                10901
            ],
            [
                10901,
                11182
            ],
            [
                11182,
                12571
            ],
            [
                12571,
                13537
            ],
            [
                13537,
                14589
            ],
            [
                14589,
                15705
            ],
            [
                15705,
                16010
            ],
            [
                16010,
                16245
            ],
            [
                16245,
                17070
            ],
            [
                17070,
                17173
            ],
            [
                17173,
                17761
            ],
            [
                17761,
                18117
            ]
        ],
        "segment_chars": [
            [
                0,
                154
            ],
            [
                154,
                287
            ],
            [
                287,
                560
            ],
            [
                560,
                620
            ],
            [
                620,
                648
            ],
            [
                648,
                668
            ],
            [
                668,
                742
            ],
            [
                742,
                778
            ],
            [
                778,
                957
            ],
            [
                957,
                1315
            ],
            [
                1315,
                1508
            ],
            [
                1508,
                1773
            ],
            [
                1773,
                1859
            ],
            [
                1859,
                2081
            ],
            [
                2081,
                2263
            ],
            [
                2263,
                2287
            ],
            [
                2287,
                2415
            ],
            [
                2415,
                2455
            ],
            [
                2455,
                2538
            ],
            [
                2538,
                2566
            ],
            [
                2566,
                2660
            ],
            [
                2660,
                2802
            ],
            [
                2802,
                2848
            ],
            [
                2848,
                2973
            ],
            [
                2973,
                3047
            ],
            [
                3047,
                3144
            ],
            [
                3144,
                3288
            ],
            [
                3288,
                3326
            ],
            [
                3326,
                3352
            ],
            [
                3352,
                3413
            ],
            [
                3413,
                3456
            ],
            [
                3456,
                3500
            ],
            [
                3500,
                3510
            ],
            [
                3510,
                3581
            ],
            [
                3581,
                3585
            ],
            [
                3585,
                3678
            ],
            [
                3678,
                3707
            ],
            [
                3707,
                3753
            ],
            [
                3753,
                3839
            ],
            [
                3839,
                3928
            ],
            [
                3928,
                4010
            ],
            [
                4010,
                4114
            ],
            [
                4114,
                4180
            ],
            [
                4180,
                4223
            ],
            [
                4223,
                4263
            ],
            [
                4263,
                4286
            ],
            [
                4286,
                4352
            ],
            [
                4352,
                4439
            ],
            [
                4439,
                4482
            ],
            [
                4482,
                4565
            ],
            [
                4565,
                4611
            ],
            [
                4611,
                4947
            ],
            [
                4947,
                4960
            ],
            [
                4960,
                4970
            ],
            [
                4970,
                5016
            ],
            [
                5016,
                5097
            ],
            [
                5097,
                5224
            ],
            [
                5224,
                5308
            ],
            [
                5308,
                5490
            ],
            [
                5490,
                5514
            ],
            [
                5514,
                5726
            ],
            [
                5726,
                5926
            ],
            [
                5926,
                6133
            ],
            [
                6133,
                6184
            ],
            [
                6184,
                6322
            ],
            [
                6322,
                6451
            ],
            [
                6451,
                6594
            ],
            [
                6594,
                6616
            ],
            [
                6616,
                6665
            ],
            [
                6665,
                6682
            ],
            [
                6682,
                6713
            ],
            [
                6713,
                6773
            ],
            [
                6773,
                6871
            ],
            [
                6871,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                6981
            ],
            [
                6981,
                7030
            ],
            [
                7030,
                7099
            ],
            [
                7099,
                7193
            ],
            [
                7193,
                7314
            ],
            [
                7314,
                7559
            ],
            [
                7559,
                7582
            ],
            [
                7582,
                7707
            ],
            [
                7707,
                7766
            ],
            [
                7766,
                7799
            ],
            [
                7799,
                7849
            ],
            [
                7849,
                7983
            ],
            [
                7983,
                8149
            ],
            [
                8149,
                8306
            ],
            [
                8306,
                8411
            ],
            [
                8411,
                8571
            ],
            [
                8571,
                8746
            ],
            [
                8746,
                8862
            ],
            [
                8862,
                8947
            ],
            [
                8947,
                9011
            ],
            [
                9011,
                9039
            ],
            [
                9039,
                9096
            ],
            [
                9096,
                9147
            ],
            [
                9147,
                9211
            ],
            [
                9211,
                9298
            ],
            [
                9298,
                9343
            ],
            [
                9343,
                9399
            ],
            [
                9399,
                9449
            ],
            [
                9449,
                9570
            ],
            [
                9570,
                9610
            ],
            [
                9610,
                9648
            ],
            [
                9648,
                9659
            ],
            [
                9659,
                9708
            ],
            [
                9708,
                9734
            ],
            [
                9734,
                9794
            ],
            [
                9794,
                9831
            ],
            [
                9831,
                9886
            ],
            [
                9886,
                9918
            ],
            [
                9918,
                9995
            ],
            [
                9995,
                10136
            ],
            [
                10136,
                10435
            ],
            [
                10435,
                10530
            ],
            [
                10530,
                10714
            ],
            [
                10714,
                10901
            ],
            [
                10901,
                10982
            ],
            [
                10982,
                11011
            ],
            [
                11011,
                11117
            ],
            [
                11117,
                11182
            ],
            [
                11182,
                11330
            ],
            [
                11330,
                11558
            ],
            [
                11558,
                11886
            ],
            [
                11886,
                11910
            ],
            [
                11910,
                12027
            ],
            [
                12027,
                12571
            ],
            [
                12571,
                12781
            ],
            [
                12781,
                12836
            ],
            [
                12836,
                13537
            ],
            [
                13537,
                13750
            ],
            [
                13750,
                13972
            ],
            [
                13972,
                14238
            ],
            [
                14238,
                14387
            ],
            [
                14387,
                14589
            ],
            [
                14589,
                15012
            ],
            [
                15012,
                15172
            ],
            [
                15172,
                15303
            ],
            [
                15303,
                15545
            ],
            [
                15545,
                15705
            ],
            [
                15705,
                15818
            ],
            [
                15818,
                15863
            ],
            [
                15863,
                15965
            ],
            [
                15965,
                16010
            ],
            [
                16010,
                16116
            ],
            [
                16116,
                16245
            ],
            [
                16245,
                16402
            ],
            [
                16402,
                16563
            ],
            [
                16563,
                16648
            ],
            [
                16648,
                16794
            ],
            [
                16794,
                16828
            ],
            [
                16828,
                16977
            ],
            [
                16977,
                17009
            ],
            [
                17009,
                17070
            ],
            [
                17070,
                17106
            ],
            [
                17106,
                17173
            ],
            [
                17173,
                17193
            ],
            [
                17193,
                17328
            ],
            [
                17328,
                17484
            ],
            [
                17484,
                17706
            ],
            [
                17706,
                17761
            ],
            [
                17761,
                17964
            ],
            [
                17964,
                18117
            ]
        ],
        "overlap_chars": [
            [
                29,
                36
            ],
            [
                38,
                44
            ],
            [
                49,
                60
            ],
            [
                158,
                216
            ],
            [
                251,
                266
            ],
            [
                273,
                279
            ],
            [
                285,
                287
            ],
            [
                305,
                324
            ],
            [
                336,
                342
            ],
            [
                352,
                368
            ],
            [
                405,
                432
            ],
            [
                439,
                484
            ],
            [
                543,
                560
            ],
            [
                587,
                619
            ],
            [
                648,
                668
            ],
            [
                668,
                692
            ],
            [
                703,
                732
            ],
            [
                740,
                742
            ],
            [
                742,
                761
            ],
            [
                768,
                778
            ],
            [
                791,
                829
            ],
            [
                834,
                841
            ],
            [
                846,
                858
            ],
            [
                888,
                889
            ],
            [
                842,
                845
            ],
            [
                923,
                957
            ],
            [
                957,
                1015
            ],
            [
                1028,
                1033
            ],
            [
                1055,
                1142
            ],
            [
                1205,
                1255
            ],
            [
                1313,
                1315
            ],
            [
                1315,
                1333
            ],
            [
                1351,
                1466
            ],
            [
                1473,
                1508
            ],
            [
                1558,
                1573
            ],
            [
                1591,
                1608
            ],
            [
                1627,
                1664
            ],
            [
                1674,
                1728
            ],
            [
                1759,
                1773
            ],
            [
                1773,
                1809
            ],
            [
                1832,
                1858
            ],
            [
                1859,
                1925
            ],
            [
                1963,
                2036
            ],
            [
                2043,
                2081
            ],
            [
                2081,
                2112
            ],
            [
                2180,
                2217
            ],
            [
                2227,
                2263
            ],
            [
                2263,
                2287
            ],
            [
                2397,
                2413
            ],
            [
                2334,
                2335
            ],
            [
                2383,
                2385
            ],
            [
                2387,
                2395
            ],
            [
                2453,
                2455
            ],
            [
                2473,
                2500
            ],
            [
                2512,
                2538
            ],
            [
                2538,
                2549
            ],
            [
                2564,
                2566
            ],
            [
                2566,
                2575
            ],
            [
                2584,
                2660
            ],
            [
                2660,
                2731
            ],
            [
                2733,
                2734
            ],
            [
                2736,
                2802
            ],
            [
                2802,
                2848
            ],
            [
                2848,
                2973
            ],
            [
                2973,
                3047
            ],
            [
                3047,
                3068
            ],
            [
                3075,
                3127
            ],
            [
                3142,
                3144
            ],
            [
                3144,
                3172
            ],
            [
                3236,
                3238
            ],
            [
                3255,
                3288
            ],
            [
                3293,
                3296
            ],
            [
                3309,
                3326
            ],
            [
                3326,
                3352
            ],
            [
                3352,
                3413
            ],
            [
                3413,
                3456
            ],
            [
                3456,
                3500
            ],
            [
                3500,
                3510
            ],
            [
                3510,
                3581
            ],
            [
                3581,
                3585
            ],
            [
                3585,
                3678
            ],
            [
                3678,
                3707
            ],
            [
                3707,
                3753
            ],
            [
                3753,
                3785
            ],
            [
                3800,
                3801
            ],
            [
                3813,
                3820
            ],
            [
                3837,
                3839
            ],
            [
                3839,
                3928
            ],
            [
                3928,
                4010
            ],
            [
                4010,
                4032
            ],
            [
                4112,
                4114
            ],
            [
                4114,
                4142
            ],
            [
                4147,
                4151
            ],
            [
                4178,
                4180
            ],
            [
                4180,
                4223
            ],
            [
                4223,
                4263
            ],
            [
                4263,
                4286
            ],
            [
                4286,
                4352
            ],
            [
                4352,
                4439
            ],
            [
                4439,
                4482
            ],
            [
                4482,
                4565
            ],
            [
                4565,
                4611
            ],
            [
                4611,
                4705
            ],
            [
                4720,
                4742
            ],
            [
                4766,
                4896
            ],
            [
                4930,
                4933
            ],
            [
                4921,
                4929
            ],
            [
                4934,
                4947
            ],
            [
                4947,
                4960
            ],
            [
                4960,
                4970
            ],
            [
                4970,
                5016
            ],
            [
                5016,
                5054
            ],
            [
                5064,
                5097
            ],
            [
                5097,
                5127
            ],
            [
                5145,
                5174
            ],
            [
                5209,
                5211
            ],
            [
                5180,
                5184
            ],
            [
                5216,
                5224
            ],
            [
                5224,
                5308
            ],
            [
                5308,
                5360
            ],
            [
                5415,
                5490
            ],
            [
                5490,
                5514
            ],
            [
                5514,
                5600
            ],
            [
                5605,
                5654
            ],
            [
                5658,
                5726
            ],
            [
                5726,
                5746
            ],
            [
                5762,
                5775
            ],
            [
                5788,
                5818
            ],
            [
                5869,
                5926
            ],
            [
                5926,
                5948
            ],
            [
                5950,
                5953
            ],
            [
                5978,
                6071
            ],
            [
                6079,
                6082
            ],
            [
                6152,
                6183
            ],
            [
                6322,
                6342
            ],
            [
                6369,
                6434
            ],
            [
                6445,
                6451
            ],
            [
                6451,
                6569
            ],
            [
                6583,
                6594
            ],
            [
                6594,
                6616
            ],
            [
                6616,
                6665
            ],
            [
                6665,
                6682
            ],
            [
                6682,
                6713
            ],
            [
                6713,
                6730
            ],
            [
                6771,
                6773
            ],
            [
                6774,
                6792
            ],
            [
                6798,
                6871
            ],
            [
                6871,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                6981
            ],
            [
                6981,
                7030
            ],
            [
                7030,
                7033
            ],
            [
                7040,
                7099
            ],
            [
                7099,
                7123
            ],
            [
                7137,
                7166
            ],
            [
                7170,
                7182
            ],
            [
                7186,
                7193
            ],
            [
                7263,
                7314
            ],
            [
                7314,
                7378
            ],
            [
                7396,
                7411
            ],
            [
                7443,
                7446
            ],
            [
                7480,
                7489
            ],
            [
                7509,
                7534
            ],
            [
                7539,
                7559
            ],
            [
                7680,
                7681
            ],
            [
                7582,
                7588
            ],
            [
                7597,
                7638
            ],
            [
                7643,
                7680
            ],
            [
                7704,
                7707
            ],
            [
                7707,
                7766
            ],
            [
                7766,
                7767
            ],
            [
                7768,
                7772
            ],
            [
                7774,
                7799
            ],
            [
                7799,
                7836
            ],
            [
                7838,
                7841
            ],
            [
                7843,
                7849
            ],
            [
                7849,
                7878
            ],
            [
                7947,
                7960
            ],
            [
                7962,
                7965
            ],
            [
                7967,
                7983
            ],
            [
                7983,
                8046
            ],
            [
                8147,
                8149
            ],
            [
                8176,
                8189
            ],
            [
                8167,
                8169
            ],
            [
                8161,
                8166
            ],
            [
                8190,
                8213
            ],
            [
                8306,
                8345
            ],
            [
                8304,
                8305
            ],
            [
                8411,
                8424
            ],
            [
                8432,
                8524
            ],
            [
                8525,
                8534
            ],
            [
                8569,
                8571
            ],
            [
                8607,
                8616
            ],
            [
                8622,
                8746
            ],
            [
                8746,
                8747
            ],
            [
                8771,
                8843
            ],
            [
                8859,
                8862
            ],
            [
                8862,
                8864
            ],
            [
                8882,
                8887
            ],
            [
                8868,
                8871
            ],
            [
                8888,
                8890
            ],
            [
                8902,
                8947
            ],
            [
                8947,
                8989
            ],
            [
                8995,
                9011
            ],
            [
                9011,
                9039
            ],
            [
                9039,
                9054
            ],
            [
                9086,
                9096
            ],
            [
                9096,
                9123
            ],
            [
                9241,
                9260
            ],
            [
                9269,
                9273
            ],
            [
                9280,
                9298
            ],
            [
                9298,
                9343
            ],
            [
                9343,
                9390
            ],
            [
                9396,
                9399
            ],
            [
                9429,
                9449
            ],
            [
                9449,
                9454
            ],
            [
                9463,
                9570
            ],
            [
                9570,
                9610
            ],
            [
                9610,
                9648
            ],
            [
                9648,
                9659
            ],
            [
                9659,
                9708
            ],
            [
                9757,
                9794
            ],
            [
                9831,
                9886
            ],
            [
                9886,
                9918
            ],
            [
                9918,
                9949
            ],
            [
                9993,
                9995
            ],
            [
                9995,
                10136
            ],
            [
                10136,
                10167
            ],
            [
                10184,
                10284
            ],
            [
                10335,
                10365
            ],
            [
                10399,
                10435
            ],
            [
                10435,
                10473
            ],
            [
                10530,
                10543
            ],
            [
                10629,
                10631
            ],
            [
                10597,
                10603
            ],
            [
                10647,
                10714
            ],
            [
                10714,
                10767
            ],
            [
                10789,
                10847
            ],
            [
                10872,
                10901
            ],
            [
                11011,
                11117
            ],
            [
                11117,
                11155
            ],
            [
                11180,
                11182
            ],
            [
                11182,
                11207
            ],
            [
                11212,
                11330
            ],
            [
                11330,
                11423
            ],
            [
                11438,
                11460
            ],
            [
                11471,
                11486
            ],
            [
                11513,
                11558
            ],
            [
                11558,
                11581
            ],
            [
                11602,
                11615
            ],
            [
                11702,
                11721
            ],
            [
                11751,
                11826
            ],
            [
                11834,
                11886
            ],
            [
                11886,
                11910
            ],
            [
                11910,
                12026
            ],
            [
                12027,
                12032
            ],
            [
                12052,
                12055
            ],
            [
                12065,
                12190
            ],
            [
                12198,
                12216
            ],
            [
                12223,
                12236
            ],
            [
                12250,
                12352
            ],
            [
                12361,
                12406
            ],
            [
                12418,
                12442
            ],
            [
                12509,
                12516
            ],
            [
                12557,
                12571
            ],
            [
                12583,
                12596
            ],
            [
                12610,
                12653
            ],
            [
                12675,
                12716
            ],
            [
                12779,
                12781
            ],
            [
                12781,
                12834
            ],
            [
                12961,
                12982
            ],
            [
                13043,
                13119
            ],
            [
                13128,
                13158
            ],
            [
                13186,
                13194
            ],
            [
                13200,
                13203
            ],
            [
                13207,
                13333
            ],
            [
                13402,
                13408
            ],
            [
                12861,
                12864
            ],
            [
                12904,
                12907
            ],
            [
                13439,
                13451
            ],
            [
                13463,
                13474
            ],
            [
                13484,
                13504
            ],
            [
                13518,
                13537
            ],
            [
                13557,
                13597
            ],
            [
                13604,
                13627
            ],
            [
                13692,
                13750
            ],
            [
                13750,
                13862
            ],
            [
                13904,
                13933
            ],
            [
                13970,
                13972
            ],
            [
                13972,
                14045
            ],
            [
                14055,
                14091
            ],
            [
                14117,
                14129
            ],
            [
                14138,
                14146
            ],
            [
                14093,
                14095
            ],
            [
                14151,
                14163
            ],
            [
                14167,
                14174
            ],
            [
                14236,
                14238
            ],
            [
                14350,
                14372
            ],
            [
                14378,
                14380
            ],
            [
                14265,
                14277
            ],
            [
                14279,
                14288
            ],
            [
                14385,
                14387
            ],
            [
                14387,
                14440
            ],
            [
                14445,
                14488
            ],
            [
                14505,
                14519
            ],
            [
                14527,
                14567
            ],
            [
                14576,
                14589
            ],
            [
                14719,
                14733
            ],
            [
                14621,
                14624
            ],
            [
                14734,
                14811
            ],
            [
                14972,
                14973
            ],
            [
                14817,
                14836
            ],
            [
                14857,
                14928
            ],
            [
                14985,
                15011
            ],
            [
                15033,
                15172
            ],
            [
                15172,
                15303
            ],
            [
                15303,
                15315
            ],
            [
                15365,
                15458
            ],
            [
                15359,
                15364
            ],
            [
                15496,
                15545
            ],
            [
                15545,
                15646
            ],
            [
                15703,
                15705
            ],
            [
                15705,
                15751
            ],
            [
                15765,
                15818
            ],
            [
                15818,
                15863
            ],
            [
                15873,
                15965
            ],
            [
                15965,
                16010
            ],
            [
                16010,
                16051
            ],
            [
                16060,
                16070
            ],
            [
                16072,
                16075
            ],
            [
                16077,
                16116
            ],
            [
                16116,
                16185
            ],
            [
                16212,
                16245
            ],
            [
                16245,
                16326
            ],
            [
                16374,
                16378
            ],
            [
                16332,
                16339
            ],
            [
                16400,
                16402
            ],
            [
                16409,
                16419
            ],
            [
                16426,
                16474
            ],
            [
                16495,
                16515
            ],
            [
                16561,
                16563
            ],
            [
                16563,
                16648
            ],
            [
                16648,
                16720
            ],
            [
                16792,
                16794
            ],
            [
                16794,
                16828
            ],
            [
                17013,
                17025
            ],
            [
                17047,
                17070
            ],
            [
                17070,
                17097
            ],
            [
                17100,
                17106
            ],
            [
                17106,
                17116
            ],
            [
                17171,
                17173
            ],
            [
                17173,
                17176
            ],
            [
                17179,
                17193
            ],
            [
                17193,
                17297
            ],
            [
                17326,
                17328
            ],
            [
                17328,
                17375
            ],
            [
                17391,
                17442
            ],
            [
                17482,
                17484
            ],
            [
                17635,
                17661
            ],
            [
                17668,
                17704
            ],
            [
                17761,
                17788
            ],
            [
                17805,
                17822
            ],
            [
                17826,
                17834
            ],
            [
                17874,
                17913
            ],
            [
                17950,
                17962
            ],
            [
                17921,
                17931
            ],
            [
                17934,
                17940
            ],
            [
                17962,
                17964
            ],
            [
                17964,
                17982
            ],
            [
                17994,
                18090
            ],
            [
                18103,
                18117
            ]
        ],
        "row_chars": [
            [
                0,
                287
            ],
            [
                287,
                560
            ],
            [
                560,
                620
            ],
            [
                620,
                648
            ],
            [
                648,
                668
            ],
            [
                668,
                742
            ],
            [
                742,
                778
            ],
            [
                778,
                957
            ],
            [
                957,
                1315
            ],
            [
                1315,
                1508
            ],
            [
                1508,
                1773
            ],
            [
                1773,
                1859
            ],
            [
                1859,
                2081
            ],
            [
                2081,
                2263
            ],
            [
                2263,
                2287
            ],
            [
                2287,
                2455
            ],
            [
                2455,
                2538
            ],
            [
                2538,
                2566
            ],
            [
                2566,
                2660
            ],
            [
                2660,
                2802
            ],
            [
                2802,
                2848
            ],
            [
                2848,
                2973
            ],
            [
                2973,
                3047
            ],
            [
                3047,
                3144
            ],
            [
                3144,
                3288
            ],
            [
                3288,
                3326
            ],
            [
                3326,
                3352
            ],
            [
                3352,
                3413
            ],
            [
                3413,
                3456
            ],
            [
                3456,
                3500
            ],
            [
                3500,
                3510
            ],
            [
                3510,
                3581
            ],
            [
                3581,
                3585
            ],
            [
                3585,
                3678
            ],
            [
                3678,
                3707
            ],
            [
                3707,
                3753
            ],
            [
                3753,
                3839
            ],
            [
                3839,
                3928
            ],
            [
                3928,
                4010
            ],
            [
                4010,
                4114
            ],
            [
                4114,
                4180
            ],
            [
                4180,
                4223
            ],
            [
                4223,
                4263
            ],
            [
                4263,
                4286
            ],
            [
                4286,
                4352
            ],
            [
                4352,
                4439
            ],
            [
                4439,
                4482
            ],
            [
                4482,
                4565
            ],
            [
                4565,
                4611
            ],
            [
                4611,
                4947
            ],
            [
                4947,
                4960
            ],
            [
                4960,
                4970
            ],
            [
                4970,
                5016
            ],
            [
                5016,
                5097
            ],
            [
                5097,
                5224
            ],
            [
                5224,
                5308
            ],
            [
                5308,
                5490
            ],
            [
                5490,
                5514
            ],
            [
                5514,
                5726
            ],
            [
                5726,
                5926
            ],
            [
                5926,
                6184
            ],
            [
                6184,
                6322
            ],
            [
                6322,
                6451
            ],
            [
                6451,
                6594
            ],
            [
                6594,
                6616
            ],
            [
                6616,
                6665
            ],
            [
                6665,
                6682
            ],
            [
                6682,
                6713
            ],
            [
                6713,
                6773
            ],
            [
                6773,
                6871
            ],
            [
                6871,
                6937
            ],
            [
                6937,
                6965
            ],
            [
                6965,
                6981
            ],
            [
                6981,
                7030
            ],
            [
                7030,
                7099
            ],
            [
                7099,
                7193
            ],
            [
                7193,
                7314
            ],
            [
                7314,
                7559
            ],
            [
                7559,
                7582
            ],
            [
                7582,
                7707
            ],
            [
                7707,
                7766
            ],
            [
                7766,
                7799
            ],
            [
                7799,
                7849
            ],
            [
                7849,
                7983
            ],
            [
                7983,
                8149
            ],
            [
                8149,
                8411
            ],
            [
                8411,
                8571
            ],
            [
                8571,
                8746
            ],
            [
                8746,
                8862
            ],
            [
                8862,
                8947
            ],
            [
                8947,
                9011
            ],
            [
                9011,
                9039
            ],
            [
                9039,
                9096
            ],
            [
                9096,
                9147
            ],
            [
                9147,
                9211
            ],
            [
                9211,
                9298
            ],
            [
                9298,
                9343
            ],
            [
                9343,
                9399
            ],
            [
                9399,
                9449
            ],
            [
                9449,
                9570
            ],
            [
                9570,
                9610
            ],
            [
                9610,
                9648
            ],
            [
                9648,
                9659
            ],
            [
                9659,
                9708
            ],
            [
                9708,
                9734
            ],
            [
                9734,
                9794
            ],
            [
                9794,
                9831
            ],
            [
                9831,
                9886
            ],
            [
                9886,
                9918
            ],
            [
                9918,
                9995
            ],
            [
                9995,
                10136
            ],
            [
                10136,
                10435
            ],
            [
                10435,
                10530
            ],
            [
                10530,
                10714
            ],
            [
                10714,
                10901
            ],
            [
                10901,
                10982
            ],
            [
                10982,
                11011
            ],
            [
                11011,
                11117
            ],
            [
                11117,
                11182
            ],
            [
                11182,
                11330
            ],
            [
                11330,
                11558
            ],
            [
                11558,
                11886
            ],
            [
                11886,
                11910
            ],
            [
                11910,
                12027
            ],
            [
                12027,
                12571
            ],
            [
                12571,
                12781
            ],
            [
                12781,
                13537
            ],
            [
                13537,
                13750
            ],
            [
                13750,
                13972
            ],
            [
                13972,
                14238
            ],
            [
                14238,
                14387
            ],
            [
                14387,
                14589
            ],
            [
                14589,
                15012
            ],
            [
                15012,
                15172
            ],
            [
                15172,
                15303
            ],
            [
                15303,
                15545
            ],
            [
                15545,
                15705
            ],
            [
                15705,
                15818
            ],
            [
                15818,
                15863
            ],
            [
                15863,
                15965
            ],
            [
                15965,
                16010
            ],
            [
                16010,
                16116
            ],
            [
                16116,
                16245
            ],
            [
                16245,
                16402
            ],
            [
                16402,
                16563
            ],
            [
                16563,
                16648
            ],
            [
                16648,
                16794
            ],
            [
                16794,
                16828
            ],
            [
                16828,
                16977
            ],
            [
                16977,
                17009
            ],
            [
                17009,
                17070
            ],
            [
                17070,
                17106
            ],
            [
                17106,
                17173
            ],
            [
                17173,
                17193
            ],
            [
                17193,
                17328
            ],
            [
                17328,
                17484
            ],
            [
                17484,
                17706
            ],
            [
                17706,
                17761
            ],
            [
                17761,
                17964
            ],
            [
                17964,
                18117
            ]
        ]
    },
    "abridged": {
        "text": "Twenty minutes passed, and Fanny began to be surprised at being left so long, and to listen anxiously for their steps and voices. At length she heard voices approaching; but it was not those she wanted. Miss Bertram, Mr. Rushworth, and Mr. Crawford were before her.\n\"My dear Fanny, how comes this?\"\nShe told her story. \"Poor dear Fanny,\" cried Maria, \"how ill you have been used! You had better have stayed with us.\"\nSeating herself with a gentleman on each side, Maria resumed their conversation, discussing the possible improvements with much animation. Nothing was fixed on; but Henry Crawford was full of ideas, and whatever he proposed was immediately approved, first by her, and then by Mr. Rushworth, who scarcely risked an original thought of his own.\nAfter some minutes, Miss Bertram, observing the iron gate, expressed a wish of passing through it into the park, that their views and plans might be more comprehensive. It was the best way of proceeding, in Henry Crawford's opinion; and he saw a knoll not half a mile off, which would give them a view of the house. Go therefore they must to that knoll; but the gate was locked.\nMr. Rushworth wished he had brought the key; he had been very near to bringing the key; he was determined he would never come without the key again; but this did not remove the present evil. They could not get through; and it ended in Mr. Rushworth's declaring that he would go and fetch the key. He set off accordingly.\nWhen he was gone, Maria addressed Mr Crawford. \"Sincerely, do not you find the place worse than you expected?\"\n\"No, indeed. I find it grander, more complete in its style, though that style may not be the best. And to tell you the truth,\" speaking rather lower, \"I do not think that I shall ever see Sotherton again with so much pleasure as I do now. Another summer will hardly improve it to me.\"\nAfter a moment's embarrassment the lady replied, \"You are too much a man of the world not to see with the eyes of the world. If other people think Sotherton improved, I have no doubt that you will.\"\n\"I am afraid I am not so much the man of the world as might be good for me. My feelings are not quite so light as is the case with men of the world.\"\nThere was a short silence. Miss Bertram began again. \"You seemed to enjoy your drive here very much this morning. I was glad to see you so well entertained. You and Julia were laughing the whole way.\"\n\"Were we? Yes, I believe we were; but I have not the least recollection at what. Oh! I believe I was relating to her some ridiculous stories of an old Irish groom of my uncle's. Your sister loves to laugh.\"\n\"You think her more light-hearted than I am?\"\n\"More easily amused,\" he replied, smiling. \"I could not have hoped to entertain you with Irish anecdotes during a ten miles' drive.\"\n\"Naturally, I believe, I am as lively as Julia, but I have more to think of now.\"\n\"You have, undoubtedly. Your prospects, however, are fair. You have a very smiling scene before you.\"\n\"Do you mean literally or figuratively? Literally, I conclude. Yes, certainly, the sun shines, and the park looks very cheerful. But unluckily that iron gate, that ha-ha, give me a feeling of restraint and hardship. 'I cannot get out,' as the starling said.\" As she spoke, and it was with expression, she walked to the gate: he followed her. \"Mr. Rushworth is so long fetching this key!\"\n\"And for the world you would not get out without the key and without Mr. Rushworth's authority, or I think you might easily pass round the edge of the gate, here, with my assistance; I think it might be done, if you really wished to be more at large, and did not think it prohibited.\"\n\"Prohibited! nonsense! I certainly can get out that way, and I will. Mr. Rushworth will be here in a moment; we shall not be out of sight.\"\n\"Or if we are, Miss Price will tell him that he will find us on that knoll.\"\nFanny, feeling all this to be wrong, could not help making an effort to prevent it. \"You will hurt yourself, Miss Bertram,\" she cried; \"you will tear your gown; you will be in danger of slipping into the ha-ha. You had better not go.\"\nHer cousin was safe on the other side while these words were spoken, and, smiling with the good-humour of success, she said, \"Thank you, dear Fanny, but I and my gown are alive and well, and so good-bye.\"\nFanny was again left alone, and with no pleasant feelings, for she was astonished at Miss Bertram, and angry with Mr. Crawford. By taking a circuitous and very unreasonable direction to the knoll, they were soon beyond her eye; and for some minutes she had the little wood all to herself.\nShe was again roused by sudden footsteps: somebody was coming at a quick pace down the walk. She expected Mr. Rushworth, but it was Julia, who, hot and out of breath, and with a look of disappointment, cried out, \"Heyday! Where are the others? I thought Maria and Mr. Crawford were with you.\"\nFanny explained.\n\"A pretty trick, upon my word! I cannot see them. But they cannot be far off, and I think I am equal to as much as Maria, even without help.\"\n\"But, Julia, Mr. Rushworth will be here in a moment with the key. Do wait for Mr. Rushworth.\"\n\"Not I, indeed. I have had enough of the family for one morning. Why, I have but this moment escaped from his horrible mother. Such a penance as I have endured, while you were sitting here composed and happy! You always contrive to keep out of these scrapes.\"\nThis was a most unjust reflection, but Fanny could allow for it, for Julia was vexed. She therefore only asked her if she had seen Mr. Rushworth.\n\"Yes, he was hurrying away as if upon life and death, and could just spare time to tell us his errand.\"\n\"It is a pity he should have so much trouble for nothing.\"\n\"That is Miss Maria's concern. I am not obliged to punish myself for her sins. The mother I could not avoid, but the son I can get away from.\"\nAnd she immediately scrambled across the fence, and walked away. Fanny now sat in dread of seeing Mr. Rushworth; she felt that he had been very ill-used.\nHe joined her five minutes after Julia's exit; and though she made the best of the story, he was evidently greatly mortified. His looks expressed his extreme surprise and vexation, and he walked to the gate and stood there, without seeming to know what to do.\n\"My cousin Maria charged me to say that you would find them at that knoll.\"\n\"I shall not go,\" said he sullenly; \"I see nothing of them. By the time I get to the knoll they may be somewhere else. I have had walking enough.\"\nAnd he sat down gloomily by Fanny.\n\"I am very sorry,\" said she.\n\"I think they might have stayed for me,\" said he.\n\"Miss Bertram thought you would follow her.\"\n\"I should not have had to follow her if she had stayed.\"\nFanny was silenced. After a pause, he went on-\"Pray, Miss Price, are you such a great admirer of this Mr. Crawford as some people are? For my part, I can see nothing in him.\"\n\"I do not think him at all handsome.\"\n\"Handsome! Nobody can call such an undersized man handsome. He is not more than five foot eight. In my opinion, these Crawfords are no addition at all. We did very well without them.\"\nA small sigh escaped Fanny here.\n\"If I had made any difficulty about fetching the key, there might have been some excuse, but I went the very moment she said she wanted it.\"\n\"Nothing could be more obliging, I am sure, and I dare say you walked as fast as you could; but still it is some distance, you know; and when people are waiting, every half minute seems like five.\"\nHe got up and walked to the gate again. Fanny thought he was inclined to relent, and she said, therefore, \"It is a pity you should not join them. They expected to have a better view of the house from there, and will be thinking how it may be improved; and nothing can be settled without you.\"\n\"Well,\" said he, \"if you really think I had better go: it would be foolish to bring the key for nothing.\" And letting himself out, he walked off.\nFanny's thoughts were now engrossed by the two who had left her so long ago, and getting quite impatient, she resolved to go in search of them. She followed their steps along the bottom walk, and had just turned up into another, when the laugh of Miss Crawford caught her ear; a few more windings brought them before her. They were just returned from the park, and they had been into the very avenue which Fanny had been hoping the whole morning to reach, and had been sitting down under one of the trees. This was their history. It was evident that they had been spending their time pleasantly, and were not aware of the length of their absence.\nFanny was assured that Edmund had wished for her very much, and that he should certainly have come back for her, had she not been tired; but this was not sufficient to ease the pain of having been left a whole hour, when he had talked of only a few minutes, nor to banish the curiosity she felt to know what they had been talking about all that time; and she felt depressed as they returned to the house.\nAs they reached the bottom of the terrace, Mrs. Rushworth and Mrs. Norris appeared at the top, just ready for the wilderness. Mrs. Norris had been too well employed to move faster; for the housekeeper had taken her to the dairy, told her all about their cows, and given her the recipe for a famous cream cheese; and they had met the gardener, with whom she had made a most satisfactory acquaintance, for she had set him right as to his grandson's illness, and he had shown her his choicest plants, and presented her with a specimen of heath.\nThey all returned to the house together, to lounge away the time till the return of the others, and the arrival of dinner. It was late before the Miss Bertrams and the two gentlemen came in, and their ramble did not appear to have been productive of anything useful. By their own accounts they had been all walking after each other, and the meeting which had taken place at last seemed to have been too late to re-establish harmony. There was gloom on the faces of Julia and Mr Rushworth. Mr. Crawford and Miss Bertram were much more gay, and Fanny thought that he was taking particular pains to do away any resentment of the other two, and restore good-humour.\nThey sat down to table, and then it was a quick succession of busy nothings till the carriage came to the door. Mrs. Norris, having obtained a few pheasants' eggs and a cream cheese from the housekeeper, was ready to lead the way.\nMr. Crawford, approaching Julia, said, \"I hope I am not to lose my companion, unless she is afraid of the evening air in so exposed a seat.\" The request had not been foreseen, but was very graciously received, and Julia's day was likely to end almost as well as it began. Miss Bertram was a little disappointed; but her conviction of being really the one preferred comforted her, and she received Mr. Rushworth's parting attentions as she ought. He was certainly better pleased to hand her into the barouche than to assist her in ascending the box.\n\"Well, Fanny, this has been a fine day for you,\" said Mrs. Norris, as they drove through the park. \"Nothing but pleasure from beginning to end! You ought to be very much obliged to your aunt Bertram and me for contriving to let you go. A pretty good day's amusement you have had!\"\nMaria was just discontented enough to say, \"I think you have done pretty well yourself, ma'am. Your lap seems full of good things, and here is a basket of something knocking my elbow unmercifully.\"\n\"My dear, it is only a beautiful little heath, which that nice old gardener would have me take. Fanny, you carry that parcel for me; take great care of it: it is a cream cheese. Nothing would satisfy that good old Mrs. Whitaker, but my taking one of the cheeses. I stood out as long as I could, till the tears almost came into her eyes. That Mrs. Whitaker is a treasure! I can manage the basket very well.\"\n\"What else have you been sponging?\" said Maria.\n\"Sponging, my dear! It is nothing but four of those beautiful pheasants' eggs, which Mrs. Whitaker would quite force upon me. She said it must be such an amusement to me, as I lived quite alone, to have a few living creatures. It will be a great delight in my lonely hours to attend to them.\"\nIt was a beautiful evening, and the drive was pleasant; but when Mrs. Norris ceased speaking, those within were altogether silent. Their spirits were exhausted; and to determine whether the day had afforded most pleasure or pain, might occupy the thoughts of almost all.",
        "paragraph_chars": [
            [
                0,
                266
            ],
            [
                266,
                299
            ],
            [
                299,
                417
            ],
            [
                417,
                760
            ],
            [
                760,
                1139
            ],
            [
                1139,
                1460
            ],
            [
                1460,
                1571
            ],
            [
                1571,
                1856
            ],
            [
                1856,
                2055
            ],
            [
                2055,
                2205
            ],
            [
                2205,
                2406
            ],
            [
                2406,
                2613
            ],
            [
                2613,
                2659
            ],
            [
                2659,
                2792
            ],
            [
                2792,
                2874
            ],
            [
                2874,
                2976
            ],
            [
                2976,
                3364
            ],
            [
                3364,
                3649
            ],
            [
                3649,
                3789
            ],
            [
                3789,
                3866
            ],
            [
                3866,
                4101
            ],
            [
                4101,
                4306
            ],
            [
                4306,
                4595
            ],
            [
                4595,
                4888
            ],
            [
                4888,
                4905
            ],
            [
                4905,
                5047
            ],
            [
                5047,
                5141
            ],
            [
                5141,
                5401
            ],
            [
                5401,
                5547
            ],
            [
                5547,
                5651
            ],
            [
                5651,
                5710
            ],
            [
                5710,
                5853
            ],
            [
                5853,
                6007
            ],
            [
                6007,
                6267
            ],
            [
                6267,
                6343
            ],
            [
                6343,
                6490
            ],
            [
                6490,
                6525
            ],
            [
                6525,
                6554
            ],
            [
                6554,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6706
            ],
            [
                6706,
                6881
            ],
            [
                6881,
                6919
            ],
            [
                6919,
                7103
            ],
            [
                7103,
                7136
            ],
            [
                7136,
                7277
            ],
            [
                7277,
                7475
            ],
            [
                7475,
                7768
            ],
            [
                7768,
                7914
            ],
            [
                7914,
                8561
            ],
            [
                8561,
                8966
            ],
            [
                8966,
                9508
            ],
            [
                9508,
                10170
            ],
            [
                10170,
                10401
            ],
            [
                10401,
                10950
            ],
            [
                10950,
                11231
            ],
            [
                11231,
                11429
            ],
            [
                11429,
                11836
            ],
            [
                11836,
                11884
            ],
            [
                11884,
                12177
            ],
            [
                12177,
                12447
            ]
        ],
        "segment_chars": [
            [
                0,
                130
            ],
            [
                130,
                203
            ],
            [
                203,
                266
            ],
            [
                266,
                299
            ],
            [
                299,
                319
            ],
            [
                319,
                380
            ],
            [
                380,
                417
            ],
            [
                417,
                556
            ],
            [
                556,
                760
            ],
            [
                760,
                929
            ],
            [
                929,
                1076
            ],
            [
                1076,
                1139
            ],
            [
                1139,
                1330
            ],
            [
                1330,
                1436
            ],
            [
                1436,
                1460
            ],
            [
                1460,
                1507
            ],
            [
                1507,
                1571
            ],
            [
                1571,
                1584
            ],
            [
                1584,
                1670
            ],
            [
                1670,
                1810
            ],
            [
                1810,
                1856
            ],
            [
                1856,
                1981
            ],
            [
                1981,
                2055
            ],
            [
                2055,
                2131
            ],
            [
                2131,
                2205
            ],
            [
                2205,
                2232
            ],
            [
                2232,
                2258
            ],
            [
                2258,
                2319
            ],
            [
                2319,
                2362
            ],
            [
                2362,
                2406
            ],
            [
                2406,
                2416
            ],
            [
                2416,
                2487
            ],
            [
                2487,
                2491
            ],
            [
                2491,
                2584
            ],
            [
                2584,
                2613
            ],
            [
                2613,
                2659
            ],
            [
                2659,
                2702
            ],
            [
                2702,
                2792
            ],
            [
                2792,
                2874
            ],
            [
                2874,
                2898
            ],
            [
                2898,
                2933
            ],
            [
                2933,
                2976
            ],
            [
                2976,
                3016
            ],
            [
                3016,
                3039
            ],
            [
                3039,
                3105
            ],
            [
                3105,
                3192
            ],
            [
                3192,
                3235
            ],
            [
                3235,
                3318
            ],
            [
                3318,
                3364
            ],
            [
                3364,
                3649
            ],
            [
                3649,
                3662
            ],
            [
                3662,
                3672
            ],
            [
                3672,
                3718
            ],
            [
                3718,
                3789
            ],
            [
                3789,
                3866
            ],
            [
                3866,
                3950
            ],
            [
                3950,
                4077
            ],
            [
                4077,
                4101
            ],
            [
                4101,
                4306
            ],
            [
                4306,
                4434
            ],
            [
                4434,
                4595
            ],
            [
                4595,
                4688
            ],
            [
                4688,
                4817
            ],
            [
                4817,
                4839
            ],
            [
                4839,
                4888
            ],
            [
                4888,
                4905
            ],
            [
                4905,
                4936
            ],
            [
                4936,
                4955
            ],
            [
                4955,
                5047
            ],
            [
                5047,
                5113
            ],
            [
                5113,
                5141
            ],
            [
                5141,
                5157
            ],
            [
                5157,
                5206
            ],
            [
                5206,
                5268
            ],
            [
                5268,
                5350
            ],
            [
                5350,
                5401
            ],
            [
                5401,
                5487
            ],
            [
                5487,
                5547
            ],
            [
                5547,
                5651
            ],
            [
                5651,
                5710
            ],
            [
                5710,
                5741
            ],
            [
                5741,
                5789
            ],
            [
                5789,
                5853
            ],
            [
                5853,
                5918
            ],
            [
                5918,
                6007
            ],
            [
                6007,
                6133
            ],
            [
                6133,
                6267
            ],
            [
                6267,
                6343
            ],
            [
                6343,
                6403
            ],
            [
                6403,
                6462
            ],
            [
                6462,
                6490
            ],
            [
                6490,
                6525
            ],
            [
                6525,
                6554
            ],
            [
                6554,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6706
            ],
            [
                6706,
                6726
            ],
            [
                6726,
                6841
            ],
            [
                6841,
                6881
            ],
            [
                6881,
                6919
            ],
            [
                6919,
                6930
            ],
            [
                6930,
                6979
            ],
            [
                6979,
                7016
            ],
            [
                7016,
                7071
            ],
            [
                7071,
                7103
            ],
            [
                7103,
                7136
            ],
            [
                7136,
                7277
            ],
            [
                7277,
                7475
            ],
            [
                7475,
                7515
            ],
            [
                7515,
                7621
            ],
            [
                7621,
                7768
            ],
            [
                7768,
                7874
            ],
            [
                7874,
                7914
            ],
            [
                7914,
                8058
            ],
            [
                8058,
                8236
            ],
            [
                8236,
                8420
            ],
            [
                8420,
                8444
            ],
            [
                8444,
                8561
            ],
            [
                8561,
                8966
            ],
            [
                8966,
                9092
            ],
            [
                9092,
                9508
            ],
            [
                9508,
                9631
            ],
            [
                9631,
                9775
            ],
            [
                9775,
                9941
            ],
            [
                9941,
                9997
            ],
            [
                9997,
                10170
            ],
            [
                10170,
                10282
            ],
            [
                10282,
                10401
            ],
            [
                10401,
                10542
            ],
            [
                10542,
                10673
            ],
            [
                10673,
                10847
            ],
            [
                10847,
                10950
            ],
            [
                10950,
                11049
            ],
            [
                11049,
                11094
            ],
            [
                11094,
                11186
            ],
            [
                11186,
                11231
            ],
            [
                11231,
                11326
            ],
            [
                11326,
                11429
            ],
            [
                11429,
                11525
            ],
            [
                11525,
                11607
            ],
            [
                11607,
                11692
            ],
            [
                11692,
                11766
            ],
            [
                11766,
                11800
            ],
            [
                11800,
                11836
            ],
            [
                11836,
                11872
            ],
            [
                11872,
                11884
            ],
            [
                11884,
                11904
            ],
            [
                11904,
                12010
            ],
            [
                12010,
                12111
            ],
            [
                12111,
                12177
            ],
            [
                12177,
                12308
            ],
            [
                12308,
                12447
            ]
        ],
        "overlap_chars": [
            [
                7,
                14
            ],
            [
                15,
                21
            ],
            [
                21,
                32
            ],
            [
                33,
                91
            ],
            [
                106,
                121
            ],
            [
                122,
                128
            ],
            [
                128,
                130
            ],
            [
                130,
                149
            ],
            [
                150,
                156
            ],
            [
                157,
                173
            ],
            [
                174,
                201
            ],
            [
                203,
                248
            ],
            [
                249,
                266
            ],
            [
                266,
                298
            ],
            [
                299,
                319
            ],
            [
                319,
                343
            ],
            [
                349,
                378
            ],
            [
                378,
                380
            ],
            [
                380,
                399
            ],
            [
                407,
                417
            ],
            [
                425,
                463
            ],
            [
                470,
                477
            ],
            [
                484,
                496
            ],
            [
                496,
                497
            ],
            [
                509,
                512
            ],
            [
                522,
                556
            ],
            [
                556,
                614
            ],
            [
                614,
                619
            ],
            [
                620,
                707
            ],
            [
                708,
                758
            ],
            [
                758,
                760
            ],
            [
                760,
                778
            ],
            [
                778,
                893
            ],
            [
                894,
                929
            ],
            [
                929,
                944
            ],
            [
                945,
                962
            ],
            [
                962,
                999
            ],
            [
                1000,
                1054
            ],
            [
                1062,
                1076
            ],
            [
                1076,
                1112
            ],
            [
                1112,
                1138
            ],
            [
                1139,
                1205
            ],
            [
                1218,
                1291
            ],
            [
                1292,
                1330
            ],
            [
                1330,
                1361
            ],
            [
                1362,
                1399
            ],
            [
                1400,
                1436
            ],
            [
                1436,
                1460
            ],
            [
                1460,
                1476
            ],
            [
                1476,
                1477
            ],
            [
                1494,
                1496
            ],
            [
                1497,
                1505
            ],
            [
                1505,
                1507
            ],
            [
                1517,
                1544
            ],
            [
                1545,
                1571
            ],
            [
                1571,
                1582
            ],
            [
                1582,
                1584
            ],
            [
                1584,
                1593
            ],
            [
                1594,
                1670
            ],
            [
                1670,
                1741
            ],
            [
                1742,
                1743
            ],
            [
                1744,
                1810
            ],
            [
                1810,
                1856
            ],
            [
                1856,
                1981
            ],
            [
                1981,
                2055
            ],
            [
                2055,
                2076
            ],
            [
                2077,
                2129
            ],
            [
                2129,
                2131
            ],
            [
                2131,
                2159
            ],
            [
                2166,
                2168
            ],
            [
                2172,
                2205
            ],
            [
                2211,
                2214
            ],
            [
                2215,
                2232
            ],
            [
                2232,
                2258
            ],
            [
                2258,
                2319
            ],
            [
                2319,
                2362
            ],
            [
                2362,
                2406
            ],
            [
                2406,
                2416
            ],
            [
                2416,
                2487
            ],
            [
                2487,
                2491
            ],
            [
                2491,
                2584
            ],
            [
                2584,
                2613
            ],
            [
                2613,
                2659
            ],
            [
                2659,
                2691
            ],
            [
                2691,
                2692
            ],
            [
                2693,
                2700
            ],
            [
                2700,
                2702
            ],
            [
                2703,
                2792
            ],
            [
                2792,
                2874
            ],
            [
                2874,
                2896
            ],
            [
                2896,
                2898
            ],
            [
                2898,
                2926
            ],
            [
                2927,
                2931
            ],
            [
                2931,
                2933
            ],
            [
                2933,
                2976
            ],
            [
                2976,
                3016
            ],
            [
                3016,
                3039
            ],
            [
                3039,
                3105
            ],
            [
                3105,
                3192
            ],
            [
                3192,
                3235
            ],
            [
                3235,
                3318
            ],
            [
                3318,
                3364
            ],
            [
                3364,
                3458
            ],
            [
                3458,
                3480
            ],
            [
                3488,
                3618
            ],
            [
                3623,
                3626
            ],
            [
                3627,
                3635
            ],
            [
                3636,
                3649
            ],
            [
                3649,
                3662
            ],
            [
                3662,
                3672
            ],
            [
                3672,
                3718
            ],
            [
                3718,
                3756
            ],
            [
                3756,
                3789
            ],
            [
                3789,
                3819
            ],
            [
                3820,
                3849
            ],
            [
                3850,
                3852
            ],
            [
                3853,
                3857
            ],
            [
                3858,
                3866
            ],
            [
                3866,
                3950
            ],
            [
                3950,
                4002
            ],
            [
                4002,
                4077
            ],
            [
                4077,
                4101
            ],
            [
                4101,
                4187
            ],
            [
                4188,
                4237
            ],
            [
                4238,
                4306
            ],
            [
                4306,
                4326
            ],
            [
                4332,
                4345
            ],
            [
                4346,
                4376
            ],
            [
                4377,
                4434
            ],
            [
                4434,
                4456
            ],
            [
                4457,
                4460
            ],
            [
                4461,
                4554
            ],
            [
                4555,
                4558
            ],
            [
                4563,
                4594
            ],
            [
                4595,
                4615
            ],
            [
                4616,
                4681
            ],
            [
                4682,
                4688
            ],
            [
                4688,
                4806
            ],
            [
                4806,
                4817
            ],
            [
                4817,
                4839
            ],
            [
                4839,
                4888
            ],
            [
                4888,
                4905
            ],
            [
                4905,
                4936
            ],
            [
                4936,
                4953
            ],
            [
                4953,
                4955
            ],
            [
                4955,
                4973
            ],
            [
                4974,
                5047
            ],
            [
                5047,
                5113
            ],
            [
                5113,
                5141
            ],
            [
                5141,
                5157
            ],
            [
                5157,
                5206
            ],
            [
                5206,
                5209
            ],
            [
                5209,
                5268
            ],
            [
                5268,
                5292
            ],
            [
                5300,
                5329
            ],
            [
                5330,
                5342
            ],
            [
                5343,
                5350
            ],
            [
                5350,
                5401
            ],
            [
                5401,
                5465
            ],
            [
                5470,
                5485
            ],
            [
                5487,
                5490
            ],
            [
                5491,
                5500
            ],
            [
                5501,
                5526
            ],
            [
                5527,
                5547
            ],
            [
                5551,
                5552
            ],
            [
                5553,
                5559
            ],
            [
                5569,
                5610
            ],
            [
                5611,
                5648
            ],
            [
                5648,
                5651
            ],
            [
                5651,
                5710
            ],
            [
                5710,
                5711
            ],
            [
                5711,
                5715
            ],
            [
                5716,
                5741
            ],
            [
                5741,
                5778
            ],
            [
                5779,
                5782
            ],
            [
                5783,
                5789
            ],
            [
                5789,
                5818
            ],
            [
                5819,
                5832
            ],
            [
                5833,
                5836
            ],
            [
                5837,
                5853
            ],
            [
                5853,
                5916
            ],
            [
                5916,
                5918
            ],
            [
                5918,
                5931
            ],
            [
                5932,
                5934
            ],
            [
                5935,
                5940
            ],
            [
                5941,
                5964
            ],
            [
                5966,
                6005
            ],
            [
                6005,
                6006
            ],
            [
                6007,
                6020
            ],
            [
                6021,
                6113
            ],
            [
                6122,
                6131
            ],
            [
                6131,
                6133
            ],
            [
                6133,
                6142
            ],
            [
                6143,
                6267
            ],
            [
                6267,
                6268
            ],
            [
                6268,
                6340
            ],
            [
                6340,
                6343
            ],
            [
                6343,
                6345
            ],
            [
                6346,
                6351
            ],
            [
                6352,
                6355
            ],
            [
                6356,
                6358
            ],
            [
                6358,
                6403
            ],
            [
                6403,
                6445
            ],
            [
                6446,
                6462
            ],
            [
                6462,
                6490
            ],
            [
                6490,
                6505
            ],
            [
                6515,
                6525
            ],
            [
                6525,
                6552
            ],
            [
                6554,
                6573
            ],
            [
                6574,
                6578
            ],
            [
                6586,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6696
            ],
            [
                6703,
                6706
            ],
            [
                6706,
                6726
            ],
            [
                6726,
                6731
            ],
            [
                6734,
                6841
            ],
            [
                6841,
                6881
            ],
            [
                6881,
                6919
            ],
            [
                6919,
                6930
            ],
            [
                6930,
                6979
            ],
            [
                6979,
                7016
            ],
            [
                7016,
                7071
            ],
            [
                7071,
                7103
            ],
            [
                7103,
                7134
            ],
            [
                7134,
                7136
            ],
            [
                7136,
                7277
            ],
            [
                7277,
                7308
            ],
            [
                7308,
                7408
            ],
            [
                7408,
                7438
            ],
            [
                7439,
                7475
            ],
            [
                7475,
                7513
            ],
            [
                7515,
                7528
            ],
            [
                7545,
                7547
            ],
            [
                7548,
                7554
            ],
            [
                7554,
                7621
            ],
            [
                7621,
                7674
            ],
            [
                7680,
                7738
            ],
            [
                7739,
                7768
            ],
            [
                7768,
                7874
            ],
            [
                7874,
                7912
            ],
            [
                7912,
                7914
            ],
            [
                7914,
                7939
            ],
            [
                7940,
                8058
            ],
            [
                8058,
                8151
            ],
            [
                8152,
                8174
            ],
            [
                8175,
                8190
            ],
            [
                8191,
                8236
            ],
            [
                8236,
                8259
            ],
            [
                8260,
                8273
            ],
            [
                8273,
                8292
            ],
            [
                8293,
                8368
            ],
            [
                8368,
                8420
            ],
            [
                8420,
                8444
            ],
            [
                8444,
                8560
            ],
            [
                8561,
                8566
            ],
            [
                8567,
                8570
            ],
            [
                8571,
                8696
            ],
            [
                8696,
                8714
            ],
            [
                8715,
                8728
            ],
            [
                8734,
                8836
            ],
            [
                8837,
                8882
            ],
            [
                8891,
                8915
            ],
            [
                8935,
                8942
            ],
            [
                8952,
                8966
            ],
            [
                8982,
                8995
            ],
            [
                8996,
                9039
            ],
            [
                9049,
                9090
            ],
            [
                9090,
                9092
            ],
            [
                9092,
                9145
            ],
            [
                9145,
                9166
            ],
            [
                9167,
                9243
            ],
            [
                9251,
                9281
            ],
            [
                9282,
                9290
            ],
            [
                9291,
                9294
            ],
            [
                9295,
                9421
            ],
            [
                9422,
                9428
            ],
            [
                9429,
                9432
            ],
            [
                9439,
                9442
            ],
            [
                9443,
                9455
            ],
            [
                9456,
                9467
            ],
            [
                9468,
                9488
            ],
            [
                9489,
                9508
            ],
            [
                9508,
                9548
            ],
            [
                9549,
                9572
            ],
            [
                9573,
                9631
            ],
            [
                9631,
                9743
            ],
            [
                9744,
                9773
            ],
            [
                9773,
                9775
            ],
            [
                9775,
                9848
            ],
            [
                9857,
                9893
            ],
            [
                9894,
                9906
            ],
            [
                9907,
                9915
            ],
            [
                9916,
                9918
            ],
            [
                9919,
                9931
            ],
            [
                9932,
                9939
            ],
            [
                9939,
                9941
            ],
            [
                9941,
                9963
            ],
            [
                9970,
                9972
            ],
            [
                9973,
                9985
            ],
            [
                9986,
                9995
            ],
            [
                9995,
                9997
            ],
            [
                9997,
                10050
            ],
            [
                10057,
                10100
            ],
            [
                10101,
                10115
            ],
            [
                10116,
                10156
            ],
            [
                10157,
                10170
            ],
            [
                10179,
                10193
            ],
            [
                10194,
                10197
            ],
            [
                10203,
                10280
            ],
            [
                10280,
                10281
            ],
            [
                10282,
                10301
            ],
            [
                10302,
                10373
            ],
            [
                10374,
                10400
            ],
            [
                10403,
                10542
            ],
            [
                10542,
                10673
            ],
            [
                10673,
                10685
            ],
            [
                10686,
                10779
            ],
            [
                10779,
                10784
            ],
            [
                10798,
                10847
            ],
            [
                10847,
                10948
            ],
            [
                10948,
                10950
            ],
            [
                10950,
                10996
            ],
            [
                10996,
                11049
            ],
            [
                11049,
                11094
            ],
            [
                11094,
                11186
            ],
            [
                11186,
                11231
            ],
            [
                11231,
                11272
            ],
            [
                11272,
                11282
            ],
            [
                11283,
                11286
            ],
            [
                11287,
                11326
            ],
            [
                11326,
                11395
            ],
            [
                11396,
                11429
            ],
            [
                11429,
                11510
            ],
            [
                11511,
                11515
            ],
            [
                11516,
                11523
            ],
            [
                11523,
                11525
            ],
            [
                11525,
                11535
            ],
            [
                11536,
                11584
            ],
            [
                11585,
                11605
            ],
            [
                11605,
                11607
            ],
            [
                11607,
                11692
            ],
            [
                11692,
                11764
            ],
            [
                11764,
                11766
            ],
            [
                11766,
                11800
            ],
            [
                11800,
                11812
            ],
            [
                11813,
                11836
            ],
            [
                11836,
                11863
            ],
            [
                11866,
                11872
            ],
            [
                11872,
                11882
            ],
            [
                11882,
                11884
            ],
            [
                11884,
                11887
            ],
            [
                11890,
                11904
            ],
            [
                11904,
                12008
            ],
            [
                12008,
                12010
            ],
            [
                12010,
                12057
            ],
            [
                12058,
                12109
            ],
            [
                12109,
                12111
            ],
            [
                12111,
                12137
            ],
            [
                12138,
                12174
            ],
            [
                12177,
                12204
            ],
            [
                12205,
                12222
            ],
            [
                12223,
                12231
            ],
            [
                12231,
                12270
            ],
            [
                12271,
                12283
            ],
            [
                12289,
                12299
            ],
            [
                12300,
                12306
            ],
            [
                12306,
                12308
            ],
            [
                12308,
                12326
            ],
            [
                12327,
                12423
            ],
            [
                12433,
                12447
            ]
        ],
        "row_chars": [
            [
                0,
                130
            ],
            [
                130,
                266
            ],
            [
                266,
                299
            ],
            [
                299,
                299
            ],
            [
                299,
                319
            ],
            [
                319,
                380
            ],
            [
                380,
                417
            ],
            [
                417,
                556
            ],
            [
                556,
                760
            ],
            [
                760,
                929
            ],
            [
                929,
                1076
            ],
            [
                1076,
                1139
            ],
            [
                1139,
                1330
            ],
            [
                1330,
                1436
            ],
            [
                1436,
                1460
            ],
            [
                1460,
                1507
            ],
            [
                1507,
                1571
            ],
            [
                1571,
                1584
            ],
            [
                1584,
                1670
            ],
            [
                1670,
                1810
            ],
            [
                1810,
                1856
            ],
            [
                1856,
                1981
            ],
            [
                1981,
                2055
            ],
            [
                2055,
                2131
            ],
            [
                2131,
                2205
            ],
            [
                2205,
                2232
            ],
            [
                2232,
                2258
            ],
            [
                2258,
                2319
            ],
            [
                2319,
                2362
            ],
            [
                2362,
                2406
            ],
            [
                2406,
                2416
            ],
            [
                2416,
                2487
            ],
            [
                2487,
                2491
            ],
            [
                2491,
                2584
            ],
            [
                2584,
                2613
            ],
            [
                2613,
                2659
            ],
            [
                2659,
                2702
            ],
            [
                2702,
                2792
            ],
            [
                2792,
                2874
            ],
            [
                2874,
                2898
            ],
            [
                2898,
                2933
            ],
            [
                2933,
                2976
            ],
            [
                2976,
                3016
            ],
            [
                3016,
                3039
            ],
            [
                3039,
                3105
            ],
            [
                3105,
                3192
            ],
            [
                3192,
                3235
            ],
            [
                3235,
                3318
            ],
            [
                3318,
                3364
            ],
            [
                3364,
                3649
            ],
            [
                3649,
                3662
            ],
            [
                3662,
                3672
            ],
            [
                3672,
                3718
            ],
            [
                3718,
                3789
            ],
            [
                3789,
                3866
            ],
            [
                3866,
                3950
            ],
            [
                3950,
                4077
            ],
            [
                4077,
                4101
            ],
            [
                4101,
                4306
            ],
            [
                4306,
                4434
            ],
            [
                4434,
                4595
            ],
            [
                4595,
                4595
            ],
            [
                4595,
                4688
            ],
            [
                4688,
                4817
            ],
            [
                4817,
                4839
            ],
            [
                4839,
                4888
            ],
            [
                4888,
                4905
            ],
            [
                4905,
                4936
            ],
            [
                4936,
                4955
            ],
            [
                4955,
                5047
            ],
            [
                5047,
                5113
            ],
            [
                5113,
                5141
            ],
            [
                5141,
                5157
            ],
            [
                5157,
                5206
            ],
            [
                5206,
                5268
            ],
            [
                5268,
                5350
            ],
            [
                5350,
                5401
            ],
            [
                5401,
                5547
            ],
            [
                5547,
                5547
            ],
            [
                5547,
                5651
            ],
            [
                5651,
                5710
            ],
            [
                5710,
                5741
            ],
            [
                5741,
                5789
            ],
            [
                5789,
                5853
            ],
            [
                5853,
                5918
            ],
            [
                5918,
                6007
            ],
            [
                6007,
                6133
            ],
            [
                6133,
                6267
            ],
            [
                6267,
                6343
            ],
            [
                6343,
                6403
            ],
            [
                6403,
                6462
            ],
            [
                6462,
                6490
            ],
            [
                6490,
                6525
            ],
            [
                6525,
                6554
            ],
            [
                6554,
                6554
            ],
            [
                6554,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6706
            ],
            [
                6706,
                6726
            ],
            [
                6726,
                6841
            ],
            [
                6841,
                6881
            ],
            [
                6881,
                6919
            ],
            [
                6919,
                6930
            ],
            [
                6930,
                6979
            ],
            [
                6979,
                6979
            ],
            [
                6979,
                7016
            ],
            [
                7016,
                7016
            ],
            [
                7016,
                7071
            ],
            [
                7071,
                7103
            ],
            [
                7103,
                7136
            ],
            [
                7136,
                7277
            ],
            [
                7277,
                7475
            ],
            [
                7475,
                7515
            ],
            [
                7515,
                7621
            ],
            [
                7621,
                7768
            ],
            [
                7768,
                7768
            ],
            [
                7768,
                7768
            ],
            [
                7768,
                7874
            ],
            [
                7874,
                7914
            ],
            [
                7914,
                8058
            ],
            [
                8058,
                8236
            ],
            [
                8236,
                8420
            ],
            [
                8420,
                8444
            ],
            [
                8444,
                8561
            ],
            [
                8561,
                8966
            ],
            [
                8966,
                9092
            ],
            [
                9092,
                9508
            ],
            [
                9508,
                9631
            ],
            [
                9631,
                9775
            ],
            [
                9775,
                9941
            ],
            [
                9941,
                9997
            ],
            [
                9997,
                10170
            ],
            [
                10170,
                10401
            ],
            [
                10401,
                10542
            ],
            [
                10542,
                10673
            ],
            [
                10673,
                10847
            ],
            [
                10847,
                10950
            ],
            [
                10950,
                11049
            ],
            [
                11049,
                11094
            ],
            [
                11094,
                11186
            ],
            [
                11186,
                11231
            ],
            [
                11231,
                11326
            ],
            [
                11326,
                11429
            ],
            [
                11429,
                11525
            ],
            [
                11525,
                11607
            ],
            [
                11607,
                11692
            ],
            [
                11692,
                11766
            ],
            [
                11766,
                11800
            ],
            [
                11800,
                11800
            ],
            [
                11800,
                11800
            ],
            [
                11800,
                11836
            ],
            [
                11836,
                11872
            ],
            [
                11872,
                11884
            ],
            [
                11884,
                11904
            ],
            [
                11904,
                12010
            ],
            [
                12010,
                12111
            ],
            [
                12111,
                12177
            ],
            [
                12177,
                12177
            ],
            [
                12177,
                12308
            ],
            [
                12308,
                12447
            ]
        ]
    }
}