{
    "original": {
        "text": "Let the reader be introduced to Lady Carbury, upon whose character and doings much will depend of whatever interest these pages may have, as she sits at her writing-table in her own room in her own house in Welbeck Street. Lady Carbury spent many hours at her desk, and wrote many letters,--wrote also very much beside letters. She spoke of herself in these days as a woman devoted to Literature, always spelling the word with a big L. Something of the nature of her devotion may be learned by the perusal of three letters which on this morning she had written with a quickly running hand. Lady Carbury was rapid in everything, and in nothing more rapid than in the writing of letters. Here is Letter No. 1;--\nThursday, Welbeck Street.\nDEAR FRIEND,--\nI have taken care that you shall have the early sheets of my two new volumes to-morrow, or Saturday at latest, so that you may, if so minded, give a poor struggler like myself a lift in your next week's paper. Do give a poor struggler a lift. You and I have so much in common, and I have ventured to flatter myself that we are really friends! I do not flatter you when I say, that not only would aid from you help me more than from any other quarter, but also that praise from you would gratify my vanity more than any other praise. I almost think you will like my \"Criminal Queens.\" The sketch of Semiramis is at any rate spirited, though I had to twist it about a little to bring her in guilty. Cleopatra, of course, I have taken from Shakespeare. What a wench she was! I could not quite make Julia a queen; but it was impossible to pass over so piquant a character. You will recognise in the two or three ladies of the empire how faithfully I have studied my Gibbon. Poor dear old Belisarius! I have done the best I could with Joanna, but I could not bring myself to care for her. In our days she would simply have gone to Broadmore. I hope you will not think that I have been too strong in my delineations of Henry VIII. and his sinful but unfortunate Howard. I don't care a bit about Anne Boleyne. I am afraid that I have been tempted into too great length about the Italian Catherine; but in truth she has been my favourite. What a woman! What a devil! Pity that a second Dante could not have constructed for her a special hell. How one traces the effect of her training in the life of our Scotch Mary. I trust you will go with me in my view as to the Queen of Scots. Guilty! guilty always! Adultery, murder, treason, and all the rest of it. But recommended to mercy because she was royal. A queen bred, born and married, and with such other queens around her, how could she have escaped to be guilty? Marie Antoinette I have not quite acquitted. It would be uninteresting;--perhaps untrue. I have accused her lovingly, and have kissed when I scourged. I trust the British public will not be angry because I do not whitewash Caroline, especially as I go along with them altogether in abusing her husband.\nBut I must not take up your time by sending you another book, though it gratifies me to think that I am writing what none but yourself will read. Do it yourself, like a dear man, and, as you are great, be merciful. Or rather, as you are a friend, be loving.\nYours gratefully and faithfully,\nMATILDA CARBURY.\nAfter all how few women there are who can raise themselves above the quagmire of what we call love, and make themselves anything but playthings for men. Of almost all these royal and luxurious sinners it was the chief sin that in some phase of their lives they consented to be playthings without being wives. I have striven so hard to be proper; but when girls read everything, why should not an old woman write anything?\nThis letter was addressed to Nicholas Broune, Esq., the editor of the \"Morning Breakfast Table,\" a daily newspaper of high character; and, as it was the longest, so was it considered to be the most important of the three. Mr. Broune was a man powerful in his profession,--and he was fond of ladies. Lady Carbury in her letter had called herself an old woman, but she was satisfied to do so by a conviction that no one else regarded her in that light. Her age shall be no secret to the reader, though to her most intimate friends, even to Mr. Broune, it had never been divulged. She was forty-three, but carried her years so well, and had received such gifts from nature, that it was impossible to deny that she was still a beautiful woman. And she used her beauty not only to increase her influence,--as is natural to women who are well-favoured,--but also with a well-considered calculation that she could obtain material assistance in the procuring of bread and cheese, which was very necessary to her, by a prudent adaptation to her purposes of the good things with which providence had endowed her. She did not fall in love, she did not wilfully flirt, she did not commit herself; but she smiled and whispered, and made confidences, and looked out of her own eyes into men's eyes as though there might be some mysterious bond between her and them--if only mysterious circumstances would permit it. But the end of all was to induce some one to do something which would cause a publisher to give her good payment for indifferent writing, or an editor to be lenient when, upon the merits of the case, he should have been severe. Among all her literary friends, Mr. Broune was the one in whom she most trusted; and Mr. Broune was fond of handsome women. It may be as well to give a short record of a scene which had taken place between Lady Carbury and her friend about a month before the writing of this letter which has been produced. She had wanted him to take a series of papers for the \"Morning Breakfast Table,\" and to have them paid for at rate No. 1, whereas she suspected that he was rather doubtful as to their merit, and knew that, without special favour, she could not hope for remuneration above rate No. 2, or possibly even No. 3. So she had looked into his eyes, and had left her soft, plump hand for a moment in his. A man in such circumstances is so often awkward, not knowing with any accuracy when to do one thing and when another! Mr. Broune, in a moment of enthusiasm, had put his arm round Lady Carbury's waist and had kissed her. To say that Lady Carbury was angry, as most women would be angry if so treated, would be to give an unjust idea of her character. It was a little accident which really carried with it no injury, unless it should be the injury of leading to a rupture between herself and a valuable ally. No feeling of delicacy was shocked. What did it matter? No unpardonable insult had been offered; no harm had been done, if only the dear susceptible old donkey could be made at once to understand that that wasn't the way to go on!\nWithout a flutter, and without a blush, she escaped from his arm, and then made him an excellent little speech. \"Mr. Broune, how foolish, how wrong, how mistaken! Is it not so? Surely you do not wish to put an end to the friendship between us!\"\n\"Put an end to our friendship, Lady Carbury! Oh, certainly not that.\"\n\"Then why risk it by such an act? Think of my son and of my daughter,--both grown up. Think of the past troubles of my life;--so much suffered and so little deserved. No one knows them so well as you do. Think of my name, that has been so often slandered but never disgraced! Say that you are sorry, and it shall be forgotten.\"\nWhen a man has kissed a woman it goes against the grain with him to say the very next moment that he is sorry for what he has done. It is as much as to declare that the kiss had not answered his expectation. Mr. Broune could not do this, and perhaps Lady Carbury did not quite expect it. \"You know that for worlds I would not offend you,\" he said. This sufficed. Lady Carbury again looked into his eyes, and a promise was given that the articles should be printed--and with generous remuneration.\nWhen the interview was over Lady Carbury regarded it as having been quite successful. Of course when struggles have to be made and hard work done, there will be little accidents. The lady who uses a street cab must encounter mud and dust which her richer neighbour, who has a private carriage, will escape. She would have preferred not to have been kissed;--but what did it matter? With Mr. Broune the affair was more serious. \"Confound them all,\" he said to himself as he left the house; \"no amount of experience enables a man to know them.\" As he went away he almost thought that Lady Carbury had intended him to kiss her again, and he was almost angry with himself in that he had not done so. He had seen her three or four times since, but had not repeated the offence.\nWe will now go on to the other letters, both of which were addressed to the editors of other newspapers. The second was written to Mr. Booker, of the \"Literary Chronicle.\" Mr. Booker was a hard-working professor of literature, by no means without talent, by no means without influence, and by no means without a conscience. But, from the nature of the struggles in which he had been engaged, by compromises which had gradually been driven upon him by the encroachment of brother authors on the one side and by the demands on the other of employers who looked only to their profits, he had fallen into a routine of work in which it was very difficult to be scrupulous, and almost impossible to maintain the delicacies of a literary conscience. He was now a bald-headed old man of sixty, with a large family of daughters, one of whom was a widow dependent on him with two little children. He had five hundred a year for editing the \"Literary Chronicle,\" which, through his energy, had become a valuable property. He wrote for magazines, and brought out some book of his own almost annually. He kept his head above water, and was regarded by those who knew about him, but did not know him, as a successful man. He always kept up his spirits, and was able in literary circles to show that he could hold his own. But he was driven by the stress of circumstances to take such good things as came in his way, and could hardly afford to be independent. It must be confessed that literary scruple had long departed from his mind. Letter No. 2 was as follows;--\nWelbeck Street, 25th February, 187--.\nDEAR MR. BOOKER,--\nI have told Mr. Leadham--[Mr. Leadham was senior partner in the enterprising firm of publishers known as Messrs. Leadham and Loiter]--to send you an early copy of my \"Criminal Queens.\" I have already settled with my friend Mr. Broune that I am to do your \"New Tale of a Tub\" in the \"Breakfast Table.\" Indeed, I am about it now, and am taking great pains with it. If there is anything you wish to have specially said as to your view of the Protestantism of the time, let me know. I should like you to say a word as to the accuracy of my historical details, which I know you can safely do. Don't put it off, as the sale does so much depend on early notices. I am only getting a royalty, which does not commence till the first four hundred are sold.\nYours sincerely,\nMATILDA CARBURY.\nALFRED BOOKER, Esq., \"Literary Chronicle,\" Office, Strand.\nThere was nothing in this which shocked Mr. Booker. He laughed inwardly, with a pleasantly reticent chuckle, as he thought of Lady Carbury dealing with his views of Protestantism,--as he thought also of the numerous historical errors into which that clever lady must inevitably fall in writing about matters of which he believed her to know nothing. But he was quite alive to the fact that a favourable notice in the \"Breakfast Table\" of his very thoughtful work, called the \"New Tale of a Tub,\" would serve him, even though written by the hand of a female literary charlatan, and he would have no compunction as to repaying the service by fulsome praise in the \"Literary Chronicle.\" He would not probably say that the book was accurate, but he would be able to declare that it was delightful reading, that the feminine characteristics of the queens had been touched with a masterly hand, and that the work was one which would certainly make its way into all drawing-rooms. He was an adept at this sort of work, and knew well how to review such a book as Lady Carbury's \"Criminal Queens,\" without bestowing much trouble on the reading. He could almost do it without cutting the book, so that its value for purposes of after sale might not be injured. And yet Mr. Booker was an honest man, and had set his face persistently against many literary malpractices. Stretched-out type, insufficient lines, and the French habit of meandering with a few words over an entire page, had been rebuked by him with conscientious strength. He was supposed to be rather an Aristides among reviewers. But circumstanced as he was he could not oppose himself altogether to the usages of the time. \"Bad; of course it is bad,\" he said to a young friend who was working with him on his periodical. \"Who doubts that? How many very bad things are there that we do! But if we were to attempt to reform all our bad ways at once, we should never do any good thing. I am not strong enough to put the world straight, and I doubt if you are.\" Such was Mr. Booker.\nThen there was letter No. 3, to Mr. Ferdinand Alf. Mr. Alf managed, and, as it was supposed, chiefly owned, the \"Evening Pulpit,\" which during the last two years had become \"quite a property,\" as men connected with the press were in the habit of saying. The \"Evening Pulpit\" was supposed to give daily to its readers all that had been said and done up to two o'clock in the day by all the leading people in the metropolis, and to prophesy with wonderful accuracy what would be the sayings and doings of the twelve following hours. This was effected with an air of wonderful omniscience, and not unfrequently with an ignorance hardly surpassed by its arrogance. But the writing was clever. The facts, if not true, were well invented; the arguments, if not logical, were seductive. The presiding spirit of the paper had the gift, at any rate, of knowing what the people for whom he catered would like to read, and how to get his subjects handled, so that the reading should be pleasant. Mr. Booker's \"Literary Chronicle\" did not presume to entertain any special political opinions. The \"Breakfast Table\" was decidedly Liberal. The \"Evening Pulpit\" was much given to politics, but held strictly to the motto which it had assumed;--\n\"Nullius addictus jurare in verba magistri;\"--\nand consequently had at all times the invaluable privilege of abusing what was being done, whether by one side or by the other. A newspaper that wishes to make its fortune should never waste its columns and weary its readers by praising anything. Eulogy is invariably dull,--a fact that Mr. Alf had discovered and had utilized.\nMr. Alf had, moreover, discovered another fact. Abuse from those who occasionally praise is considered to be personally offensive, and they who give personal offence will sometimes make the world too hot to hold them. But censure from those who are always finding fault is regarded so much as a matter of course that it ceases to be objectionable. The caricaturist, who draws only caricatures, is held to be justifiable, let him take what liberties he may with a man's face and person. It is his trade, and his business calls upon him to vilify all that he touches. But were an artist to publish a series of portraits, in which two out of a dozen were made to be hideous, he would certainly make two enemies, if not more. Mr. Alf never made enemies, for he praised no one, and, as far as the expression of his newspaper went, was satisfied with nothing.\nPersonally, Mr. Alf was a remarkable man. No one knew whence he came or what he had been. He was supposed to have been born a German Jew; and certain ladies said that they could distinguish in his tongue the slightest possible foreign accent. Nevertheless it was conceded to him that he knew England as only an Englishman can know it. During the last year or two he had \"come up\" as the phrase goes, and had come up very thoroughly. He had been black-balled at three or four clubs, but had effected an entrance at two or three others, and had learned a manner of speaking of those which had rejected him calculated to leave on the minds of hearers a conviction that the societies in question were antiquated, imbecile, and moribund. He was never weary of implying that not to know Mr. Alf, not to be on good terms with Mr. Alf, not to understand that let Mr. Alf have been born where he might and how he might he was always to be recognised as a desirable acquaintance, was to be altogether out in the dark. And that which he so constantly asserted, or implied, men and women around him began at last to believe,--and Mr. Alf became an acknowledged something in the different worlds of politics, letters, and fashion.\nHe was a good-looking man, about forty years old, but carrying himself as though he was much younger, spare, below the middle height, with dark brown hair which would have shown a tinge of grey but for the dyer's art, with well-cut features, with a smile constantly on his mouth the pleasantness of which was always belied by the sharp severity of his eyes. He dressed with the utmost simplicity, but also with the utmost care. He was unmarried, had a small house of his own close to Berkeley Square at which he gave remarkable dinner parties, kept four or five hunters in Northamptonshire, and was reputed to earn 6,000 a year out of the \"Evening Pulpit\" and to spend about half of that income. He also was intimate after his fashion with Lady Carbury, whose diligence in making and fostering useful friendships had been unwearied. Her letter to Mr. Alf was as follows;--\nDEAR MR. ALF,--\nDo tell me who wrote the review on Fitzgerald Barker's last poem. Only I know you won't. I remember nothing done so well. I should think the poor wretch will hardly hold his head up again before the autumn. But it was fully deserved. I have no patience with the pretensions of would-be poets who contrive by toadying and underground influences to get their volumes placed on every drawing-room table. I know no one to whom the world has been so good-natured in this way as to Fitzgerald Barker, but I have heard of no one who has extended the good nature to the length of reading his poetry.\nIs it not singular how some men continue to obtain the reputation of popular authorship without adding a word to the literature of their country worthy of note? It is accomplished by unflagging assiduity in the system of puffing. To puff and to get one's self puffed have become different branches of a new profession. Alas, me! I wish I might find a class open in which lessons could be taken by such a poor tyro as myself. Much as I hate the thing from my very soul, and much as I admire the consistency with which the \"Pulpit\" has opposed it, I myself am so much in want of support for my own little efforts, and am struggling so hard honestly to make for myself a remunerative career, that I think, were the opportunity offered to me, I should pocket my honour, lay aside the high feeling which tells me that praise should be bought neither by money nor friendship, and descend among the low things, in order that I might one day have the pride of feeling that I had succeeded by my own work in providing for the needs of my children.\nBut I have not as yet commenced the descent downwards; and therefore I am still bold enough to tell you that I shall look, not with concern but with a deep interest, to anything which may appear in the \"Pulpit\" respecting my \"Criminal Queens.\" I venture to think that the book,--though I wrote it myself,--has an importance of its own which will secure for it some notice. That my inaccuracy will be laid bare and presumption scourged I do not in the least doubt, but I think your reviewer will be able to certify that the sketches are life-like and the portraits well considered. You will not hear me told, at any rate, that I had better sit at home and darn my stockings, as you said the other day of that poor unfortunate Mrs. Effington Stubbs.\nI have not seen you for the last three weeks. I have a few friends every Tuesday evening;--pray come next week or the week following. And pray believe that no amount of editorial or critical severity shall make me receive you otherwise than with a smile.\nMost sincerely yours,\nMATILDA CARBURY.\nLady Carbury, having finished her third letter, threw herself back in her chair, and for a moment or two closed her eyes, as though about to rest. But she soon remembered that the activity of her life did not admit of such rest. She therefore seized her pen and began scribbling further notes.",
        "paragraph_chars": [
            [
                0,
                710
            ],
            [
                710,
                736
            ],
            [
                736,
                751
            ],
            [
                751,
                2962
            ],
            [
                2962,
                3220
            ],
            [
                3220,
                3253
            ],
            [
                3253,
                3270
            ],
            [
                3270,
                3692
            ],
            [
                3692,
                6763
            ],
            [
                6763,
                7008
            ],
            [
                7008,
                7078
            ],
            [
                7078,
                7406
            ],
            [
                7406,
                7903
            ],
            [
                7903,
                8676
            ],
            [
                8676,
                10228
            ],
            [
                10228,
                10266
            ],
            [
                10266,
                10285
            ],
            [
                10285,
                11032
            ],
            [
                11032,
                11049
            ],
            [
                11049,
                11066
            ],
            [
                11066,
                11125
            ],
            [
                11125,
                13159
            ],
            [
                13159,
                14388
            ],
            [
                14388,
                14435
            ],
            [
                14435,
                14763
            ],
            [
                14763,
                15617
            ],
            [
                15617,
                16835
            ],
            [
                16835,
                17708
            ],
            [
                17708,
                17724
            ],
            [
                17724,
                18316
            ],
            [
                18316,
                19355
            ],
            [
                19355,
                20103
            ],
            [
                20103,
                20358
            ],
            [
                20358,
                20380
            ],
            [
                20380,
                20397
            ],
            [
                20397,
                20690
            ]
        ],
        "segment_chars": [
            [
                0,
                223
            ],
            [
                223,
                328
            ],
            [
                328,
                590
            ],
            [
                590,
                686
            ],
            [
                686,
                710
            ],
            [
                710,
                736
            ],
            [
                736,
                751
            ],
            [
                751,
                961
            ],
            [
                961,
                994
            ],
            [
                994,
                1094
            ],
            [
                1094,
                1284
            ],
            [
                1284,
                1335
            ],
            [
                1335,
                1448
            ],
            [
                1448,
                1501
            ],
            [
                1501,
                1523
            ],
            [
                1523,
                1620
            ],
            [
                1620,
                1721
            ],
            [
                1721,
                1747
            ],
            [
                1747,
                1835
            ],
            [
                1835,
                1888
            ],
            [
                1888,
                1976
            ],
            [
                1976,
                2015
            ],
            [
                2015,
                2054
            ],
            [
                2054,
                2182
            ],
            [
                2182,
                2196
            ],
            [
                2196,
                2210
            ],
            [
                2210,
                2286
            ],
            [
                2286,
                2360
            ],
            [
                2360,
                2425
            ],
            [
                2425,
                2433
            ],
            [
                2433,
                2448
            ],
            [
                2448,
                2499
            ],
            [
                2499,
                2547
            ],
            [
                2547,
                2659
            ],
            [
                2659,
                2704
            ],
            [
                2704,
                2748
            ],
            [
                2748,
                2810
            ],
            [
                2810,
                2962
            ],
            [
                2962,
                3108
            ],
            [
                3108,
                3177
            ],
            [
                3177,
                3220
            ],
            [
                3220,
                3253
            ],
            [
                3253,
                3270
            ],
            [
                3270,
                3423
            ],
            [
                3423,
                3579
            ],
            [
                3579,
                3692
            ],
            [
                3692,
                3914
            ],
            [
                3914,
                3991
            ],
            [
                3991,
                4143
            ],
            [
                4143,
                4270
            ],
            [
                4270,
                4432
            ],
            [
                4432,
                4795
            ],
            [
                4795,
                5094
            ],
            [
                5094,
                5322
            ],
            [
                5322,
                5446
            ],
            [
                5446,
                5629
            ],
            [
                5629,
                5937
            ],
            [
                5937,
                6025
            ],
            [
                6025,
                6143
            ],
            [
                6143,
                6245
            ],
            [
                6245,
                6375
            ],
            [
                6375,
                6532
            ],
            [
                6532,
                6568
            ],
            [
                6568,
                6588
            ],
            [
                6588,
                6763
            ],
            [
                6763,
                6875
            ],
            [
                6875,
                6926
            ],
            [
                6926,
                6940
            ],
            [
                6940,
                7008
            ],
            [
                7008,
                7053
            ],
            [
                7053,
                7078
            ],
            [
                7078,
                7112
            ],
            [
                7112,
                7164
            ],
            [
                7164,
                7245
            ],
            [
                7245,
                7282
            ],
            [
                7282,
                7354
            ],
            [
                7354,
                7406
            ],
            [
                7406,
                7538
            ],
            [
                7538,
                7614
            ],
            [
                7614,
                7694
            ],
            [
                7694,
                7754
            ],
            [
                7754,
                7769
            ],
            [
                7769,
                7903
            ],
            [
                7903,
                7989
            ],
            [
                7989,
                8082
            ],
            [
                8082,
                8210
            ],
            [
                8210,
                8285
            ],
            [
                8285,
                8330
            ],
            [
                8330,
                8446
            ],
            [
                8446,
                8599
            ],
            [
                8599,
                8676
            ],
            [
                8676,
                8781
            ],
            [
                8781,
                8848
            ],
            [
                8848,
                9000
            ],
            [
                9000,
                9419
            ],
            [
                9419,
                9563
            ],
            [
                9563,
                9687
            ],
            [
                9687,
                9765
            ],
            [
                9765,
                9884
            ],
            [
                9884,
                9984
            ],
            [
                9984,
                10121
            ],
            [
                10121,
                10197
            ],
            [
                10197,
                10228
            ],
            [
                10228,
                10266
            ],
            [
                10266,
                10285
            ],
            [
                10285,
                10470
            ],
            [
                10470,
                10586
            ],
            [
                10586,
                10648
            ],
            [
                10648,
                10764
            ],
            [
                10764,
                10873
            ],
            [
                10873,
                10941
            ],
            [
                10941,
                11032
            ],
            [
                11032,
                11049
            ],
            [
                11049,
                11066
            ],
            [
                11066,
                11125
            ],
            [
                11125,
                11177
            ],
            [
                11177,
                11475
            ],
            [
                11475,
                11809
            ],
            [
                11809,
                12099
            ],
            [
                12099,
                12261
            ],
            [
                12261,
                12376
            ],
            [
                12376,
                12484
            ],
            [
                12484,
                12650
            ],
            [
                12650,
                12709
            ],
            [
                12709,
                12803
            ],
            [
                12803,
                12901
            ],
            [
                12901,
                12919
            ],
            [
                12919,
                12966
            ],
            [
                12966,
                13063
            ],
            [
                13063,
                13138
            ],
            [
                13138,
                13159
            ],
            [
                13159,
                13210
            ],
            [
                13210,
                13413
            ],
            [
                13413,
                13690
            ],
            [
                13690,
                13820
            ],
            [
                13820,
                13848
            ],
            [
                13848,
                13939
            ],
            [
                13939,
                14144
            ],
            [
                14144,
                14239
            ],
            [
                14239,
                14284
            ],
            [
                14284,
                14388
            ],
            [
                14388,
                14435
            ],
            [
                14435,
                14563
            ],
            [
                14563,
                14682
            ],
            [
                14682,
                14763
            ],
            [
                14763,
                14811
            ],
            [
                14811,
                14981
            ],
            [
                14981,
                15111
            ],
            [
                15111,
                15249
            ],
            [
                15249,
                15329
            ],
            [
                15329,
                15485
            ],
            [
                15485,
                15617
            ],
            [
                15617,
                15659
            ],
            [
                15659,
                15707
            ],
            [
                15707,
                15860
            ],
            [
                15860,
                15952
            ],
            [
                15952,
                16050
            ],
            [
                16050,
                16350
            ],
            [
                16350,
                16625
            ],
            [
                16625,
                16835
            ],
            [
                16835,
                17193
            ],
            [
                17193,
                17263
            ],
            [
                17263,
                17531
            ],
            [
                17531,
                17668
            ],
            [
                17668,
                17708
            ],
            [
                17708,
                17724
            ],
            [
                17724,
                17790
            ],
            [
                17790,
                17813
            ],
            [
                17813,
                17846
            ],
            [
                17846,
                17931
            ],
            [
                17931,
                17958
            ],
            [
                17958,
                18125
            ],
            [
                18125,
                18316
            ],
            [
                18316,
                18477
            ],
            [
                18477,
                18546
            ],
            [
                18546,
                18635
            ],
            [
                18635,
                18645
            ],
            [
                18645,
                18741
            ],
            [
                18741,
                19355
            ],
            [
                19355,
                19599
            ],
            [
                19599,
                19728
            ],
            [
                19728,
                19936
            ],
            [
                19936,
                20103
            ],
            [
                20103,
                20149
            ],
            [
                20149,
                20237
            ],
            [
                20237,
                20358
            ],
            [
                20358,
                20380
            ],
            [
                20380,
                20397
            ],
            [
                20397,
                20544
            ],
            [
                20544,
                20626
            ],
            [
                20626,
                20690
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                32,
                44
            ],
            [
                136,
                177
            ],
            [
                198,
                223
            ],
            [
                223,
                265
            ],
            [
                281,
                289
            ],
            [
                266,
                269
            ],
            [
                307,
                311
            ],
            [
                326,
                328
            ],
            [
                328,
                348
            ],
            [
                363,
                435
            ],
            [
                449,
                493
            ],
            [
                494,
                497
            ],
            [
                509,
                522
            ],
            [
                545,
                560
            ],
            [
                532,
                544
            ],
            [
                588,
                589
            ],
            [
                686,
                706
            ],
            [
                736,
                748
            ],
            [
                774,
                798
            ],
            [
                806,
                827
            ],
            [
                860,
                881
            ],
            [
                891,
                961
            ],
            [
                961,
                994
            ],
            [
                994,
                1033
            ],
            [
                1066,
                1094
            ],
            [
                1147,
                1159
            ],
            [
                1141,
                1146
            ],
            [
                1160,
                1200
            ],
            [
                1216,
                1245
            ],
            [
                1256,
                1283
            ],
            [
                1284,
                1335
            ],
            [
                1335,
                1361
            ],
            [
                1374,
                1448
            ],
            [
                1448,
                1457
            ],
            [
                1470,
                1501
            ],
            [
                1747,
                1788
            ],
            [
                1835,
                1882
            ],
            [
                1886,
                1888
            ],
            [
                1888,
                1947
            ],
            [
                1961,
                1974
            ],
            [
                1976,
                1983
            ],
            [
                1995,
                2006
            ],
            [
                2007,
                2015
            ],
            [
                2015,
                2050
            ],
            [
                2140,
                2141
            ],
            [
                2360,
                2371
            ],
            [
                2377,
                2398
            ],
            [
                2312,
                2314
            ],
            [
                2405,
                2425
            ],
            [
                2425,
                2433
            ],
            [
                2433,
                2448
            ],
            [
                2448,
                2499
            ],
            [
                2659,
                2682
            ],
            [
                2755,
                2762
            ],
            [
                2767,
                2775
            ],
            [
                2808,
                2810
            ],
            [
                2810,
                2890
            ],
            [
                2960,
                2962
            ],
            [
                2962,
                2994
            ],
            [
                3106,
                3108
            ],
            [
                3136,
                3139
            ],
            [
                3144,
                3175
            ],
            [
                3175,
                3177
            ],
            [
                3177,
                3220
            ],
            [
                3220,
                3253
            ],
            [
                3253,
                3270
            ],
            [
                3579,
                3585
            ],
            [
                3597,
                3692
            ],
            [
                3692,
                3737
            ],
            [
                3744,
                3761
            ],
            [
                3763,
                3786
            ],
            [
                3829,
                3830
            ],
            [
                3789,
                3790
            ],
            [
                3797,
                3824
            ],
            [
                3852,
                3853
            ],
            [
                3864,
                3912
            ],
            [
                3791,
                3796
            ],
            [
                3912,
                3914
            ],
            [
                3914,
                3930
            ],
            [
                3935,
                3943
            ],
            [
                3931,
                3934
            ],
            [
                3964,
                3967
            ],
            [
                3975,
                3990
            ],
            [
                3991,
                4017
            ],
            [
                4022,
                4072
            ],
            [
                4098,
                4127
            ],
            [
                4141,
                4143
            ],
            [
                4270,
                4294
            ],
            [
                4407,
                4412
            ],
            [
                4415,
                4424
            ],
            [
                4430,
                4432
            ],
            [
                4432,
                4455
            ],
            [
                4537,
                4538
            ],
            [
                4465,
                4491
            ],
            [
                4652,
                4655
            ],
            [
                4692,
                4695
            ],
            [
                4626,
                4628
            ],
            [
                4724,
                4727
            ],
            [
                4646,
                4651
            ],
            [
                4793,
                4795
            ],
            [
                4795,
                4832
            ],
            [
                4842,
                4910
            ],
            [
                4933,
                4939
            ],
            [
                4960,
                5042
            ],
            [
                5092,
                5094
            ],
            [
                5113,
                5126
            ],
            [
                5170,
                5171
            ],
            [
                5136,
                5138
            ],
            [
                5230,
                5258
            ],
            [
                5263,
                5264
            ],
            [
                5158,
                5163
            ],
            [
                5207,
                5230
            ],
            [
                5320,
                5321
            ],
            [
                5322,
                5327
            ],
            [
                5332,
                5376
            ],
            [
                5385,
                5446
            ],
            [
                5446,
                5466
            ],
            [
                5490,
                5527
            ],
            [
                5562,
                5569
            ],
            [
                5627,
                5629
            ],
            [
                5629,
                5667
            ],
            [
                5675,
                5682
            ],
            [
                5684,
                5707
            ],
            [
                5749,
                5750
            ],
            [
                5710,
                5716
            ],
            [
                5732,
                5735
            ],
            [
                5722,
                5726
            ],
            [
                5736,
                5749
            ],
            [
                5833,
                5834
            ],
            [
                5759,
                5780
            ],
            [
                5807,
                5833
            ],
            [
                5835,
                5881
            ],
            [
                5895,
                5915
            ],
            [
                5925,
                5937
            ],
            [
                5937,
                5991
            ],
            [
                5999,
                6024
            ],
            [
                6025,
                6072
            ],
            [
                6141,
                6143
            ],
            [
                6143,
                6228
            ],
            [
                6233,
                6245
            ],
            [
                6262,
                6273
            ],
            [
                6274,
                6280
            ],
            [
                6629,
                6705
            ],
            [
                6714,
                6763
            ],
            [
                6763,
                6780
            ],
            [
                6794,
                6842
            ],
            [
                6847,
                6874
            ],
            [
                6875,
                6904
            ],
            [
                6916,
                6926
            ],
            [
                6940,
                7008
            ],
            [
                7008,
                7009
            ],
            [
                7016,
                7019
            ],
            [
                7023,
                7053
            ],
            [
                7053,
                7056
            ],
            [
                7075,
                7078
            ],
            [
                7078,
                7112
            ],
            [
                7112,
                7131
            ],
            [
                7135,
                7146
            ],
            [
                7149,
                7164
            ],
            [
                7164,
                7201
            ],
            [
                7204,
                7245
            ],
            [
                7282,
                7299
            ],
            [
                7314,
                7354
            ],
            [
                7354,
                7406
            ],
            [
                7406,
                7515
            ],
            [
                7536,
                7538
            ],
            [
                7614,
                7693
            ],
            [
                7694,
                7754
            ],
            [
                7754,
                7769
            ],
            [
                7769,
                7813
            ],
            [
                7834,
                7869
            ],
            [
                7875,
                7888
            ],
            [
                7901,
                7902
            ],
            [
                7936,
                7952
            ],
            [
                7912,
                7921
            ],
            [
                7956,
                7958
            ],
            [
                7971,
                7989
            ],
            [
                8210,
                8259
            ],
            [
                8261,
                8284
            ],
            [
                8285,
                8329
            ],
            [
                8330,
                8339
            ],
            [
                8345,
                8348
            ],
            [
                8348,
                8390
            ],
            [
                8462,
                8570
            ],
            [
                8586,
                8589
            ],
            [
                8595,
                8599
            ],
            [
                8599,
                8676
            ],
            [
                8676,
                8715
            ],
            [
                8724,
                8781
            ],
            [
                8781,
                8825
            ],
            [
                8836,
                8845
            ],
            [
                8848,
                8902
            ],
            [
                9426,
                9429
            ],
            [
                9455,
                9494
            ],
            [
                9561,
                9563
            ],
            [
                9563,
                9605
            ],
            [
                9616,
                9625
            ],
            [
                9709,
                9714
            ],
            [
                9768,
                9793
            ],
            [
                9687,
                9689
            ],
            [
                9740,
                9747
            ],
            [
                9928,
                9947
            ],
            [
                9982,
                9984
            ],
            [
                9984,
                10081
            ],
            [
                10121,
                10197
            ],
            [
                10197,
                10225
            ],
            [
                10266,
                10282
            ],
            [
                10285,
                10296
            ],
            [
                10370,
                10380
            ],
            [
                10398,
                10416
            ],
            [
                10419,
                10470
            ],
            [
                10470,
                10531
            ],
            [
                10535,
                10566
            ],
            [
                10578,
                10583
            ],
            [
                10586,
                10598
            ],
            [
                10605,
                10648
            ],
            [
                10648,
                10700
            ],
            [
                10707,
                10764
            ],
            [
                10764,
                10873
            ],
            [
                10873,
                10941
            ],
            [
                10941,
                10968
            ],
            [
                10999,
                11032
            ],
            [
                11032,
                11049
            ],
            [
                11049,
                11066
            ],
            [
                11125,
                11177
            ],
            [
                11177,
                11196
            ],
            [
                11232,
                11303
            ],
            [
                11306,
                11391
            ],
            [
                11403,
                11475
            ],
            [
                11475,
                11491
            ],
            [
                11510,
                11541
            ],
            [
                11553,
                11558
            ],
            [
                11560,
                11588
            ],
            [
                11596,
                11626
            ],
            [
                11633,
                11636
            ],
            [
                11700,
                11734
            ],
            [
                11741,
                11749
            ],
            [
                11658,
                11660
            ],
            [
                11780,
                11782
            ],
            [
                11809,
                11817
            ],
            [
                11822,
                11830
            ],
            [
                11818,
                11821
            ],
            [
                11831,
                11875
            ],
            [
                11887,
                11926
            ],
            [
                12014,
                12017
            ],
            [
                12046,
                12051
            ],
            [
                12062,
                12098
            ],
            [
                12099,
                12105
            ],
            [
                12109,
                12135
            ],
            [
                12259,
                12261
            ],
            [
                12261,
                12290
            ],
            [
                12299,
                12307
            ],
            [
                12374,
                12376
            ],
            [
                12376,
                12383
            ],
            [
                12395,
                12412
            ],
            [
                12386,
                12387
            ],
            [
                13159,
                13210
            ],
            [
                13210,
                13225
            ],
            [
                13267,
                13270
            ],
            [
                13280,
                13286
            ],
            [
                13225,
                13226
            ],
            [
                13289,
                13294
            ],
            [
                13447,
                13454
            ],
            [
                13464,
                13479
            ],
            [
                13302,
                13305
            ],
            [
                13455,
                13460
            ],
            [
                13230,
                13231
            ],
            [
                13586,
                13612
            ],
            [
                13622,
                13665
            ],
            [
                13666,
                13672
            ],
            [
                13683,
                13690
            ],
            [
                13690,
                13694
            ],
            [
                13767,
                13820
            ],
            [
                13820,
                13848
            ],
            [
                13848,
                13939
            ],
            [
                14011,
                14015
            ],
            [
                14082,
                14085
            ],
            [
                14058,
                14065
            ],
            [
                14142,
                14144
            ],
            [
                14284,
                14287
            ],
            [
                14297,
                14303
            ],
            [
                14305,
                14332
            ],
            [
                14413,
                14415
            ],
            [
                14354,
                14357
            ],
            [
                14494,
                14504
            ],
            [
                14510,
                14524
            ],
            [
                14534,
                14536
            ],
            [
                14541,
                14545
            ],
            [
                14561,
                14563
            ],
            [
                14563,
                14574
            ],
            [
                14607,
                14619
            ],
            [
                14642,
                14682
            ],
            [
                14689,
                14691
            ],
            [
                14703,
                14707
            ],
            [
                14710,
                14744
            ],
            [
                14761,
                14763
            ],
            [
                14763,
                14774
            ],
            [
                14786,
                14811
            ],
            [
                14985,
                15032
            ],
            [
                15045,
                15111
            ],
            [
                15111,
                15127
            ],
            [
                15129,
                15155
            ],
            [
                15215,
                15218
            ],
            [
                15192,
                15196
            ],
            [
                15202,
                15214
            ],
            [
                15219,
                15236
            ],
            [
                15247,
                15249
            ],
            [
                15249,
                15264
            ],
            [
                15327,
                15329
            ],
            [
                15329,
                15332
            ],
            [
                15472,
                15474
            ],
            [
                15338,
                15347
            ],
            [
                15333,
                15337
            ],
            [
                15348,
                15414
            ],
            [
                15426,
                15458
            ],
            [
                15463,
                15470
            ],
            [
                15483,
                15485
            ],
            [
                15485,
                15516
            ],
            [
                15569,
                15582
            ],
            [
                15517,
                15534
            ],
            [
                15536,
                15539
            ],
            [
                15608,
                15617
            ],
            [
                15631,
                15659
            ],
            [
                15659,
                15685
            ],
            [
                15705,
                15707
            ],
            [
                15707,
                15754
            ],
            [
                15901,
                15952
            ],
            [
                15952,
                15996
            ],
            [
                16033,
                16050
            ],
            [
                16050,
                16106
            ],
            [
                16119,
                16127
            ],
            [
                16232,
                16234
            ],
            [
                16131,
                16155
            ],
            [
                16189,
                16220
            ],
            [
                16309,
                16313
            ],
            [
                16326,
                16350
            ],
            [
                16350,
                16352
            ],
            [
                16534,
                16540
            ],
            [
                16381,
                16405
            ],
            [
                16587,
                16625
            ],
            [
                16693,
                16709
            ],
            [
                16718,
                16728
            ],
            [
                16731,
                16782
            ],
            [
                16793,
                16835
            ],
            [
                16835,
                16860
            ],
            [
                17021,
                17023
            ],
            [
                16862,
                16873
            ],
            [
                17075,
                17083
            ],
            [
                17118,
                17126
            ],
            [
                17084,
                17089
            ],
            [
                17151,
                17193
            ],
            [
                17531,
                17588
            ],
            [
                17605,
                17607
            ],
            [
                17619,
                17647
            ],
            [
                17666,
                17668
            ],
            [
                17668,
                17705
            ],
            [
                17708,
                17721
            ],
            [
                17724,
                17790
            ],
            [
                17813,
                17846
            ],
            [
                17846,
                17860
            ],
            [
                17865,
                17869
            ],
            [
                17877,
                17911
            ],
            [
                17929,
                17931
            ],
            [
                17931,
                17958
            ],
            [
                17958,
                18040
            ],
            [
                18068,
                18125
            ],
            [
                18125,
                18222
            ],
            [
                18239,
                18245
            ],
            [
                18250,
                18316
            ],
            [
                18316,
                18343
            ],
            [
                18393,
                18400
            ],
            [
                18348,
                18366
            ],
            [
                18496,
                18498
            ],
            [
                18537,
                18544
            ],
            [
                18475,
                18476
            ],
            [
                18546,
                18594
            ],
            [
                18605,
                18635
            ],
            [
                18635,
                18639
            ],
            [
                18643,
                18645
            ],
            [
                18645,
                18653
            ],
            [
                18695,
                18700
            ],
            [
                18687,
                18694
            ],
            [
                18678,
                18680
            ],
            [
                18733,
                18741
            ],
            [
                18741,
                18765
            ],
            [
                18860,
                18863
            ],
            [
                18932,
                18953
            ],
            [
                18963,
                18970
            ],
            [
                18982,
                18983
            ],
            [
                19003,
                19081
            ],
            [
                19186,
                19219
            ],
            [
                18874,
                18876
            ],
            [
                19229,
                19241
            ],
            [
                19250,
                19328
            ],
            [
                19342,
                19355
            ],
            [
                19355,
                19369
            ],
            [
                19373,
                19398
            ],
            [
                19408,
                19520
            ],
            [
                19524,
                19556
            ],
            [
                19561,
                19564
            ],
            [
                19577,
                19599
            ],
            [
                19728,
                19764
            ],
            [
                19790,
                19798
            ],
            [
                19812,
                19860
            ],
            [
                19869,
                19904
            ],
            [
                19919,
                19935
            ],
            [
                20103,
                20149
            ],
            [
                20149,
                20192
            ],
            [
                20199,
                20237
            ],
            [
                20237,
                20281
            ],
            [
                20294,
                20358
            ],
            [
                20358,
                20380
            ],
            [
                20380,
                20397
            ],
            [
                20397,
                20494
            ],
            [
                20502,
                20544
            ],
            [
                20544,
                20605
            ],
            [
                20615,
                20626
            ],
            [
                20626,
                20629
            ],
            [
                20640,
                20690
            ]
        ],
        "row_chars": [
            [
                0,
                223
            ],
            [
                223,
                328
            ],
            [
                328,
                590
            ],
            [
                590,
                686
            ],
            [
                686,
                710
            ],
            [
                710,
                736
            ],
            [
                736,
                751
            ],
            [
                751,
                961
            ],
            [
                961,
                994
            ],
            [
                994,
                1094
            ],
            [
                1094,
                1284
            ],
            [
                1284,
                1335
            ],
            [
                1335,
                1448
            ],
            [
                1448,
                1501
            ],
            [
                1501,
                1523
            ],
            [
                1523,
                1620
            ],
            [
                1620,
                1721
            ],
            [
                1721,
                1747
            ],
            [
                1747,
                1888
            ],
            [
                1888,
                2015
            ],
            [
                2015,
                2425
            ],
            [
                2425,
                2433
            ],
            [
                2433,
                2448
            ],
            [
                2448,
                2499
            ],
            [
                2499,
                2547
            ],
            [
                2547,
                2659
            ],
            [
                2659,
                2810
            ],
            [
                2810,
                2962
            ],
            [
                2962,
                3108
            ],
            [
                3108,
                3177
            ],
            [
                3177,
                3220
            ],
            [
                3220,
                3253
            ],
            [
                3253,
                3270
            ],
            [
                3270,
                3423
            ],
            [
                3423,
                3579
            ],
            [
                3579,
                3692
            ],
            [
                3692,
                3914
            ],
            [
                3914,
                3991
            ],
            [
                3991,
                4143
            ],
            [
                4143,
                4270
            ],
            [
                4270,
                4432
            ],
            [
                4432,
                4795
            ],
            [
                4795,
                5094
            ],
            [
                5094,
                5322
            ],
            [
                5322,
                5446
            ],
            [
                5446,
                5629
            ],
            [
                5629,
                5937
            ],
            [
                5937,
                6025
            ],
            [
                6025,
                6143
            ],
            [
                6143,
                6245
            ],
            [
                6245,
                6763
            ],
            [
                6763,
                6875
            ],
            [
                6875,
                6926
            ],
            [
                6926,
                6940
            ],
            [
                6940,
                7008
            ],
            [
                7008,
                7053
            ],
            [
                7053,
                7078
            ],
            [
                7078,
                7112
            ],
            [
                7112,
                7164
            ],
            [
                7164,
                7245
            ],
            [
                7245,
                7282
            ],
            [
                7282,
                7354
            ],
            [
                7354,
                7406
            ],
            [
                7406,
                7538
            ],
            [
                7538,
                7614
            ],
            [
                7614,
                7694
            ],
            [
                7694,
                7754
            ],
            [
                7754,
                7769
            ],
            [
                7769,
                7903
            ],
            [
                7903,
                7989
            ],
            [
                7989,
                8082
            ],
            [
                8082,
                8210
            ],
            [
                8210,
                8285
            ],
            [
                8285,
                8330
            ],
            [
                8330,
                8446
            ],
            [
                8446,
                8599
            ],
            [
                8599,
                8676
            ],
            [
                8676,
                8781
            ],
            [
                8781,
                8848
            ],
            [
                8848,
                9563
            ],
            [
                9563,
                9984
            ],
            [
                9984,
                10197
            ],
            [
                10197,
                10228
            ],
            [
                10228,
                10266
            ],
            [
                10266,
                10285
            ],
            [
                10285,
                10470
            ],
            [
                10470,
                10586
            ],
            [
                10586,
                10648
            ],
            [
                10648,
                10764
            ],
            [
                10764,
                10873
            ],
            [
                10873,
                10941
            ],
            [
                10941,
                11032
            ],
            [
                11032,
                11049
            ],
            [
                11049,
                11066
            ],
            [
                11066,
                11125
            ],
            [
                11125,
                11177
            ],
            [
                11177,
                11475
            ],
            [
                11475,
                11809
            ],
            [
                11809,
                12099
            ],
            [
                12099,
                12261
            ],
            [
                12261,
                12376
            ],
            [
                12376,
                12484
            ],
            [
                12484,
                12650
            ],
            [
                12650,
                12709
            ],
            [
                12709,
                12803
            ],
            [
                12803,
                12901
            ],
            [
                12901,
                12919
            ],
            [
                12919,
                12966
            ],
            [
                12966,
                13063
            ],
            [
                13063,
                13138
            ],
            [
                13138,
                13159
            ],
            [
                13159,
                13210
            ],
            [
                13210,
                13690
            ],
            [
                13690,
                13820
            ],
            [
                13820,
                13848
            ],
            [
                13848,
                13939
            ],
            [
                13939,
                14144
            ],
            [
                14144,
                14239
            ],
            [
                14239,
                14284
            ],
            [
                14284,
                14563
            ],
            [
                14563,
                14682
            ],
            [
                14682,
                14763
            ],
            [
                14763,
                14811
            ],
            [
                14811,
                14981
            ],
            [
                14981,
                15111
            ],
            [
                15111,
                15249
            ],
            [
                15249,
                15329
            ],
            [
                15329,
                15485
            ],
            [
                15485,
                15617
            ],
            [
                15617,
                15659
            ],
            [
                15659,
                15707
            ],
            [
                15707,
                15952
            ],
            [
                15952,
                16050
            ],
            [
                16050,
                16350
            ],
            [
                16350,
                16625
            ],
            [
                16625,
                16835
            ],
            [
                16835,
                17193
            ],
            [
                17193,
                17263
            ],
            [
                17263,
                17531
            ],
            [
                17531,
                17668
            ],
            [
                17668,
                17708
            ],
            [
                17708,
                17724
            ],
            [
                17724,
                17790
            ],
            [
                17790,
                17813
            ],
            [
                17813,
                17846
            ],
            [
                17846,
                17931
            ],
            [
                17931,
                17958
            ],
            [
                17958,
                18125
            ],
            [
                18125,
                18316
            ],
            [
                18316,
                18546
            ],
            [
                18546,
                18635
            ],
            [
                18635,
                18645
            ],
            [
                18645,
                18741
            ],
            [
                18741,
                19355
            ],
            [
                19355,
                19599
            ],
            [
                19599,
                19728
            ],
            [
                19728,
                19936
            ],
            [
                19936,
                20103
            ],
            [
                20103,
                20149
            ],
            [
                20149,
                20237
            ],
            [
                20237,
                20358
            ],
            [
                20358,
                20380
            ],
            [
                20380,
                20397
            ],
            [
                20397,
                20544
            ],
            [
                20544,
                20626
            ],
            [
                20626,
                20690
            ]
        ]
    },
    "abridged": {
        "text": "Let me introduce Lady Carbury, as she sits at her writing-table in her house in Welbeck Street. Lady Carbury spent many hours at her desk, writing letters, and much else besides. She spoke of herself as a woman devoted to Literature, always spelling the word with a big L. The nature of her devotion may be learned by viewing the three letters she had written this morning.\nHere is Letter No. 1:\nDear Friend,\nYou shall have the early copies of my two new volumes tomorrow, so that you may, if you wish, give a poor struggler like myself a lift in your next week's paper. Do give a poor struggler a lift. You and I have so much in common, and I hope that we are really friends! Aid from you would help me more than from any other quarter; and praise from you would gratify me more than any other praise.\nI almost think you will like my \"Criminal Queens.\" The sketch of Semiramis is spirited, though I had to twist it about a little to bring her in guilty. Cleopatra I have taken from Shakespeare. I have done the best I could with Joanna, though in our days she would simply have gone to Broadmoor. I hope you will not think that I have been too strong in my depiction of Henry VIII and his unfortunate Catherine Howard. I don't care a bit about Anne Boleyn; and I trust you go with me in my view of the Queen of Scots. Guilty! guilty always! Adultery, murder, treason, and all the rest of it. Marie Antoinette I have accused lovingly. I trust the British public will not be angry because I do not whitewash Caroline.\nBut I must not take up your time. Dear man, as you are great, be merciful on my book. Or rather, as you are a friend, be loving.\nYours gratefully and faithfully,\nMatilda Carbury.\nP.S. I have tried hard to be proper; but when girls read everything, why should not an old woman write anything?\nThis letter was addressed to Nicholas Broune, the editor of the Morning Breakfast Table, a newspaper of high character, considered to be the most important of the three daily papers. Mr. Broune was a powerful man - and fond of ladies.\nLady Carbury in her letter called herself an old woman, but she was satisfied that no one else regarded her as old. She was forty-three, but still beautiful. And she used her beauty calculatingly, to increase her influence, and assist her in earning her bread. She did not fall in love, she did not flirt, she did not commit herself; but she smiled and whispered, and looked into men's eyes as though there might be some mysterious bond between her and them. This was to induce a critic to be kind, or an editor to be lenient, so that she would be well paid for indifferent writing.\nAmong her literary friends, Mr. Broune was the one she most trusted; and Mr. Broune was fond of handsome women. It may be as well to describe a scene which had taken place between them a month previously. She had wanted him to take a series of articles for the Morning Breakfast Table, and to pay her for them at rate No. 1. However, she suspected that he doubted their merit, and knew that without special favour, she could not hope for payment above rate No. 2, or even No. 3. So she had looked into his eyes, and had left her soft hand for a moment in his.\nA man in such circumstances is so often awkward! Mr. Broune, in a moment of enthusiasm, had put his arm round Lady Carbury's waist and kissed her. Lady Carbury was not angry, for no harm had been done, if only the dear susceptible old donkey could be made to understand that that wasn't the way to go on!\nWithout a flutter or a blush, she escaped from his arm, and then made an excellent little speech.\n\"Mr. Broune, how foolish, how mistaken! Surely you do not wish to put an end to the friendship between us!\"\n\"End our friendship, Lady Carbury! Oh, no.\"\n\"Then why risk it by such an act? Think of my son and my daughter - both grown up. Think of the past troubles of my life - so much suffered and so little deserved. Think of my name, so often slandered but never disgraced! Say that you are sorry, and it shall be forgotten.\"\nWhen a man has kissed a woman it goes against the grain with him to say the very next moment that he is sorry. Mr. Broune could not do this, and perhaps Lady Carbury did not quite expect it.\n\"You know that for worlds I would not offend you,\" he said. This sufficed. Lady Carbury again looked into his eyes, and he promised that the articles should be printed - with generous payment. Lady Carbury regarded this interview as quite successful. She would have preferred not to have been kissed; but what did it matter?\nWith Mr. Broune the affair was more serious.\n\"Confound all women,\" he said to himself as he left the house. He almost thought that Lady Carbury had intended him to kiss her again, and he was almost angry with himself for not doing so. He had seen her three or four times since, but had not repeated the offence.\nWe will now go on to the other letters, which were addressed to the editors of other newspapers. The second was written to Mr. Booker, of the Literary Chronicle. Mr. Booker was a hard-working professor of literature, now sixty, with a large family of daughters. He had five hundred a year for editing the Literary Chronicle, and kept his head above water; he held his own in literary circles. But he was driven by the stress of circumstances to take such good things as came in his way, and it must be confessed that literary scruple had long departed from his mind. Letter No. 2 was as follows;-\nDear Mr. Booker,\nI have told my publishers Leadham and Loiter to send you an early copy of my \"Criminal Queens.\" I have already settled with my friend Mr. Broune that I am to review your \"New Tale of a Tub\" in the Breakfast Table. Indeed, I am busy with it now, and am taking great pains with it. If there is anything you wish to have specially said about your view of the Protestantism of the time, let me know. I should like you to say a word as to the accuracy of my historical details, which I know you can safely do. Don't put it off, as the sale does so much depend on early notices. I am only getting a royalty after the first four hundred are sold.\nYours sincerely,\nMatilda Carbury.\nThere was nothing in this which shocked Mr. Booker. He laughed inwardly, as he thought of Lady Carbury dealing with his views of Protestantism - and as he thought also of the numerous historical errors into which that clever lady must fall in writing about matters of which he believed her to know nothing. But he was quite aware that a favourable notice in the Breakfast Table of his very thoughtful work, the \"New Tale of a Tub,\" would help him, and he would have no compunction about repaying her by praising her book in his newspaper. He would probably not say that the book was accurate, but he would declare that it was delightful reading, and would make its way into all drawing-rooms.\nHe was adept at this sort of work. He could almost do it without reading the book. And yet he was an honest man.\nThen there was letter No. 3, to Mr. Ferdinand Alf. Mr. Alf managed the Evening Pulpit, which aimed not only to give its readers all the daily news, but to prophesy with wonderful omniscience what would be the sayings and doings of the next twelve hours. This it frequently did with an ignorance hardly surpassed by its arrogance. But the writing was clever. The facts, if not true, were well invented; the arguments, if not logical, were seductive. Mr. Alf knew what his audience liked to read. The Evening Pulpit was much given to politics, in the form of abusing whatever was being done by either side. A newspaper should never weary its readers by praising anything. Praise is dull - a fact that Mr. Alf had discovered.\nMr. Alf had discovered another fact. Censure from those who are always finding fault becomes so much as a matter of course that it ceases to be objectionable. The caricaturist who draws only caricatures may take any liberties he likes with a man's face. It is his trade. But if an artist were to publish a series of portraits, in which two out of a dozen were hideous, he would certainly make enemies. Mr. Alf never made enemies, for in his newspaper he praised no one and nothing.\nMr. Alf was a remarkable man. No one knew whence he came. He was supposed to have been born a German Jew; yet he knew England as only an Englishman can know it. During the last year or two he had \"come up\" in society very thoroughly. He had been black-balled at three or four clubs, but had gained entrance to two or three others, and spoke of those which had rejected him as if they were imbecile, and moribund. He always implied that not to know Mr. Alf was to be altogether out in the dark. Those around him began to believe it - and Mr. Alf became an acknowledged something in the worlds of politics, letters, and fashion.\nHe was a good-looking man of about forty, with a pleasant smile belied by the sharp severity of his eyes. He also was intimate after his fashion with Lady Carbury, who was diligent in fostering useful friendships. Her letter to Mr. Alf was as follows;-\nDear Mr. Alf,\nDo tell me who wrote the review on Fitzgerald Barker's last poem. I remember nothing done so well. I should think poor Barker will hardly hold his head up again. But it was fully deserved. I have no patience with the pretensions of would-be poets who contrive by toadying to get their volumes placed on every drawing-room table. I know no one to whom the world has been so good-natured in this way as to Fitzgerald Barker, but equally no one has extended the good nature to the length of reading his poetry.\nIs it not singular how some authors continue to obtain reputations simply by puffing? To puff and to get one's self puffed have become branches of a new profession. Alas! I wish I could take lessons in it myself. Much as I hate the thing, I am struggling so hard to make a honest living, that I think, were the opportunity offered to me, I should pocket my honour, and descend among the low things, so that I might have the pride of feeling that I had succeeded by my own work in providing for my children.\nBut I have not yet commenced the descent; and therefore I am still bold enough to tell you that I shall look, not with concern but with a deep interest, for anything which may appear in the Pulpit about my \"Criminal Queens.\" That my inaccuracy will be laid bare I do not doubt, but I think your reviewer will be able to say that the sketches are life-like and well considered.\nI have not seen you for the last three weeks. I have a few friends every Tuesday evening; pray come next week or the week following. And pray believe that no amount of editorial severity shall make me receive you otherwise than with a smile.\nMost sincerely yours,\nMatilda Carbury.\nLady Carbury, having finished her third letter, threw herself back in her chair, and for a moment closed her eyes, as though about to rest. But she soon remembered that the activity of her life did not allow such rest. She seized her pen and began scribbling further notes.",
        "paragraph_chars": [
            [
                0,
                374
            ],
            [
                374,
                396
            ],
            [
                396,
                409
            ],
            [
                409,
                803
            ],
            [
                803,
                1517
            ],
            [
                1517,
                1646
            ],
            [
                1646,
                1679
            ],
            [
                1679,
                1696
            ],
            [
                1696,
                1809
            ],
            [
                1809,
                2044
            ],
            [
                2044,
                2627
            ],
            [
                2627,
                3187
            ],
            [
                3187,
                3492
            ],
            [
                3492,
                3590
            ],
            [
                3590,
                3698
            ],
            [
                3698,
                3742
            ],
            [
                3742,
                4016
            ],
            [
                4016,
                4207
            ],
            [
                4207,
                4532
            ],
            [
                4532,
                4577
            ],
            [
                4577,
                4844
            ],
            [
                4844,
                5441
            ],
            [
                5441,
                5458
            ],
            [
                5458,
                6098
            ],
            [
                6098,
                6115
            ],
            [
                6115,
                6132
            ],
            [
                6132,
                6825
            ],
            [
                6825,
                6938
            ],
            [
                6938,
                7661
            ],
            [
                7661,
                8143
            ],
            [
                8143,
                8770
            ],
            [
                8770,
                9023
            ],
            [
                9023,
                9037
            ],
            [
                9037,
                9545
            ],
            [
                9545,
                10052
            ],
            [
                10052,
                10429
            ],
            [
                10429,
                10671
            ],
            [
                10671,
                10693
            ],
            [
                10693,
                10710
            ],
            [
                10710,
                10983
            ]
        ],
        "segment_chars": [
            [
                0,
                96
            ],
            [
                96,
                179
            ],
            [
                179,
                374
            ],
            [
                374,
                396
            ],
            [
                396,
                409
            ],
            [
                409,
                571
            ],
            [
                571,
                604
            ],
            [
                604,
                677
            ],
            [
                677,
                803
            ],
            [
                803,
                854
            ],
            [
                854,
                955
            ],
            [
                955,
                996
            ],
            [
                996,
                1098
            ],
            [
                1098,
                1220
            ],
            [
                1220,
                1319
            ],
            [
                1319,
                1327
            ],
            [
                1327,
                1342
            ],
            [
                1342,
                1393
            ],
            [
                1393,
                1435
            ],
            [
                1435,
                1517
            ],
            [
                1517,
                1551
            ],
            [
                1551,
                1603
            ],
            [
                1603,
                1646
            ],
            [
                1646,
                1679
            ],
            [
                1679,
                1696
            ],
            [
                1696,
                1809
            ],
            [
                1809,
                1992
            ],
            [
                1992,
                2044
            ],
            [
                2044,
                2160
            ],
            [
                2160,
                2202
            ],
            [
                2202,
                2305
            ],
            [
                2305,
                2503
            ],
            [
                2503,
                2627
            ],
            [
                2627,
                2739
            ],
            [
                2739,
                2832
            ],
            [
                2832,
                3106
            ],
            [
                3106,
                3187
            ],
            [
                3187,
                3236
            ],
            [
                3236,
                3334
            ],
            [
                3334,
                3492
            ],
            [
                3492,
                3590
            ],
            [
                3590,
                3630
            ],
            [
                3630,
                3698
            ],
            [
                3698,
                3733
            ],
            [
                3733,
                3742
            ],
            [
                3742,
                3776
            ],
            [
                3776,
                3825
            ],
            [
                3825,
                3906
            ],
            [
                3906,
                3964
            ],
            [
                3964,
                4016
            ],
            [
                4016,
                4127
            ],
            [
                4127,
                4207
            ],
            [
                4207,
                4267
            ],
            [
                4267,
                4282
            ],
            [
                4282,
                4400
            ],
            [
                4400,
                4458
            ],
            [
                4458,
                4532
            ],
            [
                4532,
                4577
            ],
            [
                4577,
                4640
            ],
            [
                4640,
                4767
            ],
            [
                4767,
                4844
            ],
            [
                4844,
                4941
            ],
            [
                4941,
                5006
            ],
            [
                5006,
                5106
            ],
            [
                5106,
                5237
            ],
            [
                5237,
                5411
            ],
            [
                5411,
                5441
            ],
            [
                5441,
                5458
            ],
            [
                5458,
                5554
            ],
            [
                5554,
                5672
            ],
            [
                5672,
                5738
            ],
            [
                5738,
                5854
            ],
            [
                5854,
                5963
            ],
            [
                5963,
                6031
            ],
            [
                6031,
                6098
            ],
            [
                6098,
                6115
            ],
            [
                6115,
                6132
            ],
            [
                6132,
                6184
            ],
            [
                6184,
                6439
            ],
            [
                6439,
                6671
            ],
            [
                6671,
                6825
            ],
            [
                6825,
                6860
            ],
            [
                6860,
                6908
            ],
            [
                6908,
                6938
            ],
            [
                6938,
                6989
            ],
            [
                6989,
                7192
            ],
            [
                7192,
                7268
            ],
            [
                7268,
                7296
            ],
            [
                7296,
                7387
            ],
            [
                7387,
                7433
            ],
            [
                7433,
                7543
            ],
            [
                7543,
                7608
            ],
            [
                7608,
                7661
            ],
            [
                7661,
                7698
            ],
            [
                7698,
                7820
            ],
            [
                7820,
                7915
            ],
            [
                7915,
                7932
            ],
            [
                7932,
                8063
            ],
            [
                8063,
                8143
            ],
            [
                8143,
                8173
            ],
            [
                8173,
                8201
            ],
            [
                8201,
                8304
            ],
            [
                8304,
                8377
            ],
            [
                8377,
                8556
            ],
            [
                8556,
                8637
            ],
            [
                8637,
                8770
            ],
            [
                8770,
                8876
            ],
            [
                8876,
                8984
            ],
            [
                8984,
                9023
            ],
            [
                9023,
                9037
            ],
            [
                9037,
                9103
            ],
            [
                9103,
                9136
            ],
            [
                9136,
                9199
            ],
            [
                9199,
                9226
            ],
            [
                9226,
                9366
            ],
            [
                9366,
                9545
            ],
            [
                9545,
                9631
            ],
            [
                9631,
                9710
            ],
            [
                9710,
                9716
            ],
            [
                9716,
                9758
            ],
            [
                9758,
                10052
            ],
            [
                10052,
                10277
            ],
            [
                10277,
                10429
            ],
            [
                10429,
                10475
            ],
            [
                10475,
                10562
            ],
            [
                10562,
                10671
            ],
            [
                10671,
                10693
            ],
            [
                10693,
                10710
            ],
            [
                10710,
                10850
            ],
            [
                10850,
                10929
            ],
            [
                10929,
                10983
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                17,
                29
            ],
            [
                29,
                70
            ],
            [
                71,
                96
            ],
            [
                96,
                138
            ],
            [
                147,
                155
            ],
            [
                156,
                159
            ],
            [
                160,
                164
            ],
            [
                177,
                179
            ],
            [
                179,
                199
            ],
            [
                200,
                272
            ],
            [
                273,
                317
            ],
            [
                326,
                329
            ],
            [
                330,
                343
            ],
            [
                344,
                359
            ],
            [
                360,
                372
            ],
            [
                372,
                373
            ],
            [
                374,
                394
            ],
            [
                396,
                408
            ],
            [
                409,
                433
            ],
            [
                441,
                462
            ],
            [
                471,
                492
            ],
            [
                501,
                571
            ],
            [
                571,
                604
            ],
            [
                604,
                643
            ],
            [
                649,
                677
            ],
            [
                677,
                689
            ],
            [
                690,
                695
            ],
            [
                696,
                736
            ],
            [
                742,
                771
            ],
            [
                775,
                802
            ],
            [
                803,
                854
            ],
            [
                854,
                880
            ],
            [
                881,
                955
            ],
            [
                955,
                964
            ],
            [
                965,
                996
            ],
            [
                996,
                1037
            ],
            [
                1045,
                1092
            ],
            [
                1096,
                1098
            ],
            [
                1098,
                1157
            ],
            [
                1168,
                1181
            ],
            [
                1182,
                1189
            ],
            [
                1190,
                1201
            ],
            [
                1212,
                1220
            ],
            [
                1220,
                1255
            ],
            [
                1256,
                1257
            ],
            [
                1262,
                1273
            ],
            [
                1274,
                1295
            ],
            [
                1296,
                1298
            ],
            [
                1299,
                1319
            ],
            [
                1319,
                1327
            ],
            [
                1327,
                1342
            ],
            [
                1342,
                1393
            ],
            [
                1393,
                1416
            ],
            [
                1417,
                1424
            ],
            [
                1425,
                1433
            ],
            [
                1433,
                1435
            ],
            [
                1435,
                1515
            ],
            [
                1515,
                1517
            ],
            [
                1517,
                1549
            ],
            [
                1549,
                1551
            ],
            [
                1556,
                1559
            ],
            [
                1559,
                1590
            ],
            [
                1601,
                1603
            ],
            [
                1603,
                1646
            ],
            [
                1646,
                1679
            ],
            [
                1679,
                1696
            ],
            [
                1701,
                1707
            ],
            [
                1714,
                1809
            ],
            [
                1809,
                1854
            ],
            [
                1855,
                1872
            ],
            [
                1873,
                1896
            ],
            [
                1896,
                1897
            ],
            [
                1898,
                1899
            ],
            [
                1900,
                1927
            ],
            [
                1927,
                1928
            ],
            [
                1929,
                1977
            ],
            [
                1978,
                1983
            ],
            [
                1990,
                1992
            ],
            [
                1992,
                2008
            ],
            [
                2009,
                2017
            ],
            [
                2018,
                2021
            ],
            [
                2024,
                2027
            ],
            [
                2028,
                2043
            ],
            [
                2044,
                2070
            ],
            [
                2071,
                2121
            ],
            [
                2122,
                2151
            ],
            [
                2158,
                2160
            ],
            [
                2160,
                2184
            ],
            [
                2185,
                2190
            ],
            [
                2191,
                2200
            ],
            [
                2200,
                2202
            ],
            [
                2202,
                2225
            ],
            [
                2239,
                2240
            ],
            [
                2241,
                2267
            ],
            [
                2268,
                2271
            ],
            [
                2279,
                2282
            ],
            [
                2283,
                2285
            ],
            [
                2294,
                2297
            ],
            [
                2298,
                2303
            ],
            [
                2303,
                2305
            ],
            [
                2305,
                2342
            ],
            [
                2343,
                2411
            ],
            [
                2412,
                2418
            ],
            [
                2419,
                2501
            ],
            [
                2501,
                2503
            ],
            [
                2508,
                2521
            ],
            [
                2522,
                2523
            ],
            [
                2531,
                2533
            ],
            [
                2541,
                2569
            ],
            [
                2569,
                2570
            ],
            [
                2583,
                2588
            ],
            [
                2602,
                2625
            ],
            [
                2625,
                2626
            ],
            [
                2627,
                2632
            ],
            [
                2633,
                2677
            ],
            [
                2678,
                2739
            ],
            [
                2739,
                2759
            ],
            [
                2769,
                2806
            ],
            [
                2812,
                2819
            ],
            [
                2830,
                2832
            ],
            [
                2832,
                2870
            ],
            [
                2880,
                2887
            ],
            [
                2888,
                2911
            ],
            [
                2911,
                2912
            ],
            [
                2913,
                2919
            ],
            [
                2928,
                2931
            ],
            [
                2932,
                2936
            ],
            [
                2937,
                2950
            ],
            [
                2959,
                2960
            ],
            [
                2961,
                2982
            ],
            [
                2991,
                3017
            ],
            [
                3018,
                3064
            ],
            [
                3073,
                3093
            ],
            [
                3094,
                3106
            ],
            [
                3106,
                3160
            ],
            [
                3161,
                3186
            ],
            [
                3187,
                3234
            ],
            [
                3234,
                3236
            ],
            [
                3236,
                3321
            ],
            [
                3322,
                3334
            ],
            [
                3339,
                3350
            ],
            [
                3355,
                3361
            ],
            [
                3366,
                3442
            ],
            [
                3443,
                3492
            ],
            [
                3492,
                3509
            ],
            [
                3513,
                3561
            ],
            [
                3562,
                3589
            ],
            [
                3590,
                3619
            ],
            [
                3620,
                3630
            ],
            [
                3630,
                3698
            ],
            [
                3698,
                3699
            ],
            [
                3699,
                3702
            ],
            [
                3703,
                3733
            ],
            [
                3733,
                3736
            ],
            [
                3739,
                3742
            ],
            [
                3742,
                3776
            ],
            [
                3776,
                3795
            ],
            [
                3796,
                3807
            ],
            [
                3810,
                3825
            ],
            [
                3825,
                3862
            ],
            [
                3865,
                3906
            ],
            [
                3906,
                3923
            ],
            [
                3924,
                3964
            ],
            [
                3964,
                4016
            ],
            [
                4016,
                4125
            ],
            [
                4125,
                4127
            ],
            [
                4127,
                4206
            ],
            [
                4207,
                4267
            ],
            [
                4267,
                4282
            ],
            [
                4282,
                4326
            ],
            [
                4339,
                4374
            ],
            [
                4377,
                4390
            ],
            [
                4398,
                4399
            ],
            [
                4405,
                4421
            ],
            [
                4427,
                4436
            ],
            [
                4437,
                4439
            ],
            [
                4440,
                4458
            ],
            [
                4458,
                4507
            ],
            [
                4508,
                4531
            ],
            [
                4532,
                4576
            ],
            [
                4577,
                4586
            ],
            [
                4587,
                4590
            ],
            [
                4596,
                4638
            ],
            [
                4640,
                4748
            ],
            [
                4753,
                4756
            ],
            [
                4763,
                4767
            ],
            [
                4767,
                4844
            ],
            [
                4844,
                4883
            ],
            [
                4884,
                4941
            ],
            [
                4941,
                4985
            ],
            [
                4995,
                5004
            ],
            [
                5006,
                5060
            ],
            [
                5061,
                5064
            ],
            [
                5065,
                5104
            ],
            [
                5104,
                5106
            ],
            [
                5106,
                5148
            ],
            [
                5158,
                5167
            ],
            [
                5167,
                5172
            ],
            [
                5173,
                5198
            ],
            [
                5200,
                5202
            ],
            [
                5208,
                5215
            ],
            [
                5216,
                5235
            ],
            [
                5235,
                5237
            ],
            [
                5237,
                5334
            ],
            [
                5335,
                5411
            ],
            [
                5411,
                5439
            ],
            [
                5441,
                5457
            ],
            [
                5458,
                5469
            ],
            [
                5473,
                5483
            ],
            [
                5484,
                5502
            ],
            [
                5503,
                5554
            ],
            [
                5554,
                5615
            ],
            [
                5623,
                5654
            ],
            [
                5665,
                5670
            ],
            [
                5672,
                5684
            ],
            [
                5695,
                5738
            ],
            [
                5738,
                5790
            ],
            [
                5797,
                5854
            ],
            [
                5854,
                5963
            ],
            [
                5963,
                6031
            ],
            [
                6031,
                6058
            ],
            [
                6065,
                6098
            ],
            [
                6098,
                6115
            ],
            [
                6115,
                6132
            ],
            [
                6132,
                6184
            ],
            [
                6184,
                6203
            ],
            [
                6203,
                6274
            ],
            [
                6281,
                6366
            ],
            [
                6367,
                6439
            ],
            [
                6439,
                6455
            ],
            [
                6462,
                6493
            ],
            [
                6504,
                6509
            ],
            [
                6510,
                6538
            ],
            [
                6539,
                6569
            ],
            [
                6575,
                6578
            ],
            [
                6578,
                6612
            ],
            [
                6619,
                6627
            ],
            [
                6632,
                6634
            ],
            [
                6653,
                6655
            ],
            [
                6671,
                6679
            ],
            [
                6680,
                6688
            ],
            [
                6689,
                6692
            ],
            [
                6693,
                6737
            ],
            [
                6738,
                6777
            ],
            [
                6778,
                6781
            ],
            [
                6782,
                6787
            ],
            [
                6788,
                6824
            ],
            [
                6825,
                6831
            ],
            [
                6832,
                6858
            ],
            [
                6858,
                6860
            ],
            [
                6860,
                6889
            ],
            [
                6898,
                6906
            ],
            [
                6906,
                6908
            ],
            [
                6908,
                6915
            ],
            [
                6919,
                6936
            ],
            [
                6936,
                6937
            ],
            [
                6938,
                6989
            ],
            [
                6989,
                7004
            ],
            [
                7005,
                7008
            ],
            [
                7017,
                7023
            ],
            [
                7023,
                7024
            ],
            [
                7025,
                7030
            ],
            [
                7046,
                7053
            ],
            [
                7054,
                7069
            ],
            [
                7070,
                7073
            ],
            [
                7074,
                7079
            ],
            [
                7084,
                7085
            ],
            [
                7090,
                7116
            ],
            [
                7129,
                7172
            ],
            [
                7178,
                7184
            ],
            [
                7185,
                7192
            ],
            [
                7192,
                7196
            ],
            [
                7215,
                7268
            ],
            [
                7268,
                7296
            ],
            [
                7296,
                7387
            ],
            [
                7400,
                7404
            ],
            [
                7405,
                7408
            ],
            [
                7424,
                7431
            ],
            [
                7431,
                7433
            ],
            [
                7433,
                7436
            ],
            [
                7445,
                7451
            ],
            [
                7452,
                7479
            ],
            [
                7480,
                7482
            ],
            [
                7483,
                7486
            ],
            [
                7492,
                7502
            ],
            [
                7512,
                7526
            ],
            [
                7527,
                7529
            ],
            [
                7537,
                7541
            ],
            [
                7541,
                7543
            ],
            [
                7543,
                7554
            ],
            [
                7555,
                7567
            ],
            [
                7568,
                7608
            ],
            [
                7615,
                7617
            ],
            [
                7618,
                7622
            ],
            [
                7625,
                7659
            ],
            [
                7659,
                7661
            ],
            [
                7661,
                7672
            ],
            [
                7673,
                7698
            ],
            [
                7698,
                7745
            ],
            [
                7754,
                7820
            ],
            [
                7820,
                7836
            ],
            [
                7837,
                7863
            ],
            [
                7864,
                7867
            ],
            [
                7868,
                7872
            ],
            [
                7877,
                7889
            ],
            [
                7896,
                7913
            ],
            [
                7913,
                7915
            ],
            [
                7915,
                7930
            ],
            [
                7930,
                7932
            ],
            [
                7932,
                7935
            ],
            [
                7936,
                7938
            ],
            [
                7939,
                7948
            ],
            [
                7949,
                7953
            ],
            [
                7954,
                8020
            ],
            [
                8021,
                8053
            ],
            [
                8054,
                8061
            ],
            [
                8061,
                8063
            ],
            [
                8063,
                8094
            ],
            [
                8098,
                8111
            ],
            [
                8112,
                8129
            ],
            [
                8130,
                8133
            ],
            [
                8134,
                8143
            ],
            [
                8145,
                8173
            ],
            [
                8173,
                8199
            ],
            [
                8199,
                8201
            ],
            [
                8201,
                8248
            ],
            [
                8253,
                8304
            ],
            [
                8304,
                8348
            ],
            [
                8360,
                8377
            ],
            [
                8377,
                8433
            ],
            [
                8441,
                8449
            ],
            [
                8450,
                8452
            ],
            [
                8453,
                8477
            ],
            [
                8484,
                8515
            ],
            [
                8527,
                8531
            ],
            [
                8532,
                8556
            ],
            [
                8556,
                8558
            ],
            [
                8559,
                8565
            ],
            [
                8574,
                8598
            ],
            [
                8599,
                8637
            ],
            [
                8643,
                8659
            ],
            [
                8660,
                8670
            ],
            [
                8676,
                8727
            ],
            [
                8728,
                8770
            ],
            [
                8770,
                8795
            ],
            [
                8796,
                8798
            ],
            [
                8799,
                8810
            ],
            [
                8810,
                8818
            ],
            [
                8819,
                8827
            ],
            [
                8828,
                8833
            ],
            [
                8834,
                8876
            ],
            [
                8876,
                8933
            ],
            [
                8951,
                8953
            ],
            [
                8954,
                8982
            ],
            [
                8982,
                8984
            ],
            [
                8984,
                9021
            ],
            [
                9023,
                9036
            ],
            [
                9037,
                9103
            ],
            [
                9103,
                9136
            ],
            [
                9136,
                9150
            ],
            [
                9151,
                9155
            ],
            [
                9163,
                9197
            ],
            [
                9197,
                9199
            ],
            [
                9199,
                9226
            ],
            [
                9226,
                9308
            ],
            [
                9309,
                9366
            ],
            [
                9366,
                9463
            ],
            [
                9472,
                9478
            ],
            [
                9479,
                9545
            ],
            [
                9545,
                9572
            ],
            [
                9573,
                9580
            ],
            [
                9581,
                9599
            ],
            [
                9619,
                9621
            ],
            [
                9622,
                9629
            ],
            [
                9629,
                9630
            ],
            [
                9631,
                9679
            ],
            [
                9680,
                9710
            ],
            [
                9710,
                9714
            ],
            [
                9714,
                9716
            ],
            [
                9716,
                9724
            ],
            [
                9725,
                9730
            ],
            [
                9736,
                9743
            ],
            [
                9744,
                9746
            ],
            [
                9750,
                9758
            ],
            [
                9758,
                9782
            ],
            [
                9782,
                9785
            ],
            [
                9786,
                9807
            ],
            [
                9808,
                9815
            ],
            [
                9816,
                9817
            ],
            [
                9831,
                9909
            ],
            [
                9910,
                9943
            ],
            [
                9944,
                9946
            ],
            [
                9947,
                9959
            ],
            [
                9960,
                10038
            ],
            [
                10039,
                10052
            ],
            [
                10052,
                10066
            ],
            [
                10067,
                10092
            ],
            [
                10092,
                10204
            ],
            [
                10209,
                10241
            ],
            [
                10245,
                10248
            ],
            [
                10255,
                10277
            ],
            [
                10277,
                10313
            ],
            [
                10314,
                10322
            ],
            [
                10323,
                10371
            ],
            [
                10376,
                10411
            ],
            [
                10412,
                10428
            ],
            [
                10429,
                10475
            ],
            [
                10475,
                10518
            ],
            [
                10524,
                10562
            ],
            [
                10562,
                10606
            ],
            [
                10607,
                10671
            ],
            [
                10671,
                10693
            ],
            [
                10693,
                10710
            ],
            [
                10710,
                10807
            ],
            [
                10808,
                10850
            ],
            [
                10850,
                10911
            ],
            [
                10918,
                10929
            ],
            [
                10929,
                10932
            ],
            [
                10933,
                10983
            ]
        ],
        "row_chars": [
            [
                0,
                96
            ],
            [
                96,
                179
            ],
            [
                179,
                374
            ],
            [
                374,
                374
            ],
            [
                374,
                396
            ],
            [
                396,
                396
            ],
            [
                396,
                409
            ],
            [
                409,
                571
            ],
            [
                571,
                604
            ],
            [
                604,
                677
            ],
            [
                677,
                803
            ],
            [
                803,
                854
            ],
            [
                854,
                955
            ],
            [
                955,
                996
            ],
            [
                996,
                996
            ],
            [
                996,
                996
            ],
            [
                996,
                996
            ],
            [
                996,
                996
            ],
            [
                996,
                1098
            ],
            [
                1098,
                1220
            ],
            [
                1220,
                1319
            ],
            [
                1319,
                1327
            ],
            [
                1327,
                1342
            ],
            [
                1342,
                1393
            ],
            [
                1393,
                1393
            ],
            [
                1393,
                1393
            ],
            [
                1393,
                1435
            ],
            [
                1435,
                1517
            ],
            [
                1517,
                1551
            ],
            [
                1551,
                1603
            ],
            [
                1603,
                1646
            ],
            [
                1646,
                1679
            ],
            [
                1679,
                1696
            ],
            [
                1696,
                1696
            ],
            [
                1696,
                1696
            ],
            [
                1696,
                1809
            ],
            [
                1809,
                1992
            ],
            [
                1992,
                2044
            ],
            [
                2044,
                2160
            ],
            [
                2160,
                2160
            ],
            [
                2160,
                2202
            ],
            [
                2202,
                2305
            ],
            [
                2305,
                2503
            ],
            [
                2503,
                2627
            ],
            [
                2627,
                2739
            ],
            [
                2739,
                2832
            ],
            [
                2832,
                3106
            ],
            [
                3106,
                3187
            ],
            [
                3187,
                3236
            ],
            [
                3236,
                3334
            ],
            [
                3334,
                3492
            ],
            [
                3492,
                3590
            ],
            [
                3590,
                3630
            ],
            [
                3630,
                3630
            ],
            [
                3630,
                3698
            ],
            [
                3698,
                3733
            ],
            [
                3733,
                3742
            ],
            [
                3742,
                3776
            ],
            [
                3776,
                3825
            ],
            [
                3825,
                3906
            ],
            [
                3906,
                3906
            ],
            [
                3906,
                3964
            ],
            [
                3964,
                4016
            ],
            [
                4016,
                4127
            ],
            [
                4127,
                4127
            ],
            [
                4127,
                4207
            ],
            [
                4207,
                4267
            ],
            [
                4267,
                4282
            ],
            [
                4282,
                4400
            ],
            [
                4400,
                4458
            ],
            [
                4458,
                4458
            ],
            [
                4458,
                4458
            ],
            [
                4458,
                4532
            ],
            [
                4532,
                4577
            ],
            [
                4577,
                4640
            ],
            [
                4640,
                4767
            ],
            [
                4767,
                4844
            ],
            [
                4844,
                4941
            ],
            [
                4941,
                5006
            ],
            [
                5006,
                5106
            ],
            [
                5106,
                5237
            ],
            [
                5237,
                5411
            ],
            [
                5411,
                5441
            ],
            [
                5441,
                5441
            ],
            [
                5441,
                5458
            ],
            [
                5458,
                5554
            ],
            [
                5554,
                5672
            ],
            [
                5672,
                5738
            ],
            [
                5738,
                5854
            ],
            [
                5854,
                5963
            ],
            [
                5963,
                6031
            ],
            [
                6031,
                6098
            ],
            [
                6098,
                6115
            ],
            [
                6115,
                6132
            ],
            [
                6132,
                6132
            ],
            [
                6132,
                6184
            ],
            [
                6184,
                6439
            ],
            [
                6439,
                6671
            ],
            [
                6671,
                6825
            ],
            [
                6825,
                6860
            ],
            [
                6860,
                6908
            ],
            [
                6908,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6938
            ],
            [
                6938,
                6989
            ],
            [
                6989,
                7192
            ],
            [
                7192,
                7268
            ],
            [
                7268,
                7296
            ],
            [
                7296,
                7387
            ],
            [
                7387,
                7433
            ],
            [
                7433,
                7433
            ],
            [
                7433,
                7433
            ],
            [
                7433,
                7543
            ],
            [
                7543,
                7608
            ],
            [
                7608,
                7661
            ],
            [
                7661,
                7698
            ],
            [
                7698,
                7698
            ],
            [
                7698,
                7820
            ],
            [
                7820,
                7915
            ],
            [
                7915,
                7932
            ],
            [
                7932,
                8063
            ],
            [
                8063,
                8143
            ],
            [
                8143,
                8173
            ],
            [
                8173,
                8201
            ],
            [
                8201,
                8304
            ],
            [
                8304,
                8377
            ],
            [
                8377,
                8556
            ],
            [
                8556,
                8637
            ],
            [
                8637,
                8770
            ],
            [
                8770,
                8876
            ],
            [
                8876,
                8876
            ],
            [
                8876,
                8876
            ],
            [
                8876,
                8984
            ],
            [
                8984,
                9023
            ],
            [
                9023,
                9037
            ],
            [
                9037,
                9103
            ],
            [
                9103,
                9103
            ],
            [
                9103,
                9136
            ],
            [
                9136,
                9199
            ],
            [
                9199,
                9226
            ],
            [
                9226,
                9366
            ],
            [
                9366,
                9545
            ],
            [
                9545,
                9631
            ],
            [
                9631,
                9710
            ],
            [
                9710,
                9716
            ],
            [
                9716,
                9758
            ],
            [
                9758,
                10052
            ],
            [
                10052,
                10277
            ],
            [
                10277,
                10277
            ],
            [
                10277,
                10429
            ],
            [
                10429,
                10429
            ],
            [
                10429,
                10475
            ],
            [
                10475,
                10562
            ],
            [
                10562,
                10671
            ],
            [
                10671,
                10693
            ],
            [
                10693,
                10710
            ],
            [
                10710,
                10850
            ],
            [
                10850,
                10929
            ],
            [
                10929,
                10983
            ]
        ]
    }
}