{
    "original": {
        "text": "When all her friends were gone Lady Carbury looked about for her son,--not expecting to find him, for she knew how punctual was his nightly attendance at the Beargarden, but still with some faint hope that he might have remained on this special occasion to tell her of his fortune. She had watched the whispering, had noticed the cool effrontery with which Felix had spoken,--for without hearing the words she had almost known the very moment in which he was asking,--and had seen the girl's timid face, and eyes turned to the ground, and the nervous twitching of her hands as she replied. As a woman, understanding such things, who had herself been wooed, who had at least dreamed of love, she had greatly disapproved her son's manner. But yet, if it might be successful, if the girl would put up with love-making so slight as that, and if the great Melmotte would accept in return for his money a title so modest as that of her son, how glorious should her son be to her in spite of his indifference!\n\"I heard him leave the house before the Melmottes went,\" said Henrietta, when the mother spoke of going up to her son's bedroom.\n\"He might have stayed to-night. Do you think he asked her?\"\n\"How can I say, mamma?\"\n\"I should have thought you would have been anxious about your brother. I feel sure he did,--and that she accepted him.\"\n\"If so I hope he will be good to her. I hope he loves her.\"\n\"Why shouldn't he love her as well as any one else? A girl need not be odious because she has money. There is nothing disagreeable about her.\"\n\"No,--nothing disagreeable. I do not know that she is especially attractive.\"\n\"Who is? I don't see anybody specially attractive. It seems to me you are quite indifferent about Felix.\"\n\"Do not say that, mamma.\"\n\"Yes you are. You don't understand all that he might be with this girl's fortune, and what he must be unless he gets money by marriage. He is eating us both up.\"\n\"I would not let him do that, mamma.\"\n\"It's all very well to say that, but I have some heart. I love him. I could not see him starve. Think what he might be with 20,000 a-year!\"\n\"If he is to marry for that only, I cannot think that they will be happy.\"\n\"You had better go to bed, Henrietta. You never say a word to comfort me in all my troubles.\"\nThen Henrietta went to bed, and Lady Carbury absolutely sat up the whole night waiting for her son, in order that she might hear his tidings. She went up to her room, disembarrassed herself of her finery, and wrapped herself in a white dressing-gown. As she sat opposite to her glass, relieving her head from its garniture of false hair, she acknowledged to herself that age was coming on her. She could hide the unwelcome approach by art,--hide it more completely than can most women of her age; but, there it was, stealing on her with short grey hairs over her ears and around her temples, with little wrinkles round her eyes easily concealed by unobjectionable cosmetics, and a look of weariness round the mouth which could only be removed by that self-assertion of herself which practice had made always possible to her in company, though it now so frequently deserted her when she was alone.\nBut she was not a woman to be unhappy because she was growing old. Her happiness, like that of most of us, was ever in the future,--never reached but always coming. She, however, had not looked for happiness to love and loveliness, and need not therefore be disappointed on that score. She had never really determined what it was that might make her happy,--having some hazy aspiration after social distinction and literary fame, in which was ever commingled solicitude respecting money. But at the present moment her great fears and her great hopes were centred on her son. She would not care how grey might be her hair, or how savage might be Mr. Alf, if her Felix were to marry this heiress. On the other hand, nothing that pearl-powder or the \"Morning Breakfast Table\" could do would avail anything, unless he could be extricated from the ruin that now surrounded him. So she went down into the dining-room, that she might be sure to hear the key in the door, even should she sleep, and waited for him with a volume of French memoirs in her hand.\nUnfortunate woman! she might have gone to bed and have been duly called about her usual time, for it was past eight and the full staring daylight shone into her room when Felix's cab brought him to the door. The night had been very wretched to her. She had slept, and the fire had sunk nearly to nothing and had refused to become again comfortable. She could not keep her mind to her book, and while she was awake the time seemed to be everlasting. And then it was so terrible to her that he should be gambling at such hours as these! Why should he desire to gamble if this girl's fortune was ready to fall into his hands? Fool, to risk his health, his character, his beauty, the little money which at this moment of time might be so indispensable to his great project, for the chance of winning something which in comparison with Marie Melmotte's money must be despicable! But at last he came! She waited patiently till he had thrown aside his hat and coat, and then she appeared at the dining-room door. She had studied her part for the occasion. She would not say a harsh word, and now she endeavoured to meet him with a smile. \"Mother,\" he said, \"you up at this hour!\" His face was flushed, and she thought that there was some unsteadiness in his gait. She had never seen him tipsy, and it would be doubly terrible to her if such should be his condition.\n\"I could not go to bed till I had seen you.\"\n\"Why not? why should you want to see me? I'll go to bed now. There'll be plenty of time by-and-bye.\"\n\"Is anything the matter, Felix?\"\n\"Matter;--what should be the matter? There's been a gentle row among the fellows at the club;--that's all. I had to tell Grasslough a bit of my mind, and he didn't like it. I didn't mean that he should.\"\n\"There is not going to be any fighting, Felix?\"\n\"What, duelling; oh no,--nothing so exciting as that. Whether somebody may not have to kick somebody is more than I can say at present. You must let me go to bed now, for I am about used up.\"\n\"What did Marie Melmotte say to you?\"\n\"Nothing particular.\" And he stood with his hand on the door as he answered her.\n\"And what did you say to her?\"\n\"Nothing particular. Good heavens, mother, do you think that a man is in a condition to talk about such stuff as that at eight o'clock in the morning, when he has been up all night?\"\n\"If you knew all that I suffer on your behalf you would speak a word to me,\" she said, imploring him, holding him by the arm, and looking into his purple face and bloodshot eyes. She was sure that he had been drinking. She could smell it in his breath.\n\"I must go to the old fellow, of course.\"\n\"She told you to go to her father?\"\n\"As far as I remember, that was about it. Of course, he means to settle it as he likes. I should say that it's ten to one against me.\" Pulling himself away with some little roughness from his mother's hold, he made his way up to his own bedroom, occasionally stumbling against the stairs.\nThen the heiress herself had accepted her son! If so, surely the thing might be done. Lady Carbury recalled to mind her old conviction that a daughter may always succeed in beating a hard-hearted parent in a contention about marriage, if she be well in earnest. But then the girl must be really in earnest, and her earnestness will depend on that of her lover. In this case, however, there was as yet no reason for supposing that the great man would object. As far as outward signs went, the great man had shown some partiality for her son. No doubt it was Mr. Melmotte who had made Sir Felix a director of the great American Company. Felix had also been kindly received in Grosvenor Square. And then Sir Felix was Sir Felix,--a real baronet. Mr. Melmotte had no doubt endeavoured to catch this and that lord; but, failing a lord, why should he not content himself with a baronet? Lady Carbury thought that her son wanted nothing but money to make him an acceptable suitor to such a father-in-law as Mr. Melmotte;--not money in the funds, not a real fortune, not so many thousands a-year that could be settled;--the man's own enormous wealth rendered this unnecessary;--but such a one as Mr. Melmotte would not like outward palpable signs of immediate poverty. There should be means enough for present sleekness and present luxury. He must have a horse to ride, and rings and coats to wear, and bright little canes to carry, and above all the means of making presents. He must not be seen to be poor. Fortunately, most fortunately, Chance had befriended him lately and had given him some ready money. But if he went on gambling Chance would certainly take it all away again. For aught that the poor mother knew, Chance might have done so already. And then again, it was indispensable that he should abandon the habit of play--at any rate for the present, while his prospects depended on the good opinions of Mr. Melmotte. Of course such a one as Mr. Melmotte could not like gambling at a club, however much he might approve of it in the City. Why, with such a preceptor to help him, should not Felix learn to do his gambling on the Exchange, or among the brokers, or in the purlieus of the Bank? Lady Carbury would at any rate instigate him to be diligent in his position as director of the Great Mexican Railway,--which position ought to be the beginning to him of a fortune to be made on his own account. But what hope could there be for him if he should take to drink? Would not all hopes be over with Mr. Melmotte should he ever learn that his daughter's lover reached home and tumbled up-stairs to bed between eight and nine o'clock in the morning?\nShe watched for his appearance on the following day, and began at once on the subject.\n\"Do you know, Felix, I think I shall go down to your cousin Roger for Whitsuntide.\"\n\"To Carbury Manor!\" said he, as he eat some devilled kidneys which the cook had been specially ordered to get for his breakfast. \"I thought you found it so dull that you didn't mean to go there any more.\"\n\"I never said so, Felix. And now I have a great object.\"\n\"What will Hetta do?\"\n\"Go too--why shouldn't she?\"\n\"Oh; I didn't know. I thought that perhaps she mightn't like it.\"\n\"I don't see why she shouldn't like it. Besides, everything can't give way to her.\"\n\"Has Roger asked you?\"\n\"No; but I'm sure he'd be pleased to have us if I proposed that we should all go.\"\n\"Not me, mother!\"\n\"Yes; you especially.\"\n\"Not if I know it, mother. What on earth should I do at Carbury Manor?\"\n\"Madame Melmotte told me last night that they were all going down to Caversham to stay three or four days with the Longestaffes. She spoke of Lady Pomona as quite her particular friend.\"\n\"Oh--h! that explains it all.\"\n\"Explains what, Felix?\" said Lady Carbury, who had heard of Dolly Longestaffe, and was not without some fear that this projected visit to Caversham might have some matrimonial purpose in reference to that delightful young heir.\n\"They say at the club that Melmotte has taken up old Longestaffe's affairs, and means to put them straight. There's an old property in Sussex as well as Caversham, and they say that Melmotte is to have that himself. There's some bother because Dolly, who would do anything for anybody else, won't join his father in selling. So the Melmottes are going to Caversham!\"\n\"Madame Melmotte told me so.\"\n\"And the Longestaffes are the proudest people in England.\"\n\"Of course we ought to be at Carbury Manor while they are there. What can be more natural? Everybody goes out of town at Whitsuntide; and why shouldn't we run down to the family place?\"\n\"All very natural if you can manage it, mother.\"\n\"And you'll come?\"\n\"If Marie Melmotte goes, I'll be there at any rate for one day and night,\" said Felix.\nHis mother thought that, for him, the promise had been graciously made.",
        "paragraph_chars": [
            [
                0,
                1003
            ],
            [
                1003,
                1132
            ],
            [
                1132,
                1192
            ],
            [
                1192,
                1216
            ],
            [
                1216,
                1336
            ],
            [
                1336,
                1396
            ],
            [
                1396,
                1539
            ],
            [
                1539,
                1617
            ],
            [
                1617,
                1723
            ],
            [
                1723,
                1749
            ],
            [
                1749,
                1911
            ],
            [
                1911,
                1949
            ],
            [
                1949,
                2089
            ],
            [
                2089,
                2164
            ],
            [
                2164,
                2258
            ],
            [
                2258,
                3155
            ],
            [
                3155,
                4206
            ],
            [
                4206,
                5565
            ],
            [
                5565,
                5610
            ],
            [
                5610,
                5711
            ],
            [
                5711,
                5744
            ],
            [
                5744,
                5948
            ],
            [
                5948,
                5996
            ],
            [
                5996,
                6188
            ],
            [
                6188,
                6226
            ],
            [
                6226,
                6307
            ],
            [
                6307,
                6338
            ],
            [
                6338,
                6521
            ],
            [
                6521,
                6774
            ],
            [
                6774,
                6816
            ],
            [
                6816,
                6852
            ],
            [
                6852,
                7141
            ],
            [
                7141,
                9795
            ],
            [
                9795,
                9882
            ],
            [
                9882,
                9966
            ],
            [
                9966,
                10171
            ],
            [
                10171,
                10228
            ],
            [
                10228,
                10250
            ],
            [
                10250,
                10279
            ],
            [
                10279,
                10345
            ],
            [
                10345,
                10429
            ],
            [
                10429,
                10452
            ],
            [
                10452,
                10535
            ],
            [
                10535,
                10553
            ],
            [
                10553,
                10576
            ],
            [
                10576,
                10648
            ],
            [
                10648,
                10835
            ],
            [
                10835,
                10866
            ],
            [
                10866,
                11094
            ],
            [
                11094,
                11461
            ],
            [
                11461,
                11491
            ],
            [
                11491,
                11550
            ],
            [
                11550,
                11736
            ],
            [
                11736,
                11785
            ],
            [
                11785,
                11804
            ],
            [
                11804,
                11891
            ],
            [
                11891,
                11962
            ]
        ],
        "segment_chars": [
            [
                0,
                282
            ],
            [
                282,
                590
            ],
            [
                590,
                737
            ],
            [
                737,
                1003
            ],
            [
                1003,
                1132
            ],
            [
                1132,
                1164
            ],
            [
                1164,
                1192
            ],
            [
                1192,
                1216
            ],
            [
                1216,
                1287
            ],
            [
                1287,
                1336
            ],
            [
                1336,
                1374
            ],
            [
                1374,
                1396
            ],
            [
                1396,
                1448
            ],
            [
                1448,
                1497
            ],
            [
                1497,
                1539
            ],
            [
                1539,
                1567
            ],
            [
                1567,
                1617
            ],
            [
                1617,
                1626
            ],
            [
                1626,
                1668
            ],
            [
                1668,
                1723
            ],
            [
                1723,
                1749
            ],
            [
                1749,
                1763
            ],
            [
                1763,
                1885
            ],
            [
                1885,
                1911
            ],
            [
                1911,
                1949
            ],
            [
                1949,
                2005
            ],
            [
                2005,
                2017
            ],
            [
                2017,
                2045
            ],
            [
                2045,
                2089
            ],
            [
                2089,
                2164
            ],
            [
                2164,
                2202
            ],
            [
                2202,
                2258
            ],
            [
                2258,
                2400
            ],
            [
                2400,
                2509
            ],
            [
                2509,
                2652
            ],
            [
                2652,
                3155
            ],
            [
                3155,
                3222
            ],
            [
                3222,
                3320
            ],
            [
                3320,
                3441
            ],
            [
                3441,
                3643
            ],
            [
                3643,
                3730
            ],
            [
                3730,
                3850
            ],
            [
                3850,
                4028
            ],
            [
                4028,
                4206
            ],
            [
                4206,
                4225
            ],
            [
                4225,
                4414
            ],
            [
                4414,
                4455
            ],
            [
                4455,
                4555
            ],
            [
                4555,
                4655
            ],
            [
                4655,
                4741
            ],
            [
                4741,
                4829
            ],
            [
                4829,
                5080
            ],
            [
                5080,
                5101
            ],
            [
                5101,
                5212
            ],
            [
                5212,
                5255
            ],
            [
                5255,
                5337
            ],
            [
                5337,
                5379
            ],
            [
                5379,
                5463
            ],
            [
                5463,
                5565
            ],
            [
                5565,
                5610
            ],
            [
                5610,
                5620
            ],
            [
                5620,
                5651
            ],
            [
                5651,
                5671
            ],
            [
                5671,
                5711
            ],
            [
                5711,
                5744
            ],
            [
                5744,
                5781
            ],
            [
                5781,
                5851
            ],
            [
                5851,
                5917
            ],
            [
                5917,
                5948
            ],
            [
                5948,
                5996
            ],
            [
                5996,
                6050
            ],
            [
                6050,
                6132
            ],
            [
                6132,
                6188
            ],
            [
                6188,
                6226
            ],
            [
                6226,
                6248
            ],
            [
                6248,
                6307
            ],
            [
                6307,
                6338
            ],
            [
                6338,
                6359
            ],
            [
                6359,
                6521
            ],
            [
                6521,
                6700
            ],
            [
                6700,
                6740
            ],
            [
                6740,
                6774
            ],
            [
                6774,
                6816
            ],
            [
                6816,
                6852
            ],
            [
                6852,
                6894
            ],
            [
                6894,
                6940
            ],
            [
                6940,
                6987
            ],
            [
                6987,
                7141
            ],
            [
                7141,
                7188
            ],
            [
                7188,
                7227
            ],
            [
                7227,
                7403
            ],
            [
                7403,
                7502
            ],
            [
                7502,
                7599
            ],
            [
                7599,
                7682
            ],
            [
                7682,
                7776
            ],
            [
                7776,
                7833
            ],
            [
                7833,
                7884
            ],
            [
                7884,
                8022
            ],
            [
                8022,
                8402
            ],
            [
                8402,
                8473
            ],
            [
                8473,
                8610
            ],
            [
                8610,
                8642
            ],
            [
                8642,
                8742
            ],
            [
                8742,
                8816
            ],
            [
                8816,
                8888
            ],
            [
                8888,
                9063
            ],
            [
                9063,
                9184
            ],
            [
                9184,
                9337
            ],
            [
                9337,
                9548
            ],
            [
                9548,
                9613
            ],
            [
                9613,
                9795
            ],
            [
                9795,
                9882
            ],
            [
                9882,
                9966
            ],
            [
                9966,
                9986
            ],
            [
                9986,
                10095
            ],
            [
                10095,
                10171
            ],
            [
                10171,
                10196
            ],
            [
                10196,
                10228
            ],
            [
                10228,
                10250
            ],
            [
                10250,
                10279
            ],
            [
                10279,
                10299
            ],
            [
                10299,
                10345
            ],
            [
                10345,
                10385
            ],
            [
                10385,
                10429
            ],
            [
                10429,
                10452
            ],
            [
                10452,
                10535
            ],
            [
                10535,
                10553
            ],
            [
                10553,
                10576
            ],
            [
                10576,
                10603
            ],
            [
                10603,
                10648
            ],
            [
                10648,
                10777
            ],
            [
                10777,
                10835
            ],
            [
                10835,
                10843
            ],
            [
                10843,
                10866
            ],
            [
                10866,
                10890
            ],
            [
                10890,
                11094
            ],
            [
                11094,
                11202
            ],
            [
                11202,
                11310
            ],
            [
                11310,
                11419
            ],
            [
                11419,
                11461
            ],
            [
                11461,
                11491
            ],
            [
                11491,
                11550
            ],
            [
                11550,
                11615
            ],
            [
                11615,
                11641
            ],
            [
                11641,
                11736
            ],
            [
                11736,
                11785
            ],
            [
                11785,
                11804
            ],
            [
                11804,
                11891
            ],
            [
                11891,
                11962
            ]
        ],
        "overlap_chars": [
            [
                0,
                68
            ],
            [
                75,
                84
            ],
            [
                93,
                96
            ],
            [
                85,
                87
            ],
            [
                154,
                228
            ],
            [
                254,
                282
            ],
            [
                282,
                313
            ],
            [
                504,
                507
            ],
            [
                380,
                465
            ],
            [
                468,
                503
            ],
            [
                508,
                589
            ],
            [
                590,
                600
            ],
            [
                629,
                656
            ],
            [
                691,
                718
            ],
            [
                682,
                684
            ],
            [
                719,
                737
            ],
            [
                741,
                744
            ],
            [
                773,
                904
            ],
            [
                908,
                917
            ],
            [
                926,
                933
            ],
            [
                933,
                954
            ],
            [
                963,
                972
            ],
            [
                1001,
                1003
            ],
            [
                1003,
                1074
            ],
            [
                1130,
                1132
            ],
            [
                1132,
                1153
            ],
            [
                1162,
                1164
            ],
            [
                1164,
                1189
            ],
            [
                1287,
                1305
            ],
            [
                1308,
                1336
            ],
            [
                1336,
                1374
            ],
            [
                1374,
                1396
            ],
            [
                1396,
                1433
            ],
            [
                1442,
                1448
            ],
            [
                1497,
                1539
            ],
            [
                1539,
                1542
            ],
            [
                1565,
                1567
            ],
            [
                1567,
                1617
            ],
            [
                1617,
                1626
            ],
            [
                1668,
                1723
            ],
            [
                1723,
                1749
            ],
            [
                1763,
                1885
            ],
            [
                1885,
                1911
            ],
            [
                1911,
                1949
            ],
            [
                1949,
                2005
            ],
            [
                2005,
                2017
            ],
            [
                2017,
                2045
            ],
            [
                2045,
                2081
            ],
            [
                2082,
                2089
            ],
            [
                2089,
                2164
            ],
            [
                2164,
                2202
            ],
            [
                2202,
                2258
            ],
            [
                2263,
                2302
            ],
            [
                2314,
                2356
            ],
            [
                2398,
                2400
            ],
            [
                2400,
                2424
            ],
            [
                2451,
                2509
            ],
            [
                2509,
                2519
            ],
            [
                2532,
                2535
            ],
            [
                2594,
                2612
            ],
            [
                2624,
                2652
            ],
            [
                2652,
                2696
            ],
            [
                2753,
                2758
            ],
            [
                2760,
                2794
            ],
            [
                2801,
                2811
            ],
            [
                2830,
                2885
            ],
            [
                2931,
                3023
            ],
            [
                3035,
                3053
            ],
            [
                3059,
                3065
            ],
            [
                3054,
                3058
            ],
            [
                3066,
                3074
            ],
            [
                3082,
                3107
            ],
            [
                3111,
                3155
            ],
            [
                3155,
                3170
            ],
            [
                3185,
                3222
            ],
            [
                3222,
                3284
            ],
            [
                3287,
                3320
            ],
            [
                3441,
                3477
            ],
            [
                3490,
                3510
            ],
            [
                3513,
                3584
            ],
            [
                3636,
                3643
            ],
            [
                3643,
                3649
            ],
            [
                3654,
                3661
            ],
            [
                3669,
                3688
            ],
            [
                3699,
                3730
            ],
            [
                4031,
                4066
            ],
            [
                4072,
                4075
            ],
            [
                4093,
                4117
            ],
            [
                4140,
                4206
            ],
            [
                4206,
                4225
            ],
            [
                4225,
                4234
            ],
            [
                4235,
                4251
            ],
            [
                4298,
                4321
            ],
            [
                4372,
                4414
            ],
            [
                4414,
                4455
            ],
            [
                4455,
                4509
            ],
            [
                4553,
                4555
            ],
            [
                4600,
                4635
            ],
            [
                4642,
                4655
            ],
            [
                4664,
                4719
            ],
            [
                4734,
                4739
            ],
            [
                4725,
                4730
            ],
            [
                4739,
                4741
            ],
            [
                4741,
                4829
            ],
            [
                4829,
                4881
            ],
            [
                4882,
                4904
            ],
            [
                4976,
                4979
            ],
            [
                4957,
                4974
            ],
            [
                5078,
                5079
            ],
            [
                5080,
                5099
            ],
            [
                5101,
                5212
            ],
            [
                5212,
                5219
            ],
            [
                5228,
                5236
            ],
            [
                5253,
                5255
            ],
            [
                5255,
                5336
            ],
            [
                5337,
                5379
            ],
            [
                5379,
                5421
            ],
            [
                5428,
                5431
            ],
            [
                5437,
                5444
            ],
            [
                5461,
                5463
            ],
            [
                5463,
                5491
            ],
            [
                5497,
                5534
            ],
            [
                5563,
                5565
            ],
            [
                5565,
                5607
            ],
            [
                5610,
                5620
            ],
            [
                5651,
                5671
            ],
            [
                5671,
                5705
            ],
            [
                5708,
                5711
            ],
            [
                5711,
                5744
            ],
            [
                5744,
                5751
            ],
            [
                5754,
                5781
            ],
            [
                5781,
                5795
            ],
            [
                5803,
                5837
            ],
            [
                5839,
                5851
            ],
            [
                5851,
                5875
            ],
            [
                5885,
                5917
            ],
            [
                6132,
                6188
            ],
            [
                6188,
                6226
            ],
            [
                6226,
                6248
            ],
            [
                6252,
                6286
            ],
            [
                6305,
                6307
            ],
            [
                6307,
                6338
            ],
            [
                6338,
                6359
            ],
            [
                6359,
                6393
            ],
            [
                6399,
                6447
            ],
            [
                6456,
                6521
            ],
            [
                6521,
                6700
            ],
            [
                6740,
                6755
            ],
            [
                6759,
                6774
            ],
            [
                6774,
                6816
            ],
            [
                6816,
                6852
            ],
            [
                6852,
                6894
            ],
            [
                6894,
                6907
            ],
            [
                6917,
                6940
            ],
            [
                6940,
                6987
            ],
            [
                6987,
                7017
            ],
            [
                7025,
                7034
            ],
            [
                7057,
                7141
            ],
            [
                7141,
                7157
            ],
            [
                7166,
                7188
            ],
            [
                7188,
                7227
            ],
            [
                7403,
                7406
            ],
            [
                7249,
                7251
            ],
            [
                7322,
                7346
            ],
            [
                7360,
                7375
            ],
            [
                7281,
                7282
            ],
            [
                7416,
                7501
            ],
            [
                7523,
                7534
            ],
            [
                7542,
                7570
            ],
            [
                7585,
                7599
            ],
            [
                7643,
                7680
            ],
            [
                7627,
                7628
            ],
            [
                7734,
                7776
            ],
            [
                7776,
                7833
            ],
            [
                7833,
                7841
            ],
            [
                7852,
                7855
            ],
            [
                7868,
                7884
            ],
            [
                7886,
                7900
            ],
            [
                7922,
                7930
            ],
            [
                7964,
                8021
            ],
            [
                8022,
                8092
            ],
            [
                8096,
                8106
            ],
            [
                8114,
                8116
            ],
            [
                8141,
                8154
            ],
            [
                8180,
                8198
            ],
            [
                8130,
                8131
            ],
            [
                8253,
                8282
            ],
            [
                8292,
                8308
            ],
            [
                8133,
                8134
            ],
            [
                8311,
                8314
            ],
            [
                8333,
                8364
            ],
            [
                8374,
                8382
            ],
            [
                8393,
                8402
            ],
            [
                8402,
                8434
            ],
            [
                8443,
                8456
            ],
            [
                8465,
                8473
            ],
            [
                8476,
                8535
            ],
            [
                8570,
                8592
            ],
            [
                8600,
                8610
            ],
            [
                8610,
                8642
            ],
            [
                8660,
                8742
            ],
            [
                8742,
                8816
            ],
            [
                8816,
                8819
            ],
            [
                8826,
                8887
            ],
            [
                8930,
                8932
            ],
            [
                8940,
                8965
            ],
            [
                8967,
                8978
            ],
            [
                8996,
                9063
            ],
            [
                9073,
                9099
            ],
            [
                9106,
                9184
            ],
            [
                9184,
                9187
            ],
            [
                9224,
                9303
            ],
            [
                9335,
                9337
            ],
            [
                9337,
                9367
            ],
            [
                9378,
                9453
            ],
            [
                9546,
                9548
            ],
            [
                9548,
                9613
            ],
            [
                9613,
                9640
            ],
            [
                9646,
                9665
            ],
            [
                9669,
                9705
            ],
            [
                9723,
                9730
            ],
            [
                9741,
                9795
            ],
            [
                9795,
                9810
            ],
            [
                9815,
                9825
            ],
            [
                9826,
                9882
            ],
            [
                9882,
                9966
            ],
            [
                9966,
                9986
            ],
            [
                9986,
                9993
            ],
            [
                10093,
                10095
            ],
            [
                10095,
                10171
            ],
            [
                10171,
                10196
            ],
            [
                10196,
                10228
            ],
            [
                10228,
                10229
            ],
            [
                10326,
                10345
            ],
            [
                10345,
                10361
            ],
            [
                10429,
                10452
            ],
            [
                10452,
                10535
            ],
            [
                10535,
                10553
            ],
            [
                10553,
                10576
            ],
            [
                10603,
                10647
            ],
            [
                10648,
                10777
            ],
            [
                10777,
                10835
            ],
            [
                10835,
                10838
            ],
            [
                10841,
                10843
            ],
            [
                10843,
                10866
            ],
            [
                10866,
                10890
            ],
            [
                10890,
                10948
            ],
            [
                10975,
                10979
            ],
            [
                11014,
                11019
            ],
            [
                11020,
                11065
            ],
            [
                10995,
                11000
            ],
            [
                11092,
                11094
            ],
            [
                11094,
                11202
            ],
            [
                11202,
                11290
            ],
            [
                11296,
                11300
            ],
            [
                11301,
                11310
            ],
            [
                11310,
                11343
            ],
            [
                11385,
                11417
            ],
            [
                11417,
                11419
            ],
            [
                11419,
                11461
            ],
            [
                11550,
                11615
            ],
            [
                11615,
                11641
            ],
            [
                11641,
                11682
            ],
            [
                11736,
                11785
            ],
            [
                11785,
                11804
            ],
            [
                11804,
                11891
            ],
            [
                11891,
                11962
            ]
        ],
        "row_chars": [
            [
                0,
                282
            ],
            [
                282,
                590
            ],
            [
                590,
                737
            ],
            [
                737,
                1003
            ],
            [
                1003,
                1132
            ],
            [
                1132,
                1164
            ],
            [
                1164,
                1192
            ],
            [
                1192,
                1216
            ],
            [
                1216,
                1287
            ],
            [
                1287,
                1336
            ],
            [
                1336,
                1374
            ],
            [
                1374,
                1396
            ],
            [
                1396,
                1448
            ],
            [
                1448,
                1497
            ],
            [
                1497,
                1539
            ],
            [
                1539,
                1567
            ],
            [
                1567,
                1617
            ],
            [
                1617,
                1626
            ],
            [
                1626,
                1668
            ],
            [
                1668,
                1723
            ],
            [
                1723,
                1749
            ],
            [
                1749,
                1763
            ],
            [
                1763,
                1885
            ],
            [
                1885,
                1911
            ],
            [
                1911,
                1949
            ],
            [
                1949,
                2005
            ],
            [
                2005,
                2017
            ],
            [
                2017,
                2045
            ],
            [
                2045,
                2089
            ],
            [
                2089,
                2164
            ],
            [
                2164,
                2202
            ],
            [
                2202,
                2258
            ],
            [
                2258,
                2400
            ],
            [
                2400,
                2509
            ],
            [
                2509,
                2652
            ],
            [
                2652,
                3155
            ],
            [
                3155,
                3222
            ],
            [
                3222,
                3320
            ],
            [
                3320,
                3441
            ],
            [
                3441,
                3643
            ],
            [
                3643,
                3730
            ],
            [
                3730,
                3850
            ],
            [
                3850,
                4028
            ],
            [
                4028,
                4206
            ],
            [
                4206,
                4225
            ],
            [
                4225,
                4414
            ],
            [
                4414,
                4455
            ],
            [
                4455,
                4555
            ],
            [
                4555,
                4655
            ],
            [
                4655,
                4741
            ],
            [
                4741,
                4829
            ],
            [
                4829,
                5080
            ],
            [
                5080,
                5101
            ],
            [
                5101,
                5212
            ],
            [
                5212,
                5255
            ],
            [
                5255,
                5337
            ],
            [
                5337,
                5379
            ],
            [
                5379,
                5463
            ],
            [
                5463,
                5565
            ],
            [
                5565,
                5610
            ],
            [
                5610,
                5620
            ],
            [
                5620,
                5651
            ],
            [
                5651,
                5671
            ],
            [
                5671,
                5711
            ],
            [
                5711,
                5744
            ],
            [
                5744,
                5781
            ],
            [
                5781,
                5851
            ],
            [
                5851,
                5917
            ],
            [
                5917,
                5948
            ],
            [
                5948,
                5996
            ],
            [
                5996,
                6050
            ],
            [
                6050,
                6132
            ],
            [
                6132,
                6188
            ],
            [
                6188,
                6226
            ],
            [
                6226,
                6248
            ],
            [
                6248,
                6307
            ],
            [
                6307,
                6338
            ],
            [
                6338,
                6359
            ],
            [
                6359,
                6521
            ],
            [
                6521,
                6700
            ],
            [
                6700,
                6774
            ],
            [
                6774,
                6816
            ],
            [
                6816,
                6852
            ],
            [
                6852,
                6894
            ],
            [
                6894,
                6940
            ],
            [
                6940,
                6987
            ],
            [
                6987,
                7141
            ],
            [
                7141,
                7188
            ],
            [
                7188,
                7227
            ],
            [
                7227,
                7502
            ],
            [
                7502,
                7599
            ],
            [
                7599,
                7776
            ],
            [
                7776,
                7833
            ],
            [
                7833,
                7884
            ],
            [
                7884,
                8022
            ],
            [
                8022,
                8402
            ],
            [
                8402,
                8473
            ],
            [
                8473,
                8610
            ],
            [
                8610,
                8642
            ],
            [
                8642,
                8742
            ],
            [
                8742,
                8816
            ],
            [
                8816,
                8888
            ],
            [
                8888,
                9063
            ],
            [
                9063,
                9184
            ],
            [
                9184,
                9337
            ],
            [
                9337,
                9548
            ],
            [
                9548,
                9613
            ],
            [
                9613,
                9795
            ],
            [
                9795,
                9882
            ],
            [
                9882,
                9966
            ],
            [
                9966,
                9986
            ],
            [
                9986,
                10095
            ],
            [
                10095,
                10171
            ],
            [
                10171,
                10196
            ],
            [
                10196,
                10228
            ],
            [
                10228,
                10345
            ],
            [
                10345,
                10385
            ],
            [
                10385,
                10429
            ],
            [
                10429,
                10452
            ],
            [
                10452,
                10535
            ],
            [
                10535,
                10553
            ],
            [
                10553,
                10576
            ],
            [
                10576,
                10603
            ],
            [
                10603,
                10648
            ],
            [
                10648,
                10777
            ],
            [
                10777,
                10835
            ],
            [
                10835,
                10843
            ],
            [
                10843,
                10866
            ],
            [
                10866,
                10890
            ],
            [
                10890,
                11094
            ],
            [
                11094,
                11202
            ],
            [
                11202,
                11310
            ],
            [
                11310,
                11419
            ],
            [
                11419,
                11461
            ],
            [
                11461,
                11491
            ],
            [
                11491,
                11550
            ],
            [
                11550,
                11615
            ],
            [
                11615,
                11641
            ],
            [
                11641,
                11736
            ],
            [
                11736,
                11785
            ],
            [
                11785,
                11804
            ],
            [
                11804,
                11891
            ],
            [
                11891,
                11962
            ]
        ]
    },
    "abridged": {
        "text": "When all her friends were gone Lady Carbury looked about for her son - expecting him to have gone to the Beargarden, but still with some faint hope that he might have remained to tell her of his fortune. She had watched the whispering, and without hearing the words she had almost known the very moment in which he was asking - and had seen the girl's timid face, eyes turned to the ground, and the nervous twitching of her hands as she replied.\nAs a woman who had herself been wooed, she had greatly disapproved of her son's manner. Yet if the girl would put up with love-making so slight as that, and if the great Melmotte would accept in return for his money a title as modest as her son's, how glorious should Felix be to her!\n\"I heard him leave the house before the Melmottes went,\" said Henrietta.\n\"He might have stayed tonight. Do you think he asked her? I feel sure he did - and that she accepted him.\"\n\"If so I hope he will be good to her. I hope he loves her.\"\n\"Why shouldn't he love her as well as anyone else? There is nothing disagreeable about her.\"\n\"No. I do not know that she is especially attractive.\"\n\"Who is? It seems to me you are quite indifferent about Felix.\"\n\"Do not say that, mamma.\"\n\"You don't understand all that he might be with this girl's fortune, and what he must be unless he gets money by marriage. He is eating us both up.\"\n\"I would not let him do that, mamma.\"\n\"It's all very well to say that, but I have some heart. I love him. I could not see him starve. Think what he might be with 20,000 a year!\"\n\"If he is to marry for that only, I cannot think that they will be happy.\"\n\"You had better go to bed, Henrietta. You never say a word to comfort me in all my troubles.\"\nHenrietta went to bed, and Lady Carbury sat up the whole night waiting for her son. She went up to her room, took off her finery, and wrapped herself in a white dressing-gown. As she sat before her mirror, she acknowledged that age was coming on her. She could hide the unwelcome approach by art; but there it was, stealing on her with grey hairs around her temples, with little wrinkles round her eyes, and a look of weariness round the mouth which could only be removed by that self-assertion which practice had always made possible in company, though it now frequently deserted her when she was alone.\nBut she was not unhappy because she was growing old. Her happiness, like that of most of us, was ever in the future - never reached but always coming. She had never really determined what might make her happy - having some hazy aspiration after social distinction and literary fame, mixed with anxiety about money. But at present her great fears and hopes were centred on her son. She went down into the dining-room, where she would hear the key in the door, and waited for him with a volume of French memoirs in her hand.\nUnfortunate woman! she might as well have gone to bed, for it was past eight when Felix's cab brought him to the door. The night had been very wretched to her. She had slept, and the fire had sunk nearly to nothing. While she was awake the time seemed everlasting. It was so terrible to her that he should be gambling at these hours! Why should he desire to gamble if this girl's fortune was ready to fall into his hands? Fool, to risk his health, his character, his beauty, and the little money which he needed for his great project!\nBut at last he came. She waited patiently till he had thrown aside his hat and coat, and then she appeared at the dining-room door. She had rehearsed her part. She would not say a harsh word, and now she endeavoured to meet him with a smile.\n\"Mother,\" he said, \"you up at this hour!\" His face was flushed, and she thought that he was unsteady. She had never seen him tipsy; it would be doubly terrible to her if that were so.\n\"I could not go to bed till I had seen you,\" she said.\n\"Why not? I'll go to bed now. There'll be plenty of time by-and-by.\"\n\"Is anything the matter, Felix?\"\n\"Matter - what should be the matter? There's been a row among the fellows at the club; that's all. I had to tell Grasslough my mind, and he didn't like it. You must let me go to bed now, for I am about used up.\"\n\"What did Marie Melmotte say to you?\"\n\"Nothing particular.\" He stood with his hand on the door.\n\"And what did you say to her?\"\n\"Nothing particular. Good heavens, mother, do you think a man is in a condition to talk about such stuff at eight o'clock in the morning, when he has been up all night?\"\n\"If you knew all that I suffer on your behalf you would speak a word to me,\" she said, imploring him, holding him by the arm, and looking into his purple face and bloodshot eyes. She could smell the drink in his breath.\n\"I must go to the old fellow, of course.\"\n\"She told you to go to her father?\"\n\"As far as I remember, that was about it. Of course, he will settle it as he likes. I should say that it's ten to one against me.\" Pulling himself away with some roughness, he made his way up to his own bedroom, occasionally stumbling against the stairs.\nThen the heiress had accepted her son! If so, surely the thing might be done. But to beat a hard-hearted parent in an argument about marriage, a girl must be really in earnest, and her earnestness will depend on that of her lover.\nHowever, there was no reason for supposing that Mr. Melmotte would object. He had shown some partiality for her son, in making him a director of the great American Company. Felix had also been kindly received in Grosvenor Square. And then he was a real baronet. If Mr. Melmotte had failed to catch a lord, why should he not content himself with a baronet?\nLady Carbury thought that her son wanted nothing but money to make him acceptable to Mr. Melmotte; not a real fortune - the man's own enormous wealth made this unnecessary - but Melmotte would not like outward signs of poverty. There should be means enough for sleekness and luxury. Felix must have a horse to ride, and rings and coats to wear, and above all the means of giving presents. He must not be seen to be poor. Fortunately, Chance had befriended him lately and had given him some ready money. But if he went on gambling Chance would certainly take it all away again. For all that the poor mother knew, Chance might have done so already.\nHe must abandon the habit of play - at any rate while his prospects depended on the good opinions of Mr. Melmotte. Such a one as Mr. Melmotte would not like gambling at a club, however much he might approve of it in the City. Why should not Felix learn to do his gambling on the Exchange, or among the brokers? Lady Carbury would at any rate urge him to be diligent in his position as director of the Great Mexican Railway. But what hope could there be for him if he should take to drink? Would not all hopes be over if Mr. Melmotte should ever learn that his daughter's lover tumbled upstairs to bed between eight and nine o'clock in the morning?\nShe watched for Felix's appearance at breakfast on the following day, and began at once on the subject.\n\"Do you know, Felix, I think I shall go down to your cousin Roger for Whitsuntide.\"\n\"To Carbury Manor!\" said he. \"I thought you found it so dull that you didn't mean to go there any more.\"\n\"I never said so, Felix. And now I have a great object.\"\n\"Hetta mightn't like it.\"\n\"I don't see why not.\"\n\"Has Roger asked you?\"\n\"No; but I'm sure he'd be pleased to have us if I proposed that we should all go.\"\n\"Not me, mother!\"\n\"Yes; you especially.\"\n\"What on earth should I do at Carbury Manor?\" demanded Felix.\n\"Madame Melmotte told me last night that they were all going down to Caversham to stay three or four days with the Longestaffes. She spoke of Lady Pomona as quite her particular friend.\"\n\"Oh! that explains it all.\"\n\"Explains what, Felix?\" said Lady Carbury, who had heard of Dolly Longestaffe, and feared that he might also have some matrimonial purpose in reference to Miss Melmotte's visit.\n\"They say at the club that Melmotte has taken up old Longestaffe's affairs, and means to put them straight. There's an old property in Sussex as well as Caversham, and they say that Melmotte is to buy that for himself. There's some bother because Dolly won't join his father in selling it. So the Melmottes are going to Caversham!\"\n\"Of course we ought to be at Carbury Manor while they are there. What can be more natural? Everybody goes out of town at Whitsuntide.\"\n\"All very natural if you can manage it, mother.\"\n\"And you'll come?\"\n\"If Marie Melmotte goes, I'll be there at any rate for one day and night,\" said Felix.\nHis mother thought that, for him, the promise had been graciously made.",
        "paragraph_chars": [
            [
                0,
                446
            ],
            [
                446,
                731
            ],
            [
                731,
                804
            ],
            [
                804,
                911
            ],
            [
                911,
                971
            ],
            [
                971,
                1064
            ],
            [
                1064,
                1119
            ],
            [
                1119,
                1183
            ],
            [
                1183,
                1209
            ],
            [
                1209,
                1358
            ],
            [
                1358,
                1396
            ],
            [
                1396,
                1536
            ],
            [
                1536,
                1611
            ],
            [
                1611,
                1705
            ],
            [
                1705,
                2310
            ],
            [
                2310,
                2833
            ],
            [
                2833,
                3368
            ],
            [
                3368,
                3610
            ],
            [
                3610,
                3794
            ],
            [
                3794,
                3849
            ],
            [
                3849,
                3918
            ],
            [
                3918,
                3951
            ],
            [
                3951,
                4163
            ],
            [
                4163,
                4201
            ],
            [
                4201,
                4259
            ],
            [
                4259,
                4290
            ],
            [
                4290,
                4460
            ],
            [
                4460,
                4680
            ],
            [
                4680,
                4722
            ],
            [
                4722,
                4758
            ],
            [
                4758,
                5013
            ],
            [
                5013,
                5244
            ],
            [
                5244,
                5600
            ],
            [
                5600,
                6247
            ],
            [
                6247,
                6895
            ],
            [
                6895,
                6999
            ],
            [
                6999,
                7083
            ],
            [
                7083,
                7188
            ],
            [
                7188,
                7245
            ],
            [
                7245,
                7271
            ],
            [
                7271,
                7294
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7400
            ],
            [
                7400,
                7418
            ],
            [
                7418,
                7441
            ],
            [
                7441,
                7503
            ],
            [
                7503,
                7690
            ],
            [
                7690,
                7718
            ],
            [
                7718,
                7896
            ],
            [
                7896,
                8228
            ],
            [
                8228,
                8363
            ],
            [
                8363,
                8412
            ],
            [
                8412,
                8431
            ],
            [
                8431,
                8518
            ],
            [
                8518,
                8589
            ]
        ],
        "segment_chars": [
            [
                0,
                204
            ],
            [
                204,
                446
            ],
            [
                446,
                534
            ],
            [
                534,
                731
            ],
            [
                731,
                804
            ],
            [
                804,
                835
            ],
            [
                835,
                862
            ],
            [
                862,
                911
            ],
            [
                911,
                949
            ],
            [
                949,
                971
            ],
            [
                971,
                1022
            ],
            [
                1022,
                1064
            ],
            [
                1064,
                1069
            ],
            [
                1069,
                1119
            ],
            [
                1119,
                1128
            ],
            [
                1128,
                1183
            ],
            [
                1183,
                1209
            ],
            [
                1209,
                1332
            ],
            [
                1332,
                1358
            ],
            [
                1358,
                1396
            ],
            [
                1396,
                1452
            ],
            [
                1452,
                1464
            ],
            [
                1464,
                1492
            ],
            [
                1492,
                1536
            ],
            [
                1536,
                1611
            ],
            [
                1611,
                1649
            ],
            [
                1649,
                1705
            ],
            [
                1705,
                1789
            ],
            [
                1789,
                1881
            ],
            [
                1881,
                1956
            ],
            [
                1956,
                2310
            ],
            [
                2310,
                2363
            ],
            [
                2363,
                2461
            ],
            [
                2461,
                2625
            ],
            [
                2625,
                2691
            ],
            [
                2691,
                2833
            ],
            [
                2833,
                2852
            ],
            [
                2852,
                2952
            ],
            [
                2952,
                2993
            ],
            [
                2993,
                3049
            ],
            [
                3049,
                3098
            ],
            [
                3098,
                3167
            ],
            [
                3167,
                3255
            ],
            [
                3255,
                3368
            ],
            [
                3368,
                3389
            ],
            [
                3389,
                3500
            ],
            [
                3500,
                3528
            ],
            [
                3528,
                3610
            ],
            [
                3610,
                3652
            ],
            [
                3652,
                3712
            ],
            [
                3712,
                3794
            ],
            [
                3794,
                3849
            ],
            [
                3849,
                3859
            ],
            [
                3859,
                3879
            ],
            [
                3879,
                3918
            ],
            [
                3918,
                3951
            ],
            [
                3951,
                3988
            ],
            [
                3988,
                4050
            ],
            [
                4050,
                4107
            ],
            [
                4107,
                4163
            ],
            [
                4163,
                4201
            ],
            [
                4201,
                4223
            ],
            [
                4223,
                4259
            ],
            [
                4259,
                4290
            ],
            [
                4290,
                4311
            ],
            [
                4311,
                4460
            ],
            [
                4460,
                4639
            ],
            [
                4639,
                4680
            ],
            [
                4680,
                4722
            ],
            [
                4722,
                4758
            ],
            [
                4758,
                4800
            ],
            [
                4800,
                4842
            ],
            [
                4842,
                4889
            ],
            [
                4889,
                5013
            ],
            [
                5013,
                5052
            ],
            [
                5052,
                5091
            ],
            [
                5091,
                5244
            ],
            [
                5244,
                5319
            ],
            [
                5319,
                5417
            ],
            [
                5417,
                5474
            ],
            [
                5474,
                5506
            ],
            [
                5506,
                5600
            ],
            [
                5600,
                5828
            ],
            [
                5828,
                5883
            ],
            [
                5883,
                5989
            ],
            [
                5989,
                6021
            ],
            [
                6021,
                6103
            ],
            [
                6103,
                6177
            ],
            [
                6177,
                6247
            ],
            [
                6247,
                6362
            ],
            [
                6362,
                6473
            ],
            [
                6473,
                6558
            ],
            [
                6558,
                6671
            ],
            [
                6671,
                6736
            ],
            [
                6736,
                6895
            ],
            [
                6895,
                6999
            ],
            [
                6999,
                7083
            ],
            [
                7083,
                7103
            ],
            [
                7103,
                7112
            ],
            [
                7112,
                7188
            ],
            [
                7188,
                7213
            ],
            [
                7213,
                7245
            ],
            [
                7245,
                7271
            ],
            [
                7271,
                7294
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7400
            ],
            [
                7400,
                7418
            ],
            [
                7418,
                7441
            ],
            [
                7441,
                7487
            ],
            [
                7487,
                7503
            ],
            [
                7503,
                7632
            ],
            [
                7632,
                7690
            ],
            [
                7690,
                7695
            ],
            [
                7695,
                7718
            ],
            [
                7718,
                7742
            ],
            [
                7742,
                7896
            ],
            [
                7896,
                8004
            ],
            [
                8004,
                8115
            ],
            [
                8115,
                8186
            ],
            [
                8186,
                8228
            ],
            [
                8228,
                8293
            ],
            [
                8293,
                8319
            ],
            [
                8319,
                8363
            ],
            [
                8363,
                8412
            ],
            [
                8412,
                8431
            ],
            [
                8431,
                8518
            ],
            [
                8518,
                8589
            ]
        ],
        "overlap_chars": [
            [
                0,
                68
            ],
            [
                71,
                80
            ],
            [
                81,
                84
            ],
            [
                85,
                87
            ],
            [
                101,
                175
            ],
            [
                176,
                204
            ],
            [
                204,
                235
            ],
            [
                236,
                239
            ],
            [
                240,
                325
            ],
            [
                328,
                363
            ],
            [
                364,
                445
            ],
            [
                446,
                456
            ],
            [
                457,
                484
            ],
            [
                485,
                512
            ],
            [
                513,
                515
            ],
            [
                516,
                534
            ],
            [
                534,
                537
            ],
            [
                538,
                669
            ],
            [
                673,
                682
            ],
            [
                683,
                690
            ],
            [
                692,
                713
            ],
            [
                720,
                729
            ],
            [
                729,
                731
            ],
            [
                731,
                802
            ],
            [
                802,
                804
            ],
            [
                804,
                825
            ],
            [
                833,
                835
            ],
            [
                835,
                860
            ],
            [
                862,
                880
            ],
            [
                883,
                911
            ],
            [
                911,
                949
            ],
            [
                949,
                971
            ],
            [
                971,
                1008
            ],
            [
                1016,
                1022
            ],
            [
                1022,
                1064
            ],
            [
                1064,
                1067
            ],
            [
                1067,
                1069
            ],
            [
                1069,
                1119
            ],
            [
                1119,
                1128
            ],
            [
                1128,
                1183
            ],
            [
                1183,
                1209
            ],
            [
                1210,
                1332
            ],
            [
                1332,
                1358
            ],
            [
                1358,
                1396
            ],
            [
                1396,
                1452
            ],
            [
                1452,
                1464
            ],
            [
                1464,
                1492
            ],
            [
                1492,
                1528
            ],
            [
                1529,
                1536
            ],
            [
                1536,
                1611
            ],
            [
                1611,
                1649
            ],
            [
                1649,
                1705
            ],
            [
                1705,
                1744
            ],
            [
                1745,
                1787
            ],
            [
                1787,
                1789
            ],
            [
                1789,
                1813
            ],
            [
                1823,
                1881
            ],
            [
                1881,
                1891
            ],
            [
                1899,
                1902
            ],
            [
                1909,
                1927
            ],
            [
                1928,
                1956
            ],
            [
                1956,
                2000
            ],
            [
                2000,
                2005
            ],
            [
                2006,
                2040
            ],
            [
                2041,
                2051
            ],
            [
                2052,
                2107
            ],
            [
                2107,
                2199
            ],
            [
                2200,
                2218
            ],
            [
                2219,
                2225
            ],
            [
                2226,
                2230
            ],
            [
                2231,
                2239
            ],
            [
                2240,
                2265
            ],
            [
                2266,
                2310
            ],
            [
                2310,
                2325
            ],
            [
                2326,
                2363
            ],
            [
                2363,
                2425
            ],
            [
                2428,
                2461
            ],
            [
                2461,
                2497
            ],
            [
                2498,
                2518
            ],
            [
                2521,
                2592
            ],
            [
                2618,
                2625
            ],
            [
                2625,
                2631
            ],
            [
                2632,
                2639
            ],
            [
                2640,
                2659
            ],
            [
                2660,
                2691
            ],
            [
                2691,
                2726
            ],
            [
                2733,
                2736
            ],
            [
                2743,
                2767
            ],
            [
                2767,
                2833
            ],
            [
                2833,
                2852
            ],
            [
                2852,
                2861
            ],
            [
                2870,
                2886
            ],
            [
                2886,
                2909
            ],
            [
                2910,
                2952
            ],
            [
                2952,
                2993
            ],
            [
                2993,
                3047
            ],
            [
                3047,
                3049
            ],
            [
                3049,
                3084
            ],
            [
                3085,
                3098
            ],
            [
                3098,
                3153
            ],
            [
                3154,
                3159
            ],
            [
                3160,
                3165
            ],
            [
                3165,
                3167
            ],
            [
                3167,
                3255
            ],
            [
                3255,
                3307
            ],
            [
                3312,
                3334
            ],
            [
                3345,
                3348
            ],
            [
                3349,
                3366
            ],
            [
                3366,
                3367
            ],
            [
                3368,
                3387
            ],
            [
                3389,
                3500
            ],
            [
                3500,
                3507
            ],
            [
                3518,
                3526
            ],
            [
                3526,
                3528
            ],
            [
                3528,
                3609
            ],
            [
                3610,
                3652
            ],
            [
                3652,
                3694
            ],
            [
                3698,
                3701
            ],
            [
                3702,
                3709
            ],
            [
                3710,
                3712
            ],
            [
                3712,
                3740
            ],
            [
                3742,
                3779
            ],
            [
                3792,
                3794
            ],
            [
                3794,
                3836
            ],
            [
                3849,
                3859
            ],
            [
                3859,
                3879
            ],
            [
                3879,
                3913
            ],
            [
                3915,
                3918
            ],
            [
                3918,
                3951
            ],
            [
                3951,
                3958
            ],
            [
                3961,
                3988
            ],
            [
                3988,
                4002
            ],
            [
                4003,
                4037
            ],
            [
                4038,
                4050
            ],
            [
                4050,
                4074
            ],
            [
                4075,
                4107
            ],
            [
                4107,
                4163
            ],
            [
                4163,
                4201
            ],
            [
                4201,
                4223
            ],
            [
                4223,
                4257
            ],
            [
                4257,
                4259
            ],
            [
                4259,
                4290
            ],
            [
                4290,
                4311
            ],
            [
                4311,
                4345
            ],
            [
                4346,
                4394
            ],
            [
                4395,
                4460
            ],
            [
                4460,
                4639
            ],
            [
                4639,
                4654
            ],
            [
                4665,
                4680
            ],
            [
                4680,
                4722
            ],
            [
                4722,
                4758
            ],
            [
                4758,
                4800
            ],
            [
                4800,
                4813
            ],
            [
                4819,
                4842
            ],
            [
                4842,
                4889
            ],
            [
                4889,
                4919
            ],
            [
                4920,
                4929
            ],
            [
                4929,
                5013
            ],
            [
                5013,
                5029
            ],
            [
                5030,
                5052
            ],
            [
                5052,
                5091
            ],
            [
                5091,
                5094
            ],
            [
                5095,
                5097
            ],
            [
                5103,
                5127
            ],
            [
                5140,
                5155
            ],
            [
                5156,
                5157
            ],
            [
                5158,
                5243
            ],
            [
                5251,
                5262
            ],
            [
                5263,
                5291
            ],
            [
                5305,
                5319
            ],
            [
                5322,
                5359
            ],
            [
                5359,
                5360
            ],
            [
                5375,
                5417
            ],
            [
                5417,
                5474
            ],
            [
                5474,
                5482
            ],
            [
                5486,
                5489
            ],
            [
                5490,
                5506
            ],
            [
                5511,
                5525
            ],
            [
                5533,
                5541
            ],
            [
                5542,
                5599
            ],
            [
                5600,
                5670
            ],
            [
                5671,
                5681
            ],
            [
                5682,
                5684
            ],
            [
                5685,
                5698
            ],
            [
                5699,
                5717
            ],
            [
                5718,
                5719
            ],
            [
                5720,
                5749
            ],
            [
                5755,
                5771
            ],
            [
                5772,
                5773
            ],
            [
                5774,
                5777
            ],
            [
                5778,
                5809
            ],
            [
                5810,
                5818
            ],
            [
                5819,
                5828
            ],
            [
                5828,
                5860
            ],
            [
                5861,
                5874
            ],
            [
                5875,
                5883
            ],
            [
                5889,
                5948
            ],
            [
                5949,
                5971
            ],
            [
                5979,
                5989
            ],
            [
                5989,
                6021
            ],
            [
                6021,
                6103
            ],
            [
                6103,
                6177
            ],
            [
                6177,
                6180
            ],
            [
                6185,
                6246
            ],
            [
                6247,
                6249
            ],
            [
                6255,
                6280
            ],
            [
                6283,
                6294
            ],
            [
                6295,
                6362
            ],
            [
                6362,
                6388
            ],
            [
                6395,
                6473
            ],
            [
                6473,
                6476
            ],
            [
                6477,
                6556
            ],
            [
                6556,
                6558
            ],
            [
                6558,
                6588
            ],
            [
                6594,
                6669
            ],
            [
                6669,
                6671
            ],
            [
                6671,
                6736
            ],
            [
                6736,
                6763
            ],
            [
                6767,
                6786
            ],
            [
                6787,
                6823
            ],
            [
                6824,
                6831
            ],
            [
                6841,
                6895
            ],
            [
                6895,
                6910
            ],
            [
                6919,
                6929
            ],
            [
                6943,
                6999
            ],
            [
                6999,
                7083
            ],
            [
                7083,
                7103
            ],
            [
                7103,
                7110
            ],
            [
                7110,
                7112
            ],
            [
                7112,
                7188
            ],
            [
                7188,
                7213
            ],
            [
                7213,
                7245
            ],
            [
                7245,
                7246
            ],
            [
                7252,
                7271
            ],
            [
                7271,
                7287
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7400
            ],
            [
                7400,
                7418
            ],
            [
                7418,
                7441
            ],
            [
                7442,
                7486
            ],
            [
                7503,
                7632
            ],
            [
                7632,
                7690
            ],
            [
                7690,
                7693
            ],
            [
                7693,
                7695
            ],
            [
                7695,
                7718
            ],
            [
                7718,
                7742
            ],
            [
                7742,
                7800
            ],
            [
                7808,
                7812
            ],
            [
                7816,
                7821
            ],
            [
                7827,
                7872
            ],
            [
                7889,
                7894
            ],
            [
                7894,
                7896
            ],
            [
                7896,
                8004
            ],
            [
                8004,
                8092
            ],
            [
                8097,
                8101
            ],
            [
                8106,
                8115
            ],
            [
                8115,
                8148
            ],
            [
                8149,
                8181
            ],
            [
                8184,
                8186
            ],
            [
                8186,
                8228
            ],
            [
                8228,
                8293
            ],
            [
                8293,
                8319
            ],
            [
                8319,
                8360
            ],
            [
                8363,
                8412
            ],
            [
                8412,
                8431
            ],
            [
                8431,
                8518
            ],
            [
                8518,
                8589
            ]
        ],
        "row_chars": [
            [
                0,
                204
            ],
            [
                204,
                446
            ],
            [
                446,
                534
            ],
            [
                534,
                731
            ],
            [
                731,
                804
            ],
            [
                804,
                835
            ],
            [
                835,
                862
            ],
            [
                862,
                862
            ],
            [
                862,
                862
            ],
            [
                862,
                911
            ],
            [
                911,
                949
            ],
            [
                949,
                971
            ],
            [
                971,
                1022
            ],
            [
                1022,
                1022
            ],
            [
                1022,
                1064
            ],
            [
                1064,
                1069
            ],
            [
                1069,
                1119
            ],
            [
                1119,
                1128
            ],
            [
                1128,
                1128
            ],
            [
                1128,
                1183
            ],
            [
                1183,
                1209
            ],
            [
                1209,
                1209
            ],
            [
                1209,
                1332
            ],
            [
                1332,
                1358
            ],
            [
                1358,
                1396
            ],
            [
                1396,
                1452
            ],
            [
                1452,
                1464
            ],
            [
                1464,
                1492
            ],
            [
                1492,
                1536
            ],
            [
                1536,
                1611
            ],
            [
                1611,
                1649
            ],
            [
                1649,
                1705
            ],
            [
                1705,
                1789
            ],
            [
                1789,
                1881
            ],
            [
                1881,
                1956
            ],
            [
                1956,
                2310
            ],
            [
                2310,
                2363
            ],
            [
                2363,
                2461
            ],
            [
                2461,
                2461
            ],
            [
                2461,
                2625
            ],
            [
                2625,
                2691
            ],
            [
                2691,
                2691
            ],
            [
                2691,
                2691
            ],
            [
                2691,
                2833
            ],
            [
                2833,
                2852
            ],
            [
                2852,
                2952
            ],
            [
                2952,
                2993
            ],
            [
                2993,
                3049
            ],
            [
                3049,
                3098
            ],
            [
                3098,
                3167
            ],
            [
                3167,
                3255
            ],
            [
                3255,
                3368
            ],
            [
                3368,
                3389
            ],
            [
                3389,
                3500
            ],
            [
                3500,
                3528
            ],
            [
                3528,
                3610
            ],
            [
                3610,
                3652
            ],
            [
                3652,
                3712
            ],
            [
                3712,
                3794
            ],
            [
                3794,
                3849
            ],
            [
                3849,
                3859
            ],
            [
                3859,
                3859
            ],
            [
                3859,
                3879
            ],
            [
                3879,
                3918
            ],
            [
                3918,
                3951
            ],
            [
                3951,
                3988
            ],
            [
                3988,
                4050
            ],
            [
                4050,
                4107
            ],
            [
                4107,
                4107
            ],
            [
                4107,
                4107
            ],
            [
                4107,
                4107
            ],
            [
                4107,
                4107
            ],
            [
                4107,
                4163
            ],
            [
                4163,
                4201
            ],
            [
                4201,
                4223
            ],
            [
                4223,
                4259
            ],
            [
                4259,
                4290
            ],
            [
                4290,
                4311
            ],
            [
                4311,
                4460
            ],
            [
                4460,
                4639
            ],
            [
                4639,
                4680
            ],
            [
                4680,
                4722
            ],
            [
                4722,
                4758
            ],
            [
                4758,
                4800
            ],
            [
                4800,
                4842
            ],
            [
                4842,
                4889
            ],
            [
                4889,
                5013
            ],
            [
                5013,
                5052
            ],
            [
                5052,
                5091
            ],
            [
                5091,
                5244
            ],
            [
                5244,
                5319
            ],
            [
                5319,
                5417
            ],
            [
                5417,
                5474
            ],
            [
                5474,
                5506
            ],
            [
                5506,
                5600
            ],
            [
                5600,
                5828
            ],
            [
                5828,
                5883
            ],
            [
                5883,
                5989
            ],
            [
                5989,
                6021
            ],
            [
                6021,
                6103
            ],
            [
                6103,
                6177
            ],
            [
                6177,
                6247
            ],
            [
                6247,
                6362
            ],
            [
                6362,
                6473
            ],
            [
                6473,
                6558
            ],
            [
                6558,
                6671
            ],
            [
                6671,
                6736
            ],
            [
                6736,
                6895
            ],
            [
                6895,
                6999
            ],
            [
                6999,
                7083
            ],
            [
                7083,
                7103
            ],
            [
                7103,
                7112
            ],
            [
                7112,
                7188
            ],
            [
                7188,
                7213
            ],
            [
                7213,
                7245
            ],
            [
                7245,
                7271
            ],
            [
                7271,
                7294
            ],
            [
                7294,
                7294
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7400
            ],
            [
                7400,
                7418
            ],
            [
                7418,
                7441
            ],
            [
                7441,
                7441
            ],
            [
                7441,
                7503
            ],
            [
                7503,
                7632
            ],
            [
                7632,
                7690
            ],
            [
                7690,
                7695
            ],
            [
                7695,
                7718
            ],
            [
                7718,
                7742
            ],
            [
                7742,
                7896
            ],
            [
                7896,
                8004
            ],
            [
                8004,
                8115
            ],
            [
                8115,
                8186
            ],
            [
                8186,
                8228
            ],
            [
                8228,
                8228
            ],
            [
                8228,
                8228
            ],
            [
                8228,
                8293
            ],
            [
                8293,
                8319
            ],
            [
                8319,
                8363
            ],
            [
                8363,
                8412
            ],
            [
                8412,
                8431
            ],
            [
                8431,
                8518
            ],
            [
                8518,
                8589
            ]
        ]
    }
}