{
    "original": {
        "text": "\"I don't think it quite nice, mamma; that's all. Of course if you have made up your mind to go, I must go with you.\"\n\"What on earth can be more natural than that you should go to your own cousin's house?\"\n\"You know what I mean, mamma.\"\n\"It's done now, my dear, and I don't think there is anything at all in what you say.\"\nThis little conversation arose from Lady Carbury's announcement to her daughter of her intention of soliciting the hospitality of Carbury Manor for the Whitsun week. It was very grievous to Henrietta that she should be taken to the house of a man who was in love with her, even though he was her cousin. But she had no escape. She could not remain in town by herself, nor could she even allude to her grievance to anyone but to her mother. Lady Carbury, in order that she might be quite safe from opposition, had posted the following letter to her cousin before she spoke to her daughter:--\nWelbeck Street, 24th April, 18--.\nMY DEAR ROGER,\nWe know how kind you are and how sincere, and that if what I am going to propose doesn't suit you'll say so at once. I have been working very hard,--too hard indeed, and I feel that nothing will do me so much real good as getting into the country for a day or two. Would you take us for a part of Whitsun week? We would come down on the 20th May and stay over the Sunday if you would keep us. Felix says he would run down though he would not trouble you for so long a time as we talk of staying.\nI'm sure you must have been glad to hear of his being put upon that Great American Railway Board as a Director. It opens a new sphere of life to him, and will enable him to prove that he can make himself useful. I think it was a great confidence to place in one so young.\nOf course you will say so at once if my little proposal interferes with any of your plans, but you have been so very very kind to us that I have no scruple in making it.\nHenrietta joins with me in kind love.\nYour affectionate cousin,\nMATILDA CARBURY.\nThere was much in this letter that disturbed and even annoyed Roger Carbury. In the first place he felt that Henrietta should not be brought to his house. Much as he loved her, dear as her presence to him always was, he hardly wished to have her at Carbury unless she would come with a resolution to be its future mistress. In one respect he did Lady Carbury an injustice. He knew that she was anxious to forward his suit, and he thought that Henrietta was being brought to his house with that object. He had not heard that the great heiress was coming into his neighbourhood, and therefore knew nothing of Lady Carbury's scheme in that direction. He was, too, disgusted by the ill-founded pride which the mother expressed at her son's position as a director. Roger Carbury did not believe in the Railway. He did not believe in Fisker, nor in Melmotte, and certainly not in the Board generally. Paul Montague had acted in opposition to his advice in yielding to the seductions of Fisker. The whole thing was to his mind false, fraudulent, and ruinous. Of what nature could be a Company which should have itself directed by such men as Lord Alfred Grendall and Sir Felix Carbury? And then as to their great Chairman, did not everybody know, in spite of all the duchesses, that Mr. Melmotte was a gigantic swindler? Although there was more than one immediate cause for bitterness between them, Roger loved Paul Montague well and could not bear with patience the appearance of his friend's name on such a list. And now he was asked for warm congratulations because Sir Felix Carbury was one of the Board! He did not know which to despise most, Sir Felix for belonging to such a Board, or the Board for having such a director. \"New sphere of life!\" he said to himself. \"The only proper sphere for them all would be Newgate!\"\nAnd there was another trouble. He had asked Paul Montague to come to Carbury for this special week, and Paul had accepted the invitation. With the constancy, which was perhaps his strongest characteristic, he clung to his old affection for the man. He could not bear the idea of a permanent quarrel, though he knew that there must be a quarrel if the man interfered with his dearest hopes. He had asked him down to Carbury intending that the name of Henrietta Carbury should not be mentioned between them;--and now it was proposed to him that Henrietta Carbury should be at the Manor House at the very time of Paul's visit! He made up his mind at once that he must tell Paul not to come.\nHe wrote his two letters at once. That to Lady Carbury was very short. He would be delighted to see her and Henrietta at the time named,--and would be very glad should it suit Felix to come also. He did not say a word about the Board, or the young man's probable usefulness in his new sphere of life. To Montague his letter was longer. \"It is always best to be open and true,\" he said. \"Since you were kind enough to say that you would come to me, Lady Carbury has proposed to visit me just at the same time and to bring her daughter. After what has passed between us I need hardly say that I could not make you both welcome here together. It is not pleasant to me to have to ask you to postpone your visit, but I think you will not accuse me of a want of hospitality towards you.\" Paul wrote back to say that he was sure that there was no want of hospitality, and that he would remain in town.\nSuffolk is not especially a picturesque county, nor can it be said that the scenery round Carbury was either grand or beautiful; but there were little prettinesses attached to the house itself and the grounds around it which gave it a charm of its own. The Carbury River,--so called, though at no place is it so wide but that an active schoolboy might jump across it,--runs, or rather creeps into the Waveney, and in its course is robbed by a moat which surrounds Carbury Manor House. The moat has been rather a trouble to the proprietors, and especially so to Roger, as in these days of sanitary considerations it has been felt necessary either to keep it clean with at any rate moving water in it, or else to fill it up and abolish it altogether. That plan of abolishing it had to be thought of and was seriously discussed about ten years since; but then it was decided that such a proceeding would altogether alter the character of the house, would destroy the gardens, and would create a waste of mud all round the place which it would take years to beautify, or even to make endurable. And then an important question had been asked by an intelligent farmer who had long been a tenant on the property; \"Fill un oop;--eh, eh; sooner said than doone, squoire. Where be the stoof to come from?\" The squire, therefore, had given up that idea, and instead of abolishing his moat had made it prettier than ever. The high road from Bungay to Beccles ran close to the house,--so close that the gable ends of the building were separated from it only by the breadth of the moat. A short, private road, not above a hundred yards in length, led to the bridge which faced the front door. The bridge was old, and high, with sundry architectural pretensions, and guarded by iron gates in the centre, which, however, were very rarely closed. Between the bridge and the front door there was a sweep of ground just sufficient for the turning of a carriage, and on either side of this the house was brought close to the water, so that the entrance was in a recess, or irregular quadrangle, of which the bridge and moat formed one side. At the back of the house there were large gardens screened from the road by a wall ten feet high, in which there were yew trees and cypresses said to be of wonderful antiquity. The gardens were partly inside the moat, but chiefly beyond them, and were joined by two bridges--a foot bridge and one with a carriage way,--and there was another bridge at the end of the house furthest from the road, leading from the back door to the stables and farmyard.\nThe house itself had been built in the time of Charles II., when that which we call Tudor architecture was giving way to a cheaper, less picturesque, though perhaps more useful form. But Carbury Manor House, through the whole county, had the reputation of being a Tudor building. The windows were long, and for the most part low, made with strong mullions, and still contained small, old-fashioned panes; for the squire had not as yet gone to the expense of plate glass. There was one high bow window, which belonged to the library, and which looked out on to the gravel sweep, at the left of the front door as you entered it. All the other chief rooms faced upon the garden. The house itself was built of a stone that had become buff, or almost yellow with years, and was very pretty. It was still covered with tiles, as were all the attached buildings. It was only two stories high, except at the end, where the kitchens were placed and the offices, which thus rose above the other part of the edifice. The rooms throughout were low, and for the most part long and narrow, with large wide fire-places and deep wainscotings. Taking it altogether, one would be inclined to say, that it was picturesque rather than comfortable. Such as it was its owner was very proud of it,--with a pride of which he never spoke to anyone, which he endeavoured studiously to conceal, but which had made itself known to all who knew him well. The houses of the gentry around him were superior to his in material comfort and general accommodation, but to none of them belonged that thoroughly established look of old county position which belonged to Carbury. Bundlesham, where the Primeros lived, was the finest house in that part of the county, but it looked as if it had been built within the last twenty years. It was surrounded by new shrubs and new lawns, by new walls and new outhouses, and savoured of trade;--so at least thought Roger Carbury, though he never said the words. Caversham was a very large mansion, built in the early part of George III.'s reign, when men did care that things about them should be comfortable, but did not care that they should be picturesque. There was nothing at all to recommend Caversham but its size. Eardly Park, the seat of the Hepworths, had, as a park, some pretensions. Carbury possessed nothing that could be called a park, the enclosures beyond the gardens being merely so many home paddocks. But the house of Eardly was ugly and bad. The Bishop's palace was an excellent gentleman's residence, but then that too was comparatively modern, and had no peculiar features of its own. Now Carbury Manor House was peculiar, and in the eyes of its owner was pre-eminently beautiful.\nIt often troubled him to think what would come of the place when he was gone. He was at present forty years old, and was perhaps as healthy a man as you could find in the whole county. Those around who had known him as he grew into manhood among them, especially the farmers of the neighbourhood, still regarded him as a young man. They spoke of him at the country fairs as the young squire. When in his happiest moods he could be almost a boy, and he still had something of old-fashioned boyish reverence for his elders. But of late there had grown up a great care within his breast,--a care which does not often, perhaps, in these days bear so heavily on men's hearts as it used to do. He had asked his cousin to marry him,--having assured himself with certainty that he did love her better than any other woman,--and she had declined. She had refused him more than once, and he believed her implicitly when she told him that she could not love him. He had a way of believing people, especially when such belief was opposed to his own interests, and had none of that self-confidence which makes a man think that if opportunity be allowed him he can win a woman even in spite of herself. But if it were fated that he should not succeed with Henrietta, then,--so he felt assured,--no marriage would now be possible to him. In that case he must look out for an heir, and could regard himself simply as a stop-gap among the Carburys. In that case he could never enjoy the luxury of doing the best he could with the property in order that a son of his own might enjoy it.\nNow Sir Felix was the next heir. Roger was hampered by no entail, and could leave every acre of the property as he pleased. In one respect the natural succession to it by Sir Felix would generally be considered fortunate. It had happened that a title had been won in a lower branch of the family, and were this succession to take place the family title and the family property would go together. No doubt to Sir Felix himself such an arrangement would seem to be the most proper thing in the world,--as it would also to Lady Carbury were it not that she looked to Carbury Manor as the future home of another child. But to all this the present owner of the property had very strong objections. It was not only that he thought ill of the baronet himself,--so ill as to feel thoroughly convinced that no good could come from that quarter,--but he thought ill also of the baronetcy itself. Sir Patrick, to his thinking, had been altogether unjustifiable in accepting an enduring title, knowing that he would leave behind him no property adequate for its support. A baronet, so thought Roger Carbury, should be a rich man, rich enough to grace the rank which he assumed to wear. A title, according to Roger's doctrine on such subjects, could make no man a gentleman, but, if improperly worn, might degrade a man who would otherwise be a gentleman. He thought that a gentleman, born and bred, acknowledged as such without doubt, could not be made more than a gentleman by all the titles which the Queen could give. With these old-fashioned notions Roger hated the title which had fallen upon a branch of his family. He certainly would not leave his property to support the title which Sir Felix unfortunately possessed. But Sir Felix was the natural heir, and this man felt himself constrained, almost as by some divine law, to see that his land went by natural descent. Though he was in no degree fettered as to its disposition, he did not presume himself to have more than a life interest in the estate. It was his duty to see that it went from Carbury to Carbury as long as there was a Carbury to hold it, and especially his duty to see that it should go from his hands, at his death, unimpaired in extent or value. There was no reason why he should himself die for the next twenty or thirty years,--but were he to die Sir Felix would undoubtedly dissipate the acres, and then there would be an end of Carbury. But in such case he, Roger Carbury, would at any rate have done his duty. He knew that no human arrangements can be fixed, let the care in making them be ever so great. To his thinking it would be better that the estate should be dissipated by a Carbury than held together by a stranger. He would stick to the old name while there was one to bear it, and to the old family while a member of it was left. So thinking he had already made his will, leaving the entire property to the man whom of all others he most despised, should he himself die without child.\nIn the afternoon of the day on which Lady Carbury was expected, he wandered about the place thinking of all this. How infinitely better it would be that he should have an heir of his own. How wonderfully beautiful would the world be to him if at last his cousin would consent to be his wife! How wearily insipid must it be if no such consent could be obtained from her. And then he thought much of her welfare too. In very truth he did not like Lady Carbury. He saw through her character, judging her with almost absolute accuracy. The woman was affectionate, seeking good things for others rather than for herself; but she was essentially worldly, believing that good could come out of evil, that falsehood might in certain conditions be better than truth, that shams and pretences might do the work of true service, that a strong house might be built upon the sand! It was lamentable to him that the girl he loved should be subjected to this teaching, and live in an atmosphere so burdened with falsehood. Would not the touch of pitch at last defile her? In his heart of hearts he believed that she loved Paul Montague; and of Paul himself he was beginning to fear evil. What but a sham could be a man who consented to pretend to sit as one of a Board of Directors to manage an enormous enterprise with such colleagues as Lord Alfred Grendall and Sir Felix Carbury, under the absolute control of such a one as Mr. Augustus Melmotte? Was not this building a house upon the sand with a vengeance? What a life it would be for Henrietta Carbury were she to marry a man striving to become rich without labour and without capital, and who might one day be wealthy and the next a beggar,--a city adventurer, who of all men was to him the vilest and most dishonest? He strove to think well of Paul Montague, but such was the life which he feared the young man was preparing for himself.\nThen he went into the house and wandered up through the rooms which the two ladies were to occupy. As their host, a host without a wife or mother or sister, it was his duty to see that things were comfortable, but it may be doubted whether he would have been so careful had the mother been coming alone. In the smaller room of the two the hangings were all white, and the room was sweet with May flowers; and he brought a white rose from the hot-house, and placed it in a glass on the dressing table. Surely she would know who put it there.\nThen he stood at the open window, looking down upon the lawn, gazing vacantly for half an hour, till he heard the wheels of the carriage before the front door. During that half hour he resolved that he would try again as though there had as yet been no repulse.",
        "paragraph_chars": [
            [
                0,
                117
            ],
            [
                117,
                205
            ],
            [
                205,
                236
            ],
            [
                236,
                322
            ],
            [
                322,
                913
            ],
            [
                913,
                947
            ],
            [
                947,
                962
            ],
            [
                962,
                1458
            ],
            [
                1458,
                1730
            ],
            [
                1730,
                1900
            ],
            [
                1900,
                1938
            ],
            [
                1938,
                1964
            ],
            [
                1964,
                1981
            ],
            [
                1981,
                3802
            ],
            [
                3802,
                4490
            ],
            [
                4490,
                5385
            ],
            [
                5385,
                7958
            ],
            [
                7958,
                10666
            ],
            [
                10666,
                12235
            ],
            [
                12235,
                15202
            ],
            [
                15202,
                17083
            ],
            [
                17083,
                17624
            ],
            [
                17624,
                17885
            ]
        ],
        "segment_chars": [
            [
                0,
                49
            ],
            [
                49,
                117
            ],
            [
                117,
                205
            ],
            [
                205,
                236
            ],
            [
                236,
                322
            ],
            [
                322,
                488
            ],
            [
                488,
                626
            ],
            [
                626,
                649
            ],
            [
                649,
                762
            ],
            [
                762,
                913
            ],
            [
                913,
                947
            ],
            [
                947,
                962
            ],
            [
                962,
                1079
            ],
            [
                1079,
                1227
            ],
            [
                1227,
                1273
            ],
            [
                1273,
                1355
            ],
            [
                1355,
                1458
            ],
            [
                1458,
                1570
            ],
            [
                1570,
                1670
            ],
            [
                1670,
                1730
            ],
            [
                1730,
                1900
            ],
            [
                1900,
                1938
            ],
            [
                1938,
                1964
            ],
            [
                1964,
                1981
            ],
            [
                1981,
                2058
            ],
            [
                2058,
                2136
            ],
            [
                2136,
                2305
            ],
            [
                2305,
                2354
            ],
            [
                2354,
                2483
            ],
            [
                2483,
                2629
            ],
            [
                2629,
                2741
            ],
            [
                2741,
                2787
            ],
            [
                2787,
                2876
            ],
            [
                2876,
                2969
            ],
            [
                2969,
                3033
            ],
            [
                3033,
                3160
            ],
            [
                3160,
                3295
            ],
            [
                3295,
                3489
            ],
            [
                3489,
                3583
            ],
            [
                3583,
                3704
            ],
            [
                3704,
                3726
            ],
            [
                3726,
                3746
            ],
            [
                3746,
                3802
            ],
            [
                3802,
                3833
            ],
            [
                3833,
                3940
            ],
            [
                3940,
                4051
            ],
            [
                4051,
                4192
            ],
            [
                4192,
                4426
            ],
            [
                4426,
                4490
            ],
            [
                4490,
                4524
            ],
            [
                4524,
                4561
            ],
            [
                4561,
                4686
            ],
            [
                4686,
                4791
            ],
            [
                4791,
                4826
            ],
            [
                4826,
                4876
            ],
            [
                4876,
                5025
            ],
            [
                5025,
                5130
            ],
            [
                5130,
                5272
            ],
            [
                5272,
                5385
            ],
            [
                5385,
                5638
            ],
            [
                5638,
                5870
            ],
            [
                5870,
                6134
            ],
            [
                6134,
                6476
            ],
            [
                6476,
                6647
            ],
            [
                6647,
                6681
            ],
            [
                6681,
                6795
            ],
            [
                6795,
                6958
            ],
            [
                6958,
                7064
            ],
            [
                7064,
                7215
            ],
            [
                7215,
                7506
            ],
            [
                7506,
                7683
            ],
            [
                7683,
                7958
            ],
            [
                7958,
                8141
            ],
            [
                8141,
                8238
            ],
            [
                8238,
                8429
            ],
            [
                8429,
                8585
            ],
            [
                8585,
                8634
            ],
            [
                8634,
                8744
            ],
            [
                8744,
                8813
            ],
            [
                8813,
                8963
            ],
            [
                8963,
                9084
            ],
            [
                9084,
                9185
            ],
            [
                9185,
                9383
            ],
            [
                9383,
                9599
            ],
            [
                9599,
                9754
            ],
            [
                9754,
                9924
            ],
            [
                9924,
                9998
            ],
            [
                9998,
                10122
            ],
            [
                10122,
                10184
            ],
            [
                10184,
                10258
            ],
            [
                10258,
                10383
            ],
            [
                10383,
                10425
            ],
            [
                10425,
                10570
            ],
            [
                10570,
                10666
            ],
            [
                10666,
                10744
            ],
            [
                10744,
                10851
            ],
            [
                10851,
                10998
            ],
            [
                10998,
                11058
            ],
            [
                11058,
                11188
            ],
            [
                11188,
                11354
            ],
            [
                11354,
                11504
            ],
            [
                11504,
                11618
            ],
            [
                11618,
                11855
            ],
            [
                11855,
                11989
            ],
            [
                11989,
                12098
            ],
            [
                12098,
                12235
            ],
            [
                12235,
                12268
            ],
            [
                12268,
                12359
            ],
            [
                12359,
                12457
            ],
            [
                12457,
                12631
            ],
            [
                12631,
                12850
            ],
            [
                12850,
                12928
            ],
            [
                12928,
                13121
            ],
            [
                13121,
                13294
            ],
            [
                13294,
                13409
            ],
            [
                13409,
                13578
            ],
            [
                13578,
                13744
            ],
            [
                13744,
                13845
            ],
            [
                13845,
                13949
            ],
            [
                13949,
                14100
            ],
            [
                14100,
                14235
            ],
            [
                14235,
                14448
            ],
            [
                14448,
                14643
            ],
            [
                14643,
                14717
            ],
            [
                14717,
                14812
            ],
            [
                14812,
                14931
            ],
            [
                14931,
                15047
            ],
            [
                15047,
                15202
            ],
            [
                15202,
                15316
            ],
            [
                15316,
                15390
            ],
            [
                15390,
                15494
            ],
            [
                15494,
                15572
            ],
            [
                15572,
                15617
            ],
            [
                15617,
                15661
            ],
            [
                15661,
                15734
            ],
            [
                15734,
                16070
            ],
            [
                16070,
                16210
            ],
            [
                16210,
                16259
            ],
            [
                16259,
                16375
            ],
            [
                16375,
                16637
            ],
            [
                16637,
                16699
            ],
            [
                16699,
                16962
            ],
            [
                16962,
                17083
            ],
            [
                17083,
                17182
            ],
            [
                17182,
                17387
            ],
            [
                17387,
                17584
            ],
            [
                17584,
                17624
            ],
            [
                17624,
                17784
            ],
            [
                17784,
                17885
            ]
        ],
        "overlap_chars": [
            [
                0,
                49
            ],
            [
                49,
                117
            ],
            [
                117,
                156
            ],
            [
                176,
                183
            ],
            [
                188,
                205
            ],
            [
                205,
                236
            ],
            [
                236,
                259
            ],
            [
                319,
                322
            ],
            [
                322,
                352
            ],
            [
                358,
                370
            ],
            [
                405,
                421
            ],
            [
                452,
                488
            ],
            [
                488,
                593
            ],
            [
                624,
                626
            ],
            [
                626,
                649
            ],
            [
                649,
                688
            ],
            [
                760,
                762
            ],
            [
                762,
                774
            ],
            [
                831,
                834
            ],
            [
                835,
                865
            ],
            [
                909,
                910
            ],
            [
                947,
                962
            ],
            [
                962,
                986
            ],
            [
                1002,
                1007
            ],
            [
                1013,
                1059
            ],
            [
                1063,
                1079
            ],
            [
                1079,
                1109
            ],
            [
                1128,
                1131
            ],
            [
                1134,
                1138
            ],
            [
                1157,
                1162
            ],
            [
                1176,
                1180
            ],
            [
                1192,
                1227
            ],
            [
                1227,
                1273
            ],
            [
                1273,
                1355
            ],
            [
                1355,
                1458
            ],
            [
                1458,
                1511
            ],
            [
                1558,
                1568
            ],
            [
                1521,
                1554
            ],
            [
                1568,
                1570
            ],
            [
                1570,
                1572
            ],
            [
                1612,
                1670
            ],
            [
                1670,
                1730
            ],
            [
                1730,
                1801
            ],
            [
                1809,
                1900
            ],
            [
                1900,
                1938
            ],
            [
                1938,
                1964
            ],
            [
                1964,
                1981
            ],
            [
                1981,
                2058
            ],
            [
                2058,
                2136
            ],
            [
                2136,
                2156
            ],
            [
                2196,
                2248
            ],
            [
                2260,
                2305
            ],
            [
                2408,
                2469
            ],
            [
                2475,
                2481
            ],
            [
                2394,
                2402
            ],
            [
                2481,
                2483
            ],
            [
                2483,
                2628
            ],
            [
                2629,
                2741
            ],
            [
                2741,
                2785
            ],
            [
                2832,
                2833
            ],
            [
                2806,
                2816
            ],
            [
                2824,
                2832
            ],
            [
                2874,
                2876
            ],
            [
                2876,
                2899
            ],
            [
                2917,
                2942
            ],
            [
                2961,
                2967
            ],
            [
                2947,
                2957
            ],
            [
                2967,
                2969
            ],
            [
                2969,
                3000
            ],
            [
                3008,
                3018
            ],
            [
                3020,
                3033
            ],
            [
                3036,
                3040
            ],
            [
                3033,
                3035
            ],
            [
                3059,
                3066
            ],
            [
                3092,
                3160
            ],
            [
                3583,
                3704
            ],
            [
                3806,
                3833
            ],
            [
                3833,
                3878
            ],
            [
                3924,
                3927
            ],
            [
                3896,
                3923
            ],
            [
                3938,
                3940
            ],
            [
                4011,
                4051
            ],
            [
                4051,
                4148
            ],
            [
                4157,
                4192
            ],
            [
                4192,
                4239
            ],
            [
                4252,
                4261
            ],
            [
                4416,
                4418
            ],
            [
                4244,
                4248
            ],
            [
                4270,
                4307
            ],
            [
                4309,
                4332
            ],
            [
                4340,
                4354
            ],
            [
                4363,
                4403
            ],
            [
                4404,
                4408
            ],
            [
                4424,
                4426
            ],
            [
                4426,
                4428
            ],
            [
                4454,
                4490
            ],
            [
                4490,
                4498
            ],
            [
                4503,
                4524
            ],
            [
                4524,
                4561
            ],
            [
                4561,
                4607
            ],
            [
                4625,
                4626
            ],
            [
                4628,
                4631
            ],
            [
                4680,
                4684
            ],
            [
                4666,
                4671
            ],
            [
                4684,
                4686
            ],
            [
                4686,
                4723
            ],
            [
                4789,
                4790
            ],
            [
                4791,
                4825
            ],
            [
                4826,
                4869
            ],
            [
                4874,
                4876
            ],
            [
                4876,
                4997
            ],
            [
                5011,
                5025
            ],
            [
                5058,
                5130
            ],
            [
                5130,
                5237
            ],
            [
                5243,
                5272
            ],
            [
                5272,
                5329
            ],
            [
                5335,
                5385
            ],
            [
                5385,
                5399
            ],
            [
                5400,
                5410
            ],
            [
                5413,
                5486
            ],
            [
                5494,
                5517
            ],
            [
                5561,
                5570
            ],
            [
                5578,
                5581
            ],
            [
                5629,
                5632
            ],
            [
                5586,
                5593
            ],
            [
                5618,
                5628
            ],
            [
                5633,
                5638
            ],
            [
                5849,
                5868
            ],
            [
                5823,
                5832
            ],
            [
                5655,
                5656
            ],
            [
                5833,
                5838
            ],
            [
                5888,
                5904
            ],
            [
                5943,
                5955
            ],
            [
                5691,
                5693
            ],
            [
                6009,
                6052
            ],
            [
                6065,
                6077
            ],
            [
                6083,
                6134
            ],
            [
                6134,
                6164
            ],
            [
                6200,
                6225
            ],
            [
                6231,
                6236
            ],
            [
                6242,
                6261
            ],
            [
                6280,
                6285
            ],
            [
                6297,
                6330
            ],
            [
                6182,
                6185
            ],
            [
                6368,
                6389
            ],
            [
                6410,
                6447
            ],
            [
                6474,
                6476
            ],
            [
                6681,
                6739
            ],
            [
                6763,
                6771
            ],
            [
                6754,
                6762
            ],
            [
                6775,
                6794
            ],
            [
                6795,
                6835
            ],
            [
                7195,
                7199
            ],
            [
                6836,
                6854
            ],
            [
                6958,
                6979
            ],
            [
                7018,
                7021
            ],
            [
                6917,
                6924
            ],
            [
                7022,
                7028
            ],
            [
                7079,
                7082
            ],
            [
                7029,
                7035
            ],
            [
                6948,
                6957
            ],
            [
                7215,
                7326
            ],
            [
                7504,
                7506
            ],
            [
                7506,
                7603
            ],
            [
                7624,
                7625
            ],
            [
                7634,
                7647
            ],
            [
                7681,
                7683
            ],
            [
                7683,
                7779
            ],
            [
                7781,
                7822
            ],
            [
                7956,
                7958
            ],
            [
                7958,
                8015
            ],
            [
                8088,
                8089
            ],
            [
                8018,
                8022
            ],
            [
                8042,
                8080
            ],
            [
                8090,
                8141
            ],
            [
                8141,
                8164
            ],
            [
                8192,
                8238
            ],
            [
                8238,
                8260
            ],
            [
                8293,
                8318
            ],
            [
                8335,
                8361
            ],
            [
                8427,
                8429
            ],
            [
                8429,
                8458
            ],
            [
                8478,
                8490
            ],
            [
                8495,
                8534
            ],
            [
                8551,
                8565
            ],
            [
                8583,
                8585
            ],
            [
                8585,
                8616
            ],
            [
                8622,
                8634
            ],
            [
                8634,
                8643
            ],
            [
                8651,
                8665
            ],
            [
                8688,
                8692
            ],
            [
                8666,
                8676
            ],
            [
                8727,
                8744
            ],
            [
                8813,
                8828
            ],
            [
                8837,
                8860
            ],
            [
                8862,
                8885
            ],
            [
                8961,
                8963
            ],
            [
                8963,
                8972
            ],
            [
                8984,
                8997
            ],
            [
                9016,
                9043
            ],
            [
                9049,
                9060
            ],
            [
                9082,
                9083
            ],
            [
                9200,
                9230
            ],
            [
                9381,
                9383
            ],
            [
                9383,
                9432
            ],
            [
                9440,
                9442
            ],
            [
                9452,
                9459
            ],
            [
                9485,
                9490
            ],
            [
                9494,
                9506
            ],
            [
                9516,
                9551
            ],
            [
                9590,
                9597
            ],
            [
                9597,
                9599
            ],
            [
                9599,
                9636
            ],
            [
                9693,
                9752
            ],
            [
                9831,
                9855
            ],
            [
                9857,
                9912
            ],
            [
                9690,
                9692
            ],
            [
                9922,
                9924
            ],
            [
                9924,
                9997
            ],
            [
                10001,
                10007
            ],
            [
                10132,
                10139
            ],
            [
                10147,
                10159
            ],
            [
                10170,
                10184
            ],
            [
                10425,
                10488
            ],
            [
                10521,
                10528
            ],
            [
                10537,
                10539
            ],
            [
                10549,
                10557
            ],
            [
                10568,
                10570
            ],
            [
                10574,
                10593
            ],
            [
                10606,
                10607
            ],
            [
                10612,
                10614
            ],
            [
                10627,
                10636
            ],
            [
                10619,
                10623
            ],
            [
                10637,
                10666
            ],
            [
                10666,
                10707
            ],
            [
                10713,
                10744
            ],
            [
                10744,
                10761
            ],
            [
                10830,
                10832
            ],
            [
                10777,
                10782
            ],
            [
                10929,
                10961
            ],
            [
                10963,
                10968
            ],
            [
                11003,
                11015
            ],
            [
                11037,
                11058
            ],
            [
                11058,
                11109
            ],
            [
                11188,
                11191
            ],
            [
                11219,
                11231
            ],
            [
                11206,
                11215
            ],
            [
                11232,
                11238
            ],
            [
                11352,
                11354
            ],
            [
                11859,
                11861
            ],
            [
                11881,
                11918
            ],
            [
                11929,
                11936
            ],
            [
                11876,
                11880
            ],
            [
                11947,
                11964
            ],
            [
                11969,
                11989
            ],
            [
                11989,
                12014
            ],
            [
                12019,
                12030
            ],
            [
                12096,
                12097
            ],
            [
                12235,
                12266
            ],
            [
                12299,
                12300
            ],
            [
                12268,
                12273
            ],
            [
                12305,
                12316
            ],
            [
                12335,
                12359
            ],
            [
                12359,
                12421
            ],
            [
                12432,
                12434
            ],
            [
                12446,
                12455
            ],
            [
                12520,
                12523
            ],
            [
                12588,
                12617
            ],
            [
                12618,
                12631
            ],
            [
                12631,
                12732
            ],
            [
                12848,
                12849
            ],
            [
                12850,
                12853
            ],
            [
                12900,
                12928
            ],
            [
                12928,
                12978
            ],
            [
                12986,
                12987
            ],
            [
                13072,
                13090
            ],
            [
                13096,
                13121
            ],
            [
                13121,
                13150
            ],
            [
                13210,
                13244
            ],
            [
                13256,
                13294
            ],
            [
                13294,
                13304
            ],
            [
                13308,
                13340
            ],
            [
                13353,
                13373
            ],
            [
                13378,
                13382
            ],
            [
                13407,
                13408
            ],
            [
                13744,
                13782
            ],
            [
                13848,
                13901
            ],
            [
                13947,
                13949
            ],
            [
                13949,
                13988
            ],
            [
                13998,
                14002
            ],
            [
                14235,
                14262
            ],
            [
                14066,
                14074
            ],
            [
                14266,
                14294
            ],
            [
                14415,
                14448
            ],
            [
                14448,
                14497
            ],
            [
                14507,
                14529
            ],
            [
                14532,
                14535
            ],
            [
                14541,
                14543
            ],
            [
                14536,
                14540
            ],
            [
                14544,
                14550
            ],
            [
                14529,
                14530
            ],
            [
                14551,
                14642
            ],
            [
                14643,
                14717
            ],
            [
                14840,
                14931
            ],
            [
                15047,
                15058
            ],
            [
                15059,
                15186
            ],
            [
                15195,
                15200
            ],
            [
                15200,
                15202
            ],
            [
                15202,
                15218
            ],
            [
                15230,
                15316
            ],
            [
                15316,
                15349
            ],
            [
                15365,
                15388
            ],
            [
                15390,
                15444
            ],
            [
                15453,
                15494
            ],
            [
                15581,
                15617
            ],
            [
                15631,
                15659
            ],
            [
                15689,
                15690
            ],
            [
                15691,
                15702
            ],
            [
                15748,
                15760
            ],
            [
                15818,
                15821
            ],
            [
                15842,
                15849
            ],
            [
                15659,
                15660
            ],
            [
                15822,
                15825
            ],
            [
                15861,
                15894
            ],
            [
                15971,
                15974
            ],
            [
                15895,
                15915
            ],
            [
                15938,
                15958
            ],
            [
                15732,
                15733
            ],
            [
                16070,
                16154
            ],
            [
                16208,
                16210
            ],
            [
                16210,
                16258
            ],
            [
                16259,
                16375
            ],
            [
                16384,
                16390
            ],
            [
                16423,
                16437
            ],
            [
                16448,
                16468
            ],
            [
                16502,
                16506
            ],
            [
                16526,
                16579
            ],
            [
                16589,
                16599
            ],
            [
                16627,
                16635
            ],
            [
                16616,
                16617
            ],
            [
                16699,
                16736
            ],
            [
                16745,
                16807
            ],
            [
                16886,
                16904
            ],
            [
                16909,
                16919
            ],
            [
                16931,
                16960
            ],
            [
                16962,
                17007
            ],
            [
                17032,
                17041
            ],
            [
                17070,
                17073
            ],
            [
                17081,
                17083
            ],
            [
                17083,
                17123
            ],
            [
                17127,
                17182
            ],
            [
                17387,
                17584
            ],
            [
                17584,
                17609
            ],
            [
                17610,
                17624
            ],
            [
                17624,
                17657
            ],
            [
                17686,
                17701
            ],
            [
                17666,
                17684
            ],
            [
                17702,
                17751
            ],
            [
                17752,
                17760
            ],
            [
                17782,
                17784
            ],
            [
                17784,
                17841
            ],
            [
                17884,
                17885
            ]
        ],
        "row_chars": [
            [
                0,
                49
            ],
            [
                49,
                117
            ],
            [
                117,
                205
            ],
            [
                205,
                236
            ],
            [
                236,
                322
            ],
            [
                322,
                488
            ],
            [
                488,
                626
            ],
            [
                626,
                649
            ],
            [
                649,
                762
            ],
            [
                762,
                913
            ],
            [
                913,
                947
            ],
            [
                947,
                962
            ],
            [
                962,
                1079
            ],
            [
                1079,
                1227
            ],
            [
                1227,
                1273
            ],
            [
                1273,
                1355
            ],
            [
                1355,
                1458
            ],
            [
                1458,
                1570
            ],
            [
                1570,
                1670
            ],
            [
                1670,
                1730
            ],
            [
                1730,
                1900
            ],
            [
                1900,
                1938
            ],
            [
                1938,
                1964
            ],
            [
                1964,
                1981
            ],
            [
                1981,
                2058
            ],
            [
                2058,
                2136
            ],
            [
                2136,
                2305
            ],
            [
                2305,
                2354
            ],
            [
                2354,
                2483
            ],
            [
                2483,
                2629
            ],
            [
                2629,
                2741
            ],
            [
                2741,
                2876
            ],
            [
                2876,
                2969
            ],
            [
                2969,
                3033
            ],
            [
                3033,
                3160
            ],
            [
                3160,
                3295
            ],
            [
                3295,
                3489
            ],
            [
                3489,
                3583
            ],
            [
                3583,
                3704
            ],
            [
                3704,
                3726
            ],
            [
                3726,
                3746
            ],
            [
                3746,
                3802
            ],
            [
                3802,
                3833
            ],
            [
                3833,
                3940
            ],
            [
                3940,
                4051
            ],
            [
                4051,
                4192
            ],
            [
                4192,
                4426
            ],
            [
                4426,
                4490
            ],
            [
                4490,
                4524
            ],
            [
                4524,
                4561
            ],
            [
                4561,
                4686
            ],
            [
                4686,
                4791
            ],
            [
                4791,
                4826
            ],
            [
                4826,
                4876
            ],
            [
                4876,
                5025
            ],
            [
                5025,
                5130
            ],
            [
                5130,
                5272
            ],
            [
                5272,
                5385
            ],
            [
                5385,
                5638
            ],
            [
                5638,
                6134
            ],
            [
                6134,
                6476
            ],
            [
                6476,
                6647
            ],
            [
                6647,
                6681
            ],
            [
                6681,
                6795
            ],
            [
                6795,
                7215
            ],
            [
                7215,
                7506
            ],
            [
                7506,
                7683
            ],
            [
                7683,
                7958
            ],
            [
                7958,
                8141
            ],
            [
                8141,
                8238
            ],
            [
                8238,
                8429
            ],
            [
                8429,
                8585
            ],
            [
                8585,
                8634
            ],
            [
                8634,
                8744
            ],
            [
                8744,
                8813
            ],
            [
                8813,
                8963
            ],
            [
                8963,
                9084
            ],
            [
                9084,
                9185
            ],
            [
                9185,
                9383
            ],
            [
                9383,
                9599
            ],
            [
                9599,
                9924
            ],
            [
                9924,
                10184
            ],
            [
                10184,
                10258
            ],
            [
                10258,
                10383
            ],
            [
                10383,
                10425
            ],
            [
                10425,
                10570
            ],
            [
                10570,
                10666
            ],
            [
                10666,
                10744
            ],
            [
                10744,
                11058
            ],
            [
                11058,
                11354
            ],
            [
                11354,
                11504
            ],
            [
                11504,
                11618
            ],
            [
                11618,
                11855
            ],
            [
                11855,
                11989
            ],
            [
                11989,
                12098
            ],
            [
                12098,
                12235
            ],
            [
                12235,
                12359
            ],
            [
                12359,
                12631
            ],
            [
                12631,
                12850
            ],
            [
                12850,
                12928
            ],
            [
                12928,
                13121
            ],
            [
                13121,
                13294
            ],
            [
                13294,
                13409
            ],
            [
                13409,
                13578
            ],
            [
                13578,
                13744
            ],
            [
                13744,
                13949
            ],
            [
                13949,
                14448
            ],
            [
                14448,
                14643
            ],
            [
                14643,
                14717
            ],
            [
                14717,
                14812
            ],
            [
                14812,
                14931
            ],
            [
                14931,
                15047
            ],
            [
                15047,
                15202
            ],
            [
                15202,
                15316
            ],
            [
                15316,
                15494
            ],
            [
                15494,
                15572
            ],
            [
                15572,
                15617
            ],
            [
                15617,
                16070
            ],
            [
                16070,
                16210
            ],
            [
                16210,
                16259
            ],
            [
                16259,
                16375
            ],
            [
                16375,
                16637
            ],
            [
                16637,
                16699
            ],
            [
                16699,
                16962
            ],
            [
                16962,
                17083
            ],
            [
                17083,
                17182
            ],
            [
                17182,
                17387
            ],
            [
                17387,
                17584
            ],
            [
                17584,
                17624
            ],
            [
                17624,
                17784
            ],
            [
                17784,
                17885
            ]
        ]
    },
    "abridged": {
        "text": "\"I don't think it quite nice, mamma; that's all. Of course if you have made up your mind to go, I must go with you.\"\n\"What on earth can be more natural than going to your cousin's house?\"\n\"You know what I mean, mamma.\"\n\"It's done now, my dear.\"\nThis little conversation arose when Lady Carbury announced her intention of visiting Carbury Manor for the Whitsun week. It was very grievous to Henrietta that she should be taken to the house of a man who was in love with her. But she had no escape. She could not remain in town by herself. Lady Carbury had already posted the following letter to Roger:\nMy dear Roger,\nWe know how kind you are, and if what I am going to propose doesn't suit you, say so at once. I have been working very hard, and feel it would do me good to get into the country for a day or two. Would you take us for a part of Whitsun week? We would come down on the 20th May and stay over the Sunday if you would keep us. Felix says he would run down though he would not trouble you for so long a time as we talk of staying.\nI'm sure you must have been glad to hear of his being made a Director of that Great American Railway Board. It will enable him to prove that he can make himself useful. I think it was a great confidence to place in one so young.\nOf course you will say so at once if my little proposal interferes with your plans, but you have been so very very kind to us that I have no scruple in making it.\nHenrietta joins with me in kind love.\nYour affectionate cousin,\nMatilda Carbury.\nThere was much in this letter that disturbed and even annoyed Roger Carbury. In the first place he felt that Henrietta should not be brought to his house. Much as he loved her, he hardly wished to have her at Carbury unless she came with a resolution to be its future mistress. He thought that Henrietta was being brought to his house with the object of furthering his suit. He had not heard that the great heiress was coming into his neighbourhood, and therefore knew nothing of Lady Carbury's scheme in that direction.\nHe was, too, disgusted by the ill-founded pride which the mother expressed at her son's position as a director. Roger Carbury did not believe in the Railway, or in Fisker, or Melmotte. Paul Montague had acted against his advice in yielding to Fisker's seductions. The whole thing was to his mind fraudulent and ruinous. What sort of company was directed by such men as Lord Alfred Grendall and Sir Felix Carbury? He did not know which to despise most, Sir Felix for belonging to such a Board, or the Board for having such a director. And did not everybody know that Mr. Melmotte was a gigantic swindler?\nThere was another trouble. He had asked Paul Montague to come to Carbury the same week, and Paul had accepted. Roger clung to his old affection for the man. He could not bear the idea of a permanent quarrel, though he knew that there must be a quarrel if Paul interfered with his dearest hopes. He had asked him down to Carbury intending that Henrietta's name should not be mentioned between them; and now it was proposed that Henrietta should be at the Manor House at the very same time! He decided that he must tell Paul not to come.\nHe wrote two letters at once. That to Lady Carbury was very short. He would be delighted to see her and Henrietta, and also Felix. He did not say a word about the Board.\nTo Montague his letter was longer.\n\"It is always best to be open and true,\" he wrote. \"Since you were kind enough to say that you would come to me, Lady Carbury has proposed to visit me just at the same time with her daughter. I need hardly say that I could not make you both welcome here together. It is not pleasant to me to have to ask you to postpone your visit, but I think you will not accuse me of a lack of hospitality towards you.\" Paul wrote back to say that he was sure that there was no lack of hospitality, and that he would remain in town.\nSuffolk is not an especially picturesque county, nor can it be said that the scenery round Carbury was grand or beautiful; but the house and its grounds had a charm of their own. Carbury Manor House was surrounded by a moat, which was rather a trouble to Roger, as it was felt necessary either to keep it clean with moving water, or else to fill it up and abolish it altogether. That plan of abolishing it had been discussed about ten years previously; but it was decided that it would alter the character of the house, and create a waste of mud around it which it would take years to beautify. The squire, therefore, had given up that idea, and instead had made his moat prettier than ever.\nThe high road from Bungay to Beccles ran very close to the house; a short, private road led from it to the old bridge over the moat. Between the bridge and the front door there was a sweep of ground just sufficient for the turning of a carriage. At the back of the house there were large gardens screened from the road by a wall ten feet high, and ancient yews and cypresses. The gardens were partly inside the moat, but chiefly beyond them, and were joined by two bridges - a foot bridge and one with a carriage way.\nThe house itself had been built in the time of Charles II, when Tudor architecture was giving way to a less picturesque, though perhaps more useful form. But Carbury Manor House had the reputation of being a Tudor building. The windows were long, with strong mullions, and small, old-fashioned panes. There was one high bow window in the library, which looked out on to the gravel sweep by the front door. All the other chief rooms faced the garden. The house was built of a buff stone that was very pretty. It was only two storeys high, except at the end where the kitchens were. The rooms were low, and mostly long and narrow, with large fire-places.\nIts owner was very proud of it. The houses of the gentry around him were superior in comfort, but none of them had that thoroughly established look of Carbury Manor. Bundlesham, where the Primeros lived, looked as if it had been built within the last twenty years, and savoured of trade; so at least thought Roger Carbury, though he never said it aloud. Caversham was a very large mansion, built in the early part of George III's reign, and had nothing to recommend it but its size. The Bishop's palace was an excellent gentleman's residence, but modern, with no distinctive features. Carbury Manor House, in its owner's eyes, was pre-eminently beautiful.\nIt often troubled him to think what would become of the place when he was gone. He was at present in excellent health, and the farmers of the neighbourhood still spoke of him as the young squire. When in his happiest moods he could be almost a boy; but a great care had grown within him. If he should not succeed with Henrietta, he felt that no marriage would be possible to him. In that case he must look for an heir.\nNow Sir Felix was the next heir, though Roger could leave his property as he pleased. In one respect the natural succession to it by Sir Felix would be fortunate: the baronetcy and the family property would then go together. No doubt to Sir Felix himself such an arrangement would seem to be the most proper thing in the world.\nBut Roger had very strong objections. It was not only that he thought ill of the baronet, but he thought ill of the baronetcy itself. Sir Patrick, to his thinking, should not have accepted the title, knowing that he would leave no property adequate for its support. A baronet, thought Roger Carbury, should be rich enough to grace his rank.\nWith these old-fashioned notions Roger certainly would not leave his property to support the baronetcy. But Sir Felix was the natural heir, and Roger felt it was his duty to see that his land went from Carbury to Carbury, unimpaired in extent or value. There was no reason why he should himself die for twenty or thirty years - but if he were to die, Sir Felix would undoubtedly dissipate the acres, and then there would be an end of Carbury.\nBut in such case he, Roger Carbury, would at any rate have done his duty. Better that the estate should be dissipated by a Carbury than held together by a stranger. So thinking, he had already made his will, leaving the entire property to the man whom of all others he most despised, should he himself die childless.\nIn the afternoon on which Lady Carbury was expected, he wandered about the place thinking of all this. How infinitely better it would be to have an heir of his own - how wonderfully beautiful would the world be to him if his cousin would consent to be his wife! He thought much of her welfare too. He did not like Lady Carbury, accurately judging her as affectionate but worldly. She believed that good could come out of evil, and that falsehood might sometimes be better than truth. It was lamentable to him that the girl he loved should be subjected to this teaching. Would not the touch of pitch at last defile her?\nIn his heart of hearts he believed that she loved Paul Montague; and of Paul himself he was beginning to fear evil. Only a sham would pretend to sit on a Board of Directors with Lord Alfred Grendall and Sir Felix Carbury, under the control of Melmotte. What a life it would be for Henrietta were she to marry a man striving to become rich without labour - a city adventurer, of all men the vilest and most dishonest! He strove to think well of Paul Montague, but he feared for his future.\nThen he went into the house and wandered through the rooms which the two ladies were to occupy. In the smaller room of the two the hangings were all white, and the room was sweet with May flowers; and he brought a white rose from the hot-house, and placed it in a glass on the dressing table. Surely she would know who had put it there.\nThen he stood at the open window, gazing vacantly down upon the lawn for half an hour, till he heard the wheels of the arriving carriage. During that half hour he resolved that he would try again.",
        "paragraph_chars": [
            [
                0,
                117
            ],
            [
                117,
                188
            ],
            [
                188,
                219
            ],
            [
                219,
                245
            ],
            [
                245,
                600
            ],
            [
                600,
                615
            ],
            [
                615,
                1042
            ],
            [
                1042,
                1271
            ],
            [
                1271,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1498
            ],
            [
                1498,
                1515
            ],
            [
                1515,
                2036
            ],
            [
                2036,
                2640
            ],
            [
                2640,
                3176
            ],
            [
                3176,
                3346
            ],
            [
                3346,
                3381
            ],
            [
                3381,
                3900
            ],
            [
                3900,
                4592
            ],
            [
                4592,
                5110
            ],
            [
                5110,
                5763
            ],
            [
                5763,
                6419
            ],
            [
                6419,
                6838
            ],
            [
                6838,
                7166
            ],
            [
                7166,
                7507
            ],
            [
                7507,
                7950
            ],
            [
                7950,
                8267
            ],
            [
                8267,
                8886
            ],
            [
                8886,
                9375
            ],
            [
                9375,
                9712
            ],
            [
                9712,
                9908
            ]
        ],
        "segment_chars": [
            [
                0,
                49
            ],
            [
                49,
                117
            ],
            [
                117,
                188
            ],
            [
                188,
                219
            ],
            [
                219,
                245
            ],
            [
                245,
                366
            ],
            [
                366,
                473
            ],
            [
                473,
                496
            ],
            [
                496,
                537
            ],
            [
                537,
                600
            ],
            [
                600,
                615
            ],
            [
                615,
                709
            ],
            [
                709,
                811
            ],
            [
                811,
                857
            ],
            [
                857,
                939
            ],
            [
                939,
                1042
            ],
            [
                1042,
                1150
            ],
            [
                1150,
                1211
            ],
            [
                1211,
                1271
            ],
            [
                1271,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1498
            ],
            [
                1498,
                1515
            ],
            [
                1515,
                1592
            ],
            [
                1592,
                1670
            ],
            [
                1670,
                1793
            ],
            [
                1793,
                1890
            ],
            [
                1890,
                2036
            ],
            [
                2036,
                2148
            ],
            [
                2148,
                2221
            ],
            [
                2221,
                2300
            ],
            [
                2300,
                2356
            ],
            [
                2356,
                2449
            ],
            [
                2449,
                2570
            ],
            [
                2570,
                2640
            ],
            [
                2640,
                2667
            ],
            [
                2667,
                2751
            ],
            [
                2751,
                2797
            ],
            [
                2797,
                2935
            ],
            [
                2935,
                3129
            ],
            [
                3129,
                3176
            ],
            [
                3176,
                3206
            ],
            [
                3206,
                3243
            ],
            [
                3243,
                3307
            ],
            [
                3307,
                3346
            ],
            [
                3346,
                3381
            ],
            [
                3381,
                3432
            ],
            [
                3432,
                3573
            ],
            [
                3573,
                3645
            ],
            [
                3645,
                3787
            ],
            [
                3787,
                3900
            ],
            [
                3900,
                4079
            ],
            [
                4079,
                4279
            ],
            [
                4279,
                4495
            ],
            [
                4495,
                4592
            ],
            [
                4592,
                4725
            ],
            [
                4725,
                4838
            ],
            [
                4838,
                4968
            ],
            [
                4968,
                5110
            ],
            [
                5110,
                5264
            ],
            [
                5264,
                5334
            ],
            [
                5334,
                5411
            ],
            [
                5411,
                5516
            ],
            [
                5516,
                5560
            ],
            [
                5560,
                5618
            ],
            [
                5618,
                5691
            ],
            [
                5691,
                5763
            ],
            [
                5763,
                5795
            ],
            [
                5795,
                5929
            ],
            [
                5929,
                6117
            ],
            [
                6117,
                6246
            ],
            [
                6246,
                6348
            ],
            [
                6348,
                6419
            ],
            [
                6419,
                6499
            ],
            [
                6499,
                6615
            ],
            [
                6615,
                6707
            ],
            [
                6707,
                6799
            ],
            [
                6799,
                6838
            ],
            [
                6838,
                6924
            ],
            [
                6924,
                7063
            ],
            [
                7063,
                7166
            ],
            [
                7166,
                7204
            ],
            [
                7204,
                7300
            ],
            [
                7300,
                7432
            ],
            [
                7432,
                7507
            ],
            [
                7507,
                7611
            ],
            [
                7611,
                7760
            ],
            [
                7760,
                7950
            ],
            [
                7950,
                8024
            ],
            [
                8024,
                8115
            ],
            [
                8115,
                8267
            ],
            [
                8267,
                8370
            ],
            [
                8370,
                8529
            ],
            [
                8529,
                8565
            ],
            [
                8565,
                8647
            ],
            [
                8647,
                8751
            ],
            [
                8751,
                8837
            ],
            [
                8837,
                8886
            ],
            [
                8886,
                9002
            ],
            [
                9002,
                9139
            ],
            [
                9139,
                9303
            ],
            [
                9303,
                9375
            ],
            [
                9375,
                9471
            ],
            [
                9471,
                9668
            ],
            [
                9668,
                9712
            ],
            [
                9712,
                9850
            ],
            [
                9850,
                9908
            ]
        ],
        "overlap_chars": [
            [
                0,
                49
            ],
            [
                49,
                117
            ],
            [
                117,
                156
            ],
            [
                163,
                170
            ],
            [
                171,
                188
            ],
            [
                188,
                219
            ],
            [
                219,
                242
            ],
            [
                242,
                245
            ],
            [
                245,
                275
            ],
            [
                281,
                293
            ],
            [
                304,
                320
            ],
            [
                330,
                366
            ],
            [
                366,
                471
            ],
            [
                471,
                473
            ],
            [
                473,
                496
            ],
            [
                496,
                535
            ],
            [
                535,
                537
            ],
            [
                537,
                549
            ],
            [
                550,
                553
            ],
            [
                562,
                592
            ],
            [
                598,
                599
            ],
            [
                600,
                615
            ],
            [
                615,
                639
            ],
            [
                639,
                644
            ],
            [
                645,
                691
            ],
            [
                693,
                709
            ],
            [
                709,
                739
            ],
            [
                740,
                743
            ],
            [
                744,
                748
            ],
            [
                758,
                763
            ],
            [
                764,
                768
            ],
            [
                776,
                811
            ],
            [
                811,
                857
            ],
            [
                857,
                939
            ],
            [
                939,
                1042
            ],
            [
                1042,
                1095
            ],
            [
                1101,
                1111
            ],
            [
                1115,
                1148
            ],
            [
                1148,
                1150
            ],
            [
                1150,
                1152
            ],
            [
                1153,
                1211
            ],
            [
                1211,
                1271
            ],
            [
                1271,
                1342
            ],
            [
                1343,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1498
            ],
            [
                1498,
                1515
            ],
            [
                1515,
                1592
            ],
            [
                1592,
                1670
            ],
            [
                1670,
                1690
            ],
            [
                1690,
                1742
            ],
            [
                1748,
                1793
            ],
            [
                1793,
                1854
            ],
            [
                1859,
                1865
            ],
            [
                1880,
                1888
            ],
            [
                1888,
                1890
            ],
            [
                1890,
                2035
            ],
            [
                2036,
                2148
            ],
            [
                2148,
                2192
            ],
            [
                2192,
                2193
            ],
            [
                2197,
                2207
            ],
            [
                2211,
                2219
            ],
            [
                2219,
                2221
            ],
            [
                2221,
                2244
            ],
            [
                2253,
                2278
            ],
            [
                2279,
                2285
            ],
            [
                2288,
                2298
            ],
            [
                2298,
                2300
            ],
            [
                2300,
                2331
            ],
            [
                2332,
                2342
            ],
            [
                2343,
                2356
            ],
            [
                2356,
                2360
            ],
            [
                2366,
                2368
            ],
            [
                2369,
                2376
            ],
            [
                2381,
                2449
            ],
            [
                2449,
                2570
            ],
            [
                2640,
                2667
            ],
            [
                2667,
                2712
            ],
            [
                2713,
                2716
            ],
            [
                2722,
                2749
            ],
            [
                2749,
                2751
            ],
            [
                2757,
                2797
            ],
            [
                2797,
                2894
            ],
            [
                2900,
                2935
            ],
            [
                2935,
                2982
            ],
            [
                2983,
                2992
            ],
            [
                2992,
                2994
            ],
            [
                2995,
                2999
            ],
            [
                3000,
                3037
            ],
            [
                3038,
                3061
            ],
            [
                3062,
                3076
            ],
            [
                3077,
                3117
            ],
            [
                3123,
                3127
            ],
            [
                3127,
                3129
            ],
            [
                3129,
                3131
            ],
            [
                3140,
                3176
            ],
            [
                3176,
                3184
            ],
            [
                3185,
                3206
            ],
            [
                3206,
                3243
            ],
            [
                3243,
                3289
            ],
            [
                3289,
                3290
            ],
            [
                3291,
                3294
            ],
            [
                3295,
                3299
            ],
            [
                3300,
                3305
            ],
            [
                3305,
                3307
            ],
            [
                3307,
                3344
            ],
            [
                3344,
                3345
            ],
            [
                3346,
                3380
            ],
            [
                3381,
                3424
            ],
            [
                3430,
                3432
            ],
            [
                3432,
                3553
            ],
            [
                3559,
                3573
            ],
            [
                3573,
                3645
            ],
            [
                3645,
                3752
            ],
            [
                3758,
                3787
            ],
            [
                3787,
                3844
            ],
            [
                3850,
                3900
            ],
            [
                3900,
                3914
            ],
            [
                3918,
                3928
            ],
            [
                3929,
                4002
            ],
            [
                4003,
                4026
            ],
            [
                4027,
                4036
            ],
            [
                4037,
                4040
            ],
            [
                4041,
                4044
            ],
            [
                4045,
                4052
            ],
            [
                4057,
                4067
            ],
            [
                4074,
                4079
            ],
            [
                4079,
                4098
            ],
            [
                4114,
                4123
            ],
            [
                4123,
                4124
            ],
            [
                4125,
                4130
            ],
            [
                4135,
                4151
            ],
            [
                4152,
                4164
            ],
            [
                4165,
                4167
            ],
            [
                4172,
                4215
            ],
            [
                4216,
                4228
            ],
            [
                4228,
                4279
            ],
            [
                4279,
                4309
            ],
            [
                4315,
                4340
            ],
            [
                4351,
                4356
            ],
            [
                4357,
                4376
            ],
            [
                4380,
                4385
            ],
            [
                4386,
                4419
            ],
            [
                4420,
                4423
            ],
            [
                4424,
                4445
            ],
            [
                4456,
                4493
            ],
            [
                4493,
                4495
            ],
            [
                4495,
                4553
            ],
            [
                4554,
                4562
            ],
            [
                4563,
                4571
            ],
            [
                4572,
                4591
            ],
            [
                4592,
                4632
            ],
            [
                4633,
                4637
            ],
            [
                4638,
                4656
            ],
            [
                4658,
                4679
            ],
            [
                4680,
                4683
            ],
            [
                4684,
                4691
            ],
            [
                4692,
                4698
            ],
            [
                4699,
                4702
            ],
            [
                4703,
                4709
            ],
            [
                4715,
                4724
            ],
            [
                4725,
                4836
            ],
            [
                4836,
                4838
            ],
            [
                4838,
                4935
            ],
            [
                4948,
                4949
            ],
            [
                4953,
                4966
            ],
            [
                4966,
                4968
            ],
            [
                4968,
                5064
            ],
            [
                5067,
                5108
            ],
            [
                5108,
                5110
            ],
            [
                5110,
                5167
            ],
            [
                5167,
                5168
            ],
            [
                5169,
                5173
            ],
            [
                5174,
                5212
            ],
            [
                5213,
                5264
            ],
            [
                5264,
                5287
            ],
            [
                5288,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5357,
                5382
            ],
            [
                5383,
                5409
            ],
            [
                5409,
                5411
            ],
            [
                5411,
                5440
            ],
            [
                5444,
                5456
            ],
            [
                5457,
                5496
            ],
            [
                5500,
                5514
            ],
            [
                5514,
                5516
            ],
            [
                5516,
                5547
            ],
            [
                5548,
                5560
            ],
            [
                5560,
                5569
            ],
            [
                5570,
                5584
            ],
            [
                5585,
                5589
            ],
            [
                5590,
                5600
            ],
            [
                5601,
                5618
            ],
            [
                5618,
                5633
            ],
            [
                5642,
                5665
            ],
            [
                5666,
                5689
            ],
            [
                5689,
                5691
            ],
            [
                5691,
                5700
            ],
            [
                5701,
                5714
            ],
            [
                5722,
                5749
            ],
            [
                5750,
                5761
            ],
            [
                5761,
                5762
            ],
            [
                5763,
                5793
            ],
            [
                5793,
                5795
            ],
            [
                5795,
                5844
            ],
            [
                5845,
                5847
            ],
            [
                5848,
                5855
            ],
            [
                5855,
                5860
            ],
            [
                5861,
                5873
            ],
            [
                5878,
                5913
            ],
            [
                5914,
                5921
            ],
            [
                5927,
                5929
            ],
            [
                5929,
                5966
            ],
            [
                5967,
                6026
            ],
            [
                6026,
                6050
            ],
            [
                6051,
                6106
            ],
            [
                6107,
                6109
            ],
            [
                6115,
                6117
            ],
            [
                6117,
                6190
            ],
            [
                6193,
                6199
            ],
            [
                6208,
                6215
            ],
            [
                6216,
                6228
            ],
            [
                6232,
                6246
            ],
            [
                6246,
                6309
            ],
            [
                6310,
                6317
            ],
            [
                6323,
                6325
            ],
            [
                6338,
                6346
            ],
            [
                6346,
                6348
            ],
            [
                6348,
                6367
            ],
            [
                6367,
                6368
            ],
            [
                6369,
                6371
            ],
            [
                6372,
                6381
            ],
            [
                6384,
                6388
            ],
            [
                6390,
                6419
            ],
            [
                6419,
                6460
            ],
            [
                6468,
                6499
            ],
            [
                6499,
                6516
            ],
            [
                6517,
                6519
            ],
            [
                6536,
                6541
            ],
            [
                6542,
                6574
            ],
            [
                6575,
                6580
            ],
            [
                6581,
                6593
            ],
            [
                6594,
                6615
            ],
            [
                6615,
                6666
            ],
            [
                6668,
                6671
            ],
            [
                6672,
                6684
            ],
            [
                6685,
                6694
            ],
            [
                6695,
                6701
            ],
            [
                6705,
                6707
            ],
            [
                6707,
                6709
            ],
            [
                6710,
                6747
            ],
            [
                6748,
                6755
            ],
            [
                6756,
                6760
            ],
            [
                6761,
                6778
            ],
            [
                6779,
                6799
            ],
            [
                6799,
                6824
            ],
            [
                6825,
                6836
            ],
            [
                6836,
                6837
            ],
            [
                6838,
                6869
            ],
            [
                6869,
                6870
            ],
            [
                6878,
                6883
            ],
            [
                6884,
                6895
            ],
            [
                6900,
                6924
            ],
            [
                6924,
                6986
            ],
            [
                6987,
                6989
            ],
            [
                6990,
                6999
            ],
            [
                7001,
                7004
            ],
            [
                7015,
                7044
            ],
            [
                7050,
                7063
            ],
            [
                7063,
                7164
            ],
            [
                7164,
                7165
            ],
            [
                7166,
                7169
            ],
            [
                7176,
                7204
            ],
            [
                7204,
                7254
            ],
            [
                7254,
                7255
            ],
            [
                7256,
                7274
            ],
            [
                7275,
                7300
            ],
            [
                7300,
                7329
            ],
            [
                7359,
                7393
            ],
            [
                7394,
                7432
            ],
            [
                7432,
                7442
            ],
            [
                7443,
                7475
            ],
            [
                7476,
                7496
            ],
            [
                7501,
                7505
            ],
            [
                7505,
                7506
            ],
            [
                7507,
                7545
            ],
            [
                7546,
                7599
            ],
            [
                7609,
                7611
            ],
            [
                7611,
                7650
            ],
            [
                7657,
                7661
            ],
            [
                7662,
                7689
            ],
            [
                7690,
                7698
            ],
            [
                7699,
                7727
            ],
            [
                7727,
                7760
            ],
            [
                7760,
                7809
            ],
            [
                7810,
                7832
            ],
            [
                7835,
                7838
            ],
            [
                7842,
                7844
            ],
            [
                7845,
                7849
            ],
            [
                7850,
                7856
            ],
            [
                7856,
                7857
            ],
            [
                7858,
                7949
            ],
            [
                7950,
                8024
            ],
            [
                8024,
                8115
            ],
            [
                8115,
                8126
            ],
            [
                8128,
                8255
            ],
            [
                8256,
                8261
            ],
            [
                8265,
                8267
            ],
            [
                8267,
                8283
            ],
            [
                8284,
                8370
            ],
            [
                8370,
                8403
            ],
            [
                8407,
                8430
            ],
            [
                8433,
                8487
            ],
            [
                8488,
                8529
            ],
            [
                8529,
                8565
            ],
            [
                8565,
                8593
            ],
            [
                8593,
                8594
            ],
            [
                8606,
                8617
            ],
            [
                8621,
                8633
            ],
            [
                8634,
                8637
            ],
            [
                8638,
                8645
            ],
            [
                8645,
                8646
            ],
            [
                8647,
                8650
            ],
            [
                8660,
                8693
            ],
            [
                8694,
                8697
            ],
            [
                8698,
                8718
            ],
            [
                8729,
                8749
            ],
            [
                8749,
                8750
            ],
            [
                8751,
                8835
            ],
            [
                8835,
                8837
            ],
            [
                8837,
                8885
            ],
            [
                8886,
                9002
            ],
            [
                9007,
                9013
            ],
            [
                9020,
                9034
            ],
            [
                9038,
                9058
            ],
            [
                9059,
                9063
            ],
            [
                9064,
                9117
            ],
            [
                9118,
                9128
            ],
            [
                9129,
                9137
            ],
            [
                9137,
                9138
            ],
            [
                9139,
                9176
            ],
            [
                9177,
                9239
            ],
            [
                9242,
                9260
            ],
            [
                9261,
                9271
            ],
            [
                9272,
                9301
            ],
            [
                9303,
                9348
            ],
            [
                9349,
                9358
            ],
            [
                9359,
                9362
            ],
            [
                9373,
                9375
            ],
            [
                9375,
                9415
            ],
            [
                9416,
                9471
            ],
            [
                9471,
                9668
            ],
            [
                9668,
                9693
            ],
            [
                9698,
                9712
            ],
            [
                9712,
                9745
            ],
            [
                9746,
                9761
            ],
            [
                9762,
                9780
            ],
            [
                9781,
                9830
            ],
            [
                9840,
                9848
            ],
            [
                9848,
                9850
            ],
            [
                9850,
                9907
            ],
            [
                9907,
                9908
            ]
        ],
        "row_chars": [
            [
                0,
                49
            ],
            [
                49,
                117
            ],
            [
                117,
                188
            ],
            [
                188,
                219
            ],
            [
                219,
                245
            ],
            [
                245,
                366
            ],
            [
                366,
                473
            ],
            [
                473,
                496
            ],
            [
                496,
                537
            ],
            [
                537,
                600
            ],
            [
                600,
                600
            ],
            [
                600,
                615
            ],
            [
                615,
                709
            ],
            [
                709,
                811
            ],
            [
                811,
                857
            ],
            [
                857,
                939
            ],
            [
                939,
                1042
            ],
            [
                1042,
                1150
            ],
            [
                1150,
                1211
            ],
            [
                1211,
                1271
            ],
            [
                1271,
                1434
            ],
            [
                1434,
                1472
            ],
            [
                1472,
                1498
            ],
            [
                1498,
                1515
            ],
            [
                1515,
                1592
            ],
            [
                1592,
                1670
            ],
            [
                1670,
                1793
            ],
            [
                1793,
                1793
            ],
            [
                1793,
                1890
            ],
            [
                1890,
                2036
            ],
            [
                2036,
                2148
            ],
            [
                2148,
                2221
            ],
            [
                2221,
                2300
            ],
            [
                2300,
                2356
            ],
            [
                2356,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2570
            ],
            [
                2570,
                2640
            ],
            [
                2640,
                2640
            ],
            [
                2640,
                2640
            ],
            [
                2640,
                2667
            ],
            [
                2667,
                2751
            ],
            [
                2751,
                2797
            ],
            [
                2797,
                2935
            ],
            [
                2935,
                3129
            ],
            [
                3129,
                3176
            ],
            [
                3176,
                3206
            ],
            [
                3206,
                3243
            ],
            [
                3243,
                3307
            ],
            [
                3307,
                3346
            ],
            [
                3346,
                3381
            ],
            [
                3381,
                3432
            ],
            [
                3432,
                3573
            ],
            [
                3573,
                3645
            ],
            [
                3645,
                3787
            ],
            [
                3787,
                3900
            ],
            [
                3900,
                4079
            ],
            [
                4079,
                4279
            ],
            [
                4279,
                4495
            ],
            [
                4495,
                4495
            ],
            [
                4495,
                4495
            ],
            [
                4495,
                4592
            ],
            [
                4592,
                4725
            ],
            [
                4725,
                4838
            ],
            [
                4838,
                4968
            ],
            [
                4968,
                5110
            ],
            [
                5110,
                5264
            ],
            [
                5264,
                5334
            ],
            [
                5334,
                5411
            ],
            [
                5411,
                5516
            ],
            [
                5516,
                5560
            ],
            [
                5560,
                5618
            ],
            [
                5618,
                5618
            ],
            [
                5618,
                5691
            ],
            [
                5691,
                5763
            ],
            [
                5763,
                5763
            ],
            [
                5763,
                5795
            ],
            [
                5795,
                5929
            ],
            [
                5929,
                6117
            ],
            [
                6117,
                6246
            ],
            [
                6246,
                6246
            ],
            [
                6246,
                6246
            ],
            [
                6246,
                6246
            ],
            [
                6246,
                6348
            ],
            [
                6348,
                6419
            ],
            [
                6419,
                6499
            ],
            [
                6499,
                6615
            ],
            [
                6615,
                6707
            ],
            [
                6707,
                6707
            ],
            [
                6707,
                6707
            ],
            [
                6707,
                6707
            ],
            [
                6707,
                6799
            ],
            [
                6799,
                6838
            ],
            [
                6838,
                6838
            ],
            [
                6838,
                6924
            ],
            [
                6924,
                7063
            ],
            [
                7063,
                7166
            ],
            [
                7166,
                7204
            ],
            [
                7204,
                7300
            ],
            [
                7300,
                7432
            ],
            [
                7432,
                7507
            ],
            [
                7507,
                7507
            ],
            [
                7507,
                7507
            ],
            [
                7507,
                7611
            ],
            [
                7611,
                7760
            ],
            [
                7760,
                7950
            ],
            [
                7950,
                8024
            ],
            [
                8024,
                8024
            ],
            [
                8024,
                8115
            ],
            [
                8115,
                8115
            ],
            [
                8115,
                8267
            ],
            [
                8267,
                8370
            ],
            [
                8370,
                8529
            ],
            [
                8529,
                8529
            ],
            [
                8529,
                8565
            ],
            [
                8565,
                8751
            ],
            [
                8751,
                8837
            ],
            [
                8837,
                8886
            ],
            [
                8886,
                9002
            ],
            [
                9002,
                9139
            ],
            [
                9139,
                9139
            ],
            [
                9139,
                9303
            ],
            [
                9303,
                9375
            ],
            [
                9375,
                9471
            ],
            [
                9471,
                9471
            ],
            [
                9471,
                9668
            ],
            [
                9668,
                9712
            ],
            [
                9712,
                9850
            ],
            [
                9850,
                9908
            ]
        ]
    }
}