{
    "original": {
        "text": "\"This is so kind of you,\" said Lady Carbury, grasping her cousin's hand as she got out of the carriage.\n\"The kindness is on your part,\" said Roger.\n\"I felt so much before I dared to ask you to take us. But I did so long to get into the country, and I do so love Carbury. And--and--\"\n\"Where should a Carbury go to escape from London smoke, but to the old house? I am afraid Henrietta will find it dull.\"\n\"Oh no,\" said Hetta smiling. \"You ought to remember that I am never dull in the country.\"\n\"The bishop and Mrs. Yeld are coming here to dine to-morrow,--and the Hepworths.\"\n\"I shall be so glad to meet the bishop once more,\" said Lady Carbury.\n\"I think everybody must be glad to meet him, he is such a dear, good fellow, and his wife is just as good. And there is another gentleman coming whom you have never seen.\"\n\"A new neighbour?\"\n\"Yes,--a new neighbour;--Father John Barham, who has come to Beccles as priest. He has got a little cottage about a mile from here, in this parish, and does duty both at Beccles and Bungay. I used to know something of his family.\"\n\"He is a gentleman then?\"\n\"Certainly he is a gentleman. He took his degree at Oxford, and then became what we call a pervert, and what I suppose they call a convert. He has not got a shilling in the world beyond what they pay him as a priest, which I take it amounts to about as much as the wages of a day labourer. He told me the other day that he was absolutely forced to buy second-hand clothes.\"\n\"How shocking!\" said Lady Carbury, holding up her hands.\n\"He didn't seem to be at all shocked at telling it. We have got to be quite friends.\"\n\"Will the bishop like to meet him?\"\n\"Why should not the bishop like to meet him? I've told the bishop all about him, and the bishop particularly wishes to know him. He won't hurt the bishop. But you and Hetta will find it very dull.\"\n\"I shan't find it dull, Mr. Carbury,\" said Henrietta.\n\"It was to escape from the eternal parties that we came down here,\" said Lady Carbury. She had nevertheless been anxious to hear what guests were expected at the Manor House. Sir Felix had promised to come down on Saturday, with the intention of returning on Monday, and Lady Carbury had hoped that some visiting might be arranged between Caversham and the Manor House, so that her son might have the full advantage of his closeness to Marie Melmotte.\n\"I have asked the Longestaffes for Monday,\" said Roger.\n\"They are down here then?\"\n\"I think they arrived yesterday. There is always a flustering breeze in the air and a perturbation generally through the county when they come or go, and I think I perceived the effects about four in the afternoon. They won't come, I dare say.\"\n\"Why not?\"\n\"They never do. They have probably a house full of guests, and they know that my accommodation is limited. I've no doubt they'll ask us on Tuesday or Wednesday, and if you like we will go.\"\n\"I know they are to have guests,\" said Lady Carbury.\n\"What guests?\"\n\"The Melmottes are coming to them.\" Lady Carbury, as she made the announcement, felt that her voice and countenance and self-possession were failing her, and that she could not mention the thing as she would any matter that was indifferent to her.\n\"The Melmottes coming to Caversham!\" said Roger, looking at Henrietta, who blushed with shame as she remembered that she had been brought into her lover's house solely in order that her brother might have an opportunity of seeing Marie Melmotte in the country.\n\"Oh yes,--Madame Melmotte told me. I take it they are very intimate.\"\n\"Mr. Longestaffe ask the Melmottes to visit him at Caversham!\"\n\"Why not?\"\n\"I should almost as soon have believed that I myself might have been induced to ask them here.\"\n\"I fancy, Roger, that Mr. Longestaffe does want a little pecuniary assistance.\"\n\"And he condescends to get it in this way! I suppose it will make no difference soon whom one knows, and whom one doesn't. Things aren't as they were, of course, and never will be again. Perhaps it's all for the better;--I won't say it isn't. But I should have thought that such a man as Mr. Longestaffe might have kept such another man as Mr. Melmotte out of his wife's drawing-room.\" Henrietta became redder than ever. Even Lady Carbury flushed up, as she remembered that Roger Carbury knew that she had taken her daughter to Madame Melmotte's ball. He thought of this himself as soon as the words were spoken, and then tried to make some half apology. \"I don't approve of them in London, you know; but I think they are very much worse in the country.\"\nThen there was a movement. The ladies were shown into their rooms, and Roger again went out into the garden. He began to feel that he understood it all. Lady Carbury had come down to his house in order that she might be near the Melmottes! There was something in this which he felt it difficult not to resent. It was for no love of him that she was there. He had felt that Henrietta ought not to have been brought to his house; but he could have forgiven that, because her presence there was a charm to him. He could have forgiven that, even while he was thinking that her mother had brought her there with the object of disposing of her. If it were so, the mother's object would be the same as his own, and such a manoeuvre he could pardon, though he could not approve. His self-love had to some extent been gratified. But now he saw that he and his house had been simply used in order that a vile project of marrying two vile people to each other might be furthered!\nAs he was thinking of all this, Lady Carbury came out to him in the garden. She had changed her travelling dress, and made herself pretty, as she well knew how to do. And now she dressed her face in her sweetest smiles. Her mind, also, was full of the Melmottes, and she wished to explain to her stern, unbending cousin all the good that might come to her and hers by an alliance with the heiress. \"I can understand, Roger,\" she said, taking his arm, \"that you should not like those people.\"\n\"What people?\"\n\"The Melmottes.\"\n\"I don't dislike them. How should I dislike people that I never saw? I dislike those who seek their society simply because they have the reputation of being rich.\"\n\"Meaning me.\"\n\"No; not meaning you. I don't dislike you, as you know very well, though I do dislike the fact that you should run after these people. I was thinking of the Longestaffes then.\"\n\"Do you suppose, my friend, that I run after them for my own gratification? Do you think that I go to their house because I find pleasure in their magnificence; or that I follow them down here for any good that they will do me?\"\n\"I would not follow them at all.\"\n\"I will go back if you bid me, but I must first explain what I mean. You know my son's condition,--better, I fear, than he does himself.\" Roger nodded assent to this, but said nothing. \"What is he to do? The only chance for a young man in his position is that he should marry a girl with money. He is good-looking; you can't deny that.\"\n\"Nature has done enough for him.\"\n\"We must take him as he is. He was put into the army very young, and was very young when he came into possession of his own small fortune. He might have done better; but how many young men placed in such temptations do well? As it is, he has nothing left.\"\n\"I fear not.\"\n\"And therefore is it not imperative that he should marry a girl with money?\"\n\"I call that stealing a girl's money, Lady Carbury.\"\n\"Oh, Roger, how hard you are!\"\n\"A man must be hard or soft,--which is best?\"\n\"With women I think that a little softness has the most effect. I want to make you understand this about the Melmottes. It stands to reason that the girl will not marry Felix unless she loves him.\"\n\"But does he love her?\"\n\"Why should he not? Is a girl to be debarred from being loved because she has money? Of course she looks to be married, and why should she not have Felix if she likes him best? Cannot you sympathize with my anxiety so to place him that he shall not be a disgrace to the name and to the family?\"\n\"We had better not talk about the family, Lady Carbury.\"\n\"But I think so much about it.\"\n\"You will never get me to say that I think the family will be benefited by a marriage with the daughter of Mr. Melmotte. I look upon him as dirt in the gutter. To me, in my old-fashioned way, all his money, if he has it, can make no difference. When there is a question of marriage people at any rate should know something of each other. Who knows anything of this man? Who can be sure that she is his daughter?\"\n\"He would give her her fortune when she married.\"\n\"Yes; it all comes to that. Men say openly that he is an adventurer and a swindler. No one pretends to think that he is a gentleman. There is a consciousness among all who speak of him that he amasses his money not by honest trade, but by unknown tricks,--as does a card sharper. He is one whom we would not admit into our kitchens, much less to our tables, on the score of his own merits. But because he has learned the art of making money, we not only put up with him, but settle upon his carcase as so many birds of prey.\"\n\"Do you mean that Felix should not marry the girl, even if they love each other?\"\nHe shook his head in disgust, feeling sure that any idea of love on the part of the young man was a sham and a pretence, not only as regarded him, but also his mother. He could not quite declare this, and yet he desired that she should understand that he thought so. \"I have nothing more to say about it,\" he continued. \"Had it gone on in London I should have said nothing. It is no affair of mine. When I am told that the girl is in the neighbourhood, at such a house as Caversham, and that Felix is coming here in order that he may be near to his prey, and when I am asked to be a party to the thing, I can only say what I think. Your son would be welcome to my house, because he is your son and my cousin, little as I approve his mode of life; but I could have wished that he had chosen some other place for the work that he has on hand.\"\n\"If you wish it, Roger, we will return to London. I shall find it hard to explain to Hetta;--but we will go.\"\n\"No; I certainly do not wish that.\"\n\"But you have said such hard things! How are we to stay? You speak of Felix as though he were all bad.\" She looked at him hoping to get from him some contradiction of this, some retractation, some kindly word; but it was what he did think, and he had nothing to say. She could bear much. She was not delicate as to censure implied, or even expressed. She had endured rough usage before, and was prepared to endure more. Had he found fault with herself, or with Henrietta, she would have put up with it, for the sake of benefits to come,--would have forgiven it the more easily because perhaps it might not have been deserved. But for her son she was prepared to fight. If she did not defend him, who would? \"I am grieved, Roger, that we should have troubled you with our visit, but I think that we had better go. You are very harsh, and it crushes me.\"\n\"I have not meant to be harsh.\"\n\"You say that Felix is seeking for his--prey, and that he is to be brought here to be near--his prey. What can be more harsh than that? At any rate, you should remember that I am his mother.\"\n[Illustration: \"You should remember that I am his mother.\"]\nShe expressed her sense of injury very well. Roger began to be ashamed of himself, and to think that he had spoken unkind words. And yet he did not know how to recall them. \"If I have hurt you, I regret it much.\"\n\"Of course you have hurt me. I think I will go in now. How very hard the world is! I came here thinking to find peace and sunshine, and there has come a storm at once.\"\n\"You asked me about the Melmottes, and I was obliged to speak. You cannot think that I meant to offend you.\" They walked on in silence till they had reached the door leading from the garden into the house, and here he stopped her. \"If I have been over hot with you, let me beg your pardon.\" She smiled and bowed; but her smile was not one of forgiveness; and then she essayed to pass on into the house. \"Pray do not speak of going, Lady Carbury.\"\n\"I think I will go to my room now. My head aches so that I can hardly stand.\"\nIt was late in the afternoon,--about six,--and according to his daily custom he should have gone round to the offices to see his men as they came from their work, but he stood still for a few moments on the spot where Lady Carbury had left him and went slowly across the lawn to the bridge and there seated himself on the parapet. Could it really be that she meant to leave his house in anger and to take her daughter with her? Was it thus that he was to part with the one human being in the world that he loved? He was a man who thought much of the duties of hospitality, feeling that a man in his own house was bound to exercise a courtesy towards his guests sweeter, softer, more gracious than the world required elsewhere. And of all guests those of his own name were the best entitled to such courtesy at Carbury. He held the place in trust for the use of others. But if there were one among all others to whom the house should be a house of refuge from care, not an abode of trouble, on whose behalf were it possible he would make the very air softer, and the flowers sweeter than their wont, to whom he would declare, were such words possible to his tongue, that of him and of his house, and of all things there she was the mistress, whether she would condescend to love him or no,--that one was his cousin Hetta. And now he had been told by his guest that he had been so rough to her that she and her daughter must return to London!\nAnd he could not acquit himself. He knew that he had been rough. He had said very hard words. It was true that he could not have expressed his meaning without hard words, nor have repressed his meaning without self-reproach. But in his present mood he could not comfort himself by justifying himself. She had told him that he ought to have remembered that Felix was her son; and as she spoke she had acted well the part of an outraged mother. His heart was so soft that though he knew the woman to be false and the son to be worthless, he utterly condemned himself. Look where he would there was no comfort. When he had sat half-an-hour upon the bridge he turned towards the house to dress for dinner,--and to prepare himself for an apology, if any apology might be accepted. At the door, standing in the doorway as though waiting for him, he met his cousin Hetta. She had on her bosom the rose he had placed in her room, and as he approached her he thought that there was more in her eyes of graciousness towards him than he had ever seen there before.\n\"Mr. Carbury,\" she said, \"mamma is so unhappy!\"\n\"I fear that I have offended her.\"\n\"It is not that, but that you should be so,--so angry about Felix.\"\n\"I am vexed with myself that I have vexed her,--more vexed than I can tell you.\"\n\"She knows how good you are.\"\n\"No, I'm not. I was very bad just now. She was so offended with me that she talked of going back to London.\" He paused for her to speak, but Hetta had no words ready for the moment. \"I should be wretched indeed if you and she were to leave my house in anger.\"\n\"I do not think she will do that.\"\n\"And you?\"\n\"I am not angry. I should never dare to be angry with you. I only wish that Felix would be better. They say that young men have to be bad, and that they do get to be better as they grow older. He is something in the city now, a director they call him, and mamma thinks that the work will be of service to him.\" Roger could express no hope in this direction or even look as though he approved of the directorship. \"I don't see why he should not try at any rate.\"\n\"Dear Hetta, I only wish he were like you.\"\n\"Girls are so different, you know.\"\nIt was not till late in the evening, long after dinner, that he made his apology in form to Lady Carbury; but he did make it, and at last it was accepted. \"I think I was rough to you, talking about Felix,\" he said,--\"and I beg your pardon.\"\n\"You were energetic, that was all.\"\n\"A gentleman should never be rough to a lady, and a man should never be rough to his own guests. I hope you will forgive me.\" She answered him by putting out her hand and smiling on him; and so the quarrel was over.\nLady Carbury understood the full extent of her triumph, and was enabled by her disposition to use it thoroughly. Felix might now come down to Carbury, and go over from thence to Caversham, and prosecute his wooing, and the master of Carbury could make no further objection. And Felix, if he would come, would not now be snubbed. Roger would understand that he was constrained to courtesy by the former severity of his language. Such points as these Lady Carbury never missed. He understood it too, and though he was soft and gracious in his bearing, endeavouring to make his house as pleasant as he could to his two guests, he felt that he had been cheated out of his undoubted right to disapprove of all connection with the Melmottes. In the course of the evening there came a note,--or rather a bundle of notes,--from Caversham. That addressed to Roger was in the form of a letter. Lady Pomona was sorry to say that the Longestaffe party were prevented from having the pleasure of dining at Carbury Hall by the fact that they had a house full of guests. Lady Pomona hoped that Mr. Carbury and his relatives, who, Lady Pomona heard, were with him at the Hall, would do the Longestaffes the pleasure of dining at Caversham either on the Monday or Tuesday following, as might best suit the Carbury plans. That was the purport of Lady Pomona's letter to Roger Carbury. Then there were cards of invitation for Lady Carbury and her daughter, and also for Sir Felix.\nRoger, as he read his own note, handed the others over to Lady Carbury, and then asked her what she would wish to have done. The tone of his voice, as he spoke, grated on her ear, as there was something in it of his former harshness. But she knew how to use her triumph. \"I should like to go,\" she said.\n\"I certainly shall not go,\" he replied; \"but there will be no difficulty whatever in sending you over. You must answer at once, because their servant is waiting.\"\n\"Monday will be best,\" she said; \"--that is, if nobody is coming here.\"\n\"There will be nobody here.\"\n\"I suppose I had better say that I, and Hetta,--and Felix will accept their invitation.\"\n\"I can make no suggestion,\" said Roger, thinking how delightful it would be if Henrietta could remain with him; how objectionable it was that Henrietta should be taken to Caversham to meet the Melmottes. Poor Hetta herself could say nothing. She certainly did not wish to meet the Melmottes, nor did she wish to dine, alone, with her cousin Roger.\n\"That will be best,\" said Lady Carbury after a moment's thought. \"It is very good of you to let us go, and to send us.\"\n\"Of course you will do here just as you please,\" he replied. But there was still that tone in his voice which Lady Carbury feared. A quarter of an hour later the Caversham servant was on his way home with two letters,--the one from Roger expressing his regret that he could not accept Lady Pomona's invitation, and the other from Lady Carbury declaring that she and her son and daughter would have great pleasure in dining at Caversham on the Monday.",
        "paragraph_chars": [
            [
                0,
                104
            ],
            [
                104,
                148
            ],
            [
                148,
                283
            ],
            [
                283,
                403
            ],
            [
                403,
                493
            ],
            [
                493,
                575
            ],
            [
                575,
                645
            ],
            [
                645,
                817
            ],
            [
                817,
                836
            ],
            [
                836,
                1067
            ],
            [
                1067,
                1093
            ],
            [
                1093,
                1467
            ],
            [
                1467,
                1524
            ],
            [
                1524,
                1610
            ],
            [
                1610,
                1646
            ],
            [
                1646,
                1844
            ],
            [
                1844,
                1898
            ],
            [
                1898,
                2350
            ],
            [
                2350,
                2406
            ],
            [
                2406,
                2433
            ],
            [
                2433,
                2678
            ],
            [
                2678,
                2689
            ],
            [
                2689,
                2879
            ],
            [
                2879,
                2932
            ],
            [
                2932,
                2947
            ],
            [
                2947,
                3195
            ],
            [
                3195,
                3456
            ],
            [
                3456,
                3526
            ],
            [
                3526,
                3589
            ],
            [
                3589,
                3600
            ],
            [
                3600,
                3696
            ],
            [
                3696,
                3776
            ],
            [
                3776,
                4531
            ],
            [
                4531,
                5500
            ],
            [
                5500,
                5992
            ],
            [
                5992,
                6007
            ],
            [
                6007,
                6024
            ],
            [
                6024,
                6188
            ],
            [
                6188,
                6202
            ],
            [
                6202,
                6379
            ],
            [
                6379,
                6608
            ],
            [
                6608,
                6642
            ],
            [
                6642,
                6979
            ],
            [
                6979,
                7013
            ],
            [
                7013,
                7270
            ],
            [
                7270,
                7284
            ],
            [
                7284,
                7361
            ],
            [
                7361,
                7414
            ],
            [
                7414,
                7445
            ],
            [
                7445,
                7491
            ],
            [
                7491,
                7689
            ],
            [
                7689,
                7713
            ],
            [
                7713,
                8008
            ],
            [
                8008,
                8065
            ],
            [
                8065,
                8097
            ],
            [
                8097,
                8510
            ],
            [
                8510,
                8560
            ],
            [
                8560,
                9086
            ],
            [
                9086,
                9168
            ],
            [
                9168,
                10010
            ],
            [
                10010,
                10120
            ],
            [
                10120,
                10156
            ],
            [
                10156,
                11009
            ],
            [
                11009,
                11041
            ],
            [
                11041,
                11233
            ],
            [
                11233,
                11293
            ],
            [
                11293,
                11506
            ],
            [
                11506,
                11675
            ],
            [
                11675,
                12122
            ],
            [
                12122,
                12200
            ],
            [
                12200,
                13641
            ],
            [
                13641,
                14695
            ],
            [
                14695,
                14743
            ],
            [
                14743,
                14778
            ],
            [
                14778,
                14846
            ],
            [
                14846,
                14927
            ],
            [
                14927,
                14957
            ],
            [
                14957,
                15217
            ],
            [
                15217,
                15252
            ],
            [
                15252,
                15263
            ],
            [
                15263,
                15725
            ],
            [
                15725,
                15769
            ],
            [
                15769,
                15805
            ],
            [
                15805,
                16046
            ],
            [
                16046,
                16082
            ],
            [
                16082,
                16298
            ],
            [
                16298,
                17760
            ],
            [
                17760,
                18064
            ],
            [
                18064,
                18227
            ],
            [
                18227,
                18299
            ],
            [
                18299,
                18328
            ],
            [
                18328,
                18417
            ],
            [
                18417,
                18765
            ],
            [
                18765,
                18885
            ],
            [
                18885,
                19335
            ]
        ],
        "segment_chars": [
            [
                0,
                104
            ],
            [
                104,
                148
            ],
            [
                148,
                202
            ],
            [
                202,
                271
            ],
            [
                271,
                283
            ],
            [
                283,
                361
            ],
            [
                361,
                403
            ],
            [
                403,
                432
            ],
            [
                432,
                493
            ],
            [
                493,
                575
            ],
            [
                575,
                645
            ],
            [
                645,
                752
            ],
            [
                752,
                817
            ],
            [
                817,
                836
            ],
            [
                836,
                916
            ],
            [
                916,
                1026
            ],
            [
                1026,
                1067
            ],
            [
                1067,
                1093
            ],
            [
                1093,
                1123
            ],
            [
                1123,
                1233
            ],
            [
                1233,
                1383
            ],
            [
                1383,
                1467
            ],
            [
                1467,
                1483
            ],
            [
                1483,
                1524
            ],
            [
                1524,
                1576
            ],
            [
                1576,
                1610
            ],
            [
                1610,
                1646
            ],
            [
                1646,
                1691
            ],
            [
                1691,
                1775
            ],
            [
                1775,
                1801
            ],
            [
                1801,
                1844
            ],
            [
                1844,
                1898
            ],
            [
                1898,
                1985
            ],
            [
                1985,
                2073
            ],
            [
                2073,
                2350
            ],
            [
                2350,
                2406
            ],
            [
                2406,
                2433
            ],
            [
                2433,
                2466
            ],
            [
                2466,
                2648
            ],
            [
                2648,
                2678
            ],
            [
                2678,
                2689
            ],
            [
                2689,
                2705
            ],
            [
                2705,
                2796
            ],
            [
                2796,
                2879
            ],
            [
                2879,
                2932
            ],
            [
                2932,
                2947
            ],
            [
                2947,
                2983
            ],
            [
                2983,
                3195
            ],
            [
                3195,
                3232
            ],
            [
                3232,
                3456
            ],
            [
                3456,
                3491
            ],
            [
                3491,
                3526
            ],
            [
                3526,
                3589
            ],
            [
                3589,
                3600
            ],
            [
                3600,
                3696
            ],
            [
                3696,
                3776
            ],
            [
                3776,
                3819
            ],
            [
                3819,
                3899
            ],
            [
                3899,
                3963
            ],
            [
                3963,
                4019
            ],
            [
                4019,
                4162
            ],
            [
                4162,
                4197
            ],
            [
                4197,
                4328
            ],
            [
                4328,
                4431
            ],
            [
                4431,
                4531
            ],
            [
                4531,
                4558
            ],
            [
                4558,
                4640
            ],
            [
                4640,
                4684
            ],
            [
                4684,
                4771
            ],
            [
                4771,
                4841
            ],
            [
                4841,
                4887
            ],
            [
                4887,
                5039
            ],
            [
                5039,
                5170
            ],
            [
                5170,
                5302
            ],
            [
                5302,
                5351
            ],
            [
                5351,
                5500
            ],
            [
                5500,
                5576
            ],
            [
                5576,
                5667
            ],
            [
                5667,
                5720
            ],
            [
                5720,
                5898
            ],
            [
                5898,
                5992
            ],
            [
                5992,
                6007
            ],
            [
                6007,
                6024
            ],
            [
                6024,
                6047
            ],
            [
                6047,
                6093
            ],
            [
                6093,
                6188
            ],
            [
                6188,
                6202
            ],
            [
                6202,
                6224
            ],
            [
                6224,
                6337
            ],
            [
                6337,
                6379
            ],
            [
                6379,
                6455
            ],
            [
                6455,
                6608
            ],
            [
                6608,
                6642
            ],
            [
                6642,
                6711
            ],
            [
                6711,
                6780
            ],
            [
                6780,
                6827
            ],
            [
                6827,
                6846
            ],
            [
                6846,
                6937
            ],
            [
                6937,
                6979
            ],
            [
                6979,
                7013
            ],
            [
                7013,
                7041
            ],
            [
                7041,
                7152
            ],
            [
                7152,
                7238
            ],
            [
                7238,
                7270
            ],
            [
                7270,
                7284
            ],
            [
                7284,
                7361
            ],
            [
                7361,
                7414
            ],
            [
                7414,
                7445
            ],
            [
                7445,
                7491
            ],
            [
                7491,
                7555
            ],
            [
                7555,
                7611
            ],
            [
                7611,
                7689
            ],
            [
                7689,
                7713
            ],
            [
                7713,
                7733
            ],
            [
                7733,
                7798
            ],
            [
                7798,
                7890
            ],
            [
                7890,
                8008
            ],
            [
                8008,
                8065
            ],
            [
                8065,
                8097
            ],
            [
                8097,
                8218
            ],
            [
                8218,
                8257
            ],
            [
                8257,
                8342
            ],
            [
                8342,
                8435
            ],
            [
                8435,
                8467
            ],
            [
                8467,
                8510
            ],
            [
                8510,
                8560
            ],
            [
                8560,
                8588
            ],
            [
                8588,
                8644
            ],
            [
                8644,
                8693
            ],
            [
                8693,
                8840
            ],
            [
                8840,
                8950
            ],
            [
                8950,
                9086
            ],
            [
                9086,
                9168
            ],
            [
                9168,
                9336
            ],
            [
                9336,
                9435
            ],
            [
                9435,
                9488
            ],
            [
                9488,
                9542
            ],
            [
                9542,
                9567
            ],
            [
                9567,
                9800
            ],
            [
                9800,
                10010
            ],
            [
                10010,
                10060
            ],
            [
                10060,
                10120
            ],
            [
                10120,
                10156
            ],
            [
                10156,
                10193
            ],
            [
                10193,
                10213
            ],
            [
                10213,
                10260
            ],
            [
                10260,
                10423
            ],
            [
                10423,
                10444
            ],
            [
                10444,
                10507
            ],
            [
                10507,
                10576
            ],
            [
                10576,
                10782
            ],
            [
                10782,
                10825
            ],
            [
                10825,
                10863
            ],
            [
                10863,
                10969
            ],
            [
                10969,
                11009
            ],
            [
                11009,
                11041
            ],
            [
                11041,
                11143
            ],
            [
                11143,
                11177
            ],
            [
                11177,
                11233
            ],
            [
                11233,
                11293
            ],
            [
                11293,
                11338
            ],
            [
                11338,
                11422
            ],
            [
                11422,
                11466
            ],
            [
                11466,
                11506
            ],
            [
                11506,
                11535
            ],
            [
                11535,
                11561
            ],
            [
                11561,
                11589
            ],
            [
                11589,
                11675
            ],
            [
                11675,
                11738
            ],
            [
                11738,
                11784
            ],
            [
                11784,
                11906
            ],
            [
                11906,
                11966
            ],
            [
                11966,
                12078
            ],
            [
                12078,
                12122
            ],
            [
                12122,
                12157
            ],
            [
                12157,
                12200
            ],
            [
                12200,
                12531
            ],
            [
                12531,
                12628
            ],
            [
                12628,
                12713
            ],
            [
                12713,
                12927
            ],
            [
                12927,
                13019
            ],
            [
                13019,
                13069
            ],
            [
                13069,
                13521
            ],
            [
                13521,
                13641
            ],
            [
                13641,
                13674
            ],
            [
                13674,
                13706
            ],
            [
                13706,
                13735
            ],
            [
                13735,
                13866
            ],
            [
                13866,
                13942
            ],
            [
                13942,
                14084
            ],
            [
                14084,
                14207
            ],
            [
                14207,
                14249
            ],
            [
                14249,
                14417
            ],
            [
                14417,
                14506
            ],
            [
                14506,
                14695
            ],
            [
                14695,
                14743
            ],
            [
                14743,
                14778
            ],
            [
                14778,
                14846
            ],
            [
                14846,
                14927
            ],
            [
                14927,
                14957
            ],
            [
                14957,
                14971
            ],
            [
                14971,
                14996
            ],
            [
                14996,
                15066
            ],
            [
                15066,
                15139
            ],
            [
                15139,
                15217
            ],
            [
                15217,
                15252
            ],
            [
                15252,
                15263
            ],
            [
                15263,
                15280
            ],
            [
                15280,
                15322
            ],
            [
                15322,
                15362
            ],
            [
                15362,
                15456
            ],
            [
                15456,
                15574
            ],
            [
                15574,
                15676
            ],
            [
                15676,
                15725
            ],
            [
                15725,
                15769
            ],
            [
                15769,
                15805
            ],
            [
                15805,
                15960
            ],
            [
                15960,
                16046
            ],
            [
                16046,
                16082
            ],
            [
                16082,
                16179
            ],
            [
                16179,
                16208
            ],
            [
                16208,
                16298
            ],
            [
                16298,
                16411
            ],
            [
                16411,
                16572
            ],
            [
                16572,
                16627
            ],
            [
                16627,
                16726
            ],
            [
                16726,
                16774
            ],
            [
                16774,
                17034
            ],
            [
                17034,
                17129
            ],
            [
                17129,
                17182
            ],
            [
                17182,
                17354
            ],
            [
                17354,
                17602
            ],
            [
                17602,
                17665
            ],
            [
                17665,
                17760
            ],
            [
                17760,
                17885
            ],
            [
                17885,
                17994
            ],
            [
                17994,
                18031
            ],
            [
                18031,
                18064
            ],
            [
                18064,
                18167
            ],
            [
                18167,
                18227
            ],
            [
                18227,
                18299
            ],
            [
                18299,
                18328
            ],
            [
                18328,
                18417
            ],
            [
                18417,
                18621
            ],
            [
                18621,
                18659
            ],
            [
                18659,
                18765
            ],
            [
                18765,
                18830
            ],
            [
                18830,
                18885
            ],
            [
                18885,
                18946
            ],
            [
                18946,
                19016
            ],
            [
                19016,
                19335
            ]
        ],
        "overlap_chars": [
            [
                0,
                103
            ],
            [
                206,
                269
            ],
            [
                283,
                361
            ],
            [
                361,
                403
            ],
            [
                403,
                422
            ],
            [
                423,
                432
            ],
            [
                432,
                433
            ],
            [
                460,
                493
            ],
            [
                493,
                529
            ],
            [
                535,
                542
            ],
            [
                552,
                553
            ],
            [
                555,
                575
            ],
            [
                575,
                645
            ],
            [
                645,
                646
            ],
            [
                690,
                695
            ],
            [
                701,
                752
            ],
            [
                752,
                814
            ],
            [
                818,
                819
            ],
            [
                861,
                916
            ],
            [
                916,
                966
            ],
            [
                1024,
                1026
            ],
            [
                1026,
                1040
            ],
            [
                1054,
                1067
            ],
            [
                1067,
                1093
            ],
            [
                1093,
                1103
            ],
            [
                1121,
                1123
            ],
            [
                1123,
                1168
            ],
            [
                1222,
                1233
            ],
            [
                1233,
                1278
            ],
            [
                1302,
                1308
            ],
            [
                1289,
                1292
            ],
            [
                1308,
                1315
            ],
            [
                1346,
                1350
            ],
            [
                1300,
                1301
            ],
            [
                1373,
                1381
            ],
            [
                1381,
                1383
            ],
            [
                1383,
                1419
            ],
            [
                1431,
                1467
            ],
            [
                1467,
                1483
            ],
            [
                1483,
                1500
            ],
            [
                1522,
                1524
            ],
            [
                1524,
                1576
            ],
            [
                1576,
                1610
            ],
            [
                1610,
                1646
            ],
            [
                1646,
                1650
            ],
            [
                1658,
                1661
            ],
            [
                1689,
                1691
            ],
            [
                1691,
                1730
            ],
            [
                1755,
                1775
            ],
            [
                1775,
                1801
            ],
            [
                1801,
                1844
            ],
            [
                1844,
                1898
            ],
            [
                1898,
                1985
            ],
            [
                1985,
                2073
            ],
            [
                2073,
                2108
            ],
            [
                2112,
                2120
            ],
            [
                2157,
                2236
            ],
            [
                2251,
                2266
            ],
            [
                2247,
                2250
            ],
            [
                2237,
                2246
            ],
            [
                2348,
                2350
            ],
            [
                2350,
                2405
            ],
            [
                2648,
                2678
            ],
            [
                2678,
                2689
            ],
            [
                2689,
                2705
            ],
            [
                2705,
                2709
            ],
            [
                2715,
                2723
            ],
            [
                2710,
                2714
            ],
            [
                2724,
                2796
            ],
            [
                2796,
                2879
            ],
            [
                2879,
                2932
            ],
            [
                2932,
                2947
            ],
            [
                2947,
                2961
            ],
            [
                2980,
                2983
            ],
            [
                2983,
                2995
            ],
            [
                3027,
                3046
            ],
            [
                3063,
                3099
            ],
            [
                3193,
                3195
            ],
            [
                3195,
                3232
            ],
            [
                3232,
                3332
            ],
            [
                3356,
                3439
            ],
            [
                3454,
                3456
            ],
            [
                3589,
                3599
            ],
            [
                3696,
                3733
            ],
            [
                3744,
                3762
            ],
            [
                3773,
                3776
            ],
            [
                3776,
                3819
            ],
            [
                4023,
                4049
            ],
            [
                4064,
                4100
            ],
            [
                4055,
                4056
            ],
            [
                4109,
                4161
            ],
            [
                4162,
                4197
            ],
            [
                4197,
                4222
            ],
            [
                4225,
                4255
            ],
            [
                4264,
                4268
            ],
            [
                4274,
                4328
            ],
            [
                4328,
                4392
            ],
            [
                4398,
                4431
            ],
            [
                4431,
                4531
            ],
            [
                4558,
                4640
            ],
            [
                4640,
                4684
            ],
            [
                4684,
                4705
            ],
            [
                4711,
                4723
            ],
            [
                4826,
                4829
            ],
            [
                4848,
                4851
            ],
            [
                4855,
                4866
            ],
            [
                4830,
                4832
            ],
            [
                4748,
                4770
            ],
            [
                5371,
                5417
            ],
            [
                5423,
                5479
            ],
            [
                5498,
                5500
            ],
            [
                5500,
                5518
            ],
            [
                5522,
                5576
            ],
            [
                5576,
                5637
            ],
            [
                5665,
                5667
            ],
            [
                5667,
                5720
            ],
            [
                5767,
                5801
            ],
            [
                5813,
                5819
            ],
            [
                5824,
                5848
            ],
            [
                5865,
                5897
            ],
            [
                5898,
                5982
            ],
            [
                5989,
                5992
            ],
            [
                6024,
                6047
            ],
            [
                6047,
                6093
            ],
            [
                6093,
                6188
            ],
            [
                6188,
                6202
            ],
            [
                6202,
                6224
            ],
            [
                6224,
                6335
            ],
            [
                6379,
                6439
            ],
            [
                6453,
                6455
            ],
            [
                6711,
                6738
            ],
            [
                6828,
                6846
            ],
            [
                6881,
                6884
            ],
            [
                6850,
                6861
            ],
            [
                6894,
                6896
            ],
            [
                6912,
                6937
            ],
            [
                6937,
                6979
            ],
            [
                6979,
                6980
            ],
            [
                7010,
                7013
            ],
            [
                7041,
                7043
            ],
            [
                7082,
                7152
            ],
            [
                7152,
                7238
            ],
            [
                7248,
                7267
            ],
            [
                7299,
                7361
            ],
            [
                7361,
                7414
            ],
            [
                7414,
                7442
            ],
            [
                7636,
                7689
            ],
            [
                7689,
                7713
            ],
            [
                7713,
                7733
            ],
            [
                7798,
                7811
            ],
            [
                7818,
                7890
            ],
            [
                7890,
                7927
            ],
            [
                7944,
                7982
            ],
            [
                7999,
                8008
            ],
            [
                8008,
                8062
            ],
            [
                8140,
                8155
            ],
            [
                8156,
                8218
            ],
            [
                8218,
                8257
            ],
            [
                8289,
                8342
            ],
            [
                8435,
                8467
            ],
            [
                8467,
                8510
            ],
            [
                8510,
                8528
            ],
            [
                8533,
                8560
            ],
            [
                8560,
                8588
            ],
            [
                8588,
                8644
            ],
            [
                8644,
                8693
            ],
            [
                8761,
                8770
            ],
            [
                8699,
                8701
            ],
            [
                8771,
                8813
            ],
            [
                8838,
                8840
            ],
            [
                8840,
                8909
            ],
            [
                8916,
                8920
            ],
            [
                8934,
                8950
            ],
            [
                8950,
                9058
            ],
            [
                9070,
                9086
            ],
            [
                9086,
                9168
            ],
            [
                9168,
                9239
            ],
            [
                9252,
                9261
            ],
            [
                9240,
                9244
            ],
            [
                9262,
                9272
            ],
            [
                9273,
                9276
            ],
            [
                9324,
                9334
            ],
            [
                9334,
                9336
            ],
            [
                9542,
                9567
            ],
            [
                9567,
                9598
            ],
            [
                9621,
                9623
            ],
            [
                9640,
                9689
            ],
            [
                9743,
                9748
            ],
            [
                9705,
                9709
            ],
            [
                9713,
                9721
            ],
            [
                9769,
                9800
            ],
            [
                9800,
                9808
            ],
            [
                9850,
                9852
            ],
            [
                9818,
                9837
            ],
            [
                9875,
                10010
            ],
            [
                10010,
                10022
            ],
            [
                10025,
                10060
            ],
            [
                10060,
                10101
            ],
            [
                10103,
                10120
            ],
            [
                10120,
                10156
            ],
            [
                10156,
                10193
            ],
            [
                10213,
                10260
            ],
            [
                10260,
                10291
            ],
            [
                10301,
                10305
            ],
            [
                10327,
                10328
            ],
            [
                10366,
                10369
            ],
            [
                10400,
                10423
            ],
            [
                10576,
                10691
            ],
            [
                10780,
                10782
            ],
            [
                10782,
                10825
            ],
            [
                10863,
                10969
            ],
            [
                10969,
                11009
            ],
            [
                11009,
                11041
            ],
            [
                11041,
                11063
            ],
            [
                11108,
                11131
            ],
            [
                11133,
                11143
            ],
            [
                11143,
                11177
            ],
            [
                11190,
                11233
            ],
            [
                11338,
                11422
            ],
            [
                11466,
                11498
            ],
            [
                11503,
                11506
            ],
            [
                11506,
                11535
            ],
            [
                11535,
                11561
            ],
            [
                11561,
                11589
            ],
            [
                11589,
                11675
            ],
            [
                11675,
                11736
            ],
            [
                11784,
                11795
            ],
            [
                11799,
                11809
            ],
            [
                11832,
                11840
            ],
            [
                11879,
                11880
            ],
            [
                11890,
                11900
            ],
            [
                11904,
                11906
            ],
            [
                11906,
                11966
            ],
            [
                11966,
                12028
            ],
            [
                12076,
                12078
            ],
            [
                12078,
                12122
            ],
            [
                12122,
                12157
            ],
            [
                12157,
                12200
            ],
            [
                12200,
                12206
            ],
            [
                12231,
                12240
            ],
            [
                12212,
                12229
            ],
            [
                12243,
                12276
            ],
            [
                12280,
                12296
            ],
            [
                12318,
                12340
            ],
            [
                12351,
                12361
            ],
            [
                12363,
                12399
            ],
            [
                12444,
                12447
            ],
            [
                12448,
                12489
            ],
            [
                12240,
                12241
            ],
            [
                12515,
                12531
            ],
            [
                12555,
                12558
            ],
            [
                12540,
                12546
            ],
            [
                12568,
                12596
            ],
            [
                12600,
                12617
            ],
            [
                12665,
                12713
            ],
            [
                12713,
                12772
            ],
            [
                12850,
                12860
            ],
            [
                12967,
                12971
            ],
            [
                13010,
                13013
            ],
            [
                13017,
                13019
            ],
            [
                13069,
                13090
            ],
            [
                13091,
                13137
            ],
            [
                13147,
                13164
            ],
            [
                13490,
                13521
            ],
            [
                13521,
                13545
            ],
            [
                13559,
                13587
            ],
            [
                13549,
                13558
            ],
            [
                13592,
                13641
            ],
            [
                13645,
                13674
            ],
            [
                13706,
                13735
            ],
            [
                13752,
                13810
            ],
            [
                13864,
                13866
            ],
            [
                14016,
                14019
            ],
            [
                14037,
                14084
            ],
            [
                14084,
                14206
            ],
            [
                14249,
                14341
            ],
            [
                14344,
                14381
            ],
            [
                14415,
                14417
            ],
            [
                14417,
                14438
            ],
            [
                14454,
                14480
            ],
            [
                14488,
                14506
            ],
            [
                14506,
                14613
            ],
            [
                14619,
                14630
            ],
            [
                14614,
                14618
            ],
            [
                14634,
                14695
            ],
            [
                14695,
                14743
            ],
            [
                14743,
                14778
            ],
            [
                14778,
                14820
            ],
            [
                14823,
                14846
            ],
            [
                14846,
                14851
            ],
            [
                14894,
                14898
            ],
            [
                14852,
                14869
            ],
            [
                14905,
                14924
            ],
            [
                15029,
                15063
            ],
            [
                15140,
                15217
            ],
            [
                15217,
                15249
            ],
            [
                15252,
                15263
            ],
            [
                15263,
                15280
            ],
            [
                15280,
                15322
            ],
            [
                15322,
                15362
            ],
            [
                15362,
                15385
            ],
            [
                15416,
                15422
            ],
            [
                15429,
                15456
            ],
            [
                15456,
                15573
            ],
            [
                15574,
                15601
            ],
            [
                15620,
                15622
            ],
            [
                15674,
                15676
            ],
            [
                15725,
                15769
            ],
            [
                15769,
                15805
            ],
            [
                15805,
                15841
            ],
            [
                15847,
                15885
            ],
            [
                15894,
                15934
            ],
            [
                15943,
                15959
            ],
            [
                15960,
                16019
            ],
            [
                16021,
                16046
            ],
            [
                16046,
                16082
            ],
            [
                16082,
                16127
            ],
            [
                16160,
                16166
            ],
            [
                16171,
                16179
            ],
            [
                16179,
                16207
            ],
            [
                16208,
                16220
            ],
            [
                16225,
                16260
            ],
            [
                16267,
                16298
            ],
            [
                16298,
                16357
            ],
            [
                16396,
                16411
            ],
            [
                16411,
                16455
            ],
            [
                16473,
                16485
            ],
            [
                16501,
                16552
            ],
            [
                16561,
                16572
            ],
            [
                16572,
                16581
            ],
            [
                16601,
                16627
            ],
            [
                16627,
                16685
            ],
            [
                16724,
                16725
            ],
            [
                16774,
                16776
            ],
            [
                16788,
                16790
            ],
            [
                16794,
                16831
            ],
            [
                16906,
                16965
            ],
            [
                16976,
                17034
            ],
            [
                17051,
                17075
            ],
            [
                17095,
                17110
            ],
            [
                17113,
                17129
            ],
            [
                17129,
                17156
            ],
            [
                17172,
                17180
            ],
            [
                17182,
                17193
            ],
            [
                17194,
                17227
            ],
            [
                17238,
                17354
            ],
            [
                17354,
                17406
            ],
            [
                17459,
                17582
            ],
            [
                17600,
                17602
            ],
            [
                17670,
                17739
            ],
            [
                17745,
                17760
            ],
            [
                17760,
                17835
            ],
            [
                17841,
                17859
            ],
            [
                17871,
                17884
            ],
            [
                18031,
                18064
            ],
            [
                18064,
                18167
            ],
            [
                18167,
                18227
            ],
            [
                18227,
                18259
            ],
            [
                18328,
                18374
            ],
            [
                18376,
                18417
            ],
            [
                18417,
                18527
            ],
            [
                18619,
                18621
            ],
            [
                18621,
                18659
            ],
            [
                18659,
                18708
            ],
            [
                18709,
                18733
            ],
            [
                18735,
                18740
            ],
            [
                18742,
                18765
            ],
            [
                18765,
                18803
            ],
            [
                18828,
                18830
            ],
            [
                18830,
                18856
            ],
            [
                18875,
                18885
            ],
            [
                18885,
                18944
            ],
            [
                18946,
                18949
            ],
            [
                18960,
                18965
            ],
            [
                18966,
                18975
            ],
            [
                18983,
                19016
            ],
            [
                19043,
                19079
            ],
            [
                19085,
                19089
            ],
            [
                19104,
                19107
            ],
            [
                19334,
                19335
            ]
        ],
        "row_chars": [
            [
                0,
                104
            ],
            [
                104,
                148
            ],
            [
                148,
                202
            ],
            [
                202,
                271
            ],
            [
                271,
                283
            ],
            [
                283,
                361
            ],
            [
                361,
                403
            ],
            [
                403,
                432
            ],
            [
                432,
                493
            ],
            [
                493,
                575
            ],
            [
                575,
                645
            ],
            [
                645,
                752
            ],
            [
                752,
                916
            ],
            [
                916,
                1026
            ],
            [
                1026,
                1067
            ],
            [
                1067,
                1093
            ],
            [
                1093,
                1123
            ],
            [
                1123,
                1233
            ],
            [
                1233,
                1383
            ],
            [
                1383,
                1467
            ],
            [
                1467,
                1483
            ],
            [
                1483,
                1524
            ],
            [
                1524,
                1576
            ],
            [
                1576,
                1610
            ],
            [
                1610,
                1646
            ],
            [
                1646,
                1691
            ],
            [
                1691,
                1775
            ],
            [
                1775,
                1801
            ],
            [
                1801,
                1844
            ],
            [
                1844,
                1898
            ],
            [
                1898,
                1985
            ],
            [
                1985,
                2073
            ],
            [
                2073,
                2350
            ],
            [
                2350,
                2406
            ],
            [
                2406,
                2433
            ],
            [
                2433,
                2466
            ],
            [
                2466,
                2648
            ],
            [
                2648,
                2678
            ],
            [
                2678,
                2689
            ],
            [
                2689,
                2705
            ],
            [
                2705,
                2796
            ],
            [
                2796,
                2879
            ],
            [
                2879,
                2932
            ],
            [
                2932,
                2947
            ],
            [
                2947,
                2983
            ],
            [
                2983,
                3195
            ],
            [
                3195,
                3232
            ],
            [
                3232,
                3456
            ],
            [
                3456,
                3491
            ],
            [
                3491,
                3526
            ],
            [
                3526,
                3589
            ],
            [
                3589,
                3600
            ],
            [
                3600,
                3696
            ],
            [
                3696,
                3776
            ],
            [
                3776,
                3819
            ],
            [
                3819,
                3899
            ],
            [
                3899,
                3963
            ],
            [
                3963,
                4019
            ],
            [
                4019,
                4162
            ],
            [
                4162,
                4197
            ],
            [
                4197,
                4328
            ],
            [
                4328,
                4431
            ],
            [
                4431,
                4531
            ],
            [
                4531,
                4558
            ],
            [
                4558,
                4640
            ],
            [
                4640,
                4684
            ],
            [
                4684,
                4887
            ],
            [
                4887,
                5039
            ],
            [
                5039,
                5170
            ],
            [
                5170,
                5302
            ],
            [
                5302,
                5351
            ],
            [
                5351,
                5500
            ],
            [
                5500,
                5576
            ],
            [
                5576,
                5667
            ],
            [
                5667,
                5720
            ],
            [
                5720,
                5898
            ],
            [
                5898,
                5992
            ],
            [
                5992,
                6007
            ],
            [
                6007,
                6024
            ],
            [
                6024,
                6047
            ],
            [
                6047,
                6093
            ],
            [
                6093,
                6188
            ],
            [
                6188,
                6202
            ],
            [
                6202,
                6224
            ],
            [
                6224,
                6337
            ],
            [
                6337,
                6379
            ],
            [
                6379,
                6455
            ],
            [
                6455,
                6608
            ],
            [
                6608,
                6642
            ],
            [
                6642,
                6711
            ],
            [
                6711,
                6780
            ],
            [
                6780,
                6827
            ],
            [
                6827,
                6846
            ],
            [
                6846,
                6937
            ],
            [
                6937,
                6979
            ],
            [
                6979,
                7013
            ],
            [
                7013,
                7041
            ],
            [
                7041,
                7152
            ],
            [
                7152,
                7238
            ],
            [
                7238,
                7270
            ],
            [
                7270,
                7284
            ],
            [
                7284,
                7361
            ],
            [
                7361,
                7414
            ],
            [
                7414,
                7445
            ],
            [
                7445,
                7491
            ],
            [
                7491,
                7555
            ],
            [
                7555,
                7611
            ],
            [
                7611,
                7689
            ],
            [
                7689,
                7713
            ],
            [
                7713,
                7733
            ],
            [
                7733,
                7798
            ],
            [
                7798,
                7890
            ],
            [
                7890,
                8008
            ],
            [
                8008,
                8065
            ],
            [
                8065,
                8097
            ],
            [
                8097,
                8218
            ],
            [
                8218,
                8257
            ],
            [
                8257,
                8342
            ],
            [
                8342,
                8435
            ],
            [
                8435,
                8467
            ],
            [
                8467,
                8510
            ],
            [
                8510,
                8560
            ],
            [
                8560,
                8588
            ],
            [
                8588,
                8644
            ],
            [
                8644,
                8693
            ],
            [
                8693,
                8840
            ],
            [
                8840,
                8950
            ],
            [
                8950,
                9086
            ],
            [
                9086,
                9168
            ],
            [
                9168,
                9336
            ],
            [
                9336,
                9435
            ],
            [
                9435,
                9488
            ],
            [
                9488,
                9542
            ],
            [
                9542,
                9567
            ],
            [
                9567,
                9800
            ],
            [
                9800,
                10010
            ],
            [
                10010,
                10060
            ],
            [
                10060,
                10120
            ],
            [
                10120,
                10156
            ],
            [
                10156,
                10193
            ],
            [
                10193,
                10213
            ],
            [
                10213,
                10260
            ],
            [
                10260,
                10423
            ],
            [
                10423,
                10444
            ],
            [
                10444,
                10507
            ],
            [
                10507,
                10576
            ],
            [
                10576,
                10782
            ],
            [
                10782,
                10825
            ],
            [
                10825,
                10863
            ],
            [
                10863,
                10969
            ],
            [
                10969,
                11009
            ],
            [
                11009,
                11041
            ],
            [
                11041,
                11143
            ],
            [
                11143,
                11177
            ],
            [
                11177,
                11233
            ],
            [
                11233,
                11293
            ],
            [
                11293,
                11338
            ],
            [
                11338,
                11422
            ],
            [
                11422,
                11466
            ],
            [
                11466,
                11506
            ],
            [
                11506,
                11535
            ],
            [
                11535,
                11561
            ],
            [
                11561,
                11589
            ],
            [
                11589,
                11675
            ],
            [
                11675,
                11738
            ],
            [
                11738,
                11784
            ],
            [
                11784,
                11906
            ],
            [
                11906,
                11966
            ],
            [
                11966,
                12078
            ],
            [
                12078,
                12122
            ],
            [
                12122,
                12157
            ],
            [
                12157,
                12200
            ],
            [
                12200,
                12531
            ],
            [
                12531,
                12713
            ],
            [
                12713,
                13019
            ],
            [
                13019,
                13069
            ],
            [
                13069,
                13521
            ],
            [
                13521,
                13641
            ],
            [
                13641,
                13674
            ],
            [
                13674,
                13706
            ],
            [
                13706,
                13735
            ],
            [
                13735,
                13866
            ],
            [
                13866,
                13942
            ],
            [
                13942,
                14084
            ],
            [
                14084,
                14207
            ],
            [
                14207,
                14249
            ],
            [
                14249,
                14417
            ],
            [
                14417,
                14506
            ],
            [
                14506,
                14695
            ],
            [
                14695,
                14743
            ],
            [
                14743,
                14778
            ],
            [
                14778,
                14846
            ],
            [
                14846,
                14927
            ],
            [
                14927,
                14957
            ],
            [
                14957,
                14971
            ],
            [
                14971,
                14996
            ],
            [
                14996,
                15066
            ],
            [
                15066,
                15139
            ],
            [
                15139,
                15217
            ],
            [
                15217,
                15252
            ],
            [
                15252,
                15263
            ],
            [
                15263,
                15280
            ],
            [
                15280,
                15322
            ],
            [
                15322,
                15362
            ],
            [
                15362,
                15456
            ],
            [
                15456,
                15574
            ],
            [
                15574,
                15676
            ],
            [
                15676,
                15725
            ],
            [
                15725,
                15769
            ],
            [
                15769,
                15805
            ],
            [
                15805,
                15960
            ],
            [
                15960,
                16046
            ],
            [
                16046,
                16082
            ],
            [
                16082,
                16179
            ],
            [
                16179,
                16208
            ],
            [
                16208,
                16298
            ],
            [
                16298,
                16411
            ],
            [
                16411,
                16572
            ],
            [
                16572,
                16627
            ],
            [
                16627,
                16726
            ],
            [
                16726,
                16774
            ],
            [
                16774,
                17034
            ],
            [
                17034,
                17129
            ],
            [
                17129,
                17354
            ],
            [
                17354,
                17602
            ],
            [
                17602,
                17665
            ],
            [
                17665,
                17760
            ],
            [
                17760,
                17885
            ],
            [
                17885,
                17994
            ],
            [
                17994,
                18031
            ],
            [
                18031,
                18064
            ],
            [
                18064,
                18167
            ],
            [
                18167,
                18227
            ],
            [
                18227,
                18417
            ],
            [
                18417,
                18621
            ],
            [
                18621,
                18659
            ],
            [
                18659,
                18765
            ],
            [
                18765,
                18830
            ],
            [
                18830,
                18885
            ],
            [
                18885,
                19016
            ],
            [
                19016,
                19335
            ]
        ]
    },
    "abridged": {
        "text": "\"This is so kind of you,\" said Lady Carbury, grasping her cousin's hand as she got out of the carriage. \"I did so long to get into the country, and I do so love Carbury.\"\n\"Where should a Carbury go to escape from London smoke, but to the old house? I am afraid Henrietta will find it dull.\"\n\"Oh no,\" said Hetta, smiling. \"I am never dull in the country.\"\n\"The bishop and Mrs. Yeld are coming to dine tomorrow, and the Hepworths.\"\n\"I shall be so glad to meet the bishop once more,\" said Lady Carbury.\n\"He is a dear, good fellow, and his wife is just as good. And there is another gentleman coming whom you have never seen: a Father John Barham, who has come to Beccles as priest. He has got a little cottage about a mile from here. I used to know his family.\"\n\"He is a gentleman then?\"\n\"Certainly. He took his degree at Oxford, and then became a convert. He has not got a shilling in the world beyond his priest's pay, which is not much more than a labourer's. He told me the other day that he was forced to buy second-hand clothes.\"\n\"How shocking!\" said Lady Carbury.\n\"He didn't seem to be at all shocked at telling it. We have got to be quite friends.\"\n\"Will the bishop like to meet him?\"\n\"Why not? I've told the bishop all about him, and he wishes to know him. He won't hurt the bishop. But you and Hetta will find it very dull.\"\n\"I shan't find it dull, Mr. Carbury,\" said Henrietta.\n\"It was to escape from the eternal parties that we came down here,\" said Lady Carbury. She had nevertheless been anxious to hear what guests were expected at the Manor House. Sir Felix had promised to come down from Saturday until Monday, and Lady Carbury had hoped that some visiting might be arranged between the Manor House and Caversham.\n\"I have asked the Longestaffes for Monday,\" said Roger. \"But they won't come, I dare say.\"\n\"Why not?\"\n\"They never do. They probably have a house full of guests, and they know that my accommodation is limited. I've no doubt they'll ask us on Tuesday or Wednesday, and if you like we will go.\"\n\"I know they are to have guests,\" said Lady Carbury.\n\"What guests?\"\n\"The Melmottes.\" Lady Carbury felt that her voice and self-possession were failing her.\n\"The Melmottes coming to Caversham!\" said Roger, looking at Henrietta, who blushed with shame as she remembered that she had been brought here solely in order that her brother might have an opportunity of seeing Marie Melmotte.\n\"Why not?\" said Lady Carbury. \"I fancy, Roger, that Mr. Longestaffe needs a little pecuniary help.\"\n\"And he condescends to get it in this way! I should have thought that Mr. Longestaffe might have kept such a man as Mr. Melmotte out of his wife's drawing-room.\"\nHenrietta became redder than ever. Even Lady Carbury flushed, as she remembered that Roger knew she had taken her daughter to Madame Melmotte's ball. He thought of this himself as soon as the words were spoken, and tried to make some half apology. \"I don't approve of them in London, you know; but I think they are very much worse in the country.\"\nThen the ladies were shown into their rooms, and Roger again went out into the garden. He began to feel that he understood it all. Lady Carbury had come to his house not for love of him, but to be near the Melmottes! He and his house had been simply used in order to further a vile project of marrying two vile people to each other!\nAs he was thinking all this, Lady Carbury came out to him in the garden. She had changed her travelling dress, and made herself pretty. And now she dressed her face in her sweetest smiles. She wished to explain to her stern cousin the good that might come by an alliance with the heiress.\n\"I can understand, Roger,\" she said, taking his arm, \"that you should not like those Melmottes.\"\n\"I don't dislike them. How should I dislike people that I never saw? I dislike those who seek their society simply because they have the reputation of being rich.\"\n\"Meaning me.\"\n\"No; not meaning you. I don't dislike you, as you know very well, though I do dislike the fact that you should run after these people.\"\n\"Do you suppose, my friend, that I run after them for my own pleasure? You know my son's condition. What is he to do? His only chance is to marry a girl with money. He is good-looking; you can't deny that.\"\n\"Certainly.\"\n\"He was very young when he came into possession of his own small fortune. He might have done better; but how many young men placed in such temptations do well? He has nothing left. Is it not imperative that he should marry a girl with money?\"\n\"I call that stealing a girl's money, Lady Carbury.\"\n\"Oh, Roger, how hard you are! The girl will not marry Felix unless she loves him.\"\n\"But does he love her?\"\n\"Why should he not? Of course she hopes to be married, and why should she not have Felix if she likes him best? Cannot you sympathize with my anxiety that he shall not be a disgrace to the family?\"\n\"We had better not talk about the family, Lady Carbury. The family will not be benefited by a marriage with the daughter of Mr. Melmotte. I look upon him as dirt in the gutter. All his money, if he has it, can make no difference. Who knows anything of this man? Who can be sure that she is his daughter?\"\n\"He would give her a fortune when she married.\"\n\"Yes; it all comes to that. Men say openly that he is an adventurer and a swindler. No one pretends to think that he is a gentleman. His money is amassed not by honest trade, but by unknown tricks. He is one whom we would not admit into our kitchens, much less to our dining-tables, on his own merits. But because he has learned the art of making money, we not only put up with him, but settle upon his carcase like birds of prey.\"\n\"Do you mean that Felix should not marry the girl, even if they love each other?\"\nHe shook his head in disgust, feeling sure that any idea of love on the young man's part was a sham - and that his mother knew it. \"It is no affair of mine. When I am told that the girl is at Caversham, and that Felix is coming here in order to be near his prey, I can only say what I think. Your son is welcome to my house, little as I approve his mode of life; but I could have wished that he had chosen some other place for the work that he has on hand.\"\n\"If you wish, Roger, we will return to London. I shall find it hard to explain to Hetta; but we will go.\"\n\"No; I certainly do not wish that.\"\n\"But you have said such hard things! You speak of Felix as though he were all bad.\" She looked at him hoping to get some retraction, but he had nothing to say. Had he found fault with herself, or with Henrietta, she would have put up with it, for the sake of benefits to come. But for her son she was prepared to fight. \"I am grieved, Roger, that we should have troubled you with our visit, but I think that we had better go. You are very harsh, and it crushes me.\"\n\"I have not meant to be harsh.\"\n\"You say that Felix is brought here to be near - his prey. What can be more harsh than that? You should remember that I am his mother.\"\nRoger began to be ashamed of himself, and to think that he had spoken unkind words. \"If I have hurt you, I regret it.\"\n\"Of course you have hurt me. I think I will go in now. How very hard the world is! I came here thinking to find peace and sunshine, and there has come a storm at once.\"\n\"You asked me about the Melmottes, and I was obliged to speak.\" They walked in silence to the door, where he stopped. \"If I have been over hot with you, let me beg your pardon.\" She smiled and bowed; but her smile was not one of forgiveness. \"Pray do not speak of going, Lady Carbury.\"\n\"I think I will go to my room now. My head aches so that I can hardly stand.\"\nIt was about six in the afternoon, and according to his daily custom Roger should have gone to see his men as they finished their work; but he stood still for a few moments and then went slowly across the lawn to the bridge, sitting on the parapet. Would she really leave his house in anger and take her daughter - the one human being in the world that he loved? He was a man who thought much of the duties of hospitality, especially when his guests were Carburys. But if there were one person among all others to whom the house should be a refuge from care, that one was his cousin Hetta. And now he had been told that he had been so rough to his guest that she and her daughter must return to London!\nHe could not acquit himself. He had said very hard words. He could not have expressed his meaning without hard words. And Lady Carbury had acted well the part of an outraged mother. His heart was so soft that though he knew the woman to be false and the son to be worthless, he utterly condemned himself.\nWhen he had sat half-an-hour upon the bridge he turned towards the house to dress for dinner - and to prepare himself for an apology. At the door, standing as though waiting for him, was his cousin Hetta. She had on her bosom the rose he had placed in her room, and as he approached her he thought that there was in her eyes more graciousness towards him than he had ever seen there before.\n\"Mr. Carbury,\" she said, \"mamma is so unhappy!\"\n\"I fear that I have offended her.\"\n\"It is not that, but that you should be so - so angry about Felix.\"\n\"I am more vexed with myself than I can tell you. She talked of going back to London. I should be wretched indeed if you and she were to leave my house in anger.\"\n\"I do not think she will do that,\" said Hetta.\n\"And you?\"\n\"I am not angry. I should never dare to be angry with you. I only wish that Felix would be better. They say that young men do get better as they grow older. He is something in the city now, a director they call him, and mamma thinks that the work will be of service to him.\"\nRoger could express no hope or approval. \"Dear Hetta, I only wish he were like you.\"\n\"Girls are so different, you know.\"\nIt was not till late in the evening, after dinner, that he made his apology to Lady Carbury; but he did make it, and it was accepted.\n\"I think I was rough to you, talking about Felix,\" he said, \"and I beg your pardon.\"\n\"You were energetic, that was all.\"\n\"A gentleman should never be rough to a lady, nor to his guests. I hope you will forgive me.\"\nShe answered by putting out her hand and smiling; and so the quarrel was over.\nLady Carbury understood the full extent of her triumph, and used it thoroughly. Felix might now come down to Carbury, and go to Caversham to do his wooing, and the master of Carbury could make no objection. And Felix would not now be snubbed. Roger would understand that he was constrained to courtesy.\nHe did understand it, and though he was soft and gracious towards his two guests, he felt that he had been cheated out of his right to disapprove of all connection with the Melmottes. During the evening there came a bundle of notes from Caversham. That addressed to Roger was a letter from Lady Pomona; who was sorry to say that the Longestaffes were prevented from having the pleasure of dining at Carbury Hall by the fact that they had a house full of guests. Lady Pomona hoped that Mr. Carbury and his relatives would do the Longestaffes the pleasure of dining at Caversham either on the Monday or Tuesday following, as might best suit. There were cards of invitation for Lady Carbury and her daughter, and for Sir Felix.\nRoger, as he read his own note, handed the others over to Lady Carbury, and asked her what she wished to have done.\n\"I should like to go,\" she said.\n\"I certainly shall not go,\" he replied; \"but there will be no difficulty whatever in sending you over. You must answer at once, because their servant is waiting.\"\n\"Monday will be best,\" she said; \"I suppose I had better say that I, and Hetta, and Felix will accept their invitation.\"\n\"I can make no suggestion,\" said Roger, thinking how delightful it would be if Henrietta could remain with him instead. Poor Hetta herself could say nothing. She certainly did not wish to meet the Melmottes, but nor did she wish to dine alone with her cousin Roger.\n\"That will be best,\" said Lady Carbury. \"It is very good of you to send us.\"\n\"Of course you will do here just as you please,\" he replied; but still with that tone of voice which Lady Carbury feared. Soon the Caversham servant was on his way with the reply.",
        "paragraph_chars": [
            [
                0,
                171
            ],
            [
                171,
                291
            ],
            [
                291,
                355
            ],
            [
                355,
                430
            ],
            [
                430,
                500
            ],
            [
                500,
                759
            ],
            [
                759,
                785
            ],
            [
                785,
                1033
            ],
            [
                1033,
                1068
            ],
            [
                1068,
                1154
            ],
            [
                1154,
                1190
            ],
            [
                1190,
                1332
            ],
            [
                1332,
                1386
            ],
            [
                1386,
                1728
            ],
            [
                1728,
                1819
            ],
            [
                1819,
                1830
            ],
            [
                1830,
                2020
            ],
            [
                2020,
                2073
            ],
            [
                2073,
                2088
            ],
            [
                2088,
                2176
            ],
            [
                2176,
                2404
            ],
            [
                2404,
                2504
            ],
            [
                2504,
                2666
            ],
            [
                2666,
                3014
            ],
            [
                3014,
                3347
            ],
            [
                3347,
                3636
            ],
            [
                3636,
                3733
            ],
            [
                3733,
                3897
            ],
            [
                3897,
                3911
            ],
            [
                3911,
                4047
            ],
            [
                4047,
                4254
            ],
            [
                4254,
                4267
            ],
            [
                4267,
                4510
            ],
            [
                4510,
                4563
            ],
            [
                4563,
                4646
            ],
            [
                4646,
                4670
            ],
            [
                4670,
                4868
            ],
            [
                4868,
                5173
            ],
            [
                5173,
                5221
            ],
            [
                5221,
                5653
            ],
            [
                5653,
                5735
            ],
            [
                5735,
                6193
            ],
            [
                6193,
                6299
            ],
            [
                6299,
                6335
            ],
            [
                6335,
                6801
            ],
            [
                6801,
                6833
            ],
            [
                6833,
                6969
            ],
            [
                6969,
                7088
            ],
            [
                7088,
                7257
            ],
            [
                7257,
                7543
            ],
            [
                7543,
                7621
            ],
            [
                7621,
                8324
            ],
            [
                8324,
                8629
            ],
            [
                8629,
                9020
            ],
            [
                9020,
                9068
            ],
            [
                9068,
                9103
            ],
            [
                9103,
                9171
            ],
            [
                9171,
                9334
            ],
            [
                9334,
                9381
            ],
            [
                9381,
                9392
            ],
            [
                9392,
                9667
            ],
            [
                9667,
                9752
            ],
            [
                9752,
                9788
            ],
            [
                9788,
                9922
            ],
            [
                9922,
                10007
            ],
            [
                10007,
                10043
            ],
            [
                10043,
                10137
            ],
            [
                10137,
                10216
            ],
            [
                10216,
                10519
            ],
            [
                10519,
                11244
            ],
            [
                11244,
                11360
            ],
            [
                11360,
                11393
            ],
            [
                11393,
                11556
            ],
            [
                11556,
                11677
            ],
            [
                11677,
                11943
            ],
            [
                11943,
                12020
            ],
            [
                12020,
                12199
            ]
        ],
        "segment_chars": [
            [
                0,
                104
            ],
            [
                104,
                171
            ],
            [
                171,
                249
            ],
            [
                249,
                291
            ],
            [
                291,
                321
            ],
            [
                321,
                355
            ],
            [
                355,
                430
            ],
            [
                430,
                500
            ],
            [
                500,
                558
            ],
            [
                558,
                679
            ],
            [
                679,
                731
            ],
            [
                731,
                759
            ],
            [
                759,
                785
            ],
            [
                785,
                797
            ],
            [
                797,
                854
            ],
            [
                854,
                960
            ],
            [
                960,
                1033
            ],
            [
                1033,
                1049
            ],
            [
                1049,
                1068
            ],
            [
                1068,
                1120
            ],
            [
                1120,
                1154
            ],
            [
                1154,
                1190
            ],
            [
                1190,
                1200
            ],
            [
                1200,
                1263
            ],
            [
                1263,
                1289
            ],
            [
                1289,
                1332
            ],
            [
                1332,
                1386
            ],
            [
                1386,
                1473
            ],
            [
                1473,
                1561
            ],
            [
                1561,
                1728
            ],
            [
                1728,
                1784
            ],
            [
                1784,
                1819
            ],
            [
                1819,
                1830
            ],
            [
                1830,
                1846
            ],
            [
                1846,
                1937
            ],
            [
                1937,
                2020
            ],
            [
                2020,
                2073
            ],
            [
                2073,
                2088
            ],
            [
                2088,
                2105
            ],
            [
                2105,
                2176
            ],
            [
                2176,
                2213
            ],
            [
                2213,
                2404
            ],
            [
                2404,
                2415
            ],
            [
                2415,
                2434
            ],
            [
                2434,
                2504
            ],
            [
                2504,
                2547
            ],
            [
                2547,
                2666
            ],
            [
                2666,
                2701
            ],
            [
                2701,
                2816
            ],
            [
                2816,
                2914
            ],
            [
                2914,
                3014
            ],
            [
                3014,
                3101
            ],
            [
                3101,
                3145
            ],
            [
                3145,
                3231
            ],
            [
                3231,
                3347
            ],
            [
                3347,
                3420
            ],
            [
                3420,
                3483
            ],
            [
                3483,
                3536
            ],
            [
                3536,
                3636
            ],
            [
                3636,
                3733
            ],
            [
                3733,
                3756
            ],
            [
                3756,
                3802
            ],
            [
                3802,
                3897
            ],
            [
                3897,
                3911
            ],
            [
                3911,
                3933
            ],
            [
                3933,
                4047
            ],
            [
                4047,
                4118
            ],
            [
                4118,
                4147
            ],
            [
                4147,
                4165
            ],
            [
                4165,
                4212
            ],
            [
                4212,
                4254
            ],
            [
                4254,
                4267
            ],
            [
                4267,
                4341
            ],
            [
                4341,
                4427
            ],
            [
                4427,
                4448
            ],
            [
                4448,
                4510
            ],
            [
                4510,
                4563
            ],
            [
                4563,
                4593
            ],
            [
                4593,
                4646
            ],
            [
                4646,
                4670
            ],
            [
                4670,
                4690
            ],
            [
                4690,
                4782
            ],
            [
                4782,
                4868
            ],
            [
                4868,
                4924
            ],
            [
                4924,
                5006
            ],
            [
                5006,
                5045
            ],
            [
                5045,
                5098
            ],
            [
                5098,
                5130
            ],
            [
                5130,
                5173
            ],
            [
                5173,
                5221
            ],
            [
                5221,
                5249
            ],
            [
                5249,
                5305
            ],
            [
                5305,
                5354
            ],
            [
                5354,
                5419
            ],
            [
                5419,
                5523
            ],
            [
                5523,
                5653
            ],
            [
                5653,
                5735
            ],
            [
                5735,
                5866
            ],
            [
                5866,
                5892
            ],
            [
                5892,
                6027
            ],
            [
                6027,
                6193
            ],
            [
                6193,
                6240
            ],
            [
                6240,
                6299
            ],
            [
                6299,
                6335
            ],
            [
                6335,
                6372
            ],
            [
                6372,
                6419
            ],
            [
                6419,
                6495
            ],
            [
                6495,
                6612
            ],
            [
                6612,
                6655
            ],
            [
                6655,
                6761
            ],
            [
                6761,
                6801
            ],
            [
                6801,
                6833
            ],
            [
                6833,
                6892
            ],
            [
                6892,
                6926
            ],
            [
                6926,
                6969
            ],
            [
                6969,
                7053
            ],
            [
                7053,
                7088
            ],
            [
                7088,
                7117
            ],
            [
                7117,
                7143
            ],
            [
                7143,
                7171
            ],
            [
                7171,
                7257
            ],
            [
                7257,
                7321
            ],
            [
                7321,
                7375
            ],
            [
                7375,
                7435
            ],
            [
                7435,
                7499
            ],
            [
                7499,
                7543
            ],
            [
                7543,
                7578
            ],
            [
                7578,
                7621
            ],
            [
                7621,
                7870
            ],
            [
                7870,
                7984
            ],
            [
                7984,
                8086
            ],
            [
                8086,
                8211
            ],
            [
                8211,
                8324
            ],
            [
                8324,
                8353
            ],
            [
                8353,
                8382
            ],
            [
                8382,
                8442
            ],
            [
                8442,
                8506
            ],
            [
                8506,
                8629
            ],
            [
                8629,
                8763
            ],
            [
                8763,
                8834
            ],
            [
                8834,
                9020
            ],
            [
                9020,
                9068
            ],
            [
                9068,
                9103
            ],
            [
                9103,
                9171
            ],
            [
                9171,
                9221
            ],
            [
                9221,
                9257
            ],
            [
                9257,
                9334
            ],
            [
                9334,
                9381
            ],
            [
                9381,
                9392
            ],
            [
                9392,
                9409
            ],
            [
                9409,
                9451
            ],
            [
                9451,
                9491
            ],
            [
                9491,
                9549
            ],
            [
                9549,
                9667
            ],
            [
                9667,
                9708
            ],
            [
                9708,
                9752
            ],
            [
                9752,
                9788
            ],
            [
                9788,
                9922
            ],
            [
                9922,
                10007
            ],
            [
                10007,
                10043
            ],
            [
                10043,
                10108
            ],
            [
                10108,
                10137
            ],
            [
                10137,
                10216
            ],
            [
                10216,
                10296
            ],
            [
                10296,
                10423
            ],
            [
                10423,
                10459
            ],
            [
                10459,
                10519
            ],
            [
                10519,
                10703
            ],
            [
                10703,
                10767
            ],
            [
                10767,
                10981
            ],
            [
                10981,
                11159
            ],
            [
                11159,
                11244
            ],
            [
                11244,
                11360
            ],
            [
                11360,
                11393
            ],
            [
                11393,
                11496
            ],
            [
                11496,
                11556
            ],
            [
                11556,
                11677
            ],
            [
                11677,
                11797
            ],
            [
                11797,
                11835
            ],
            [
                11835,
                11943
            ],
            [
                11943,
                11983
            ],
            [
                11983,
                12020
            ],
            [
                12020,
                12142
            ],
            [
                12142,
                12199
            ]
        ],
        "overlap_chars": [
            [
                0,
                103
            ],
            [
                105,
                168
            ],
            [
                171,
                249
            ],
            [
                249,
                291
            ],
            [
                291,
                310
            ],
            [
                312,
                321
            ],
            [
                321,
                322
            ],
            [
                322,
                355
            ],
            [
                355,
                391
            ],
            [
                392,
                399
            ],
            [
                408,
                409
            ],
            [
                410,
                430
            ],
            [
                430,
                500
            ],
            [
                500,
                501
            ],
            [
                501,
                506
            ],
            [
                507,
                558
            ],
            [
                558,
                620
            ],
            [
                622,
                623
            ],
            [
                624,
                679
            ],
            [
                679,
                729
            ],
            [
                729,
                731
            ],
            [
                731,
                745
            ],
            [
                746,
                759
            ],
            [
                759,
                785
            ],
            [
                785,
                795
            ],
            [
                795,
                797
            ],
            [
                797,
                842
            ],
            [
                843,
                854
            ],
            [
                854,
                899
            ],
            [
                904,
                910
            ],
            [
                913,
                916
            ],
            [
                916,
                923
            ],
            [
                931,
                935
            ],
            [
                946,
                947
            ],
            [
                948,
                956
            ],
            [
                958,
                960
            ],
            [
                960,
                996
            ],
            [
                997,
                1033
            ],
            [
                1033,
                1049
            ],
            [
                1049,
                1066
            ],
            [
                1066,
                1068
            ],
            [
                1068,
                1120
            ],
            [
                1120,
                1154
            ],
            [
                1154,
                1190
            ],
            [
                1190,
                1194
            ],
            [
                1195,
                1198
            ],
            [
                1198,
                1200
            ],
            [
                1200,
                1239
            ],
            [
                1243,
                1263
            ],
            [
                1263,
                1289
            ],
            [
                1289,
                1332
            ],
            [
                1332,
                1386
            ],
            [
                1386,
                1473
            ],
            [
                1473,
                1561
            ],
            [
                1561,
                1596
            ],
            [
                1602,
                1610
            ],
            [
                1617,
                1696
            ],
            [
                1697,
                1712
            ],
            [
                1713,
                1716
            ],
            [
                1717,
                1726
            ],
            [
                1726,
                1728
            ],
            [
                1728,
                1783
            ],
            [
                1789,
                1819
            ],
            [
                1819,
                1830
            ],
            [
                1830,
                1846
            ],
            [
                1846,
                1850
            ],
            [
                1851,
                1859
            ],
            [
                1860,
                1864
            ],
            [
                1865,
                1937
            ],
            [
                1937,
                2020
            ],
            [
                2020,
                2073
            ],
            [
                2073,
                2088
            ],
            [
                2088,
                2102
            ],
            [
                2102,
                2105
            ],
            [
                2105,
                2117
            ],
            [
                2118,
                2137
            ],
            [
                2138,
                2174
            ],
            [
                2174,
                2176
            ],
            [
                2176,
                2213
            ],
            [
                2213,
                2313
            ],
            [
                2319,
                2402
            ],
            [
                2402,
                2404
            ],
            [
                2404,
                2414
            ],
            [
                2434,
                2471
            ],
            [
                2478,
                2496
            ],
            [
                2501,
                2504
            ],
            [
                2504,
                2547
            ],
            [
                2547,
                2573
            ],
            [
                2574,
                2610
            ],
            [
                2611,
                2612
            ],
            [
                2613,
                2665
            ],
            [
                2666,
                2701
            ],
            [
                2701,
                2726
            ],
            [
                2726,
                2756
            ],
            [
                2757,
                2761
            ],
            [
                2762,
                2816
            ],
            [
                2816,
                2880
            ],
            [
                2881,
                2914
            ],
            [
                2914,
                3014
            ],
            [
                3019,
                3101
            ],
            [
                3101,
                3145
            ],
            [
                3145,
                3166
            ],
            [
                3167,
                3179
            ],
            [
                3180,
                3183
            ],
            [
                3184,
                3187
            ],
            [
                3188,
                3199
            ],
            [
                3205,
                3207
            ],
            [
                3208,
                3230
            ],
            [
                3231,
                3277
            ],
            [
                3289,
                3345
            ],
            [
                3345,
                3347
            ],
            [
                3347,
                3365
            ],
            [
                3366,
                3420
            ],
            [
                3420,
                3481
            ],
            [
                3481,
                3483
            ],
            [
                3483,
                3536
            ],
            [
                3536,
                3570
            ],
            [
                3571,
                3577
            ],
            [
                3578,
                3602
            ],
            [
                3603,
                3635
            ],
            [
                3636,
                3720
            ],
            [
                3730,
                3733
            ],
            [
                3733,
                3756
            ],
            [
                3756,
                3802
            ],
            [
                3802,
                3897
            ],
            [
                3897,
                3911
            ],
            [
                3911,
                3933
            ],
            [
                3933,
                4044
            ],
            [
                4047,
                4107
            ],
            [
                4116,
                4118
            ],
            [
                4118,
                4145
            ],
            [
                4147,
                4165
            ],
            [
                4165,
                4168
            ],
            [
                4169,
                4180
            ],
            [
                4181,
                4183
            ],
            [
                4187,
                4212
            ],
            [
                4212,
                4254
            ],
            [
                4254,
                4255
            ],
            [
                4264,
                4267
            ],
            [
                4268,
                4270
            ],
            [
                4271,
                4341
            ],
            [
                4341,
                4427
            ],
            [
                4427,
                4446
            ],
            [
                4448,
                4510
            ],
            [
                4510,
                4563
            ],
            [
                4563,
                4591
            ],
            [
                4593,
                4646
            ],
            [
                4646,
                4670
            ],
            [
                4670,
                4690
            ],
            [
                4690,
                4703
            ],
            [
                4710,
                4782
            ],
            [
                4782,
                4819
            ],
            [
                4820,
                4858
            ],
            [
                4859,
                4868
            ],
            [
                4868,
                4922
            ],
            [
                4924,
                4939
            ],
            [
                4944,
                5006
            ],
            [
                5006,
                5045
            ],
            [
                5045,
                5098
            ],
            [
                5098,
                5130
            ],
            [
                5130,
                5173
            ],
            [
                5173,
                5191
            ],
            [
                5194,
                5221
            ],
            [
                5221,
                5249
            ],
            [
                5249,
                5305
            ],
            [
                5305,
                5354
            ],
            [
                5354,
                5363
            ],
            [
                5364,
                5366
            ],
            [
                5375,
                5417
            ],
            [
                5417,
                5419
            ],
            [
                5419,
                5488
            ],
            [
                5502,
                5506
            ],
            [
                5507,
                5523
            ],
            [
                5523,
                5631
            ],
            [
                5637,
                5653
            ],
            [
                5653,
                5735
            ],
            [
                5735,
                5806
            ],
            [
                5807,
                5816
            ],
            [
                5819,
                5823
            ],
            [
                5824,
                5834
            ],
            [
                5837,
                5840
            ],
            [
                5846,
                5856
            ],
            [
                5864,
                5866
            ],
            [
                5867,
                5892
            ],
            [
                5892,
                5923
            ],
            [
                5924,
                5926
            ],
            [
                5927,
                5976
            ],
            [
                5977,
                5982
            ],
            [
                5983,
                5987
            ],
            [
                5988,
                5996
            ],
            [
                5996,
                6027
            ],
            [
                6027,
                6035
            ],
            [
                6036,
                6038
            ],
            [
                6039,
                6058
            ],
            [
                6058,
                6193
            ],
            [
                6193,
                6205
            ],
            [
                6205,
                6240
            ],
            [
                6240,
                6281
            ],
            [
                6282,
                6299
            ],
            [
                6299,
                6335
            ],
            [
                6335,
                6372
            ],
            [
                6372,
                6419
            ],
            [
                6419,
                6450
            ],
            [
                6451,
                6455
            ],
            [
                6466,
                6467
            ],
            [
                6468,
                6471
            ],
            [
                6472,
                6495
            ],
            [
                6495,
                6610
            ],
            [
                6610,
                6612
            ],
            [
                6612,
                6655
            ],
            [
                6655,
                6761
            ],
            [
                6761,
                6801
            ],
            [
                6801,
                6833
            ],
            [
                6833,
                6855
            ],
            [
                6856,
                6879
            ],
            [
                6882,
                6892
            ],
            [
                6892,
                6926
            ],
            [
                6926,
                6969
            ],
            [
                6969,
                7053
            ],
            [
                7053,
                7085
            ],
            [
                7085,
                7088
            ],
            [
                7088,
                7117
            ],
            [
                7117,
                7143
            ],
            [
                7143,
                7171
            ],
            [
                7171,
                7257
            ],
            [
                7257,
                7318
            ],
            [
                7321,
                7332
            ],
            [
                7333,
                7343
            ],
            [
                7347,
                7355
            ],
            [
                7355,
                7356
            ],
            [
                7363,
                7373
            ],
            [
                7373,
                7375
            ],
            [
                7375,
                7435
            ],
            [
                7435,
                7497
            ],
            [
                7497,
                7499
            ],
            [
                7499,
                7543
            ],
            [
                7543,
                7578
            ],
            [
                7578,
                7621
            ],
            [
                7621,
                7627
            ],
            [
                7628,
                7637
            ],
            [
                7638,
                7655
            ],
            [
                7656,
                7689
            ],
            [
                7696,
                7712
            ],
            [
                7713,
                7735
            ],
            [
                7745,
                7755
            ],
            [
                7757,
                7793
            ],
            [
                7794,
                7797
            ],
            [
                7803,
                7844
            ],
            [
                7844,
                7845
            ],
            [
                7854,
                7870
            ],
            [
                7876,
                7879
            ],
            [
                7880,
                7886
            ],
            [
                7887,
                7915
            ],
            [
                7916,
                7933
            ],
            [
                7936,
                7984
            ],
            [
                7984,
                8043
            ],
            [
                8060,
                8070
            ],
            [
                8071,
                8075
            ],
            [
                8076,
                8079
            ],
            [
                8084,
                8086
            ],
            [
                8086,
                8107
            ],
            [
                8115,
                8161
            ],
            [
                8162,
                8179
            ],
            [
                8180,
                8211
            ],
            [
                8211,
                8235
            ],
            [
                8236,
                8264
            ],
            [
                8265,
                8274
            ],
            [
                8275,
                8324
            ],
            [
                8324,
                8353
            ],
            [
                8353,
                8382
            ],
            [
                8382,
                8440
            ],
            [
                8440,
                8442
            ],
            [
                8442,
                8445
            ],
            [
                8459,
                8506
            ],
            [
                8506,
                8628
            ],
            [
                8629,
                8721
            ],
            [
                8724,
                8761
            ],
            [
                8761,
                8763
            ],
            [
                8763,
                8784
            ],
            [
                8785,
                8811
            ],
            [
                8816,
                8834
            ],
            [
                8834,
                8941
            ],
            [
                8942,
                8953
            ],
            [
                8954,
                8958
            ],
            [
                8959,
                9020
            ],
            [
                9020,
                9068
            ],
            [
                9068,
                9103
            ],
            [
                9103,
                9145
            ],
            [
                9148,
                9171
            ],
            [
                9171,
                9176
            ],
            [
                9177,
                9181
            ],
            [
                9182,
                9199
            ],
            [
                9200,
                9219
            ],
            [
                9221,
                9255
            ],
            [
                9257,
                9334
            ],
            [
                9334,
                9366
            ],
            [
                9381,
                9392
            ],
            [
                9392,
                9409
            ],
            [
                9409,
                9451
            ],
            [
                9451,
                9491
            ],
            [
                9491,
                9514
            ],
            [
                9515,
                9521
            ],
            [
                9522,
                9549
            ],
            [
                9549,
                9666
            ],
            [
                9667,
                9694
            ],
            [
                9695,
                9697
            ],
            [
                9706,
                9708
            ],
            [
                9708,
                9752
            ],
            [
                9752,
                9788
            ],
            [
                9788,
                9824
            ],
            [
                9825,
                9863
            ],
            [
                9864,
                9904
            ],
            [
                9905,
                9921
            ],
            [
                9922,
                9981
            ],
            [
                9982,
                10007
            ],
            [
                10007,
                10043
            ],
            [
                10043,
                10088
            ],
            [
                10093,
                10099
            ],
            [
                10100,
                10108
            ],
            [
                10108,
                10136
            ],
            [
                10137,
                10149
            ],
            [
                10150,
                10185
            ],
            [
                10185,
                10216
            ],
            [
                10216,
                10275
            ],
            [
                10281,
                10296
            ],
            [
                10296,
                10340
            ],
            [
                10341,
                10353
            ],
            [
                10360,
                10411
            ],
            [
                10412,
                10423
            ],
            [
                10423,
                10432
            ],
            [
                10433,
                10459
            ],
            [
                10459,
                10517
            ],
            [
                10517,
                10518
            ],
            [
                10519,
                10521
            ],
            [
                10537,
                10539
            ],
            [
                10539,
                10576
            ],
            [
                10585,
                10644
            ],
            [
                10645,
                10703
            ],
            [
                10710,
                10734
            ],
            [
                10735,
                10750
            ],
            [
                10751,
                10767
            ],
            [
                10767,
                10794
            ],
            [
                10795,
                10803
            ],
            [
                10809,
                10820
            ],
            [
                10826,
                10859
            ],
            [
                10865,
                10981
            ],
            [
                10981,
                11033
            ],
            [
                11034,
                11157
            ],
            [
                11157,
                11159
            ],
            [
                11159,
                11228
            ],
            [
                11229,
                11244
            ],
            [
                11244,
                11319
            ],
            [
                11320,
                11338
            ],
            [
                11346,
                11359
            ],
            [
                11360,
                11393
            ],
            [
                11393,
                11496
            ],
            [
                11496,
                11556
            ],
            [
                11556,
                11588
            ],
            [
                11589,
                11635
            ],
            [
                11636,
                11677
            ],
            [
                11677,
                11787
            ],
            [
                11795,
                11797
            ],
            [
                11797,
                11835
            ],
            [
                11835,
                11884
            ],
            [
                11889,
                11913
            ],
            [
                11914,
                11919
            ],
            [
                11920,
                11943
            ],
            [
                11943,
                11981
            ],
            [
                11981,
                11983
            ],
            [
                11983,
                12009
            ],
            [
                12010,
                12020
            ],
            [
                12020,
                12079
            ],
            [
                12081,
                12084
            ],
            [
                12085,
                12090
            ],
            [
                12096,
                12105
            ],
            [
                12109,
                12142
            ],
            [
                12147,
                12183
            ],
            [
                12184,
                12188
            ],
            [
                12189,
                12192
            ],
            [
                12198,
                12199
            ]
        ],
        "row_chars": [
            [
                0,
                104
            ],
            [
                104,
                104
            ],
            [
                104,
                104
            ],
            [
                104,
                171
            ],
            [
                171,
                171
            ],
            [
                171,
                249
            ],
            [
                249,
                291
            ],
            [
                291,
                321
            ],
            [
                321,
                355
            ],
            [
                355,
                430
            ],
            [
                430,
                500
            ],
            [
                500,
                558
            ],
            [
                558,
                679
            ],
            [
                679,
                731
            ],
            [
                731,
                759
            ],
            [
                759,
                785
            ],
            [
                785,
                797
            ],
            [
                797,
                854
            ],
            [
                854,
                960
            ],
            [
                960,
                1033
            ],
            [
                1033,
                1049
            ],
            [
                1049,
                1068
            ],
            [
                1068,
                1120
            ],
            [
                1120,
                1154
            ],
            [
                1154,
                1190
            ],
            [
                1190,
                1200
            ],
            [
                1200,
                1263
            ],
            [
                1263,
                1289
            ],
            [
                1289,
                1332
            ],
            [
                1332,
                1386
            ],
            [
                1386,
                1473
            ],
            [
                1473,
                1561
            ],
            [
                1561,
                1728
            ],
            [
                1728,
                1784
            ],
            [
                1784,
                1784
            ],
            [
                1784,
                1784
            ],
            [
                1784,
                1784
            ],
            [
                1784,
                1819
            ],
            [
                1819,
                1830
            ],
            [
                1830,
                1846
            ],
            [
                1846,
                1937
            ],
            [
                1937,
                2020
            ],
            [
                2020,
                2073
            ],
            [
                2073,
                2088
            ],
            [
                2088,
                2105
            ],
            [
                2105,
                2176
            ],
            [
                2176,
                2213
            ],
            [
                2213,
                2404
            ],
            [
                2404,
                2404
            ],
            [
                2404,
                2404
            ],
            [
                2404,
                2404
            ],
            [
                2404,
                2434
            ],
            [
                2434,
                2434
            ],
            [
                2434,
                2504
            ],
            [
                2504,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2547
            ],
            [
                2547,
                2666
            ],
            [
                2666,
                2701
            ],
            [
                2701,
                2816
            ],
            [
                2816,
                2914
            ],
            [
                2914,
                3014
            ],
            [
                3014,
                3014
            ],
            [
                3014,
                3101
            ],
            [
                3101,
                3145
            ],
            [
                3145,
                3231
            ],
            [
                3231,
                3231
            ],
            [
                3231,
                3231
            ],
            [
                3231,
                3231
            ],
            [
                3231,
                3231
            ],
            [
                3231,
                3347
            ],
            [
                3347,
                3420
            ],
            [
                3420,
                3483
            ],
            [
                3483,
                3536
            ],
            [
                3536,
                3636
            ],
            [
                3636,
                3733
            ],
            [
                3733,
                3733
            ],
            [
                3733,
                3733
            ],
            [
                3733,
                3756
            ],
            [
                3756,
                3802
            ],
            [
                3802,
                3897
            ],
            [
                3897,
                3911
            ],
            [
                3911,
                3933
            ],
            [
                3933,
                4047
            ],
            [
                4047,
                4047
            ],
            [
                4047,
                4118
            ],
            [
                4118,
                4118
            ],
            [
                4118,
                4118
            ],
            [
                4118,
                4118
            ],
            [
                4118,
                4147
            ],
            [
                4147,
                4147
            ],
            [
                4147,
                4165
            ],
            [
                4165,
                4212
            ],
            [
                4212,
                4254
            ],
            [
                4254,
                4267
            ],
            [
                4267,
                4267
            ],
            [
                4267,
                4341
            ],
            [
                4341,
                4427
            ],
            [
                4427,
                4448
            ],
            [
                4448,
                4448
            ],
            [
                4448,
                4510
            ],
            [
                4510,
                4563
            ],
            [
                4563,
                4593
            ],
            [
                4593,
                4593
            ],
            [
                4593,
                4593
            ],
            [
                4593,
                4593
            ],
            [
                4593,
                4646
            ],
            [
                4646,
                4670
            ],
            [
                4670,
                4690
            ],
            [
                4690,
                4690
            ],
            [
                4690,
                4782
            ],
            [
                4782,
                4868
            ],
            [
                4868,
                4924
            ],
            [
                4924,
                4924
            ],
            [
                4924,
                5006
            ],
            [
                5006,
                5045
            ],
            [
                5045,
                5098
            ],
            [
                5098,
                5098
            ],
            [
                5098,
                5130
            ],
            [
                5130,
                5173
            ],
            [
                5173,
                5221
            ],
            [
                5221,
                5249
            ],
            [
                5249,
                5305
            ],
            [
                5305,
                5354
            ],
            [
                5354,
                5419
            ],
            [
                5419,
                5523
            ],
            [
                5523,
                5653
            ],
            [
                5653,
                5735
            ],
            [
                5735,
                5866
            ],
            [
                5866,
                5866
            ],
            [
                5866,
                5866
            ],
            [
                5866,
                5866
            ],
            [
                5866,
                5892
            ],
            [
                5892,
                6027
            ],
            [
                6027,
                6193
            ],
            [
                6193,
                6240
            ],
            [
                6240,
                6299
            ],
            [
                6299,
                6335
            ],
            [
                6335,
                6372
            ],
            [
                6372,
                6372
            ],
            [
                6372,
                6419
            ],
            [
                6419,
                6495
            ],
            [
                6495,
                6495
            ],
            [
                6495,
                6495
            ],
            [
                6495,
                6495
            ],
            [
                6495,
                6612
            ],
            [
                6612,
                6655
            ],
            [
                6655,
                6655
            ],
            [
                6655,
                6761
            ],
            [
                6761,
                6801
            ],
            [
                6801,
                6833
            ],
            [
                6833,
                6892
            ],
            [
                6892,
                6926
            ],
            [
                6926,
                6969
            ],
            [
                6969,
                6969
            ],
            [
                6969,
                6969
            ],
            [
                6969,
                7053
            ],
            [
                7053,
                7053
            ],
            [
                7053,
                7088
            ],
            [
                7088,
                7117
            ],
            [
                7117,
                7143
            ],
            [
                7143,
                7171
            ],
            [
                7171,
                7257
            ],
            [
                7257,
                7321
            ],
            [
                7321,
                7321
            ],
            [
                7321,
                7375
            ],
            [
                7375,
                7435
            ],
            [
                7435,
                7499
            ],
            [
                7499,
                7543
            ],
            [
                7543,
                7578
            ],
            [
                7578,
                7621
            ],
            [
                7621,
                7870
            ],
            [
                7870,
                7984
            ],
            [
                7984,
                8086
            ],
            [
                8086,
                8086
            ],
            [
                8086,
                8211
            ],
            [
                8211,
                8324
            ],
            [
                8324,
                8353
            ],
            [
                8353,
                8353
            ],
            [
                8353,
                8382
            ],
            [
                8382,
                8442
            ],
            [
                8442,
                8442
            ],
            [
                8442,
                8506
            ],
            [
                8506,
                8629
            ],
            [
                8629,
                8629
            ],
            [
                8629,
                8763
            ],
            [
                8763,
                8834
            ],
            [
                8834,
                9020
            ],
            [
                9020,
                9068
            ],
            [
                9068,
                9103
            ],
            [
                9103,
                9171
            ],
            [
                9171,
                9221
            ],
            [
                9221,
                9221
            ],
            [
                9221,
                9221
            ],
            [
                9221,
                9221
            ],
            [
                9221,
                9257
            ],
            [
                9257,
                9257
            ],
            [
                9257,
                9334
            ],
            [
                9334,
                9381
            ],
            [
                9381,
                9392
            ],
            [
                9392,
                9409
            ],
            [
                9409,
                9451
            ],
            [
                9451,
                9491
            ],
            [
                9491,
                9549
            ],
            [
                9549,
                9667
            ],
            [
                9667,
                9708
            ],
            [
                9708,
                9708
            ],
            [
                9708,
                9752
            ],
            [
                9752,
                9788
            ],
            [
                9788,
                9922
            ],
            [
                9922,
                10007
            ],
            [
                10007,
                10043
            ],
            [
                10043,
                10108
            ],
            [
                10108,
                10137
            ],
            [
                10137,
                10216
            ],
            [
                10216,
                10296
            ],
            [
                10296,
                10423
            ],
            [
                10423,
                10459
            ],
            [
                10459,
                10519
            ],
            [
                10519,
                10519
            ],
            [
                10519,
                10703
            ],
            [
                10703,
                10767
            ],
            [
                10767,
                10981
            ],
            [
                10981,
                11159
            ],
            [
                11159,
                11159
            ],
            [
                11159,
                11244
            ],
            [
                11244,
                11360
            ],
            [
                11360,
                11360
            ],
            [
                11360,
                11360
            ],
            [
                11360,
                11393
            ],
            [
                11393,
                11496
            ],
            [
                11496,
                11556
            ],
            [
                11556,
                11677
            ],
            [
                11677,
                11797
            ],
            [
                11797,
                11835
            ],
            [
                11835,
                11943
            ],
            [
                11943,
                11983
            ],
            [
                11983,
                12020
            ],
            [
                12020,
                12142
            ],
            [
                12142,
                12199
            ]
        ]
    }
}