{
    "original": {
        "text": "\"I have half a mind to go back to-morrow morning,\" Felix said to his mother that Sunday evening after dinner. At that moment Roger was walking round the garden by himself, and Henrietta was in her own room.\n\"To-morrow morning, Felix! You are engaged to dine with the Longestaffes!\"\n\"You could make any excuse you like about that.\"\n\"It would be the most uncourteous thing in the world. The Longestaffes you know are the leading people in this part of the country. No one knows what may happen. If you should ever be living at Carbury, how sad it would be that you should have quarrelled with them.\"\n\"You forget, mother, that Dolly Longestaffe is about the most intimate friend I have in the world.\"\n\"That does not justify you in being uncivil to the father and mother. And you should remember what you came here for.\"\n\"What did I come for?\"\n\"That you might see Marie Melmotte more at your ease than you can in their London house.\"\n\"That's all settled,\" said Sir Felix, in the most indifferent tone that he could assume.\n\"Settled!\"\n\"As far as the girl is concerned. I can't very well go to the old fellow for his consent down here.\"\n\"Do you mean to say, Felix, that Marie Melmotte has accepted you?\"\n\"I told you that before.\"\n\"My dear Felix. Oh, my boy!\" In her joy the mother took her unwilling son in her arms and caressed him. Here was the first step taken not only to success, but to such magnificent splendour as should make her son to be envied by all young men, and herself to be envied by all mothers in England! \"No, you didn't tell me before. But I am so happy. Is she really fond of you? I don't wonder that any girl should be fond of you.\"\n\"I can't say anything about that, but I think she means to stick to it.\"\n\"If she is firm, of course her father will give way at last. Fathers always do give way when the girl is firm. Why should he oppose it?\"\n\"I don't know that he will.\"\n\"You are a man of rank, with a title of your own. I suppose what he wants is a gentleman for his girl. I don't see why he should not be perfectly satisfied. With all his enormous wealth a thousand a year or so can't make any difference. And then he made you one of the Directors at his Board. Oh Felix;--it is almost too good to be true.\"\n\"I ain't quite sure that I care very much about being married, you know.\"\n\"Oh, Felix, pray don't say that. Why shouldn't you like being married? She is a very nice girl, and we shall all be so fond of her! Don't let any feeling of that kind come over you; pray don't. You will be able to do just what you please when once the question of her money is settled. Of course you can hunt as often as you like, and you can have a house in any part of London you please. You must understand by this time how very disagreeable it is to have to get on without an established income.\"\n\"I quite understand that.\"\n\"If this were once done you would never have any more trouble of that kind. There would be plenty of money for everything as long as you live. It would be complete success. I don't know how to say enough to you, or to tell you how dearly I love you, or to make you understand how well I think you have done it all.\" Then she caressed him again, and was almost beside herself in an agony of mingled anxiety and joy. If, after all, her beautiful boy, who had lately been her disgrace and her great trouble because of his poverty, should shine forth to the world as a baronet with 20,000 a year, how glorious would it be! She must have known,--she did know,--how poor, how selfish a creature he was. But her gratification at the prospect of his splendour obliterated the sorrow with which the vileness of his character sometimes oppressed her. Were he to win this girl with all her father's money, neither she nor his sister would be the better for it, except in this, that the burden of maintaining him would be taken from her shoulders. But his magnificence would be established. He was her son, and the prospect of his fortune and splendour was sufficient to elate her into a very heaven of beautiful dreams. \"But, Felix,\" she continued, \"you really must stay and go to the Longestaffes' to-morrow. It will only be one day.--And now were you to run away--\"\n\"Run away! What nonsense you talk.\"\n\"If you were to start back to London at once I mean, it would be an affront to her, and the very thing to set Melmotte against you. You should lay yourself out to please him;--indeed you should.\"\n\"Oh, bother!\" said Sir Felix. But nevertheless he allowed himself to be persuaded to remain. The matter was important even to him, and he consented to endure the almost unendurable nuisance of spending another day at the Manor House. Lady Carbury, almost lost in delight, did not know where to turn for sympathy. If her cousin were not so stiff, so pig-headed, so wonderfully ignorant of the affairs of the world, he would have at any rate consented to rejoice with her. Though he might not like Felix,--who, as his mother admitted to herself, had been rude to her cousin,--he would have rejoiced for the sake of the family. But, as it was, she did not dare to tell him. He would have received her tidings with silent scorn. And even Henrietta would not be enthusiastic. She felt that though she would have delighted to expatiate on this great triumph, she must be silent at present. It should now be her great effort to ingratiate herself with Mr. Melmotte at the dinner party at Caversham.\nDuring the whole of that evening Roger Carbury hardly spoke to his cousin Hetta. There was not much conversation between them till quite late, when Father Barham came in for supper. He had been over at Bungay among his people there, and had walked back, taking Carbury on the way. \"What did you think of our bishop?\" Roger asked him, rather imprudently.\n\"Not much of him as a bishop. I don't doubt that he makes a very nice lord, and that he does more good among his neighbours than an average lord. But you don't put power or responsibility into the hands of any one sufficient to make him a bishop.\"\n\"Nine-tenths of the clergy in the diocese would be guided by him in any matter of clerical conduct which might come before him.\"\n\"Because they know that he has no strong opinion of his own, and would not therefore desire to dominate theirs. Take any of your bishops that has an opinion,--if there be one left,--and see how far your clergy consent to his teaching!\" Roger turned round and took up his book. He was already becoming tired of his pet priest. He himself always abstained from saying a word derogatory to his new friend's religion in the man's hearing; but his new friend did not by any means return the compliment. Perhaps also Roger felt that were he to take up the cudgels for an argument he might be worsted in the combat, as in such combats success is won by practised skill rather than by truth. Henrietta was also reading, and Felix was smoking elsewhere,--wondering whether the hours would ever wear themselves away in that castle of dulness, in which no cards were to be seen, and where, except at meal-times, there was nothing to drink. But Lady Carbury was quite willing to allow the priest to teach her that all appliances for the dissemination of religion outside his own church must be naught.\n\"I suppose our bishops are sincere in their beliefs,\" she said with her sweetest smile.\n\"I'm sure I hope so. I have no possible reason to doubt it as to the two or three whom I have seen,--nor indeed as to all the rest whom I have not seen.\"\n\"They are so much respected everywhere as good and pious men!\"\n\"I do not doubt it. Nothing tends so much to respect as a good income. But they may be excellent men without being excellent bishops. I find no fault with them, but much with the system by which they are controlled. Is it probable that a man should be fitted to select guides for other men's souls because he has succeeded by infinite labour in his vocation in becoming the leader of a majority in the House of Commons?\"\n\"Indeed, no,\" said Lady Carbury, who did not in the least understand the nature of the question put to her.\n\"And when you've got your bishop, is it likely that a man should be able to do his duty in that capacity who has no power of his own to decide whether a clergyman under him is or is not fit for his duty?\"\n\"Hardly, indeed.\"\n\"The English people, or some of them,--that some being the richest, and, at present, the most powerful,--like to play at having a Church, though there is not sufficient faith in them to submit to the control of a Church.\"\n\"Do you think men should be controlled by clergymen, Mr. Barham?\"\n\"In matters of faith I do; and so, I suppose, do you; at least you make that profession. You declare it to be your duty to submit yourself to your spiritual pastors and masters.\"\n\"That, I thought, was for children,\" said Lady Carbury. \"The clergyman, in the catechism, says, 'My good child.'\"\n\"It is what you were taught as a child before you had made profession of your faith to a bishop, in order that you might know your duty when you had ceased to be a child. I quite agree, however, that the matter, as viewed by your Church, is childish altogether, and intended only for children. As a rule, adults with you want no religion.\"\n\"I am afraid that is true of a great many.\"\n\"It is marvellous to me that, when a man thinks of it, he should not be driven by very fear to the comforts of a safer faith,--unless, indeed, he enjoy the security of absolute infidelity.\"\n\"That is worse than anything,\" said Lady Carbury with a sigh and a shudder.\n\"I don't know that it is worse than a belief which is no belief,\" said the priest with energy;--\"than a creed which sits so easily on a man that he does not even know what it contains, and never asks himself as he repeats it, whether it be to him credible or incredible.\"\n\"That is very bad,\" said Lady Carbury.\n\"We're getting too deep, I think,\" said Roger, putting down the book which he had in vain been trying to read.\n\"I think it is so pleasant to have a little serious conversation on Sunday evening,\" said Lady Carbury. The priest drew himself back into his chair and smiled. He was quite clever enough to understand that Lady Carbury had been talking nonsense, and clever enough also to be aware of the cause of Roger's uneasiness. But Lady Carbury might be all the easier converted because she understood nothing and was fond of ambitious talking; and Roger Carbury might possibly be forced into conviction by the very feeling which at present made him unwilling to hear arguments.\n\"I don't like hearing my Church ill-spoken of,\" said Roger.\n\"You wouldn't like me if I thought ill of it and spoke well of it,\" said the priest.\n\"And, therefore, the less said the sooner mended,\" said Roger, rising from his chair. Upon this Father Barham took his departure and walked away to Beccles. It might be that he had sowed some seed. It might be that he had, at any rate, ploughed some ground. Even the attempt to plough the ground was a good work which would not be forgotten.\nThe following morning was the time on which Roger had fixed for repeating his suit to Henrietta. He had determined that it should be so, and though the words had been almost on his tongue during that Sunday afternoon, he had repressed them because he would do as he had determined. He was conscious, almost painfully conscious, of a certain increase of tenderness in his cousin's manner towards him. All that pride of independence, which had amounted almost to roughness, when she was in London, seemed to have left her. When he greeted her morning and night, she looked softly into his face. She cherished the flowers which he gave her. He could perceive that if he expressed the slightest wish in any matter about the house she would attend to it. There had been a word said about punctuality, and she had become punctual as the hand of the clock. There was not a glance of her eye, nor a turn of her hand, that he did not watch, and calculate its effect as regarded himself. But because she was tender to him and observant, he did not by any means allow himself to believe that her heart was growing into love for him. He thought that he understood the working of her mind. She could see how great was his disgust at her brother's doings; how fretted he was by her mother's conduct. Her grace, and sweetness, and sense, took part with him against those who were nearer to herself, and therefore,--in pity,--she was kind to him. It was thus he read it, and he read it almost with exact accuracy.\n\"Hetta,\" he said after breakfast, \"come out into the garden awhile.\"\n\"Are not you going to the men?\"\n\"Not yet, at any rate. I do not always go to the men as you call it.\" She put on her hat and tripped out with him, knowing well that she had been summoned to hear the old story. She had been sure, as soon as she found the white rose in her room, that the old story would be repeated again before she left Carbury;--and, up to this time, she had hardly made up her mind what answer she would give to it. That she could not take his offer, she thought she did know. She knew well that she loved the other man. That other man had never asked her for her love, but she thought that she knew that he desired it. But in spite of all this there had in truth grown up in her bosom a feeling of tenderness towards her cousin so strong that it almost tempted her to declare to herself that he ought to have what he wanted, simply because he wanted it. He was so good, so noble, so generous, so devoted, that it almost seemed to her that she could not be justified in refusing him. And she had gone entirely over to his side in regard to the Melmottes. Her mother had talked to her of the charm of Mr. Melmotte's money, till her very heart had been sickened. There was nothing noble there; but, as contrasted with that, Roger's conduct and bearing were those of a fine gentleman who knew neither fear nor shame. Should such a one be doomed to pine for ever because a girl could not love him,--a man born to be loved, if nobility and tenderness and truth were lovely!\n\"Hetta,\" he said, \"put your arm here.\" She gave him her arm. \"I was a little annoyed last night by that priest. I want to be civil to him, and now he is always turning against me.\"\n\"He doesn't do any harm, I suppose?\"\n\"He does do harm if he teaches you and me to think lightly of those things which we have been brought up to revere.\" So, thought Henrietta, it isn't about love this time; it's only about the Church. \"He ought not to say things before my guests as to our way of believing, which I wouldn't under any circumstances say as to his. I didn't quite like your hearing it.\"\n\"I don't think he'll do me any harm. I'm not at all that way given. I suppose they all do it. It's their business.\"\n\"Poor fellow! I brought him here just because I thought it was a pity that a man born and bred like a gentleman should never see the inside of a comfortable house.\"\n\"I liked him;--only I didn't like his saying stupid things about the bishop.\"\n\"And I like him.\" Then there was a pause. \"I suppose your brother does not talk to you much about his own affairs.\"\n\"His own affairs, Roger? Do you mean money? He never says a word to me about money.\"\n\"I meant about the Melmottes.\"\n\"No; not to me. Felix hardly ever speaks to me about anything.\"\n\"I wonder whether she has accepted him.\"\n\"I think she very nearly did accept him in London.\"\n\"I can't quite sympathise with your mother in all her feelings about this marriage, because I do not think that I recognise as she does the necessity of money.\"\n\"Felix is so disposed to be extravagant.\"\n\"Well; yes. But I was going to say that though I cannot bring myself to say anything to encourage her about this heiress, I quite recognise her unselfish devotion to his interests.\"\n\"Mamma thinks more of him than of anything,\" said Hetta, not in the least intending to accuse her mother of indifference to herself.\n\"I know it; and though I happen to think myself that her other child would better repay her devotion,\"--this he said, looking up to Hetta and smiling,--\"I quite feel how good a mother she is to Felix. You know, when she first came the other day we almost had a quarrel.\"\n\"I felt that there was something unpleasant.\"\n\"And then Felix coming after his time put me out. I am getting old and cross, or I should not mind such things.\"\n\"I think you are so good,--and so kind.\" As she said this she leaned upon his arm almost as though she meant to tell him that she loved him.\n\"I have been angry with myself,\" he said, \"and so I am making you my father confessor. Open confession is good for the soul sometimes, and I think that you would understand me better than your mother.\"\n\"I do understand you; but don't think there is any fault to confess.\"\n\"You will not exact any penance?\" She only looked at him and smiled. \"I am going to put a penance on myself all the same. I can't congratulate your brother on his wooing over at Caversham, as I know nothing about it, but I will express some civil wish to him about things in general.\"\n\"Will that be a penance?\"\n\"If you could look into my mind you'd find that it would. I'm full of fretful anger against him for half-a-dozen little frivolous things. Didn't he throw his cigar on the path? Didn't he lie in bed on Sunday instead of going to church?\"\n\"But then he was travelling all the Saturday night.\"\n\"Whose fault was that? But don't you see it is the triviality of the offence which makes the penance necessary. Had he knocked me over the head with a pickaxe, or burned the house down, I should have had a right to be angry. But I was angry because he wanted a horse on Sunday;--and therefore I must do penance.\"\nThere was nothing of love in all this. Hetta, however, did not wish him to talk of love. He was certainly now treating her as a friend,--as a most intimate friend. If he would only do that without making love to her, how happy could she be! But his determination still held good. \"And now,\" said he, altering his tone altogether, \"I must speak about myself.\" Immediately the weight of her hand upon his arm was lessened. Thereupon he put his left hand round and pressed her arm to his. \"No,\" he said; \"do not make any change towards me while I speak to you. Whatever comes of it we shall at any rate be cousins and friends.\"\n\"Always friends!\" she said.\n\"Yes;--always friends. And now listen to me for I have much to say. I will not tell you again that I love you. You know it, or else you must think me the vainest and falsest of men. It is not only that I love you, but I am so accustomed to concern myself with one thing only, so constrained by the habits and nature of my life to confine myself to single interests, that I cannot as it were escape from my love. I am thinking of it always, often despising myself because I think of it so much. For, after all, let a woman be ever so good,--and you to me are all that is good,--a man should not allow his love to dominate his intellect.\"\n\"Oh, no!\"\n\"I do. I calculate my chances within my own bosom almost as a man might calculate his chances of heaven. I should like you to know me just as I am, the weak and the strong together. I would not win you by a lie if I could. I think of you more than I ought to do. I am sure,--quite sure that you are the only possible mistress of this house during my tenure of it. If I am ever to live as other men do, and to care about the things which other men care for, it must be as your husband.\"\n\"Pray,--pray do not say that.\"\n\"Yes; I think that I have a right to say it,--and a right to expect that you should believe me. I will not ask you to be my wife if you do not love me. Not that I should fear aught for myself, but that you should not be pressed to make a sacrifice of yourself because I am your friend and cousin. But I think it is quite possible you might come to love me,--unless your heart be absolutely given away elsewhere.\"\n\"What am I to say?\"\n\"We each of us know of what the other is thinking. If Paul Montague has robbed me of my love--?\"\n\"Mr. Montague has never said a word.\"\n\"If he had, I think he would have wronged me. He met you in my house, and I think must have known what my feelings were towards you.\"\n\"But he never has.\"\n\"We have been like brothers together,--one brother being very much older than the other, indeed; or like father and son. I think he should place his hopes elsewhere.\"\n\"What am I to say? If he have such hope he has not told me. I think it almost cruel that a girl should be asked in that way.\"\n\"Hetta, I should not wish to be cruel to you. Of course I know the way of the world in such matters. I have no right to ask you about Paul Montague,--no right to expect an answer. But it is all the world to me. You can understand that I should think you might learn to love even me, if you loved no one else.\" The tone of his voice was manly, and at the same time full of entreaty. His eyes as he looked at her were bright with love and anxiety. She not only believed him as to the tale which he now told her; but she believed in him altogether. She knew that he was a staff on which a woman might safely lean, trusting to it for comfort and protection in life. In that moment she all but yielded to him. Had he seized her in his arms and kissed her then, I think she would have yielded. She did all but love him. She so regarded him that had it been some other woman that he craved, she would have used every art she knew to have backed his suit, and would have been ready to swear that any woman was a fool who refused him. She almost hated herself because she was unkind to one who so thoroughly deserved kindness. As it was she made him no answer, but continued to walk beside him trembling. \"I thought I would tell it you all, because I wish you to know exactly the state of my mind. I would show you if I could all my heart and all my thoughts about yourself as in a glass case. Do not coy your love for me if you can feel it. When you know, dear, that a man's heart is set upon a woman as mine is set on you, so that it is for you to make his life bright or dark, for you to open or to shut the gates of his earthly Paradise, I think you will be above keeping him in darkness for the sake of a girlish scruple.\"\n\"Oh, Roger!\"\n\"If ever there should come a time in which you can say it truly, remember my truth to you and say it boldly. I at least shall never change. Of course if you love another man and give yourself to him, it will be all over. Tell me that boldly also. I have said it all now. God bless you, my own heart's darling. I hope,--I hope I may be strong enough through it all to think more of your happiness than of my own.\" Then he parted from her abruptly, taking his way over one of the bridges, and leaving her to find her way into the house alone.",
        "paragraph_chars": [
            [
                0,
                207
            ],
            [
                207,
                282
            ],
            [
                282,
                331
            ],
            [
                331,
                598
            ],
            [
                598,
                698
            ],
            [
                698,
                817
            ],
            [
                817,
                840
            ],
            [
                840,
                930
            ],
            [
                930,
                1019
            ],
            [
                1019,
                1030
            ],
            [
                1030,
                1131
            ],
            [
                1131,
                1198
            ],
            [
                1198,
                1224
            ],
            [
                1224,
                1650
            ],
            [
                1650,
                1723
            ],
            [
                1723,
                1860
            ],
            [
                1860,
                1889
            ],
            [
                1889,
                2228
            ],
            [
                2228,
                2302
            ],
            [
                2302,
                2803
            ],
            [
                2803,
                2830
            ],
            [
                2830,
                4187
            ],
            [
                4187,
                4223
            ],
            [
                4223,
                4419
            ],
            [
                4419,
                5411
            ],
            [
                5411,
                5765
            ],
            [
                5765,
                6013
            ],
            [
                6013,
                6142
            ],
            [
                6142,
                7232
            ],
            [
                7232,
                7320
            ],
            [
                7320,
                7474
            ],
            [
                7474,
                7537
            ],
            [
                7537,
                7958
            ],
            [
                7958,
                8066
            ],
            [
                8066,
                8271
            ],
            [
                8271,
                8289
            ],
            [
                8289,
                8511
            ],
            [
                8511,
                8577
            ],
            [
                8577,
                8756
            ],
            [
                8756,
                8870
            ],
            [
                8870,
                9210
            ],
            [
                9210,
                9254
            ],
            [
                9254,
                9444
            ],
            [
                9444,
                9520
            ],
            [
                9520,
                9792
            ],
            [
                9792,
                9831
            ],
            [
                9831,
                9942
            ],
            [
                9942,
                10510
            ],
            [
                10510,
                10570
            ],
            [
                10570,
                10655
            ],
            [
                10655,
                10997
            ],
            [
                10997,
                12495
            ],
            [
                12495,
                12564
            ],
            [
                12564,
                12596
            ],
            [
                12596,
                14052
            ],
            [
                14052,
                14233
            ],
            [
                14233,
                14270
            ],
            [
                14270,
                14636
            ],
            [
                14636,
                14752
            ],
            [
                14752,
                14917
            ],
            [
                14917,
                14995
            ],
            [
                14995,
                15111
            ],
            [
                15111,
                15196
            ],
            [
                15196,
                15227
            ],
            [
                15227,
                15291
            ],
            [
                15291,
                15332
            ],
            [
                15332,
                15384
            ],
            [
                15384,
                15545
            ],
            [
                15545,
                15587
            ],
            [
                15587,
                15769
            ],
            [
                15769,
                15902
            ],
            [
                15902,
                16173
            ],
            [
                16173,
                16219
            ],
            [
                16219,
                16332
            ],
            [
                16332,
                16473
            ],
            [
                16473,
                16675
            ],
            [
                16675,
                16745
            ],
            [
                16745,
                17030
            ],
            [
                17030,
                17056
            ],
            [
                17056,
                17293
            ],
            [
                17293,
                17346
            ],
            [
                17346,
                17659
            ],
            [
                17659,
                18284
            ],
            [
                18284,
                18312
            ],
            [
                18312,
                18949
            ],
            [
                18949,
                18959
            ],
            [
                18959,
                19445
            ],
            [
                19445,
                19476
            ],
            [
                19476,
                19889
            ],
            [
                19889,
                19909
            ],
            [
                19909,
                20006
            ],
            [
                20006,
                20044
            ],
            [
                20044,
                20178
            ],
            [
                20178,
                20198
            ],
            [
                20198,
                20365
            ],
            [
                20365,
                20491
            ],
            [
                20491,
                22210
            ],
            [
                22210,
                22223
            ],
            [
                22223,
                22763
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                207
            ],
            [
                207,
                234
            ],
            [
                234,
                282
            ],
            [
                282,
                331
            ],
            [
                331,
                385
            ],
            [
                385,
                463
            ],
            [
                463,
                493
            ],
            [
                493,
                598
            ],
            [
                598,
                698
            ],
            [
                698,
                768
            ],
            [
                768,
                817
            ],
            [
                817,
                840
            ],
            [
                840,
                930
            ],
            [
                930,
                1019
            ],
            [
                1019,
                1030
            ],
            [
                1030,
                1064
            ],
            [
                1064,
                1131
            ],
            [
                1131,
                1198
            ],
            [
                1198,
                1224
            ],
            [
                1224,
                1240
            ],
            [
                1240,
                1253
            ],
            [
                1253,
                1328
            ],
            [
                1328,
                1519
            ],
            [
                1519,
                1551
            ],
            [
                1551,
                1570
            ],
            [
                1570,
                1597
            ],
            [
                1597,
                1650
            ],
            [
                1650,
                1723
            ],
            [
                1723,
                1784
            ],
            [
                1784,
                1834
            ],
            [
                1834,
                1860
            ],
            [
                1860,
                1889
            ],
            [
                1889,
                1939
            ],
            [
                1939,
                1992
            ],
            [
                1992,
                2046
            ],
            [
                2046,
                2126
            ],
            [
                2126,
                2182
            ],
            [
                2182,
                2228
            ],
            [
                2228,
                2302
            ],
            [
                2302,
                2335
            ],
            [
                2335,
                2373
            ],
            [
                2373,
                2434
            ],
            [
                2434,
                2496
            ],
            [
                2496,
                2588
            ],
            [
                2588,
                2692
            ],
            [
                2692,
                2803
            ],
            [
                2803,
                2830
            ],
            [
                2830,
                2906
            ],
            [
                2906,
                2973
            ],
            [
                2973,
                3003
            ],
            [
                3003,
                3146
            ],
            [
                3146,
                3245
            ],
            [
                3245,
                3449
            ],
            [
                3449,
                3527
            ],
            [
                3527,
                3671
            ],
            [
                3671,
                3866
            ],
            [
                3866,
                3909
            ],
            [
                3909,
                4039
            ],
            [
                4039,
                4129
            ],
            [
                4129,
                4187
            ],
            [
                4187,
                4198
            ],
            [
                4198,
                4223
            ],
            [
                4223,
                4355
            ],
            [
                4355,
                4419
            ],
            [
                4419,
                4433
            ],
            [
                4433,
                4449
            ],
            [
                4449,
                4512
            ],
            [
                4512,
                4653
            ],
            [
                4653,
                4732
            ],
            [
                4732,
                4890
            ],
            [
                4890,
                5044
            ],
            [
                5044,
                5090
            ],
            [
                5090,
                5144
            ],
            [
                5144,
                5190
            ],
            [
                5190,
                5303
            ],
            [
                5303,
                5411
            ],
            [
                5411,
                5492
            ],
            [
                5492,
                5593
            ],
            [
                5593,
                5692
            ],
            [
                5692,
                5728
            ],
            [
                5728,
                5765
            ],
            [
                5765,
                5795
            ],
            [
                5795,
                5911
            ],
            [
                5911,
                6013
            ],
            [
                6013,
                6142
            ],
            [
                6142,
                6254
            ],
            [
                6254,
                6378
            ],
            [
                6378,
                6419
            ],
            [
                6419,
                6468
            ],
            [
                6468,
                6640
            ],
            [
                6640,
                6826
            ],
            [
                6826,
                7071
            ],
            [
                7071,
                7232
            ],
            [
                7232,
                7320
            ],
            [
                7320,
                7341
            ],
            [
                7341,
                7474
            ],
            [
                7474,
                7537
            ],
            [
                7537,
                7557
            ],
            [
                7557,
                7608
            ],
            [
                7608,
                7671
            ],
            [
                7671,
                7753
            ],
            [
                7753,
                7958
            ],
            [
                7958,
                8066
            ],
            [
                8066,
                8271
            ],
            [
                8271,
                8289
            ],
            [
                8289,
                8511
            ],
            [
                8511,
                8577
            ],
            [
                8577,
                8666
            ],
            [
                8666,
                8756
            ],
            [
                8756,
                8812
            ],
            [
                8812,
                8870
            ],
            [
                8870,
                9041
            ],
            [
                9041,
                9164
            ],
            [
                9164,
                9210
            ],
            [
                9210,
                9254
            ],
            [
                9254,
                9444
            ],
            [
                9444,
                9520
            ],
            [
                9520,
                9792
            ],
            [
                9792,
                9831
            ],
            [
                9831,
                9942
            ],
            [
                9942,
                10046
            ],
            [
                10046,
                10102
            ],
            [
                10102,
                10259
            ],
            [
                10259,
                10510
            ],
            [
                10510,
                10570
            ],
            [
                10570,
                10655
            ],
            [
                10655,
                10741
            ],
            [
                10741,
                10812
            ],
            [
                10812,
                10853
            ],
            [
                10853,
                10913
            ],
            [
                10913,
                10997
            ],
            [
                10997,
                11094
            ],
            [
                11094,
                11279
            ],
            [
                11279,
                11397
            ],
            [
                11397,
                11518
            ],
            [
                11518,
                11590
            ],
            [
                11590,
                11635
            ],
            [
                11635,
                11747
            ],
            [
                11747,
                11847
            ],
            [
                11847,
                11975
            ],
            [
                11975,
                12119
            ],
            [
                12119,
                12174
            ],
            [
                12174,
                12283
            ],
            [
                12283,
                12428
            ],
            [
                12428,
                12495
            ],
            [
                12495,
                12564
            ],
            [
                12564,
                12596
            ],
            [
                12596,
                12619
            ],
            [
                12619,
                12666
            ],
            [
                12666,
                12774
            ],
            [
                12774,
                12999
            ],
            [
                12999,
                13060
            ],
            [
                13060,
                13104
            ],
            [
                13104,
                13203
            ],
            [
                13203,
                13438
            ],
            [
                13438,
                13567
            ],
            [
                13567,
                13638
            ],
            [
                13638,
                13744
            ],
            [
                13744,
                13897
            ],
            [
                13897,
                14052
            ],
            [
                14052,
                14091
            ],
            [
                14091,
                14113
            ],
            [
                14113,
                14164
            ],
            [
                14164,
                14233
            ],
            [
                14233,
                14270
            ],
            [
                14270,
                14387
            ],
            [
                14387,
                14469
            ],
            [
                14469,
                14598
            ],
            [
                14598,
                14636
            ],
            [
                14636,
                14673
            ],
            [
                14673,
                14704
            ],
            [
                14704,
                14730
            ],
            [
                14730,
                14752
            ],
            [
                14752,
                14766
            ],
            [
                14766,
                14917
            ],
            [
                14917,
                14995
            ],
            [
                14995,
                15013
            ],
            [
                15013,
                15037
            ],
            [
                15037,
                15111
            ],
            [
                15111,
                15136
            ],
            [
                15136,
                15155
            ],
            [
                15155,
                15196
            ],
            [
                15196,
                15227
            ],
            [
                15227,
                15243
            ],
            [
                15243,
                15291
            ],
            [
                15291,
                15332
            ],
            [
                15332,
                15384
            ],
            [
                15384,
                15545
            ],
            [
                15545,
                15587
            ],
            [
                15587,
                15599
            ],
            [
                15599,
                15769
            ],
            [
                15769,
                15902
            ],
            [
                15902,
                16103
            ],
            [
                16103,
                16173
            ],
            [
                16173,
                16219
            ],
            [
                16219,
                16269
            ],
            [
                16269,
                16332
            ],
            [
                16332,
                16373
            ],
            [
                16373,
                16473
            ],
            [
                16473,
                16560
            ],
            [
                16560,
                16675
            ],
            [
                16675,
                16745
            ],
            [
                16745,
                16779
            ],
            [
                16779,
                16814
            ],
            [
                16814,
                16867
            ],
            [
                16867,
                17030
            ],
            [
                17030,
                17056
            ],
            [
                17056,
                17114
            ],
            [
                17114,
                17194
            ],
            [
                17194,
                17233
            ],
            [
                17233,
                17293
            ],
            [
                17293,
                17346
            ],
            [
                17346,
                17369
            ],
            [
                17369,
                17458
            ],
            [
                17458,
                17571
            ],
            [
                17571,
                17659
            ],
            [
                17659,
                17698
            ],
            [
                17698,
                17748
            ],
            [
                17748,
                17823
            ],
            [
                17823,
                17900
            ],
            [
                17900,
                17939
            ],
            [
                17939,
                18018
            ],
            [
                18018,
                18080
            ],
            [
                18080,
                18145
            ],
            [
                18145,
                18217
            ],
            [
                18217,
                18284
            ],
            [
                18284,
                18302
            ],
            [
                18302,
                18312
            ],
            [
                18312,
                18335
            ],
            [
                18335,
                18380
            ],
            [
                18380,
                18423
            ],
            [
                18423,
                18494
            ],
            [
                18494,
                18724
            ],
            [
                18724,
                18806
            ],
            [
                18806,
                18949
            ],
            [
                18949,
                18959
            ],
            [
                18959,
                18966
            ],
            [
                18966,
                19064
            ],
            [
                19064,
                19141
            ],
            [
                19141,
                19182
            ],
            [
                19182,
                19222
            ],
            [
                19222,
                19323
            ],
            [
                19323,
                19445
            ],
            [
                19445,
                19476
            ],
            [
                19476,
                19572
            ],
            [
                19572,
                19628
            ],
            [
                19628,
                19773
            ],
            [
                19773,
                19889
            ],
            [
                19889,
                19909
            ],
            [
                19909,
                19960
            ],
            [
                19960,
                20006
            ],
            [
                20006,
                20044
            ],
            [
                20044,
                20090
            ],
            [
                20090,
                20178
            ],
            [
                20178,
                20198
            ],
            [
                20198,
                20319
            ],
            [
                20319,
                20365
            ],
            [
                20365,
                20384
            ],
            [
                20384,
                20425
            ],
            [
                20425,
                20491
            ],
            [
                20491,
                20537
            ],
            [
                20537,
                20592
            ],
            [
                20592,
                20671
            ],
            [
                20671,
                20702
            ],
            [
                20702,
                20801
            ],
            [
                20801,
                20873
            ],
            [
                20873,
                20937
            ],
            [
                20937,
                21037
            ],
            [
                21037,
                21153
            ],
            [
                21153,
                21196
            ],
            [
                21196,
                21279
            ],
            [
                21279,
                21305
            ],
            [
                21305,
                21517
            ],
            [
                21517,
                21609
            ],
            [
                21609,
                21687
            ],
            [
                21687,
                21780
            ],
            [
                21780,
                21876
            ],
            [
                21876,
                21924
            ],
            [
                21924,
                22210
            ],
            [
                22210,
                22223
            ],
            [
                22223,
                22332
            ],
            [
                22332,
                22363
            ],
            [
                22363,
                22444
            ],
            [
                22444,
                22470
            ],
            [
                22470,
                22494
            ],
            [
                22494,
                22533
            ],
            [
                22533,
                22636
            ],
            [
                22636,
                22763
            ]
        ],
        "overlap_chars": [
            [
                0,
                30
            ],
            [
                41,
                80
            ],
            [
                88,
                110
            ],
            [
                125,
                196
            ],
            [
                201,
                207
            ],
            [
                207,
                208
            ],
            [
                218,
                234
            ],
            [
                234,
                282
            ],
            [
                282,
                297
            ],
            [
                302,
                308
            ],
            [
                328,
                331
            ],
            [
                331,
                343
            ],
            [
                348,
                364
            ],
            [
                383,
                385
            ],
            [
                385,
                401
            ],
            [
                411,
                463
            ],
            [
                768,
                771
            ],
            [
                783,
                791
            ],
            [
                797,
                810
            ],
            [
                856,
                930
            ],
            [
                930,
                1019
            ],
            [
                1019,
                1030
            ],
            [
                1030,
                1064
            ],
            [
                1064,
                1131
            ],
            [
                1131,
                1198
            ],
            [
                1198,
                1224
            ],
            [
                1224,
                1240
            ],
            [
                1240,
                1253
            ],
            [
                1253,
                1309
            ],
            [
                1326,
                1328
            ],
            [
                1328,
                1412
            ],
            [
                1482,
                1519
            ],
            [
                1555,
                1570
            ],
            [
                1570,
                1597
            ],
            [
                1597,
                1650
            ],
            [
                1650,
                1651
            ],
            [
                1688,
                1723
            ],
            [
                1723,
                1784
            ],
            [
                1784,
                1801
            ],
            [
                1832,
                1834
            ],
            [
                1834,
                1857
            ],
            [
                1890,
                1925
            ],
            [
                1937,
                1939
            ],
            [
                1939,
                1948
            ],
            [
                1954,
                1962
            ],
            [
                1966,
                1992
            ],
            [
                1992,
                2046
            ],
            [
                2046,
                2126
            ],
            [
                2126,
                2153
            ],
            [
                2171,
                2174
            ],
            [
                2158,
                2167
            ],
            [
                2180,
                2182
            ],
            [
                2182,
                2190
            ],
            [
                2193,
                2228
            ],
            [
                2228,
                2236
            ],
            [
                2243,
                2302
            ],
            [
                2302,
                2335
            ],
            [
                2335,
                2373
            ],
            [
                2373,
                2410
            ],
            [
                2415,
                2434
            ],
            [
                2496,
                2539
            ],
            [
                2545,
                2553
            ],
            [
                2570,
                2588
            ],
            [
                2588,
                2692
            ],
            [
                2906,
                2951
            ],
            [
                2971,
                2973
            ],
            [
                3003,
                3019
            ],
            [
                3045,
                3079
            ],
            [
                3106,
                3145
            ],
            [
                3146,
                3167
            ],
            [
                3173,
                3174
            ],
            [
                3183,
                3245
            ],
            [
                3245,
                3247
            ],
            [
                3260,
                3319
            ],
            [
                3326,
                3333
            ],
            [
                3356,
                3449
            ],
            [
                3449,
                3468
            ],
            [
                3471,
                3483
            ],
            [
                3486,
                3527
            ],
            [
                3527,
                3530
            ],
            [
                3552,
                3593
            ],
            [
                3531,
                3534
            ],
            [
                3598,
                3604
            ],
            [
                3549,
                3551
            ],
            [
                3632,
                3645
            ],
            [
                3669,
                3671
            ],
            [
                3995,
                4038
            ],
            [
                4039,
                4089
            ],
            [
                4090,
                4117
            ],
            [
                4127,
                4129
            ],
            [
                4129,
                4152
            ],
            [
                4224,
                4267
            ],
            [
                4274,
                4355
            ],
            [
                4355,
                4365
            ],
            [
                4383,
                4397
            ],
            [
                4406,
                4419
            ],
            [
                4419,
                4433
            ],
            [
                4433,
                4449
            ],
            [
                4466,
                4468
            ],
            [
                4523,
                4526
            ],
            [
                4491,
                4510
            ],
            [
                4548,
                4553
            ],
            [
                4570,
                4580
            ],
            [
                4600,
                4652
            ],
            [
                4653,
                4703
            ],
            [
                4710,
                4712
            ],
            [
                4730,
                4732
            ],
            [
                4732,
                4757
            ],
            [
                4768,
                4782
            ],
            [
                4795,
                4810
            ],
            [
                4819,
                4846
            ],
            [
                5007,
                5015
            ],
            [
                4880,
                4888
            ],
            [
                5016,
                5044
            ],
            [
                5044,
                5047
            ],
            [
                5060,
                5090
            ],
            [
                5148,
                5190
            ],
            [
                5272,
                5290
            ],
            [
                5301,
                5302
            ],
            [
                5431,
                5490
            ],
            [
                5537,
                5593
            ],
            [
                5593,
                5636
            ],
            [
                5642,
                5647
            ],
            [
                5652,
                5663
            ],
            [
                5672,
                5679
            ],
            [
                5690,
                5691
            ],
            [
                5692,
                5728
            ],
            [
                5728,
                5765
            ],
            [
                5765,
                5795
            ],
            [
                5795,
                5839
            ],
            [
                5909,
                5911
            ],
            [
                6166,
                6202
            ],
            [
                6310,
                6312
            ],
            [
                6234,
                6236
            ],
            [
                6363,
                6366
            ],
            [
                6345,
                6351
            ],
            [
                6378,
                6419
            ],
            [
                6419,
                6468
            ],
            [
                6468,
                6500
            ],
            [
                6529,
                6603
            ],
            [
                6617,
                6640
            ],
            [
                6640,
                6668
            ],
            [
                6716,
                6724
            ],
            [
                6707,
                6715
            ],
            [
                6749,
                6826
            ],
            [
                6826,
                6885
            ],
            [
                7069,
                7071
            ],
            [
                7071,
                7128
            ],
            [
                7135,
                7138
            ],
            [
                7230,
                7232
            ],
            [
                7232,
                7320
            ],
            [
                7320,
                7339
            ],
            [
                7474,
                7537
            ],
            [
                7537,
                7538
            ],
            [
                7555,
                7557
            ],
            [
                7608,
                7671
            ],
            [
                7671,
                7753
            ],
            [
                8294,
                8308
            ],
            [
                8394,
                8433
            ],
            [
                8443,
                8463
            ],
            [
                8472,
                8484
            ],
            [
                8500,
                8508
            ],
            [
                8489,
                8496
            ],
            [
                8508,
                8511
            ],
            [
                8511,
                8577
            ],
            [
                8577,
                8643
            ],
            [
                8670,
                8741
            ],
            [
                8753,
                8756
            ],
            [
                8756,
                8811
            ],
            [
                9041,
                9054
            ],
            [
                9065,
                9130
            ],
            [
                9162,
                9164
            ],
            [
                9164,
                9181
            ],
            [
                9191,
                9210
            ],
            [
                9210,
                9254
            ],
            [
                9254,
                9255
            ],
            [
                9278,
                9335
            ],
            [
                9341,
                9348
            ],
            [
                9365,
                9378
            ],
            [
                9381,
                9399
            ],
            [
                9406,
                9444
            ],
            [
                9444,
                9520
            ],
            [
                9520,
                9614
            ],
            [
                9616,
                9635
            ],
            [
                9654,
                9659
            ],
            [
                9709,
                9714
            ],
            [
                9703,
                9708
            ],
            [
                9668,
                9703
            ],
            [
                9789,
                9792
            ],
            [
                9792,
                9831
            ],
            [
                9831,
                9890
            ],
            [
                9895,
                9899
            ],
            [
                9940,
                9942
            ],
            [
                9942,
                10046
            ],
            [
                10046,
                10056
            ],
            [
                10094,
                10102
            ],
            [
                10102,
                10104
            ],
            [
                10143,
                10186
            ],
            [
                10257,
                10259
            ],
            [
                10259,
                10262
            ],
            [
                10276,
                10340
            ],
            [
                10508,
                10510
            ],
            [
                10510,
                10570
            ],
            [
                10570,
                10655
            ],
            [
                10655,
                10741
            ],
            [
                10741,
                10764
            ],
            [
                10800,
                10812
            ],
            [
                10812,
                10851
            ],
            [
                10876,
                10912
            ],
            [
                11041,
                11056
            ],
            [
                11032,
                11034
            ],
            [
                10997,
                11018
            ],
            [
                11057,
                11094
            ],
            [
                11138,
                11184
            ],
            [
                11192,
                11236
            ],
            [
                11277,
                11279
            ],
            [
                11279,
                11285
            ],
            [
                11297,
                11323
            ],
            [
                11325,
                11327
            ],
            [
                11338,
                11397
            ],
            [
                11518,
                11537
            ],
            [
                11555,
                11590
            ],
            [
                11590,
                11635
            ],
            [
                11635,
                11637
            ],
            [
                11653,
                11747
            ],
            [
                11747,
                11811
            ],
            [
                11812,
                11846
            ],
            [
                11975,
                12001
            ],
            [
                12009,
                12034
            ],
            [
                12048,
                12077
            ],
            [
                12088,
                12099
            ],
            [
                12002,
                12004
            ],
            [
                12105,
                12109
            ],
            [
                12114,
                12119
            ],
            [
                12119,
                12148
            ],
            [
                12164,
                12167
            ],
            [
                12172,
                12174
            ],
            [
                12174,
                12283
            ],
            [
                12283,
                12319
            ],
            [
                12330,
                12338
            ],
            [
                12407,
                12428
            ],
            [
                12435,
                12455
            ],
            [
                12474,
                12495
            ],
            [
                12495,
                12564
            ],
            [
                12666,
                12774
            ],
            [
                12774,
                12791
            ],
            [
                12842,
                12909
            ],
            [
                12911,
                12914
            ],
            [
                12933,
                12947
            ],
            [
                12965,
                12991
            ],
            [
                12997,
                12998
            ],
            [
                13060,
                13104
            ],
            [
                13104,
                13134
            ],
            [
                13139,
                13173
            ],
            [
                13188,
                13203
            ],
            [
                13207,
                13218
            ],
            [
                13223,
                13237
            ],
            [
                13247,
                13300
            ],
            [
                13312,
                13351
            ],
            [
                13371,
                13407
            ],
            [
                13436,
                13438
            ],
            [
                13438,
                13510
            ],
            [
                13523,
                13567
            ],
            [
                13897,
                13910
            ],
            [
                13915,
                13975
            ],
            [
                13978,
                14052
            ],
            [
                14052,
                14091
            ],
            [
                14091,
                14113
            ],
            [
                14113,
                14164
            ],
            [
                14164,
                14194
            ],
            [
                14199,
                14233
            ],
            [
                14233,
                14270
            ],
            [
                14270,
                14278
            ],
            [
                14282,
                14300
            ],
            [
                14312,
                14387
            ],
            [
                14387,
                14469
            ],
            [
                14469,
                14489
            ],
            [
                14490,
                14513
            ],
            [
                14596,
                14598
            ],
            [
                14598,
                14606
            ],
            [
                14613,
                14636
            ],
            [
                14636,
                14673
            ],
            [
                14704,
                14730
            ],
            [
                14730,
                14749
            ],
            [
                14918,
                14930
            ],
            [
                14932,
                14995
            ],
            [
                14995,
                15013
            ],
            [
                15013,
                15037
            ],
            [
                15037,
                15096
            ],
            [
                15101,
                15108
            ],
            [
                15197,
                15198
            ],
            [
                15205,
                15227
            ],
            [
                15227,
                15230
            ],
            [
                15241,
                15243
            ],
            [
                15243,
                15291
            ],
            [
                15291,
                15332
            ],
            [
                15332,
                15384
            ],
            [
                15384,
                15466
            ],
            [
                15599,
                15602
            ],
            [
                15709,
                15769
            ],
            [
                15769,
                15829
            ],
            [
                15843,
                15902
            ],
            [
                15902,
                15909
            ],
            [
                15912,
                15942
            ],
            [
                15950,
                16004
            ],
            [
                16011,
                16013
            ],
            [
                16034,
                16039
            ],
            [
                16054,
                16056
            ],
            [
                16068,
                16103
            ],
            [
                16103,
                16112
            ],
            [
                16133,
                16170
            ],
            [
                16220,
                16234
            ],
            [
                16257,
                16269
            ],
            [
                16269,
                16332
            ],
            [
                16332,
                16356
            ],
            [
                16359,
                16373
            ],
            [
                16390,
                16413
            ],
            [
                16471,
                16473
            ],
            [
                16473,
                16560
            ],
            [
                16576,
                16619
            ],
            [
                16625,
                16675
            ],
            [
                16675,
                16680
            ],
            [
                16695,
                16745
            ],
            [
                16814,
                16867
            ],
            [
                16867,
                16933
            ],
            [
                16962,
                17030
            ],
            [
                17030,
                17056
            ],
            [
                17056,
                17114
            ],
            [
                17114,
                17175
            ],
            [
                17186,
                17194
            ],
            [
                17369,
                17372
            ],
            [
                17387,
                17392
            ],
            [
                17397,
                17407
            ],
            [
                17423,
                17458
            ],
            [
                17458,
                17464
            ],
            [
                17509,
                17571
            ],
            [
                17571,
                17623
            ],
            [
                17625,
                17659
            ],
            [
                17659,
                17698
            ],
            [
                17698,
                17703
            ],
            [
                17843,
                17847
            ],
            [
                17823,
                17839
            ],
            [
                17769,
                17793
            ],
            [
                17874,
                17899
            ],
            [
                17900,
                17907
            ],
            [
                17937,
                17939
            ],
            [
                17939,
                17957
            ],
            [
                17987,
                18018
            ],
            [
                18018,
                18080
            ],
            [
                18090,
                18092
            ],
            [
                18121,
                18145
            ],
            [
                18145,
                18183
            ],
            [
                18195,
                18217
            ],
            [
                18217,
                18284
            ],
            [
                18284,
                18302
            ],
            [
                18302,
                18312
            ],
            [
                18312,
                18317
            ],
            [
                18319,
                18335
            ],
            [
                18335,
                18349
            ],
            [
                18378,
                18380
            ],
            [
                18380,
                18423
            ],
            [
                18423,
                18434
            ],
            [
                18492,
                18494
            ],
            [
                18494,
                18529
            ],
            [
                18678,
                18724
            ],
            [
                18724,
                18806
            ],
            [
                18806,
                18809
            ],
            [
                18889,
                18949
            ],
            [
                18949,
                18959
            ],
            [
                18959,
                18966
            ],
            [
                18966,
                18988
            ],
            [
                19009,
                19064
            ],
            [
                19064,
                19141
            ],
            [
                19141,
                19169
            ],
            [
                19180,
                19182
            ],
            [
                19182,
                19222
            ],
            [
                19222,
                19226
            ],
            [
                19234,
                19298
            ],
            [
                19321,
                19323
            ],
            [
                19323,
                19360
            ],
            [
                19416,
                19445
            ],
            [
                19445,
                19451
            ],
            [
                19458,
                19476
            ],
            [
                19476,
                19489
            ],
            [
                19495,
                19519
            ],
            [
                19570,
                19572
            ],
            [
                19572,
                19628
            ],
            [
                19678,
                19706
            ],
            [
                19714,
                19723
            ],
            [
                19727,
                19773
            ],
            [
                19773,
                19832
            ],
            [
                19834,
                19889
            ],
            [
                19889,
                19909
            ],
            [
                19909,
                19960
            ],
            [
                19960,
                20001
            ],
            [
                20003,
                20006
            ],
            [
                20006,
                20044
            ],
            [
                20198,
                20234
            ],
            [
                20293,
                20297
            ],
            [
                20287,
                20293
            ],
            [
                20298,
                20319
            ],
            [
                20319,
                20365
            ],
            [
                20365,
                20384
            ],
            [
                20405,
                20425
            ],
            [
                20425,
                20491
            ],
            [
                20491,
                20537
            ],
            [
                20592,
                20638
            ],
            [
                20641,
                20671
            ],
            [
                20671,
                20702
            ],
            [
                20726,
                20727
            ],
            [
                20735,
                20801
            ],
            [
                20801,
                20873
            ],
            [
                20873,
                20881
            ],
            [
                20902,
                20937
            ],
            [
                21005,
                21037
            ],
            [
                21037,
                21143
            ],
            [
                21151,
                21152
            ],
            [
                21153,
                21196
            ],
            [
                21196,
                21279
            ],
            [
                21279,
                21305
            ],
            [
                21305,
                21308
            ],
            [
                21443,
                21488
            ],
            [
                21500,
                21515
            ],
            [
                21489,
                21499
            ],
            [
                21515,
                21517
            ],
            [
                21517,
                21609
            ],
            [
                21609,
                21686
            ],
            [
                21687,
                21688
            ],
            [
                21731,
                21778
            ],
            [
                21721,
                21722
            ],
            [
                21718,
                21721
            ],
            [
                21874,
                21876
            ],
            [
                21924,
                21966
            ],
            [
                22007,
                22009
            ],
            [
                21967,
                21983
            ],
            [
                22005,
                22006
            ],
            [
                22015,
                22122
            ],
            [
                22124,
                22125
            ],
            [
                22126,
                22140
            ],
            [
                22158,
                22210
            ],
            [
                22210,
                22223
            ],
            [
                22223,
                22280
            ],
            [
                22286,
                22287
            ],
            [
                22317,
                22332
            ],
            [
                22332,
                22363
            ],
            [
                22363,
                22444
            ],
            [
                22444,
                22470
            ],
            [
                22470,
                22494
            ],
            [
                22494,
                22533
            ],
            [
                22533,
                22539
            ],
            [
                22549,
                22571
            ],
            [
                22587,
                22635
            ],
            [
                22636,
                22669
            ],
            [
                22690,
                22763
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                207
            ],
            [
                207,
                234
            ],
            [
                234,
                282
            ],
            [
                282,
                331
            ],
            [
                331,
                385
            ],
            [
                385,
                463
            ],
            [
                463,
                493
            ],
            [
                493,
                598
            ],
            [
                598,
                698
            ],
            [
                698,
                768
            ],
            [
                768,
                930
            ],
            [
                930,
                1019
            ],
            [
                1019,
                1030
            ],
            [
                1030,
                1064
            ],
            [
                1064,
                1131
            ],
            [
                1131,
                1198
            ],
            [
                1198,
                1224
            ],
            [
                1224,
                1240
            ],
            [
                1240,
                1253
            ],
            [
                1253,
                1328
            ],
            [
                1328,
                1519
            ],
            [
                1519,
                1551
            ],
            [
                1551,
                1570
            ],
            [
                1570,
                1597
            ],
            [
                1597,
                1650
            ],
            [
                1650,
                1723
            ],
            [
                1723,
                1784
            ],
            [
                1784,
                1834
            ],
            [
                1834,
                1860
            ],
            [
                1860,
                1889
            ],
            [
                1889,
                1939
            ],
            [
                1939,
                1992
            ],
            [
                1992,
                2046
            ],
            [
                2046,
                2126
            ],
            [
                2126,
                2182
            ],
            [
                2182,
                2228
            ],
            [
                2228,
                2302
            ],
            [
                2302,
                2335
            ],
            [
                2335,
                2373
            ],
            [
                2373,
                2434
            ],
            [
                2434,
                2496
            ],
            [
                2496,
                2588
            ],
            [
                2588,
                2692
            ],
            [
                2692,
                2803
            ],
            [
                2803,
                2830
            ],
            [
                2830,
                2906
            ],
            [
                2906,
                2973
            ],
            [
                2973,
                3003
            ],
            [
                3003,
                3146
            ],
            [
                3146,
                3245
            ],
            [
                3245,
                3449
            ],
            [
                3449,
                3527
            ],
            [
                3527,
                3671
            ],
            [
                3671,
                3866
            ],
            [
                3866,
                3909
            ],
            [
                3909,
                4039
            ],
            [
                4039,
                4129
            ],
            [
                4129,
                4187
            ],
            [
                4187,
                4198
            ],
            [
                4198,
                4223
            ],
            [
                4223,
                4355
            ],
            [
                4355,
                4419
            ],
            [
                4419,
                4433
            ],
            [
                4433,
                4449
            ],
            [
                4449,
                4653
            ],
            [
                4653,
                4732
            ],
            [
                4732,
                5044
            ],
            [
                5044,
                5090
            ],
            [
                5090,
                5144
            ],
            [
                5144,
                5190
            ],
            [
                5190,
                5303
            ],
            [
                5303,
                5411
            ],
            [
                5411,
                5593
            ],
            [
                5593,
                5692
            ],
            [
                5692,
                5728
            ],
            [
                5728,
                5765
            ],
            [
                5765,
                5795
            ],
            [
                5795,
                5911
            ],
            [
                5911,
                6013
            ],
            [
                6013,
                6142
            ],
            [
                6142,
                6378
            ],
            [
                6378,
                6419
            ],
            [
                6419,
                6468
            ],
            [
                6468,
                6640
            ],
            [
                6640,
                6826
            ],
            [
                6826,
                7071
            ],
            [
                7071,
                7232
            ],
            [
                7232,
                7320
            ],
            [
                7320,
                7341
            ],
            [
                7341,
                7474
            ],
            [
                7474,
                7537
            ],
            [
                7537,
                7557
            ],
            [
                7557,
                7608
            ],
            [
                7608,
                7671
            ],
            [
                7671,
                7753
            ],
            [
                7753,
                7958
            ],
            [
                7958,
                8066
            ],
            [
                8066,
                8271
            ],
            [
                8271,
                8289
            ],
            [
                8289,
                8511
            ],
            [
                8511,
                8577
            ],
            [
                8577,
                8756
            ],
            [
                8756,
                8812
            ],
            [
                8812,
                8870
            ],
            [
                8870,
                9041
            ],
            [
                9041,
                9164
            ],
            [
                9164,
                9210
            ],
            [
                9210,
                9254
            ],
            [
                9254,
                9444
            ],
            [
                9444,
                9520
            ],
            [
                9520,
                9792
            ],
            [
                9792,
                9831
            ],
            [
                9831,
                9942
            ],
            [
                9942,
                10046
            ],
            [
                10046,
                10102
            ],
            [
                10102,
                10259
            ],
            [
                10259,
                10510
            ],
            [
                10510,
                10570
            ],
            [
                10570,
                10655
            ],
            [
                10655,
                10741
            ],
            [
                10741,
                10812
            ],
            [
                10812,
                10913
            ],
            [
                10913,
                10997
            ],
            [
                10997,
                11094
            ],
            [
                11094,
                11279
            ],
            [
                11279,
                11397
            ],
            [
                11397,
                11518
            ],
            [
                11518,
                11590
            ],
            [
                11590,
                11635
            ],
            [
                11635,
                11747
            ],
            [
                11747,
                11847
            ],
            [
                11847,
                11975
            ],
            [
                11975,
                12119
            ],
            [
                12119,
                12174
            ],
            [
                12174,
                12283
            ],
            [
                12283,
                12428
            ],
            [
                12428,
                12495
            ],
            [
                12495,
                12564
            ],
            [
                12564,
                12596
            ],
            [
                12596,
                12619
            ],
            [
                12619,
                12666
            ],
            [
                12666,
                12774
            ],
            [
                12774,
                12999
            ],
            [
                12999,
                13060
            ],
            [
                13060,
                13104
            ],
            [
                13104,
                13203
            ],
            [
                13203,
                13438
            ],
            [
                13438,
                13567
            ],
            [
                13567,
                13638
            ],
            [
                13638,
                13744
            ],
            [
                13744,
                13897
            ],
            [
                13897,
                14052
            ],
            [
                14052,
                14091
            ],
            [
                14091,
                14113
            ],
            [
                14113,
                14164
            ],
            [
                14164,
                14233
            ],
            [
                14233,
                14270
            ],
            [
                14270,
                14387
            ],
            [
                14387,
                14469
            ],
            [
                14469,
                14598
            ],
            [
                14598,
                14636
            ],
            [
                14636,
                14673
            ],
            [
                14673,
                14704
            ],
            [
                14704,
                14730
            ],
            [
                14730,
                14752
            ],
            [
                14752,
                14766
            ],
            [
                14766,
                14917
            ],
            [
                14917,
                14995
            ],
            [
                14995,
                15013
            ],
            [
                15013,
                15037
            ],
            [
                15037,
                15111
            ],
            [
                15111,
                15136
            ],
            [
                15136,
                15155
            ],
            [
                15155,
                15196
            ],
            [
                15196,
                15227
            ],
            [
                15227,
                15243
            ],
            [
                15243,
                15291
            ],
            [
                15291,
                15332
            ],
            [
                15332,
                15384
            ],
            [
                15384,
                15545
            ],
            [
                15545,
                15587
            ],
            [
                15587,
                15599
            ],
            [
                15599,
                15769
            ],
            [
                15769,
                15902
            ],
            [
                15902,
                16103
            ],
            [
                16103,
                16173
            ],
            [
                16173,
                16219
            ],
            [
                16219,
                16269
            ],
            [
                16269,
                16332
            ],
            [
                16332,
                16373
            ],
            [
                16373,
                16473
            ],
            [
                16473,
                16560
            ],
            [
                16560,
                16675
            ],
            [
                16675,
                16745
            ],
            [
                16745,
                16779
            ],
            [
                16779,
                16814
            ],
            [
                16814,
                16867
            ],
            [
                16867,
                17030
            ],
            [
                17030,
                17056
            ],
            [
                17056,
                17114
            ],
            [
                17114,
                17194
            ],
            [
                17194,
                17233
            ],
            [
                17233,
                17293
            ],
            [
                17293,
                17346
            ],
            [
                17346,
                17369
            ],
            [
                17369,
                17458
            ],
            [
                17458,
                17571
            ],
            [
                17571,
                17659
            ],
            [
                17659,
                17698
            ],
            [
                17698,
                17900
            ],
            [
                17900,
                17939
            ],
            [
                17939,
                18018
            ],
            [
                18018,
                18080
            ],
            [
                18080,
                18145
            ],
            [
                18145,
                18217
            ],
            [
                18217,
                18284
            ],
            [
                18284,
                18302
            ],
            [
                18302,
                18312
            ],
            [
                18312,
                18335
            ],
            [
                18335,
                18380
            ],
            [
                18380,
                18423
            ],
            [
                18423,
                18494
            ],
            [
                18494,
                18724
            ],
            [
                18724,
                18806
            ],
            [
                18806,
                18949
            ],
            [
                18949,
                18959
            ],
            [
                18959,
                18966
            ],
            [
                18966,
                19064
            ],
            [
                19064,
                19141
            ],
            [
                19141,
                19182
            ],
            [
                19182,
                19222
            ],
            [
                19222,
                19323
            ],
            [
                19323,
                19445
            ],
            [
                19445,
                19476
            ],
            [
                19476,
                19572
            ],
            [
                19572,
                19628
            ],
            [
                19628,
                19773
            ],
            [
                19773,
                19889
            ],
            [
                19889,
                19909
            ],
            [
                19909,
                19960
            ],
            [
                19960,
                20006
            ],
            [
                20006,
                20044
            ],
            [
                20044,
                20090
            ],
            [
                20090,
                20178
            ],
            [
                20178,
                20198
            ],
            [
                20198,
                20319
            ],
            [
                20319,
                20365
            ],
            [
                20365,
                20384
            ],
            [
                20384,
                20425
            ],
            [
                20425,
                20491
            ],
            [
                20491,
                20537
            ],
            [
                20537,
                20592
            ],
            [
                20592,
                20671
            ],
            [
                20671,
                20702
            ],
            [
                20702,
                20801
            ],
            [
                20801,
                20873
            ],
            [
                20873,
                20937
            ],
            [
                20937,
                21037
            ],
            [
                21037,
                21153
            ],
            [
                21153,
                21196
            ],
            [
                21196,
                21279
            ],
            [
                21279,
                21305
            ],
            [
                21305,
                21517
            ],
            [
                21517,
                21609
            ],
            [
                21609,
                21687
            ],
            [
                21687,
                21876
            ],
            [
                21876,
                21924
            ],
            [
                21924,
                22210
            ],
            [
                22210,
                22223
            ],
            [
                22223,
                22332
            ],
            [
                22332,
                22363
            ],
            [
                22363,
                22444
            ],
            [
                22444,
                22470
            ],
            [
                22470,
                22494
            ],
            [
                22494,
                22533
            ],
            [
                22533,
                22636
            ],
            [
                22636,
                22763
            ]
        ]
    },
    "abridged": {
        "text": "\"I have half a mind to go back tomorrow morning,\" Felix said to his mother that evening after dinner. Roger was walking round the garden by himself, and Henrietta was in her room.\n\"Tomorrow morning, Felix! You are engaged to dine with the Longestaffes!\"\n\"You could make an excuse.\"\n\"It would be most uncourteous. The Longestaffes are the leading people in this part of the country. And remember why you came here - to see Marie Melmotte more at your ease than you can in their London house.\"\n\"That's all settled,\" said Sir Felix, in the most indifferent tone that he could assume.\n\"Settled!\"\n\"As far as the girl is concerned. I can't very well go to the old fellow for his consent down here.\"\n\"Do you mean to say, Felix, that Marie Melmotte has accepted you?\"\n\"I told you that before.\"\n\"My dear Felix. Oh, my boy!\" In her joy the mother took her unwilling son in her arms. Here was the first step taken not only to success, but to such magnificent splendour that she would be envied by all mothers in England! \"I am so happy. Is she really fond of you? I don't wonder that any girl should be fond of you.\"\n\"I think she means to stick to it.\"\n\"If she is firm, of course her father will give way at last. Fathers always do. Why should he oppose it? You are a man of rank, with a title. I suppose he wants a gentleman for his girl. I don't see why he should not be perfectly satisfied. With all his enormous wealth a thousand a year or so can't make any difference. And then he made you one of his Directors. Oh Felix - it is almost too good to be true.\"\n\"I ain't sure that I care very much about being married, you know.\"\n\"Oh, Felix, pray don't say that. Why shouldn't you like being married? She is a very nice girl, and we shall be so fond of her! You will be able to do just what you please once the money is settled. Of course you can hunt as often as you like, and you can have a house in any part of London you please. There would be plenty of money for everything. I don't know how to tell you how dearly I love you, and how well I think you have done it all.\"\nThen she caressed him, almost beside herself in an agony of mingled anxiety and joy. If her beautiful boy, who had lately been her disgrace and her trouble, should shine forth to the world as a baronet with 20,000 a year, how glorious would it be! She must have known - she did know - how poor, how selfish a creature he was. But the prospect of his splendour obliterated her sorrow at his character. It raised her into a very heaven of beautiful dreams.\n\"But, Felix,\" she continued, \"you really must stay, and go to the Longestaffes' tomorrow. It will only be one day. If you were to start back to London at once, it would be an affront to her, and the very thing to set Melmotte against you. You should try to please him; indeed you should.\"\n\"Oh, bother!\" said Sir Felix. Nevertheless he was persuaded to remain, and endure the nuisance of spending another day at the Manor House.\nLady Carbury, almost lost in delight, did not know who to tell. If her cousin were not so pig-headed, so ignorant of the ways of the world, he would have rejoiced with her for the sake of the family. But she did not dare to tell him. Even Henrietta would not be enthusiastic. She must be silent for now.\nThat evening Roger Carbury hardly spoke to his cousin Hetta till quite late, when Father Barham came in for supper. He had been over at Bungay among his people, and walked back via Carbury.\n\"What did you think of our bishop?\" Roger asked him, rather imprudently.\n\"Not much of him as a bishop. I don't doubt that he makes a very nice lord. He has no strong opinion of his own, so he can hardly be competent to guide his clergy.\"\nRoger turned round and took up his book. He was already becoming tired of his pet priest. He himself always abstained from insulting his new friend's religion in the man's hearing; but his new friend did not return the compliment. Perhaps also Roger felt that he might lose any argument, as in such combats success is won by practised skill rather than by truth. Henrietta was also reading, and Felix was smoking elsewhere. But Lady Carbury was quite willing to allow the priest to put her right.\n\"I suppose our bishops are sincere in their beliefs,\" she said with her sweetest smile.\n\"I'm sure I hope so.\"\n\"They are so much respected everywhere as good and pious men!\"\n\"Indeed. But they may be excellent men without being excellent bishops. I find no fault with them, but much with the system by which they are controlled. English people like to play at having a Church, though they have not sufficient faith to submit to a Church's control.\"\n\"Do you think men should be controlled by clergymen, Mr. Barham?\"\n\"In matters of faith I do; and so, I suppose, do you; at least you declare it to be your duty to submit yourself to your spiritual pastors.\"\n\"That, I thought, was for children,\" said Lady Carbury.\n\"I quite agree that the matter, as viewed by your Church, is childish altogether. As a rule, adults in your Church want no religion.\"\n\"I am afraid that is true of a great many.\"\n\"I marvel that, when a man thinks of it, he should not be driven by fear to a safer faith - unless, indeed, he enjoys the security of absolute infidelity.\"\n\"That is worse than anything,\" said Lady Carbury with a sigh and a shudder.\n\"I don't know that it is worse than a belief which is no belief,\" said the priest with energy; \"than a creed which a man never questions, and does not even know what it contains.\"\n\"That is very bad,\" said Lady Carbury.\n\"We're getting too deep, I think,\" said Roger, putting down his book.\n\"I think it is so pleasant to have a little serious conversation on Sunday evening,\" said Lady Carbury. The priest smiled. He knew that Lady Carbury had been talking nonsense. But she might be all the easier converted because she understood nothing.\n\"I don't like hearing my Church ill-spoken of,\" said Roger.\n\"You wouldn't like me if I thought ill of it and spoke well of it,\" said the priest.\n\"And, therefore, the less said the sooner mended,\" said Roger, rising from his chair. Upon this Father Barham departed to Beccles. It might be that he had sowed some seed; or, at any rate, ploughed some ground.\nRoger had fixed on the following morning for repeating his suit to Henrietta. Though the words had been almost on his tongue that Sunday afternoon, he had repressed them. He was almost painfully conscious of an increase of tenderness in his cousin's manner towards him. When he greeted her, she looked softly into his face. She cherished the flowers which he gave her. He saw that if he expressed the slightest wish in any matter about the house she would attend to it. There had been a word said about punctuality, and she had become as punctual as the hand of the clock.\nBut because she was tender and observant, he did not allow himself to believe that she was growing to love him. He thought that he understood her. She could see how great was his disgust at her brother's doings; how fretted he was by her mother's conduct. Her grace, and sweetness, and sense, made her sympathise with him; she was kind to him. Thus he read it, and with exact accuracy.\n\"Hetta,\" he said after breakfast, \"come out into the garden awhile.\"\nShe put on her hat and tripped out with him, knowing well that she had been summoned to hear the old story. She had been sure that the old story would be repeated again before she left Carbury; and she had hardly decided what answer she would give.\nShe knew well that she loved the other man. That other man had never asked for her love, but she thought that he desired it. In spite of this there had grown up in her bosom a feeling of tenderness towards Roger so strong that it almost tempted her to think that he ought to have what he wanted. He was so good, so noble, so generous, so devoted, that it almost seemed she could not be justified in refusing him. Should such a gentleman be doomed to pine for ever because a girl could not love him - a man born to be loved, if nobility and tenderness and truth were lovely!\n\"Hetta,\" he said, \"put your arm here.\" She gave him her arm. \"I was a little annoyed last night by that priest. I want to be civil to him, and he is always turning against me.\"\n\"He doesn't do any harm, I suppose?\"\n\"He does harm if he teaches us to think lightly of those things which we have been brought up to revere.\" So, thought Henrietta, it isn't about love this time; it's only about the Church. \"He ought not to say such things before my guests. I didn't like your hearing it.\"\n\"I don't think he'll do me any harm. I suppose they all do it. It's their business. I liked him; only I didn't like his saying stupid things about the bishop.\"\n\"And I like him.\" Then there was a pause. \"I suppose your brother does not talk to you much about his affairs. I mean about the Melmottes.\"\n\"No. Felix hardly ever speaks to me about anything.\"\n\"I wonder whether she has accepted him.\"\n\"I think she very nearly did accept him in London.\"\n\"I can't quite sympathise with your mother in all her feelings about this marriage. But I quite recognise her unselfish devotion to his interests.\"\n\"Mamma thinks more of him than of anything,\" said Hetta, not intending to accuse her mother of indifference to herself.\n\"I know; and though I happen to think that her other child would better repay her devotion,\" - he smiled at Hetta - \"I know how good a mother she is to Felix. You know, the other day we almost had a quarrel. And then Felix arriving late put me out. I am getting old and cross, or I should not mind such things.\"\n\"I think you are so good - and so kind.\" She leaned upon his arm.\n\"I have been angry with myself,\" he said, \"and so I am making you my father confessor. Confession is good for the soul sometimes, and I think you would understand me better than your mother.\"\n\"I do; but don't think there is any fault to confess.\"\n\"I am going to put a penance on myself all the same. I can't congratulate your brother on his wooing over at Caversham, but I will express some civil wish to him about things in general.\"\n\"Will that be a penance?\"\n\"If you could look into my mind you'd find that it would. I'm full of fretful anger against him for half-a-dozen little things. But it is their triviality which makes the penance necessary. Had he burned the house down, I should have had a right to be angry. But I was angry because he wanted a horse on Sunday; and therefore I must do penance.\"\nThere was nothing of love in all this. Hetta thought that if he would only continue treating her as a friend, how happy could she be!\nBut his tone altered. \"And now,\" said he, \"I must speak about myself.\" Immediately the weight of her hand upon his arm was lessened. He pressed her arm to his. \"No,\" he said; \"do not make any change while I speak to you. Whatever comes of it we shall at any rate be cousins and friends.\"\n\"Always friends!\" she said.\n\"Yes; always friends. And now listen. I will not tell you again that I love you. You know it. It is not only that I love you, but that I cannot as it were escape from my love. I am thinking of it always, often despising myself because I think of it so much. For a man should not allow his love to dominate his intellect.\"\n\"Oh, no!\"\n\"I do. I calculate my chances almost as a man might calculate his chances of heaven. I should like you to know me just as I am, the weak and the strong together. I would not win you by a lie. I think of you more than I ought to do. I am quite sure that you are the only possible mistress of this house while I live here. If I am ever to live as other men do, it must be as your husband.\"\n\"Pray, do not say that.\"\n\"Yes; I think I have a right to say it. I will not ask you to be my wife if you do not love me. You should not be pressed to sacrifice yourself because I am your friend and cousin. But I think it is quite possible you might come to love me, - unless your heart be absolutely given away elsewhere.\"\n\"What am I to say?\"\n\"We each of us know of what the other is thinking. If Paul Montague has robbed me of my love-?\"\n\"Mr. Montague has never said a word.\"\n\"We have been like brothers together; or indeed like father and son. I think he should place his hopes elsewhere.\"\n\"What am I to say? He has not told me. I think it almost cruel that a girl should be asked in that way.\"\n\"Hetta, I should not wish to be cruel to you. I have no right to ask you about Paul Montague - no right to expect an answer. But it is all the world to me. I think you might learn to love even me, if you loved no one else.\" The tone of his voice was manly, and at the same time full of entreaty. His eyes were bright with love and anxiety. She believed in him altogether. She knew that he was a staff on which a woman might safely lean, trusting to it for comfort and protection.\nIn that moment she all but yielded to him. Had he seized her in his arms and kissed her then, I think she would have yielded. She did all but love him. She would have been ready to swear that any woman who refused him was a fool. She almost hated herself because she was unkind to one who so thoroughly deserved kindness. As it was she made him no answer, but continued to walk beside him trembling.\n\"I wish you to know exactly the state of my mind, to make all transparent. When you know, dear, that a man's heart is so set upon a woman, it is for you to make his life bright or dark, for you to open or to shut the gates of his earthly Paradise. I do not think you will keep him in darkness for the sake of a girlish scruple.\"\n\"Oh, Roger!\"\n\"If ever there should come a time in which you can say it, then say it boldly. I at least shall never change. Of course if you love another man and give yourself to him, it will be all over. Tell me that boldly also. I have said it all now. God bless you, my own heart's darling. I hope - I may be strong enough to think more of your happiness than of my own.\"\nThen he parted from her abruptly, crossing one of the bridges, and leaving her to find her way into the house alone.",
        "paragraph_chars": [
            [
                0,
                180
            ],
            [
                180,
                254
            ],
            [
                254,
                282
            ],
            [
                282,
                492
            ],
            [
                492,
                581
            ],
            [
                581,
                592
            ],
            [
                592,
                693
            ],
            [
                693,
                760
            ],
            [
                760,
                786
            ],
            [
                786,
                1106
            ],
            [
                1106,
                1142
            ],
            [
                1142,
                1552
            ],
            [
                1552,
                1620
            ],
            [
                1620,
                2066
            ],
            [
                2066,
                2521
            ],
            [
                2521,
                2810
            ],
            [
                2810,
                2949
            ],
            [
                2949,
                3253
            ],
            [
                3253,
                3443
            ],
            [
                3443,
                3516
            ],
            [
                3516,
                3681
            ],
            [
                3681,
                4178
            ],
            [
                4178,
                4266
            ],
            [
                4266,
                4288
            ],
            [
                4288,
                4351
            ],
            [
                4351,
                4625
            ],
            [
                4625,
                4691
            ],
            [
                4691,
                4832
            ],
            [
                4832,
                4888
            ],
            [
                4888,
                5022
            ],
            [
                5022,
                5066
            ],
            [
                5066,
                5222
            ],
            [
                5222,
                5298
            ],
            [
                5298,
                5478
            ],
            [
                5478,
                5517
            ],
            [
                5517,
                5587
            ],
            [
                5587,
                5837
            ],
            [
                5837,
                5897
            ],
            [
                5897,
                5982
            ],
            [
                5982,
                6193
            ],
            [
                6193,
                6766
            ],
            [
                6766,
                7152
            ],
            [
                7152,
                7221
            ],
            [
                7221,
                7470
            ],
            [
                7470,
                8044
            ],
            [
                8044,
                8221
            ],
            [
                8221,
                8258
            ],
            [
                8258,
                8529
            ],
            [
                8529,
                8689
            ],
            [
                8689,
                8829
            ],
            [
                8829,
                8882
            ],
            [
                8882,
                8923
            ],
            [
                8923,
                8975
            ],
            [
                8975,
                9123
            ],
            [
                9123,
                9243
            ],
            [
                9243,
                9555
            ],
            [
                9555,
                9621
            ],
            [
                9621,
                9813
            ],
            [
                9813,
                9868
            ],
            [
                9868,
                10056
            ],
            [
                10056,
                10082
            ],
            [
                10082,
                10428
            ],
            [
                10428,
                10562
            ],
            [
                10562,
                10850
            ],
            [
                10850,
                10878
            ],
            [
                10878,
                11200
            ],
            [
                11200,
                11210
            ],
            [
                11210,
                11598
            ],
            [
                11598,
                11623
            ],
            [
                11623,
                11921
            ],
            [
                11921,
                11941
            ],
            [
                11941,
                12037
            ],
            [
                12037,
                12075
            ],
            [
                12075,
                12190
            ],
            [
                12190,
                12295
            ],
            [
                12295,
                12775
            ],
            [
                12775,
                13175
            ],
            [
                13175,
                13504
            ],
            [
                13504,
                13517
            ],
            [
                13517,
                13878
            ],
            [
                13878,
                13994
            ]
        ],
        "segment_chars": [
            [
                0,
                102
            ],
            [
                102,
                180
            ],
            [
                180,
                206
            ],
            [
                206,
                254
            ],
            [
                254,
                282
            ],
            [
                282,
                313
            ],
            [
                313,
                382
            ],
            [
                382,
                492
            ],
            [
                492,
                581
            ],
            [
                581,
                592
            ],
            [
                592,
                626
            ],
            [
                626,
                693
            ],
            [
                693,
                760
            ],
            [
                760,
                786
            ],
            [
                786,
                802
            ],
            [
                802,
                815
            ],
            [
                815,
                873
            ],
            [
                873,
                1010
            ],
            [
                1010,
                1026
            ],
            [
                1026,
                1053
            ],
            [
                1053,
                1106
            ],
            [
                1106,
                1142
            ],
            [
                1142,
                1203
            ],
            [
                1203,
                1222
            ],
            [
                1222,
                1247
            ],
            [
                1247,
                1284
            ],
            [
                1284,
                1329
            ],
            [
                1329,
                1383
            ],
            [
                1383,
                1463
            ],
            [
                1463,
                1506
            ],
            [
                1506,
                1552
            ],
            [
                1552,
                1620
            ],
            [
                1620,
                1653
            ],
            [
                1653,
                1691
            ],
            [
                1691,
                1748
            ],
            [
                1748,
                1819
            ],
            [
                1819,
                1923
            ],
            [
                1923,
                1970
            ],
            [
                1970,
                2066
            ],
            [
                2066,
                2151
            ],
            [
                2151,
                2314
            ],
            [
                2314,
                2392
            ],
            [
                2392,
                2467
            ],
            [
                2467,
                2521
            ],
            [
                2521,
                2611
            ],
            [
                2611,
                2636
            ],
            [
                2636,
                2760
            ],
            [
                2760,
                2810
            ],
            [
                2810,
                2824
            ],
            [
                2824,
                2840
            ],
            [
                2840,
                2949
            ],
            [
                2949,
                3013
            ],
            [
                3013,
                3149
            ],
            [
                3149,
                3183
            ],
            [
                3183,
                3225
            ],
            [
                3225,
                3253
            ],
            [
                3253,
                3369
            ],
            [
                3369,
                3443
            ],
            [
                3443,
                3479
            ],
            [
                3479,
                3516
            ],
            [
                3516,
                3546
            ],
            [
                3546,
                3592
            ],
            [
                3592,
                3681
            ],
            [
                3681,
                3722
            ],
            [
                3722,
                3771
            ],
            [
                3771,
                3912
            ],
            [
                3912,
                4044
            ],
            [
                4044,
                4105
            ],
            [
                4105,
                4178
            ],
            [
                4178,
                4266
            ],
            [
                4266,
                4288
            ],
            [
                4288,
                4351
            ],
            [
                4351,
                4360
            ],
            [
                4360,
                4423
            ],
            [
                4423,
                4505
            ],
            [
                4505,
                4625
            ],
            [
                4625,
                4691
            ],
            [
                4691,
                4832
            ],
            [
                4832,
                4888
            ],
            [
                4888,
                4970
            ],
            [
                4970,
                5022
            ],
            [
                5022,
                5066
            ],
            [
                5066,
                5222
            ],
            [
                5222,
                5298
            ],
            [
                5298,
                5478
            ],
            [
                5478,
                5517
            ],
            [
                5517,
                5587
            ],
            [
                5587,
                5691
            ],
            [
                5691,
                5710
            ],
            [
                5710,
                5763
            ],
            [
                5763,
                5837
            ],
            [
                5837,
                5897
            ],
            [
                5897,
                5982
            ],
            [
                5982,
                6068
            ],
            [
                6068,
                6113
            ],
            [
                6113,
                6193
            ],
            [
                6193,
                6271
            ],
            [
                6271,
                6364
            ],
            [
                6364,
                6463
            ],
            [
                6463,
                6517
            ],
            [
                6517,
                6562
            ],
            [
                6562,
                6663
            ],
            [
                6663,
                6766
            ],
            [
                6766,
                6878
            ],
            [
                6878,
                6913
            ],
            [
                6913,
                7022
            ],
            [
                7022,
                7110
            ],
            [
                7110,
                7152
            ],
            [
                7152,
                7221
            ],
            [
                7221,
                7329
            ],
            [
                7329,
                7470
            ],
            [
                7470,
                7514
            ],
            [
                7514,
                7595
            ],
            [
                7595,
                7766
            ],
            [
                7766,
                7883
            ],
            [
                7883,
                8044
            ],
            [
                8044,
                8083
            ],
            [
                8083,
                8105
            ],
            [
                8105,
                8156
            ],
            [
                8156,
                8221
            ],
            [
                8221,
                8258
            ],
            [
                8258,
                8364
            ],
            [
                8364,
                8446
            ],
            [
                8446,
                8497
            ],
            [
                8497,
                8529
            ],
            [
                8529,
                8566
            ],
            [
                8566,
                8592
            ],
            [
                8592,
                8613
            ],
            [
                8613,
                8689
            ],
            [
                8689,
                8707
            ],
            [
                8707,
                8731
            ],
            [
                8731,
                8800
            ],
            [
                8800,
                8829
            ],
            [
                8829,
                8834
            ],
            [
                8834,
                8882
            ],
            [
                8882,
                8923
            ],
            [
                8923,
                8975
            ],
            [
                8975,
                9059
            ],
            [
                9059,
                9123
            ],
            [
                9123,
                9243
            ],
            [
                9243,
                9402
            ],
            [
                9402,
                9451
            ],
            [
                9451,
                9492
            ],
            [
                9492,
                9555
            ],
            [
                9555,
                9596
            ],
            [
                9596,
                9621
            ],
            [
                9621,
                9708
            ],
            [
                9708,
                9813
            ],
            [
                9813,
                9868
            ],
            [
                9868,
                9921
            ],
            [
                9921,
                10056
            ],
            [
                10056,
                10082
            ],
            [
                10082,
                10140
            ],
            [
                10140,
                10210
            ],
            [
                10210,
                10272
            ],
            [
                10272,
                10341
            ],
            [
                10341,
                10428
            ],
            [
                10428,
                10467
            ],
            [
                10467,
                10562
            ],
            [
                10562,
                10584
            ],
            [
                10584,
                10633
            ],
            [
                10633,
                10695
            ],
            [
                10695,
                10722
            ],
            [
                10722,
                10783
            ],
            [
                10783,
                10850
            ],
            [
                10850,
                10868
            ],
            [
                10868,
                10878
            ],
            [
                10878,
                10900
            ],
            [
                10900,
                10916
            ],
            [
                10916,
                10959
            ],
            [
                10959,
                10972
            ],
            [
                10972,
                11054
            ],
            [
                11054,
                11136
            ],
            [
                11136,
                11200
            ],
            [
                11200,
                11210
            ],
            [
                11210,
                11217
            ],
            [
                11217,
                11295
            ],
            [
                11295,
                11372
            ],
            [
                11372,
                11402
            ],
            [
                11402,
                11442
            ],
            [
                11442,
                11531
            ],
            [
                11531,
                11598
            ],
            [
                11598,
                11623
            ],
            [
                11623,
                11663
            ],
            [
                11663,
                11719
            ],
            [
                11719,
                11804
            ],
            [
                11804,
                11921
            ],
            [
                11921,
                11941
            ],
            [
                11941,
                11992
            ],
            [
                11992,
                12037
            ],
            [
                12037,
                12075
            ],
            [
                12075,
                12144
            ],
            [
                12144,
                12190
            ],
            [
                12190,
                12209
            ],
            [
                12209,
                12229
            ],
            [
                12229,
                12295
            ],
            [
                12295,
                12341
            ],
            [
                12341,
                12420
            ],
            [
                12420,
                12451
            ],
            [
                12451,
                12519
            ],
            [
                12519,
                12591
            ],
            [
                12591,
                12635
            ],
            [
                12635,
                12667
            ],
            [
                12667,
                12775
            ],
            [
                12775,
                12818
            ],
            [
                12818,
                12901
            ],
            [
                12901,
                12927
            ],
            [
                12927,
                13005
            ],
            [
                13005,
                13097
            ],
            [
                13097,
                13175
            ],
            [
                13175,
                13250
            ],
            [
                13250,
                13423
            ],
            [
                13423,
                13504
            ],
            [
                13504,
                13517
            ],
            [
                13517,
                13596
            ],
            [
                13596,
                13627
            ],
            [
                13627,
                13708
            ],
            [
                13708,
                13734
            ],
            [
                13734,
                13758
            ],
            [
                13758,
                13797
            ],
            [
                13797,
                13878
            ],
            [
                13878,
                13994
            ]
        ],
        "overlap_chars": [
            [
                0,
                30
            ],
            [
                40,
                79
            ],
            [
                80,
                102
            ],
            [
                102,
                173
            ],
            [
                174,
                180
            ],
            [
                180,
                181
            ],
            [
                190,
                206
            ],
            [
                206,
                254
            ],
            [
                254,
                269
            ],
            [
                273,
                279
            ],
            [
                279,
                282
            ],
            [
                282,
                294
            ],
            [
                295,
                311
            ],
            [
                311,
                313
            ],
            [
                313,
                329
            ],
            [
                330,
                382
            ],
            [
                382,
                385
            ],
            [
                386,
                394
            ],
            [
                399,
                412
            ],
            [
                418,
                492
            ],
            [
                492,
                581
            ],
            [
                581,
                592
            ],
            [
                592,
                626
            ],
            [
                626,
                693
            ],
            [
                693,
                760
            ],
            [
                760,
                786
            ],
            [
                786,
                802
            ],
            [
                802,
                815
            ],
            [
                815,
                871
            ],
            [
                871,
                873
            ],
            [
                873,
                957
            ],
            [
                973,
                1010
            ],
            [
                1011,
                1026
            ],
            [
                1026,
                1053
            ],
            [
                1053,
                1106
            ],
            [
                1106,
                1107
            ],
            [
                1107,
                1142
            ],
            [
                1142,
                1203
            ],
            [
                1203,
                1220
            ],
            [
                1220,
                1222
            ],
            [
                1222,
                1245
            ],
            [
                1247,
                1282
            ],
            [
                1282,
                1284
            ],
            [
                1284,
                1293
            ],
            [
                1294,
                1302
            ],
            [
                1303,
                1329
            ],
            [
                1329,
                1383
            ],
            [
                1383,
                1463
            ],
            [
                1463,
                1490
            ],
            [
                1491,
                1494
            ],
            [
                1495,
                1504
            ],
            [
                1504,
                1506
            ],
            [
                1506,
                1514
            ],
            [
                1517,
                1552
            ],
            [
                1552,
                1560
            ],
            [
                1561,
                1620
            ],
            [
                1620,
                1653
            ],
            [
                1653,
                1691
            ],
            [
                1691,
                1728
            ],
            [
                1729,
                1748
            ],
            [
                1748,
                1791
            ],
            [
                1792,
                1800
            ],
            [
                1801,
                1819
            ],
            [
                1819,
                1923
            ],
            [
                1923,
                1968
            ],
            [
                1968,
                1970
            ],
            [
                1970,
                1986
            ],
            [
                1987,
                2021
            ],
            [
                2026,
                2065
            ],
            [
                2066,
                2087
            ],
            [
                2087,
                2088
            ],
            [
                2089,
                2151
            ],
            [
                2151,
                2153
            ],
            [
                2154,
                2213
            ],
            [
                2214,
                2221
            ],
            [
                2221,
                2314
            ],
            [
                2314,
                2333
            ],
            [
                2336,
                2348
            ],
            [
                2351,
                2392
            ],
            [
                2392,
                2395
            ],
            [
                2396,
                2437
            ],
            [
                2438,
                2441
            ],
            [
                2442,
                2448
            ],
            [
                2449,
                2451
            ],
            [
                2452,
                2465
            ],
            [
                2465,
                2467
            ],
            [
                2477,
                2520
            ],
            [
                2521,
                2571
            ],
            [
                2573,
                2600
            ],
            [
                2609,
                2611
            ],
            [
                2611,
                2634
            ],
            [
                2636,
                2679
            ],
            [
                2679,
                2760
            ],
            [
                2760,
                2770
            ],
            [
                2775,
                2789
            ],
            [
                2797,
                2810
            ],
            [
                2810,
                2824
            ],
            [
                2824,
                2840
            ],
            [
                2853,
                2855
            ],
            [
                2856,
                2859
            ],
            [
                2860,
                2879
            ],
            [
                2879,
                2884
            ],
            [
                2885,
                2895
            ],
            [
                2896,
                2948
            ],
            [
                2949,
                2999
            ],
            [
                3004,
                3006
            ],
            [
                3011,
                3013
            ],
            [
                3013,
                3038
            ],
            [
                3039,
                3053
            ],
            [
                3054,
                3069
            ],
            [
                3075,
                3102
            ],
            [
                3103,
                3111
            ],
            [
                3112,
                3120
            ],
            [
                3121,
                3149
            ],
            [
                3149,
                3152
            ],
            [
                3153,
                3183
            ],
            [
                3183,
                3225
            ],
            [
                3225,
                3243
            ],
            [
                3251,
                3252
            ],
            [
                3253,
                3312
            ],
            [
                3313,
                3369
            ],
            [
                3369,
                3412
            ],
            [
                3412,
                3417
            ],
            [
                3418,
                3429
            ],
            [
                3434,
                3441
            ],
            [
                3441,
                3442
            ],
            [
                3443,
                3479
            ],
            [
                3479,
                3516
            ],
            [
                3516,
                3546
            ],
            [
                3546,
                3590
            ],
            [
                3590,
                3592
            ],
            [
                3592,
                3628
            ],
            [
                3646,
                3648
            ],
            [
                3659,
                3661
            ],
            [
                3668,
                3671
            ],
            [
                3672,
                3678
            ],
            [
                3681,
                3722
            ],
            [
                3722,
                3771
            ],
            [
                3771,
                3803
            ],
            [
                3814,
                3888
            ],
            [
                3889,
                3912
            ],
            [
                3912,
                3940
            ],
            [
                3941,
                3949
            ],
            [
                3959,
                3967
            ],
            [
                3967,
                4044
            ],
            [
                4044,
                4103
            ],
            [
                4103,
                4105
            ],
            [
                4105,
                4162
            ],
            [
                4167,
                4170
            ],
            [
                4176,
                4178
            ],
            [
                4178,
                4266
            ],
            [
                4266,
                4285
            ],
            [
                4288,
                4351
            ],
            [
                4351,
                4352
            ],
            [
                4358,
                4360
            ],
            [
                4360,
                4423
            ],
            [
                4423,
                4505
            ],
            [
                4505,
                4519
            ],
            [
                4520,
                4559
            ],
            [
                4570,
                4590
            ],
            [
                4591,
                4603
            ],
            [
                4604,
                4612
            ],
            [
                4615,
                4622
            ],
            [
                4622,
                4625
            ],
            [
                4625,
                4691
            ],
            [
                4691,
                4757
            ],
            [
                4758,
                4829
            ],
            [
                4829,
                4832
            ],
            [
                4832,
                4887
            ],
            [
                4889,
                4902
            ],
            [
                4903,
                4968
            ],
            [
                4968,
                4970
            ],
            [
                4970,
                4987
            ],
            [
                5003,
                5022
            ],
            [
                5022,
                5066
            ],
            [
                5066,
                5067
            ],
            [
                5076,
                5133
            ],
            [
                5134,
                5141
            ],
            [
                5142,
                5155
            ],
            [
                5158,
                5176
            ],
            [
                5184,
                5222
            ],
            [
                5222,
                5298
            ],
            [
                5298,
                5392
            ],
            [
                5393,
                5412
            ],
            [
                5413,
                5418
            ],
            [
                5419,
                5424
            ],
            [
                5434,
                5439
            ],
            [
                5440,
                5475
            ],
            [
                5475,
                5478
            ],
            [
                5478,
                5517
            ],
            [
                5517,
                5576
            ],
            [
                5581,
                5585
            ],
            [
                5585,
                5587
            ],
            [
                5587,
                5691
            ],
            [
                5691,
                5701
            ],
            [
                5702,
                5710
            ],
            [
                5710,
                5712
            ],
            [
                5718,
                5761
            ],
            [
                5761,
                5763
            ],
            [
                5763,
                5766
            ],
            [
                5771,
                5835
            ],
            [
                5835,
                5837
            ],
            [
                5837,
                5897
            ],
            [
                5897,
                5982
            ],
            [
                5982,
                6068
            ],
            [
                6068,
                6091
            ],
            [
                6101,
                6113
            ],
            [
                6113,
                6152
            ],
            [
                6156,
                6192
            ],
            [
                6193,
                6208
            ],
            [
                6209,
                6211
            ],
            [
                6212,
                6233
            ],
            [
                6234,
                6271
            ],
            [
                6271,
                6317
            ],
            [
                6318,
                6362
            ],
            [
                6362,
                6364
            ],
            [
                6364,
                6370
            ],
            [
                6371,
                6397
            ],
            [
                6398,
                6400
            ],
            [
                6404,
                6463
            ],
            [
                6463,
                6482
            ],
            [
                6482,
                6517
            ],
            [
                6517,
                6562
            ],
            [
                6562,
                6564
            ],
            [
                6569,
                6663
            ],
            [
                6663,
                6727
            ],
            [
                6731,
                6765
            ],
            [
                6766,
                6792
            ],
            [
                6793,
                6818
            ],
            [
                6819,
                6848
            ],
            [
                6853,
                6864
            ],
            [
                6865,
                6867
            ],
            [
                6868,
                6872
            ],
            [
                6873,
                6878
            ],
            [
                6878,
                6907
            ],
            [
                6908,
                6911
            ],
            [
                6911,
                6913
            ],
            [
                6913,
                7022
            ],
            [
                7022,
                7058
            ],
            [
                7079,
                7087
            ],
            [
                7089,
                7110
            ],
            [
                7110,
                7130
            ],
            [
                7131,
                7152
            ],
            [
                7152,
                7221
            ],
            [
                7221,
                7329
            ],
            [
                7329,
                7346
            ],
            [
                7347,
                7414
            ],
            [
                7415,
                7418
            ],
            [
                7419,
                7433
            ],
            [
                7442,
                7468
            ],
            [
                7468,
                7469
            ],
            [
                7470,
                7514
            ],
            [
                7514,
                7544
            ],
            [
                7545,
                7579
            ],
            [
                7580,
                7595
            ],
            [
                7595,
                7606
            ],
            [
                7607,
                7621
            ],
            [
                7622,
                7675
            ],
            [
                7682,
                7721
            ],
            [
                7728,
                7764
            ],
            [
                7764,
                7766
            ],
            [
                7766,
                7838
            ],
            [
                7839,
                7883
            ],
            [
                7883,
                7896
            ],
            [
                7907,
                7967
            ],
            [
                7970,
                8044
            ],
            [
                8044,
                8083
            ],
            [
                8083,
                8105
            ],
            [
                8105,
                8156
            ],
            [
                8156,
                8186
            ],
            [
                8187,
                8221
            ],
            [
                8221,
                8258
            ],
            [
                8258,
                8266
            ],
            [
                8267,
                8285
            ],
            [
                8289,
                8364
            ],
            [
                8364,
                8446
            ],
            [
                8446,
                8466
            ],
            [
                8472,
                8495
            ],
            [
                8495,
                8497
            ],
            [
                8497,
                8505
            ],
            [
                8506,
                8529
            ],
            [
                8529,
                8566
            ],
            [
                8566,
                8592
            ],
            [
                8592,
                8611
            ],
            [
                8613,
                8625
            ],
            [
                8626,
                8689
            ],
            [
                8689,
                8707
            ],
            [
                8707,
                8731
            ],
            [
                8731,
                8790
            ],
            [
                8791,
                8798
            ],
            [
                8800,
                8801
            ],
            [
                8807,
                8829
            ],
            [
                8829,
                8832
            ],
            [
                8832,
                8834
            ],
            [
                8834,
                8882
            ],
            [
                8882,
                8923
            ],
            [
                8923,
                8975
            ],
            [
                8975,
                9057
            ],
            [
                9059,
                9062
            ],
            [
                9063,
                9123
            ],
            [
                9123,
                9183
            ],
            [
                9184,
                9243
            ],
            [
                9243,
                9250
            ],
            [
                9250,
                9280
            ],
            [
                9281,
                9335
            ],
            [
                9338,
                9340
            ],
            [
                9351,
                9356
            ],
            [
                9359,
                9361
            ],
            [
                9367,
                9402
            ],
            [
                9402,
                9411
            ],
            [
                9412,
                9449
            ],
            [
                9451,
                9465
            ],
            [
                9480,
                9492
            ],
            [
                9492,
                9555
            ],
            [
                9555,
                9579
            ],
            [
                9582,
                9596
            ],
            [
                9596,
                9619
            ],
            [
                9619,
                9621
            ],
            [
                9621,
                9708
            ],
            [
                9719,
                9762
            ],
            [
                9763,
                9813
            ],
            [
                9813,
                9818
            ],
            [
                9818,
                9868
            ],
            [
                9868,
                9921
            ],
            [
                9921,
                9987
            ],
            [
                9988,
                10056
            ],
            [
                10056,
                10082
            ],
            [
                10082,
                10140
            ],
            [
                10140,
                10201
            ],
            [
                10202,
                10210
            ],
            [
                10210,
                10213
            ],
            [
                10214,
                10219
            ],
            [
                10226,
                10236
            ],
            [
                10237,
                10272
            ],
            [
                10272,
                10278
            ],
            [
                10279,
                10341
            ],
            [
                10341,
                10393
            ],
            [
                10394,
                10428
            ],
            [
                10428,
                10467
            ],
            [
                10467,
                10472
            ],
            [
                10481,
                10485
            ],
            [
                10486,
                10502
            ],
            [
                10512,
                10536
            ],
            [
                10536,
                10561
            ],
            [
                10562,
                10569
            ],
            [
                10582,
                10584
            ],
            [
                10584,
                10602
            ],
            [
                10602,
                10633
            ],
            [
                10633,
                10695
            ],
            [
                10695,
                10697
            ],
            [
                10698,
                10722
            ],
            [
                10722,
                10760
            ],
            [
                10761,
                10783
            ],
            [
                10783,
                10850
            ],
            [
                10850,
                10868
            ],
            [
                10868,
                10878
            ],
            [
                10878,
                10883
            ],
            [
                10884,
                10900
            ],
            [
                10900,
                10914
            ],
            [
                10914,
                10916
            ],
            [
                10916,
                10959
            ],
            [
                10959,
                10970
            ],
            [
                10970,
                10972
            ],
            [
                10972,
                11007
            ],
            [
                11008,
                11054
            ],
            [
                11054,
                11136
            ],
            [
                11136,
                11139
            ],
            [
                11140,
                11200
            ],
            [
                11200,
                11210
            ],
            [
                11210,
                11217
            ],
            [
                11217,
                11239
            ],
            [
                11240,
                11295
            ],
            [
                11295,
                11372
            ],
            [
                11372,
                11400
            ],
            [
                11400,
                11402
            ],
            [
                11402,
                11442
            ],
            [
                11442,
                11446
            ],
            [
                11447,
                11511
            ],
            [
                11529,
                11531
            ],
            [
                11531,
                11568
            ],
            [
                11569,
                11598
            ],
            [
                11598,
                11604
            ],
            [
                11605,
                11623
            ],
            [
                11623,
                11636
            ],
            [
                11637,
                11661
            ],
            [
                11661,
                11663
            ],
            [
                11663,
                11719
            ],
            [
                11719,
                11747
            ],
            [
                11748,
                11757
            ],
            [
                11758,
                11804
            ],
            [
                11804,
                11863
            ],
            [
                11866,
                11921
            ],
            [
                11921,
                11941
            ],
            [
                11941,
                11992
            ],
            [
                11992,
                12033
            ],
            [
                12034,
                12037
            ],
            [
                12037,
                12075
            ],
            [
                12075,
                12111
            ],
            [
                12111,
                12115
            ],
            [
                12116,
                12122
            ],
            [
                12123,
                12144
            ],
            [
                12144,
                12190
            ],
            [
                12190,
                12209
            ],
            [
                12209,
                12229
            ],
            [
                12229,
                12295
            ],
            [
                12295,
                12341
            ],
            [
                12341,
                12387
            ],
            [
                12390,
                12420
            ],
            [
                12420,
                12451
            ],
            [
                12451,
                12452
            ],
            [
                12453,
                12519
            ],
            [
                12519,
                12591
            ],
            [
                12591,
                12599
            ],
            [
                12600,
                12635
            ],
            [
                12635,
                12667
            ],
            [
                12667,
                12773
            ],
            [
                12773,
                12774
            ],
            [
                12775,
                12818
            ],
            [
                12818,
                12901
            ],
            [
                12901,
                12927
            ],
            [
                12927,
                12930
            ],
            [
                12931,
                12976
            ],
            [
                12977,
                12992
            ],
            [
                12993,
                13003
            ],
            [
                13003,
                13005
            ],
            [
                13005,
                13097
            ],
            [
                13097,
                13174
            ],
            [
                13175,
                13176
            ],
            [
                13176,
                13223
            ],
            [
                13223,
                13224
            ],
            [
                13233,
                13236
            ],
            [
                13248,
                13250
            ],
            [
                13250,
                13292
            ],
            [
                13293,
                13295
            ],
            [
                13296,
                13312
            ],
            [
                13312,
                13313
            ],
            [
                13314,
                13421
            ],
            [
                13423,
                13424
            ],
            [
                13432,
                13446
            ],
            [
                13452,
                13504
            ],
            [
                13504,
                13517
            ],
            [
                13517,
                13574
            ],
            [
                13574,
                13575
            ],
            [
                13581,
                13596
            ],
            [
                13596,
                13627
            ],
            [
                13627,
                13708
            ],
            [
                13708,
                13734
            ],
            [
                13734,
                13758
            ],
            [
                13758,
                13797
            ],
            [
                13797,
                13803
            ],
            [
                13806,
                13828
            ],
            [
                13829,
                13877
            ],
            [
                13878,
                13911
            ],
            [
                13921,
                13994
            ]
        ],
        "row_chars": [
            [
                0,
                102
            ],
            [
                102,
                180
            ],
            [
                180,
                206
            ],
            [
                206,
                254
            ],
            [
                254,
                282
            ],
            [
                282,
                313
            ],
            [
                313,
                382
            ],
            [
                382,
                382
            ],
            [
                382,
                382
            ],
            [
                382,
                382
            ],
            [
                382,
                382
            ],
            [
                382,
                492
            ],
            [
                492,
                581
            ],
            [
                581,
                592
            ],
            [
                592,
                626
            ],
            [
                626,
                693
            ],
            [
                693,
                760
            ],
            [
                760,
                786
            ],
            [
                786,
                802
            ],
            [
                802,
                815
            ],
            [
                815,
                873
            ],
            [
                873,
                1010
            ],
            [
                1010,
                1010
            ],
            [
                1010,
                1026
            ],
            [
                1026,
                1053
            ],
            [
                1053,
                1106
            ],
            [
                1106,
                1142
            ],
            [
                1142,
                1203
            ],
            [
                1203,
                1222
            ],
            [
                1222,
                1247
            ],
            [
                1247,
                1247
            ],
            [
                1247,
                1284
            ],
            [
                1284,
                1329
            ],
            [
                1329,
                1383
            ],
            [
                1383,
                1463
            ],
            [
                1463,
                1506
            ],
            [
                1506,
                1552
            ],
            [
                1552,
                1620
            ],
            [
                1620,
                1653
            ],
            [
                1653,
                1691
            ],
            [
                1691,
                1748
            ],
            [
                1748,
                1748
            ],
            [
                1748,
                1819
            ],
            [
                1819,
                1923
            ],
            [
                1923,
                1923
            ],
            [
                1923,
                1923
            ],
            [
                1923,
                1923
            ],
            [
                1923,
                1970
            ],
            [
                1970,
                1970
            ],
            [
                1970,
                2066
            ],
            [
                2066,
                2151
            ],
            [
                2151,
                2314
            ],
            [
                2314,
                2392
            ],
            [
                2392,
                2467
            ],
            [
                2467,
                2467
            ],
            [
                2467,
                2467
            ],
            [
                2467,
                2521
            ],
            [
                2521,
                2611
            ],
            [
                2611,
                2636
            ],
            [
                2636,
                2636
            ],
            [
                2636,
                2636
            ],
            [
                2636,
                2760
            ],
            [
                2760,
                2810
            ],
            [
                2810,
                2824
            ],
            [
                2824,
                2840
            ],
            [
                2840,
                2949
            ],
            [
                2949,
                3013
            ],
            [
                3013,
                3149
            ],
            [
                3149,
                3183
            ],
            [
                3183,
                3183
            ],
            [
                3183,
                3225
            ],
            [
                3225,
                3253
            ],
            [
                3253,
                3253
            ],
            [
                3253,
                3369
            ],
            [
                3369,
                3443
            ],
            [
                3443,
                3479
            ],
            [
                3479,
                3516
            ],
            [
                3516,
                3546
            ],
            [
                3546,
                3592
            ],
            [
                3592,
                3592
            ],
            [
                3592,
                3592
            ],
            [
                3592,
                3681
            ],
            [
                3681,
                3722
            ],
            [
                3722,
                3771
            ],
            [
                3771,
                3912
            ],
            [
                3912,
                4044
            ],
            [
                4044,
                4105
            ],
            [
                4105,
                4178
            ],
            [
                4178,
                4266
            ],
            [
                4266,
                4288
            ],
            [
                4288,
                4288
            ],
            [
                4288,
                4351
            ],
            [
                4351,
                4360
            ],
            [
                4360,
                4360
            ],
            [
                4360,
                4423
            ],
            [
                4423,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4625
            ],
            [
                4625,
                4691
            ],
            [
                4691,
                4832
            ],
            [
                4832,
                4888
            ],
            [
                4888,
                4888
            ],
            [
                4888,
                4888
            ],
            [
                4888,
                4970
            ],
            [
                4970,
                5022
            ],
            [
                5022,
                5066
            ],
            [
                5066,
                5222
            ],
            [
                5222,
                5298
            ],
            [
                5298,
                5478
            ],
            [
                5478,
                5517
            ],
            [
                5517,
                5587
            ],
            [
                5587,
                5691
            ],
            [
                5691,
                5710
            ],
            [
                5710,
                5763
            ],
            [
                5763,
                5837
            ],
            [
                5837,
                5897
            ],
            [
                5897,
                5982
            ],
            [
                5982,
                6068
            ],
            [
                6068,
                6113
            ],
            [
                6113,
                6193
            ],
            [
                6193,
                6193
            ],
            [
                6193,
                6271
            ],
            [
                6271,
                6364
            ],
            [
                6364,
                6463
            ],
            [
                6463,
                6463
            ],
            [
                6463,
                6517
            ],
            [
                6517,
                6562
            ],
            [
                6562,
                6663
            ],
            [
                6663,
                6766
            ],
            [
                6766,
                6766
            ],
            [
                6766,
                6878
            ],
            [
                6878,
                6913
            ],
            [
                6913,
                7022
            ],
            [
                7022,
                7110
            ],
            [
                7110,
                7152
            ],
            [
                7152,
                7221
            ],
            [
                7221,
                7221
            ],
            [
                7221,
                7221
            ],
            [
                7221,
                7221
            ],
            [
                7221,
                7329
            ],
            [
                7329,
                7470
            ],
            [
                7470,
                7470
            ],
            [
                7470,
                7514
            ],
            [
                7514,
                7595
            ],
            [
                7595,
                7766
            ],
            [
                7766,
                7883
            ],
            [
                7883,
                7883
            ],
            [
                7883,
                7883
            ],
            [
                7883,
                7883
            ],
            [
                7883,
                8044
            ],
            [
                8044,
                8083
            ],
            [
                8083,
                8105
            ],
            [
                8105,
                8156
            ],
            [
                8156,
                8221
            ],
            [
                8221,
                8258
            ],
            [
                8258,
                8364
            ],
            [
                8364,
                8446
            ],
            [
                8446,
                8497
            ],
            [
                8497,
                8529
            ],
            [
                8529,
                8566
            ],
            [
                8566,
                8566
            ],
            [
                8566,
                8592
            ],
            [
                8592,
                8613
            ],
            [
                8613,
                8613
            ],
            [
                8613,
                8613
            ],
            [
                8613,
                8689
            ],
            [
                8689,
                8707
            ],
            [
                8707,
                8731
            ],
            [
                8731,
                8800
            ],
            [
                8800,
                8800
            ],
            [
                8800,
                8800
            ],
            [
                8800,
                8800
            ],
            [
                8800,
                8829
            ],
            [
                8829,
                8834
            ],
            [
                8834,
                8882
            ],
            [
                8882,
                8923
            ],
            [
                8923,
                8975
            ],
            [
                8975,
                9059
            ],
            [
                9059,
                9059
            ],
            [
                9059,
                9059
            ],
            [
                9059,
                9123
            ],
            [
                9123,
                9243
            ],
            [
                9243,
                9402
            ],
            [
                9402,
                9451
            ],
            [
                9451,
                9451
            ],
            [
                9451,
                9492
            ],
            [
                9492,
                9555
            ],
            [
                9555,
                9596
            ],
            [
                9596,
                9621
            ],
            [
                9621,
                9708
            ],
            [
                9708,
                9813
            ],
            [
                9813,
                9868
            ],
            [
                9868,
                9868
            ],
            [
                9868,
                9868
            ],
            [
                9868,
                9921
            ],
            [
                9921,
                10056
            ],
            [
                10056,
                10082
            ],
            [
                10082,
                10140
            ],
            [
                10140,
                10210
            ],
            [
                10210,
                10210
            ],
            [
                10210,
                10210
            ],
            [
                10210,
                10210
            ],
            [
                10210,
                10210
            ],
            [
                10210,
                10272
            ],
            [
                10272,
                10341
            ],
            [
                10341,
                10428
            ],
            [
                10428,
                10467
            ],
            [
                10467,
                10562
            ],
            [
                10562,
                10584
            ],
            [
                10584,
                10633
            ],
            [
                10633,
                10695
            ],
            [
                10695,
                10722
            ],
            [
                10722,
                10783
            ],
            [
                10783,
                10850
            ],
            [
                10850,
                10868
            ],
            [
                10868,
                10878
            ],
            [
                10878,
                10900
            ],
            [
                10900,
                10916
            ],
            [
                10916,
                10959
            ],
            [
                10959,
                10972
            ],
            [
                10972,
                11054
            ],
            [
                11054,
                11136
            ],
            [
                11136,
                11200
            ],
            [
                11200,
                11210
            ],
            [
                11210,
                11217
            ],
            [
                11217,
                11295
            ],
            [
                11295,
                11372
            ],
            [
                11372,
                11402
            ],
            [
                11402,
                11442
            ],
            [
                11442,
                11531
            ],
            [
                11531,
                11598
            ],
            [
                11598,
                11623
            ],
            [
                11623,
                11663
            ],
            [
                11663,
                11719
            ],
            [
                11719,
                11804
            ],
            [
                11804,
                11921
            ],
            [
                11921,
                11941
            ],
            [
                11941,
                11992
            ],
            [
                11992,
                12037
            ],
            [
                12037,
                12075
            ],
            [
                12075,
                12075
            ],
            [
                12075,
                12075
            ],
            [
                12075,
                12075
            ],
            [
                12075,
                12144
            ],
            [
                12144,
                12190
            ],
            [
                12190,
                12209
            ],
            [
                12209,
                12229
            ],
            [
                12229,
                12295
            ],
            [
                12295,
                12341
            ],
            [
                12341,
                12341
            ],
            [
                12341,
                12420
            ],
            [
                12420,
                12451
            ],
            [
                12451,
                12519
            ],
            [
                12519,
                12591
            ],
            [
                12591,
                12635
            ],
            [
                12635,
                12667
            ],
            [
                12667,
                12775
            ],
            [
                12775,
                12818
            ],
            [
                12818,
                12901
            ],
            [
                12901,
                12927
            ],
            [
                12927,
                13005
            ],
            [
                13005,
                13097
            ],
            [
                13097,
                13175
            ],
            [
                13175,
                13250
            ],
            [
                13250,
                13250
            ],
            [
                13250,
                13504
            ],
            [
                13504,
                13517
            ],
            [
                13517,
                13596
            ],
            [
                13596,
                13627
            ],
            [
                13627,
                13708
            ],
            [
                13708,
                13734
            ],
            [
                13734,
                13758
            ],
            [
                13758,
                13797
            ],
            [
                13797,
                13878
            ],
            [
                13878,
                13994
            ]
        ]
    }
}