{
    "original": {
        "text": "Lady Carbury's house in Welbeck Street was a modest house enough,--with no pretensions to be a mansion, hardly assuming even to be a residence; but, having some money in her hands when she first took it, she had made it pretty and pleasant, and was still proud to feel that in spite of the hardness of her position she had comfortable belongings around her when her literary friends came to see her on her Tuesday evenings. Here she was now living with her son and daughter. The back drawing-room was divided from the front by doors that were permanently closed, and in this she carried on her great work. Here she wrote her books and contrived her system for the inveigling of editors and critics. Here she was rarely disturbed by her daughter, and admitted no visitors except editors and critics. But her son was controlled by no household laws, and would break in upon her privacy without remorse. She had hardly finished two galloping notes after completing her letter to Mr. Ferdinand Alf, when Felix entered the room with a cigar in his mouth and threw himself upon the sofa.\n\"My dear boy,\" she said, \"pray leave your tobacco below when you come in here.\"\n\"What affectation it is, mother,\" he said, throwing, however, the half-smoked cigar into the fire-place. \"Some women swear they like smoke, others say they hate it like the devil. It depends altogether on whether they wish to flatter or snub a fellow.\"\n\"You don't suppose that I wish to snub you?\"\n\"Upon my word I don't know. I wonder whether you can let me have twenty pounds?\"\n\"My dear Felix!\"\n\"Just so, mother;--but how about the twenty pounds?\"\n[Illustration: \"Just so, mother;--but how about the twenty pounds?\"]\n\"What is it for, Felix?\"\n\"Well;--to tell the truth, to carry on the game for the nonce till something is settled. A fellow can't live without some money in his pocket. I do with as little as most fellows. I pay for nothing that I can help. I even get my hair cut on credit, and as long as it was possible I had a brougham, to save cabs.\"\n\"What is to be the end of it, Felix?\"\n\"I never could see the end of anything, mother. I never could nurse a horse when the hounds were going well in order to be in at the finish. I never could pass a dish that I liked in favour of those that were to follow. What's the use?\" The young man did not say \"carpe diem,\" but that was the philosophy which he intended to preach.\n\"Have you been at the Melmottes' to-day?\" It was now five o'clock on a winter afternoon, the hour at which ladies are drinking tea, and idle men playing whist at the clubs,--at which young idle men are sometimes allowed to flirt, and at which, as Lady Carbury thought, her son might have been paying his court to Marie Melmotte the great heiress.\n\"I have just come away.\"\n\"And what do you think of her?\"\n\"To tell the truth, mother, I have thought very little about her. She is not pretty, she is not plain; she is not clever, she is not stupid; she is neither saint nor sinner.\"\n\"The more likely to make a good wife.\"\n\"Perhaps so. I am at any rate quite willing to believe that as wife she would be 'good enough for me.'\"\n\"What does the mother say?\"\n\"The mother is a caution. I cannot help speculating whether, if I marry the daughter, I shall ever find out where the mother came from. Dolly Longestaffe says that somebody says that she was a Bohemian Jewess; but I think she's too fat for that.\"\n\"What does it matter, Felix?\"\n\"Not in the least.\"\n\"Is she civil to you?\"\n\"Yes, civil enough.\"\n\"And the father?\"\n\"Well, he does not turn me out, or anything of that sort. Of course there are half-a-dozen after her, and I think the old fellow is bewildered among them all. He's thinking more of getting dukes to dine with him than of his daughter's lovers. Any fellow might pick her up who happened to hit her fancy.\"\n\"And why not you?\"\n\"Why not, mother? I am doing my best, and it's no good flogging a willing horse. Can you let me have the money?\"\n\"Oh, Felix, I think you hardly know how poor we are. You have still got your hunters down at the place!\"\n\"I have got two horses, if you mean that; and I haven't paid a shilling for their keep since the season began. Look here, mother; this is a risky sort of game, I grant, but I am playing it by your advice. If I can marry Miss Melmotte, I suppose all will be right. But I don't think the way to get her would be to throw up everything and let all the world know that I haven't got a copper. To do that kind of thing a man must live a little up to the mark. I've brought my hunting down to a minimum, but if I gave it up altogether there would be lots of fellows to tell them in Grosvenor Square why I had done so.\"\nThere was an apparent truth in this argument which the poor woman was unable to answer. Before the interview was over the money demanded was forthcoming, though at the time it could be but ill afforded, and the youth went away apparently with a light heart, hardly listening to his mother's entreaties that the affair with Marie Melmotte might, if possible, be brought to a speedy conclusion.\nFelix, when he left his mother, went down to the only club to which he now belonged. Clubs are pleasant resorts in all respects but one. They require ready money, or even worse than that in respect to annual payments,--money in advance; and the young baronet had been absolutely forced to restrict himself. He, as a matter of course, out of those to which he had possessed the right of entrance, chose the worst. It was called the Beargarden, and had been lately opened with the express view of combining parsimony with profligacy. Clubs were ruined, so said certain young parsimonious profligates, by providing comforts for old fogies who paid little or nothing but their subscriptions, and took out by their mere presence three times as much as they gave. This club was not to be opened till three o'clock in the afternoon, before which hour the promoters of the Beargarden thought it improbable that they and their fellows would want a club. There were to be no morning papers taken, no library, no morning-room. Dining-rooms, billiard-rooms, and card-rooms would suffice for the Beargarden. Everything was to be provided by a purveyor, so that the club should be cheated only by one man. Everything was to be luxurious, but the luxuries were to be achieved at first cost. It had been a happy thought, and the club was said to prosper. Herr Vossner, the purveyor, was a jewel, and so carried on affairs that there was no trouble about anything. He would assist even in smoothing little difficulties as to the settling of card accounts, and had behaved with the greatest tenderness to the drawers of cheques whose bankers had harshly declared them to have \"no effects.\" Herr Vossner was a jewel, and the Beargarden was a success. Perhaps no young man about town enjoyed the Beargarden more thoroughly than did Sir Felix Carbury. The club was in the close vicinity of other clubs, in a small street turning out of St. James's Street, and piqued itself on its outward quietness and sobriety. Why pay for stone-work for other people to look at;--why lay out money in marble pillars and cornices, seeing that you can neither eat such things, nor drink them, nor gamble with them? But the Beargarden had the best wines,--or thought that it had,--and the easiest chairs, and two billiard-tables than which nothing more perfect had ever been made to stand upon legs. Hither Sir Felix wended on that January afternoon as soon as he had his mother's cheque for 20 in his pocket.\nHe found his special friend, Dolly Longestaffe, standing on the steps with a cigar in his mouth, and gazing vacantly at the dull brick house opposite. \"Going to dine here, Dolly?\" said Sir Felix.\n\"I suppose I shall, because it's such a lot of trouble to go anywhere else. I'm engaged somewhere, I know; but I'm not up to getting home and dressing. By George! I don't know how fellows do that kind of thing. I can't.\"\n\"Going to hunt to-morrow?\"\n\"Well, yes; but I don't suppose I shall. I was going to hunt every day last week, but my fellow never would get me up in time. I can't tell why it is that things are done in such a beastly way. Why shouldn't fellows begin to hunt at two or three, so that a fellow needn't get up in the middle of the night?\"\n\"Because one can't ride by moonlight, Dolly.\"\n\"It isn't moonlight at three. At any rate I can't get myself to Euston Square by nine. I don't think that fellow of mine likes getting up himself. He says he comes in and wakes me, but I never remember it.\"\n\"How many horses have you got at Leighton, Dolly?\"\n\"How many? There were five, but I think that fellow down there sold one; but then I think he bought another. I know he did something.\"\n\"Who rides them?\"\n\"He does, I suppose. That is, of course, I ride them myself, only I so seldom get down. Somebody told me that Grasslough was riding two of them last week. I don't think I ever told him he might. I think he tipped that fellow of mine; and I call that a low kind of thing to do. I'd ask him, only I know he'd say that I had lent them. Perhaps I did when I was tight, you know.\"\n\"You and Grasslough were never pals.\"\n\"I don't like him a bit. He gives himself airs because he is a lord, and is devilish ill-natured. I don't know why he should want to ride my horses.\"\n\"To save his own.\"\n\"He isn't hard up. Why doesn't he have his own horses? I'll tell you what, Carbury, I've made up my mind to one thing, and, by Jove, I'll stick to it. I never will lend a horse again to anybody. If fellows want horses let them buy them.\"\n\"But some fellows haven't got any money, Dolly.\"\n\"Then they ought to go tick. I don't think I've paid for any of mine I've bought this season. There was somebody here yesterday--\"\n\"What! here at the club?\"\n\"Yes; followed me here to say he wanted to be paid for something! It was horses, I think, because of the fellow's trousers.\"\n\"What did you say?\"\n\"Me! Oh, I didn't say anything.\"\n\"And how did it end?\"\n\"When he'd done talking I offered him a cigar, and while he was biting off the end I went up-stairs. I suppose he went away when he was tired of waiting.\"\n\"I'll tell you what, Dolly; I wish you'd let me ride two of yours for a couple of days,--that is, of course, if you don't want them yourself. You ain't tight now, at any rate.\"\n\"No; I ain't tight,\" said Dolly, with melancholy acquiescence.\n\"I mean that I wouldn't like to borrow your horses without your remembering all about it. Nobody knows as well as you do how awfully done up I am. I shall pull through at last, but it's an awful squeeze in the meantime. There's nobody I'd ask such a favour of except you.\"\n\"Well, you may have them;--that is, for two days. I don't know whether that fellow of mine will believe you. He wouldn't believe Grasslough, and told him so. But Grasslough took them out of the stables. That's what somebody told me.\"\n\"You could write a line to your groom.\"\n\"Oh, my dear fellow, that is such a bore; I don't think I could do that. My fellow will believe you, because you and I have been pals. I think I'll have a little drop of curaoa before dinner. Come along and try it. It'll give us an appetite.\"\nIt was then nearly seven o'clock. Nine hours afterwards the same two men, with two others,--of whom young Lord Grasslough, Dolly Longestaffe's peculiar aversion, was one,--were just rising from a card-table in one of the up-stairs rooms of the club. For it was understood that, though the Beargarden was not to be open before three o'clock in the afternoon, the accommodation denied during the day was to be given freely during the night. No man could get a breakfast at the Beargarden, but suppers at three o'clock in the morning were quite within the rule. Such a supper, or rather succession of suppering, there had been to-night, various devils and broils and hot toasts having been brought up from time to time first for one and then for another. But there had been no cessation of gambling since the cards had first been opened about ten o'clock. At four in the morning Dolly Longestaffe was certainly in a condition to lend his horses and to remember nothing about it. He was quite affectionate with Lord Grasslough, as he was also with his other companions,--affection being the normal state of his mind when in that condition. He was by no means helplessly drunk, and was, perhaps, hardly more silly than when he was sober; but he was willing to play at any game whether he understood it or not, and for any stakes. When Sir Felix got up and said he would play no more, Dolly also got up, apparently quite contented. When Lord Grasslough, with a dark scowl on his face, expressed his opinion that it was not just the thing for men to break up like that when so much money had been lost, Dolly as willingly sat down again. But Dolly's sitting down was not sufficient. \"I'm going to hunt to-morrow,\" said Sir Felix,--meaning that day,--\"and I shall play no more. A man must go to bed at some time.\"\n\"I don't see it at all,\" said Lord Grasslough. \"It's an understood thing that when a man has won as much as you have he should stay.\"\n\"Stay how long?\" said Sir Felix, with an angry look. \"That's nonsense; there must be an end of everything, and there's an end of this for me to-night.\"\n\"Oh, if you choose,\" said his lordship.\n\"I do choose. Good night, Dolly; we'll settle this next time we meet. I've got it all entered.\"\nThe night had been one very serious in its results to Sir Felix. He had sat down to the card-table with the proceeds of his mother's cheque, a poor 20, and now he had,--he didn't at all know how much in his pockets. He also had drunk, but not so as to obscure his mind. He knew that Longestaffe owed him over 800, and he knew also that he had received more than that in ready money and cheques from Lord Grasslough and the other player. Dolly Longestaffe's money, too, would certainly be paid, though Dolly did complain of the importunity of his tradesmen. As he walked up St. James's Street, looking for a cab, he presumed himself to be worth over 700. When begging for a small sum from Lady Carbury, he had said that he could not carry on the game without some ready money, and had considered himself fortunate in fleecing his mother as he had done. Now he was in the possession of wealth,--of wealth that might, at any rate, be sufficient to aid him materially in the object he had in hand. He never for a moment thought of paying his bills. Even the large sum of which he had become so unexpectedly possessed would not have gone far with him in such a quixotic object as that; but he could now look bright, and buy presents, and be seen with money in his hands. It is hard even to make love in these days without something in your purse.\nHe found no cab, but in his present frame of mind was indifferent to the trouble of walking home. There was something so joyous in the feeling of the possession of all this money that it made the night air pleasant to him. Then, of a sudden, he remembered the low wail with which his mother had spoken of her poverty when he demanded assistance from her. Now he could give her back the 20. But it occurred to him sharply, with an amount of carefulness quite new to him, that it would be foolish to do so. How soon might he want it again? And, moreover, he could not repay the money without explaining to her how he had gotten it. It would be preferable to say nothing about his money. As he let himself into the house and went up to his room he resolved that he would not say anything about it.\nOn that morning he was at the station at nine, and hunted down in Buckinghamshire, riding two of Dolly Longestaffe's horses,--for the use of which he paid Dolly Longestaffe's \"fellow\" thirty shillings.",
        "paragraph_chars": [
            [
                0,
                1082
            ],
            [
                1082,
                1162
            ],
            [
                1162,
                1415
            ],
            [
                1415,
                1460
            ],
            [
                1460,
                1541
            ],
            [
                1541,
                1558
            ],
            [
                1558,
                1611
            ],
            [
                1611,
                1680
            ],
            [
                1680,
                1705
            ],
            [
                1705,
                2018
            ],
            [
                2018,
                2056
            ],
            [
                2056,
                2390
            ],
            [
                2390,
                2737
            ],
            [
                2737,
                2762
            ],
            [
                2762,
                2794
            ],
            [
                2794,
                2969
            ],
            [
                2969,
                3008
            ],
            [
                3008,
                3112
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3387
            ],
            [
                3387,
                3417
            ],
            [
                3417,
                3437
            ],
            [
                3437,
                3460
            ],
            [
                3460,
                3481
            ],
            [
                3481,
                3499
            ],
            [
                3499,
                3803
            ],
            [
                3803,
                3822
            ],
            [
                3822,
                3935
            ],
            [
                3935,
                4040
            ],
            [
                4040,
                4653
            ],
            [
                4653,
                5046
            ],
            [
                5046,
                7518
            ],
            [
                7518,
                7714
            ],
            [
                7714,
                7935
            ],
            [
                7935,
                7962
            ],
            [
                7962,
                8270
            ],
            [
                8270,
                8316
            ],
            [
                8316,
                8523
            ],
            [
                8523,
                8574
            ],
            [
                8574,
                8709
            ],
            [
                8709,
                8727
            ],
            [
                8727,
                9103
            ],
            [
                9103,
                9141
            ],
            [
                9141,
                9291
            ],
            [
                9291,
                9310
            ],
            [
                9310,
                9548
            ],
            [
                9548,
                9597
            ],
            [
                9597,
                9728
            ],
            [
                9728,
                9754
            ],
            [
                9754,
                9879
            ],
            [
                9879,
                9899
            ],
            [
                9899,
                9932
            ],
            [
                9932,
                9954
            ],
            [
                9954,
                10109
            ],
            [
                10109,
                10286
            ],
            [
                10286,
                10349
            ],
            [
                10349,
                10622
            ],
            [
                10622,
                10856
            ],
            [
                10856,
                10896
            ],
            [
                10896,
                11139
            ],
            [
                11139,
                12945
            ],
            [
                12945,
                13079
            ],
            [
                13079,
                13231
            ],
            [
                13231,
                13271
            ],
            [
                13271,
                13367
            ],
            [
                13367,
                14709
            ],
            [
                14709,
                15504
            ],
            [
                15504,
                15705
            ]
        ],
        "segment_chars": [
            [
                0,
                424
            ],
            [
                424,
                475
            ],
            [
                475,
                606
            ],
            [
                606,
                699
            ],
            [
                699,
                799
            ],
            [
                799,
                901
            ],
            [
                901,
                1082
            ],
            [
                1082,
                1162
            ],
            [
                1162,
                1267
            ],
            [
                1267,
                1342
            ],
            [
                1342,
                1415
            ],
            [
                1415,
                1460
            ],
            [
                1460,
                1488
            ],
            [
                1488,
                1541
            ],
            [
                1541,
                1558
            ],
            [
                1558,
                1611
            ],
            [
                1611,
                1680
            ],
            [
                1680,
                1705
            ],
            [
                1705,
                1794
            ],
            [
                1794,
                1848
            ],
            [
                1848,
                1885
            ],
            [
                1885,
                1920
            ],
            [
                1920,
                2018
            ],
            [
                2018,
                2056
            ],
            [
                2056,
                2104
            ],
            [
                2104,
                2197
            ],
            [
                2197,
                2276
            ],
            [
                2276,
                2293
            ],
            [
                2293,
                2390
            ],
            [
                2390,
                2432
            ],
            [
                2432,
                2737
            ],
            [
                2737,
                2762
            ],
            [
                2762,
                2794
            ],
            [
                2794,
                2860
            ],
            [
                2860,
                2969
            ],
            [
                2969,
                3008
            ],
            [
                3008,
                3021
            ],
            [
                3021,
                3112
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3166
            ],
            [
                3166,
                3276
            ],
            [
                3276,
                3387
            ],
            [
                3387,
                3417
            ],
            [
                3417,
                3437
            ],
            [
                3437,
                3460
            ],
            [
                3460,
                3481
            ],
            [
                3481,
                3499
            ],
            [
                3499,
                3557
            ],
            [
                3557,
                3658
            ],
            [
                3658,
                3742
            ],
            [
                3742,
                3803
            ],
            [
                3803,
                3822
            ],
            [
                3822,
                3840
            ],
            [
                3840,
                3903
            ],
            [
                3903,
                3935
            ],
            [
                3935,
                3988
            ],
            [
                3988,
                4040
            ],
            [
                4040,
                4151
            ],
            [
                4151,
                4245
            ],
            [
                4245,
                4304
            ],
            [
                4304,
                4429
            ],
            [
                4429,
                4495
            ],
            [
                4495,
                4653
            ],
            [
                4653,
                4741
            ],
            [
                4741,
                5046
            ],
            [
                5046,
                5131
            ],
            [
                5131,
                5183
            ],
            [
                5183,
                5353
            ],
            [
                5353,
                5459
            ],
            [
                5459,
                5578
            ],
            [
                5578,
                5804
            ],
            [
                5804,
                5991
            ],
            [
                5991,
                6062
            ],
            [
                6062,
                6141
            ],
            [
                6141,
                6238
            ],
            [
                6238,
                6322
            ],
            [
                6322,
                6385
            ],
            [
                6385,
                6494
            ],
            [
                6494,
                6718
            ],
            [
                6718,
                6778
            ],
            [
                6778,
                6877
            ],
            [
                6877,
                7038
            ],
            [
                7038,
                7224
            ],
            [
                7224,
                7408
            ],
            [
                7408,
                7518
            ],
            [
                7518,
                7669
            ],
            [
                7669,
                7698
            ],
            [
                7698,
                7714
            ],
            [
                7714,
                7790
            ],
            [
                7790,
                7866
            ],
            [
                7866,
                7877
            ],
            [
                7877,
                7925
            ],
            [
                7925,
                7935
            ],
            [
                7935,
                7962
            ],
            [
                7962,
                8003
            ],
            [
                8003,
                8089
            ],
            [
                8089,
                8156
            ],
            [
                8156,
                8270
            ],
            [
                8270,
                8316
            ],
            [
                8316,
                8346
            ],
            [
                8346,
                8403
            ],
            [
                8403,
                8463
            ],
            [
                8463,
                8523
            ],
            [
                8523,
                8574
            ],
            [
                8574,
                8585
            ],
            [
                8585,
                8683
            ],
            [
                8683,
                8709
            ],
            [
                8709,
                8727
            ],
            [
                8727,
                8748
            ],
            [
                8748,
                8815
            ],
            [
                8815,
                8882
            ],
            [
                8882,
                8922
            ],
            [
                8922,
                9004
            ],
            [
                9004,
                9060
            ],
            [
                9060,
                9103
            ],
            [
                9103,
                9141
            ],
            [
                9141,
                9166
            ],
            [
                9166,
                9239
            ],
            [
                9239,
                9291
            ],
            [
                9291,
                9310
            ],
            [
                9310,
                9329
            ],
            [
                9329,
                9365
            ],
            [
                9365,
                9461
            ],
            [
                9461,
                9505
            ],
            [
                9505,
                9548
            ],
            [
                9548,
                9597
            ],
            [
                9597,
                9626
            ],
            [
                9626,
                9691
            ],
            [
                9691,
                9728
            ],
            [
                9728,
                9735
            ],
            [
                9735,
                9754
            ],
            [
                9754,
                9820
            ],
            [
                9820,
                9879
            ],
            [
                9879,
                9899
            ],
            [
                9899,
                9904
            ],
            [
                9904,
                9932
            ],
            [
                9932,
                9954
            ],
            [
                9954,
                10055
            ],
            [
                10055,
                10109
            ],
            [
                10109,
                10251
            ],
            [
                10251,
                10286
            ],
            [
                10286,
                10349
            ],
            [
                10349,
                10439
            ],
            [
                10439,
                10496
            ],
            [
                10496,
                10569
            ],
            [
                10569,
                10622
            ],
            [
                10622,
                10672
            ],
            [
                10672,
                10731
            ],
            [
                10731,
                10780
            ],
            [
                10780,
                10825
            ],
            [
                10825,
                10856
            ],
            [
                10856,
                10896
            ],
            [
                10896,
                10969
            ],
            [
                10969,
                11031
            ],
            [
                11031,
                11088
            ],
            [
                11088,
                11111
            ],
            [
                11111,
                11139
            ],
            [
                11139,
                11173
            ],
            [
                11173,
                11389
            ],
            [
                11389,
                11578
            ],
            [
                11578,
                11698
            ],
            [
                11698,
                11891
            ],
            [
                11891,
                11992
            ],
            [
                11992,
                12115
            ],
            [
                12115,
                12275
            ],
            [
                12275,
                12464
            ],
            [
                12464,
                12565
            ],
            [
                12565,
                12770
            ],
            [
                12770,
                12815
            ],
            [
                12815,
                12909
            ],
            [
                12909,
                12945
            ],
            [
                12945,
                12992
            ],
            [
                12992,
                13079
            ],
            [
                13079,
                13096
            ],
            [
                13096,
                13132
            ],
            [
                13132,
                13231
            ],
            [
                13231,
                13271
            ],
            [
                13271,
                13285
            ],
            [
                13285,
                13341
            ],
            [
                13341,
                13367
            ],
            [
                13367,
                13432
            ],
            [
                13432,
                13583
            ],
            [
                13583,
                13637
            ],
            [
                13637,
                13804
            ],
            [
                13804,
                13924
            ],
            [
                13924,
                14021
            ],
            [
                14021,
                14219
            ],
            [
                14219,
                14361
            ],
            [
                14361,
                14412
            ],
            [
                14412,
                14633
            ],
            [
                14633,
                14709
            ],
            [
                14709,
                14807
            ],
            [
                14807,
                14932
            ],
            [
                14932,
                15064
            ],
            [
                15064,
                15099
            ],
            [
                15099,
                15214
            ],
            [
                15214,
                15247
            ],
            [
                15247,
                15339
            ],
            [
                15339,
                15394
            ],
            [
                15394,
                15504
            ],
            [
                15504,
                15705
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                45,
                51
            ],
            [
                142,
                147
            ],
            [
                204,
                248
            ],
            [
                255,
                273
            ],
            [
                315,
                401
            ],
            [
                406,
                424
            ],
            [
                514,
                517
            ],
            [
                475,
                500
            ],
            [
                543,
                561
            ],
            [
                606,
                610
            ],
            [
                533,
                537
            ],
            [
                575,
                604
            ],
            [
                675,
                677
            ],
            [
                697,
                699
            ],
            [
                699,
                745
            ],
            [
                803,
                810
            ],
            [
                852,
                900
            ],
            [
                945,
                950
            ],
            [
                901,
                908
            ],
            [
                962,
                979
            ],
            [
                990,
                994
            ],
            [
                1000,
                1082
            ],
            [
                1082,
                1131
            ],
            [
                1138,
                1162
            ],
            [
                1267,
                1301
            ],
            [
                1187,
                1213
            ],
            [
                1224,
                1266
            ],
            [
                1488,
                1541
            ],
            [
                1541,
                1555
            ],
            [
                1681,
                1695
            ],
            [
                1702,
                1705
            ],
            [
                1794,
                1848
            ],
            [
                1848,
                1885
            ],
            [
                1920,
                1952
            ],
            [
                2015,
                2018
            ],
            [
                2018,
                2056
            ],
            [
                2056,
                2104
            ],
            [
                2197,
                2254
            ],
            [
                2265,
                2276
            ],
            [
                2276,
                2292
            ],
            [
                2390,
                2422
            ],
            [
                2429,
                2432
            ],
            [
                2432,
                2478
            ],
            [
                2522,
                2525
            ],
            [
                2637,
                2657
            ],
            [
                2659,
                2737
            ],
            [
                2737,
                2762
            ],
            [
                2762,
                2794
            ],
            [
                2794,
                2860
            ],
            [
                2860,
                2969
            ],
            [
                2969,
                3008
            ],
            [
                3008,
                3016
            ],
            [
                3019,
                3021
            ],
            [
                3090,
                3101
            ],
            [
                3026,
                3037
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3166
            ],
            [
                3276,
                3387
            ],
            [
                3387,
                3414
            ],
            [
                3438,
                3460
            ],
            [
                3460,
                3481
            ],
            [
                3481,
                3499
            ],
            [
                3499,
                3529
            ],
            [
                3555,
                3557
            ],
            [
                3557,
                3658
            ],
            [
                3658,
                3742
            ],
            [
                3742,
                3803
            ],
            [
                3803,
                3822
            ],
            [
                3822,
                3823
            ],
            [
                3840,
                3859
            ],
            [
                3832,
                3838
            ],
            [
                3901,
                3903
            ],
            [
                3903,
                3935
            ],
            [
                3935,
                3988
            ],
            [
                3988,
                4019
            ],
            [
                4037,
                4040
            ],
            [
                4040,
                4151
            ],
            [
                4151,
                4185
            ],
            [
                4194,
                4198
            ],
            [
                4207,
                4245
            ],
            [
                4245,
                4304
            ],
            [
                4304,
                4340
            ],
            [
                4350,
                4352
            ],
            [
                4377,
                4429
            ],
            [
                4542,
                4551
            ],
            [
                4555,
                4557
            ],
            [
                4508,
                4518
            ],
            [
                4569,
                4632
            ],
            [
                4650,
                4653
            ],
            [
                4704,
                4732
            ],
            [
                4684,
                4688
            ],
            [
                4739,
                4741
            ],
            [
                4771,
                4780
            ],
            [
                4762,
                4765
            ],
            [
                4766,
                4770
            ],
            [
                4854,
                4879
            ],
            [
                4891,
                4996
            ],
            [
                5011,
                5046
            ],
            [
                5046,
                5131
            ],
            [
                5131,
                5136
            ],
            [
                5188,
                5195
            ],
            [
                5202,
                5207
            ],
            [
                5281,
                5304
            ],
            [
                5207,
                5208
            ],
            [
                5325,
                5351
            ],
            [
                5244,
                5246
            ],
            [
                5178,
                5181
            ],
            [
                5440,
                5459
            ],
            [
                5459,
                5577
            ],
            [
                5804,
                5813
            ],
            [
                5818,
                5821
            ],
            [
                5835,
                5870
            ],
            [
                5989,
                5991
            ],
            [
                5991,
                6001
            ],
            [
                6008,
                6062
            ],
            [
                6062,
                6141
            ],
            [
                6238,
                6252
            ],
            [
                6259,
                6268
            ],
            [
                6349,
                6385
            ],
            [
                6385,
                6412
            ],
            [
                6433,
                6451
            ],
            [
                6430,
                6432
            ],
            [
                6452,
                6492
            ],
            [
                6424,
                6425
            ],
            [
                6518,
                6527
            ],
            [
                6528,
                6547
            ],
            [
                6515,
                6517
            ],
            [
                6554,
                6569
            ],
            [
                6575,
                6583
            ],
            [
                6492,
                6493
            ],
            [
                6778,
                6853
            ],
            [
                6858,
                6877
            ],
            [
                6877,
                6889
            ],
            [
                6897,
                6902
            ],
            [
                6915,
                6945
            ],
            [
                6961,
                6984
            ],
            [
                7006,
                7013
            ],
            [
                7036,
                7038
            ],
            [
                7038,
                7049
            ],
            [
                7112,
                7140
            ],
            [
                7153,
                7224
            ],
            [
                7224,
                7261
            ],
            [
                7264,
                7286
            ],
            [
                7289,
                7320
            ],
            [
                7361,
                7368
            ],
            [
                7321,
                7336
            ],
            [
                7406,
                7408
            ],
            [
                7408,
                7424
            ],
            [
                7476,
                7518
            ],
            [
                7518,
                7530
            ],
            [
                7539,
                7546
            ],
            [
                7553,
                7641
            ],
            [
                7647,
                7668
            ],
            [
                7669,
                7698
            ],
            [
                7698,
                7714
            ],
            [
                7714,
                7790
            ],
            [
                7790,
                7864
            ],
            [
                7935,
                7949
            ],
            [
                7959,
                7962
            ],
            [
                7962,
                8003
            ],
            [
                8003,
                8089
            ],
            [
                8156,
                8159
            ],
            [
                8167,
                8177
            ],
            [
                8187,
                8267
            ],
            [
                8358,
                8403
            ],
            [
                8417,
                8436
            ],
            [
                8466,
                8523
            ],
            [
                8523,
                8574
            ],
            [
                8585,
                8650
            ],
            [
                8664,
                8683
            ],
            [
                8683,
                8709
            ],
            [
                8709,
                8727
            ],
            [
                8727,
                8748
            ],
            [
                8815,
                8882
            ],
            [
                8922,
                8960
            ],
            [
                8965,
                8982
            ],
            [
                8991,
                9004
            ],
            [
                9004,
                9060
            ],
            [
                9060,
                9103
            ],
            [
                9103,
                9141
            ],
            [
                9141,
                9158
            ],
            [
                9164,
                9166
            ],
            [
                9166,
                9187
            ],
            [
                9208,
                9213
            ],
            [
                9311,
                9329
            ],
            [
                9329,
                9365
            ],
            [
                9365,
                9414
            ],
            [
                9432,
                9441
            ],
            [
                9459,
                9461
            ],
            [
                9461,
                9505
            ],
            [
                9505,
                9548
            ],
            [
                9548,
                9597
            ],
            [
                9597,
                9619
            ],
            [
                9620,
                9626
            ],
            [
                9626,
                9691
            ],
            [
                9691,
                9724
            ],
            [
                9760,
                9820
            ],
            [
                9820,
                9879
            ],
            [
                9879,
                9899
            ],
            [
                9904,
                9929
            ],
            [
                9978,
                10004
            ],
            [
                10039,
                10043
            ],
            [
                10053,
                10055
            ],
            [
                10055,
                10067
            ],
            [
                10078,
                10109
            ],
            [
                10109,
                10135
            ],
            [
                10195,
                10196
            ],
            [
                10137,
                10195
            ],
            [
                10198,
                10205
            ],
            [
                10216,
                10251
            ],
            [
                10463,
                10466
            ],
            [
                10470,
                10496
            ],
            [
                10496,
                10516
            ],
            [
                10524,
                10567
            ],
            [
                10622,
                10646
            ],
            [
                10658,
                10672
            ],
            [
                10672,
                10731
            ],
            [
                10731,
                10762
            ],
            [
                10780,
                10804
            ],
            [
                10856,
                10896
            ],
            [
                10896,
                10969
            ],
            [
                10969,
                11031
            ],
            [
                11031,
                11069
            ],
            [
                11071,
                11072
            ],
            [
                11069,
                11071
            ],
            [
                11073,
                11088
            ],
            [
                11088,
                11092
            ],
            [
                11099,
                11109
            ],
            [
                11139,
                11173
            ],
            [
                11173,
                11228
            ],
            [
                11362,
                11363
            ],
            [
                11245,
                11260
            ],
            [
                11311,
                11359
            ],
            [
                11370,
                11389
            ],
            [
                11578,
                11625
            ],
            [
                11630,
                11697
            ],
            [
                11992,
                12115
            ],
            [
                12115,
                12161
            ],
            [
                12183,
                12203
            ],
            [
                12273,
                12275
            ],
            [
                12275,
                12464
            ],
            [
                12464,
                12535
            ],
            [
                12563,
                12565
            ],
            [
                12570,
                12604
            ],
            [
                12616,
                12617
            ],
            [
                12640,
                12655
            ],
            [
                12661,
                12681
            ],
            [
                12701,
                12733
            ],
            [
                12735,
                12769
            ],
            [
                12815,
                12833
            ],
            [
                12843,
                12860
            ],
            [
                12836,
                12837
            ],
            [
                12863,
                12879
            ],
            [
                12882,
                12909
            ],
            [
                12909,
                12945
            ],
            [
                12945,
                12946
            ],
            [
                13023,
                13061
            ],
            [
                13062,
                13076
            ],
            [
                12967,
                12991
            ],
            [
                13079,
                13096
            ],
            [
                13096,
                13110
            ],
            [
                13130,
                13132
            ],
            [
                13132,
                13148
            ],
            [
                13190,
                13219
            ],
            [
                13228,
                13231
            ],
            [
                13231,
                13271
            ],
            [
                13271,
                13285
            ],
            [
                13285,
                13316
            ],
            [
                13322,
                13341
            ],
            [
                13341,
                13367
            ],
            [
                13435,
                13470
            ],
            [
                13487,
                13499
            ],
            [
                13515,
                13533
            ],
            [
                13536,
                13545
            ],
            [
                13553,
                13566
            ],
            [
                13581,
                13583
            ],
            [
                13637,
                13649
            ],
            [
                13650,
                13684
            ],
            [
                13703,
                13804
            ],
            [
                13924,
                13926
            ],
            [
                13930,
                14020
            ],
            [
                14219,
                14222
            ],
            [
                14270,
                14274
            ],
            [
                14223,
                14258
            ],
            [
                14361,
                14412
            ],
            [
                14412,
                14430
            ],
            [
                14434,
                14442
            ],
            [
                14454,
                14503
            ],
            [
                14513,
                14515
            ],
            [
                14542,
                14594
            ],
            [
                14631,
                14633
            ],
            [
                14633,
                14643
            ],
            [
                14649,
                14661
            ],
            [
                14676,
                14709
            ],
            [
                14709,
                14729
            ],
            [
                14807,
                14839
            ],
            [
                14873,
                14900
            ],
            [
                14793,
                14800
            ],
            [
                14730,
                14732
            ],
            [
                14901,
                14923
            ],
            [
                14930,
                14932
            ],
            [
                14951,
                15025
            ],
            [
                15062,
                15064
            ],
            [
                15064,
                15099
            ],
            [
                15099,
                15121
            ],
            [
                15179,
                15214
            ],
            [
                15214,
                15247
            ],
            [
                15260,
                15327
            ],
            [
                15335,
                15339
            ],
            [
                15394,
                15426
            ],
            [
                15451,
                15504
            ],
            [
                15507,
                15554
            ],
            [
                15562,
                15627
            ],
            [
                15630,
                15664
            ],
            [
                15676,
                15705
            ]
        ],
        "row_chars": [
            [
                0,
                424
            ],
            [
                424,
                475
            ],
            [
                475,
                699
            ],
            [
                699,
                901
            ],
            [
                901,
                1082
            ],
            [
                1082,
                1162
            ],
            [
                1162,
                1342
            ],
            [
                1342,
                1415
            ],
            [
                1415,
                1460
            ],
            [
                1460,
                1488
            ],
            [
                1488,
                1541
            ],
            [
                1541,
                1558
            ],
            [
                1558,
                1611
            ],
            [
                1611,
                1680
            ],
            [
                1680,
                1705
            ],
            [
                1705,
                1794
            ],
            [
                1794,
                1848
            ],
            [
                1848,
                1885
            ],
            [
                1885,
                1920
            ],
            [
                1920,
                2018
            ],
            [
                2018,
                2056
            ],
            [
                2056,
                2104
            ],
            [
                2104,
                2197
            ],
            [
                2197,
                2276
            ],
            [
                2276,
                2293
            ],
            [
                2293,
                2390
            ],
            [
                2390,
                2432
            ],
            [
                2432,
                2737
            ],
            [
                2737,
                2762
            ],
            [
                2762,
                2794
            ],
            [
                2794,
                2860
            ],
            [
                2860,
                2969
            ],
            [
                2969,
                3008
            ],
            [
                3008,
                3021
            ],
            [
                3021,
                3112
            ],
            [
                3112,
                3140
            ],
            [
                3140,
                3166
            ],
            [
                3166,
                3276
            ],
            [
                3276,
                3387
            ],
            [
                3387,
                3417
            ],
            [
                3417,
                3437
            ],
            [
                3437,
                3460
            ],
            [
                3460,
                3481
            ],
            [
                3481,
                3499
            ],
            [
                3499,
                3557
            ],
            [
                3557,
                3658
            ],
            [
                3658,
                3742
            ],
            [
                3742,
                3803
            ],
            [
                3803,
                3822
            ],
            [
                3822,
                3903
            ],
            [
                3903,
                3935
            ],
            [
                3935,
                3988
            ],
            [
                3988,
                4040
            ],
            [
                4040,
                4151
            ],
            [
                4151,
                4245
            ],
            [
                4245,
                4304
            ],
            [
                4304,
                4429
            ],
            [
                4429,
                4495
            ],
            [
                4495,
                4653
            ],
            [
                4653,
                4741
            ],
            [
                4741,
                5046
            ],
            [
                5046,
                5131
            ],
            [
                5131,
                5459
            ],
            [
                5459,
                5578
            ],
            [
                5578,
                5804
            ],
            [
                5804,
                5991
            ],
            [
                5991,
                6062
            ],
            [
                6062,
                6141
            ],
            [
                6141,
                6238
            ],
            [
                6238,
                6385
            ],
            [
                6385,
                6718
            ],
            [
                6718,
                6778
            ],
            [
                6778,
                6877
            ],
            [
                6877,
                7038
            ],
            [
                7038,
                7224
            ],
            [
                7224,
                7408
            ],
            [
                7408,
                7518
            ],
            [
                7518,
                7669
            ],
            [
                7669,
                7698
            ],
            [
                7698,
                7714
            ],
            [
                7714,
                7790
            ],
            [
                7790,
                7866
            ],
            [
                7866,
                7877
            ],
            [
                7877,
                7925
            ],
            [
                7925,
                7935
            ],
            [
                7935,
                7962
            ],
            [
                7962,
                8003
            ],
            [
                8003,
                8089
            ],
            [
                8089,
                8156
            ],
            [
                8156,
                8270
            ],
            [
                8270,
                8316
            ],
            [
                8316,
                8346
            ],
            [
                8346,
                8403
            ],
            [
                8403,
                8523
            ],
            [
                8523,
                8574
            ],
            [
                8574,
                8585
            ],
            [
                8585,
                8683
            ],
            [
                8683,
                8709
            ],
            [
                8709,
                8727
            ],
            [
                8727,
                8748
            ],
            [
                8748,
                8815
            ],
            [
                8815,
                8882
            ],
            [
                8882,
                8922
            ],
            [
                8922,
                9004
            ],
            [
                9004,
                9060
            ],
            [
                9060,
                9103
            ],
            [
                9103,
                9141
            ],
            [
                9141,
                9166
            ],
            [
                9166,
                9329
            ],
            [
                9329,
                9365
            ],
            [
                9365,
                9461
            ],
            [
                9461,
                9505
            ],
            [
                9505,
                9548
            ],
            [
                9548,
                9597
            ],
            [
                9597,
                9626
            ],
            [
                9626,
                9691
            ],
            [
                9691,
                9820
            ],
            [
                9820,
                9879
            ],
            [
                9879,
                9899
            ],
            [
                9899,
                9904
            ],
            [
                9904,
                9932
            ],
            [
                9932,
                9954
            ],
            [
                9954,
                10055
            ],
            [
                10055,
                10109
            ],
            [
                10109,
                10251
            ],
            [
                10251,
                10286
            ],
            [
                10286,
                10349
            ],
            [
                10349,
                10439
            ],
            [
                10439,
                10496
            ],
            [
                10496,
                10569
            ],
            [
                10569,
                10622
            ],
            [
                10622,
                10672
            ],
            [
                10672,
                10731
            ],
            [
                10731,
                10825
            ],
            [
                10825,
                10856
            ],
            [
                10856,
                10896
            ],
            [
                10896,
                10969
            ],
            [
                10969,
                11031
            ],
            [
                11031,
                11088
            ],
            [
                11088,
                11111
            ],
            [
                11111,
                11139
            ],
            [
                11139,
                11173
            ],
            [
                11173,
                11389
            ],
            [
                11389,
                11578
            ],
            [
                11578,
                11698
            ],
            [
                11698,
                11891
            ],
            [
                11891,
                11992
            ],
            [
                11992,
                12115
            ],
            [
                12115,
                12275
            ],
            [
                12275,
                12464
            ],
            [
                12464,
                12565
            ],
            [
                12565,
                12770
            ],
            [
                12770,
                12815
            ],
            [
                12815,
                12909
            ],
            [
                12909,
                12945
            ],
            [
                12945,
                13079
            ],
            [
                13079,
                13096
            ],
            [
                13096,
                13132
            ],
            [
                13132,
                13231
            ],
            [
                13231,
                13271
            ],
            [
                13271,
                13285
            ],
            [
                13285,
                13341
            ],
            [
                13341,
                13367
            ],
            [
                13367,
                13432
            ],
            [
                13432,
                13583
            ],
            [
                13583,
                13637
            ],
            [
                13637,
                13804
            ],
            [
                13804,
                13924
            ],
            [
                13924,
                14021
            ],
            [
                14021,
                14219
            ],
            [
                14219,
                14412
            ],
            [
                14412,
                14633
            ],
            [
                14633,
                14709
            ],
            [
                14709,
                14932
            ],
            [
                14932,
                15064
            ],
            [
                15064,
                15099
            ],
            [
                15099,
                15214
            ],
            [
                15214,
                15247
            ],
            [
                15247,
                15339
            ],
            [
                15339,
                15394
            ],
            [
                15394,
                15504
            ],
            [
                15504,
                15705
            ]
        ]
    },
    "abridged": {
        "text": "Lady Carbury's house in Welbeck Street was modest; but she had made it pretty and pleasant, and was proud to feel that she had comfortable belongings around her when her literary friends came to see her on Tuesday evenings. The door to the back drawing-room was permanently closed; it was here that she carried on her great work of writing. Here she was rarely disturbed by her daughter, although her son would break in upon her privacy without remorse.\nSoon after she had completed her letter to Mr. Alf, Felix entered the room with a cigar in his mouth and threw himself upon the sofa.\n\"My dear boy,\" she said, \"pray leave your tobacco behind when you come in here.\"\n\"Some women swear they like smoke, mother,\" he said, throwing the half-smoked cigar into the fire-place. \"I wonder whether you can let me have twenty pounds?\"\n\"My dear Felix! What is it for?\"\n\"Well, a fellow can't live without some money in his pocket. I do with as little as most fellows. I even get my hair cut on credit.\"\n\"What is to be the end of it, Felix?\"\n\"I never could see the end of anything, mother. I never could pass a dish that I liked in favour of those to follow. What's the use?\"\n\"Have you been at the Melmottes' today?\" It was now five o'clock on a winter afternoon, and Lady Carbury thought her son might have been paying his court to Marie Melmotte the great heiress.\n\"I have just come away.\"\n\"And what do you think of her?\"\n\"To tell the truth, mother, I have thought very little about her. She is not pretty, she is not plain; she is not clever, she is not stupid; she is neither saint nor sinner.\"\n\"The more likely to make a good wife.\"\n\"Perhaps. Good enough, at any rate.\"\n\"What does the mother say?\"\n\"The mother is a caution. Dolly Longestaffe says that somebody says that she was a Bohemian Jewess; but I think she's too fat for that.\"\n\"What does it matter, Felix? Is she civil to you?\"\n\"Yes, civil enough.\"\n\"And the father?\"\n\"Well, he does not turn me out. Of course there are half-a-dozen after her, and I think the old fellow is bewildered among them all. He's thinking more of getting dukes to dine with him than of his daughter's lovers. Any fellow might pick her up who happened to hit her fancy.\"\n\"And why not you?\"\n\"I am doing my best, mother. Can you let me have the money?\"\n\"Oh, Felix, I think you hardly know how poor we are. You have still got your hunters!\"\n\"I have got two horses, if you mean that; and I haven't paid a shilling for their keep since the season began. Look here, mother; this is a risky game, but I am playing it by your advice. If I can marry Miss Melmotte, I suppose all will be right. But I don't think the way to get her is to let all the world know that I haven't got a copper. If I gave up my hunting there would be lots of fellows to tell them in Grosvenor Square.\"\nThe poor woman was unable to argue against this. The money was handed over, and the youth went away with a light heart, hardly listening to his mother's entreaties that the affair with Marie Melmotte might be brought to a speedy conclusion.\nFelix, when he left his mother, went down to the only club to which he now belonged. Clubs require money; and the young baronet, forced to restrict himself to one, chose the worst. It was called the Beargarden, and had been lately opened with the express view of combining parsimony with profligacy.\nThis club did not open till three o'clock in the afternoon. There were no morning papers taken, no library, no morning-room. Dining-rooms, billiard-rooms, and card-rooms would suffice for the Beargarden. Everything was luxurious, and the club was said to prosper. Herr Vossner, the purveyor, carried on affairs so that there was no trouble about anything, smoothing any little difficulties in the settling of accounts.\nPerhaps no young man about town enjoyed the Beargarden more thoroughly than Sir Felix Carbury. The club was close to other clubs, in a small street off St. James's Street, and outwardly sober. Why pay for marble pillars and cornices, when you can neither eat such things, nor drink them, nor gamble with them? But the Beargarden had the best wines - or thought that it had - and the easiest chairs, and two perfect billiard-tables. Hither Sir Felix went with his mother's cheque for 20 in his pocket.\nHe found his friend, Adolphus \"Dolly\" Longestaffe, standing on the steps with a cigar in his mouth, and gazing vacantly at the brick house opposite.\n\"Going to dine here, Dolly?\" said Sir Felix.\n\"I suppose I shall, because it's such a lot of trouble to go anywhere else. I'm engaged somewhere, I know; but I'm not up to getting home and dressing.\"\n\"Going to hunt tomorrow?\"\n\"Well, yes; but I don't suppose I shall. I was going to hunt every day last week, but my fellow never would get me up in time. Why can't fellows hunt at two or three, so that a fellow needn't get up in the middle of the night? I can't get myself to Euston Square by nine. That fellow of mine says he comes in and wakes me, but I never remember it.\"\n\"How many horses have you got at Leighton, Dolly?\"\n\"There were five, but I think that fellow down there sold one; but maybe he bought another. I know he did something.\"\n\"Who rides them?\"\n\"He does, I suppose. Somebody told me that Grasslough was riding two of them last week. I think he tipped that fellow of mine; I call that a low thing to do. I'd ask him, only I know he'd say that I had lent them. Perhaps I did when I was tight, you know.\"\n\"You and Grasslough were never pals.\"\n\"I don't like him. He gives himself airs, and he isn't hard up. Why doesn't he have his own horses? I'll tell you what, Carbury, I've made up my mind, by Jove. I never will lend a horse again to anybody. If fellows want horses let them buy them.\"\n\"But some fellows haven't got any money, Dolly.\"\n\"Then they ought to go on tick. I don't think I've paid for any of mine I've bought this season. There was somebody here yesterday - followed me here to say he wanted to be paid for something! It was horses, I think, because of the fellow's trousers.\"\n\"What did you say?\"\n\"Oh, I didn't say anything. I offered him a cigar, and went upstairs. I suppose he left when he was tired of waiting.\"\n\"I'll tell you what, Dolly;\" said Sir Felix, \"I wish you'd let me ride two of yours for a couple of days - that is, if you don't want them yourself. You know how awfully done up I am. I shall pull through, but it's an awful squeeze in the meantime.\"\n\"Well, you may have them for two days. I don't know whether that fellow of mine will believe you. He wouldn't believe Grasslough, but Grasslough took them anyway.\"\n\"You could write a line to your groom.\"\n\"Oh, my dear fellow, that is such a bore; I don't think I could do that. My fellow will believe you, because you and I have been pals. I think I'll have a little drop of curaao before dinner. Come and try it.\"\nIt was then nearly seven o'clock. Nine hours afterwards the same two men, with two others - including Lord Grasslough - were just rising from a card-table in one of the upstairs rooms of the club. For while no man could get a breakfast at the Beargarden, suppers at three o'clock in the morning were quite within the rule.\nAt four in the morning Dolly Longestaffe was certainly in a condition to lend his horses and to remember nothing about it. He was quite affectionate with Lord Grasslough and his other companions. He was by no means helplessly drunk, and was, perhaps, hardly more silly than when he was sober; but he was willing to play at any game whether he understood it or not, and for any stakes. When Sir Felix got up and said he would play no more, Dolly also got up. Lord Grasslough, with a dark scowl, said that it was not the thing for men to stop when so much money had been lost; at which Dolly as willingly sat down again.\n\"I'm going to hunt tomorrow,\" said Sir Felix - meaning that day - \"and I shall play no more. A man must go to bed at some time.\"\n\"When a man has won as much as you have, he should stay,\" said Lord Grasslough.\n\"Stay how long?\" said Sir Felix angrily. \"That's nonsense. There's an end of this for me tonight.\"\n\"Oh, if you choose,\" said his lordship.\n\"I do choose. Good night, Dolly; we'll settle next time we meet. I've got it all entered.\"\nSir Felix had sat down to the card-table with his mother's 20, and now he had - he didn't know how much. He knew that Dolly Longestaffe owed him over 800, and he had received more than that in ready money and cheques from Lord Grasslough and the other player. As Sir Felix walked up St. James's Street, looking for a cab, he presumed himself to be worth over 700.\nNow that he was in the possession of wealth, he never for a moment thought of paying his bills. Even the large sum which he now so unexpectedly possessed would not have gone far in that; but he could now look bright, and buy presents. It is hard to make love without something in your purse.\nHe found no cab, but there was something so joyous in possessing all this money that it made walking in the night air pleasant. Suddenly he remembered the low wail with which his mother had spoken of her poverty. Now he could give her back the 20. But it occurred to him that it would be foolish to do so. How soon might he want it again? Moreover, he could not repay the money without explaining to her how he had got it. As he let himself into the house he resolved that he would not say anything about it.\nThat morning he was at the station at nine, and went hunting down in Buckinghamshire, riding two of Dolly Longestaffe's horses - for the use of which he paid Dolly's \"fellow\" thirty shillings.",
        "paragraph_chars": [
            [
                0,
                454
            ],
            [
                454,
                588
            ],
            [
                588,
                669
            ],
            [
                669,
                828
            ],
            [
                828,
                861
            ],
            [
                861,
                994
            ],
            [
                994,
                1032
            ],
            [
                1032,
                1166
            ],
            [
                1166,
                1357
            ],
            [
                1357,
                1382
            ],
            [
                1382,
                1414
            ],
            [
                1414,
                1589
            ],
            [
                1589,
                1628
            ],
            [
                1628,
                1665
            ],
            [
                1665,
                1693
            ],
            [
                1693,
                1830
            ],
            [
                1830,
                1881
            ],
            [
                1881,
                1902
            ],
            [
                1902,
                1920
            ],
            [
                1920,
                2198
            ],
            [
                2198,
                2217
            ],
            [
                2217,
                2278
            ],
            [
                2278,
                2365
            ],
            [
                2365,
                2797
            ],
            [
                2797,
                3038
            ],
            [
                3038,
                3338
            ],
            [
                3338,
                3757
            ],
            [
                3757,
                4258
            ],
            [
                4258,
                4407
            ],
            [
                4407,
                4452
            ],
            [
                4452,
                4605
            ],
            [
                4605,
                4631
            ],
            [
                4631,
                4980
            ],
            [
                4980,
                5031
            ],
            [
                5031,
                5149
            ],
            [
                5149,
                5167
            ],
            [
                5167,
                5424
            ],
            [
                5424,
                5462
            ],
            [
                5462,
                5709
            ],
            [
                5709,
                5758
            ],
            [
                5758,
                6010
            ],
            [
                6010,
                6030
            ],
            [
                6030,
                6149
            ],
            [
                6149,
                6399
            ],
            [
                6399,
                6563
            ],
            [
                6563,
                6603
            ],
            [
                6603,
                6813
            ],
            [
                6813,
                7136
            ],
            [
                7136,
                7755
            ],
            [
                7755,
                7884
            ],
            [
                7884,
                7964
            ],
            [
                7964,
                8063
            ],
            [
                8063,
                8103
            ],
            [
                8103,
                8194
            ],
            [
                8194,
                8558
            ],
            [
                8558,
                8850
            ],
            [
                8850,
                9359
            ],
            [
                9359,
                9551
            ]
        ],
        "segment_chars": [
            [
                0,
                224
            ],
            [
                224,
                341
            ],
            [
                341,
                454
            ],
            [
                454,
                588
            ],
            [
                588,
                669
            ],
            [
                669,
                774
            ],
            [
                774,
                828
            ],
            [
                828,
                844
            ],
            [
                844,
                861
            ],
            [
                861,
                922
            ],
            [
                922,
                959
            ],
            [
                959,
                994
            ],
            [
                994,
                1032
            ],
            [
                1032,
                1080
            ],
            [
                1080,
                1149
            ],
            [
                1149,
                1166
            ],
            [
                1166,
                1207
            ],
            [
                1207,
                1357
            ],
            [
                1357,
                1382
            ],
            [
                1382,
                1414
            ],
            [
                1414,
                1480
            ],
            [
                1480,
                1589
            ],
            [
                1589,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1665
            ],
            [
                1665,
                1693
            ],
            [
                1693,
                1719
            ],
            [
                1719,
                1830
            ],
            [
                1830,
                1859
            ],
            [
                1859,
                1881
            ],
            [
                1881,
                1902
            ],
            [
                1902,
                1920
            ],
            [
                1920,
                1952
            ],
            [
                1952,
                2053
            ],
            [
                2053,
                2137
            ],
            [
                2137,
                2198
            ],
            [
                2198,
                2217
            ],
            [
                2217,
                2246
            ],
            [
                2246,
                2278
            ],
            [
                2278,
                2331
            ],
            [
                2331,
                2365
            ],
            [
                2365,
                2476
            ],
            [
                2476,
                2553
            ],
            [
                2553,
                2612
            ],
            [
                2612,
                2707
            ],
            [
                2707,
                2797
            ],
            [
                2797,
                2846
            ],
            [
                2846,
                3038
            ],
            [
                3038,
                3123
            ],
            [
                3123,
                3219
            ],
            [
                3219,
                3338
            ],
            [
                3338,
                3398
            ],
            [
                3398,
                3463
            ],
            [
                3463,
                3542
            ],
            [
                3542,
                3602
            ],
            [
                3602,
                3757
            ],
            [
                3757,
                3852
            ],
            [
                3852,
                3950
            ],
            [
                3950,
                4067
            ],
            [
                4067,
                4189
            ],
            [
                4189,
                4258
            ],
            [
                4258,
                4407
            ],
            [
                4407,
                4436
            ],
            [
                4436,
                4452
            ],
            [
                4452,
                4528
            ],
            [
                4528,
                4605
            ],
            [
                4605,
                4631
            ],
            [
                4631,
                4672
            ],
            [
                4672,
                4758
            ],
            [
                4758,
                4858
            ],
            [
                4858,
                4903
            ],
            [
                4903,
                4980
            ],
            [
                4980,
                5031
            ],
            [
                5031,
                5123
            ],
            [
                5123,
                5149
            ],
            [
                5149,
                5167
            ],
            [
                5167,
                5188
            ],
            [
                5188,
                5255
            ],
            [
                5255,
                5325
            ],
            [
                5325,
                5381
            ],
            [
                5381,
                5424
            ],
            [
                5424,
                5462
            ],
            [
                5462,
                5481
            ],
            [
                5481,
                5526
            ],
            [
                5526,
                5562
            ],
            [
                5562,
                5622
            ],
            [
                5622,
                5666
            ],
            [
                5666,
                5709
            ],
            [
                5709,
                5758
            ],
            [
                5758,
                5790
            ],
            [
                5790,
                5855
            ],
            [
                5855,
                5951
            ],
            [
                5951,
                6010
            ],
            [
                6010,
                6030
            ],
            [
                6030,
                6058
            ],
            [
                6058,
                6100
            ],
            [
                6100,
                6149
            ],
            [
                6149,
                6298
            ],
            [
                6298,
                6333
            ],
            [
                6333,
                6399
            ],
            [
                6399,
                6438
            ],
            [
                6438,
                6497
            ],
            [
                6497,
                6563
            ],
            [
                6563,
                6603
            ],
            [
                6603,
                6676
            ],
            [
                6676,
                6738
            ],
            [
                6738,
                6795
            ],
            [
                6795,
                6813
            ],
            [
                6813,
                6847
            ],
            [
                6847,
                7010
            ],
            [
                7010,
                7136
            ],
            [
                7136,
                7259
            ],
            [
                7259,
                7332
            ],
            [
                7332,
                7521
            ],
            [
                7521,
                7594
            ],
            [
                7594,
                7755
            ],
            [
                7755,
                7848
            ],
            [
                7848,
                7884
            ],
            [
                7884,
                7964
            ],
            [
                7964,
                7981
            ],
            [
                7981,
                8005
            ],
            [
                8005,
                8023
            ],
            [
                8023,
                8063
            ],
            [
                8063,
                8103
            ],
            [
                8103,
                8117
            ],
            [
                8117,
                8168
            ],
            [
                8168,
                8194
            ],
            [
                8194,
                8299
            ],
            [
                8299,
                8454
            ],
            [
                8454,
                8558
            ],
            [
                8558,
                8654
            ],
            [
                8654,
                8793
            ],
            [
                8793,
                8850
            ],
            [
                8850,
                8978
            ],
            [
                8978,
                9063
            ],
            [
                9063,
                9098
            ],
            [
                9098,
                9156
            ],
            [
                9156,
                9189
            ],
            [
                9189,
                9273
            ],
            [
                9273,
                9359
            ],
            [
                9359,
                9551
            ]
        ],
        "overlap_chars": [
            [
                0,
                42
            ],
            [
                43,
                49
            ],
            [
                49,
                54
            ],
            [
                55,
                99
            ],
            [
                100,
                118
            ],
            [
                119,
                205
            ],
            [
                206,
                224
            ],
            [
                224,
                227
            ],
            [
                236,
                261
            ],
            [
                262,
                280
            ],
            [
                289,
                293
            ],
            [
                294,
                298
            ],
            [
                299,
                328
            ],
            [
                329,
                331
            ],
            [
                339,
                341
            ],
            [
                341,
                387
            ],
            [
                397,
                404
            ],
            [
                405,
                453
            ],
            [
                459,
                464
            ],
            [
                465,
                472
            ],
            [
                483,
                500
            ],
            [
                501,
                505
            ],
            [
                506,
                588
            ],
            [
                588,
                637
            ],
            [
                645,
                669
            ],
            [
                669,
                703
            ],
            [
                704,
                730
            ],
            [
                731,
                773
            ],
            [
                775,
                828
            ],
            [
                828,
                842
            ],
            [
                844,
                858
            ],
            [
                858,
                861
            ],
            [
                868,
                922
            ],
            [
                922,
                959
            ],
            [
                959,
                991
            ],
            [
                991,
                994
            ],
            [
                994,
                1032
            ],
            [
                1032,
                1080
            ],
            [
                1080,
                1137
            ],
            [
                1138,
                1149
            ],
            [
                1149,
                1165
            ],
            [
                1166,
                1198
            ],
            [
                1204,
                1207
            ],
            [
                1207,
                1253
            ],
            [
                1254,
                1257
            ],
            [
                1258,
                1278
            ],
            [
                1279,
                1357
            ],
            [
                1357,
                1382
            ],
            [
                1382,
                1414
            ],
            [
                1414,
                1480
            ],
            [
                1480,
                1589
            ],
            [
                1589,
                1628
            ],
            [
                1628,
                1636
            ],
            [
                1636,
                1638
            ],
            [
                1638,
                1649
            ],
            [
                1651,
                1662
            ],
            [
                1665,
                1693
            ],
            [
                1693,
                1719
            ],
            [
                1719,
                1830
            ],
            [
                1830,
                1857
            ],
            [
                1859,
                1881
            ],
            [
                1881,
                1902
            ],
            [
                1902,
                1920
            ],
            [
                1920,
                1950
            ],
            [
                1950,
                1952
            ],
            [
                1952,
                2053
            ],
            [
                2053,
                2137
            ],
            [
                2137,
                2198
            ],
            [
                2198,
                2217
            ],
            [
                2217,
                2218
            ],
            [
                2218,
                2237
            ],
            [
                2238,
                2244
            ],
            [
                2244,
                2246
            ],
            [
                2246,
                2278
            ],
            [
                2278,
                2331
            ],
            [
                2331,
                2362
            ],
            [
                2362,
                2365
            ],
            [
                2365,
                2476
            ],
            [
                2476,
                2510
            ],
            [
                2511,
                2515
            ],
            [
                2515,
                2553
            ],
            [
                2553,
                2612
            ],
            [
                2612,
                2648
            ],
            [
                2652,
                2654
            ],
            [
                2655,
                2707
            ],
            [
                2707,
                2716
            ],
            [
                2717,
                2719
            ],
            [
                2720,
                2730
            ],
            [
                2731,
                2794
            ],
            [
                2794,
                2797
            ],
            [
                2797,
                2825
            ],
            [
                2840,
                2844
            ],
            [
                2844,
                2846
            ],
            [
                2846,
                2855
            ],
            [
                2856,
                2859
            ],
            [
                2867,
                2871
            ],
            [
                2871,
                2896
            ],
            [
                2897,
                3002
            ],
            [
                3003,
                3038
            ],
            [
                3038,
                3123
            ],
            [
                3123,
                3128
            ],
            [
                3129,
                3136
            ],
            [
                3137,
                3142
            ],
            [
                3142,
                3165
            ],
            [
                3165,
                3166
            ],
            [
                3167,
                3193
            ],
            [
                3194,
                3196
            ],
            [
                3197,
                3200
            ],
            [
                3200,
                3219
            ],
            [
                3219,
                3337
            ],
            [
                3338,
                3347
            ],
            [
                3352,
                3355
            ],
            [
                3361,
                3396
            ],
            [
                3396,
                3398
            ],
            [
                3398,
                3408
            ],
            [
                3409,
                3463
            ],
            [
                3463,
                3542
            ],
            [
                3542,
                3556
            ],
            [
                3557,
                3566
            ],
            [
                3566,
                3602
            ],
            [
                3602,
                3629
            ],
            [
                3630,
                3648
            ],
            [
                3649,
                3651
            ],
            [
                3652,
                3692
            ],
            [
                3692,
                3693
            ],
            [
                3694,
                3703
            ],
            [
                3708,
                3727
            ],
            [
                3728,
                3730
            ],
            [
                3731,
                3746
            ],
            [
                3747,
                3755
            ],
            [
                3755,
                3756
            ],
            [
                3757,
                3832
            ],
            [
                3833,
                3852
            ],
            [
                3852,
                3864
            ],
            [
                3865,
                3870
            ],
            [
                3874,
                3904
            ],
            [
                3909,
                3932
            ],
            [
                3933,
                3940
            ],
            [
                3948,
                3950
            ],
            [
                3950,
                3961
            ],
            [
                3962,
                3990
            ],
            [
                3996,
                4067
            ],
            [
                4067,
                4104
            ],
            [
                4107,
                4129
            ],
            [
                4132,
                4163
            ],
            [
                4164,
                4171
            ],
            [
                4172,
                4187
            ],
            [
                4187,
                4189
            ],
            [
                4189,
                4205
            ],
            [
                4216,
                4258
            ],
            [
                4258,
                4270
            ],
            [
                4271,
                4278
            ],
            [
                4296,
                4384
            ],
            [
                4385,
                4406
            ],
            [
                4407,
                4436
            ],
            [
                4436,
                4452
            ],
            [
                4452,
                4528
            ],
            [
                4528,
                4602
            ],
            [
                4605,
                4619
            ],
            [
                4628,
                4631
            ],
            [
                4631,
                4672
            ],
            [
                4672,
                4758
            ],
            [
                4758,
                4761
            ],
            [
                4765,
                4775
            ],
            [
                4776,
                4856
            ],
            [
                4858,
                4903
            ],
            [
                4903,
                4922
            ],
            [
                4923,
                4980
            ],
            [
                4980,
                5031
            ],
            [
                5032,
                5097
            ],
            [
                5104,
                5123
            ],
            [
                5123,
                5149
            ],
            [
                5149,
                5167
            ],
            [
                5167,
                5188
            ],
            [
                5188,
                5255
            ],
            [
                5255,
                5293
            ],
            [
                5294,
                5311
            ],
            [
                5312,
                5325
            ],
            [
                5325,
                5381
            ],
            [
                5381,
                5424
            ],
            [
                5424,
                5462
            ],
            [
                5462,
                5479
            ],
            [
                5479,
                5481
            ],
            [
                5481,
                5502
            ],
            [
                5502,
                5507
            ],
            [
                5508,
                5526
            ],
            [
                5526,
                5562
            ],
            [
                5562,
                5611
            ],
            [
                5611,
                5620
            ],
            [
                5620,
                5622
            ],
            [
                5622,
                5666
            ],
            [
                5666,
                5709
            ],
            [
                5709,
                5758
            ],
            [
                5758,
                5780
            ],
            [
                5784,
                5790
            ],
            [
                5790,
                5855
            ],
            [
                5855,
                5888
            ],
            [
                5891,
                5951
            ],
            [
                5951,
                6010
            ],
            [
                6010,
                6030
            ],
            [
                6031,
                6056
            ],
            [
                6058,
                6084
            ],
            [
                6085,
                6089
            ],
            [
                6098,
                6100
            ],
            [
                6100,
                6112
            ],
            [
                6118,
                6149
            ],
            [
                6149,
                6175
            ],
            [
                6192,
                6193
            ],
            [
                6195,
                6253
            ],
            [
                6256,
                6263
            ],
            [
                6263,
                6298
            ],
            [
                6298,
                6301
            ],
            [
                6307,
                6333
            ],
            [
                6333,
                6353
            ],
            [
                6353,
                6396
            ],
            [
                6399,
                6423
            ],
            [
                6424,
                6438
            ],
            [
                6438,
                6497
            ],
            [
                6497,
                6528
            ],
            [
                6529,
                6553
            ],
            [
                6563,
                6603
            ],
            [
                6603,
                6676
            ],
            [
                6676,
                6738
            ],
            [
                6738,
                6776
            ],
            [
                6776,
                6777
            ],
            [
                6777,
                6779
            ],
            [
                6780,
                6795
            ],
            [
                6795,
                6799
            ],
            [
                6800,
                6810
            ],
            [
                6813,
                6847
            ],
            [
                6847,
                6902
            ],
            [
                6903,
                6904
            ],
            [
                6915,
                6930
            ],
            [
                6933,
                6981
            ],
            [
                6991,
                7010
            ],
            [
                7020,
                7067
            ],
            [
                7068,
                7135
            ],
            [
                7136,
                7259
            ],
            [
                7259,
                7305
            ],
            [
                7310,
                7330
            ],
            [
                7330,
                7332
            ],
            [
                7332,
                7521
            ],
            [
                7521,
                7592
            ],
            [
                7592,
                7594
            ],
            [
                7594,
                7628
            ],
            [
                7628,
                7629
            ],
            [
                7635,
                7650
            ],
            [
                7651,
                7671
            ],
            [
                7677,
                7709
            ],
            [
                7720,
                7754
            ],
            [
                7755,
                7773
            ],
            [
                7782,
                7799
            ],
            [
                7800,
                7801
            ],
            [
                7802,
                7818
            ],
            [
                7821,
                7848
            ],
            [
                7848,
                7884
            ],
            [
                7884,
                7885
            ],
            [
                7885,
                7923
            ],
            [
                7925,
                7939
            ],
            [
                7939,
                7963
            ],
            [
                7964,
                7981
            ],
            [
                7981,
                7995
            ],
            [
                8003,
                8005
            ],
            [
                8005,
                8021
            ],
            [
                8023,
                8052
            ],
            [
                8060,
                8063
            ],
            [
                8063,
                8103
            ],
            [
                8103,
                8117
            ],
            [
                8117,
                8148
            ],
            [
                8149,
                8168
            ],
            [
                8168,
                8194
            ],
            [
                8204,
                8239
            ],
            [
                8240,
                8252
            ],
            [
                8253,
                8271
            ],
            [
                8274,
                8283
            ],
            [
                8284,
                8297
            ],
            [
                8297,
                8299
            ],
            [
                8299,
                8311
            ],
            [
                8318,
                8352
            ],
            [
                8353,
                8454
            ],
            [
                8454,
                8456
            ],
            [
                8467,
                8557
            ],
            [
                8558,
                8561
            ],
            [
                8562,
                8566
            ],
            [
                8567,
                8602
            ],
            [
                8603,
                8654
            ],
            [
                8654,
                8672
            ],
            [
                8673,
                8681
            ],
            [
                8686,
                8735
            ],
            [
                8736,
                8738
            ],
            [
                8739,
                8791
            ],
            [
                8791,
                8793
            ],
            [
                8793,
                8803
            ],
            [
                8804,
                8816
            ],
            [
                8817,
                8850
            ],
            [
                8850,
                8870
            ],
            [
                8871,
                8903
            ],
            [
                8915,
                8942
            ],
            [
                8943,
                8950
            ],
            [
                8951,
                8953
            ],
            [
                8954,
                8976
            ],
            [
                8976,
                8978
            ],
            [
                8987,
                9061
            ],
            [
                9061,
                9063
            ],
            [
                9063,
                9098
            ],
            [
                9098,
                9120
            ],
            [
                9121,
                9156
            ],
            [
                9156,
                9189
            ],
            [
                9197,
                9264
            ],
            [
                9269,
                9273
            ],
            [
                9273,
                9305
            ],
            [
                9306,
                9359
            ],
            [
                9359,
                9406
            ],
            [
                9420,
                9485
            ],
            [
                9488,
                9522
            ],
            [
                9522,
                9551
            ]
        ],
        "row_chars": [
            [
                0,
                224
            ],
            [
                224,
                224
            ],
            [
                224,
                341
            ],
            [
                341,
                454
            ],
            [
                454,
                588
            ],
            [
                588,
                669
            ],
            [
                669,
                774
            ],
            [
                774,
                774
            ],
            [
                774,
                774
            ],
            [
                774,
                774
            ],
            [
                774,
                828
            ],
            [
                828,
                844
            ],
            [
                844,
                844
            ],
            [
                844,
                844
            ],
            [
                844,
                861
            ],
            [
                861,
                861
            ],
            [
                861,
                922
            ],
            [
                922,
                959
            ],
            [
                959,
                959
            ],
            [
                959,
                994
            ],
            [
                994,
                1032
            ],
            [
                1032,
                1080
            ],
            [
                1080,
                1080
            ],
            [
                1080,
                1149
            ],
            [
                1149,
                1166
            ],
            [
                1166,
                1166
            ],
            [
                1166,
                1207
            ],
            [
                1207,
                1357
            ],
            [
                1357,
                1382
            ],
            [
                1382,
                1414
            ],
            [
                1414,
                1480
            ],
            [
                1480,
                1589
            ],
            [
                1589,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1665
            ],
            [
                1665,
                1693
            ],
            [
                1693,
                1719
            ],
            [
                1719,
                1719
            ],
            [
                1719,
                1830
            ],
            [
                1830,
                1859
            ],
            [
                1859,
                1859
            ],
            [
                1859,
                1881
            ],
            [
                1881,
                1902
            ],
            [
                1902,
                1920
            ],
            [
                1920,
                1952
            ],
            [
                1952,
                2053
            ],
            [
                2053,
                2137
            ],
            [
                2137,
                2198
            ],
            [
                2198,
                2217
            ],
            [
                2217,
                2246
            ],
            [
                2246,
                2278
            ],
            [
                2278,
                2331
            ],
            [
                2331,
                2365
            ],
            [
                2365,
                2476
            ],
            [
                2476,
                2553
            ],
            [
                2553,
                2612
            ],
            [
                2612,
                2707
            ],
            [
                2707,
                2707
            ],
            [
                2707,
                2797
            ],
            [
                2797,
                2846
            ],
            [
                2846,
                3038
            ],
            [
                3038,
                3123
            ],
            [
                3123,
                3219
            ],
            [
                3219,
                3338
            ],
            [
                3338,
                3338
            ],
            [
                3338,
                3398
            ],
            [
                3398,
                3463
            ],
            [
                3463,
                3542
            ],
            [
                3542,
                3542
            ],
            [
                3542,
                3602
            ],
            [
                3602,
                3757
            ],
            [
                3757,
                3757
            ],
            [
                3757,
                3852
            ],
            [
                3852,
                3950
            ],
            [
                3950,
                4067
            ],
            [
                4067,
                4189
            ],
            [
                4189,
                4258
            ],
            [
                4258,
                4407
            ],
            [
                4407,
                4436
            ],
            [
                4436,
                4452
            ],
            [
                4452,
                4528
            ],
            [
                4528,
                4605
            ],
            [
                4605,
                4605
            ],
            [
                4605,
                4605
            ],
            [
                4605,
                4605
            ],
            [
                4605,
                4631
            ],
            [
                4631,
                4672
            ],
            [
                4672,
                4758
            ],
            [
                4758,
                4758
            ],
            [
                4758,
                4858
            ],
            [
                4858,
                4858
            ],
            [
                4858,
                4858
            ],
            [
                4858,
                4903
            ],
            [
                4903,
                4980
            ],
            [
                4980,
                5031
            ],
            [
                5031,
                5031
            ],
            [
                5031,
                5123
            ],
            [
                5123,
                5149
            ],
            [
                5149,
                5167
            ],
            [
                5167,
                5188
            ],
            [
                5188,
                5188
            ],
            [
                5188,
                5255
            ],
            [
                5255,
                5255
            ],
            [
                5255,
                5325
            ],
            [
                5325,
                5381
            ],
            [
                5381,
                5424
            ],
            [
                5424,
                5462
            ],
            [
                5462,
                5481
            ],
            [
                5481,
                5526
            ],
            [
                5526,
                5562
            ],
            [
                5562,
                5622
            ],
            [
                5622,
                5666
            ],
            [
                5666,
                5709
            ],
            [
                5709,
                5758
            ],
            [
                5758,
                5790
            ],
            [
                5790,
                5855
            ],
            [
                5855,
                5951
            ],
            [
                5951,
                6010
            ],
            [
                6010,
                6030
            ],
            [
                6030,
                6030
            ],
            [
                6030,
                6058
            ],
            [
                6058,
                6058
            ],
            [
                6058,
                6100
            ],
            [
                6100,
                6149
            ],
            [
                6149,
                6298
            ],
            [
                6298,
                6298
            ],
            [
                6298,
                6298
            ],
            [
                6298,
                6298
            ],
            [
                6298,
                6333
            ],
            [
                6333,
                6399
            ],
            [
                6399,
                6399
            ],
            [
                6399,
                6438
            ],
            [
                6438,
                6497
            ],
            [
                6497,
                6563
            ],
            [
                6563,
                6563
            ],
            [
                6563,
                6603
            ],
            [
                6603,
                6676
            ],
            [
                6676,
                6738
            ],
            [
                6738,
                6795
            ],
            [
                6795,
                6813
            ],
            [
                6813,
                6813
            ],
            [
                6813,
                6847
            ],
            [
                6847,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7136
            ],
            [
                7136,
                7136
            ],
            [
                7136,
                7136
            ],
            [
                7136,
                7259
            ],
            [
                7259,
                7332
            ],
            [
                7332,
                7521
            ],
            [
                7521,
                7594
            ],
            [
                7594,
                7755
            ],
            [
                7755,
                7755
            ],
            [
                7755,
                7848
            ],
            [
                7848,
                7884
            ],
            [
                7884,
                7964
            ],
            [
                7964,
                7981
            ],
            [
                7981,
                8005
            ],
            [
                8005,
                8063
            ],
            [
                8063,
                8103
            ],
            [
                8103,
                8117
            ],
            [
                8117,
                8168
            ],
            [
                8168,
                8194
            ],
            [
                8194,
                8194
            ],
            [
                8194,
                8299
            ],
            [
                8299,
                8299
            ],
            [
                8299,
                8454
            ],
            [
                8454,
                8454
            ],
            [
                8454,
                8558
            ],
            [
                8558,
                8558
            ],
            [
                8558,
                8654
            ],
            [
                8654,
                8793
            ],
            [
                8793,
                8850
            ],
            [
                8850,
                8978
            ],
            [
                8978,
                9063
            ],
            [
                9063,
                9098
            ],
            [
                9098,
                9156
            ],
            [
                9156,
                9189
            ],
            [
                9189,
                9273
            ],
            [
                9273,
                9273
            ],
            [
                9273,
                9359
            ],
            [
                9359,
                9551
            ]
        ]
    }
}