{
    "original": {
        "text": "It was very generally said in the city about this time that the Great South Central Pacific and Mexican Railway was the very best thing out. It was known that Mr. Melmotte had gone into it with heart and hand. There were many who declared,--with gross injustice to the Great Fisker,--that the railway was Melmotte's own child, that he had invented it, advertised it, agitated it, and floated it; but it was not the less popular on that account. A railway from Salt Lake City to Mexico no doubt had much of the flavour of a castle in Spain. Our far-western American brethren are supposed to be imaginative. Mexico has not a reputation among us for commercial security, or that stability which produces its four, five, or six per cent. with the regularity of clockwork. But there was the Panama railway, a small affair which had paid twenty-five per cent.; and there was the great line across the continent to San Francisco, in which enormous fortunes had been made. It came to be believed that men with their eyes open might do as well with the Great South Central as had ever been done before with other speculations, and this belief was no doubt founded on Mr. Melmotte's partiality for the enterprise. Mr. Fisker had \"struck 'ile\" when he induced his partner, Montague, to give him a note to the great man.\nPaul Montague himself, who cannot be said to have been a man having his eyes open, in the city sense of the word, could not learn how the thing was progressing. At the regular meetings of the Board, which never sat for above half an hour, two or three papers were read by Miles Grendall. Melmotte himself would speak a few slow words, intended to be cheery, and always indicative of triumph, and then everybody would agree to everything, somebody would sign something, and the \"Board\" for that day would be over. To Paul Montague this was very unsatisfactory. More than once or twice he endeavoured to stay the proceedings, not as disapproving, but \"simply as desirous of being made to understand;\" but the silent scorn of his chairman put him out of countenance, and the opposition of his colleagues was a barrier which he was not strong enough to overcome. Lord Alfred Grendall would declare that he \"did not think all that was at all necessary.\" Lord Nidderdale, with whom Montague had now become intimate at the Beargarden, would nudge him in the ribs and bid him hold his tongue. Mr. Cohenlupe would make a little speech in fluent but broken English, assuring the Committee that everything was being done after the approved city fashion. Sir Felix, after the first two meetings, was never there. And thus Paul Montague, with a sorely burdened conscience, was carried along as one of the Directors of the Great South Central Pacific and Mexican Railway Company.\nI do not know whether the burden was made lighter to him or heavier, by the fact that the immediate pecuniary result was certainly very comfortable. The Company had not yet been in existence quite six weeks,--or at any rate Melmotte had not been connected with it above that time,--and it had already been suggested to him twice that he should sell fifty shares at 112 10_s_. He did not even yet know how many shares he possessed, but on both occasions he consented to the proposal, and on the following day received a cheque for 625,--that sum representing the profit over and above the original nominal price of 100 a share. The suggestion was made to him by Miles Grendall, and when he asked some questions as to the manner in which the shares had been allocated, he was told that all that would be arranged in accordance with the capital invested and must depend on the final disposition of the Californian property. \"But from what we see, old fellow,\" said Miles, \"I don't think you have anything to fear. You seem to be about the best in of them all. Melmotte wouldn't advise you to sell out gradually, if he didn't look upon the thing as a certain income as far as you are concerned.\"\nPaul Montague understood nothing of all this, and felt that he was standing on ground which might be blown from under his feet at any moment. The uncertainty, and what he feared might be the dishonesty, of the whole thing, made him often very miserable. In those wretched moments his conscience was asserting itself. But again there were times in which he also was almost triumphant, and in which he felt the delight of his wealth. Though he was snubbed at the Board when he wanted explanations, he received very great attention outside the board-room from those connected with the enterprise. Melmotte had asked him to dine two or three times. Mr. Cohenlupe had begged him to go down to his little place at Rickmansworth,--an entreaty with which Montague had not as yet complied. Lord Alfred was always gracious to him, and Nidderdale and Carbury were evidently anxious to make him one of their set at the club. Many other houses became open to him from the same source. Though Melmotte was supposed to be the inventor of the railway, it was known that Fisker, Montague, and Montague were largely concerned in it, and it was known also that Paul Montague was one of the Montagues named in that firm. People, both in the City and the West End, seemed to think that he knew all about it, and treated him as though some of the manna falling from that heaven were at his disposition. There were results from this which were not unpleasing to the young man. He only partially resisted the temptation; and though determined at times to probe the affair to the bottom, was so determined only at times. The money was very pleasant to him. The period would now soon arrive before which he understood himself to be pledged not to make a distinct offer to Henrietta Carbury; and when that period should have been passed, it would be delightful to him to know that he was possessed of property sufficient to enable him to give a wife a comfortable home. In all his aspirations, and in all his fears, he was true to Hetta Carbury, and made her the centre of his hopes. Nevertheless, had Hetta known everything, it may be feared that she would have at any rate endeavoured to dismiss him from her heart.\nThere was considerable uneasiness in the bosoms of others of the Directors, and a disposition to complain against the Grand Director, arising from a grievance altogether different from that which afflicted Montague. Neither had Sir Felix Carbury nor Lord Nidderdale been invited to sell shares, and consequently neither of them had received any remuneration for the use of their names. They knew well that Montague had sold shares. He was quite open on the subject, and had told Felix, whom he hoped some day to regard as his brother-in-law, exactly what shares he had sold, and for how much;--and the two men had endeavoured to make the matter intelligible between themselves. The original price of the shares being 100 each, and 12 10_s._ a share having been paid to Montague as the premium, it was to be supposed that the original capital was re-invested in other shares. But each owned to the other that the matter was very complicated to him, and Montague could only write to Hamilton K. Fisker at San Francisco asking for explanation. As yet he had received no answer. But it was not the wealth flowing into Montague's hands which embittered Nidderdale and Carbury. They understood that he had really brought money into the concern, and was therefore entitled to take money out of it. Nor did it occur to them to grudge Melmotte his more noble pickings, for they knew how great a man was Melmotte. Of Cohenlupe's doings they heard nothing; but he was a regular city man, and had probably supplied funds. Cohenlupe was too deep for their inquiry. But they knew that Lord Alfred had sold shares, and had received the profit; and they knew also how utterly impossible it was that Lord Alfred should have produced capital. If Lord Alfred Grendall was entitled to plunder, why were not they? And if their day for plunder had not yet come, why had Lord Alfred's? And if there was so much cause to fear Lord Alfred that it was necessary to throw him a bone, why should not they also make themselves feared? Lord Alfred passed all his time with Melmotte,--had, as these young men said, become Melmotte's head valet,--and therefore had to be paid. But that reason did not satisfy the young men.\n\"You haven't sold any shares;--have you?\" This question Sir Felix asked Lord Nidderdale at the club. Nidderdale was constant in his attendance at the Board, and Felix was not a little afraid that he might be jockied also by him.\n\"Not a share.\"\n\"Nor got any profits?\"\n\"Not a shilling of any kind. As far as money is concerned my only transaction has been my part of the expense of Fisker's dinner.\"\n\"What do you get then, by going into the city?\" asked Sir Felix.\n\"I'm blessed if I know what I get. I suppose something will turn up some day.\"\n\"In the meantime, you know, there are our names. And Grendall is making a fortune out of it.\"\n\"Poor old duffer,\" said his lordship. \"If he's doing so well, I think Miles ought to be made to pay up something of what he owes. I think we ought to tell him that we shall expect him to have the money ready when that bill of Vossner's comes round.\"\n\"Yes, by George; let's tell him that. Will you do it?\"\n\"Not that it will be the least good. It would be quite unnatural to him to pay anything.\"\n\"Fellows used to pay their gambling debts,\" said Sir Felix, who was still in funds, and who still held a considerable assortment of I. O. U.'s.\n\"They don't now,--unless they like it. How did a fellow manage before, if he hadn't got it?\"\n\"He went smash,\" said Sir Felix, \"and disappeared and was never heard of any more. It was just the same as if he'd been found cheating. I believe a fellow might cheat now and nobody'd say anything!\"\n\"I shouldn't,\" said Lord Nidderdale. \"What's the use of being beastly ill-natured? I'm not very good at saying my prayers, but I do think there's something in that bit about forgiving people. Of course cheating isn't very nice: and it isn't very nice for a fellow to play when he knows he can't pay; but I don't know that it's worse than getting drunk like Dolly Longestaffe, or quarrelling with everybody as Grasslough does,--or trying to marry some poor devil of a girl merely because she's got money. I believe in living in glass houses, but I don't believe in throwing stones. Do you ever read the Bible, Carbury?\"\n\"Read the Bible! Well;--yes;--no;--that is, I suppose, I used to do.\"\n\"I often think I shouldn't have been the first to pick up a stone and pitch it at that woman. Live and let live;--that's my motto.\"\n\"But you agree that we ought to do something about these shares?\" said Sir Felix, thinking that this doctrine of forgiveness might be carried too far.\n\"Oh, certainly. I'll let old Grendall live with all my heart; but then he ought to let me live too. Only, who's to bell the cat?\"\n\"What cat?\"\n\"It's no good our going to old Grendall,\" said Lord Nidderdale, who had some understanding in the matter, \"nor yet to young Grendall. The one would only grunt and say nothing, and the other would tell every lie that came into his head. The cat in this matter I take to be our great master, Augustus Melmotte.\"\nThis little meeting occurred on the day after Felix Carbury's return from Suffolk, and at a time at which, as we know, it was the great duty of his life to get the consent of old Melmotte to his marriage with Marie Melmotte. In doing that he would have to put one bell on the cat, and he thought that for the present that was sufficient. In his heart of hearts he was afraid of Melmotte. But then, as he knew very well, Nidderdale was intent on the same object. Nidderdale, he thought, was a very queer fellow. That talking about the Bible, and the forgiving of trespasses, was very queer; and that allusion to the marrying of heiresses very queer indeed. He knew that Nidderdale wanted to marry the heiress, and Nidderdale must also know that he wanted to marry her. And yet Nidderdale was indelicate enough to talk about it! And now the man asked who should bell the cat! \"You go there oftener than I do, and perhaps you could do it best,\" said Sir Felix.\n\"Go where?\"\n\"To the Board.\"\n\"But you're always at his house. He'd be civil to me, perhaps, because I'm a lord: but then, for the same reason, he'd think I was the bigger fool of the two.\"\n\"I don't see that at all,\" said Sir Felix.\n\"I ain't afraid of him, if you mean that,\" continued Lord Nidderdale. \"He's a wretched old reprobate, and I don't doubt but he'd skin you and me if he could make money off our carcasses. But as he can't skin me, I'll have a shy at him. On the whole I think he rather likes me, because I've always been on the square with him. If it depended on him, you know, I should have the girl to-morrow.\"\n\"Would you?\" Sir Felix did not at all mean to doubt his friend's assertion, but felt it hard to answer so very strange a statement.\n\"But then she don't want me, and I ain't quite sure that I want her. Where the devil would a fellow find himself if the money wasn't all there?\" Lord Nidderdale then sauntered away, leaving the baronet in a deep study of thought as to such a condition of things as that which his lordship had suggested. Where the--mischief would he, Sir Felix Carbury, be, if he were to marry the girl, and then to find that the money was not all there?\nOn the following Friday, which was the Board day, Nidderdale went to the great man's offices in Abchurch Lane, and so contrived that he walked with the great man to the Board meeting. Melmotte was always very gracious in his manner to Lord Nidderdale, but had never, up to this moment, had any speech with his proposed son-in-law about business. \"I wanted just to ask you something,\" said the lord, hanging on the chairman's arm.\n\"Anything you please, my lord.\"\n\"Don't you think that Carbury and I ought to have some shares to sell?\"\n\"No, I don't,--if you ask me.\"\n\"Oh;--I didn't know. But why shouldn't we as well as the others?\"\n\"Have you and Sir Felix put any money into it?\"\n\"Well, if you come to that, I don't suppose we have. How much has Lord Alfred put into it?\"\n\"_I_ have taken shares for Lord Alfred,\" said Melmotte, putting very heavy emphasis on the personal pronoun. \"If it suits me to advance money to Lord Alfred Grendall, I suppose I may do so without asking your lordship's consent, or that of Sir Felix Carbury.\"\n\"Oh, certainly. I don't want to make inquiry as to what you do with your money.\"\n\"I'm sure you don't, and, therefore, we won't say anything more about it. You wait awhile, Lord Nidderdale, and you'll find it will come all right. If you've got a few thousand pounds loose, and will put them into the concern, why, of course you can sell; and, if the shares are up, can sell at a profit. It's presumed just at present that, at some early day, you'll qualify for your directorship by doing so, and till that is done, the shares are allocated to you, but cannot be transferred to you.\"\n\"That's it, is it,\" said Lord Nidderdale, pretending to understand all about it.\n\"If things go on as we hope they will between you and Marie, you can have pretty nearly any number of shares that you please;--that is, if your father consents to a proper settlement.\"\n\"I hope it'll all go smooth, I'm sure,\" said Nidderdale. \"Thank you; I'm ever so much obliged to you, and I'll explain it all to Carbury.\"",
        "paragraph_chars": [
            [
                0,
                1309
            ],
            [
                1309,
                2775
            ],
            [
                2775,
                3967
            ],
            [
                3967,
                6158
            ],
            [
                6158,
                8350
            ],
            [
                8350,
                8579
            ],
            [
                8579,
                8594
            ],
            [
                8594,
                8617
            ],
            [
                8617,
                8748
            ],
            [
                8748,
                8813
            ],
            [
                8813,
                8892
            ],
            [
                8892,
                8986
            ],
            [
                8986,
                9236
            ],
            [
                9236,
                9291
            ],
            [
                9291,
                9381
            ],
            [
                9381,
                9525
            ],
            [
                9525,
                9618
            ],
            [
                9618,
                9817
            ],
            [
                9817,
                10436
            ],
            [
                10436,
                10506
            ],
            [
                10506,
                10638
            ],
            [
                10638,
                10789
            ],
            [
                10789,
                10919
            ],
            [
                10919,
                10931
            ],
            [
                10931,
                11241
            ],
            [
                11241,
                12199
            ],
            [
                12199,
                12211
            ],
            [
                12211,
                12227
            ],
            [
                12227,
                12387
            ],
            [
                12387,
                12430
            ],
            [
                12430,
                12824
            ],
            [
                12824,
                12956
            ],
            [
                12956,
                13394
            ],
            [
                13394,
                13824
            ],
            [
                13824,
                13856
            ],
            [
                13856,
                13928
            ],
            [
                13928,
                13959
            ],
            [
                13959,
                14025
            ],
            [
                14025,
                14073
            ],
            [
                14073,
                14165
            ],
            [
                14165,
                14425
            ],
            [
                14425,
                14506
            ],
            [
                14506,
                15007
            ],
            [
                15007,
                15088
            ],
            [
                15088,
                15273
            ],
            [
                15273,
                15411
            ]
        ],
        "segment_chars": [
            [
                0,
                141
            ],
            [
                141,
                210
            ],
            [
                210,
                445
            ],
            [
                445,
                540
            ],
            [
                540,
                606
            ],
            [
                606,
                734
            ],
            [
                734,
                768
            ],
            [
                768,
                853
            ],
            [
                853,
                965
            ],
            [
                965,
                1204
            ],
            [
                1204,
                1309
            ],
            [
                1309,
                1470
            ],
            [
                1470,
                1597
            ],
            [
                1597,
                1822
            ],
            [
                1822,
                1869
            ],
            [
                1869,
                2168
            ],
            [
                2168,
                2258
            ],
            [
                2258,
                2394
            ],
            [
                2394,
                2552
            ],
            [
                2552,
                2610
            ],
            [
                2610,
                2775
            ],
            [
                2775,
                2924
            ],
            [
                2924,
                3151
            ],
            [
                3151,
                3402
            ],
            [
                3402,
                3696
            ],
            [
                3696,
                3786
            ],
            [
                3786,
                3832
            ],
            [
                3832,
                3967
            ],
            [
                3967,
                4109
            ],
            [
                4109,
                4221
            ],
            [
                4221,
                4284
            ],
            [
                4284,
                4399
            ],
            [
                4399,
                4561
            ],
            [
                4561,
                4612
            ],
            [
                4612,
                4748
            ],
            [
                4748,
                4880
            ],
            [
                4880,
                4939
            ],
            [
                4939,
                5168
            ],
            [
                5168,
                5348
            ],
            [
                5348,
                5421
            ],
            [
                5421,
                5563
            ],
            [
                5563,
                5599
            ],
            [
                5599,
                5910
            ],
            [
                5910,
                6024
            ],
            [
                6024,
                6158
            ],
            [
                6158,
                6374
            ],
            [
                6374,
                6544
            ],
            [
                6544,
                6590
            ],
            [
                6590,
                6836
            ],
            [
                6836,
                7033
            ],
            [
                7033,
                7199
            ],
            [
                7199,
                7233
            ],
            [
                7233,
                7330
            ],
            [
                7330,
                7449
            ],
            [
                7449,
                7562
            ],
            [
                7562,
                7668
            ],
            [
                7668,
                7710
            ],
            [
                7710,
                7883
            ],
            [
                7883,
                7951
            ],
            [
                7951,
                8021
            ],
            [
                8021,
                8164
            ],
            [
                8164,
                8303
            ],
            [
                8303,
                8350
            ],
            [
                8350,
                8392
            ],
            [
                8392,
                8451
            ],
            [
                8451,
                8579
            ],
            [
                8579,
                8594
            ],
            [
                8594,
                8617
            ],
            [
                8617,
                8646
            ],
            [
                8646,
                8748
            ],
            [
                8748,
                8796
            ],
            [
                8796,
                8813
            ],
            [
                8813,
                8848
            ],
            [
                8848,
                8892
            ],
            [
                8892,
                8941
            ],
            [
                8941,
                8986
            ],
            [
                8986,
                9024
            ],
            [
                9024,
                9116
            ],
            [
                9116,
                9236
            ],
            [
                9236,
                9274
            ],
            [
                9274,
                9291
            ],
            [
                9291,
                9328
            ],
            [
                9328,
                9381
            ],
            [
                9381,
                9519
            ],
            [
                9519,
                9521
            ],
            [
                9521,
                9525
            ],
            [
                9525,
                9564
            ],
            [
                9564,
                9618
            ],
            [
                9618,
                9701
            ],
            [
                9701,
                9754
            ],
            [
                9754,
                9817
            ],
            [
                9817,
                9854
            ],
            [
                9854,
                9900
            ],
            [
                9900,
                10009
            ],
            [
                10009,
                10321
            ],
            [
                10321,
                10398
            ],
            [
                10398,
                10436
            ],
            [
                10436,
                10453
            ],
            [
                10453,
                10506
            ],
            [
                10506,
                10600
            ],
            [
                10600,
                10638
            ],
            [
                10638,
                10704
            ],
            [
                10704,
                10789
            ],
            [
                10789,
                10805
            ],
            [
                10805,
                10889
            ],
            [
                10889,
                10919
            ],
            [
                10919,
                10931
            ],
            [
                10931,
                11065
            ],
            [
                11065,
                11167
            ],
            [
                11167,
                11241
            ],
            [
                11241,
                11466
            ],
            [
                11466,
                11579
            ],
            [
                11579,
                11629
            ],
            [
                11629,
                11703
            ],
            [
                11703,
                11752
            ],
            [
                11752,
                11897
            ],
            [
                11897,
                12009
            ],
            [
                12009,
                12068
            ],
            [
                12068,
                12115
            ],
            [
                12115,
                12199
            ],
            [
                12199,
                12211
            ],
            [
                12211,
                12227
            ],
            [
                12227,
                12260
            ],
            [
                12260,
                12387
            ],
            [
                12387,
                12430
            ],
            [
                12430,
                12500
            ],
            [
                12500,
                12617
            ],
            [
                12617,
                12666
            ],
            [
                12666,
                12756
            ],
            [
                12756,
                12824
            ],
            [
                12824,
                12837
            ],
            [
                12837,
                12956
            ],
            [
                12956,
                13025
            ],
            [
                13025,
                13101
            ],
            [
                13101,
                13260
            ],
            [
                13260,
                13394
            ],
            [
                13394,
                13578
            ],
            [
                13578,
                13740
            ],
            [
                13740,
                13824
            ],
            [
                13824,
                13856
            ],
            [
                13856,
                13928
            ],
            [
                13928,
                13959
            ],
            [
                13959,
                13980
            ],
            [
                13980,
                14025
            ],
            [
                14025,
                14073
            ],
            [
                14073,
                14126
            ],
            [
                14126,
                14165
            ],
            [
                14165,
                14274
            ],
            [
                14274,
                14425
            ],
            [
                14425,
                14441
            ],
            [
                14441,
                14506
            ],
            [
                14506,
                14580
            ],
            [
                14580,
                14654
            ],
            [
                14654,
                14811
            ],
            [
                14811,
                15007
            ],
            [
                15007,
                15088
            ],
            [
                15088,
                15273
            ],
            [
                15273,
                15330
            ],
            [
                15330,
                15411
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                22,
                38
            ],
            [
                45,
                141
            ],
            [
                606,
                633
            ],
            [
                643,
                670
            ],
            [
                676,
                685
            ],
            [
                732,
                734
            ],
            [
                768,
                771
            ],
            [
                782,
                800
            ],
            [
                823,
                852
            ],
            [
                855,
                858
            ],
            [
                923,
                925
            ],
            [
                869,
                922
            ],
            [
                932,
                965
            ],
            [
                965,
                967
            ],
            [
                979,
                992
            ],
            [
                1040,
                1063
            ],
            [
                1018,
                1023
            ],
            [
                976,
                978
            ],
            [
                1027,
                1029
            ],
            [
                1116,
                1172
            ],
            [
                1184,
                1203
            ],
            [
                1309,
                1322
            ],
            [
                1330,
                1331
            ],
            [
                1421,
                1470
            ],
            [
                1470,
                1484
            ],
            [
                1534,
                1538
            ],
            [
                1542,
                1546
            ],
            [
                1485,
                1506
            ],
            [
                1546,
                1595
            ],
            [
                1597,
                1605
            ],
            [
                1614,
                1643
            ],
            [
                1678,
                1821
            ],
            [
                1822,
                1869
            ],
            [
                1869,
                1883
            ],
            [
                1893,
                1895
            ],
            [
                1908,
                1910
            ],
            [
                1916,
                1932
            ],
            [
                1958,
                1968
            ],
            [
                1992,
                2044
            ],
            [
                2073,
                2109
            ],
            [
                2124,
                2168
            ],
            [
                2168,
                2225
            ],
            [
                2230,
                2258
            ],
            [
                2258,
                2273
            ],
            [
                2337,
                2352
            ],
            [
                2365,
                2394
            ],
            [
                2394,
                2518
            ],
            [
                2525,
                2552
            ],
            [
                2552,
                2610
            ],
            [
                2610,
                2686
            ],
            [
                2773,
                2775
            ],
            [
                2775,
                2831
            ],
            [
                2832,
                2874
            ],
            [
                2885,
                2924
            ],
            [
                2924,
                2939
            ],
            [
                2972,
                2982
            ],
            [
                3057,
                3146
            ],
            [
                3147,
                3148
            ],
            [
                3151,
                3166
            ],
            [
                3171,
                3240
            ],
            [
                3256,
                3308
            ],
            [
                3320,
                3343
            ],
            [
                3353,
                3371
            ],
            [
                3380,
                3402
            ],
            [
                3456,
                3469
            ],
            [
                3436,
                3450
            ],
            [
                3511,
                3553
            ],
            [
                3568,
                3695
            ],
            [
                3696,
                3786
            ],
            [
                3786,
                3832
            ],
            [
                3832,
                3896
            ],
            [
                3917,
                3967
            ],
            [
                3967,
                4109
            ],
            [
                4109,
                4221
            ],
            [
                4284,
                4287
            ],
            [
                4294,
                4327
            ],
            [
                4367,
                4399
            ],
            [
                4399,
                4462
            ],
            [
                4496,
                4518
            ],
            [
                4545,
                4548
            ],
            [
                4559,
                4561
            ],
            [
                4561,
                4612
            ],
            [
                4612,
                4688
            ],
            [
                4746,
                4748
            ],
            [
                4748,
                4763
            ],
            [
                4771,
                4779
            ],
            [
                4786,
                4873
            ],
            [
                4878,
                4879
            ],
            [
                5563,
                5599
            ],
            [
                5599,
                5602
            ],
            [
                5610,
                5615
            ],
            [
                5620,
                5647
            ],
            [
                5681,
                5692
            ],
            [
                5704,
                5740
            ],
            [
                5776,
                5823
            ],
            [
                5828,
                5837
            ],
            [
                5841,
                5849
            ],
            [
                5875,
                5910
            ],
            [
                5910,
                5932
            ],
            [
                5934,
                5937
            ],
            [
                5949,
                6024
            ],
            [
                6024,
                6065
            ],
            [
                6088,
                6091
            ],
            [
                6098,
                6102
            ],
            [
                6127,
                6158
            ],
            [
                6195,
                6198
            ],
            [
                6223,
                6233
            ],
            [
                6290,
                6291
            ],
            [
                6305,
                6316
            ],
            [
                6264,
                6271
            ],
            [
                6372,
                6374
            ],
            [
                6374,
                6381
            ],
            [
                6386,
                6423
            ],
            [
                6382,
                6385
            ],
            [
                6424,
                6502
            ],
            [
                6542,
                6544
            ],
            [
                6564,
                6572
            ],
            [
                6628,
                6666
            ],
            [
                6680,
                6749
            ],
            [
                6834,
                6836
            ],
            [
                6836,
                6894
            ],
            [
                6895,
                6896
            ],
            [
                6899,
                6935
            ],
            [
                6950,
                6958
            ],
            [
                6965,
                7033
            ],
            [
                7033,
                7036
            ],
            [
                7061,
                7097
            ],
            [
                7104,
                7118
            ],
            [
                7136,
                7185
            ],
            [
                7186,
                7199
            ],
            [
                7199,
                7232
            ],
            [
                7233,
                7330
            ],
            [
                7330,
                7449
            ],
            [
                7449,
                7496
            ],
            [
                7508,
                7517
            ],
            [
                7635,
                7638
            ],
            [
                7562,
                7602
            ],
            [
                7666,
                7668
            ],
            [
                7668,
                7710
            ],
            [
                7710,
                7800
            ],
            [
                7806,
                7883
            ],
            [
                7883,
                7951
            ],
            [
                7951,
                8020
            ],
            [
                8350,
                8378
            ],
            [
                8381,
                8392
            ],
            [
                8410,
                8450
            ],
            [
                8579,
                8594
            ],
            [
                8594,
                8617
            ],
            [
                8617,
                8632
            ],
            [
                8644,
                8646
            ],
            [
                8848,
                8892
            ],
            [
                8892,
                8919
            ],
            [
                8945,
                8986
            ],
            [
                9024,
                9070
            ],
            [
                9082,
                9116
            ],
            [
                9116,
                9236
            ],
            [
                9236,
                9251
            ],
            [
                9291,
                9326
            ],
            [
                9326,
                9327
            ],
            [
                9381,
                9444
            ],
            [
                9473,
                9524
            ],
            [
                9618,
                9619
            ],
            [
                9572,
                9580
            ],
            [
                9622,
                9632
            ],
            [
                9594,
                9595
            ],
            [
                9652,
                9701
            ],
            [
                9701,
                9721
            ],
            [
                9725,
                9730
            ],
            [
                9738,
                9754
            ],
            [
                9754,
                9817
            ],
            [
                9817,
                9854
            ],
            [
                9854,
                9900
            ],
            [
                10600,
                10617
            ],
            [
                10620,
                10638
            ],
            [
                10638,
                10704
            ],
            [
                10704,
                10718
            ],
            [
                10787,
                10789
            ],
            [
                10789,
                10805
            ],
            [
                10932,
                10993
            ],
            [
                11063,
                11065
            ],
            [
                11197,
                11199
            ],
            [
                11203,
                11206
            ],
            [
                11213,
                11241
            ],
            [
                11241,
                11245
            ],
            [
                11253,
                11323
            ],
            [
                11360,
                11400
            ],
            [
                11420,
                11428
            ],
            [
                11405,
                11412
            ],
            [
                11429,
                11455
            ],
            [
                11464,
                11466
            ],
            [
                11579,
                11628
            ],
            [
                12115,
                12122
            ],
            [
                12212,
                12224
            ],
            [
                12129,
                12199
            ],
            [
                12227,
                12260
            ],
            [
                12260,
                12313
            ],
            [
                12320,
                12357
            ],
            [
                12362,
                12373
            ],
            [
                12384,
                12387
            ],
            [
                12387,
                12430
            ],
            [
                12430,
                12452
            ],
            [
                12470,
                12500
            ],
            [
                12500,
                12531
            ],
            [
                12550,
                12553
            ],
            [
                12642,
                12653
            ],
            [
                12658,
                12666
            ],
            [
                12666,
                12731
            ],
            [
                12739,
                12756
            ],
            [
                12756,
                12811
            ],
            [
                12821,
                12824
            ],
            [
                12824,
                12836
            ],
            [
                12956,
                12960
            ],
            [
                12966,
                13025
            ],
            [
                13025,
                13088
            ],
            [
                13093,
                13100
            ],
            [
                13101,
                13157
            ],
            [
                13163,
                13167
            ],
            [
                13158,
                13160
            ],
            [
                13177,
                13184
            ],
            [
                13258,
                13260
            ],
            [
                13260,
                13265
            ],
            [
                13280,
                13351
            ],
            [
                13355,
                13382
            ],
            [
                13387,
                13394
            ],
            [
                13394,
                13508
            ],
            [
                13512,
                13521
            ],
            [
                13537,
                13562
            ],
            [
                13569,
                13578
            ],
            [
                13578,
                13611
            ],
            [
                13626,
                13659
            ],
            [
                13664,
                13666
            ],
            [
                13724,
                13739
            ],
            [
                13740,
                13742
            ],
            [
                13750,
                13754
            ],
            [
                13743,
                13749
            ],
            [
                13755,
                13782
            ],
            [
                13822,
                13823
            ],
            [
                13856,
                13928
            ],
            [
                13928,
                13940
            ],
            [
                13956,
                13959
            ],
            [
                13980,
                14025
            ],
            [
                14025,
                14073
            ],
            [
                14073,
                14078
            ],
            [
                14099,
                14126
            ],
            [
                14126,
                14165
            ],
            [
                14165,
                14166
            ],
            [
                14167,
                14168
            ],
            [
                14170,
                14220
            ],
            [
                14234,
                14248
            ],
            [
                14272,
                14274
            ],
            [
                14274,
                14361
            ],
            [
                14369,
                14373
            ],
            [
                14385,
                14396
            ],
            [
                14405,
                14422
            ],
            [
                14382,
                14384
            ],
            [
                14422,
                14425
            ],
            [
                14425,
                14441
            ],
            [
                14441,
                14456
            ],
            [
                14476,
                14506
            ],
            [
                14506,
                14580
            ],
            [
                14584,
                14654
            ],
            [
                14654,
                14700
            ],
            [
                14706,
                14788
            ],
            [
                14789,
                14811
            ],
            [
                14811,
                14824
            ],
            [
                14841,
                15007
            ],
            [
                15007,
                15073
            ],
            [
                15086,
                15088
            ],
            [
                15088,
                15115
            ],
            [
                15126,
                15213
            ],
            [
                15215,
                15273
            ],
            [
                15273,
                15330
            ],
            [
                15330,
                15411
            ]
        ],
        "row_chars": [
            [
                0,
                141
            ],
            [
                141,
                210
            ],
            [
                210,
                445
            ],
            [
                445,
                540
            ],
            [
                540,
                606
            ],
            [
                606,
                734
            ],
            [
                734,
                768
            ],
            [
                768,
                965
            ],
            [
                965,
                1204
            ],
            [
                1204,
                1309
            ],
            [
                1309,
                1470
            ],
            [
                1470,
                1822
            ],
            [
                1822,
                1869
            ],
            [
                1869,
                2168
            ],
            [
                2168,
                2258
            ],
            [
                2258,
                2394
            ],
            [
                2394,
                2552
            ],
            [
                2552,
                2610
            ],
            [
                2610,
                2775
            ],
            [
                2775,
                2924
            ],
            [
                2924,
                3151
            ],
            [
                3151,
                3402
            ],
            [
                3402,
                3696
            ],
            [
                3696,
                3786
            ],
            [
                3786,
                3832
            ],
            [
                3832,
                3967
            ],
            [
                3967,
                4109
            ],
            [
                4109,
                4221
            ],
            [
                4221,
                4284
            ],
            [
                4284,
                4399
            ],
            [
                4399,
                4561
            ],
            [
                4561,
                4612
            ],
            [
                4612,
                4748
            ],
            [
                4748,
                4880
            ],
            [
                4880,
                4939
            ],
            [
                4939,
                5168
            ],
            [
                5168,
                5348
            ],
            [
                5348,
                5421
            ],
            [
                5421,
                5563
            ],
            [
                5563,
                5599
            ],
            [
                5599,
                5910
            ],
            [
                5910,
                6024
            ],
            [
                6024,
                6158
            ],
            [
                6158,
                6374
            ],
            [
                6374,
                6544
            ],
            [
                6544,
                6836
            ],
            [
                6836,
                7033
            ],
            [
                7033,
                7199
            ],
            [
                7199,
                7233
            ],
            [
                7233,
                7330
            ],
            [
                7330,
                7449
            ],
            [
                7449,
                7668
            ],
            [
                7668,
                7710
            ],
            [
                7710,
                7883
            ],
            [
                7883,
                7951
            ],
            [
                7951,
                8021
            ],
            [
                8021,
                8164
            ],
            [
                8164,
                8303
            ],
            [
                8303,
                8350
            ],
            [
                8350,
                8392
            ],
            [
                8392,
                8451
            ],
            [
                8451,
                8579
            ],
            [
                8579,
                8594
            ],
            [
                8594,
                8617
            ],
            [
                8617,
                8646
            ],
            [
                8646,
                8748
            ],
            [
                8748,
                8796
            ],
            [
                8796,
                8813
            ],
            [
                8813,
                8848
            ],
            [
                8848,
                8892
            ],
            [
                8892,
                8986
            ],
            [
                8986,
                9024
            ],
            [
                9024,
                9116
            ],
            [
                9116,
                9236
            ],
            [
                9236,
                9274
            ],
            [
                9274,
                9291
            ],
            [
                9291,
                9328
            ],
            [
                9328,
                9381
            ],
            [
                9381,
                9525
            ],
            [
                9525,
                9564
            ],
            [
                9564,
                9701
            ],
            [
                9701,
                9754
            ],
            [
                9754,
                9817
            ],
            [
                9817,
                9854
            ],
            [
                9854,
                9900
            ],
            [
                9900,
                10009
            ],
            [
                10009,
                10321
            ],
            [
                10321,
                10398
            ],
            [
                10398,
                10436
            ],
            [
                10436,
                10453
            ],
            [
                10453,
                10506
            ],
            [
                10506,
                10600
            ],
            [
                10600,
                10638
            ],
            [
                10638,
                10704
            ],
            [
                10704,
                10789
            ],
            [
                10789,
                10805
            ],
            [
                10805,
                10889
            ],
            [
                10889,
                10919
            ],
            [
                10919,
                10931
            ],
            [
                10931,
                11065
            ],
            [
                11065,
                11167
            ],
            [
                11167,
                11241
            ],
            [
                11241,
                11466
            ],
            [
                11466,
                11579
            ],
            [
                11579,
                11629
            ],
            [
                11629,
                11703
            ],
            [
                11703,
                11752
            ],
            [
                11752,
                11897
            ],
            [
                11897,
                12009
            ],
            [
                12009,
                12068
            ],
            [
                12068,
                12115
            ],
            [
                12115,
                12227
            ],
            [
                12227,
                12260
            ],
            [
                12260,
                12387
            ],
            [
                12387,
                12430
            ],
            [
                12430,
                12500
            ],
            [
                12500,
                12666
            ],
            [
                12666,
                12756
            ],
            [
                12756,
                12824
            ],
            [
                12824,
                12837
            ],
            [
                12837,
                12956
            ],
            [
                12956,
                13025
            ],
            [
                13025,
                13101
            ],
            [
                13101,
                13260
            ],
            [
                13260,
                13394
            ],
            [
                13394,
                13578
            ],
            [
                13578,
                13740
            ],
            [
                13740,
                13824
            ],
            [
                13824,
                13856
            ],
            [
                13856,
                13928
            ],
            [
                13928,
                13959
            ],
            [
                13959,
                13980
            ],
            [
                13980,
                14025
            ],
            [
                14025,
                14073
            ],
            [
                14073,
                14126
            ],
            [
                14126,
                14165
            ],
            [
                14165,
                14274
            ],
            [
                14274,
                14425
            ],
            [
                14425,
                14441
            ],
            [
                14441,
                14506
            ],
            [
                14506,
                14580
            ],
            [
                14580,
                14654
            ],
            [
                14654,
                14811
            ],
            [
                14811,
                15007
            ],
            [
                15007,
                15088
            ],
            [
                15088,
                15273
            ],
            [
                15273,
                15330
            ],
            [
                15330,
                15411
            ]
        ]
    },
    "abridged": {
        "text": "It was said in the city at this time that the Great South Central Pacific and Mexican Railway was the very best thing out. Mexico has not a reputation for commercial security, or stability. But the Panama railway had paid twenty-five per cent; and in the great line across the continent to San Francisco, enormous fortunes had been made. It was believed that the Great South Central might be just as successful, and this belief was no doubt founded on Mr. Melmotte's support for the enterprise.\nPaul Montague, however, could not learn how the thing was progressing. At the regular half-hour meetings of the Board, two or three papers were read by Miles Grendall; Melmotte would speak a few slow words, indicative of triumph, and then everybody would agree to everything, somebody would sign something, and the \"Board\" for that day would be over.\nTo Paul Montague this was very unsatisfactory. More than once he tried to halt the proceedings, \"simply as wishing to understand;\" but the silent scorn of his chairman and the opposition of his colleagues were barriers which he was not strong enough to overcome. Lord Alfred Grendall would declare that he \"did not think that was at all necessary.\" Lord Nidderdale would nudge him and bid him hold his tongue. Mr. Cohenlupe would make a little speech in fluent but broken English, assuring the Committee that everything was being done in the approved city fashion. Sir Felix, after the first two meetings, was never there. And thus Paul Montague, with a sorely burdened conscience, was carried along.\nI do not know whether the burden was made lighter to him, or heavier, by the fact that the immediate financial result was certainly very comfortable. The Company had only existed six weeks, and it had already been suggested to him twice that he should sell fifty shares at 112 10s. He did not even know how many shares he possessed, but on both occasions he consented, and on the following day received a cheque for 625 - representing the profit above the original price of 100 a share. When he asked Miles Grendall how the shares had been allocated, he was told it would be arranged in accordance with the capital invested and must depend on the final disposition of the Californian property.\n\"But from what we see, old fellow,\" said Miles, \"I don't think you have anything to fear. You seem to be about the best in of them all. Melmotte wouldn't advise you to sell out gradually, if he didn't see it as a certain income as far as you are concerned.\"\nPaul Montague understood nothing of all this, and felt that he was standing on ground which might be blown from under his feet at any moment. The uncertainty, and what he feared might be the dishonesty, of the whole thing, made him often very miserable. But there were times in which he also felt the delight of his wealth. Though he was snubbed at the Board when he wanted explanations, outside the Board-room the Directors were attentive. Melmotte had asked him to dine two or three times. Mr. Cohenlupe had begged him to go down to his little place at Rickmansworth. Lord Alfred was gracious, and Nidderdale and Carbury were evidently anxious to make him one of their set at the Beargarden.\nCertainly the money was very pleasant to him. The time would soon arrive before which he had promised not to make an offer to Henrietta Carbury; and when it did, it would be delightful to him to know that he possessed enough property to give a wife a comfortable home. In all his aspirations and fears, he was true to Hetta Carbury, and made her the centre of his hopes. Nevertheless, had Hetta known everything, she might have tried to dismiss him from her heart.\nThe other Directors, however, had a grievance against Melmotte. Neither Sir Felix Carbury nor Lord Nidderdale had been invited to sell shares, and consequently neither of them had received any money. Montague had told Felix, whom he hoped some day would be his brother-in-law, exactly what shares he had sold, and for how much. The original price of the shares being 100 each, and 12 10s. a share having been paid to Montague, it was supposed that the original capital was re-invested in other shares. But they agreed that the matter was very complicated, and Montague wrote to Hamilton K. Fisker at San Francisco asking for an explanation. As yet he had received no answer.\nBut it was not the wealth flowing into Montague's hands which embittered Nidderdale and Carbury. They understood that he had really brought money into the concern, and was therefore entitled to take money out of it. Nor did it occur to them to grudge Melmotte his pickings, and of Cohenlupe's doings they heard nothing. Cohenlupe was too deep for their inquiry. But they knew that Lord Alfred had sold shares, and had received the profit; and they knew how utterly impossible it was that Lord Alfred should have produced capital. If Lord Alfred Grendall was entitled to plunder, why were not they? And if their day for plunder had not yet come, why had Lord Alfred's?\n\"You haven't sold any shares, have you?\" Sir Felix asked Lord Nidderdale at the club.\n\"Not a share.\"\n\"Nor got any profits?\"\n\"Not a shilling. I suppose something will turn up some day.\"\n\"In the meantime, you know, Grendall is making a fortune out of it.\"\n\"If he's doing so well, I think Miles ought to pay up something of what he owes. I think we ought to tell him that we shall expect him to have the money ready when that bill of Vossner's comes round.\"\n\"Yes, by George.\"\n\"Not that it will be the least good,\" said Nidderdale.\n\"Fellows used to pay their gambling debts,\" said Sir Felix, who still held a considerable assortment of I.O.U.'s. \"Otherwise a fellow went smash, and disappeared and was never heard of any more. It was just the same if he was found cheating. I believe a fellow might cheat now and nobody'd say anything!\"\n\"I shouldn't,\" said Lord Nidderdale. \"What's the use of being beastly ill-natured? Live and let live - that's my motto.\"\n\"But you agree that we ought to do something about these shares?\" said Sir Felix.\n\"Oh, certainly. It's no good our going to old Grendall,\" said Lord Nidderdale. \"We should go to our master, Augustus Melmotte.\"\nThis meeting occurred on the day after Felix Carbury's return from Suffolk, when it was the great duty of his life to get Melmotte's consent to his marriage with Marie. In his heart of hearts he was afraid of Melmotte.\n\"You go to the Board oftener than I do, and perhaps you could do it best,\" said Sir Felix.\n\"But you're always at his house. He'd be civil to me, perhaps, because I'm a lord: but for the same reason, he'd think I was a bigger fool.\"\n\"I don't see that at all,\" said Sir Felix.\n\"I ain't afraid of him,\" continued Lord Nidderdale. \"He's a wretched old reprobate, but I'll have a go at him. On the whole I think he rather likes me, because I've always been square with him. If it depended on him, you know, I should have the girl tomorrow.\"\n\"Would you?\"\n\"But she don't want me, and I ain't quite sure that I want her. Where the devil would a fellow find himself if the money wasn't there?\"\nLord Nidderdale then sauntered away, leaving the baronet deep in thought. Where would he, Sir Felix Carbury, be, if he were to marry the girl, and then find that the money was not there?\nOn the following Friday, which was the Board day, Nidderdale went to the great man's offices in Abchurch Lane, and contrived to walk with the great man to the meeting. Melmotte was always very gracious to Lord Nidderdale, but had never spoken to him about business.\n\"I just wanted to ask you something,\" said Nidderdale. \"Don't you think that Carbury and I ought to have some shares to sell?\"\n\"No, I don't.\"\n\"But why shouldn't we as well as the others?\"\n\"Have you and Sir Felix put any money into it?\"\n\"Well, I don't suppose we have. How much has Lord Alfred put into it?\"\n\"I have taken shares for Lord Alfred,\" said Melmotte, with heavy emphasis. \"If it suits me to advance money to Lord Alfred Grendall, I suppose I may do so without your consent, or Sir Felix Carbury's.\"\n\"Oh, certainly. I don't want to ask what you do with your money.\"\n\"I'm sure you don't, and, therefore, we won't say anything more about it. Wait awhile, Lord Nidderdale, and you'll find it will come all right. If you've got a few thousand pounds loose, and put them into the concern, why, of course you can sell; and, if the shares are up, you can sell at a profit. It's presumed that, at some early day, you'll qualify for your directorship by doing so, and till that is done, the shares are allocated to you, but cannot be transferred to you.\"\n\"That's it, is it,\" said Lord Nidderdale, pretending to understand.\n\"If things go on as we hope between you and Marie, you can have pretty nearly any number of shares that you please; that is, if your father consents to a proper settlement.\"\n\"I hope it'll all go smooth, I'm sure,\" said Nidderdale. \"Thank you; I'm ever so much obliged to you, and I'll explain it all to Carbury.\"",
        "paragraph_chars": [
            [
                0,
                495
            ],
            [
                495,
                846
            ],
            [
                846,
                1547
            ],
            [
                1547,
                2241
            ],
            [
                2241,
                2499
            ],
            [
                2499,
                3193
            ],
            [
                3193,
                3658
            ],
            [
                3658,
                4333
            ],
            [
                4333,
                5001
            ],
            [
                5001,
                5087
            ],
            [
                5087,
                5102
            ],
            [
                5102,
                5125
            ],
            [
                5125,
                5186
            ],
            [
                5186,
                5255
            ],
            [
                5255,
                5456
            ],
            [
                5456,
                5474
            ],
            [
                5474,
                5529
            ],
            [
                5529,
                5834
            ],
            [
                5834,
                5955
            ],
            [
                5955,
                6037
            ],
            [
                6037,
                6165
            ],
            [
                6165,
                6384
            ],
            [
                6384,
                6475
            ],
            [
                6475,
                6616
            ],
            [
                6616,
                6659
            ],
            [
                6659,
                6920
            ],
            [
                6920,
                6933
            ],
            [
                6933,
                7069
            ],
            [
                7069,
                7256
            ],
            [
                7256,
                7522
            ],
            [
                7522,
                7649
            ],
            [
                7649,
                7664
            ],
            [
                7664,
                7710
            ],
            [
                7710,
                7758
            ],
            [
                7758,
                7829
            ],
            [
                7829,
                8031
            ],
            [
                8031,
                8097
            ],
            [
                8097,
                8577
            ],
            [
                8577,
                8645
            ],
            [
                8645,
                8819
            ],
            [
                8819,
                8957
            ]
        ],
        "segment_chars": [
            [
                0,
                123
            ],
            [
                123,
                190
            ],
            [
                190,
                338
            ],
            [
                338,
                495
            ],
            [
                495,
                566
            ],
            [
                566,
                846
            ],
            [
                846,
                893
            ],
            [
                893,
                1109
            ],
            [
                1109,
                1195
            ],
            [
                1195,
                1256
            ],
            [
                1256,
                1411
            ],
            [
                1411,
                1469
            ],
            [
                1469,
                1547
            ],
            [
                1547,
                1697
            ],
            [
                1697,
                1829
            ],
            [
                1829,
                2034
            ],
            [
                2034,
                2241
            ],
            [
                2241,
                2331
            ],
            [
                2331,
                2377
            ],
            [
                2377,
                2499
            ],
            [
                2499,
                2641
            ],
            [
                2641,
                2753
            ],
            [
                2753,
                2823
            ],
            [
                2823,
                2940
            ],
            [
                2940,
                2991
            ],
            [
                2991,
                3069
            ],
            [
                3069,
                3193
            ],
            [
                3193,
                3239
            ],
            [
                3239,
                3462
            ],
            [
                3462,
                3564
            ],
            [
                3564,
                3658
            ],
            [
                3658,
                3722
            ],
            [
                3722,
                3858
            ],
            [
                3858,
                3986
            ],
            [
                3986,
                4047
            ],
            [
                4047,
                4160
            ],
            [
                4160,
                4299
            ],
            [
                4299,
                4333
            ],
            [
                4333,
                4430
            ],
            [
                4430,
                4549
            ],
            [
                4549,
                4653
            ],
            [
                4653,
                4695
            ],
            [
                4695,
                4863
            ],
            [
                4863,
                4931
            ],
            [
                4931,
                5001
            ],
            [
                5001,
                5042
            ],
            [
                5042,
                5087
            ],
            [
                5087,
                5102
            ],
            [
                5102,
                5125
            ],
            [
                5125,
                5142
            ],
            [
                5142,
                5186
            ],
            [
                5186,
                5255
            ],
            [
                5255,
                5336
            ],
            [
                5336,
                5456
            ],
            [
                5456,
                5474
            ],
            [
                5474,
                5529
            ],
            [
                5529,
                5643
            ],
            [
                5643,
                5724
            ],
            [
                5724,
                5771
            ],
            [
                5771,
                5834
            ],
            [
                5834,
                5871
            ],
            [
                5871,
                5917
            ],
            [
                5917,
                5955
            ],
            [
                5955,
                6021
            ],
            [
                6021,
                6037
            ],
            [
                6037,
                6053
            ],
            [
                6053,
                6116
            ],
            [
                6116,
                6165
            ],
            [
                6165,
                6334
            ],
            [
                6334,
                6384
            ],
            [
                6384,
                6475
            ],
            [
                6475,
                6508
            ],
            [
                6508,
                6616
            ],
            [
                6616,
                6659
            ],
            [
                6659,
                6711
            ],
            [
                6711,
                6770
            ],
            [
                6770,
                6853
            ],
            [
                6853,
                6920
            ],
            [
                6920,
                6933
            ],
            [
                6933,
                6997
            ],
            [
                6997,
                7069
            ],
            [
                7069,
                7143
            ],
            [
                7143,
                7256
            ],
            [
                7256,
                7424
            ],
            [
                7424,
                7522
            ],
            [
                7522,
                7577
            ],
            [
                7577,
                7649
            ],
            [
                7649,
                7664
            ],
            [
                7664,
                7710
            ],
            [
                7710,
                7758
            ],
            [
                7758,
                7790
            ],
            [
                7790,
                7829
            ],
            [
                7829,
                7904
            ],
            [
                7904,
                8031
            ],
            [
                8031,
                8047
            ],
            [
                8047,
                8097
            ],
            [
                8097,
                8171
            ],
            [
                8171,
                8241
            ],
            [
                8241,
                8397
            ],
            [
                8397,
                8577
            ],
            [
                8577,
                8645
            ],
            [
                8645,
                8819
            ],
            [
                8819,
                8876
            ],
            [
                8876,
                8957
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                7,
                23
            ],
            [
                27,
                123
            ],
            [
                123,
                150
            ],
            [
                151,
                178
            ],
            [
                179,
                188
            ],
            [
                188,
                190
            ],
            [
                190,
                193
            ],
            [
                194,
                212
            ],
            [
                213,
                242
            ],
            [
                244,
                247
            ],
            [
                248,
                250
            ],
            [
                251,
                304
            ],
            [
                305,
                338
            ],
            [
                338,
                340
            ],
            [
                345,
                358
            ],
            [
                359,
                382
            ],
            [
                383,
                388
            ],
            [
                389,
                391
            ],
            [
                397,
                399
            ],
            [
                410,
                466
            ],
            [
                475,
                494
            ],
            [
                495,
                508
            ],
            [
                508,
                509
            ],
            [
                517,
                566
            ],
            [
                566,
                580
            ],
            [
                581,
                585
            ],
            [
                586,
                590
            ],
            [
                591,
                612
            ],
            [
                612,
                661
            ],
            [
                663,
                671
            ],
            [
                672,
                701
            ],
            [
                702,
                845
            ],
            [
                846,
                893
            ],
            [
                893,
                907
            ],
            [
                908,
                910
            ],
            [
                917,
                919
            ],
            [
                925,
                941
            ],
            [
                942,
                952
            ],
            [
                961,
                1013
            ],
            [
                1014,
                1050
            ],
            [
                1065,
                1109
            ],
            [
                1109,
                1166
            ],
            [
                1167,
                1195
            ],
            [
                1195,
                1210
            ],
            [
                1211,
                1226
            ],
            [
                1227,
                1256
            ],
            [
                1256,
                1380
            ],
            [
                1384,
                1411
            ],
            [
                1411,
                1469
            ],
            [
                1469,
                1545
            ],
            [
                1545,
                1547
            ],
            [
                1547,
                1603
            ],
            [
                1605,
                1647
            ],
            [
                1658,
                1697
            ],
            [
                1697,
                1712
            ],
            [
                1726,
                1736
            ],
            [
                1737,
                1826
            ],
            [
                1826,
                1827
            ],
            [
                1829,
                1844
            ],
            [
                1845,
                1914
            ],
            [
                1914,
                1966
            ],
            [
                1969,
                1992
            ],
            [
                1993,
                2011
            ],
            [
                2012,
                2034
            ],
            [
                2034,
                2047
            ],
            [
                2048,
                2062
            ],
            [
                2067,
                2109
            ],
            [
                2113,
                2240
            ],
            [
                2241,
                2331
            ],
            [
                2331,
                2377
            ],
            [
                2377,
                2441
            ],
            [
                2449,
                2499
            ],
            [
                2499,
                2641
            ],
            [
                2641,
                2753
            ],
            [
                2753,
                2756
            ],
            [
                2757,
                2790
            ],
            [
                2791,
                2823
            ],
            [
                2823,
                2886
            ],
            [
                2887,
                2909
            ],
            [
                2910,
                2913
            ],
            [
                2938,
                2940
            ],
            [
                2940,
                2991
            ],
            [
                2991,
                3067
            ],
            [
                3067,
                3069
            ],
            [
                3069,
                3084
            ],
            [
                3085,
                3093
            ],
            [
                3093,
                3180
            ],
            [
                3191,
                3192
            ],
            [
                3203,
                3239
            ],
            [
                3239,
                3242
            ],
            [
                3248,
                3253
            ],
            [
                3254,
                3281
            ],
            [
                3295,
                3306
            ],
            [
                3310,
                3346
            ],
            [
                3353,
                3400
            ],
            [
                3401,
                3410
            ],
            [
                3418,
                3426
            ],
            [
                3427,
                3462
            ],
            [
                3462,
                3484
            ],
            [
                3485,
                3488
            ],
            [
                3489,
                3564
            ],
            [
                3564,
                3605
            ],
            [
                3606,
                3609
            ],
            [
                3616,
                3620
            ],
            [
                3627,
                3658
            ],
            [
                3658,
                3661
            ],
            [
                3668,
                3678
            ],
            [
                3686,
                3687
            ],
            [
                3692,
                3703
            ],
            [
                3704,
                3711
            ],
            [
                3720,
                3722
            ],
            [
                3722,
                3729
            ],
            [
                3730,
                3767
            ],
            [
                3768,
                3771
            ],
            [
                3772,
                3850
            ],
            [
                3856,
                3858
            ],
            [
                3858,
                3866
            ],
            [
                3867,
                3905
            ],
            [
                3915,
                3984
            ],
            [
                3984,
                3986
            ],
            [
                3986,
                4044
            ],
            [
                4044,
                4045
            ],
            [
                4047,
                4083
            ],
            [
                4083,
                4091
            ],
            [
                4092,
                4160
            ],
            [
                4160,
                4163
            ],
            [
                4176,
                4212
            ],
            [
                4212,
                4226
            ],
            [
                4233,
                4282
            ],
            [
                4286,
                4299
            ],
            [
                4299,
                4332
            ],
            [
                4333,
                4430
            ],
            [
                4430,
                4549
            ],
            [
                4549,
                4596
            ],
            [
                4597,
                4606
            ],
            [
                4607,
                4610
            ],
            [
                4611,
                4651
            ],
            [
                4651,
                4653
            ],
            [
                4653,
                4695
            ],
            [
                4695,
                4785
            ],
            [
                4786,
                4863
            ],
            [
                4863,
                4931
            ],
            [
                4931,
                5000
            ],
            [
                5001,
                5029
            ],
            [
                5031,
                5042
            ],
            [
                5046,
                5086
            ],
            [
                5087,
                5102
            ],
            [
                5102,
                5125
            ],
            [
                5125,
                5140
            ],
            [
                5140,
                5142
            ],
            [
                5142,
                5186
            ],
            [
                5186,
                5213
            ],
            [
                5214,
                5255
            ],
            [
                5255,
                5301
            ],
            [
                5302,
                5336
            ],
            [
                5336,
                5456
            ],
            [
                5456,
                5471
            ],
            [
                5474,
                5509
            ],
            [
                5527,
                5528
            ],
            [
                5529,
                5592
            ],
            [
                5593,
                5642
            ],
            [
                5643,
                5644
            ],
            [
                5654,
                5662
            ],
            [
                5663,
                5673
            ],
            [
                5673,
                5674
            ],
            [
                5675,
                5724
            ],
            [
                5724,
                5744
            ],
            [
                5745,
                5750
            ],
            [
                5755,
                5771
            ],
            [
                5771,
                5834
            ],
            [
                5834,
                5871
            ],
            [
                5871,
                5917
            ],
            [
                5917,
                5934
            ],
            [
                5937,
                5955
            ],
            [
                5955,
                6021
            ],
            [
                6021,
                6035
            ],
            [
                6035,
                6037
            ],
            [
                6037,
                6053
            ],
            [
                6053,
                6114
            ],
            [
                6114,
                6116
            ],
            [
                6130,
                6132
            ],
            [
                6133,
                6136
            ],
            [
                6137,
                6165
            ],
            [
                6165,
                6169
            ],
            [
                6170,
                6240
            ],
            [
                6246,
                6286
            ],
            [
                6287,
                6295
            ],
            [
                6298,
                6305
            ],
            [
                6306,
                6332
            ],
            [
                6332,
                6334
            ],
            [
                6334,
                6383
            ],
            [
                6384,
                6391
            ],
            [
                6392,
                6404
            ],
            [
                6405,
                6475
            ],
            [
                6475,
                6508
            ],
            [
                6508,
                6561
            ],
            [
                6562,
                6599
            ],
            [
                6602,
                6613
            ],
            [
                6613,
                6616
            ],
            [
                6616,
                6659
            ],
            [
                6659,
                6681
            ],
            [
                6681,
                6711
            ],
            [
                6711,
                6742
            ],
            [
                6743,
                6746
            ],
            [
                6747,
                6758
            ],
            [
                6762,
                6770
            ],
            [
                6770,
                6835
            ],
            [
                6836,
                6853
            ],
            [
                6853,
                6908
            ],
            [
                6917,
                6920
            ],
            [
                6920,
                6932
            ],
            [
                6933,
                6937
            ],
            [
                6938,
                6997
            ],
            [
                6997,
                7060
            ],
            [
                7061,
                7068
            ],
            [
                7069,
                7125
            ],
            [
                7126,
                7130
            ],
            [
                7131,
                7133
            ],
            [
                7134,
                7141
            ],
            [
                7141,
                7143
            ],
            [
                7143,
                7148
            ],
            [
                7149,
                7220
            ],
            [
                7221,
                7248
            ],
            [
                7249,
                7256
            ],
            [
                7256,
                7370
            ],
            [
                7371,
                7380
            ],
            [
                7389,
                7414
            ],
            [
                7415,
                7424
            ],
            [
                7424,
                7457
            ],
            [
                7458,
                7491
            ],
            [
                7499,
                7501
            ],
            [
                7506,
                7521
            ],
            [
                7522,
                7524
            ],
            [
                7525,
                7529
            ],
            [
                7530,
                7536
            ],
            [
                7537,
                7564
            ],
            [
                7575,
                7576
            ],
            [
                7577,
                7649
            ],
            [
                7649,
                7661
            ],
            [
                7661,
                7664
            ],
            [
                7665,
                7710
            ],
            [
                7710,
                7758
            ],
            [
                7758,
                7763
            ],
            [
                7763,
                7790
            ],
            [
                7790,
                7829
            ],
            [
                7829,
                7830
            ],
            [
                7830,
                7831
            ],
            [
                7832,
                7882
            ],
            [
                7888,
                7902
            ],
            [
                7902,
                7904
            ],
            [
                7904,
                7991
            ],
            [
                7992,
                7996
            ],
            [
                7997,
                8008
            ],
            [
                8009,
                8026
            ],
            [
                8026,
                8028
            ],
            [
                8028,
                8031
            ],
            [
                8031,
                8047
            ],
            [
                8047,
                8062
            ],
            [
                8067,
                8097
            ],
            [
                8097,
                8171
            ],
            [
                8171,
                8241
            ],
            [
                8241,
                8287
            ],
            [
                8288,
                8370
            ],
            [
                8375,
                8397
            ],
            [
                8397,
                8410
            ],
            [
                8411,
                8577
            ],
            [
                8577,
                8643
            ],
            [
                8643,
                8645
            ],
            [
                8645,
                8672
            ],
            [
                8673,
                8760
            ],
            [
                8761,
                8819
            ],
            [
                8819,
                8876
            ],
            [
                8876,
                8957
            ]
        ],
        "row_chars": [
            [
                0,
                123
            ],
            [
                123,
                123
            ],
            [
                123,
                123
            ],
            [
                123,
                123
            ],
            [
                123,
                123
            ],
            [
                123,
                190
            ],
            [
                190,
                190
            ],
            [
                190,
                338
            ],
            [
                338,
                495
            ],
            [
                495,
                495
            ],
            [
                495,
                566
            ],
            [
                566,
                846
            ],
            [
                846,
                893
            ],
            [
                893,
                1109
            ],
            [
                1109,
                1195
            ],
            [
                1195,
                1256
            ],
            [
                1256,
                1411
            ],
            [
                1411,
                1469
            ],
            [
                1469,
                1547
            ],
            [
                1547,
                1697
            ],
            [
                1697,
                1829
            ],
            [
                1829,
                2034
            ],
            [
                2034,
                2241
            ],
            [
                2241,
                2331
            ],
            [
                2331,
                2377
            ],
            [
                2377,
                2499
            ],
            [
                2499,
                2641
            ],
            [
                2641,
                2753
            ],
            [
                2753,
                2753
            ],
            [
                2753,
                2823
            ],
            [
                2823,
                2940
            ],
            [
                2940,
                2991
            ],
            [
                2991,
                3069
            ],
            [
                3069,
                3193
            ],
            [
                3193,
                3193
            ],
            [
                3193,
                3193
            ],
            [
                3193,
                3193
            ],
            [
                3193,
                3193
            ],
            [
                3193,
                3193
            ],
            [
                3193,
                3239
            ],
            [
                3239,
                3462
            ],
            [
                3462,
                3564
            ],
            [
                3564,
                3658
            ],
            [
                3658,
                3722
            ],
            [
                3722,
                3858
            ],
            [
                3858,
                3986
            ],
            [
                3986,
                4160
            ],
            [
                4160,
                4299
            ],
            [
                4299,
                4333
            ],
            [
                4333,
                4430
            ],
            [
                4430,
                4549
            ],
            [
                4549,
                4653
            ],
            [
                4653,
                4695
            ],
            [
                4695,
                4863
            ],
            [
                4863,
                4931
            ],
            [
                4931,
                5001
            ],
            [
                5001,
                5001
            ],
            [
                5001,
                5001
            ],
            [
                5001,
                5001
            ],
            [
                5001,
                5042
            ],
            [
                5042,
                5087
            ],
            [
                5087,
                5087
            ],
            [
                5087,
                5102
            ],
            [
                5102,
                5125
            ],
            [
                5125,
                5142
            ],
            [
                5142,
                5142
            ],
            [
                5142,
                5142
            ],
            [
                5142,
                5142
            ],
            [
                5142,
                5142
            ],
            [
                5142,
                5186
            ],
            [
                5186,
                5255
            ],
            [
                5255,
                5255
            ],
            [
                5255,
                5336
            ],
            [
                5336,
                5456
            ],
            [
                5456,
                5474
            ],
            [
                5474,
                5474
            ],
            [
                5474,
                5529
            ],
            [
                5529,
                5529
            ],
            [
                5529,
                5643
            ],
            [
                5643,
                5643
            ],
            [
                5643,
                5724
            ],
            [
                5724,
                5771
            ],
            [
                5771,
                5834
            ],
            [
                5834,
                5871
            ],
            [
                5871,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5917
            ],
            [
                5917,
                5955
            ],
            [
                5955,
                6021
            ],
            [
                6021,
                6037
            ],
            [
                6037,
                6053
            ],
            [
                6053,
                6053
            ],
            [
                6053,
                6053
            ],
            [
                6053,
                6053
            ],
            [
                6053,
                6116
            ],
            [
                6116,
                6116
            ],
            [
                6116,
                6165
            ],
            [
                6165,
                6334
            ],
            [
                6334,
                6334
            ],
            [
                6334,
                6384
            ],
            [
                6384,
                6384
            ],
            [
                6384,
                6384
            ],
            [
                6384,
                6384
            ],
            [
                6384,
                6384
            ],
            [
                6384,
                6384
            ],
            [
                6384,
                6384
            ],
            [
                6384,
                6475
            ],
            [
                6475,
                6508
            ],
            [
                6508,
                6616
            ],
            [
                6616,
                6659
            ],
            [
                6659,
                6711
            ],
            [
                6711,
                6770
            ],
            [
                6770,
                6853
            ],
            [
                6853,
                6920
            ],
            [
                6920,
                6933
            ],
            [
                6933,
                6933
            ],
            [
                6933,
                6997
            ],
            [
                6997,
                7069
            ],
            [
                7069,
                7143
            ],
            [
                7143,
                7256
            ],
            [
                7256,
                7424
            ],
            [
                7424,
                7522
            ],
            [
                7522,
                7577
            ],
            [
                7577,
                7577
            ],
            [
                7577,
                7649
            ],
            [
                7649,
                7664
            ],
            [
                7664,
                7664
            ],
            [
                7664,
                7710
            ],
            [
                7710,
                7758
            ],
            [
                7758,
                7790
            ],
            [
                7790,
                7829
            ],
            [
                7829,
                7904
            ],
            [
                7904,
                8031
            ],
            [
                8031,
                8047
            ],
            [
                8047,
                8097
            ],
            [
                8097,
                8171
            ],
            [
                8171,
                8241
            ],
            [
                8241,
                8397
            ],
            [
                8397,
                8577
            ],
            [
                8577,
                8645
            ],
            [
                8645,
                8819
            ],
            [
                8819,
                8876
            ],
            [
                8876,
                8957
            ]
        ]
    }
}